{
  "AuthorID": "Sandeeonher…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
  "Posts": [
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 24, 2011 02:02AM Sandeeonherown wrote: I was told by my surgeon that a lumpectomy was as effective as a masectomy for small, grade 1 cancers....that there is no need to remove the entire breast. In fact, she was relieved when I told her \"Sorry. I have enough to work with here...you are NOT taking my breast. If I need to have reconstruction after the 6 month mammogram shows the all clear, then I will worry about leveling things up then\"....but I also did everything they told me....radiation (16 visits) and now tamoxifen. Because of the grade, the fact that I am, somewhat recently, single and need to work, and my margins were clear by a lot, we decided chemo was not for me (for the extra 1 or 2% difference I decided I was not going to pump myself full of chemicals and make myself ill for a few months). I may live to regret that decision but it is what I decided at the time and I do not regret it. I am exercising and eating well to keep the weight off with tamoxifen and an singing in a choir to keep my heart full and de-stress. But everyone is different...some want the breasts gone so they do not have to worry about it....I would worry more if I didn't have them because if it came back, what tissue would they have to work with? Weird logic, I know...but I am satisfied with my decision...surgery was in August and I am now 2 months into Tamoxifen. I do not regret my decision",
      "MessageIndex": 48,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 25, 2011 03:32AM Sandeeonherown wrote: Barry, cancer spreads and is as serious, as it gets..plain and simple. ..You have some time but the breast cancer navigator essentially said 'just get it done' ...but get opinions so that you can live with your decision, whatever it may be. The fear will pass and you will move forward one step at a time.",
      "MessageIndex": 65,
      "PostDate": "25/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 24, 2011 02:07AM Sandeeonherown wrote: Oh yes...and the surgeon removed 7 lymph nodes...all cancer free but better safe than sorry. Barry, you may want to bring in a minitape recorder so that you can play back what the doctors say. I recorded my meetings with my surgeon and radiologist and I found it incredibly helpful. That your surgeon wants to operate pronto is GOOD! They want to get it out of you before it grows or spreads...this is a good thing. Really...even if it feels scary. The first surgeon I met, who was originally to be my dr., was arrogant and said 'sorry. I am the best but I am going on vacation so you will have to have someone else\"..and while I did not like his attitude (another story), his assertion that he was the best made me very nervous about having someone else. I spoke to the breast cancer navigator about waiting until September and she essentially said \"You do not want to wait...get it gone\"..given she has worked in the field with hudreds upon hundreds of women in the same situation, I followed her lead...ended up with a wonderful, shoot from the hip female surgeon and had the cancer removed 2 weeks later. I simply said \"Take MORE THAN enough...make sure there are very clear margins. I will deal with being lopsided later...right now we are focused on getting this out of me\"...She did.... My wote would be 'just get'er gone'",
      "MessageIndex": 50,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 28, 2011 01:14AM Sandeeonherown wrote: Barry, a galpal of mine had under 2cm breast cancer, stage 1 7 years ago (at the age of 36) and she ended up having a lumpectomy, chemo and rads and then tami for 5 years . They factor in age, size, and, in her case, margins. My margins were wide because I said \"Take more than you need to. I have enough to spare!). In my friend's case, one side showed the margins were too close so they decided better chemo and kill it than the possiblity of it returning. I also worked through the whole event...I took the week off after my lumpectomy because it was planned already as my summer vacation and I had not idea if all the ;fatigue' stuff I had read about would affect me ...I worked through rads...would teach in the am, do a session right after lunch, drive across town for rads and then come back to give feedback to the teachers...not ideal but it was better than going home after rads and staring at the ceiling thinking dark thoughts, which was mor emy fear than the rads. I would say 'Get 'er gone' Barry. It is small now so don't wait until it is more of a problem if you can help it.",
      "MessageIndex": 72,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 29, 2011 10:33PM Sandeeonherown wrote: I also opted for a fully radiated breast rather than joining a ne wstudy in Canada that only radiates the site of the cancer and does it 2x per day for fewer days...I figured...if you are going to radiate me, do the whole area and zap those cancer cells ....I had excellent margins (I had told them to take a nice big piece of breast thank you very much) and all the 'right things'....receptor positive etc..excelt it had lobular features which means a 50% chance it will be found in the other breast within about 14months, according to all the research I have done and my surgeon and oncologist and radiologist were all in agreement.....but I still did not feel like taking a chance and just radiating the area it was found in. So I opted for the tried and true method....",
      "MessageIndex": 86,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 24, 2011 02:37AM Sandeeonherown wrote: barbe1958...yeah. I understand the logic of the masectomy....it just did not figure into my thought process....I have no idea why it didn't occur to me....vanity? fear? thought that since it is small and I have a lot of 'extra tissue' just get rid of it and let me get on with it? No idea...doing my best to not regret the decision ....only time will tell. For those of you who did or are having masectomies, I believe you are the most courageous people I have ever met.",
      "MessageIndex": 52,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 27, 2011 05:20AM Sandeeonherown wrote: Good luck this week on your surgeries...the key is to take care of yourselves and make the deicsion that is right for you. My thoughts will be with/on you this week.",
      "MessageIndex": 68,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 23, 2011 08:12PM Sandeeonherown wrote: Yeah....not my usual take on things but I figure it is beter to be realistic with this issue...I actually was not surprised that I ended up with breast cancer, despite having no indicators ...my only fears re. health have been my eyes (my mom was essentially blind because of diabetes) and breast cancer (because I am a small woman with large breasts and they are such a part of my physical identity I guess)...but I wear glasses and have survived this far with breast cancer so...no point in worrying about something I had no control over. Onwards and upwards!",
      "MessageIndex": 128,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 24, 2011 09:52PM Sandeeonherown wrote: Ah well..the wrinkles are an indicator that you have been living your life...consider them a map...and as for the stats...I guess the further out we get from our treatment, the older we get so it makes sense...but it could also be becaus eas we get further away from the crisis, we return to our old habits and stop taking such good care of ourselves,,,I plan on keeping the gig going by taking care of myself afer the 5 years too.",
      "MessageIndex": 130,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 15, 2011 09:48AM Sandeeonherown wrote: I am only 6 months into this journey but my radiologist said \"You will be doing monthly breast exams for the rest of your life and will need to continue with mammograms anually\"...no one is saying thwe word cured and I am not asking. I was under 1cm and had surgery, radiation and now Tamoxifen....I simply want to hit the 6 month mark, be told that I do not have breast cancer in the right breast (I had lobular 'features' in the cancer in my left breast so there is a 50% chance it will turnup in the other breast in the nex 14 months...statistically speaking....but with surg. rad and tam...I have a 925 chance of not seeing this recur. I like those odds....I spent my life making sure my salt intake was non existent and being heart healthy because that is how my parents went....but breast cancer? Not a sign of it anywhere in my near or distant family members...so it only tells me that life is random....cell phone tower near my home for 7 years? checmicals over my years of travel? Random magic? Don't know and don't care....As far as I am concerned, the cancer was removed in August....I will worry about it recurring when or if it recurs. In the meantime, i am exercizing, eating well, rarely drinking, doing my best to laugh a lot and trying to love my life...oh yeah....and I start meditation this Wednesay! I agree with you lago...focus on what is in front of  and they days we have. ....once I know in June if I am cancer free for now, I will be making a big move....preparing myself for whatever happens in 6 months time....so I guess really...I am taking my life 6months at a time... As my trainer says, \"Anyone can do 4 more\"....I am going to aim for \" Anyone can do 6 more\" !!",
      "MessageIndex": 115,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 23, 2011 07:51PM Sandeeonherown wrote: Living our lives mindfully, one day at a time means even if we do not hear the word 'cured', we live our lives well. I am assuming everything I have done is to keep cancer at bay ...hoping this was a 'one off' situation and that I die in my sleep or get hit by a bus some day...but I am also preparing for th efirswt 6month mammogram check up in June to say ' sorry. it is in the other breast'...just in case. I have ALWAYS been a rose coloured glasses kind of gal...my ex-partner was always a half empty, people will disappoint you kind of guy...but I persevered with the pink-hued glasses. This event (well, actually, his leaving 10 months before this event), threw me for a major loop but my glasses are now perched back on my nose. I had a mom who was diabetic with lots of complications (and death at 53) and a father who had numerous heart attacks and open heart surgeries (but lived to his mid-70's)...it is all a crap shoot really....avoiding salt, ensuring I exercize..doing all the things necessary to not have the same health issues or high blood pressure and I end up with breast cancer? All I figure I can do at this point is live my life fully...exercise, eat well, surround myself with people I love who accept me and keep things in perspective...I would settle for 'cancer removed and eradicated' in lieu of 'cured' Sandee",
      "MessageIndex": 126,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 10, 2011 08:57PM Sandeeonherown wrote: Lilmissstar- I had no symptoms....no one could feel the 1cm lump- not me, not my dr. , not the breast surgeon ..It was small bu deep....I just went in for a regular mammogram and it showed up as a spot. You have been under a lot of stress, it sounds like....I suspect my cycles were off at the time of my parent(s) deaths too...it is a stressful time. I would book a day, and go to your one stop/shop and git 'er done...beter knowing something than worrying about it and fearing it. if you need us, we are here.",
      "MessageIndex": 4,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767326",
      "Title": "So many questions... LilMissStar jo1955"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 7, 2011 06:52PM Sandeeonherown wrote: Meece- I had a meltdown two Fridays ago and to keep the cry going, I watched 3 episodes of Private Practice...so maudlin and chintzy but it got the tear ducts working in full gear anyhow...felt good to just weep out some of the anxiety, you know? chick flick it was!~",
      "MessageIndex": 7218,
      "PostDate": "07/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 8, 2011 09:56PM Sandeeonherown wrote: Meece- hope there is a pocekt somewhere for me to join you Sheila- 6 years..an inspiration for sure....and going strong!",
      "MessageIndex": 7239,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 9, 2011 10:33AM Sandeeonherown wrote: Meece- congratulations on the good part of the news!!!!! A relief,,,,,,,,,,,,,,,,a few things less to worry about now...as for the 4 oèclock position and mor etests etc...ok..not as great but it is information and it is easier to process anything with a bit of information. Nothing you can do about it right now except live your life sister!...and be happy they are scheduling you to keep an eye on things....keep a physical touch on your 4 oèclock so if need be, you can get in faster than 6 months....in the meantime, know we were thinking of you and breathing breathe into you when you were in that blasted machine! Determined- welcome! Annette- gorgeous here in halifax too...just woke up and am having coffe...totally pooped...big bags under my eyes so....going to have another half cup of java, shower and take a slow walk to the shoe store....need to have some walking shoes that I can wear to school as it is 95% no boot season now!",
      "MessageIndex": 7258,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 12, 2011 06:05PM Sandeeonherown wrote: Ducky- dear god...never occurred to me..going in through one organ to get to another and then coming back out the first potentially bringing cancer cells with it....wow....good for you for even thinking of it! More people need to be involved in studies..but studies scare a lot of people so you know..go with what you know. I did not want to be on a new study where they onlyradiate the part of the breast that the cancer was in ..it would have been only 10 radiation dates...but I said no to that one..radiate the whole thing....git 'er gone all over was my thinking but with the stent for my heart attack, I have agreed to a study. My Gp says if her patients could be on this medicatino for life, she would say do it so even if I only get 1.5 more years on it, if it is a life saver and does not mess me up in other ways, I will do it.",
      "MessageIndex": 7322,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 16, 2011 08:21PM Sandeeonherown wrote: Jo- I decided to just go in your jacket pocket. I am pretty small so no one will notice",
      "MessageIndex": 7405,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 18, 2011 09:43PM Sandeeonherown wrote: Sherry- I read on a nother thread that all went well today. YAY!!!!!! you are the first of us (I think) to go and have your post rads mammogram done so you are paving the way sister! I will try the ice thing..I took the wire out of a damn bra this morning and No SHAPe left to it and OMG my breast hurt tonight when I took off the bra..back to the sports bra for me...but will try the ice. Don't want to do any more medication so the anti-inflammatory ..maybe not..but will try the ice... Annette- breathe my dear...breathe!!! a bath..a glass of wine?...a smultsy magazine? a sappy tv show?.....breathe... Bren/Melmes- my best gal pal went through this journey 6.5 years ago at age 37. They whipped her through as fast as you folks....;umpectomy, chemo, rads, tamoxifen ...hey did chemo on her because her margins on one side were not as good as they wanted but like you she said \"I am 37...I have two young daughers at home. Give all to me\"....she worked right through chemo and rads...drove 1.5 hours to and from the hospital for her rads for about 22 sessions....she was tired the first chemo weekend, a bit nauseated the second, lost her hair this third so shaved her head as a family event and stayed in bed her fourth weekend ...and then she got on with things....so it is doable. I think it really depends on the chemo cocktail....and your own system. As for rads...keep a huge bottle of aloe vera handy and soak yourskin the morning of, as soon as you get out and whenever you pass by the bottle. I did not have any reaction until after rads was over...none at all with 16 sessions .....aloe very has worked beautifully for many of us. In the meantime, welcome to a very supportive group. Sandee",
      "MessageIndex": 7453,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 20, 2011 07:09PM Sandeeonherown wrote: djwraw- sorry you have had to join us...glad you have had the surgery and are ont he road to recovery....get a big bottle of aloe vera for the radiatoin joureny and slather it on morning,noon and night and you will be ok....glad your family, friends and work mates are supportive. It helped me through for sure",
      "MessageIndex": 7515,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 21, 2011 09:27PM Sandeeonherown wrote: Melmes..so sorry....oy!....but if they are saying re-excision to move the margins, that is extremely hopeful....they want to give you the best possible chance of knocking cancer on its ass so....not a bad thing....and as for receptionists etc...they are tentative....not supposed to say things over the phone, can't read people's reactions etc.....I asked my dr to simly call me and tell me if it was cancer last july rather than having me drive out ther,e sit in a waiting room and then have to walk out upset and drive back....I told her\" I am at work. I have friends around. Call me either way so I won't freak out that you have called me in the first place and jus tell me either way. If I need support, I will open my office door and ask for it\"...and she did...and I did and it was ok.",
      "MessageIndex": 7532,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 24, 2011 07:54PM Sandeeonherown wrote: Brenilea- ditto on the aloe...I bought a huge bottle of it and put it on morning, noon and night....though I only had 16 rads...I was actually not physically tired from it at all...my rad oncologist said he had not expected me to have any because I am a very energetic person and very positive....I was emotionally spent though....I went to work every day..taught a teacher training course in the ams and gave feedback, saw students and dealt with their issues at lunch and then would go to rads inthe pm...and usually return to work for another 2 hours...saw me through for sure....bu by the end of it, I was emotionally spent and not feeling very forgiving when more than the usual was expected of me (lost my mind on my boss the 2nd last day...a shining moment in some ways...and a lack of control in others...a clear indicator that I had had enogh)...bring a book, music, a friend..I brought a colourdul scarf/shawl with me each time..helped me to feelless 'exposed'....good luck with it....",
      "MessageIndex": 7569,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 26, 2011 06:11PM Sandeeonherown wrote: re. avatars and peoplepeepers...I have received 3 different spam messages from people trying to sell cures for cancer..have sent them to the moderators and they have blocked them immediately..bu tit does say that anyone can log in as someone if they shold so choose...no idea why they would want to but....there you go....is a bit disconcerting.",
      "MessageIndex": 7645,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 4, 2011 10:11PM Sandeeonherown wrote: Gaylor- welcome...had to say that before I fall asleep..and anyone here will tell you htat once I have taken my zopliclone, my messages end up with weird spelling so forgive me in advance ladies! Jo-oh my....I think you and I and our cancer sistahs are allowed to tell ourselves to get off the pity party ( i tell myself that if i have a feel sorry for sandee day that goes on into the next one...) but for someone else to tell you? uhhu nope...she does not get to say that..you are allowed to have pity days....you had a crappy weekend so you are entitled. I too sat on my floor and wept with a friend...booked my ticket for a 5 day visit home and was suddenly terrified...what if I have a heart attack on the plane????/I did not feel immediate fears with BC...and I am so damn tired...this is soooooo UN-Sandee like...has me very frustrated to be honest.,,,,so instead of rising above it, I let myself cry with a friend...it helped to get a hug while weeping and just saying \"I am afrad...I am overwhelmed....\" without saying \"I wan advice!\"...I didn't/./just needed to weep with someone;s arm around me. So yeah...I get it. 24 hour rule JO! Annette- good for you. You are right. I took a bubble bath last night. it helped...tonight....muesli and milk will do the trick . thanks for all the food ladies....cant to come to a potluck on Sunday in Halifax? you can bringthe waiter too:)",
      "MessageIndex": 7796,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 5, 2011 07:40PM Sandeeonherown wrote: Michelle- holding your hand today.....so sorry to hear about your friend..and medical frustrations",
      "MessageIndex": 7832,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 15, 2011 08:37PM Sandeeonherown wrote: Ducky- ok...damn it...you made me cry again! Beautiful....that is what family should be like:) And good for your kids saying \"I am taking you!\"....they are doing it as much for themselves as for you because they need to be there....thank you for giving them what they need...I know how hard it is to give in! BRAvo!! Glad you had a good weekend...you are half way through CDucky..you CAN DO IT!",
      "MessageIndex": 7995,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 31, 2011 10:12PM Sandeeonherown wrote: jo- i willjoin the party in yourpants ( that sounded so wrong but you know what i mean) and sue - i will indeed check out the site. thank you",
      "MessageIndex": 8225,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 6, 2011 07:52PM Sandeeonherown wrote: Annette- sent you a PM. hugs to you granny- I have an appointment at the lymphodema clinic next week. The massage therapist I went to who specialises in it does not think it is lymphodema (yet) but I figured I will tag team it..got in to see her before the other appointment so I will take al the help I can get. If I need to get a compression bra I will....got to say..miss the underwire ones something awful!!!!!! Have my first mammogram post-surgery etc tomorrow at 2pm. Send up some positive thoughts k? I can admit to you all that I am scared sh**less but will go in with a smile on my face and music blaring in my mp3 player and hopefully no one will be the wiser...who the hell am I trying to fool here. WE all know I will get in there and start to weep and let it out....I always feel sorry for the poor medical staff I weep with though...they are generally very surprised and when I say ' oh ignore this..it is jus me releasing the fear\" they look at me a bit oddly...ah well...at least the mammogram technician will be a woman! and I will be sure to let her know it is my first post-stuff!",
      "MessageIndex": 8380,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 7, 2011 10:09PM Sandeeonherown wrote: As for the Gardisil etc. I have a galpal who has also said no for her daughters...took her daughter to the dr. to go on the pill and have a chat baout birth control and then sat her down and talked to her about condoms and safe sex and sexual health. Too many if's....",
      "MessageIndex": 8405,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 18, 2011 10:03AM Sandeeonherown wrote: jpthelen- welcome...scary times but....my dye test was done the day before and then the morning of they put the needles in to locate the cancer again..they took SNs and 6 auxiliary nodes during my surgery.Think since I had told her to be sure wih the breast cancer and take a big piece that she did the same with the nodes...none had cancer.. I was told that I had 'idc with lobular features'....scared the crap out of me at the time actually....lobular features..dear god it can go anywhere, was my thought at that time...but it has been 9 months and I am calmer...can no longer be on tamoxifen and I am ok with that... Allenan- I have not experienced them having to go back in for clear margins. When I had my surgery, I told my BS \"Take a big scoop! I have enough and if you have to fix it later and even up the other one, I would be happy to become a C cup at that time!.I am not coming back on this table\"....she said when she was doing the surgery she was a bit concerned about the amount she was going to take but then remembered my saying' take a big scoop!' and she went for it....My oncologist reassured me in April about the lobular features and the likelihood of my getting cancer again (low) . I did not have to have chemo. If hey need to revisit the site to ensure he margins are clear, that is a good thing for you, not a bad thing...it means hey want to ensure your health. Don't loe the faith...positive thinking helps...24 hour rule my dear...one day at a time.",
      "MessageIndex": 8527,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Aug 23, 2011 10:22PM Sandeeonherown wrote: gmafoley, mimi- sending love and calm your way. I think of life in terms of fish....I know that sounds odd but I can see them swirling around me and others....it's like this....every day , fish swim past us..sometimes we reach out and scoop them and sometimes we don't...sometimes the fish are bright coloured so we recognise them for what they are and other times they are pale and hard to recognize or notice....but they are there...opportunities are always there but are sometimes are hidden. same sentiment but a different vision as those above. Keeping you close tonight and believing things will turn around for you",
      "MessageIndex": 9258,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 23, 2011 09:07PM Sandeeonherown wrote: Sherry- 24 hour rule my friend....24 hour rule....you can only do one day at a time so breathe..remind yourself that you are oooh so very strong...you have come through a difficult time and you will get through the next days....you will tell your mom when it is time and that might be tomorrow or it might be when you have the full results back...for now, focus on sending your dad love to make the journey easier and breathe my friend...breathe",
      "MessageIndex": 9948,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Nov 1, 2011 10:34PM Sandeeonherown wrote: you ladies are rocking...smeday read this string of messages from the eyes of a group of pals who are not cancer survivors....we have been through a lot!!! give yoursdelves a huge pat on the back....my goodness,hugs all around and good night!",
      "MessageIndex": 10006,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jan 28, 2011 11:16PM Sandeeonherown wrote: Great news.!!!!! Fear is the scariest part of thi swhole adventure in many ways..but it helps us to reach out to others, to be offered up thoughts, light and prayers ....kind of the bright side of all this horrible stuff, hmm> ? so glad it went in your favour!",
      "MessageIndex": 20,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/763983",
      "Title": "i am soooo scared! tpetrone Sandeeonherown"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 15, 2011 10:46PM Sandeeonherown wrote: melmes- welcome!! Great attitude..when  had my lumpectomy in August I told my surgeon \"to take a HEALTHY portion...we can always go back and fix he other one later....I do not want to come back here!\"...and while I am dealing with scar tissue / breast pain now....I know it was for the best. Letswin- great to hear you are going to do he aloe vera...makes a heckuva difference...I was good right up until rads #14...they kept commenting on how well my skin was doing bu I used aloe vera every day ...btu the wo weeks following rads, my skin became red and itchy and burnt so make sure you take the cortisone cream they offer you when you are done rads, ok? and keep the cream and aloe vera on it when you are finished rads...it will make those two weeks easier...and a sort t-shirt or tank top instead of a bra with elastic under the boobs",
      "MessageIndex": 7375,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 16, 2011 08:25PM Sandeeonherown wrote: Ah granny.....there are two corners to every pocket so we should be all right:)",
      "MessageIndex": 7410,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 22, 2011 07:32PM Sandeeonherown wrote: Ducky- I had only one guy doing my rads and a few different women...they all saw me bawling (day 1, 2, 6, 9 and 15).....just emotionally drained those days....related to whether or not my ipod was working acually...Dolly PArton Christmas carolls did me in one day so they never played them again...on day 13, I forgot to plug in my machine so I said ' no worries. I will just put the plugs in so I can't hear the damn machine\"...he said \" we have other music...and started reading it off..we decided on the tragically hip....on my last day, I bgouht them home made candy and then made a cd of 'music for radiated mamas'....and sent it to Marc with a thank you....I know they have seen it all....but I felt soooo exposed....the shawl really really did help...and being perfectly blunt when I entered the room each day. I would warn them \" this is an emotional day...I am a basketcase so I will likely cry through it...just ignore me\"...and bless them, they did exactly as I asked....",
      "MessageIndex": 7549,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 25, 2011 09:42PM Sandeeonherown wrote: Jo - I remember you saying that! I agree with you...which is why mine is now a sunset. Perhaps when I do not feel so raw..or get through the first mammogram I won't feel this way but there you go....I seem to change how I feel on a daily basis. In any case, it was / is a great picture!",
      "MessageIndex": 7596,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 28, 2011 07:45PM Sandeeonherown wrote: Debbie- seriously??? I would bring it to the radiologist for sure and I would also call the clinic I had the mammogram at and would ask them for an explanation.",
      "MessageIndex": 7666,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 5, 2011 06:59PM Sandeeonherown wrote: Kate- Glad it helped..one day at a time and let your emotions flow..I think we were allllll having a weird day yesterday...and today I had to tell someone that the students are all complaining about her class and I will not be putting her in the EAP class next term....the part of my job that I hate!... Sherry- I have dumped my camera in salt water before...took it apart and let the pieces dry out...it worked but not as well as it did before that...the rice sounds like a good idea,,,",
      "MessageIndex": 7829,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 5, 2011 07:04PM Sandeeonherown wrote: Kate/Susan- such a journey, hmm? Jo is right..this is a supportive group. you will find many of the same folks on other threads too...wait until you join us for a pillow fight some Friday night! Kate...sorry about the fella...sounds like you are better off dealing on your own...if he cannot handle the lumpectom, imagine how he would be in a 'real crisis' (use thick sarcasm here when reading that statement)...seriously my dear....if he cannot be there for the shape shifting and new bra dilema, you are better off with him as comic relief! Can't imagine having to find new dr's at this point. I did it once to find a new GP....and it is stressful!!! Maybe someone at your local BC group will have some positive recommendations.",
      "MessageIndex": 7830,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 9, 2011 12:50PM Sandeeonherown wrote: Melmes...good luck tomorrow~~~~: Having some idea of what to expect makes it easier somehow, you know? good for you. Keep breathing:)",
      "MessageIndex": 7918,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 10, 2011 08:01PM Sandeeonherown wrote: Ducky- good. you are nearly there...how many more sleeps?..as for the vacation....I get it. Different perspective sklightly form these other gals but one your own kids might give you..I cancelled my vacation because of the heart attack ...I reallly really needed (and still need) a vacation...and you know what? My friend was very understanding and grateful I was alive for us to try it another time. I bet if you mention the 7am rads to your daughter, she will be happy to wait on you....I know it sucks...but try to remember to that this lousy machine is also saving your life...I know it is hard to feel that ..you just want it done already...But you will get through this..you will! and if you send it up to the universe and the people it involves, they might just get creative my friend and give you some ideas or surprise you with their response. This time it is about you...and making sure you are there for other gevents too....As for the graduation, I bet they will give you one 4 day weekend .... you have a helluva a lot of them...one weekend off should not hurt! Just a different perspective in case your son passes the word and your kids freak out on you.... Valjean/Sherry- thanks! I am going armed with my 6 or 7 uestions yet again..where do all these questions come from? Don;t think the vitamin D is in yet but when I called on Monday , they said the others are in but th edoc did not want or need me to come in (well, I have to because I a swollen and have some heart questions bu t good to know that there is nothing on the blood work that is alarming!) phew",
      "MessageIndex": 7938,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 27, 2011 05:22PM Sandeeonherown wrote: Sheila! I am so sorry to hear of the loss of your dad and aunt...having one person you love pass away is one thing...having two die ...ragic. My heart is with you.",
      "MessageIndex": 8135,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 2, 2011 09:44PM Sandeeonherown wrote: Jo/Chabba/Annette- i would a. tell the technicians how scared you ar ebecause you are still really hurting from rads...I expect that will do the trick....bring a friend or give yourself a treat afterwards...coffee, a 20 minute break before you return to work...a good cry in the car..whatever you need....I will split myself into tiny pieces...might just sit on your shoulders instead of your pockets so I can remind you all to breath when you need to....ok the rest of you...I have staked out the shoulders! hugs ladies..breathe!",
      "MessageIndex": 8272,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 8, 2011 07:02PM Sandeeonherown wrote: Annette-You are right....no point in trying to read her especially as for most of it, I was looking away from her and trying to keep the tears from landing on my being-xrayed-boobs!..and I am the same as you...if it has not been on the market for a period of time I think is acceptable, I am NOT INTERESTED> My cardiologist was talking about my heart meds ( you know I asked when I can come off the damn things) and she said essentially, \"you will be on th easpirin for life..the plavix for a year and the blood pressure and cholesterol pills for life..if not these then something they come up with that is better in the future\" (and my thought was....and I will NOt be a guinea pig for new meds so they will have to have been tried out for some time before I switch over!) Jo- I am jumping back into a pocket bu tI will wait on Friday as th eweather is finally nice in Halifax..I will be there for sure Saturday though! Gardisil, the pill...my old gP had told me it was safe for me to be on the pill until I stopped having my periods....really? I went to a naturopath to get me off of everything as in the end, I could not tell if I was perimenopausal or had stopped because of the pill....now I wonder...will not get any answer but the wondering continues Valerie- thank you....thought I was fine with it..trying not to read into anything and assume she is the consummate professional giving nothing away either way...not her job....must be a hard job sinc emost of us in there are on tender hooks!",
      "MessageIndex": 8422,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 8, 2011 08:57PM Sandeeonherown wrote: I am with you Jo...24 hour rule....We need to get tshirts made up!we can get through 24 hours....we can! Hugging you and sending you lots of positive thoughts...I am going to go and row tomorrow night and let some of my fear out..until then, icing my hip (as opposed to icing the cake I iced this am!) and going to bed!",
      "MessageIndex": 8428,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 10, 2011 08:19PM Sandeeonherown wrote: Jo- wow...fast worker or whatI you go girl  samsue- straight dark coffee for me. meet you in the waiting room! thanks!",
      "MessageIndex": 8445,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jul 23, 2011 10:07AM Sandeeonherown wrote: jtderyan- I did not deliberately say no to tamoxifen but had a heart attack 4 months into it so they have said no on my behalf...I still have estrogen firing so there are no other chemical options for me...so I am flying without a net at the moment. Am living mylife..doing all that I can to be concinved it will not come back. I did surgery, told her to take a big piece to get it al ( she did and I am now a good deal smaller on one side but still have the breast) and had the Canadian protocop for rads...16 of 'em....I am convincing myselt that that is enough.",
      "MessageIndex": 9037,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Aug 22, 2011 10:10AM Sandeeonherown wrote: Thanks ladies....your words help as always...sleeples nights are likely not the best scenario for a stress test but the wind is out there and it is sunny so that will help...and tonight's paddling will get me through. Roller coaster just doesn't end, hmm?",
      "MessageIndex": 9250,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 11, 2011 07:30PM Sandeeonherown wrote: Ducky, Granny, Annette....our diagnoses are almost identical on this thread and such different results, hmm? If diet and exercize don't work and I get scared down the line, ok...AI' are possible but for now I am going to get myself a juicer and follow what Kris Carr and others talk about in Crazy Sexy Diet...similar to the yeast connection diet, gluten free etc...except gives tips 9ie juicing) on how to get the number of veggies into me that I need....can't look at my hands and see my dad's.....which is what I see right now...2 months ago I could close my fists...and had energy for the gym. Right now....right now I would rather have quality than quantity....at 49 or 71...no one is saying 'do it!...the numbers say...'....instead I am reading low percentages and I choose to live right now....as best I can....lowering my stress at work and play should help I hope....thanks for the thoughts ladies. I soooo apprreciate it. Anette. I understand...Christmas can be hard..thisis the firs time in three years I have put lights up...and hauled out my favourite decorations...i have decorated a wooden, triangular shrub protecor my ex-ftherinlaw made me for our 'potential' garden....it sat inthe basement for years...I moved it here with me last fall and since it is Xmas tree shaped...that is my 'go green' plan..sustainable and reusable!...and I am filling the season with friends that I love and cat snuggles in between...let the healing begin. Hope your heart feels lighter soon...",
      "MessageIndex": 10460,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 13, 2011 06:15PM Sandeeonherown wrote: hugs back sheila. thanks",
      "MessageIndex": 10516,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Feb 9, 2012 11:09PM Sandeeonherown wrote: might be in NYC for my 50th at the end of March..if I am, will let you know Annette!",
      "MessageIndex": 11388,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 9, 2011 10:39AM Sandeeonherown wrote: Anette- here too!!! Boots yesterday and I could wear sandals today...but need a pair of shoes for school as inthe fall, when I moved and was post BC surgery, I threw out ALL things that hurt me...including all my shoes with heels....so....no shoes now.",
      "MessageIndex": 7260,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 9, 2011 10:50AM Sandeeonherown wrote: yep....my calves were killing me ...really loved the heeled sandals but my foot guy sad it was causing my tendon to shrink so I was getting relief when I wore them an dthen my legs would be aching afterwards...better just for me to go flat....I am also short (4feet ten and a half inches) but only a 6.5 shoe",
      "MessageIndex": 7262,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 17, 2011 08:33PM Sandeeonherown wrote: granny/samsue- I wear my gorgeous underwires occassionally but am still swollen...surgery in August and rads finished mid-December...so I wear a piece of flanel in the bra across the nipple so that at least I don't have a seam across the nipple when I take my bra off...but....still swollen ....swollen enough that my breasts are still rlatively close in size..hate to think what it willl be like when the welling goes down. Thanks for the info on Lymphodema Binney! My drs also said not to worry about it unless it crops up as a problem....",
      "MessageIndex": 7437,
      "PostDate": "17/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 20, 2011 11:15PM Sandeeonherown wrote: Samsue- my oncologist tested three things in my blood to find out if I am menopausal ...one of them was my esrogen level...out of 330 or 333? I beleiv eit needs to be under 30 to be considered that you are menopausal...I was 111 last November....",
      "MessageIndex": 7519,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 24, 2011 11:07AM Sandeeonherown wrote: Thanks Annette...love the tshirt deborye! Sometimes youth hang out on the street corner by the library and give out free hugs...maybe I should pop down there to see if I can get one in person! all will be well....just tired:) thanks for the bunny Annette!",
      "MessageIndex": 7563,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 26, 2011 06:20AM Sandeeonherown wrote: ok annette- sorry about the bunnies...bring both dresses and decide inthe big hotelmirror...always better anyhow. Make sure you were noe with an inner pocket as I want to hang out and hear you...or hell, if you are introducing us, I will wear my fancy red dress and upstage you! (of course it will be the mini-me version...anynoe on this stream remember the show Land of the giants? Think it was only on one season when I was little but it has a massive impact on me...it is what I imagine when we tell each other we are in the other person's pockets...strong visual! Good luck!",
      "MessageIndex": 7620,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 26, 2011 06:09PM Sandeeonherown wrote: MELMES- We have got your back..come here to say whatever ...whatever you need to say...it IS hard to stay positive some days...and at the end of the day when we are tired or disappointed with our bodies or both...yeah...emotionally it is hard. My breast is also sore...it is my left also...add a stent to that side of my body and I feel pretty damn betrayed by it...I am ambidexrous so use both arms a lot but I find that my breast is sorer on rainy , damp days (today),or when I wear certain bras (even the nowire one I wore today which somehow does not feel supportive right now)...some days it is just sore for no reason..healing where I cannot see the healing happening? scar tissueforming? I massage every day to ensure it stays supple but ....some days I jus want to cry because my new normal....well, it just sisn't what it was 10 months ago. So I get it... As for relationship issues....I am rebuilding my relationship with my sister as a result of breast cancer and heart break....and reactions from her about it and me about it...my ex partner is feeling guilty he is not here and is experiencing his own crap and can't be here more than he can and I just want to run away...far far away....so I yeah....it can be hard even if you are a sunny personl to stay sunny all the time..that is what these threads are for...to let it out so you can carry on. Hope the rest of he day went better for you.",
      "MessageIndex": 7644,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 26, 2011 08:48PM Sandeeonherown wrote: MELMES- sosoooosooosoooo great!!! write this stuff out on cards and post it wherever your desk is so on the days you feel fearful, yo uare visually reminded of what he said!!! Such great news",
      "MessageIndex": 7649,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 29, 2011 05:56PM Sandeeonherown wrote: Debbie- I had surgery August 17th and my boob also is 'uplifted'....nipple aimed in different direction...bothered me at first but now I could care less. ...it was swollen to the size of the other one (despite a large piece being removed) but I noticed last week that there is a noticable difference in boob sizes now....it is making bra shopping interesting....they are either too big on one side or too small on the other..Keep putting aloe vera on your skin..it will help with the itch and the redness and overall impact of the radiation",
      "MessageIndex": 7675,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 29, 2011 06:37PM Sandeeonherown wrote: talcum powder also helps under the boob...or corn starch! I wore a cotton sports bra and found a great camisole with support built into it (Walmart)...called Cupid...$14.00....it was my lifesaver! Goooood luck!",
      "MessageIndex": 7679,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 2, 2011 09:28PM Sandeeonherown wrote: SusanHG- good they took a big piece...me too (7cm,x 5cmx2cm! seriously)...but it means they had excellent margins so.....I was also told it will be a year before we really know...I was swollen initially so had no idea really...the operated on breast is higher with a nipple facing north instead of south....but I can live with that.....just waiting for my body to ;fill in the hole' and see what the results are....My surgeon and I discussed making me a c when this is all over....have not been a C in at least a decade so that would be interesting...and easier in the gym! one day at a time Susan!",
      "MessageIndex": 7736,
      "PostDate": "02/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 8, 2011 09:48PM Sandeeonherown wrote: pink candy- our prognosis is similar...IDC, <1cm. grade 2....heart consditions in family history...I had a heart attack and th e cardiologist and oncologist believe it may have been hastened along or caused by tami...oncologist has taken me off tami and has told me not to worry...we will take your blood again in July and see if you are post-menopausal and if so, look at the options then...btu he said that until that time, I was ok to not be on it....dealing with th eimmediate issue of the heart was more important....why are you thinking of staying on tami for 6 more months if it has caused you this many side affects and you have heart history? Has your oncologist suggested you go off of it or is it because of your skin etc? Ducky- what are the potential side affects from Femara? Seyla- While I know this day is filled with sadness, it is also a day to celebrate that you are here...I hope your day was filled with gentleness and love Melmes- I understand....every pain I feel these days, I think I am going to wake up again at 2am in the middle of a heart attack...someone said to me today \"gee..oyou are lucky you woke up on the last one\"....which was meant to be reassuring...but it has managed to become a brain workm rotonight and despite how fatigued I am...I do not really want to go to bed....I am afraid to not wake up....not THAT is ridiculous....your concern re. cancer haveing spread is one we all fear my dear...really....I tell myself i will all be fine ...no point in worrying but we do....but one more thing...if there does ever end up being something else down the line, you will be able to handle it...you have already handled the scariest thing in the world and you have managed very well....so....well done and continue the 24 hour rule:) michelles idea of getting some anti-anxiety meds is a good one....you need to sleep and be able to get on with getting on while you wait ...hugs!",
      "MessageIndex": 7904,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 9, 2011 05:46PM Sandeeonherown wrote: Ducky- good for you..we HAVE to be our own advocates...we really do...and you are an inspiation! How are the rads going ???? you are almost half way through!!  I have a GP appointment on Wednesday am...my blood work is in but they have not called me so I guess that means all is well or they were waiting for the vit D levels...I have some heart and energy questions for her so I am going in this week...also they only gave me a 2 month prescription of one heart drug but 3 months of all the others....makes no sense to me so I have to go in and see her before the cardiologist appointment or suddely stop the one drug they say to never just stop....bizarre!",
      "MessageIndex": 7922,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 12, 2011 07:25PM Sandeeonherown wrote: Kim- Welcome!!! Not a group you want to have to join but now that you are here...welcome!!!! We are all in approximately the same boat with a wide variety of other things tossed into the mix",
      "MessageIndex": 7965,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 12, 2011 08:23PM Sandeeonherown wrote: Plils- my onc and radiology told me that because the difference was only about 2%, and that i was 48 and single and working etc...that chemo was not really worthwhile for me because of what it would do to me in the interim....every oncologist is different, hmm? Maybe do a pros and cons list and wait until the MRI to decide?",
      "MessageIndex": 7970,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 13, 2011 11:47PM Sandeeonherown wrote: annette- as always, you explain things eloquently...and yet to the point:) love it",
      "MessageIndex": 7983,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 16, 2011 07:49PM Sandeeonherown wrote: Oh crap!! You did it again Ducky..here I am sitting beside my old cat as she washes herself (yes to personal cleansing..it means she is feeling better!!)...started my day with a migraine (have not had one since I turned menopausal two years ago..unless it was from crying...) and now feel achey like I am getting sick..cranking in the echinecea and hoping it does not affect my heart meds becaus eI am taking it anyhow- only thing that stops me from geting sick when I feel like this....keep your fingers crossed..between the antibiotic, the yeast infection it caused, my sick cat and first cday at the cardiac clinic (not going to repeat what I said on another thread but OMG it is going to be a long long boring 3 months!!!)!!!...was feeling irritated by the whole thing and Ducky..well, you just gave me perspective! thank you",
      "MessageIndex": 8006,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 31, 2011 07:29PM Sandeeonherown wrote: Sherry- thanks for sharing that news re. pain and what the dr. said...the massage therapist I met with said that radiation has quite a long shelf life and that our lymph nodes on the other side will take on the healing load if we move the lymph 'liquid' out of/away from the sore side ( ok..that is a lousy explanation of what she said to me but you get the message. She was able to bring the swelling down too. I also returned to the gym and pump class tonight afer the go - ahead was given so I am assuming thta will help also. ....and I emailed the dragon boat folks to see if they need another rower....that would be a great strengthener! Jo- thanks..the cardiology appointment went very well. I am mor efit than most women my age, apparently, and all is GREAT!.... Annette- love you back my friend...thank you:) Jo/Annette- I too will come in your pocket this week for the mammograms and you can join me next Tuesday...have the good breast done first so your brain does not go to the 'ow place'....thikn I might book a facial for afterwards...something to reward myself....have to wait for the results for the tattoo....will call my dr's nurse and ask her to tell me over the phone again rather than having me go in person....though I do get hugs from them both whenever I go in...so that can't hurt. On another note....I would like to ask people to send some love out (or prayers up, whichever you do ) to a student of mine, Abdullah, who is in a medically induced coma in the hospital...he collapsed a week ago after riding his bike up a hill...sickle cell anemia...his mom and aunt will be flying in from his country hopefully tomorrow or Thursday. I went and sat by his side for a bit this afternoon....have been calling but was given the impression that they did not want people in their way....but I sat there and spoke to him and told him we were all sending him love and that I believ ehe can do this...he can survive this... What we are all going through is scary....pushes us to our core....but how much worse it would be if we were in another country going through something medically traumatic and not speaking the language....don't want to imagine it. thanks ladies:0",
      "MessageIndex": 8202,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 1, 2011 10:12PM Sandeeonherown wrote: Wow. lots going on today. Granny- I have not been told to wear a compression bra...working with the massage therapist to get things moving and am doing some self-massage as well...am also using light weights now that I can get back to the gym and am goin gto row2 tomorrow and see how it makes me feel.I still have not found a bra that supports but does not dig in and at the lymphadema clinic they suggested some foam I can get at the fabric store around the corner so will check that out tomorrow.not really looking forward to a compressino bra if it goes that way....there will be no partying in any pants if I get tightwired into one of those! sheesh !lol But...just in case, where do you get your compression brasÉ the majority of my pain is my left shoulder.... Ducky- another story for your book my friend. Glad he got home safely.",
      "MessageIndex": 8242,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 2, 2011 09:40PM Sandeeonherown wrote: Jo - giving you a big hug and jumping in yourpocket tomorrow. You will be ok with all of us with you. the pain meds should help too...hell...that did not even occur to me until you said it....might wear my ipod next Tuesday!!! (hell..guess i can't since it is an xray....ARGH!)...going to drop my tamoxifen off too...they have a donation box for any unused cancer meds you have so they can check them over and give them to cancer patients who are not on medical....that will feel good doing something for someone else on such a shitty day. I decided on some retail therapy ...bought some sandals that don't hurt my feel and plan on tossing out the others into a value village or sally ann bag....they won't hur someone else's feet. just can no longer wear a heel...so...naots here I come. Sue...I can't wear racer back bras or bathing suits either...kill my back. I have three old warner sport bras that I have been wearing to the ground since bc...just don't feel terrling supported or sexy in them but then I don't feel tha way anyhow so I guess hat is not key right now....painfree bra wearing is key! I found some support camisoles at walmart that i like...but the band on th eleft side is digging in to my shoulder so...need to sort that out and go to the fabric store in my mall at school and get some padding.",
      "MessageIndex": 8271,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 3, 2011 05:07PM Sandeeonherown wrote: Chabba- how did it go???? Sherry- I am pretty hairless already but the radiation has completely zapped the hair under my left arm. No sign of it so far.... Jo - YAY!!",
      "MessageIndex": 8292,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 3, 2011 09:53PM Sandeeonherown wrote: Chabba- YAY!!!YAY!!!!YAY!!!!!So relieved to hear that!!!! You and Jo are beacons for the rest of us! Beetlebum- bring your ipod with you when you have to be an amazon woman...it takes about 3 songs by the time they have you all lined up and the machine goes over you a couple of times...it is not as loud as an mri but I found if I had my music on my ipod instead of over the speakers, I wasn't able to hear th eclickingof th emachine...it was the clicking sounds that did me in...I also concentrated on deeeeeeep breathing",
      "MessageIndex": 8296,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 4, 2011 01:08PM Sandeeonherown wrote: Annette- I would love to hear more about the grapeseed oil as I am not post meopausal and will not be able to start AI's (not even sur eif I plan to once I can) and can't take tamoxifen... Ducky- it was not a brave act...you WERE doing ok and now you are having  a meltdown...perfectly NoRMAL!!! I had one weeping meltdown per week of rads....when i would go in to the radiation room, start crying, tell them to ignore it and continue their protocol since I was goign to cry through it anyhow..was just a trainwreck some days....it is ok...you will be ok....36 instead of 33 seems like SO many....3 more damn sleeps....but Ducky....remind your self of the 24 hour rule...it is only 3 24 rules in a row...you can do it....meanwhile..haul out the kleenex and let it out. I watched 3 episodes of Private practice one week just so I could cry wih a 'good reason'...just give yourself permission to cry . it is ok.",
      "MessageIndex": 8320,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 4, 2011 07:49PM Sandeeonherown wrote: Allenan- Like Jo , I have the same overall outlook as you. if the dr. wants to go back in and clean up the margins, it may mean no chemo. I didn't have any because I told hem at the time to \"take a healthy portion of boob. I do NOT want to come back in here!\". Ask any questions youmay have...someone here will have had a similar experience and will share what they know with you. Welcome!! Ducky-big girl pants do sometimes come off...they need to. Hard to hold all that in and be  calm and the perfect patient all the time. This is a good place to let it out! I too am goign to have ce cream tonight...but I have discovered a Sandee-sized portion  container...bit more expensive but it is only one portion size so if I feel the need to cheat (like tonight) I can without feeling guilty about it...if the ice cream is in my freezer, i will eat the entire thing tonight between 2 and 4 am! Annette- thank you for the information!!!! I will talk to my oncologist about it this summer. He wanted me to do my estrogen levels this July but I got my Gp to do it 6 weeks ago....screw waiting...seriously? I do not need more waiting on my hands...need information so I can decide to do something or decide to not do something...will do it again in July and have the results sent to him.....not really expecting a big change in two months!",
      "MessageIndex": 8333,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 6, 2011 07:21PM Sandeeonherown wrote: vhshea- i did mine in the afternoons as late as I could get them so that I had my day and then did not have to see anyone afterwards if I did not want to...worked out great because a couple of days I was very red-eyed afterwards..just kind of came apart at the seams...must have been a safe place to cry ducky- immune system stuff is hard. I keep telling the teachers to stay home if they are coughing or clearaly contagious and they come in anyhow and say ' I was hoping you would not see me\"..really? how is that goin gto keep the germs away from us all? and Ducky!! YAYre. oncotype..you too JO! Dexxy- I was 48 when I had to make my decision....my numbers were low and the radiologist, surgeon and oncologist all thought that since it was only a 1-2% difference, that it would make me sicker than it was worth. They also said if it was in the 7+% range, they would be pushing me to do the chemo...pros and cons... allenan- I was also told to massage the scar area every day to help it to heal better",
      "MessageIndex": 8378,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 6, 2011 08:35PM Sandeeonherown wrote: Thanks Jo! I am going to think positively and pay it back tomorrow....going to go and visit a student in the hospital who is very ill and then I have a movie planned with a galpal...will try to get the gym in there too before the movie....in the meanwhile, trying to be relaxed tonight....need sleep too.",
      "MessageIndex": 8385,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 7, 2011 05:12PM Sandeeonherown wrote: Ok....well.....not real thrilled about how the afternoon went...the technician did the right breat 3x and the left 2x....same thing happened last year when they discovered breast cancer....same spot but on the other side...very neutral (bless her) but not encouraging when I said \"ooh. don't like the sound of that. it is exactly what they said to me last year when they found the cancer\"....at least it was not on the cancer side...right? oh dear god....I really don't know if I can do this all over again...going to call my Dr. tomorrow and ask if she can put a rush on it somehow...the left shoulder and breast are SOOOO sore now...yesterday they were fine...today they are sore but it started off sore so the mammogram just made it worse. Going to go and watch a stupid movie this evening to let it go...can't do anything..out of my control once again....keep your fingers crossed that I am reading her body language and lack of comments inaccurately...maybe she truly is the ultimate professional and does not comment with anyone!!!",
      "MessageIndex": 8395,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 10, 2011 08:17PM Sandeeonherown wrote: Sherry- thank you. I am also thinking positively but preparing for anything just in case...I tend to have a 24 hour meltdown of weepiness and then get back in the saddle...that was last year's working theory anyhow so....no news yet so I am hoping it is good news! Jo- thinking of you, sending you hugs and remember not to squish me in your pocket:)",
      "MessageIndex": 8444,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 11, 2011 10:56PM Sandeeonherown wrote: granny- clarly you arrived in time as Jo is home safe and sound now....and thanks for the posiive vibes...I am staying positive and keeping busy with good things while I wait..have gone rowing twice sinc emy appointment, walked 10,000+ steps today, met a dear friend for lunch and then went with some new folks to see Halifax's first roller derby!! (with a very odd 'burlesque' half time show...more like belly dancing but I guess small town halifax is not supposed to knw the differece!)...a good day! Whack hack to anyone who is still up.....only 4 minutes to go Halifax time!",
      "MessageIndex": 8469,
      "PostDate": "11/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 21, 2011 09:24PM Sandeeonherown wrote: mimi/jo/seyla- yay to gettin gback marks that are normal and happy and good ....wheeha!! jo- figured out why I was wishing you good luck tomorrow...because I am a day behind the news...have some fast reading to catch up on! Seyla- i have some time on my lunchbreak wednesday so i will hop in too:) Jo, we can have a little pary . will you remember the wine? ok and no w that i have read to the bottom....YAY JO!!! B9.....so you are on the 12 month now like me . wheeeha!!! Sheila....you too with the good results....wheeha sisters!!!! Mece- I am ending up and ou tmy version of prayers for the fires....glad they got the dogs out! hugs to all who need one or two or four!",
      "MessageIndex": 8585,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jul 3, 2011 06:07PM Sandeeonherown wrote: Hi all, Hope you had a lovely July 4th and for those Stage oners who are Canadian like me, Happy Canada DAY! Hey Annette:) Hi Viranyani- I did not have to have chemo and was taken off of tamoxifen because I had a heart attack 3 months after rads so I am flying free!...fingers crossed...had my one year mammogram and all is well so ....relieved. Keep us posted:)",
      "MessageIndex": 8757,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jul 15, 2011 10:13PM Sandeeonherown wrote: Chadneyann- welcome. So sorry you have to experience all this but glad to hear they are moving fast on it all! Anette- you are not a whcak job lovely!!! You are a stressed out survivor who is allowed to have her bad days...I burst into tears on the stationary bike....going slow so I get the feeling like a whack job and unstable thing...but it was ONE MOMENT in a very long week....a very long year....it does not make me a whack job....just a stressed out survivor with one thing too many going on Sherry- so tedious going to all these appointments, hmm??? I am grateful that these specialists are around and accessible and I am able to go to them but SO tired of it all too...I get it. Maybe a week without any appointments would help? Jo- hugs to you!",
      "MessageIndex": 8931,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jul 15, 2011 10:16PM Sandeeonherown wrote: Met a gal ...she is on my training course....after week one (ie this afternoon ) she said \"well this is nothing. If I can beat breast cancer, I can do this damn course!\"....hear hear!!! another gal on the course piped up with something along the lines of \"don't get me started on that subject\"....and I sudeenly realized we are everywhere!!! Was I just totally unaware of it all a year ago or was I just not coming in to contact with folks? I did not say anything to her about my survivorship as she seemed to need to talk about her experience two years ago....surgery and chemo...but I think I will invite her to come and paddle on the last week of the course...good way to destress after the intensity of it!",
      "MessageIndex": 8932,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jul 23, 2011 10:13AM Sandeeonherown wrote: pam53- after my heart attack, i asked my radiologist about my heart..did rads have anything to do with th eheart attack and he said no..we no longer go near the heart..the only thing that may have been affected were the lungs because they were corssed. I know he has to tell himself this to be able to do what he does but he was quite sincere, quite convinced and convincing...but who the hell knows...really...tamoxifen, a 70% blocked artery (thanks mom, dad!) and radiaion...could not have helped the situation....but it was better than having the problem somewhere far away from a hospital so....get as mny details as you can if you ar eworried about it....perhaps get a base line on your heart and cholesterol etc befor estarting any cancer treatment if possible...a blood test should give you some info. Dr. Shawn- since I can not take tamoxifen any longer , I woul dbe interested to know what naturopathic remedies your wife is on post lumpectomy/rads. I want to make an appointment with my naturopath here in town and would be interested to see what she has to say about it all",
      "MessageIndex": 9038,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 25, 2011 09:52PM Sandeeonherown wrote: You will get through this Sherry....one step and one hug at a time. Glad you were with him.",
      "MessageIndex": 9971,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Nov 8, 2011 09:05PM Sandeeonherown wrote: Val - congrats...three years...wow!!!! Joan811- You will get through rads....and do not diminish them....you have valid concerns..it IS a big deal to go through radiation and you have the right to talk about it my dear...bring some tunes with you...I listened to my mp3 player the entire time...took three songs each day...I brought a colourful shawl to wear over my hospital lues in the waiting room so I didn't feel exposed ( or cold) and i lubed up with aloe vera gel before and after each session....the technicians were amazed by my skin....I also kept kleenex in my pocket as  I found the whole thing very emotionally draining.",
      "MessageIndex": 10125,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Feb 8, 2012 10:19AM Sandeeonherown wrote: Thanks Jo....I AM in a much better place all around...am waiting on a job thing in China for a month...that would be cool...coukd visit my sister and a friend while getting out of my own way ...otherwise, if nothing materializes in March, I plan on taking off for a week or two just to go and BE for awhile...life is short indeed. no regrets",
      "MessageIndex": 11351,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 8, 2011 09:57PM Sandeeonherown wrote: Sagita- I am only 8 or 9 months into this hourney..but you CAN do it and you hav ecome to the right place for support",
      "MessageIndex": 7240,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 12, 2011 03:52PM Sandeeonherown wrote: Ducky/Vicki- break out the aloe vera ladies...whee ha!! Ducky- you RoCK..plain and simple. My radiologist said if you go in with a positive attitude and keep your energy up, you will be fine. He was right. I was physically fine (emotionally not so much but better out than in is always my emotional recommendation when it comes to laughing or crying)...age is but  a number....welcome to the club. Glad you have someone you trust, someone who will call others on their shi*, and who will explain things to you so that you are satisfied. Lime Elimar, I believe that radiation is the gunner on top of a ship blasting the cancer cells to kingdom come if they but poke their little heads up from the sand....you will be fine...and we are here to suport you.",
      "MessageIndex": 7319,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 21, 2011 09:45PM Sandeeonherown wrote: bbignlv- you will be ok...you really will....this is a great place to get support and there is always someone here who has been through the same experience who will happily walk you through it. I did not have to have chemo but I have friends who have and they are ok now...one of my best galpals has been 6.5 years cancer free..she had chemo because one of her margins was a bit off....but she managed...she is ok...remember to breathe...and keep a 24 rule inmind...ie....if today is a crying , scared day...go to bed...tomorrow will be brighter and you get to start all over! You WiLL be ok...hugs Sandee",
      "MessageIndex": 7535,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 21, 2011 11:52PM Sandeeonherown wrote: Ducky- keep the aloe vera handy....I had my mps playing the entire time...I went through rads just before christmas and they kept playing Christmas carolls...did me in...Dolly PArton singing Christmas carolls..no one even noticed he irony of Dolly singing at me while I had my breast radiated...little bit of black humour....but music...a book for the waiting room...and last, but not least, I brought a shawl...different colours, every day I went in (except the first two when I had no idea...day one I 3was fully dressed until i went in and day two they asked me to change into a johnny shirt....I was a mess by the time I got into the room...)the shawl somehow made me feel more like me and not a number and it also made me feel less exposed with boobs unbra'ed if you know what I mean.....just felt better somehow. some people bring a friend with them....I went alone and was ok....I did not get tired physically...just emotionally spent some days from putting on a happy face ....I can tell you....it will be fine Ducky....you will be ok. We are here to guide you through..",
      "MessageIndex": 7540,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 22, 2011 10:40AM Sandeeonherown wrote: I agree with determined- I write everything down and for he first appointment when the radiologist explained everything to me, I asked if I could record it incase I forgot and needed to remind myself of what was said...it has been helpful",
      "MessageIndex": 7543,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 23, 2011 07:46PM Sandeeonherown wrote: Debbie- consider yourself officiated my dear (I know hta is not a word but it sounded fun to write!). our diagnosis is very similar....'best case scnenario' I was told... so that brought relief at the time. It is a scary time for sure....be aware that even though you have moved out of 'depressio; you may still have some bad days so give youself the 24 hour rule...(ie. today is crap but tomorrow will be better when I wake up!)...it works:) Welcome Debbie!",
      "MessageIndex": 7552,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 24, 2011 09:49AM Sandeeonherown wrote: annette- hard to lose peopl ewe love at a young age...it does indeed impact us ...does not mean in a negative way necessarily...but it has an affect. I chose not to have kids as my mom was sick all the time when I was  young (age 10 on) and I did not want to potentially do that to my kids..and dad had heart attack after heart attack...and kept on living his life,,,he would live hard, have a heart attack, find GOD for awhile and then live hard again...it has had an impact on all kinds of things for me. We are not iron women....only some times.",
      "MessageIndex": 7559,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 24, 2011 11:18AM Sandeeonherown wrote: Annette- your presentation will be great, I am certain! The sugar form the bunny should get you all fired up!",
      "MessageIndex": 7566,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 25, 2011 09:04PM Sandeeonherown wrote: Great pic Jo!!! Always fun to see who you are talking too:) (though I do like your butterfly avatar too:)",
      "MessageIndex": 7592,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 1, 2011 11:17PM Sandeeonherown wrote: Meece-mine too!!! I was trying to decide last weekend...do I buy the D and have one spilling out a bit or by the DD and have one swimming in the cup???went for the D since I am losing weight and because I figure there will be more shrinkage...it has only been 7 months since surgery and 4 since rads so I am expecting more...if I have to , I will buy two different sizes and sew the damn things together! Now there is a plan Jo/Annette-my dr's said the pain/tingly/occassional swelling could be up to a year so.....normal is when we no longer notice it I think. mimi- so glad you are safe",
      "MessageIndex": 7730,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 4, 2011 10:39PM Sandeeonherown wrote: Jo- thank you for your kind words....I will be holding your hand tight and doing deep breathing exercises...i will have had my stress test by then and two supervised exercizze classes so that will help me to have a bit of confendence...just need a BREAK!",
      "MessageIndex": 7801,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 8, 2011 09:56PM Sandeeonherown wrote: Jo !!! YES!!!! I understand the lack of energy now!!!! Though mine is clearly heart medicatin orelated, it has kicked lme on my **S! ina/Jo- i have had he same  tests as you folks and am wating on the results...rad appointment 3 months post rads....oncology only because i had a heart attack and he took me off rads and freackked out on the ophone so was given an appointment immediately...but not exected to see anyone else ...unles the mammogram goes pearshaped...then i would see my BS instead of my GP!",
      "MessageIndex": 7906,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 11, 2011 07:39PM Sandeeonherown wrote: Ducky....good...have to say, I would and did do the exact same kind of thing with my dad when he was being stubborn out of love..and the teachers I work with have done the same with me...people do it out of love jus as you were going to ake the 4 days out because you love them...so accept they love you, go and take some time for yuorself by the water and let it unfold...I have discovered tha those simple things..saying yes to others as they attpemt to take care of me, really really helps them to cope...so good for you for giving in to the love! Sheila- gorgeous!",
      "MessageIndex": 7953,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 27, 2011 05:29PM Sandeeonherown wrote: Welcome to all the new comers. I have been away for a week and have a lot to catch up on but will start with my news. I went to a massage therapist today who specializes in lymphodema- while she is not certain that I have it, she said there is certainly some edema left over from the surgery in August and radiation in December....she talked about how the lymph system works and about radiation and how long it stays in your body working its magic and not-so-much magic. She also seemed to think that despite what my radiologist said, that she suspects that radiation did play a part in my heart attack in March....as I said to her...I can't go back and undo anything so trying to figure what to blame does not help ...but in any case, she thinks she can help and can get me back to being pain free, not swollen and back into my wire bra if I so desire it! WHEEHA!! Anyone else find their ribs and shoulder sore? I have lots of mobility in my shoulder and arm where they removed the lymph nodes but I have gotten two infections in my hand in the last three weeks on the cancer side..this is my second bout of antibiotics..from a scrape on the hand so be aware ladies and do as I did...if you get a scrape and the next day it is red, get in and get an antibiotic to stop it in its tracks! night all",
      "MessageIndex": 8136,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 29, 2011 08:06PM - edited May 30, 2011 09:25PM by Sandeeonherown Shelia- it is going to be ok..I go for my mammogram on the 7th of June....dreaming of deflated breasts and waking up with my hands clutching them...nevers indeed....I can pretend all I want with others that I am not nervous but I can tell you gals that I am scared sh**less....but....being optimistic an dremembering the odds will see me through...think I might have a facial or something that day to celebrate. Was going to get my tatoo done that afternoon but am thinking with all the skin reactions I am having lately that I might have to wait a bit for that....do not want to cause my own reaction to something:)..We will all be ok....and if something we don't want or expect to happen does happen, we are all here to support...and we all need to remember...we made it through this last year...the unknown...the unexpected...we made it....if we have to do it again ( big iF and unlikely but clearly our fear), we will, we can...because we we know we have already done it before....we are stronger than ever before...we will all be fine. You;ll see.",
      "MessageIndex": 8162,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 4, 2011 01:12PM Sandeeonherown wrote: linda= welcome.....and if the aches and pains are what you can notice right now, then they too are important to address..sometimes it is the things we feel that need to be addressed...they seem less surreal I guess. Anette- Sorry you have to wait until December but what a gift your dr. has given to give you the foob to feel. All I can feel is scar tissue in th eleft boob and who the heck knows..no one was able to feel the cancer in the first place so to have an idea of what to feelfor...great!!!!! if she is waiting another 6 months...well, maybe that is for the best . my MRI is booked for September....mammogram on Tuesday. Samsue...good luck with the MRI. Hope they have the earphones over your ears so you don't have to listen o the damn machine!",
      "MessageIndex": 8321,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 5, 2011 08:24PM Sandeeonherown wrote: Samsue- ice cream has water in it too right? good idea with the double earplugs....I counted....and counted and counted when I had my MRI done pre-radiation..their earplugs slipped on my head and sinc ehtey had said not to move, I was afraid to say anything (since the first two times they I said something they moved them on my head and then the earphones moved again!)..so I counted deep breathes and got to 240something before the machine was turned off...thought I would scream at one point...may have to bring in a cd in Sepember! Keep us posted on your results! Maybe- welcome....sorry you have to join us but will ssend up some thoughts re. a low oncotype",
      "MessageIndex": 8351,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 7, 2011 10:08PM Sandeeonherown wrote: Annette- sounds like a good decision. go with the one you trust and you know what? It is exactly what this dr. should be doing...going above and beyond is why these folks become doctors..why folks become teachers and social workers etc....to go the extra mile. You deserve the extra mile. Thanks for all the thoughts ladies....not a good day. Went to a movie to laugh anf forget fear for a few hours..and I was feeling so upbeat and positive yesterday. WOW!!!! All baed on readin gbody language...got to stop that (though I have been right so far...I hope this time I am proven wrong)",
      "MessageIndex": 8404,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 11, 2011 06:18PM Sandeeonherown wrote: Wow..step away from your computer and 10.000 posts appear...wow!!!! congrats... this stage one sistah has decided to step away from the hormonals and try her luck with exercize and a green/organic whenever possible diet...and a positive, upbeat attitude again....have decided to live my life and remove things that scare me (potentialy for meds causing another heart problem) or mess up my head.... discussed stress,with my co-survivor galpal, as an added componenet to all of this medical mumbojumbo...I have been poohpoohing it as i wanted a medical reason...or a random reason for breast cancer ...but it had been an incredibly stressful year leading up to the diagnosis and mildly stressful years leading up to that...I cannot dispute that stress was a contributor...but it does mean I have to look at my life and remove what I can... Thoughts??",
      "MessageIndex": 10456,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 12, 2011 07:54PM Sandeeonherown wrote: Sheila....oh boy....so hard to know what to do hmm? I had a friend get diagnosed this summer...stage 4, ER- breast cancer...was told she didnt' want people to know but someone told me anyhow since I am a surivor...I waited three months...sending love the whole time and messages of places to check for information via the pal who told me...then I wrote her an email saying \"I know...and while mine is different, I am here for anyhing you need\"...she really apreciated the gesture, the information and the fact that I respected her wishes and waited...you know your SIL...do what you think she would want you to do...we are here for you. Love to you all",
      "MessageIndex": 10494,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 13, 2011 06:01PM - edited Dec 13, 2011 06:10PM by Sandeeonherown Welcome Lisak! I didn't have bluepee but my roomie and Ithought I had broken into hives as my arm was all red...called the hospital and couldn't figure it out...was advised to take abeadryl 9 which completely makes me loopy so didn't do it)...called the nurse the next am and half way through the conversation she told me to get a washcloth and try to rub it off....???? it was red dye or iodine or something to that effect....that had been put on my arm pre-sugery...they simply forgot to wash it off. we had a good laugh. talk about relief!",
      "MessageIndex": 10514,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Mar 10, 2011 09:53PM Sandeeonherown wrote: Jeanne, who is your surgeon? Same as last time? pM me if you want company on the 24th ok? or need anything afterwards! hugs to all. Sandee",
      "MessageIndex": 106,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Dec 11, 2011 08:43PM Sandeeonherown wrote: Ducky- thanks.....I know it is hard....I may regret this decision but I will try the greem food thing...get back to the gym....laugh more....can't bend my hands tonight...I look down and see my dad's hands..which would be fine except I am not a 73  year old man....and that is what my hands look like right now...I know they are just hands....it is just swelling but the swelling and heart issues...can't do it..heart potential problems are more real to me than breast cancer I guess right now...so....need to take care of that...I hope you feel better Ducky... Odie- breathe tonight and call your BC or PS (or both..who responds faster>???) first thing in the am...likely just your body adjusting but safer than sorry is the key here. Afer my heart attack in March, I was in the emergency room because I had had a vitamin get stuck in my throat...and I was terrified to lie down....I needed reassurance and I was here alone so...I went and sat inthe waiting room knowing if anything happened I was somewhere where I was safe ...the dr's were incredibly understanding!...and I felt better getting information...our minds play tricks on us and our bodies react....you don't have enough knowledge right now re. how your body will or may react to what has recently happened to you so you need more information...don't panic....you ARE the expert on what does not feel right and what you need support with...call tonight and leave messages explaining the situation and then go to bed.... gentle hugs being sent your way",
      "MessageIndex": 10468,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Feb 7, 2012 10:15PM Sandeeonherown wrote: OMG...I am 20 pages behind...suffice it to say....can't get it all read. I can, however, get in on this great group hug!!! Hands are almost back to normal size post Arimidex and edema in the chest area is going down, though it is still very present along the side of my ribs and my back...looks like backfat....but moves like fluid! thank goodness for lymph massage..if nothing else, she reassures me that it is moving and leaving...My energy is back and I feel more like me than I have in a year....still hav enot told the oncologist that I have quit the Arimidex...guess I need to make that phonecall soon....just do not want to be called re. another drug... Going to be 50 next month....tired of waiting for test results to get on with my life. Does that make sense ? Oncologist, breast surgeon, cardiologist all have said ' get on with your life' and I am sometimes afraid to..in the sense that right now, right here, I am near a hospital...11 months ago, I was planning to be on a mountain top in Nepal and now I am afraid to travel unless there is a facility nearby....WTF? Need to work on that obviously....",
      "MessageIndex": 11349,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 10, 2011 03:57PM Sandeeonherown wrote: Ducky- I am a fair bit younger but did not have ANY fatigue on the rads...I only did 16 (I am in Canada)...so I guess I would be askin gthe radiologist why you hav eto do 33 and is there any way they could do it the Canadian Protocol way instead so you do not have as many sessions. You are clearly a tough cookie ....just so hard to make decisions when you are relying on the information from others.....even if they are 'experts'...hard to trust. Good luck..we are here if you need us! Sandee",
      "MessageIndex": 7282,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 11, 2011 09:13PM Sandeeonherown wrote: Ducky- you are an inspiration. period!!! (and definitely bring the tape recorder..helps to clarify thing slater when the fog wears off)",
      "MessageIndex": 7296,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 16, 2011 11:19PM Sandeeonherown wrote: Granny- your feet are a tad smaller than mine indeed...size 6.5's...but honestly, right now..sinc eit is spring and I am too hot for my own good, all we have is bare feet to worry about...I also have a mini-flashlight so we should be ok in the pocket! Speaking of food..tried a new greek restauran last night...OMG!!! fantastic...my new favourie...and inexpensive and a mile walk from my house so all good!",
      "MessageIndex": 7426,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 18, 2011 11:40PM Sandeeonherown wrote: Annette...I know....I didn't want the heart stuff either but my darlin' you CAN do this...they are checking ..it is preventitive....just breathe....it will be what it will be but in the meantime breathe",
      "MessageIndex": 7461,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 19, 2011 06:31PM Sandeeonherown wrote: melmes....remember that a lot of us on these threads are  here because we have had a problem or two...most people who have no issues with tamoxifen, prognosis, agreeing with their doctors etc are not here because.....it is not an issue for them. Do you know what I mean ?(not a very good explanation for an English teacher!)... ubnsmiley- my situation is similar to yours (but I had IDC)...and I am now single ....my team (surgeopn, oncologist, radiologist, GP..and me) all had the same opinion...surgery, (Take a big piece I told them so they did and I have great margins), radiation and tamoxifen. My heart attack a month ago has ix-nayed the tamoxifen but I do not regret my decision for no chemo...figured for how sick it might make me and for my prognosis without it (it would only change by 3%), I was NOt putting myself through it....my radiologist did, however, say if the difference was over 7%, he would likely suggest I give chemo a solid thought or two...",
      "MessageIndex": 7479,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 19, 2011 06:51PM Sandeeonherown wrote: ubnsmiley- I was also perimenopausal when diagnosed...do me a favour and have your cholesterol checked if you have any history of heart or high bp in your family. We ar epretty sure tamoxifen caused a blood clot and caused me to have a heart attack four weeks ago....and everyone I have met with befor eand since are shocked because I am a healthy, happy woman who does not smoke, eat salt, drink much or eat a lot of m+m's (though I admit the almond ones always accompany me when I fly!)....Got to admit..even though I used to want to be hot...I do NOt miss the hot flashes tamoxifen gave me....or the lack of sleep. I have been off it for two weeks exaclty and I have slept very well and very deeply the last week...(but until the heart attack, I was willing to put up with it all)..guess the point here is that you need to weigh the pros and cons and risks to your overall health right now....",
      "MessageIndex": 7481,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 19, 2011 07:28PM Sandeeonherown wrote: ubnsmiley- I am the canary in the mine....and came out singing the other side so all is ok. Just want to head others off in at the pass if possible. My levels are menopausal except estrogen( 111 (out of around 330?) so I am going to fly without a parachute for awhile and then retest it in July to see if 13 months has made a dent in my estrogen...and then decide what to do...I am grateful for the sleep these days though..could also be the heart medications knocking me out! something to be grateful for, hmm? Look forward to hearing what you friend has to say!",
      "MessageIndex": 7483,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 19, 2011 07:38PM Sandeeonherown wrote: tina- the cardiologist wrote \"Family history+ breast cancer\" as the reasons for my heart attack...and as soon as the oncologist heard I had had a heart attack , his nurse called and said STOP TAMOXIFEN right now....so yeah....seems pretty clear it caused the blood clot...not to say I would not have had a blockage eventually as one area was about 705 blocked...but apparently it can cause 'unstable placque' to form blood clots so I am no longer a candidate. We are nowwaiting until the summer when I will have my estrogen level retested....and then decide if I wait longer or go on an AI....after the side effects with tamoxifen....I will be a lot more hesitant to put anything else in my body...already reeling with 5 meds for the heart attack...keep me posted on how you tolerate the arimidex...just in case!",
      "MessageIndex": 7485,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 19, 2011 11:39PM Sandeeonherown wrote: Texas annette? I will be in Tampa in early September for a conference....not really close hmm?ok my cat is saying it is time to go to bed so...night! Glad your hubby joined all of us Annette!",
      "MessageIndex": 7488,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 20, 2011 07:07PM Sandeeonherown wrote: brenilea- I was grateful to keep my hair and my boobs..I have friends who have neither ...cared just like you do but had no choice...one pal had a hair shaving ceremony, another went to her hair dresser and had her hair coloured and cu for the last three weeks she would have it and another had her long hair cu short and donated to a group that provides wigs for children with cancer....all say it was one of the hardest things they have ever done .you are allowed to be afraid and to be pissed off ...and to mourn its loss. Melmes....major drag....but enjoy the fact that you have been able to grow it,know you will be able to grow it again and oh....I don't know....cry ?!?! Wail and scream.....damn unfair...period kollingsworth- no chemo here either. but hoping your chemo ourney is a gentle one Barbara- Excellent. if I end up in Tampa, I will let you know ! annette- congratulations!!! WHEEHAA!!",
      "MessageIndex": 7514,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 23, 2011 09:59PM Sandeeonherown wrote: Debbie/Ducky- sometimes we do not take advice well...depends on our head so don't take it personally Ducky. You are entitled to your opinion...the down days are dark for sure. Afer each appointment, I would go to my car and then cry..get it together and return to work...go home and cry for a couple of horus. I was living with a roomie for the summer and she was more angry than I was....I was just devastated....not angry...scared of the unknown....heart stuff runs in my family...not cancer so I had no baseline to refer to really...Being a lone means you can wallow a bit and can process but make sure you get out with people too....I have really reached out to friends and coworkers..they ahve been a gift to my soul. ...and they also needed me to reach out to them. They moved me, ...tried to feed me...helped me lift things....cried with and for me...held me...all necessary things on the road to processing. Debbie, I also started my anti-estrogen at the same time as rads because I could not fathom the idea of starting and stopping one more thing....I was physically ok but an emotional basketcase....warned my rad technicians that I would likely cry through half of them ( I only cried through a third) but it was probably because I was doing the \"I'm fine \" thing with everyone and working full time as well...I used aloe vera liberally....my skin stayed 'beautiful' throughout (the technician's words) and did not start to burn until radiation was over. Did not initially take the cortisone they offered as my skin did not look like it would need it but by 3 days post-rads, (pre-Christmas flight home to OTtawa) I was at their doorstep asking for cortisone or a prescription for it so...take whatever they offer just in case you need it. Keep us posted on how you are doing you two!",
      "MessageIndex": 7555,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 24, 2011 08:51PM Sandeeonherown wrote: Annette- I thoroughly agree....your presentation will go great, I am certain. go eat a bunny ear or two. I left you part!",
      "MessageIndex": 7572,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Apr 29, 2011 06:06PM Sandeeonherown wrote: Susan- welcome!!!! Keep the aloe vera handy and take the cortisone script or bottle they give you when it is over as rads keep on ;giving' for a couple of weeks once you are no longer on the table...rads working its magic but it can cause the skin to redden and peel ...and depending on your boob size, chafe as well...my main are of tenderness was under my arm so I bought a huge bottle of eucerin and liberally applied it every hour or so....made things very tolerable..not to worry. You are almost done!!",
      "MessageIndex": 7677,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 3, 2011 07:00PM Sandeeonherown wrote: Mimi/Susan- such a journey, hmm? My shoulder and sore and tense and swollen (was told my shoulders were around my ears today) and I took off my bra as soon as I got home because it was very painful,,,,seems related to bra wearing but if I only wear a camisole, I do not feel supported enough....frustrating",
      "MessageIndex": 7740,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 4, 2011 08:57AM Sandeeonherown wrote: GMAFoley- just popping in before work....you are on the right thread my dear...great margins, fast and efficient dr's, support and something to look forward to..your internship and coursework. many of us worked through our radiatoin just fine so don't rule out yur summer just yet. Great that you only need radiation Official whine day? I can already start about work things but won't.....just going to finish breakfast, get dressed , go to the stress class the cardiac clinic puts on and hen go o work for 6 hours. Jo- glad your toe is a bit better!",
      "MessageIndex": 7756,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 27, 2011 08:07PM Sandeeonherown wrote: Barbara, I also bought a groupon massage certificate!!!! hot stone massage...think I may book it for next week or the week after to tide me over between massage visits. Did your massage therapist recommend any websites to see ho wself massage is done? I was checking some out on youtube but I am not sure how legit they are as techniques  ...anything that can bring the breast down and ease the pain would be great.",
      "MessageIndex": 8138,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 30, 2011 09:33PM Sandeeonherown wrote: nene/cakeisgreat- all I can say is we are here...and we are sending thoughts your way that your lungs are clear, that whatever the catscan picked up can be dealt with swiftly and smoothly and that you remain well. beetlebum- i remember that feeling...did not want to be touched, talked to or anything....the amount of informatio I got and read about was a wee bit overwhelming...hard ot make decisions about your own health when you are not an expert but hard to trust people you have just met , hmm? keep reading...keep asking questions. As someone said to me here a few months ago..you can always start them and then choose to go off them...radiation....yeah..no one really wants to go through that but bring an ipod, imagine the radiation machine blasting those bast**ds away and bring a shawl or something to put around yourself in the waiting room while you ar ein your johnny shirt waiting for your time...it all helps... jo/raincitygirl/seyla/vhseah/susan- glad my words made sense and resonated in some way....takes a sister to understand...I go for my cardiologist appointment tomorrow and mammogram next week....lots of swelling in my left breast...more than there was immediately after radiationand that is more my concern than anything else right now, stragenely enough...everything feels tight!!! bras, shirts....everything above the waist so...have to tread lightly as this is the unknown yet again! (the knowns are not so scary, hmm? it is the unknown....) ... we will all be ok.",
      "MessageIndex": 8176,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "May 30, 2011 09:54PM Sandeeonherown wrote: Samsue- I went to a lymphodema massage therapist last week and she thinks it is edema from the radiation but does not yet think it is lymphodema...but did a lymph massage ...I meet the lymphodema folks at the clinic in the cancer part of the hospital on the 14th of June....meawhile, I am doin gbreast and arm massage..definitely swelling though....and hurting..it did not hurt Friday or saturday after the massage but does now.thoughts?",
      "MessageIndex": 8179,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Jun 10, 2011 08:44PM Sandeeonherown wrote: you can have yours when you wake up from surgery Jo...bringing a book is an excellent idea",
      "MessageIndex": 8448,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Aug 22, 2011 12:17AM Sandeeonherown wrote: Getting ready to start my vacation....have tomorrow off for the stress test (and need to callmy insurance  comany to find out =what is covered if I am out of Canada...like when I get to Florida after Labor day!)...and need to make decisions about my life this fall...stay at my job, take a leave of absense, move away from Halifax, stay in Hlifax but only take part of a leave from my job while I pursue a few other ventures....that seems like the safest option at the oment..but do I want o do safe...now that is the question..good o have options right now! But..vacation does not officially start until thursay...I want to go to sussext NB to visit some old pals. to ottawa to help a pal move her parent;s stuff from their family home *they are in nursing homes now( and then to florida for a conference with a few days on the side in the Miami/everglades are....need some sanity!",
      "MessageIndex": 9245,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Sep 2, 2011 08:50PM Sandeeonherown wrote: My plan was to get a tattoo (five petalled flower or a fish or two) to celebrate one year but on the plavix for my heart attack in the spring, I bruise so easily that I am afraid to go and get one..where is my fearlessness of my 30's? I am also nervous about having anything done on the left side because of the suggestiong not to have your BP taken or blood taken from your BC side....the little tatt freckles don't bother me but it did irk tha they used marker anyhow...you could see the marker through some of my shirts and I went back to work after radiation most days!",
      "MessageIndex": 9413,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 2, 2011 04:22PM Sandeeonherown wrote: I think it is time for some of you to visit Halifax!:) Joan811- glad you found us all...I understand...having information helps keep you grounded and means you can go in to a meeting with a modicum of balance...knowledge..but you still hav edays where it scares the crap out of you. I get it. I have an oncology appointment this tuesday to talk which meds (AIs) I will start with...here's hoping we choose the right one and I have no side effects...god....I will wear something with pockets...would apprecaite a posse of you all to keep me calm... Tomorrow my boss is meeting with all the teachers to discuss the plan of actino now that I hav quit my director position (which I held for 1 years)....I know someone is going to make me cry tomorrow....won't be hard given that I am fleu0ey and tend to cry then anyhow...good lord.!",
      "MessageIndex": 9723,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 3, 2011 09:59PM - edited Oct 3, 2011 09:59PM by Sandeeonherown Jona- you are welcome Valjean- how did it goooooooo???? Seyla- I will have big pockets tomorrow morning and will keep you close.  I promise not to squeeze you when I get nervous! Think I will be asking for a bone density test though before I start taking these pills so we have a base line!!!bruises from heart meds and bone density tests...sounds like a good fit, hmmm?",
      "MessageIndex": 9751,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 4, 2011 09:16PM Sandeeonherown wrote: Valjean- BE EMOTIONAL! all good my dear...better out than in and yes, I know what you mean..you want an expert to say it will be ok....they see so many of us ...it is comforting somehow... Thanks ladies for being iwth me at my oncology appointment today...I waited almost 2 hours but I don't actually mind..I figure if he is spending time where it needs to be spent, with people who need him to spend it, then I am ok waiting..and he spent time with me too. Essentially, he said he has not seen a case like mine inthe 3 years he has been an oncologist...that going on Arimidex only increase my chances of not getting BC again by 4% but my odds are already excellent (in the 85% range)...I reminded him that 1/9 women in Nova Scotia get BC and I happen to be one of the 'one's...random but there you go...and that neither of us, nor the surgeon or radiologist thought I was a heart attack candidate either but to please give me his opinion so I can weight it with mine. In the end, we decided together that I would try it for 4-6 weeks...by then if I was to have side effects, they would have happened. His wonderful nurse will call me in 4-6 weeks to check in on me...he is ordering a bone scan so I will have a base line and he has given me a prescription for calcium since my blue cross insurance will cover 75% of it. He said it was entirely up to me..my chances are already excellent....but it is 4%....and to see if the pros outweigh the cons...I will give it a try...but I didn't bring the prescription up today...enough change this week...will do it tomorrow when i can talk to the pharmacist",
      "MessageIndex": 9772,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 8, 2011 12:25PM Sandeeonherown wrote: Annette- sounds like you needed the cry my friend...think I will be making an appointment with my GP this week too to talk about the arimidex, get a flu shot and soe perspective....I have loved my job for 19 years and still love it..this week anyhow....but am also feeling VERY detached from things lately...hoping it is the cold. Sending you hugs Anette",
      "MessageIndex": 9788,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Oct 27, 2011 06:51PM Sandeeonherown wrote: Good luck with your results tomorrow Sherry...helluva week sister...know we are in your pockets!",
      "MessageIndex": 9979,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Sandeeonher…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/117817/profile",
      "Content": "Nov 3, 2011 09:30PM Sandeeonherown wrote: Well...I live in Canada and work indoors...I am going to continue to take 4000 ius of Vitamin D a day..I have had my blood work done two times since May and both times it came in as 'normal' which means, clearly, that 4000 is not too much for me! My naturopath and Gp said take 2000....nope. not doing it. like many of you here, I have no idea what caused my cancer. I eat well, exercize, don't smoke, rarely drink, don't eat a lot of crap etc. etc....was the cell tower that was put up practically in my backyard a factor? I have no idea...I have had about 6 mammograms in my life...was that the cause? fillings? birth control I was on in my youth and into my early 40's...(ex- dr. said I could be on it until menopause without ANY problems...really?) I have no idea what caused my breastcancer...it is random and nothing I did as far as I can tell...stress of a partner leaving and grieving? my wire bras to keep my DD's where I would like them to be? no idea....just know I had it, it is gone and I am doing my best to carry on and hope it does not regroup and appear again. Sheila...you are allowed to rant and roar. If not here, then where? night all..hugs to everyone of you brave souls!",
      "MessageIndex": 10043,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}