{
  "AuthorID": "SandyAust",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
  "Posts": [
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 7, 2008 06:51PM - edited Jul 7, 2008 06:52PM by SandyAust Dear Dory,  I am so sorry about your Mum.  I lost my Mum to cancer 13 months ago when she was 64. It is too young.  My thoughts are with you. Take care,  Sandy",
      "MessageIndex": 41,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707520",
      "Title": "MY MOM IS NOW AN ANGEL...AND I ALREADY MISS HER! LANEF SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 19, 2010 07:55PM SandyAust wrote: Hi SonofJan, I am so sorry your family is facing this diagnosis.  Your mother is very lucky to have such a caring son.  Yes unfortunately it is possible for breast cancer to recur many years after the inital diagnosis.  This is particularly the case with ER+ cancers.  The good news is that if it has taken this long to recur she obviously has a cancer that is less aggressive and slow growing. I think your mother's oncologist is being straight with you, it is a lot to take in.  Stage 4 breast cancer is not curable but it is very treatable, particularly in some cases.  I think the best thing for you to do is educate yourself on this disease and its treatment.  Then you will feel less confused and more in control. There is a lot of information on this site, both on the discussion board and in the other areas.  I have attached a link below to a guide for women with metastatic breast cancer.  This is an Australian document so not all will be relevant to you, I just thought some of it might be useful in terms of a general perspective. There are treatments in the U.S. that we dont have here.   This is given to all patients in Australia who are diagnosed with mets, there is a similar document for early stage cancers.  My apologies if it is not helpful to you but maybe there will something you can get out of it. Your post really touched me.  I was diagnosed early stage 6 years ago at 36 when my two sons were four. They are ten now.  I have not recurred.  Unfortunately 3.5 years ago my mother was diagnosed with mets that the oncologists initially  thought was a recurrence of her breast cancer from 13 years earlier.  In her case it turned out on the liver biopsy  to be a different cancer all together and the primary was never found.  As a daughter I can say I know the incredible shock you must now be feeling. It will settle and you will feel better when you are informed and you have time to take things in.  As a mother I know what a great comfort it must be for your mum to have son like you.  She must be so proud of you and so grateful for the love and support you are giving her.  I am just a visitor in the Stage 4 forum other ladies will be along to assist you with more information than I can give. http://www.nbocc.org.au/download-document/mcg-a-guide-for-women-with-metastatic-breast-cancer Take care, Sandy",
      "MessageIndex": 1,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762266",
      "Title": "Concerned Son - Stage IV Diagnosis of Mother sonofjan justjudie"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 2, 2007 01:39AM SandyAust wrote: Hi Kari, The light-sabre thing is very cute. he was obviously very tired after the excitement of his big day.  My two seven year olds are right into light-sabres and all things Star Wars at the moment. I will be keeping my fingers crossed that your next set of scans show that Doxil is working. Take care, Sandy",
      "MessageIndex": 68,
      "PostDate": "02/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693703",
      "Title": "KariLynn-how are you? Bugs 73gr"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 11, 2008 05:25PM SandyAust wrote: Hi Deb, still thinking of you.  Keeping hanging in there.  Take care,  Sandy",
      "MessageIndex": 19,
      "PostDate": "11/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719376",
      "Title": "OK...the docs have a plan. AlaskaDeb LuAnnH"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 20, 2008 12:16AM SandyAust wrote: Dear Darryl I am so sorry for your loss.  Joanne was a lovely lady.  Your family is in my thoughts. Take care, Sandy",
      "MessageIndex": 21,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702566",
      "Title": "Fare Thee Well Love.... joannes_brother lewisfamily503"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 31, 2008 11:14PM SandyAust wrote: Steve what a beautiful little cherub!  Keep holding her close. Take care, Sandy",
      "MessageIndex": 4,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703177",
      "Title": "The boo........... ForTheMoment Fitztwins"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 8, 2008 08:24PM SandyAust wrote: I am thinking of you Deb.  Take care, Sandy",
      "MessageIndex": 145,
      "PostDate": "08/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719214",
      "Title": "I'm in the hospital AlaskaDeb spar2"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 1, 2008 05:02AM SandyAust wrote: Great news Ozzie, I am very happy for you.  Take care,  Sandy",
      "MessageIndex": 16,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708302",
      "Title": "xeloda kicks butt.. ozzie2 Adnerb"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "SandyAust wrote: Hi ladies, Breast cancer at 36 now considering having ovaries out.  I am not concerned about the surgery, had enough to now go with the flow.  However I am wondering about menopause at 42.  I had blood tests recently and I am definitely premenopausal. What should I expect from instant menopause?  What about the mood issues? Thanks Sandy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760231",
      "Title": "Instant Surgical Menopause SandyAust susand"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Sep 29, 2010 09:52AM - edited Sep 29, 2010 10:42AM by SandyAust Mazy I really wish you would PM the name and address of that stupid b*tch\" so I could jump on a plane and fly to the US and punch the stupid cow in the mouth!!! I am very tentitive about posting on this board as an earlier stager (six years out) but I am angry enough tonight to throw caution to the wind on this occasion.  I wonder why after all this time I still visit this board, but apart from keeping track of some ladies I know and care about, it is for another very important reason.  I can't just turn my back and ride off into the sunset when I know the truth of supposed pretty pink disease called breast cancer.  Some people don't get to put the disease behind them and move on with their lives.  There was a post a little while back on the depression and anxiety board about the \"dumbest things said to you\".  I was absolutely incredulous when some silly woman with DCIS got on there and posted a complaint about how a guest speaker at the \"RACE FOR THE CURE\"  spoiled her \"really uplifting talk\" by announcing that the day before she was diagnosed with the mets and was reeling with the news.  I don't get in many fights but I came out punching on that one.  It was the \"RACE FOR THE CURE\"  not the \"RACE FOR THE RIDING OFF IN THE SUNSET COVERED IN PRETTY PINK RIBBONS\"  I am still astounded at the attitude of this very lucky and very early stage lady. I am sooo sick of the bullsh*t of awareness and the absolute crap of \"support\" you know the stuff where glamourous ladies go to charity events and get all \"kumbyah\" (sorry I have no idea how to spell that so I hope you know what I mean) about the great work they are doing for awareness and support.  One event I went to shortly after my chemo at 36 involved a very glamourous function where a smily bouncy young survivor got up and modelled a glamourous gown with a plunging neckline.  Oh the applause and the oohs and aahs about this great surviver!!  I sat their in disbelief and anger not so much because I no longer wear plunging necklines but because it trivialised and sugarcoated the absolute appalling realities of this horrid disease.  I wanted to stand up and shout \"Don't you people fxxxing know that thousands of women die from this pretty pink crap!\" But I just sat there and drank more champagne and then went home as soon as possible. So what do I do?  Not much I am afraid but I don't turn my back and I take the opportunity to educate other people about this disease as often as I can.  When people blithely say \"oh you're cured now\"  I say \"No.  There is no cure for breast cancer and many people don't understand that.  I am in remission, if it comes back I will die.  I know many lovely ladies who have died from this disease and unfortunately too many young ones with young children. This is why I don't donate for breast cancer awareness, I only donate to research.\"  So this is why as an early stager my focus seems to be stage four.  I want a cure for you and for me, but mostly for you. There is a famous cricketer in Australia whose wife battled breast cancer for 11 years before she died and left two young children (born post treatment).  They had and still have a fantastic profile but how have they used that profile?...for breast care nurses.  I know many will not agree with me but I am so angry about the terrible waste of their fundraising potential.  They have raised millions and our government threw in another $12million for \"hand holders\".  I know we need our hands held, some more than most, but we have our family and friends for that we NEED A CURE! There was a post here a few days back on the this stage four forum asking what you ladies most wanted people to know about mets.  My answer was immediate as it was strong.  I didn't post because I know this is not my space.  However this is what I thought as simple as it is truthful. 1. There is no cure for breast cancer. 2. We need one now! So ladies not everyone is overlooking you.  I probably shouldn't be here but I am, for you, for me and for those who are yet to get this terrible disease.  I am not turning my back and I am telling as many people as I can that breast cancer is not pretty, its not pink and we need a cure.  It's not much but I don't know what else to do. Sorry.. Sandy",
      "MessageIndex": 16,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/758662",
      "Title": "Why do I feel we are being overlooked cmhartley blondiex46"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 6, 2012 07:48PM SandyAust wrote: Heart skipped a beat when I read the title, but this is good news. I am very happy for you Janis.    I thought of you and your boys on your respective birthdays. I will PM soon.  Primary school graduation week for my boys next week and I am out to dinner with some ladies from the Australian thread tonight. Take care, Sandy",
      "MessageIndex": 10,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797323",
      "Title": "So after my PET/CT scan my doctor said he was \"not impressed\" Fitztwins KLynn"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jun 6, 2008 04:44AM SandyAust wrote: I am so sorry for your loss.",
      "MessageIndex": 4,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706848",
      "Title": "My mom is an angel now EXAIMA omo"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 7, 2008 02:43AM SandyAust wrote: Good luck Janis.  I am thinking of you. Sandy",
      "MessageIndex": 7,
      "PostDate": "07/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719171",
      "Title": "Good luck with your Zometa today Janis LuAnnH SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 5, 2008 05:54AM SandyAust wrote: I have only just seen this post.  My path report listed my ER, PR and CERB2 status.  I am in Australia.  I am certain from my discussions with my oncologist that it is the same as HER2. Take care, Sandy",
      "MessageIndex": 8,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708152",
      "Title": "wonder if my mom should switch to Herciptin shengyue527 SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Apr 16, 2008 09:57PM SandyAust wrote: Dear Stephanie I am so sorry about this latest diagnosis.  I am thinking of you. Take care, Sandy",
      "MessageIndex": 80,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 14, 2010 10:39AM SandyAust wrote: HI Linda, I am turning up here a bit late. Anyway, I have been on Nexium for several years and I have had absolutely no problems whatsoever.  I take 40mg which is stronger than the usual 20mg dose and still no problems.  It really helps and I notice the reflux when my script runs out and i don't get it remade for a few days. By the way I used to also be on methotrexate and steroids as well as an NSAID at the same time as Nexium.  No liver issues.  I am not trying to dismiss the issues that people have, but for me it really has been one of the most benign, but helpful medications I have taken. Good luck. Sandy",
      "MessageIndex": 10,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761588",
      "Title": "Anyone taking Nexium for Acid Reflux? crazy4carrots lago"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 10, 2009 03:29AM SandyAust wrote: Happy Birthday Saint",
      "MessageIndex": 33,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730365",
      "Title": "Happy Birthday Saint!! faithandfifty hollyann"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 7, 2008 09:57PM SandyAust wrote: Nash you are so right this is horribly, horribly sad.  I didn't know Kimmie but my thoughts are with her family especially the little ones. With heartfelt sympathy, Sandy",
      "MessageIndex": 26,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708542",
      "Title": "Kimmie 39 ozzie2 mrs_X_Sunneedazee"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jan 24, 2008 11:01PM SandyAust wrote: Hi Kari, I am sorry to hear this.  I hope things get better soon. Take care, Sandy",
      "MessageIndex": 12,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/698727",
      "Title": "Week of Shots Ends KariLynn cats_love_me"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Sep 30, 2009 08:14AM SandyAust wrote: I am keeping watch. I am part of Heidi's vigil.",
      "MessageIndex": 852,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Feb 11, 2011 07:42PM SandyAust wrote: Just a comment on the Australian health care system.  Everyone here gets healthcare as a right.  Our public system is not perfect but is very good.  Me, I have private health insurance that costs us about $4k per year for our family of four. The government actually gives us a taxation rebate for having private insurance. I had my treatment in a private hospital.  However I also would have received exactly the same treatment if I had gone to a public hospital. The main advantage of private insurance is shorter waiting periods for elective surgery and being able to get a rid of a doctor you don't like.  However even in the public system you are entitled to a second opinion. It's not perfect but noone misses out completely because they don't have insurance.  I cannot begin to fathom being diagnosed with a disease like cancer and not being able to get any treatment at all.  I feel for Nerida and am planning on sending her a PM to recommend a private oncologist she can see for a second opinion in the capital of the small (very small) state were she lives.  Even though the oncologist will charge her a private fee, she will still get a rebate from the government.  Once her out of pocket reaches $500 or $1000 depending on her income the government will cover 80% of the out of pocket. One of the main problems is that we are a very large country with a small population.  Unfortunately people in regional areas do not get the same level of service as the capital cities.  The entire state has only 500,000 people and the capital city has less than 200,000.  I think the main problem is that when you are sick and frightened it totally sucks to get treated like crap by your doctors.  This can and does happen in both systems.  You gotta wonder why some people studied medicine at all.  Maybe they missed the bit where it supposed to be a caring profession. Yes I am early stage but my mother was stage four and received treatment in the public system of the same state.  Unfortunately she is now gone.  I know the oncologists there because I moved there to be with my mother.  Sadly she died before I arrived.  It is three and half years now but please no angry responses as I am still very sad.  By the way every single one of us/you is worth every damn cent spent on us/you. Take care, Sandy",
      "MessageIndex": 22,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764584",
      "Title": "Do you ever think about the high cost of your treatment? MJLToday Alpal"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 18, 2009 04:36AM SandyAust wrote: Thank you to each of you for your posts.  It has really helped me to get this off my chest. Hi Jezza nice to talk to you again.  I am sorry about your daughter, it really is the pits. Hi Viv it is nice to meet you. CoolBreeze you really understand.  Lexislove, thanks for dropping in. Signed Sandy (who is having a glass of wine but is definitely NOT an alcoholic!!)",
      "MessageIndex": 5,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744099",
      "Title": "Totally Cr*pped Off!!! SandyAust SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 12, 2007 09:26PM SandyAust wrote: Dear Stephanie I would like to give you a hug.  I feel heartbroken by Lisa's journey and I barely know her.  You must be distraught.  This is so unfair. I am holding Lisa and her dear family in my heart.  What else can I do.  We need a cure. Take care, Sandy",
      "MessageIndex": 1,
      "PostDate": "12/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/696820",
      "Title": "Update from Lisa40's Husband Kirk TripleNeg LauraGTO"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 19, 2009 04:10AM SandyAust wrote: LOL!!! I  am not a hero just a grumpy lady with one boob who really needed a whinge. I feel so much better to have had this little rant.  I really appreciate all your posts.  I needed to talk and I appreciate you listening.  I am not one of those people who can keep things \"in\". Thanks for letting me get it \"out\". Take care, Sandy",
      "MessageIndex": 9,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744099",
      "Title": "Totally Cr*pped Off!!! SandyAust SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 14, 2008 04:53AM SandyAust wrote: Kari this is wonderful!!  I am so happy for you and your family.  Good luck with those platelets. Take care, Sandy",
      "MessageIndex": 27,
      "PostDate": "14/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702118",
      "Title": "Good report KariLynn luckywife"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "SandyAust wrote: I have been on this board for four years and compared to many I dont' post much.  I am probably a bit shy.  So this is unlike to me to have such a big public whinge and air my dirty laundry publicly but IT'S TOO MUCH AND I NEED TO WHINGE. My life is good, I have a good husband, two wonderful boys (9 y.o. twins) and enough money to be comfortable. Underneath it all I am happy.  However I am just fed up with the curve balls life keeps throwing.  I know compared to many I am lucky so if trivial whinging annoys you read no further.  This is a temporary feeling I know and there is probably a bit of PMS thrown in here as well. July 2004 Diagnosed with early BC, grade three, ER+PR-.  I lived in Perth on the west coast of Australia. August 2004 Diagnosed with an inflammatory autoimmune disease it is either ankylosing spondylitis or psoriatic arthritis.  This is quite a painful and progressive disease. 2005 nearly had an anxiety attack when my kids started pre-school two months after my chemo finished.  Mentally I had been fine since the diagnosis, it was post treatment I suffered.  I went on an SSRI anti-depressant and have remained on them until recently. I quit my job at the end of my chemo to spend time with my kids.  I went back to work in August 2006.  In April 2007 my mother was diagnosed with Stage Four cancer, at first we thought it was her breast cancer recurrning from 12 years earlier.  It turned out to be Melanoma and she was dead within twelve weeks.  When I found out that Mum was dying I wanted to move interstate to be with her.  I once again quit my job to move. Unfortunatley she died before we got there.  However we still made the intersate move which was very stressful with buying and selling houses and resettling children. My smallest twin Aaron was diagnosed with a learning difficulty in Perth and when we got to Hobart, Tasmania the school just didn't want to know.  His teacher was b*tch and the poor little guy ended up hating school. Eighteen months later we decided to move on from Tasmania as it is a very small state and didn't provide the opportunities for my husbands work.  I felt bad leaving my Dad who is grief stricken and suffers from a fairly serious anxiety problem.  He has a really noticable lip-licking tic. Trying to sell our house in Hobart at the height of the GFC and look after the kids when my husband had already moved to Queensland was hard.  I was very stressed about my kids changing schools again. During my stay in Hobart my rheumatologist put me on TNF blockers a very expensive but effective medication for my autoimmune disease.  There is some uncertainty about using this medication in patients who have had a previous cancer. We have been in Brisbane since January.  Long story short.  I had a suspected carcinoma of my thyroid which turned out to be benign after they cut half my thyroid out to check.  However my rheumatologist here made me stop the TNF blocker in July re the cancer thing.  Now I am in pain every day and so tired that I am very cranky and irritable.  I am also working part-time for a boss who is almost impossible to please.  I am an accountant and I know I am doing a good job but it still isn't fun when someone is always complaining. About two months ago my alcoholic, divorced sister with three children aged 12,14 and 16 attempted suicide two times.  Once in front of her 12 year old daughter.  I copped a lot of abuse from her about being lucky and not giving time to my harder done by family members i.e. her.  I will point out she won't admit that she needs to stop drinking.  At times I have received abusive texts and had her screaming and crying at me on the phone.  Apparently I am responsible for making her life better.  I am very concerned about her children and me and my husband are doing as much as we can to help the kids. Four weeks ago my 60 y.o mother-in-law broke her neck at the C2 level falling off a hay trailer on her farm.  She lives a six hour drive from Brisbane.  We have visited twice which exhausts me because of my arthritis.  We have also spent hours on the phone providing suppport and fighting with the hospital over totally inadequate care.  One night she spent fourteen hours lying in her own faeces.  This is a spinal injury patient who could not help herself.  Fortunately she is to make a very good recovery.  We are extremely lucky given the dangerous nature of her injury. My pain has been getting worse.  In amongst this I have changed from an SSRI to a trycyclic anti-depressant to help with the non-restorative sleep and pain of my arthritis.  I really felt strung out while making this change.  Things seem to be settling down though. I found out yesterday that my sister go picked up on Friday night for drink driving for the second time in less than 18 months.  She was over 0.15 both times, the limit is 0.05.  This is a very serious offence and if she does it a third time she will be up for a mandatory jail term.  She lost her license for six months last time, this time it will be at least a year. She quit her duty managers job at a hotel a while back because she was on a verge of a breakdown.  Anyway this week she was to start running a family daycare.  This is what she did when her kids were younger.  Well on her first day her little dog got let out accidently and was run over and killed.  She was screaming and hysterical and had to call the parents of the kids in her care to come and get their little ones. It is so sad about her little dog but I am very worried about her future if she can't make a success of this work. I have left messages and sent texts offering support but I have been ignored.  She will probably call when she needs something or she wants someone to yell at. Well that is selfish little me - tired and in pain and fed up that things just can't settle down for a few minutes.  I am also trying to coordinate building a house.  I wrote a letter to my rheumatologist that if I can't get my medication back through the government I will pay for it myself.  This will cost about $20k per year after tax, which is roughly equal to how much I earn in my part-time job. I think if I wasn't so tired I would be feeling less weighed down. Well if you got this far into my little keyboard trantum you have done well.  Thanks for 'listening'. I feel better now, I think. Sandy P.S. I am not mean. I do care about my sister it is just so draining on top of everything else. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/744099",
      "Title": "Totally Cr*pped Off!!! SandyAust SandyAust"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Feb 20, 2009 05:52PM SandyAust wrote: I am very happy for you.  What great news!",
      "MessageIndex": 60,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729384",
      "Title": "Got Excellent News Today!!!! LuAnnH Calico"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 19, 2010 09:15AM SandyAust wrote: Mari65 If you want a really comprehensive answer your oncologist can probably give you one.  The important thing is to make sure you really want to know and how you will deal with the information.  Everybody approaches their diagnosis in their own way and that is how it should be.  Do what is best for you.  I know a lot of people don't like statistics but I do.  I know new things are coming up all the time but I take the best that medical science has to offer at the time, both with treatment and risk assessment.  My tumour was 18mm, grade 3, 0/2 nodes, ER+PR- Her2-.  I was 36 and therefore premenopausal.  I had a mastcetomy, due to a large amount of high grade DCIS as well as the 18mm tumour. No rads, 4 rounds of EC and five years of Tamoxifen. After my chemotreatment my oncologist said my risk of recurrence was 20%.  That's 1 in 5, at 36 to me that was not a small risk, but better than many others, but not great especially when you have two four years olds.  At five years out, interstate move, new oncologist.  Told 5 years out my risk of mets was 6 or 7%.  Much better.  In ER+ tumours the risk drops, as has mine, but then it just cruises along unchanged.  I asked for how long. I was told, up to 25 years. This is my reality.  It could be a lot worse and I am grateful that it's not worse and I deal with it.  Hey I am saving for retirment!  However I don't think that risk is small and certainly not extremely small.  Due to family history I also have a 20% lifetime risk of ovarian cancer.  BRCA1 and BRCA2 inconclusive (we don't get negative results in Australia).  My risk was assessed by my geneticist. I am six years out.  Happy, grateful and mostly unworried.  However my life will never be the same since that day a few months after my 36th birthday. Everybody circumstances are different based on their cancer (sorry I hate that terminology) and its characteristics.  So if you really want to know, ask your onc.  I did and when she told me the risk would be there for 25 years I said \"Gee thanks\".  And she said \"Well you asked\"  and I thought \"Well yes I did and I wanted to know so I am just going to have to deal with it.\"  Do what is right for you.  Take care, Sandy",
      "MessageIndex": 15,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762100",
      "Title": "Stage 1 and Mets mari65 barbe1958"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 19, 2009 06:51AM SandyAust wrote: Hi CoolBreeze, I am five years out. I was much like you during diagnosis and treatment. Once treatment ended though I kind of fell in a heap. No that's a bit strong.  I became anxious.  I think when it was happening I probably in a bit a denial. I am not sure about that though, maybe I just had good coping strategies. After treatment I went through one to two years of worrying about recurrence and having to make the best of my second chance. I had to not sweat the small stuff and really live the life I wanted.  Oh the pressure!!!  No wonder I nearly had an anxiety attack when my kids started pre-primary school. It was all over a human anatomy jigsaw puzzle and a bunch of feral five year olds (I would love to tell you more...but sniff...I just can't relive it...I'd rather do more chemo.)  Now I am back to saving for retirement (hey - how positive is that?) and getting pissed off when people cut me off in traffic.  \"Yes I know life is short - but you're still an a***hole!!\" Actually I was on holidays when I got my positive biopsy result and it was going to be two weeks before I flew home to see my doctor and find out what was going on.  I was actually angry at my husband for being upset, he was spoiling my holiday. LOL Take care, Sandy",
      "MessageIndex": 19,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743506",
      "Title": "Diagnosed and not Worried CoolBreeze Cisatypo"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 2, 2008 06:12AM SandyAust wrote: Hi Kari, I am sorry to hear you are doing it tough.  Chemo REALLY is awful, you are entitled to complain.  I know we all try to put a positive spin on it, but quite frankly it sucks.  My heart goes out to you. I think the suggestion of asking for nuelasta sounds like a good one.  You can even give the shot to yourself (or get hubby to do it) so that you don't have to go back to the hospital at all.  I actually asked a nurse friend to do it for me at home when I did my chemo as I was too chicken to do it myself!! I don't really belong on this board so I am never sure of how much to say, but please know that I am thinking of you and your kids. Take care, Sandy",
      "MessageIndex": 11,
      "PostDate": "02/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701377",
      "Title": "Chemo is kicking my ass! KariLynn britbaby"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jun 28, 2008 01:06AM SandyAust wrote: Dearest Kari, I almost felt my heart stop when I read your post.  You poor love.  I know I barely know you but I always hold you and your children in my heart and I think of you often.  Whenever I log on I do a search on your name to see how you are going.  I guess it is because we are the same age and we both have kids.  You are also such a lovely, funny and incredibly sensible person.  I truly admire you.  I wish I could come around and clean your bathroom and then give you a big hug and cook you a quick meal before I left.  However Australia is a bit far from your place so you will just have to make do with this silly post.  I truly hope that all the love we are all sending to you and your family provides you with some small amount of comfort.  What else can I say?...just that I really, really care andI hope for the best for you and yours. Take care, Sandy",
      "MessageIndex": 42,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jan 12, 2009 06:16AM SandyAust wrote: Dear Amber, I can't talk to you like a fellow stage four I can only talk to you as another mother.  You are not a lousy mother.  You are your children's mother, their only mother, the only mother they will ever have and you mean the absolute world to them.  Every bit of time your children have with you is precious and they will treasure it for the rest of their lives.  Nobody loves a child like a parent and kids know this and it helps them.  Even when you are having the crappiest day they are happy you are there.  Amber I wrote to you a while back because I checked out your website.  You and your family are so beautiful.  I don't just mean beautiful in the way of appearances, but beautiful in that the obvious love and happiness you have as a family just shines out of those photos.  You have created five beautiful children and your love just radiates out of them.  You are not a burden you are the reason they are here.  Having lost my mum recently I feel you are entitled to choose quality over quantity, even though your children are young, however that is only a decision that you can make.  Feel peace with your choice, you deserve at least that. I am sorry if I have chosen the wrong words.  I just really wish I could offer you some comfort. Holding your hand from afar... Sandy",
      "MessageIndex": 15,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727168",
      "Title": "I am ready to quit.... mrs_X_Sunneedazee lovinmomma"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Feb 28, 2008 12:23AM SandyAust wrote: I was diagnosed with breast cancer and psoriatic arthritis in July 2004.  I improved during chemo.  Unfortunately I can't get access to the best medication (biologics) as I need a diagnosis of psoriasis by a dermatologist to get be eligible under the rules here.  Unfortunately no psoriasis since the chemo. Other than that I am doing great and for that I am very grateful. Take care, Sandy",
      "MessageIndex": 21,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701178",
      "Title": "How many with BC and autoimmune diseases like LUPUS, RA, ? badboob67 wintersocks"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 17, 2008 09:55AM SandyAust wrote: HI Janis, Best of luck with the surgery.  I will be thinking of you as always. Take care, Sandy",
      "MessageIndex": 22,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725990",
      "Title": "I will be offline for a few days.. Fitztwins LuAnnH"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Mar 16, 2009 07:43PM SandyAust wrote: Hi Colleen, It seems like to you are trying to be a good friend to Monica and that is very kind of you. I am not Stage 4 but I am going to make some suggestions.  My first suggestion is that you give her a link to these boards as she will find a lot of support and information here.  She may not be ready to do that just now, but at least she will have the link if and when the need arises. My second suggestion is to do with feelings.  Even though I was diagnosed early stage, I found it very difficult sometimes to be jollied along and told that everything would OK.  I was facing a serious diagnosis and I was frightened.  I needed my fears to be validated and listened to.  Do small things to help Monica (shopping, cleaning, pick up kids) if you sense that will help. But most importantly just be there to listen.  Sometimes she will want to be uplifted and other times she will just want acknowledgement of how serious her situation is.  I am in Australia, and our cancer council has booklets on how to support someone with cancer.  I am sure they do in your country as well.  This might be something you could seek out. My third suggestion is that you do some research on the four stages of cancer, so you better understand the potential gravity of the situation.  Don't get me wrong there is a lot of hope, and you will see many examples of it here.  If she has a node in her neck, I am assuming it is a supraclavicular node.  There is some debate about whether this is stage 4 or not, but it is very serious.  There is no cure for breast cancer. Stage four can be treated successfully often for many years but there is no cure..yet.   I wish your friend and you well.  There is lots of hope and lots of positive stories here, and lots of support for those inevitable down days. Good luck to you both and take care, Sandy ",
      "MessageIndex": 1,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730811",
      "Title": "I need positive survivor stories for my friend! Please help! monicasfriend LuAnnH"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 21, 2010 08:07AM SandyAust wrote: ...and soon to celebrate double digits for your double blessings.  I like your new avatar and for some reason am wondering what type of sandwiches you like to eat. Take care, Sandy ",
      "MessageIndex": 39,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756854",
      "Title": "2 years ago...I was diagnosed with mets Fitztwins jenny66"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Feb 22, 2010 07:41AM SandyAust wrote: Barbe, do you really think so? I am (no actually was) stage 1 grade 3.  I don't think I would prefer to be stage 3, grade 1.  I KNOW I would rather be stage one. If I was Stage 3 I think I would feel exactly the same as many of the ladies here. I would want respect shown to the circumstances surrounding my stage. However the thing that upsets me is when my stage gets written off as nothing (not saying that has happened here).  I had a grade 3 invasive tumour just under 2cm and extensive high grade DCIS.  I lost my breast.  I did the chemo, puked my guts out and lost my hair.  I was also terrified as I was 36 and had two four year olds.  I have had some scares and tests begets tests and lead to more surgery.  I had half my thyroid out last year on suspicion of cancer.  This was a direct result of looking for a recurrence in my supraclavicular nodes due to swelling above my collar bone.  My oncologist won't release me, even after five years. I hate my experience being trivialised. However I absolutely would not prefer to be Stage 3 at a lower grade. In fact if I was Stage 3 I would be offended by that comparison.  That is not meant to be offensive to you Barbe but is simply how I view it. I really don't know why I am posting now.  The last time I posted on a thread like this was about three years ago and I cried until snot and tears poured out my nose and all over my keyboard. Not a good look...or feeling. Kind thoughts to all here. Sandy",
      "MessageIndex": 188,
      "PostDate": "22/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/748156",
      "Title": "RESPECTING the STAGE threads **RANT** cherneski Nico1012"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 29, 2011 01:35AM SandyAust wrote: Thank you for posting these photos.  Amber was a beautiful person inside and out.  Her children reflect that beauty.  Those children will definitely cherish those beautiful photos.",
      "MessageIndex": 9,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773854",
      "Title": "Amber's (Mrs_X_Sunneedazee) daughters photos Joanne58 cookie97"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "May 6, 2008 03:08AM SandyAust wrote: Sorry I know this is off topic, but I am bumping up this thread as I am about to start Remicade soon for psoriatic arthritis.  Has anyone used this medication?  How did you go with it?  Did you get a good response and were there many side-effects?  I really have my hopes up. Thanks in advance, Sandy",
      "MessageIndex": 47,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701178",
      "Title": "How many with BC and autoimmune diseases like LUPUS, RA, ? badboob67 wintersocks"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "May 17, 2009 12:58AM SandyAust wrote: I am not Stage 4 so I am butting in here, but I am so glad this thread has been restarted.  I have posted on the \"Not diagnosed with mets or recurrence but concerned\" board twice about an issue and I have not received any replies.  My posts are \"Arthritis Meds lead to recurrence\" and \"Enbrel, Remicade, Humira\". I have psoriatic arthritis and I am currently taking Humira and Methotrexate.  Prior to that I was on Methotrexate and Remicade.  I have just moved interstate for the second time and I have a new rheumatologist.  She does not want me taking these TNF inhibitors.  The TNF stands for tumour necrosis factor so there is a concern that it could impede your bodies ability to fight tumours. Given that I have had breast cancer she is concerned that I should not be on these drugs.  I don't want a recurrence or to take unnecessary risks but if the risk is small I am prepared to take it for quality of life reasons.   I am also currently about to undergo surgery for possible thyroid cancer.  My rheumatologist also referred me to a geneticist (not sure why as I was tested about three years ago) anyway that has prompted me to contact the family of a long last Aunt and confirm that she did in fact die from Ovarian Cancer.  Now I have had BC at 36, Mum BC at 49 and dead from melanoma at 64 and my mother's sister dead from ovarian cancer.  My geneticist wants me to have my ovaries out. I really apologise as I know I should not be complaining here but I am kind of getting a bit stressed lately.  Breast cancer in 2004, psoriatic arthritis 2004, Mum dead within 12 weeks of melanoma diagnosis in 2007 interstate move, 2009 another interstate move, possible thyroid cancer and my rheumatologist has freaked me out about the only medication that has managed to get my arthritis under control, geneticist wants my ovaries out.  If any of you ladies are on Enbrel, Humira or Remicade I would really appreciate some feedback on what your oncologists have had to say about this.  My oncologist in Hobart (where mum was) didn't seem too bothered about me taking this.  I see my new oncologist in Brisbane tomorrow for the first time for my six month checkup.  I am going to ask him about this. By the way, I am not flippant about taking risks.  I have two nine year old boys and I take my health seriously.  However this is a big QOL issue so I don't want to react rashly.  Any information that can be shared would be greatly appreciated. Thanks so much. Sandy ",
      "MessageIndex": 67,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701178",
      "Title": "How many with BC and autoimmune diseases like LUPUS, RA, ? badboob67 wintersocks"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Apr 16, 2008 07:56PM SandyAust wrote: Dear Donna, I am so sorry for the loss of your sister Theresa. Sandy",
      "MessageIndex": 35,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704009",
      "Title": "MY SISTER IS AN ANGEL sisterlove ozzie2"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "May 18, 2009 05:23AM SandyAust wrote: I spoke to my new oncologist today.  He said he is happy for me to continue on the Humira.  I am so relieved. I am still interested in other people's experiences.  He also said taking Humira was a smaller risk than keeping my ovaries.  I said I would think about that after I get through settling into a new city, a new job and surgery for possible thyroid cancer.  I probably will have them out, but I need time to absorb this. Any info on the tnf inhibitors still would be greatly appreciated. Take care, Sandy",
      "MessageIndex": 72,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701178",
      "Title": "How many with BC and autoimmune diseases like LUPUS, RA, ? badboob67 wintersocks"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jun 5, 2010 02:14AM SandyAust wrote: Lisa I am so NOT surprised to see this post from you. When I looked at your other post about the finding the best doctor I was absolutely furious on your behalf when I read your story and the fact that you received no adjuvant (sp?) treatment.  I thought it was outrageous particularly when you begged him for it.  Why the hell didn't he give you tamoxifen? What a b@#$#@d!  Sorry I said I was annoyed for you.  I was ER+PR- Her2-, no nodes, 18mm grade 3 tumour and 4cm of high grade DCIS.  I got mastectomy, 4 rounds of EC and tamoxifen for five years.  I have not recurred. You are not being sue-happy and you are absolutely entitled to consider this path.  In Australia I would know where to look for the \"standard of care\" protocols for my diagnosis.  This is where you need to start.  If you didn't get standard of care, he will need to justify why not, particularly in the light of the fact that you begged him for adjuvant therapy. I think the money will help you.  However you need to make sure you are prepared mentally because it will undoubtedly be very stressful.  Ask your solicitor if your medical training will work against you.  There was a very sad case here of a paediatrician with two young kids who lost her case against a very negligent (IMHO) GP due to her medical training.  You need to know where you are likely to stand with this. I don't know what else to tell you except that there is a young mother in Australia with young kids who is very p*ssed off on your behalf!!  If this is what you want to do then go for it, you are definitely entitled to feel let down and to hold this guy accountable. All the best. Sandy",
      "MessageIndex": 19,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753654",
      "Title": "Attorney in the house? lisa34lisa lisa34lisa"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "May 11, 2008 10:32PM SandyAust wrote: Stable is good. Go avastin!!! I am thinking of you Kari. Take care, Sandy",
      "MessageIndex": 18,
      "PostDate": "11/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705274",
      "Title": "CT Scan - Stable! KariLynn candie1971"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 8, 2008 06:10PM SandyAust wrote: Stephanie I am so glad that you are home and feeling a little better.  Take care, Sandy",
      "MessageIndex": 24,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708729",
      "Title": "Welcome home, Stephanie(TripleNeg)!!! AnnNYC badboob67"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jun 13, 2011 10:50PM SandyAust wrote: Janis, for what it is worth, I do not think you are selfish.  Not at all. You are a mom to two lovely boys doing the best you can each and every day.  You are also human and therefore you have feelings.  Sometimes those feelings are good but somedays they are not.  It is reality. You are not selfish.  Take care, Sandy",
      "MessageIndex": 18,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770281",
      "Title": "You think you get used to it... Fitztwins lorieg"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 12, 2010 06:01AM - edited Nov 12, 2010 06:07AM by SandyAust I think I must have misunderstood the question.  Yes the process of getting fitted and buying a prothesis  took less than an hour.  I did wait for six weeks after surgery though.  So which ever way the question was intended I waited six weeks and then it took an hour. Edited to add:  I have worn fairly low sleaveless shirts and in photo it looks like I have cleavage.  I don't wear plunging though, and low slung armholes don't work the best due to a \"dog ear\" on the mastectomy side. I was diagnosed at 36, am 42 now, I find buying clothes and bras are not an issue.  However swimwear does my head in!   Although I have adopted a bit of an attitude  that \"if you look that hard, you deserve what you get!\" lol Take care, Sandy",
      "MessageIndex": 24,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/760228",
      "Title": "How long does it take to get a prosthesis singletona80 Barbaramess20"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Oct 9, 2007 02:30AM SandyAust wrote: Shelli I hope you are at peace now.  You were such a truly lovely lady and I feel so sad that you have passed.  My heart is with your family especially your precious children. Sandyxx",
      "MessageIndex": 132,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692418",
      "Title": "Shelli is an angel geeta75 Sige"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 24, 2009 06:11PM SandyAust wrote: Hi Coolbreeze, My post is immediately before yours so I have to say I didn't mean to imply that you would come crashing down at some point.  I was just sharing my story and unfortunatley in my story I did become anxious after treatment stopped.  A lot of that was focussed around my kids who were four at the time.  I am probably being a worrywart but I just wanted to clarify that. When I was diagnosed I never felt like saying \"Why me?\", it was more of a case of \"Why not me?\"  Also when I was on holidays I just wanted my time to be happy as I knew I couldn't do anything about my diagnosis until I got back and saw my doctors.  My poor husband was so upset and I was SO mean to him for spoiling my holiday!! Take care, Sandy",
      "MessageIndex": 21,
      "PostDate": "24/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743506",
      "Title": "Diagnosed and not Worried CoolBreeze Cisatypo"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Jul 3, 2008 05:57PM SandyAust wrote: Rest peacefully dearest sweet Kari.  You were a wonderful person who I so deeply admired.  I feel so sad that you are gone from this world, we were blessed to have you in it. My heart goes out to Kari's family, especially her beautiful and much loved children. With heartfelt sympathy,  Sandy",
      "MessageIndex": 33,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Feb 14, 2010 04:48AM SandyAust wrote: Actually don't say anything....just come around and clean their house and leave a casserole when you go.",
      "MessageIndex": 13,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748288",
      "Title": "Six Things You Shouldn't Say to a Cancer Patient EnglishMajor RobinWendy"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Oct 30, 2011 03:13AM - edited Oct 30, 2011 04:22AM by SandyAust thats-life as I said to you a couple of weeks ago in a PM. You are truly gracious and compassionate person.  Relatives, includiing husbands of stage four ladies have been posting on this board for years. No I am not stage four but in my observation those people have always been welcome.  It is the \"please tell me if this is mets\" questions that offend. Thatslife if I ever make it to Victoria (hope I got the state right this time) I would love to meet you for coffee.  Never doubt your own strength and kindness. Sandy PS Edited to take out thatslife's first name....sorry. ",
      "MessageIndex": 18,
      "PostDate": "30/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775731",
      "Title": "Caregiver for my mom lleddick thats-life-"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Oct 30, 2011 04:09AM SandyAust wrote: CoolBreeze, just a comment on your point number 1 above.  You have previously told a poster enquiring about a new trial for their stage four relative (Arumbicin I think it was) that they could seek support on the friends and family section.  So it would appear that you do mind people asking those kind of questions.  I think the record needs to be corrected there. Also the mods did not tell you off.  They were reassuring the original poster, and other caregivers, that they were welcome on this board.  A PM to you would not have served that purpose.  However perhaps a PM would have been in order as an additional step as this would be your fifth or sixth post of this nature.  However perhaps the mods were trying to satisfying the dual goals of making the original poster feel welcome and allowing you to rightfully express an opinion to which you are entitled. Full credit to the mods for their efforts, particularly over the last six months to a year. For the record, in case you need to know.  I am not stage 4.  I am seven years out.  Yes I am still here.  I have friends here.  I hope you recover from your UTI soon and I wish you the best. Sandy",
      "MessageIndex": 19,
      "PostDate": "30/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775731",
      "Title": "Caregiver for my mom lleddick thats-life-"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 13, 2008 06:46AM SandyAust wrote: Merry Christmas Janis.  What great news.  Hugs those kids!!!",
      "MessageIndex": 44,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725786",
      "Title": "I did get some good news.. Fitztwins celia088"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 3, 2010 12:42PM SandyAust wrote: Yes you pretty much get it straight away. I am in Australia so I can't comment on specific retailers but here I went to a shop and got fitted.  The whole thing took less than an hour. Good luck. Sandy",
      "MessageIndex": 2,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/760228",
      "Title": "How long does it take to get a prosthesis singletona80 Barbaramess20"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Aug 3, 2008 03:56AM SandyAust wrote: Dear Jon, Thank you for a most beautiful post about a  most beautiful lady.  I admired Kari beyond words.  She was a wonderful, funny, kind and incredibly sensible woman.  You and your family  are blessed to have had her in your lives as we were blessed to have had her in ours.  I am so sorry for your loss.  My heart goes out to you and your children. Take care, Sandy",
      "MessageIndex": 174,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Nov 21, 2012 02:18AM SandyAust wrote: Farewell Lowrider, my tin-wearing, asparagus-smoking friend...the henhouse won't be the same without you. Your son is a credit to you and will be your enduring legacy in this world as you move onto the next one...take care Sharon",
      "MessageIndex": 65,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796556",
      "Title": "Lowrider, Facebook post mnmom3"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Dec 17, 2008 11:38PM SandyAust wrote: Crystal I am so sorry about your Mom.  I lost my Mum to cancer last year.  I know how much it hurts and I am really thinking of you all.  I wish peace for you all.",
      "MessageIndex": 13,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726052",
      "Title": "Moms fight is coming to an end! cneal318 Marple"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Oct 27, 2008 08:44AM SandyAust wrote: Dear Amber I am thinking of you. Sandy",
      "MessageIndex": 7,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723418",
      "Title": "Mrs_X_Sunneedazee LuAnnH Fitztwins"
    },
    {
      "AuthorID": "SandyAust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10327/profile",
      "Content": "Oct 15, 2009 04:00PM SandyAust wrote: A beautiful name, a beautiful face, a beautiful person.... It is so sad that you have passed, but your five dear children that you loved so much will be your legacy. To Dan and children my most heartfelt sympathy.",
      "MessageIndex": 41,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742156",
      "Title": "Mrs_X_Sunneedazee (Amber) dmacw janie44"
    }
  ]
}