{
  "AuthorID": "Sandy316",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76775/profile",
  "Posts": [
    {
      "AuthorID": "Sandy316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76775/profile",
      "Content": "Dec 30, 2008 02:33AM Sandy316 wrote: HI Harley, Thanks for your reply.  I am confused, you said that you get yearly gyn exams and then say the lump had been there 8 to 10 years.  So if you were getting regular exams how was it missed for all that time? Did you have mammo's during those 8 to 10 years?  If so, then was it just not seen in those mammo's?  Also when it was finally seen was it on the mammo or only on u/s?  Thanks for your feedback.  Sandy",
      "MessageIndex": 3,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/726440",
      "Title": "Unsure about lump Sandy316 leaf"
    },
    {
      "AuthorID": "Sandy316",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/76775/profile",
      "Content": "Sandy316 wrote: In Sept during a breast exam by my Dr. she found something in my breast close to my left armpit.  I could not feel anything myself but was tender in the lymph area under both armpits.  I had a mammo and it came clean.  So I forgot about it then someone said I should have a ultrasound.  So I called the Dr and found out an ultrasound was already scheduled.  I couldn't make the scheduled time so resechuled. When I went for the test they said the Dr. had not given them the order and the Dr was no longer with the clinic.  So I forgot about it.  This weekend I did a self-exam and in the same area the Dr found something I know feel something like a peanut.  I have had cysts before and this feels very different.  I am 47, have large, dense (from mammo) breasts (36DD), in menapause & take Estradiol patch (hormone treatment), I started periods when I was 13, I do not smoke and drink only on occasion, my mom had cyst (one surgically removed from her armpit) & my dad prostate cancer (although I am told that is not a risk factor).  Anyways the question is should I be concerned?  Is there anyone who has had a similiar story and would like to share?  I plan on getting further testing but in the meantime would like to know about any one else who has had a similiar situation. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/726440",
      "Title": "Unsure about lump Sandy316 leaf"
    }
  ]
}