{
  "AuthorID": "Sandycna25",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282671/profile",
  "Posts": [
    {
      "AuthorID": "Sandycna25",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282671/profile",
      "Content": "Sandycna25 wrote: ok so back story here is I am a mom of 4. 27 years old. Grandma had bc in her 50's and mom was diagnosed at 47. This lump has been here for 7 months. When it first appeared in April I did everything for blocked milk ducts know to man. Nothing helped. Its not painful, and ultrasound confirmed it is solid. Had my ultrasound last Tuesday showed a 1.2cm mass. She said it could be a galactocele but fine needle aspiration could be done or they could make me wait another 6 months and I am not ok with waiting anymore. It took me 2 different Drs and 3 visits just to get the US ordered. She rated it a birad 3 but it is palpable and I feel she gave it that because I'm nursing. And while I understand it could be nursing related I would be more comfortable knowing for sure than letting it sit there for over a year. Even if its nothing I need to be sure. Has anyone experienced this? Any advice or experience would be greatly appreciated Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868502",
      "Title": "Just has ultrasound waiting on follow up Sandycna25 Sandycna25"
    },
    {
      "AuthorID": "Sandycna25",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282671/profile",
      "Content": "Nov 23, 2018 11:09PM Sandycna25 wrote: I have tried to upload screenshots of my ultrasound report but its not allowing me to.",
      "MessageIndex": 1,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868502",
      "Title": "Just has ultrasound waiting on follow up Sandycna25 Sandycna25"
    },
    {
      "AuthorID": "Sandycna25",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/282671/profile",
      "Content": "Sandycna25 wrote: I haven't gotten any answers to my previous posts but I will try 1 more time as my support system at home is nonexistent. My ultrasound came back with findings that given my family history the Dr decided to refer me to a surgeon for fine needle aspiration. I am wondering what to expect from this procedure. Obviously aside from worrying about results I am a nursing mom and worried about pain after the procedure. I would love to hear some experiences from people who've had this procedure and bonus if you were nursing at the time. Thank you. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868706",
      "Title": "Waiting on fine needle aspiration Sandycna25 teachermomfl"
    }
  ]
}