{
  "AuthorID": "sandj",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189003/profile",
  "Posts": [
    {
      "AuthorID": "sandj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189003/profile",
      "Content": "Jun 12, 2014 05:40AM sandj wrote: I had ALND when I had my mastectomy. The recovery was very difficult, I did lots of physical therapy. My surgery was at MDA and they gave me lyrica immediately before my surgery and then I continued it for 10 days post op. I do not have any nerve pain from the procedure and I think lyrica helped with this. My surgeon said his reasoning for the ALND was that I was young and that he had seen recurrences in the LN when this was not done.",
      "MessageIndex": 40,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816528",
      "Title": "Axillary Lymph Node Dissection annabananas Batesburg"
    },
    {
      "AuthorID": "sandj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189003/profile",
      "Content": "Nov 28, 2018 04:36PM - edited Nov 28, 2018 04:37PM by sandj I had a liver resection over 5 years ago for a single liver met. The risk was worth it. I had \"limited metastatic disease.\" I am still on perjeta and herceptin, but I have remained NED. Recovery was hard, that is a tough surgery. They do not recommend laprascopic. With open surgery they can also ultrasound the liver itself while in there. I had my surgery at MDA. Feel free to PM me.",
      "MessageIndex": 1,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868577",
      "Title": "Has anyone had liver mets resected? Honeybee68 santabarbarian"
    },
    {
      "AuthorID": "sandj",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/189003/profile",
      "Content": "Jul 5, 2014 10:17PM sandj wrote: I am so, so sorry, Kelly. I was 31 at dx. It is all very scary, but this is a great community. Ask questions, get very informed. I had an aggressive tumor and lots of different layers of treatment.  I think it is very important to treat aggressively from the beginning. Feel free to PM me anytime.  Hugs!",
      "MessageIndex": 38,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/822044",
      "Title": "It was confirmed today (33 years old). Kelly1217 whatnow"
    }
  ]
}