{
  "AuthorID": "Sanduchi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
  "Posts": [
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Jan 19, 2016 08:53AM Sanduchi wrote: Hey Shelley! Just wondering if there was an update from your appointment last Friday? I also have FEA and am having an excisional biopsy/lumpectomy on Jan 29. My BS felt that it is worth removing as the FEA is presenting with a palpable lump. She said that it is very likely that FEA is all that is present, but for the few cases that DO reveal something more sinister, there is no way of necessarily predicting who will have anything lurking and who won't. I am mostly having it removed for peace of mind. I just don't want to think about it anymore.",
      "MessageIndex": 5,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/839870",
      "Title": "Flat Epithelial Atypia Shelleylala Sanduchi"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Sanduchi wrote: Hello all! Just wondering if anyone else has Flat Epithelial Atypia. I know it's not common but I would love to hear others experiences. I have a 2nd opinion with a BS in a few weeks. Going crazy with the wait and there isn't much info out there about these cells. I know FEA is not generally considered \"at risk\", but I still don't like the fact that I have anything \"abnormal\" near a 2.5cm lump. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/833428",
      "Title": "Flat Epithelial Atypia-Anyone else? Sanduchi 614"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Aug 4, 2015 06:09PM Sanduchi wrote: Hey all, not sure if anyone is still seeing this as it feels like I was waiting forever for my second opinion! I met with the bs who was wonderful! She made me feel so comfortable and really explained everything. I now need to have an excisional biopsy, but the bs said it will be more like a lumpectomy as she needs to take some layers of tissue around the lump just to make sure. The surgery will most likely be in October, due to vacations and things in the next few months. Many thanks to all for the encouragement and support. Hopefully this is the end of my breast woes!",
      "MessageIndex": 4,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/833428",
      "Title": "Flat Epithelial Atypia-Anyone else? Sanduchi 614"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Jul 16, 2015 07:47PM Sanduchi wrote: Wow, thanks so much for sharing your experiences. I'm so sorry they did actually find something, but you are right, you sure are lucky to have great doctors who cared enough to keep looking. I know there's a high probability that my FEA lump isn't hiding something \"nastier\" in or near it, but the fact that there is no clear cut treatment plan for FEA and it's such a gray area between doctors makes me happy I am getting a second opinion. Now, if only August 4th could hurry up and get here... Blessings to you",
      "MessageIndex": 2,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/833428",
      "Title": "Flat Epithelial Atypia-Anyone else? Sanduchi 614"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Oct 1, 2015 11:34AM Sanduchi wrote: Wishing you the best Marion55! Hope all turns out well!",
      "MessageIndex": 6,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835252",
      "Title": "Excisional Biopsy/Lumpectomy Sanduchi Sanduchi"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Sanduchi wrote: Hi all, I am not sure if this is the right category to post, but I would love some encouragement/information. In January 2016, I am having what is technically an excisional biopsy, but the BS is calling it a lumpectomy because she is going to have to remove some extra layers of tissue around the 2.5cm lump due to Flat Epithelial Atypia. I am not nervous about the surgery, but I have an active 2 year old at home and will have to arrange assistance for recovery. Can anyone share your experience with recovery after a lumpectomy? How long did it take? Did you have to take strong pain killers? Any information is welcomed. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835252",
      "Title": "Excisional Biopsy/Lumpectomy Sanduchi Sanduchi"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Sep 25, 2015 08:37AM Sanduchi wrote: Thank you so much ladies! It's great to know that recovery is shorter than I expected. My lump is superficial so hopefully it will be a quick recovery for me. Here's to no more worrying about this little lump!",
      "MessageIndex": 4,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835252",
      "Title": "Excisional Biopsy/Lumpectomy Sanduchi Sanduchi"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Feb 3, 2016 09:59AM Sanduchi wrote: Hey all, Just wanted to update--Results are B9!! So glad to be done with this little lump. Prayers and thoughts for the rest of you still waiting on results or facing treatments.",
      "MessageIndex": 51,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/840683",
      "Title": "How could a lump have cancerous and noncancerous parts? StaceySue2U kaylynn"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Jan 26, 2016 03:18PM Sanduchi wrote: Hey ladies- Mind if I join you? I am having an excisional biopsy/lumpectomy on Friday. BS thinks it's a fibroadenoma, but the CNB found some flat epithelial atypia. So, because of the atypia, she wants to take some layers of tissue around the lump (roughly 2.5cm) just to make sure. She isn't particularly worried about it, but it's a \"just in case\". However, after reading some of the experiences here, I need to be ready for anything. I am 99% sure it's nothing, but for peace of mind, I want this thing out! Oh yeah, I'm 31, distant family hx of BC, no other health issues.",
      "MessageIndex": 12,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/840683",
      "Title": "How could a lump have cancerous and noncancerous parts? StaceySue2U kaylynn"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Jan 28, 2016 11:37AM Sanduchi wrote: Hey ladies, Looks like I missed a lot since my last post! I'm at work so I can't respond individually but just wanted to say, I go in for my surgery tomorrow. I'm not nervous, except about the medical bills to follow. Ha ha. We have one of those horrible high deductible health plans so I'm nearly waving goodbye to my savings. Boo. I will let you all know how it turns out. :)",
      "MessageIndex": 33,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/840683",
      "Title": "How could a lump have cancerous and noncancerous parts? StaceySue2U kaylynn"
    },
    {
      "AuthorID": "Sanduchi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215433/profile",
      "Content": "Jan 31, 2016 10:46PM Sanduchi wrote: Stacey, so sorry to hear your news. My thoughts are with you! Surgery went well on Friday. No major issues or pain so far (nothing that these nice little pain pills don't fix!). Tried to only use ibuprofen today but I had to go back to the strong stuff. The lifesaver for me has been wearing my \"around the house\" bra. No cups or wire, just soft and helps keep things in place. I haven't taken it off!! It's so helpful. Results in a few days. Surgeon isn't too concerned that it will be anything more than atypia. I will keep you posted. Thanks for your thoughts and prayers",
      "MessageIndex": 41,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/840683",
      "Title": "How could a lump have cancerous and noncancerous parts? StaceySue2U kaylynn"
    }
  ]
}