{
  "AuthorID": "Sandy1941",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
  "Posts": [
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Aug 16, 2007 10:21AM Sandy1941 wrote:",
      "MessageIndex": 1,
      "PostDate": "16/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/678342",
      "Title": "Visit with surgeon today-MIXED EMOTIONS melevebos Harley44"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Jun 17, 2009 11:25AM Sandy1941 wrote: My Dear....NEVER put off exams or medical tests for $$$$!  If your body is trying to send you a message, LISTEN!!!  a small lump may be benign, 80% are, but don't, PLEASE DON'T ignore a signal.  Call a state agency, I think most all of the states have free mammograms and testing, regardless of age...RUN, RUN to the nearest clinic and just satisify your mind that you are in good health.  Think of it....if you were spotting blood, or had cramps and knew it wasn't your period time, would you ignore what your body was trying to tell you?  Something might be wrong, but it may be nothing.   I've never understood why we women know immediately that bIoodly discharge needs to be checked out right away, but lumps we think can be ignored???  I  BEG you, don't worry about debt....take care of yourself!!!  This advice from a two time breast cancer survivor...and I'm still here because I took advantage of the medical advances of the past 10 years.  True, I had good insurance, but don't ignore your health because you don't have insurance!  The choice is yours, but help is available if you research.  Best of Luck and my Prayers are with you!",
      "MessageIndex": 1,
      "PostDate": "17/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/736010",
      "Title": "Diagnosis before insurance.. bad idea? almost30 Sandy1941"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Apr 11, 2008 11:56AM - edited Apr 11, 2008 11:59AM by Sandy1941 I am having two stereo biopsies that my breast surgeon and radiologist didn't recommend.  My doctors recommended that I wait 6 months for another mammo to watch some new microcalcs that they think are actually old calcs\". So, who is doing the biopsies?  General surgeon?  2nd opinion breast surgeon?  Before I'd do stereo biopsies, I'd get 2nd opinion from another breast surgeon and another radiologist.  As a 4 yr. survivor, stereo for microcalcs a year after lumpectomies (bilateral IDC) I believe they don't disturb or subject you to unnecessary testing. Find a BC specialist and radiologist you TRUST and follow their lead. Remember to research exactly what microcalcs are; waiting for 6 months to retest shouldn't pose a threat.  This is not a defineable mass - just a 'possible' irregularity.  Don't put the cart before the horse. Good Luck!",
      "MessageIndex": 1,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/703789",
      "Title": "radiation & trauma due to biopsies bopsie Sandy1941"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "May 12, 2009 01:10PM Sandy1941 wrote: I went through the same thing - bilateral lumpectomies for IDC in 2004 and rads to the (L) only.  2006 microcalcifications on the (L) and stereotactic bx - came back benign.  Chin up, friend.  in 2008 discovered ILC in the LEFT (R has stayed clean) so another lumpectomy and brachytherapy to the (L).  First brachytherapy in 2004 was to inner upper quadrant - in 2008 it was to lower outer quadrant.  IDC was ER+; ILC was ER-.  Guess I was supposed to experience variations so I could become even more well-read on the subject.  I'm not complaining - missed chemo both times and also having brachy I was 30 days from DX to end of treatment - both times.  Blessed I am - My Prayers are with you that 'this too shall pass'.  ",
      "MessageIndex": 2,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/734049",
      "Title": "calicifications following lumpectomy phylls CasinoGirl"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Nov 19, 2009 01:42PM Sandy1941 wrote:",
      "MessageIndex": 9,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744175",
      "Title": "Where to start? sparkyhammerjigsaw CinD"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Nov 19, 2009 01:22PM Sandy1941 wrote: First of all, RESEARCH, RESEARCH and MORE research!  This is the best site (I started here in 2004) and it saved me from a disaster!  2004 diagnosed with bilateral IDC, (2.5 and 1.4 cm) and two surgeons said mastectomies and chemo 'to save my life'.  After spending hours and hours here, I knew I wanted a 3rd opinion.  You don't get to do 'overs' and reverse mastectomies!  I asked about lumpectomies and brachytherapy.  1st surgeon said 'no way - too risky' and 2nd one said he 'didn't know that much about brachytherapy and only one hospital in my city had the machine (he didn't practice at that hosp).  And, thus I discovered that there are treatments and options available, but if that Dr. or Hospital isn't equipped, they don't review all the options with you.  Big $$ in cancer treatment.  Long story short, I did go for 3rd opinion and had bilateral lumpectomies, SN were clear and I had brachytherapy to the (L) only.  Brachytherapy is high dose radiation (HDR) interstitial - 20 tiny catheters shot through the breast- and radiation delivered via the catheters 2xs a day for 5 days.  NO rad burns, nothing.  Then on Arimidex for 5 years. No chemo. And, in 2008, here I go again.  This time ILC to the left, .6mm.  Again, lumpectomy and mammosite radiation.  10 nodes removed...all clear.  And so, here I am - a whole person and no chemo, now healthy and continuing on with my life and my family.  I know I am Blessed a thousand times, but I'll be forever thankful that I chose to read, read, read and be a part of my treatment plan.  Why use a mortar or a shotgun when a BB gun will defeat the beast?  Remember, your dear wife is the one that has to pick up the pieces.  This is a war, but the Generals (the surgeons, etc.) go home and continue on with their lives after they survey the carnage they created......the infantryman is left to clean up the pieces left, physically and mentally.  Don't jump into any treatment plan until she is calm and confident her choices are right for HER.  Now, true, I may not be here 5 years from now, but when I was diagnosed the second time, I told the surgeon \"I have lived such a full life these past 5 years....give me another 5, and if the beast returns a third time, then I'll call out the cannons\".  But don't carve me up and poison me unless there is no recourse\".  This site has all the information to make good, sound decisions, and lots and lots of support.  Our Prayers are with you, your wife, and your family!  Come, give us your hand....we'll all walk with you!",
      "MessageIndex": 8,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744175",
      "Title": "Where to start? sparkyhammerjigsaw CinD"
    },
    {
      "AuthorID": "Sandy1941",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/12301/profile",
      "Content": "Jan 22, 2008 03:10PM - edited Jan 22, 2008 03:11PM by Sandy1941 Sueps in UK:  The world's largest breast cancer symposium is the 30th San Antonio Breast Cancer Symposiumand was held in San Antonio, Texas December 13-16, 2007.  Professionals come from every country to share the latest news, treatments, study results.  Try to google or use this site to find out the summary of their conference.  Good Luck!",
      "MessageIndex": 3209,
      "PostDate": "22/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}