{
  "AuthorID": "Sarah0915",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
  "Posts": [
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Nov 7, 2015 03:09PM Sarah0915 wrote: Hi Deblc. You symptoms are the same ones I had along with some acid reflux. Thought I was taking too much anti-inflammatory for too long due to sciatica. My doctor's first thoughts were to change the anti-inflammatory and have an ultrasound because the symptoms were so similar to gall bladder symptoms. Had the ultrasound and went in to get the result planning to schedule gall bladder surgery. Wham - innumerable liver mets, as the pathologist said \"too many to count\". I have managed nausea with Zofran (worth its weight in gold), diarrhea and abdominal cramping with Lomotil, and pain with Hydroco/APAP 5/325 and Morphine when it is really bad. I was on Faslodex and developed a couple of small bone met so Xgeva was added. Bone mets haven't been a problem and side effects were tolerable. Some fatigue and nausea but felt much better. After 7 months of Faslodex I was feeling worse so chose to add Ibrance. I am on my first cycle now and feeling better with no serious side effects yet. I think a decision to stop treatment is a very personal one based on many factors. I've already told my doctor that I don't intend to go on any infusion chemotherapy. I'm not sure I will even try other oral ones if the Ibrance becomes intolerable or stops working. I am only 62 but have led a long and very full life. I don't have children or grandchildren. My partner of 36 years fully understands and supports the way I feel. If chemo is going to make me so sick that I can't get outside and do some things, walk my dog, etc. I will not use it just to extend my life 6 months or so. I have already made too many compromises like camping and hiking, managing my landscaping, etc. I guess overall I'm saying I believe in quality of life over quantity. My biggest regret right now is that I don't live in a state that supports assisted suicide. But, I just don't feel up to a move and I love my home. I know many women on this board have very different opinions and have tried every available option and continue searching for other treatments and hoping for breakthroughs. They have been through some difficult treatments and never regretted it. I respect their strength and fully support their decisions. I equally support the decision of someone who declines further treatment. I think there is only one thing we all probably agree on - having metastatic breast cancer sucks. I wish you and all of the rest of us the best with the decisions we have to make in the future. ",
      "MessageIndex": 2441,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Sep 8, 2015 11:16AM Sarah0915 wrote: Worried Daughter - I'm not sure about the SVU value range. I just know that I'm always happy when mine is lower than on the last scan. For example my liver mets went down from 11 - 13 to a maximum SVU of 8.4 so that is good news to me. Hope your Mum does well.",
      "MessageIndex": 2236,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Jul 7, 2015 10:18AM Sarah0915 wrote: leftfootforward - It is thrilling to hear that you were at the world cup finals. What a fantastic game. Those young women played their hearts out. They certainly are great role models and I hope your young ones will get inspiration from them. Boo123 - This is my first round with liver mets so I don't have any idea how long they were growing before diagnosis. I do know that I had many gastrointestinal problem for at least 5 months which finally sent me to the doctor. I changed medication for my arthritis and was sent for a gall bladder ultrasound. Oddly, before I got to the ultrasound, I developed severe right lower quadrant pain which sent me to the ER and got the ultrasound right away. That's when the proverbial poop hit the fan and I found out it was the liver mets all along. I've had one recurrence with the severe pain but my major problems have been all sorts of gastro symptoms including what you described. Sometimes I eat well and other times I don't eat at all. Reflux comes and goes and it doesn't seem to matter what I have eaten or not eaten. Fortunately, Pepcid Complete works well for me most of the time. I certainly hope your scans come out well and your doctors find a simple solution.",
      "MessageIndex": 2057,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Sep 8, 2015 10:57AM Sarah0915 wrote: I have been feeling pretty lousy lately so my MO had a repeat PET/CT. Liver and bone mets looked either the stable or slightly improved. The biggest problem was ascites. I am feeling bloated and I've been having lots of nausea, no appetite, some abdominal pain, etc. Kind of normal liver mets symptoms for me. My MO suggested that I have ultrasound guided fluid removal with an interventional radiologist, thinking if they can remove even 500 - 1,000 cc I will feel much better. I've read a lot about fine needle aspiration or paracentesis but it everything I've seen is when there is a large fluid build up and several liters are removed, not as little as my MO thinks they may be able to remove. Has anyone been through this procedure with such a small amount of fluid removal?",
      "MessageIndex": 2235,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Dec 24, 2015 09:04AM Sarah0915 wrote: Nancy, it is overwhelming at times to be filled with sadness and despair. I'm sure you've been through it many times before. It is really painful and I am sorry you are at that stage. But, I agree with iliveformybabies. It is o.k. to give in to your sadness, fear, and grief for a while. I think we would all go nuts if we didn't. Then, pick yourself up and face the new challenge with all the strength you can muster. I hope that comes soon for you.",
      "MessageIndex": 2603,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Oct 14, 2015 12:39PM Sarah0915 wrote: I found hydrocodone 5/350 very helpful with sciatica. Occasionally needed 2 but 1 usually worked. Mine is intermittent now thank goodness but I also remember how bad it was when it was constant and more severe. After it calmed down, I used 2 aleve per day to keep it at bay. Ibuprofen works better for some than aleve and some people periodically alternate between the two.. Oddly enough, my MD and I thought I was having a problem with my stomach and anti-inflammatory which led to an ultrasound to be sure it wasn't a gall bladder problem. That's when my liver mets were found. Hope you find something that works.",
      "MessageIndex": 7,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835610",
      "Title": "Any Medication Recommendations for Sciatica Pain GoldenGirls GoldenGirls"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Feb 14, 2015 09:11AM Sarah0915 wrote: Freebird, I was just diagnosed with liver mets in early January. What led me to the Dr. was severe right abdominal pain running to by back and up into my right shoulder. That lasted a couple of days then improved to just pain with a deep breath, sneeze, or cough. That improved greatly over the next few weeks. Then I had another attack that was similar to the first about 3 weeks later. My doc says the liver was swollen/inflamed. He can't explain why it comes and goes. Pain meds have worked well both times but it really wiped me out for a few days.",
      "MessageIndex": 1255,
      "PostDate": "14/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "May 21, 2015 08:58AM Sarah0915 wrote: RonnieKay, sorry my message wasn't clear. I take hydrocodone 5mg with 325 mg. of tylenol in it 2 times a day. I'm so used to the abbreviation hydroco/apap 5/325 I didn't think about it not making sense to someone else. When I was pretty sick right after my liver mets diagnosis, I way telling my doctor that I had totally lost all taste for any type of alcohol. I didn't even want a nice glass of wine with dinner. He told me he hoped to have me back enjoying an occasional glass of wine with dinner quickly. He was successful :) I love good craft beer so I have maybe a couple a week if I am out and about or a glass of wine with dinner a couple of times a week. I know it puts additional stress on my liver but I'm not giving up everything I enjoy.",
      "MessageIndex": 1814,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Mar 1, 2015 10:51AM Sarah0915 wrote: I don't think the loony bin is in order chichimaine :) I'm not a doctor , but my guess would be more likely nerve re-generation where nerves were cut and are starting to re-grow some. I had one mastectomy in 2009 and a prophylactic one in 2012. After both, I had all kinds of weird sensations. One of the more interesting was phantom pain in what felt like one of my nipples. Just out of nowhere I would get these stabbing pains. They weren't too bad though and I could massage the area on the scar and it would go away pretty quickly. The most troubling ones are itching in areas where I still have no sensation. It's hard to scratch an itch where there is no sensation :) I no longer have pain but both scars are still very tight and I have to massage with lotion daily. Light massage may help if the area isn't too sensitive. Hope it doesn't become too problematic.",
      "MessageIndex": 1382,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Nov 7, 2015 03:13PM Sarah0915 wrote: Just a brief follow up I thought of concerning abdominal pain and diarrhea. Since I wasn't feeling like eating I was using a lot of yogurt and dairy based protein shakes for nutrition. My doctor suggested I back off so many dairy products and that has really helped eliminate a lot of the diarrhea.",
      "MessageIndex": 2442,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Feb 6, 2015 04:24PM Sarah0915 wrote: So sorry to hear this Ella. I know how frightening it can be. However, I would think if surgery is possible, that is a good sign. Often times there are too many lesions or they are spread throughout the liver such that surgery isn't possible. My thoughts are with you.",
      "MessageIndex": 1195,
      "PostDate": "06/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Mar 2, 2015 07:21PM Sarah0915 wrote: So sorry to hear the bad news, SyrMom. Hope the scan results will be encouraging. Hope you find something you enjoy to take your mind off things and to take a break from the anxiety. Good music, good book, movie, walk in the park ?",
      "MessageIndex": 1390,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "May 20, 2015 08:58AM Sarah0915 wrote: I take a fair amount of hydrocodone/tylenol prescribed by my oncologist. I've questioned him about the tylenol and he says at the level I use it, it is fine. I never take over 5/325 mg. of tylenol 2 x day. If my pain requires more than that, I use morphine. He also recommends Aleve instead of Ibuprophen for inflammation. Of course though, all of our situations are different and I'm sure recommendations have a lot to do with our liver function lab results.",
      "MessageIndex": 1804,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Feb 24, 2016 12:08PM Sarah0915 wrote: Happy belated Birthday, leftfootforward. I think we have all grown to appreciate another birthday, spring, fall, etc. I am happy to see a new spring beginning to pop out for now.",
      "MessageIndex": 2798,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Feb 10, 2015 09:37AM Sarah0915 wrote: Hug my loved one and dog daily. Enjoy the little things I sometimes paid little attention to, like a flock of beautiful cedar waxwings in my yard yesterday. Coast of Mexico near Cancun next week where all week I'll be singing the Zack Brown country song \" I've got my toes in the water, ass in the sand, not a worry in the world, a cold beer in my hand. Life is good today, life is good today...\" New Orleans area in May for swamp tours, good food, and cemetery tours. I know it's morbid but I just love to see how loved ones are memorialized in cemeteries and they are supposed to be pretty fantastic there. Renting an oceanfront house on the coast of Maine in July and August to sit in the hot tub, watch the lobster boats, and listen to the crashing waves. Eat as much lobster and fried clams as I want. My best friend ever who makes me constantly laugh and I haven't seen is years is coming to spend time with us. That's a start anyway. Hope everyone else enjoys the big events and the small things that make life wonderful.",
      "MessageIndex": 49,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828214",
      "Title": "Bucket List- what did you include? Maureen813 Maureen813"
    },
    {
      "AuthorID": "Sarah0915",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/210646/profile",
      "Content": "Jun 15, 2015 12:21AM Sarah0915 wrote: exbrnxgrl - I just returned yesterday from a two week trip to Alaska. It was spectacular. I used a travel agency out of Petersburg, Viking Travel, to customize a trip using the Alaska Marine Highway and small planes. I hope you enjoy it as much as I did.",
      "MessageIndex": 8,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832050",
      "Title": "Trip insurance without pre-existing medical? nancyh Sarah0915"
    }
  ]
}