{
  "AuthorID": "sarahlou1967",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125954/profile",
  "Posts": [
    {
      "AuthorID": "sarahlou1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125954/profile",
      "Content": "sarahlou1967 wrote: Hello everyone I have recently been diagnosed with Grade 3 IDC that is Her+2 with lymph nodes that are enlarged or slightly affected, had MRI scan yesterday results this thursday got to go and have bone scan tuesday the 5th, and cardiology scan next friday, I am absolutely petrified that it has spread to other organs, they told me the chemo would mop up any stray cancer cells that may have travelled, they have'nt told me how big my lump is only that it is large, the onc told me that the plan of treatment is chemo with herceptin 6 sessions then a mastectomy then rad treatment then reconstructive surgery. I feel like I'm not on this planet at the moment its a bit like going through the motions eating drinking sleeping all on autopilot, any new pain or twinge I get totally paranoid and think the worst. Obviously still waiting for results is driving me up the wall its been a month since my doctor found the lump, just want to get on with chemo, just some action would help. Has anyone else got the same dx as me? particularly anyone who had the same dx and is at the other end of the treatment. Thanks for listening. Dx 2/2011, IDC, 6cm+, Stage IV, Grade 3, 1/13 nodes, mets, ER+/PR-, HER2+ Chemotherapy 4/9/2011 Taxotere (docetaxel) Targeted Therapy 4/12/2011 Herceptin (trastuzumab) Surgery 9/12/2011 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right Hormonal Therapy 9/19/2011 Radiation Therapy 1/4/2012 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766772",
      "Title": "Newly Diagnosed with G3 sarahlou1967 SpecialK"
    },
    {
      "AuthorID": "sarahlou1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125954/profile",
      "Content": "sarahlou1967 wrote: Hi ladies,  Was hoping for a bit of advice, am on taxotere and herceptin at the mo and experiencing extremely runny eyes with sinus blocked up I know this is a side effect but can anyone recommend something to take to aleviate these aggrevating symptoms it driving me up the wall.    Dx 2/2011, IDC, 6cm+, Stage IV, Grade 3, 1/13 nodes, mets, ER+/PR-, HER2+ Chemotherapy 4/9/2011 Taxotere (docetaxel) Targeted Therapy 4/12/2011 Herceptin (trastuzumab) Surgery 9/12/2011 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right Hormonal Therapy 9/19/2011 Radiation Therapy 1/4/2012 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769859",
      "Title": "streaming runny eyes and blocked sinus sarahlou1967 dogeyed"
    },
    {
      "AuthorID": "sarahlou1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125954/profile",
      "Content": "sarahlou1967 wrote: Hello, Went for my 1st follow up appointment with my breast surgeon yesterday I was a bit shaken as I didn't realise I would have to have a mamo on the good breast, went in and on the screen my previous mamo scans were up, I had never seen them before probably because I was frightened at the time but was feeling up to looking at them yesterday, it really brought it home to me not that I am living in denial but seeing it just adds another dimension to your understanding.  He mentioned that he was very busy (he was seeing 36 other women on that same day!!!! what is going on? why so many women with this dammed disease?) but wanted me to make another appointment with him to discuss reconstruction this is something I have been wondering about for a little while now and I think I underestim ated my emotional response to having a mastectomy I was always \"not a big deal, I've got small boobs anyway\" but I realise now how much of a loss it is to lose a body part and how much it affects you. I'm to make an appointment with my BCN and my surgeon when he has more time to discuss a recon with me.  I am surprised he offered me it as when I had my mx they told me they would not perform a recon because of the secondaries. Has anyone else with secondaries had a recon? and do you think its worth putting your body through more surgery? Any thoughts on this would be most appreciated, many thanks love and light to you all sarah xx Dx 2/2011, IDC, 6cm+, Stage IV, Grade 3, 1/13 nodes, mets, ER+/PR-, HER2+ Chemotherapy 4/9/2011 Taxotere (docetaxel) Targeted Therapy 4/12/2011 Herceptin (trastuzumab) Surgery 9/12/2011 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right Hormonal Therapy 9/19/2011 Radiation Therapy 1/4/2012 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794191",
      "Title": "Recon after mx and stage IV dx sarahlou1967 LuvRVing"
    },
    {
      "AuthorID": "sarahlou1967",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125954/profile",
      "Content": "sarahlou1967 wrote: Hello all, I haven't been on the American boards for sometime but wanted to ask any of you who are like me: ie stage IV (lung mets) from the start and have been on Herceptin for nearly 2 years and tamoxifen for a year. I started to put weight on when I started taking the tamoxifen and its been piling on ever since, I never used to put on weight ever!! I was always a size 8-10 and weighed about 9st since starting the tami I am now over 11 stone!!! thats 2 stone in one year. I know its the drugs because I don't eat that much and certainly don't eat a lot of sugar or fat, I do yoga and exercise regularly and like I said I've never put on weight before in my life. I'm guessing its the tamoxifen and not the Herceptin thats causing this, obviously I was pushed into early menopause which will change things. The weight is like a tire around my middle, although sometimes I feel bloated/swollen all over my tummy area. Is anybody else experiencing this whilst on the same drugs? and if so what do you do about it if your on herceptin forever? I'm at my wits end with this, I juice daily and eat sensibly, what else can I do? Any advice would be most appreciated. Love and light to you all Sarah xxx Dx 2/2011, IDC, 6cm+, Stage IV, Grade 3, 1/13 nodes, mets, ER+/PR-, HER2+ Chemotherapy 4/9/2011 Taxotere (docetaxel) Targeted Therapy 4/12/2011 Herceptin (trastuzumab) Surgery 9/12/2011 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right Hormonal Therapy 9/19/2011 Radiation Therapy 1/4/2012 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801351",
      "Title": "On Herceptin forever and taking Tamoxifen, weight gain again.... sarahlou1967 AnacortesGirl"
    }
  ]
}