{
  "AuthorID": "Sarahjones",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206621/profile",
  "Posts": [
    {
      "AuthorID": "Sarahjones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206621/profile",
      "Content": "Oct 20, 2014 08:45PM Sarahjones wrote: Well I went to the surgeon today, and it was good news and bad news. The good news is they all came back b9 but they think they biopsied the tumor beside the bad tumor twice and didn't do the bad one. So now they will call me tomorrow to set up my surgery to go in and remove the tumor that they think is cancer. I hate theat I have to wait longer now but I'm glad that they admitted that they made a mistake. I was suppose to get my results tomorrow but my drs nurse called and got me in today!",
      "MessageIndex": 27,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825248",
      "Title": "Nervous! MaryJC MaryJC"
    },
    {
      "AuthorID": "Sarahjones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206621/profile",
      "Content": "Oct 18, 2014 06:15AM Sarahjones wrote: I just had 3 core biopsies done yesterday and they didn't hurt at all, this morning just a little sore to touch. I go back tues the 21st for my results. They told me the one in my right was benign but my left is their biggest concern. I also had to wait 2 weeks to get my biopsies done. Good luck with yours! Praying!! I will see if I can post my ultrasound report. ",
      "MessageIndex": 22,
      "PostDate": "18/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825248",
      "Title": "Nervous! MaryJC MaryJC"
    },
    {
      "AuthorID": "Sarahjones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206621/profile",
      "Content": "Oct 18, 2014 06:22AM Sarahjones wrote: ULTRASOUND BILATERAL BREAST Indication: Breast lumps, abnormal mammogram. Comparison: Diagnostic mammogram 9/24/14. Findings: Sonographic imaging targeted to the suspicious abnormalities on mammography and the patient's palpable lesion was performed. At 2:00 in the left breast located about 5 cm from the nipple, there is a correlate to the lobulated mass seen on mammography. This lesion measures 1.0 x 1.0 cm. It has lobulated contours. It has a taller than wide appearance and produces posterior shadowing. This solid mass is suspicious for cancer. Slightly more posterior in the breast, but less than a cm away is a more benign-appearing, but solid mass. This elongated oval mass measures 8 x 6 mm. It has a smooth posterior wall and allows good through transmission of sound. This may just be a benign fibroadenoma, but solid composition is also worrisome for cancer. In the 8:00 region about 14 cm from the nipple where the patient feels a palpable abnormality, there is no suspicious solid or cystic focal lesion. In right breast at 11:00 about 7 cm from the nipple there is a corresponding lesion to the mammographic abnormality. This measures 20 x 8 mm. It has an elongated oval shape with circumscribed margins. The lesion allows good through transmission of sound, but does appear solid. This has a similar appearance to the deeper lesion in the left breast at 2:00. This may also represent a fibroadenoma, but solid composition is worrisome for malignancy as well. The most worrisome lesion is in the left breast at 2:00 more anteriorly. The smaller elongated oval solid nodule is in close proximity at a more posterior depth. These lesions should be amenable to ultrasound-guided biopsy requiring only one percutaneous access point. Suggest that the specimens from each lesion be placed in separate specimen containers. Also suggest biopsy of the more benign-appearing and deeper lesion first to avoid contamination of that specimen from the more suspicious lesion. That should be easy to acquire as this is the deeper lesion and will likely be encountered on the approach to the more suspicious lesion. I also suggest ultrasound-guided biopsy of the right breast lesion at the same appointment since the patient has such a high risk for breast cancer as she reports genetic testing positive for a breast cancer gene. Alternatively, biopsy could be obtained of the most suspicious lesion followed by breast MRI to assess the other 2 lesions, but that may just prolong inevitable probable biopsy of all 3 lesions if MRI is not classic for a benign fibroadenoma for the 2 oval lesions. Impression Suspicious abnormality -- Biopsy should be considered (BI-RADS 4). Recommendation: Ultrasound-guided biopsy bilateral, 2 lesions at 2:00 on the left and one lesion at 11:00 on the right. Suggest continued clinical followup of the palpable abnormality as it has no mammographic or ultrasound correlate",
      "MessageIndex": 23,
      "PostDate": "18/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825248",
      "Title": "Nervous! MaryJC MaryJC"
    },
    {
      "AuthorID": "Sarahjones",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206621/profile",
      "Content": "Oct 21, 2014 01:25PM Sarahjones wrote: they called this morning and I go in for the mass to be removed wed oct 29th, another week of waiting. This has been going on since sept 18th and I'm ready to just get it done and move on. Thanks for the positive thoughts and prayers!!",
      "MessageIndex": 30,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825248",
      "Title": "Nervous! MaryJC MaryJC"
    }
  ]
}