{
  "AuthorID": "sarahrae",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
  "Posts": [
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Aug 15, 2016 04:24PM sarahrae wrote: I would def get a second opinion. My path report looks very similar to yours, my onco score was 24 and I was strongly encouraged to have lumpectomy/chemo/rads/hormone therapy. I was hoping to avoid chemo and possibly learn about potential trials and other options, so I went over to duke for a second opinion. The MO there had the very same recommendation for me. I am a little shocked that you would not be rec'd chemo, I was surprised to find out that the chemo only reduced my recurrence rate by 4%, my MO said that she strongly recommends it even at just 1% reduction. There may be very good reasons they aren't rec'ing it for you, but either way a second opinion can only help. Obviously you could ask for some clarification from your current docs, but you may ultimately feel more comfortable with a different MO. I switched MO's simply to have better communication, I think that it is important to have someone that you gel with as you will be working with them over several years. sending hugs and thanks for sharing!",
      "MessageIndex": 563,
      "PostDate": "15/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Jun 20, 2016 09:49AM sarahrae wrote: Hi Hootowl and cbowle. I've been visiting this thread for a couple of months now and anticipate started rads next week. Hootowl, I'm glad to hear about the integrative nursing, I'm looking forward to that. I am assuming that you are being treated at Mission. I will go in today for my initial set up appointment. Sending gratitude and blessings to all, thanks for sharing all of your experiences and wisdom. ",
      "MessageIndex": 905,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Jul 30, 2016 03:44AM sarahrae wrote: me too - the sore throat thing comes and goes",
      "MessageIndex": 1244,
      "PostDate": "30/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Aug 11, 2016 03:33PM sarahrae wrote: Cathytoo~ so good to hear! I am 6 zaps from finished and really looking forward to my body having more energy to direct towards regrowing hair, skin cells, lung tissue, etc. And exercising again, sounds wonderful :) hope the good stuff keeps coming your way!",
      "MessageIndex": 1265,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Jun 21, 2016 06:58AM sarahrae wrote: Thanks for the warm welcome! Awesome to have so many from NC. Cbowle, I have lived in Haywood and Jackson counties~loved them both! Deacon~ yes, your name makes perfect sense now! I lived in WS for about two years, still miss it! was a great re-entry point for NC from my San Francisco years! Had my CT appt yesterday, waiting for my dry run appt to be scheduled. will likely start next week. Going to grab up some creams today while I'm out, including a script I received from an integrated MD in the area. They mix it up at the Montford Chinese Acupuncture and Herbology Clinic, I'm anxious to see what is in it! congrats to those that are finished and thanks for all of the shared info, struggles, and joy! ",
      "MessageIndex": 933,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "sarahrae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/232190/profile",
      "Content": "Jan 16, 2017 06:53PM sarahrae wrote: yep, same here(can't remember if I already posted this). Def sore, think a bit of it is lymphadema, some the tissues/nerves still healing and tightening, my physical job, and the AI's. the rib under my breast was hurting pretty bad off and on so I finally asked my MO for a scan. No signs of cancer/tumor, so I figured must be from the above reasons, but still unnerving. PT has really helped sending hugs",
      "MessageIndex": 1295,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    }
  ]
}