{
  "AuthorID": "Sara536",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
  "Posts": [
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 21, 2018 12:51PM Sara536 wrote: Have you asked your doctor for pain medication? Sometimes providers wait to see if you ask. I had that experience in the hospital after my first surgery. I woke up in terrible pain. When the nurse came around she said, ”You must have a really high tolerance for pain! It turns out she was waiting for me to ask. I had no idea - I was trying not to be a difficult patient or something. I talked to the doctor about it when I saw him next. He was so mad! His orders were for every three hours and that It should be offered to me without asking. Now I make sure to moan and groan and watch the clock. You should not have to be in pain. Ask your doctor what the plan is for pain. Maybe she just forgot to write you a prescription.",
      "MessageIndex": 1,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/861823",
      "Title": "Nipple Delay surgery & pain clr23 Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Aug 24, 2016 10:43PM Sara536 wrote: I think most insurance allows for a second opinion or even a third for surgery. Maybe try a female surgeon. It is most important that you find someone who is able to make the effort to try to understand where you are coming from whether they are male or female. I've been thinking a lot, lately, about this breast oriented society we live in and how women are often defined by the size or shape of their breasts. Do we want breasts because men expect them or do we need them because they are an integral part of our self image? How much pain are we willing to put up with? How many surgeries? Would we be less likely to suffer a recurrence if we choose this or that? These are hard decisions but the one thing I am certain about is that I wouldn't want anyone to make them for me and I wouldn't want to wake up with any surprises. Maybe even put the decision and surgical plan in writing.",
      "MessageIndex": 2,
      "PostDate": "24/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/847319",
      "Title": "Surgeon doesn't believe me ... christmas718 radgal"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Apr 7, 2018 10:10PM - edited Apr 7, 2018 10:13PM by Sara536 I suggest that you find a “talk\" therapist of some sort who will try to help you to analyse the cause of your anxiety. (Maybe even get a second medical opinion first since you don't seem to believe that you don't have anything to worry about) but I doubt that many medical doctors will have the time or even the interest in dealing with anxiety other than to prescribe an anti-anxiety medication. Although you are understandably focused on the possibility of breast cancer right now, your anxiety may have a compleatly different origin that doesn't have anything to do with physical health. Although everyone is welcome here, It may not be the best place for you to hang out where so many do have a diagnosis. Better to enjoy your youth and your good health (and get regular checkups).",
      "MessageIndex": 4,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/863825",
      "Title": "Breast Cancer dream, anxiety, please help! artisto101 Meow13"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Sep 3, 2016 08:16PM Sara536 wrote: Does anyone know if it is true that if you have had radiation therapy, then surgical redo of reconstruction is not possible?",
      "MessageIndex": 11,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840176",
      "Title": "Re-do of Reconstructive Surgery TruckGirl MsVeryDenseBreasts"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 26, 2017 03:50PM Sara536 wrote: You don't need to wait for a previously scheduled exam. Your regular gynecologist will make room for you if you have disturbing symptoms. She will refer you for a mammo or surgeon if necessary. You'll have much less anxiety if you go straight to the experts. I hope there is a benign explanation for your symptoms.",
      "MessageIndex": 1,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859702",
      "Title": "Change in breast size Gutinstinct Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Apr 28, 2018 06:26PM Sara536 wrote: Vampeyes, Leydi is right, GO TO THE ER NOW. These are not symptoms to ditz around wiih. Take it seriously please!",
      "MessageIndex": 6,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/864282",
      "Title": "Cough, chest pain, hard time breathing..... vampeyes Johned9"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 30, 2017 10:33AM - edited Nov 1, 2017 05:09PM by Sara536",
      "MessageIndex": 2,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859776",
      "Title": "Pain in left breast? Kylersmommy1010 Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Dec 11, 2017 04:29PM - edited Dec 11, 2017 04:34PM by Sara536 I don't know how many different kinds of scar tissue there are but I had a band across my chest under the visable scars beneath my breasts (double lift after lumpectomy) It kept getting tighter and tighter. I've heard this referred to as the \"iron bra syndrome\". Three sessions of heavy massage and stretching by a specially trained physical therapist took care of it completely. The first time I actually felt a snapping sensation (not painful) like she was breaking it up. It was such a relief! It went all the way accross my chest. I had total breast radiation on only one side. PS: I see you are from the SF Bay Area. I'd be happy to recommend my PT if you send me a private message.:)",
      "MessageIndex": 2,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860765",
      "Title": "What has helped Reduce your Scar Tissue? sm627 FranFlamini"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 27, 2018 11:12AM - edited Jan 27, 2018 11:19AM by Sara536 What about asking your doctor directly if he/she is suggesting someone hit you? I wouldn't let them get away with recording a “blow to the breast\" if there was no blow. It sounds like a sloppy diagnoses to me. One goes to a doctor for diagnoses based on facts and observations, not assumptions. I'd expect a doctor to come up with something better than that. Melissa's idea sounds like a plausible explanation to me.",
      "MessageIndex": 9,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861985",
      "Title": "Radiologist says Lump is a bruise but Rolle Rolle"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Aug 20, 2017 06:35PM - edited Aug 25, 2017 04:54AM by Sara536",
      "MessageIndex": 1,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/858057",
      "Title": "Pain issues should I seek help faster than next week? RoxiT8801 Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 18, 2018 09:12PM - edited Jan 18, 2018 09:16PM by Sara536 It's tempting to pop a pimple but it's also a good way to introduce bacteria and spread it around. If you really, really think it might be cancer, enough to look for advice on a cancer forum, don't even think of trying to pop it or dig it out and spread that around. We cannot diagnose or give you permission. You need to see a doctor",
      "MessageIndex": 10,
      "PostDate": "18/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861725",
      "Title": "PLEASE READ !): very scared and need advice... aino_l aino_l"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Sep 25, 2018 05:46PM - edited Sep 25, 2018 05:47PM by Sara536",
      "MessageIndex": 4637,
      "PostDate": "25/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Nov 9, 2018 04:39PM Sara536 wrote: DancingElizabeth, I love your name! Please don’t change it back. I bet it it has a positive influence on you (how could it not?) even if you don’t always feel like dancing.",
      "MessageIndex": 4676,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 29, 2017 08:11PM - edited Oct 30, 2017 07:04AM by Sara536",
      "MessageIndex": 23,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/859730",
      "Title": "Low Oncotype, node-positive and chemo decision Ckat HoneyBeaw"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 16, 2017 02:11AM - edited Oct 16, 2017 02:13AM by Sara536 I am very surprised that no one here seems to remember their own breast development. One breast bud often starts before the other. They are very tender. It seems like forever before the breast behind the buds develops. Breasts are very often not the exact same size. Please take a deep breath before you totally freak your daughters out. Be thankful that she came to you with her concern and do remember and share your own experience with her. If it is really different than you remember, taking your daughter to a female doctor would definitely make it easier for her to ask questions, especially if she is the shy sort. ",
      "MessageIndex": 26,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/762258",
      "Title": "Breast lump in 8 year old Gibs NotVeryBrave"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jul 31, 2018 10:38PM Sara536 wrote: The ultrasound and MRI don’t involve radiation. It would be a good idea to keep a running list of all of the x-rays, CAT scans, sestamibis, etc. that do use radiation that you are exposed to. Include time and place and if you are asked to repeat any for some reason, try to have it done on the same machine- it makes for a better comparison. No one else will be keeping track. Also, I hate to say it but facilities that own the machines love to use them (think $) especially emergency rooms. Once you have a scan that finds something incidentally that they weren’t looking for (like an asymptomatic benign lung nodule which many people have) they will want to follow it for 2 or 3 years to see if it grows. That happened to me and after the third one, the radiologist wanted a fourth because she said it was done on a different machine. (of course no one bothers to ask where your last one was taken- I could easily have returned to the last facility. At that point I said, “Hell no!” One doctor told me that if you have had three and nothing has changed, then it is time to stop. Luckily, newer machines apparently use less radiation. It’s interesting to hear that mammos may become a thing of the past in Europe. Are they planning to do MRIs instead? ",
      "MessageIndex": 1,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866325",
      "Title": "All That Radiation! Roxanne218 marijen"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jul 19, 2018 03:06PM Sara536 wrote: The question is, why are they enlarged? Are they fighting an infection? I would certainly want an answer. Some doctors have been known to dismiss symptoms just because the patient is young. Some doctors have no interest in educating their patients. I think you should see a gynecologist and ask as many questions as this has brought up for you. Gone are the days when I will stick with a doctor who won’t answer a few questions. Never accept just a pat on the head. Chances are you’re just fine but a biopsy would be needed to be sure. If you are having more symptoms in the same place, I wouldn’t accept a diagnosis based on “eyeballing”. At least get a second opinion. Don’t be dismissed because a doctor assumes you are just a budding hypochondriac.",
      "MessageIndex": 1,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865997",
      "Title": "I’m worried! liaemars Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 19, 2018 05:55PM - edited Jan 19, 2018 06:09PM by Sara536 It refers to the effects of a contrast dye injected prior to the MRI to improve the image. Here's an article that came up with a quick google: (certainly more info than I need but you can go as far as you want with it. Disclosures of Conflicts of Interest.—C.S.G.: Financial activities not related to the present article: program reviewer for American College of Radiology Mammography Accreditation; lecturer for National Diagnostic Imaging Symposium, Kaiser-Permanente, and New York Breast Imaging Society. R.L.B.: Financial activities not related to the present article: royalties from Amirsys. S.R.: Financial activities not related to the present article: royalties from Amirsys. From the Department of Radiology, Brigham and Women's Hospital, 75 Francis St, Boston, MA 02115. This article reviews the anatomic and physiologic influences on BPE, the typical and atypical patterns of BPE, and the potential of BPE to confound accurate interpretation of MR images. At magnetic resonance (MR) imaging, both normal and abnormal breast tissue enhances after contrast material administration. The morphology and temporal degree of enhancement of pathologic breast tissue relative to normal breast tissue form the basis of MR imaging's diagnostic accuracy in the detection and diagnosis of breast disease. Normal parenchymal enhancement at breast MR imaging is termed background parenchymal enhancement (BPE). BPE may vary in degree and distribution in different patients as well as in the same patient over time. Typically BPE is minimal or mild in overall degree, with a bilateral, symmetric, diffuse distribution and slow early and persistent delayed kinetic features. However, BPE may sometimes be moderate or marked in degree, with an asymmetric or nondiffuse distribution and rapid early and plateau or washout delayed kinetic features. These patterns cause diagnostic difficulty because these features can be seen with malignancy. This article reviews typical and atypical patterns of BPE seen at breast MR imaging. The anatomic and physiologic influences on BPE in women undergoing diagnostic and screening breast MR imaging are reviewed. The potential for false-positive and false-negative interpretations due to BPE are discussed. Radiologists can improve their interpretive accuracy by increasing their understanding of various BPE patterns, influences on BPE, and the potential effects of BPE on MR imaging interpretation. © RSNA, 2014 Recipient of a Cum Laude award for an education exhibit at the 2012 RSNA Annual Meeting. For this journal-based SA-CME activity, C.S.G., S.R., and R.L.B. have disclosed financial relationships (see \"Disclosures of Conflicts of Interest\"); the other author, editor, and reviewers have no relevant relationships to disclose. Abbreviations:BI-RADS Breast Imaging Reporting and Data System BPE background parenchymal enhancement NME nonmass enhancement View PDF (2680 KB) SWIPE ACROSS ARTICLES NEXT ARTICLERSNA © 2018Go to previous Article Download this Article Share this Article Add Article to Favorites",
      "MessageIndex": 1,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861783",
      "Title": "MRI question teachermomfl teachermomfl"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 29, 2017 03:54AM - edited Oct 29, 2017 04:43AM by Sara536 Anyone trying to decide how to proceed with treatment finds themselves in the stressful position of weighing the pros and cons of each drug and treatment available to them. Everyone's priorities are different. I know my priorities are different at the age of 72 than they would have been when my children were young. I think it is appropriate for people to document both negative and positive experiences.To withhold information so as not to scare someone, although well-meaning, is not fair. Only when we are aware of all possibilities can we decide if we are willing to take certain risks. Even then, as has been said by many, it will still be a crapshoot. We make the best decision we can and keep our fingers crossed. There is nothing worse than being lied to.",
      "MessageIndex": 14,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/859730",
      "Title": "Low Oncotype, node-positive and chemo decision Ckat HoneyBeaw"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Mar 26, 2019 08:56PM Sara536 wrote: DivineMrsM, Re: disability application, In my school district, it was rumored that the doctors the district sent people to for disability evaluation were hand-picked for being very inclined to minimize medical status in order to save the district money. At one point our union advised us to make sure that (on a certain form) we put our own doctor’s name as the person to contact for work related injuries. I don’t remember all the details and I retired before I was diagnosed but this seems like it may be a similar kind of arrangement that your district has with the retirement system (but for illnness caused disability). I hope there is a way for you to appeal. You might consider checking with your union. So sorry you have to deal with this.",
      "MessageIndex": 37,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870522",
      "Title": "Myths/Misconceptions about MBC- please share with us! Moderators Sparkles2_2"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Nov 2, 2017 01:17AM - edited Nov 2, 2017 11:19AM by Sara536",
      "MessageIndex": 1,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859827",
      "Title": "Who is main Dr that gets updates from all others after surgery? Ellyn27 Ellyn27"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "May 5, 2018 03:14PM - edited May 5, 2018 03:15PM by Sara536",
      "MessageIndex": 37,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862121",
      "Title": "In denial, having anxiety and how do I tell people? Basil2 teriabbott"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 19, 2018 06:17PM Sara536 wrote: You might message djmammo for that. I think there are more factors than breast density that play into the answer.",
      "MessageIndex": 3,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861783",
      "Title": "MRI question teachermomfl teachermomfl"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 29, 2017 07:48PM - edited Oct 29, 2017 11:19PM by Sara536 I would think that MO's would be really, really careful about letting patients know about potential side effects. Maybe they're uncomfortable with having that conversation because they can't reconcile it with their image of themselves as benign healers. I think a number of us have had the experience of their MO feigning surprise when we report that we experienced a debilitating SE. Then it almost feels like a \"blame the victim\" situation or an accusation of exageration on the patient's part. Thank God for these threads, but be careful not to mention that you got information from the dreaded internet.",
      "MessageIndex": 21,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/859730",
      "Title": "Low Oncotype, node-positive and chemo decision Ckat HoneyBeaw"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "May 5, 2018 11:27AM Sara536 wrote: You don’t have to tell anyone unless you want to. Everyone’s situation is different. There may be a place and a time that feels right for you. For some reason, many people think you are obligated to announce that you have this particular disease and it becomes a hot item for retelling and gossip. Depending on your community, telling can bring on love and support or, on the other hand, it can bring on a lot of unwanted advice or even fear and distancing. You need some time to digest this and decide who you want to turn to for support and just how public you want to make it before you have other people defining you. Personally, I don’t want to be “the lady in the blue house who has cancer.”",
      "MessageIndex": 35,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/862121",
      "Title": "In denial, having anxiety and how do I tell people? Basil2 teriabbott"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Jan 13, 2019 10:04PM Sara536 wrote: I don’t find MRI’s terrible at all - at least they don’t involve radiation. My first one felt very awkward but then I was freaked out about being newly diagnosed. I guess if I was claustrophobic about the machine it would bother me.",
      "MessageIndex": 3,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/866347",
      "Title": "Follow up protocol? Mama1416 Sara536"
    },
    {
      "AuthorID": "Sara536",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231882/profile",
      "Content": "Oct 30, 2016 08:10PM Sara536 wrote: If it were me, I'd insist on biopsy right away. I had a suspicious area \"watched\" with ultrasound for two years. Then the radiologist retired and the new guy did a biopsy and the suspicious area had already become stage 2. Nothing is more definitive than a biopsy because they are looking at the actual cells. Why wait",
      "MessageIndex": 13,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/849330",
      "Title": "Surgery: yes or no? VENHsmom pokie88"
    }
  ]
}