{
  "AuthorID": "Sarajanedw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164503/profile",
  "Posts": [
    {
      "AuthorID": "Sarajanedw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164503/profile",
      "Content": "Feb 16, 2013 03:40PM Sarajanedw wrote: Sorry, I forgot to ask if the pathology report does not state atypical ductal hyperplasia, do I assume that it is not atypical? I have read that to be clear the pathology should stay usual ductal hyperplasia.",
      "MessageIndex": 2,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800579",
      "Title": "Core biopsy results Sarajanedw Sarajanedw"
    },
    {
      "AuthorID": "Sarajanedw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164503/profile",
      "Content": "Sarajanedw wrote: Need to start off by saying that I was misdiagnosed at a very well known cancer center. Actually they biopsied the wrong thing providing me with a needle biopsy result of inconclusive. And I never got to see the surgeon bc their policy is to only be seen by the surgeon when the radiologist says so. Anyway, bc I did not get good treatment I went elsewhere and to a very highly regarded surgeon. She is the one who told me they did a needle biopsy of the wrong finding based on my mammogram results. The surgeon recommended a sterostatic biopsy. The result is benign with the pathology noting columnar cell change with ductal hyperplasia and focal glandular microcalcifications. From what I have researched I will be watched more closely. I go back to see the surgeon this week to discuss the pathology results. Does anyone think I should have gene testing? I am 52 years old with no history of breast cancer other than a cousin who had a lumpectomy. Also, does anyone think this is more serious? Thanks for any and all input! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800579",
      "Title": "Core biopsy results Sarajanedw Sarajanedw"
    },
    {
      "AuthorID": "Sarajanedw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164503/profile",
      "Content": "Sarajanedw wrote: What should I push for as next steps since my fna results came back indeterminate? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796970",
      "Title": "FNA Result Indeterminate Sarajanedw Beesie"
    },
    {
      "AuthorID": "Sarajanedw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164503/profile",
      "Content": "Sarajanedw wrote: My September 2012 mammogram noted a 1 millimeter nodule. Went to a breast surgeon and she ordered more mammogram pics and a ultrasound. The ultrasound shows the size of the nodule as 3 millimeters. Is it normal for the mammogram to show a smaller size than the ultrasound or is the difference in size in a few weeks because it has grown? Also, the additional studies show a very small density, so I am scheduled for a fine needle aspiration this Wednesday. Am trying to stay calm. Thank you for replying to my post. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/796496",
      "Title": "Mammograms and ultrasound Sarajanedw Beesie"
    }
  ]
}