{
  "AuthorID": "SarBar22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
  "Posts": [
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 18, 2019 11:32AM SarBar22 wrote: OMG I thought I was the only one!! I had completely prepared myself after being told they were 75-80% sure it was cancer. I couldn't think of anything else for 10 days...and of course I wasn't super busy at work or at home, so this occupied all of my brain power. And then when it came back benign I was just exhausted, obviously happy, but drained. Surgery to remove it is in 3 weeks, and then hopefully this whole thing will be over! But, like momto3sons, I am also high-risk and so I know this probably won't be my last go around with the tumors that pop up, the biopsy, the waiting... The only thing I can hope is that, after this experience, even if they tell me again there's an 80% chance it's cancerous I'll be like \"okay but last time it turned out fine!\". So, focusing on the positive and trying to get back to normal :) Bless all of you dealing with this on a constant basis. I can only emulate your strength, you're all amazing!",
      "MessageIndex": 10,
      "PostDate": "18/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/863446",
      "Title": "Exhausted/the blues AFTER benign findings??!? Egads007 AliceBastable"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 11, 2019 01:34PM SarBar22 wrote: Cityrat - yes 3-4 business days from now seems like an eternity!! Here's hoping there are enough Netflix documentaries to keep my mind occupied. I just got back from my biopsy, and it actually wasn't as bad as I thought! Some pain during the numbing but other than that, I could hardly feel anything. And the nurses were so sweet and kept distracting me so it felt like it went quickly. Now just more waiting...joy -__- Hugs to you all!",
      "MessageIndex": 13,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Feb 14, 2019 07:45PM SarBar22 wrote: Just diagnosed today after a lumpectomy for a radial scar/papilloma, so joining the 6-month watch and wait club (every 6 months it's looking like but the surgeon took 30 seconds to tell me over the phone, so I don't know much more than that at the moment). Glad it's nothing more, but being so young (just turned 30), and with a STRONG family history of bc, I'm thinking this is the beginning of many mammos/US's and benign breast conditions over the next few years... So thankful I found this site, as it's really opened my eyes to the world of my breasts and I've already learned so much just over the last month since my initial US!",
      "MessageIndex": 1034,
      "PostDate": "14/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "SarBar22 wrote: Here's what the report said. Any chance this is still something that's benign? Has anyone else had these findings but a benign outcome after a biopsy? Trying to schedule my biopsy, but as of now the only opening they have is in 3 weeks... Any help/support/good thoughts appreciated :) There is a subtle 1,2 cm x 0.8 cm x 1 cm ass with an irregular margin in the left breast at 2 o'clock posterior depth 3 cm from the nipple. This mass is hypoechoic. This correlates as palpated, to the reported pain, and with mamographic architectural distortion. There is no other sonographic abnormality in either breast or in the left axilla. IMPRESSION; SUSPICIOUS OF MALIGNANCY - FOLLOW-UP RECOMMENDED The palpable 1.2 cm mass in the left breast at 2 o clock posterior depth is at a moderate suspicion for malignancy. An ultrasound guided core biopsy is recommended. Correlation of dip placement with the mamographic architectural distortion is recommended. letter sent: Biopsy Required Ultrasound BI-RADS: 4c Suspicious abnormality - moderate concern but not classic for malignancy Diagnosed with ADH 2/2019 Surgery 2/7/2019 Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 9, 2019 06:15PM SarBar22 wrote: KBeee, that’s a great idea! I’m calling again in the morning anyway to ask if there was a cancelation, so I’ll try that out and see what happens. Thanks!",
      "MessageIndex": 5,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 10, 2019 09:16AM SarBar22 wrote: Got my biopsy appointment moved to tomorrow morning because someone canceled!! Never thought I'd be so excited to be stuck with a huge needle, but I'm just so glad I don't have to wait 3 weeks anymore! Yay! Wish me luck!",
      "MessageIndex": 6,
      "PostDate": "10/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 11, 2019 08:23PM SarBar22 wrote: ShinyLife, that's amazing! So happy for you!! Hoping to share good news next week, as well!",
      "MessageIndex": 16,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 11, 2019 06:43AM - edited Jan 11, 2019 06:43AM by SarBar22 Thank you all so much! Heading in now, ready to get these things over with. Will hopefully have good news to share in 3-4 business days, so I'm told :) ShinyLife, I’m glad to hear its over and you’re doing well.Sorry it was messed up, but it sounds like it will have been worth it if it comes back as benign!! Keep us posted, as well. Good luck on your recovery!",
      "MessageIndex": 11,
      "PostDate": "11/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 9, 2019 04:06PM SarBar22 wrote: Thanks ladies! Of course trying not to go down the path of thinking the worst but hard not to think about it every hour haha Just wish it would get here so I would know either way. It's not my boobs but the wait that's going to kill me, I'm sure of it! ShinyLife, I'll be thinking about you for your biopsy tomorrow!! Let us know how it turns out!",
      "MessageIndex": 3,
      "PostDate": "09/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Feb 23, 2019 05:23PM SarBar22 wrote: I’m so sorry you’re going through this! I just did over the last 6 weeks and the waiting nearly killed me! I’m 30, they found a 1.2cm irregular mass in my left breast, I had a BIRADS 4c, as well, and they all thought it would be cancerous (I also have an insanely strong family history). Turns out to be a papilloma with ADH, so benign! When I went in for the surgery, the radiologist literally told me she was following my case because she thought it would be cancer and 2 people emailed her the results when it wasn’t and she was so happy she had to come tell me herself! So there’s still a good chance it’s benign!! The report can only tell so much, until you get the pathology back, nothing can be proven. Keep us updated and I’m sending good thoughts! x",
      "MessageIndex": 3,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869998",
      "Title": "Birad score 4c...need help understanding mammo and us! Sara_smile4503 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 16, 2019 11:12AM SarBar22 wrote: Ugh, NOPE. And I am literally going insane with the wait. Trying so hard to concentrate on other things, but as you all know, that's not actually possible haha If I don't hear anything by the end of the day I'm going to call because I just want to know one way or the other!!",
      "MessageIndex": 19,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "Jan 16, 2019 03:53PM SarBar22 wrote: Just got the call - BENIGN!!!!!! The doctor said it's a tumor that could turn into cancer, so they want it out, but it's small so it would be a simple excision. Doing the happy dance right now, and definitely going out to celebrate tonight! Thank you to everyone here for being my rock the past couple of weeks, even just reading all of your amazing posts has kept me sane and feeling strong. I sincerely wish you all the best, but hoping I don't have to come back and say hi anytime soon haha Sending love and hugs and strength to all of you!! xx",
      "MessageIndex": 21,
      "PostDate": "16/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/869242",
      "Title": "Got my US report back - BIRADS 4c SarBar22 Natasha007"
    },
    {
      "AuthorID": "SarBar22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283984/profile",
      "Content": "SarBar22 wrote: This Post was deleted by SarBar22. Diagnosed with ADH 2/2019 Surgery 2/7/2019 Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871049",
      "Title": "2 months post-lumpectomy and I feel like I’m crazy SarBar22 SarBar22"
    }
  ]
}