{
  "AuthorID": "sarmcl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
  "Posts": [
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: What is the best way to check for swollen lymph nodes? Do you put your arm behind your head like a breast exam or slightly elevate your arm and feel under your arm? Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725687",
      "Title": "Checking for swollen lymph nodes sarmcl msnelson2006"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: Going to sound really weird but.....  Just finished up 4 treatments of AC---onto 4 of Taxol next(Half way done!! WOOT WOOT!) Over the past week since last treatment, my thumbnails have been killing me. Its feels like they are bruised. I did notice white lines showing up very lightly. The rest of my nails do not hurt. I feels like theres pressure under there and I want to rip them off to relieve it. Has anyone else experienced anything similar? Barra Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721470",
      "Title": "Thumbnails bothering me sarmcl sarmcl"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "Dec 10, 2008 04:59PM sarmcl wrote: Has anyone had any side effects where your arm pits hurt(achy) after chemo? I know its not my lymph nodes as its on the surface where mine ache. I dont know if its because the hair is regenerating or maybe something to do with the sweat glands? Barra",
      "MessageIndex": 879,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "May 6, 2008 04:14PM sarmcl wrote: I want to thank everyone for your responses. You dont know how much it means to me. Its hard because I dont want to come off shallow--or people thinking \"Is that all she cares about is her trip to Vegas\". But honestly its the one thing I have that I know I will enjoy and will allow me some time away from all of this craziness.",
      "MessageIndex": 5,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705121",
      "Title": "Trip scheduled--dont know what to do! sarmcl rogam"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: I wont bore you with to many details but I am scheduled to have a mastectomy and reconstruction at same time(surgery to be scheduled soon) I have noticed some aches and pains in diagnosed breast. But recently have been noticing alot of achiness in my left breastbone. I have not had any chemo or radiation Is this a normal symptom from the cancer? Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706337",
      "Title": "Left breastbone achiness sarmcl kaitlinosborne"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: Longstory short---I had a biopsy done came back positive for cancer. I then was scheduled for a MRI last Friday and a lumpectomy was to be done today. Well the MRI came back and they found 2 more \"suspicious\" areas. They want to have those biopsied before any sort of surgery. If those are cancerous, I will then need mastectomy I am going for a second opinion next Tuesday. I am supposed be leaving for Vegas on June 4-7th. My question is what am I to do? Will doctors work with you? I am obviously not going to risk my health over a trip. But if the biopsy would even be until late next week or early the week of the 19th.....surgery wouldnt even be until end of May(based on my guessing) Would a doctor delay a surgery a week? I hate to miss my trip. Its been planned forever. And its really what I need to get my head cleared before I deal with this long--crazy journey. Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705121",
      "Title": "Trip scheduled--dont know what to do! sarmcl rogam"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: I have a few questions for those who had a port put in your chest-- 1) Is this done under local or general anesthesia? 2) How was the pain after? How long did it last? Any other info you can provide would be great. Round two of chemo is Wednesday. Round one was not that bad at all. Keeping my fingers crossed! Barra Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719379",
      "Title": "Getting port in a week sarmcl bomber410"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "Aug 12, 2008 01:34AM sarmcl wrote: Thanks CHJ for sharing your info. They did say I would need someone to drive me home so I figured I would be under somewhat but not sure to what extent",
      "MessageIndex": 2,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719379",
      "Title": "Getting port in a week sarmcl bomber410"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: So I had a second biopsy done Tuesday and came back today with results. One of two spots they were concerned about turn out also to be cancer. Doctor is recommending mastectomy with breast reconstruction(done same day) Needless to say alot to take in. They couldnt get me in to see plastic surgeon next week due to holiday--then they wanted to take me June 3rd but my husband is out of town and I want him to be there. So we set it up for June 10th...............more waiting....its driving me MAD Anyways---what I would like to know is what is average recovery time for these two surgeries done at same time. Basically I am wondering when will I be able to go back to work and do normal every day things. Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706060",
      "Title": "Mastectomy w/reconstrcution sarmcl Erica"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "May 23, 2008 07:38PM sarmcl wrote: Swimangel Thank you for sharing your info. I do not know what implants I am getting as I have yet to meet with plastic surgeon. I got all of this info this morning so this is all new to me. However, good to know how you and others have dealt with your situations so I know what I should expect going into this",
      "MessageIndex": 2,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706060",
      "Title": "Mastectomy w/reconstrcution sarmcl Erica"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "sarmcl wrote: Every since I got the results from the breast MRI that they found more problems, my body feels like it is one big cramp. I am feeling it in my boobs, my back----my chest. I dont know if I am just stressing myself out or if something is seriously wrong with me. Its not pain its just achy all over. Am I losing my mind or is this normal for your body to react to something so emotionally exhausting? Dx 4/23/2008, IDC, 1cm, Stage II, Grade 2, 1/6 nodes, ER+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705412",
      "Title": "Body pains sarmcl Shirlann"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "May 7, 2008 09:49AM sarmcl wrote: Shirlann Trip could definitely be moved but I am going with a group of 10 so they wouldnt be able to rechedule on my behalf. Continental charges you a \"change fee\" $100 per ticket. Plus if/when you reschedule and the airfare is higher, you have to pay the difference. So all of my friends would not be willing to do that----and who could blame them. But yes I will be talking to doctor Tuesday as I have second opinion set up---and I will be mentioning it.",
      "MessageIndex": 10,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705121",
      "Title": "Trip scheduled--dont know what to do! sarmcl rogam"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "Sep 19, 2008 05:58PM sarmcl wrote: Recommend getting Pepcid or Zantac. Worked for me!",
      "MessageIndex": 2,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721449",
      "Title": "Heartburn Deedee79 Sable"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "Dec 10, 2008 04:19PM sarmcl wrote: I am going through something similar. I was diagnosed with breast cancer in April(I was 34) on the right side. Had a mastectomy in June with recon and just finished chemo Back in May, I noticed the left side bothering me. Very achy and sore. Was checked out and breast surgeon didnt think it was anything(I have one of the best surgeons in Cleveland). Once I started chemo, I noticed it flaring up evrytime I had treatment. Went back to surgeon and he thought it might have something to do with hormones out of wack due to chemo(Did not have period entire time on chemo and still dont)  I had mammogram 2 weeks ago and it came up clear(but last years did as well and missed the cancer on right side). So needless to say I dont trust mammograms. He does not feel any lumps nor do I. I started Tamoxifen last week and since then the pain has flared up even more. I am at my wits end. I am petrofied its cancer.  My left arm and shoulder has been aching too. I dont know if how I am sleeping at night( I sleep on left side alot since I have expander on right and a port)? Is it the Tamoxifen? Is it cancer? THis crap will drive you crazy.  Barra",
      "MessageIndex": 1,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725719",
      "Title": "breast pain and thickening cliffhanger rosied51"
    },
    {
      "AuthorID": "sarmcl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66311/profile",
      "Content": "Dec 10, 2008 05:15PM sarmcl wrote: For fibrocystic breasts, is there anything other than Vitamin E and ibruprofen to take for pain?",
      "MessageIndex": 3,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/725719",
      "Title": "breast pain and thickening cliffhanger rosied51"
    }
  ]
}