{
  "AuthorID": "sassser48",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139734/profile",
  "Posts": [
    {
      "AuthorID": "sassser48",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139734/profile",
      "Content": "Nov 17, 2011 09:58PM sassser48 wrote: thank you for your support II am just being stupid and scared. I have thought about just getting it checked and not letting anyone know but I guess I just dont know if I'm ready to go through all this and if I find out anything can I enjoy our celebration knowing what is coming. Thanks again I guess I have more thinking to do. I just can't believe after getting through all the heart  crap how can this now be happening. I cried and worried as did my family thinking I wans't going to make it through thesurgery and now do we have to go through this as well. I am sorry to rant I guess I just need somewhere to put my feelings. thank you ladies I know you have all been so brave and through this so I guess it is just buck up and go on right",
      "MessageIndex": 3,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778281",
      "Title": "so I said a little scared maybe I should say terrifeid sassser48 belleeast"
    },
    {
      "AuthorID": "sassser48",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139734/profile",
      "Content": "sassser48 wrote: so glad to find a site like this. I'm sitting here trying not to think the worse but of course that isn't what I'm thinking. I found a lump about 3 weeks funny enough the night before having major surgery for heart and vascular. so I think how can this be can't I get through one thing at a time. Haven't I put my family through enough what do I do. Let it go and hope it goes away I have felt little lumps before but they have been cyst like boils that I have gotten rid of and went away.this lump is not a boil no redness no pain and its not going away. What do I do now. My daughter and I have a trip scheduled for the end of december celebrating the heart thing can I wait till I get back to get it checked. I am so scared and can't tell anyone friends or family can't put them through that. Please I need someone to talk to Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778281",
      "Title": "so I said a little scared maybe I should say terrifeid sassser48 belleeast"
    }
  ]
}