{
  "AuthorID": "SassyMutt",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
  "Posts": [
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "SassyMutt wrote: I've lurked on these message boards the past few months as I've gone through a biopsy and lumpectomy for LCIS. Finally decided to join as I know there is so much more to learn. I'm grateful there is a place like this to turn to! Thank you in advance for listening. :) I was recently diagnosed with LCIS and atypia after a biopsy for calcification found on my very first mammogram. Lumpectomy confirmed LCIS, but thankfully no cancer. For others with LCIS, have you had your risk % calculated? And do you know the name of the calculation model used? Apparently there is only one that is applicable to LCIS. My doc told me, but I didn't write it down and now I can't find it when searching (I have a call back into my doc). My concern is my doctor has calculated my risk at 67% lifetime risk for invasive breast cancer which is so much higher than everything I've read for LCIS (everything I read was more like 20-30%). I don't have a family history of breast cancer aside from one cousin. I'm 40 years old and have never had children, which I know increases my risk. My LCIS was considered “grade 2\". So, it sound like a variety of factors are contributing, but I was surprised to hear it's that high. I'm trying to research and understand all my options for managing LCIS with 67% risk. I'm tempted to try Tamoxifen and go through the MRI in March and see what happens. Although, I've also been that because told MRIs are so sensitive, they pretty much flag anything and can result in a lot of extra biopsies. And I've read lots of stories of women feeling like pin cushions and opting instead for mastectomies. Prior to calculating my risk %, the docs have told me no need to discuss prophylactic mastectomies, but given the 67% risk level, I'm wondering if that should at least be on the table? Any advice or guidance from those with LCIS diagnosis would be welcome and appreciated. Thank you! Dx 9/2014, LCIS, Grade 2 Surgery 11/6/2014 Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/826367",
      "Title": "LCIS and 67% risk of invasive breast cancer SassyMutt vlnrph"
    },
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "Nov 18, 2014 03:04PM SassyMutt wrote: Thank you so much, farmerlucy! I really appreciate the response and information. It was my breast surgeon who calculated the risk, not a GC. I'm very interested in talking to a GC and need to look into it. The surgeon said unfortunately insurance won't cover GC because I haven't been diagnosed with cancer. But, I'm thinking it might be worth paying out of pocket if I have to in order to have all the information possible. I'm meeting with the oncologist next month to further discuss my risk and possible Tamoxifen. I feel like I really want to better pin down my risk and ensure I understand it because if it truly is that high, than I feel like I seriously should consider PBM. I'm reading through all these forums -- so much information! I'm sorry the prevention route didn't turn out as you'd hoped, but I'm glad you caught it in order to beat it! I'm a bit overwhelmed trying to navigate it all, but I see it as a gift in a way too.....if they hadn't found the LCIS I wouldn't know I was at higher risk and could have missed something critical in the future.",
      "MessageIndex": 3,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/826367",
      "Title": "LCIS and 67% risk of invasive breast cancer SassyMutt vlnrph"
    },
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "Nov 20, 2014 02:37PM SassyMutt wrote: Thanks so much for all the helpful replies, everyone! TwinMomma2 -- so sorry to hear about the mass. My fingers and toes are crossed with farmerlucy for a B9 result! Please do keep us posted. {{hugs}} I just talked to my surgeon on the phone. She confirmed that the 67% lifetime risk figure is bit over-inflated and it's hard to pin down given the lack of good calculation models for LCIS. She said she used the Tyrer-Cusick Model as none of the others are even applicable for those with LCIS -- as you indicated, Anne. I asked her if, given my high %, mastectomies should at least be on the table of options. She said it's an option, but we talked for a while and she really kept stressing that she feels that would be overdoing it and that the plan we have for me to talk to the oncologist about Tamoxifen and the extra screenings are the right path to go. Still thinking and info-seeking..... I see the oncologist Dec 23rd to discuss Tamoxifen and my first MRI wouldn't be until March. So, I may try that path and see how it goes, knowing I could always revisit with a more aggressive prevention approach if I choose to later. It's just that \"what if\" that nags.....blah. I will ask the oncologist about GC as well.....",
      "MessageIndex": 10,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/826367",
      "Title": "LCIS and 67% risk of invasive breast cancer SassyMutt vlnrph"
    },
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "Nov 22, 2014 09:38AM SassyMutt wrote: vlnrph -- Thanks for the suggestion about my cousin. I contacted her last night and she was tested but does not have the BRCA mutation.",
      "MessageIndex": 13,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/826367",
      "Title": "LCIS and 67% risk of invasive breast cancer SassyMutt vlnrph"
    },
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "Jan 6, 2016 07:44PM SassyMutt wrote: Thank you all! It's comforting to hear from others. I have copper Paragard IUD as well.",
      "MessageIndex": 4,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/839390",
      "Title": "MRI Screenings and IUDs SassyMutt SassyMutt"
    },
    {
      "AuthorID": "SassyMutt",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207896/profile",
      "Content": "SassyMutt wrote: I have LCIS and am on the 6 month screening plan, alternating MRIs and Mammos. I also take tamoxifen, and recently got an IUD. During my latest oncology check in, the nurse was scheduling me for the next MRIs and asked if I had any implants, etc. I mentioned the IUD and she wasn't sure if it would be an issue with the MRI machine. I contacted Radiology and they had to check, but the techs said \"It should be ok\". I didn't feel totally confident in their response and I have my next MRI in March and just wondering if anyone else doing the regular MRIs has an IUD. Thanks! Dx 9/2014, LCIS, Grade 2 Surgery 11/6/2014 Lumpectomy: Right Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/839390",
      "Title": "MRI Screenings and IUDs SassyMutt SassyMutt"
    }
  ]
}