{
  "AuthorID": "SATEX12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
  "Posts": [
    {
      "AuthorID": "SATEX12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
      "Content": "Apr 13, 2011 02:18PM SATEX12 wrote: Scuttlers, Thanks a bunch for responding so quickly. This is all such helpful information. My Onc has mentioned to me a few times that she has assisted others with this and how some of those folks have lasted much longer than the \"less than one year\" stipulation. She told me recently about one young woman that was still going strong 6 years affer cashing her policy! She said that there is a bit of a loophole for patients with cancer because we could, by traditional standards, be given less than a year to live, then a new treatment becomes available that improves our condition or a treatment that was not working previously begins to do so. This is important because even if one survives after collecting on the accelerated benefits, it is not repayable to the insurance company ( nor is it taxable!). I wonder now if my Onc was trying to let me know that she has assisted others in case I need that same assistance...I will mention it to her on my next visit. I have also read up on the topic and found that many insurance companies will pay out the accelerated benefits if someone is deemed \"terminally ill\" but with a survivability prognosis of greater than one year. I think they have quite a bit of latitude when it comes to this type of situation because it is a very sensitive issue and the last thing they would want is negative publicity by denying someone their benefits under these circumstances. Again, thanks so much for sharing the info. I have learned from it and I know others will as well. I believe my policy has at least a 25% accelerated payout, but the policy face value is for a significant amount so that 25% would be a good size sum of money and would be of great value to my family should my condition deteriorate.",
      "MessageIndex": 7,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767492",
      "Title": "Life Insurance scuttlers Chickadee"
    },
    {
      "AuthorID": "SATEX12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
      "Content": "Apr 13, 2011 11:37AM SATEX12 wrote: Scuttlers, Thank you so much for posting this extremely helpful info! I am sure many of us will be interested in this and will check it out. May I take the liberty of asking you how difficult it was to get your accelerated benefits approved on your life insurance? I am late stage III and just like everyone else in my situation, I am hoping and praying that it doesn't get to stage IV, however, one does have to consider all possibilities. I also have a term life insurance policy that has an accelerated benefit feature so I am curious as to how it went for you, if you don't mind sharing. Interesting thing is that nowadays, most term life insurance policies have the accelerated benefits rider built in, automatically, but many folks do not know this... Thanks again!",
      "MessageIndex": 4,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767492",
      "Title": "Life Insurance scuttlers Chickadee"
    },
    {
      "AuthorID": "SATEX12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
      "Content": "Apr 9, 2011 10:00PM SATEX12 wrote: Yvonne, All the friends you \"met\" when you first posted here in 2009 are still here for you and countless new friends as well. All the amazing ladies on this site have a bond that can't easily be explained to those on the \"outside\" and it's a bond that will be with us forever. We are so fortunate to have such a massive, diverse and cosmopolitan circle of true friends. I sometimes just spend hours reading posts and am in awe of how we support each other and how just a few words can mean so much. Hang in there and come back often for lots of love and support from all your friends.",
      "MessageIndex": 21,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767278",
      "Title": "In need of a friend mossybaby chainsawz"
    },
    {
      "AuthorID": "SATEX12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
      "Content": "Apr 4, 2011 02:49PM SATEX12 wrote: Wendy, Fantastic news, well done! I know it was a hard road to walk in the beginning, but nice to see that you have put it in the rear view mirror, so much so that it's been a year longer than you thought when you posted on March 31 :). Our diagnosis is very, very similar so it's very inspiring to see you are still doing so well this far out. Here's wishing you many, many more years of good health!",
      "MessageIndex": 23,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766895",
      "Title": "6 years out wallan geewhiz"
    },
    {
      "AuthorID": "SATEX12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101641/profile",
      "Content": "May 9, 2010 09:58PM SATEX12 wrote: Tammy, If you are still active on the message boards, would you please let us know how you are doing after your BMX /DIEP? I have an appointment with the same doctor you selected for your surgery and I'd like to know how everything turned out for you. I'd also love to know if your surgeon from PRMA helped you arrive at your decision on whether to go the BMX route.I have an appointment with him in early June and I'm hoping he can give me some guidance on what is appropriate for my situation. I think I know what I need to do, but I'd like his input, for sure... Did he do your BMX as well as DIEP or just DIEP? Perhaps you could PM me? Thanks! Thanks!",
      "MessageIndex": 19,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/746357",
      "Title": "Lumpectomy vs Mastectomy mom2mms SATEX12"
    }
  ]
}