{
  "AuthorID": "Sattipearl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
  "Posts": [
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jul 17, 2016 10:48PM Sattipearl wrote: hi. Stage I 2006, left. Stage IV 2012, bone mets. Now lung and liver met",
      "MessageIndex": 71,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 5, 2016 03:44PM Sattipearl wrote: Elizabeth - glad you're sprung! Dara- brilliant idea re Meds, treatments, etc. Someone asked about massages and acupuncture..my insurance (US) covers 20 acupuncture visits. I found a cranial sacral acupuncturist who specializes in oncology and she is amazing. One session I complained of hip pain, and she found the hairline fracture in my right hip with a tuning fork and sent me to my MO, and I then had it radiated. I recently had lymph massage rather than muscle massage as the stage IV cancer has eaten its way through many, many spots in my ribcage, spine, sternum, sacrum, pelvis hips and neck, and it's just too scary to have massage. This from someone who used to have Rolfing once a month.... My nausea is easing....Got my energy up to get showered, dressed, and to the store and buy some more fresh ginger and will slice it into hot water and drink. I consider that 3 things accomplished today! The boy kitty just came up for some chow and pets, so as his staff, I must attend to him. Love to you all no matter what is going on. ",
      "MessageIndex": 692,
      "PostDate": "05/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 7, 2016 07:48PM Sattipearl wrote: friends, My next appt. is 9/13. Will be discussing stopping treatment. I wish you adeiu. And love no matter what is happening.",
      "MessageIndex": 720,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Aug 20, 2016 06:50PM Sattipearl wrote: Hi all, Glad to find you. This is my 3rd round of chemo now that the little buggers have invaded my left lung. Had an X-ray after first course and the cancer showed it had continued to advance. X-ray after 2nd course showed no progression not regression. Stable abnormal. 3rd course next 2 weeks then a CT to get a higher resolution view. Am now in a conversation to stop working as my doc says I likely have a year or less to live. One day at a time. Thank goodd for you and many close friends. Love to you all, Patti ",
      "MessageIndex": 352,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 1, 2016 07:54PM - edited Sep 1, 2016 08:06PM by Sattipearl hi all, Am better today, and that's after 2 separate doses of 8mg zofran. Otherwise, the usual fatigue. Djm71, the reason you are not bothered by us the way you are bothered at the clinics is you are known here and you know it. Those random remarks by strangers can be jarring. I had an unknown older (70s) woman slap me on the back several times as she regaled about the buffet we were staying in front of at a grocery store. I turned and said to her, \"did you know I have cancer in my bones? It's in my back, right where you're slapping me.\" She removed her hand like it was on a hot stove and said, \"I didn't know.\" I said, \"exactly. Please remember that\", and turned and walked away. Sometimes ya gotta be an educator. She'll get over her burn.... Regarding SEs. No one knows. We're all different and we have different reactions to the same thing, as has been said. I've had the Gemzar Carbo cocktail 4 times, 2 no infusion pain and intense SEs, 2 with infusion pain, one with NO SEs during or after, and the other was yesterday. I was kinda hoping that the infusion pain equaled no SEs but.....not true. This weekend one of my dear friends who is a little coo coo is flying in for 2 days to be with me. I am looking forward to being with her, and she is someone I told she couldn't call after 2 months of her unhinged-ness at my diagnosis and calling every day with the next thing I should do about the cancer. I don't know about you but I had a hard enough time dealing with my own reaction when early diagnosed, and with no energy for others' craziness that I might normally disregard. At 18 months in we started talking again and she apologized. Her MIL was diagnosed during that time we weren't talking and my friend tried the same behavior with her and she put a stop to it immediately. My friend 'got it' that what she was doing was completely unworkable. If she gets coo coo, I'll just go take a nap. A good friend told me early on: there is an 'I' in illness, an a 'we' in wellness. I love how your families talk about how 'we' are doing while talking to others who check in. This is it for me now. Have a great weekend,and much love to you no matter what is going on.",
      "MessageIndex": 612,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 1, 2016 03:17AM Sattipearl wrote: hi all, So glad to have you and your words here to comfort. Had my 4th and possibly final Gemzar Carbo treatment for the lung/liver/chest lymph infiltration today. This combo can be very painful and today it was hideous. My BFF goes with me to all of my medical appts, and she just held my non-infusion hand. Luckily the Gemzar infusion was over in 30 min. Went home and drank 2 quarts of water, and now on my third, after a 4 hour nap. Cat scan and MO appt 2nd week of Sept so after Sunday, I should have 10 days of feeling fab. Ended my work life today. My company has been awesome throughout and they've done unbelievable things to support me. Recently I mentioned on FB that I wanted to hang out on the beach with friends in my retirement, so the CEO rented a 3-bedroom house for me on Stinson Beach for a week in October! So, so amazing. Thank you all for being here, and much love to you no matter what is happening. ",
      "MessageIndex": 597,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 4, 2016 08:43PM Sattipearl wrote: so nauseous, add to it that I woke up from a nap and the pet sitting pug had peed on the bathroom tile, and had diarrhea on the area rug in the dining room. Took something to keep my stomach below my throat in cleanup. For those who don't know this isn't my first rodeo. It's my 4th or 5th. Sometimes it's easy and sometimes not so much. My friend behaved herself, and went home at noon today. Now to go find the boy kitty. I am home alone with four 4-leggers. Sweet, sweet pooches and kitties",
      "MessageIndex": 670,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Oct 20, 2016 10:25PM Sattipearl wrote: Shelby, I only write to reiterate what everyone else said. You don't need this now, or even in the future. The most telling line you wrote was about therapy for 2 years about these 2 relatives, which tells me this isn't new. Forgive them as soon as you can, for YOUR sake, and move on. I, too, am without family here but I am far from alone. I have two close friends who do almost everything with me and several others who I know are available if I need them. Develop those people in your life so you can reduce your guilt of having to ask for help or being a burden. Find the ones you don't have to take care of while they're caring for you. Everyone: I do expect my MO and team to be the cancer experts but I do not expect them to know everything. They are my partners in this and they are not God. I, like Stephanie, read voraciously so I can make informed decisions(although Stephanie is the Queen of knowledge resources- thank you, Stephanie). Love, Patti",
      "MessageIndex": 3946,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Oct 30, 2016 09:53AM Sattipearl wrote: Hi all. No news is good news, right? I haven't gotten the report back for the MRI. Probably Monday..... Waiting is not one of my strong suits....and here I am",
      "MessageIndex": 3978,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 6, 2017 10:15AM Sattipearl wrote: Freya, I get care through a major medical group in CA and my MO wants me to get scans at the same site every time so there is consistency. FWIW. Love, Patti",
      "MessageIndex": 4151,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 29, 2017 09:18PM Sattipearl wrote: share the hope...I ditto what Leftfoot said.....and you should definitely find a doc with whom you are comfortable. Don't let HiS negativity bring you down",
      "MessageIndex": 4285,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sattipearl wrote: hello, Thank goodness you are here. Diagnosed with Stage IV in 2012 with mets to bones only. Had taxol weekly for 9 months. Switched to Aromasin. July 2015 scans showed mets to liver and lymph nodes in my chest. Had Doxil for 2 months but didn't tolerate well. Switched to Afinitor and Aromasin and developed pneumonitis within 2 months. Healed that, and now have mets to my left lung. Started Gemzar carbo last week and tolerated the first dose along with Granix day 2. Couldn't sleep last night and read lots of posts. Just had my 64th birthday. Thank goodness you are here. Patti Much love to you, no matter what is going on Dx 11/2006, IDC, Left, 6cm+, Stage IA, Grade 1, 0/1 nodes, ER-/PR-, HER2- Dx 9/2012, IDC, 6cm+, Stage IV, metastasized to bone/liver/lungs, Grade 1, 0/1 nodes, ER-/PR-, HER2- Radiation Therapy 12/7/2012 External: Bone Dx 7/26/2015, IDC, Left, Stage IV, metastasized to bone/liver/lungs, Grade 1, 0/1 nodes, ER+/PR-, HER2- Chemotherapy AC + T (Taxol) Chemotherapy Carboplatin (Paraplatin), Gemzar (gemcitabine) Hormonal Therapy Aromasin (exemestane) Chemotherapy Doxil (doxorubicin) Hormonal Therapy Arimidex (anastrozole), Aromasin (exemestane), Faslodex (fulvestrant) Radiation Therapy External: Bone Hormonal Therapy Hormonal Therapy Faslodex (fulvestrant) Surgery Lumpectomy: Left Surgery Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846076",
      "Title": "Onto the lungs Sattipearl zarovka"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jul 24, 2016 11:56AM Sattipearl wrote: good morning....and it is good....I've had 2 infusions and while day 2+3 post infusion are energy-less days, overall I feel good. It's 2 weeks on, 1 week off so no chemo this week. I've had no other side effects except the profound fatigue for 2 days. Grateful....",
      "MessageIndex": 8,
      "PostDate": "24/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846076",
      "Title": "Onto the lungs Sattipearl zarovka"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Aug 22, 2016 10:49PM Sattipearl wrote: almost a month later...so I thought I'd check in. The Gemzar carbo treatment appears to have slowed the progression of the cancer, as seen on X-ray. I've had 3 doses. Will have one more and will do a CT scan for a more high resolution view, and we will go from there. I gave notice at work this week, to go on disability as of 8/31. The fatigue & shortness of breath are difficult to deal with even though I sit most of the day and talk on the phone. Work is being really great about it, as they have consistently been throughout the 4 years I've been dealing with this. I should say \"we've\" been dealing with this cuz it takes a village...and I have an awesome, mostly non-blood family village. While I got my affairs in order when I was initially diagnosed, I will get the fine tuning done in the near future, check out the hospice facility that's been recommended, and start the ball rolling to get the meds allowed in our newly enacted law in CA, compassionate end of life option. I don't mean to sound morose....and there are things to take care of. Love to you all, Patti",
      "MessageIndex": 9,
      "PostDate": "22/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846076",
      "Title": "Onto the lungs Sattipearl zarovka"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 24, 2016 12:34PM - edited Jan 24, 2016 12:36PM by Sattipearl hi Sue Sorry you're so tired. I do sleep a lot more. Am still working full time, and go to church almost every week. Such a tiny life compared to how active I used to be. Been Stage IV since Sept. 2012, with mets to torso bones. Had 17 rib and spinal vertebrae breaks. OxyContin at 100 mg throughout the day. Taxol weekly for 9 months, then arimedex. Weaned myself from OxyContin completely by March 2014. Cancer re-emerged July 2015 with mets now to liver and moving down my leg bones so Doxil x 4 months. Pretty bad hand foot. A couple of days I couldn't walk. Got some temperpedic slippers which helped a lot. Back on OxyContin now 60mg throughout the day. Last CT beforeA/A showed liver mets disappeared. Just started A/A Jan 9. Hand foot has disappeared. Now that I'm talking them both at night, about all I have are headaches every few days. No D. Taking 10 mg Afinitor and 25mg Aromasin. When the cancer came back in July, I decided to host a living memorial for my family and friends and planned it for late February. While I'm feeling so much better than July, still doing it and lots of people are coming. I decided I want to hear what they have to say about our life together rather than have a funeral. Most people like the idea. I don't have an expiration date and could probably postpone it but one never knows..",
      "MessageIndex": 38,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sep 14, 2016 02:23AM Sattipearl wrote: hi all, I may have met some of you in other rooms. Today I met with my MO and I am stopping chemo. Was on Gemzar Carbo for 8 weeks and it was grueling. The profound fatigue, and intense nausea was just too much. 10 days after my last dose and I finally feel normal. I will start Faslodex shortly, in addition to Xgeva. My bone, lung and lymph node mets are stable. I have multiple new (additional) albeit small (1cm) poorly defined hypodense lesions in my liver which occurred while on the Gemzar Carbo cocktail. I appreciate that you're all here. Patti",
      "MessageIndex": 3820,
      "PostDate": "14/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Oct 6, 2016 10:06PM Sattipearl wrote: Here, here, Lita. I am/was a Type A personality....the 'I got this' type. Well, cancer made me change my mind and I discovered that people are more than happy to step up, JUST LIKE I WOULD IF THE SHOE WERE ON THE OTHER FOOT! I've had people drive me to appointments, get my meds from the pharmacy, get a single pint of chocolate ice cream, go shopping with me, get in the shower with me (my BFF), lots of people have cooked for me, helped me get my shoes on, pray with me, I could go on and on, and probably not remember all the amazing gifts of assistance. I've even asked strangers to help me at the store when I couldn't pick something up. No one has ever refused a request. As I mentioned people are more than happy to do just about anything. I just have to be willing to tell them what I want, which can feel very vulnerable. With practice, I got used to it. You could too. Much love to you all, no matter what's going on. Patti",
      "MessageIndex": 3884,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Oct 26, 2016 01:40PM Sattipearl wrote: Shelby, So glad to hear from you. I'm happy the cyber knife went well. My BFF was a very casual acquaintance before my Stage I diagnosis, and she INSISTED on attending the outpatient surgery with me to have the lumps removed. I could barely stand to have her there, fluffing my pillows, adjusting my blanket and reading to me because I'm a tough broad and I don't need that kind of help. We laugh about it now. The thing that I just adore about her, among many, many things, is that I don't have to take care of her while she's taking care of me .. it's just delightful to be cared for without any sort of angst on her part. She's attended almost every medical appointment I've had and we've grown to be the best of friends in the past 4 years. We've had a few ups and downs, but we are always able to sort out the downs in communication. I have a brain MRI tomorrow. Haven't had one for 18 months, and since I'm having some audio and visual hallucinations, I want to see if they're drug related or the cancer has taken up residency in my brain. Love, Patti",
      "MessageIndex": 3973,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Nov 21, 2016 12:47AM Sattipearl wrote: Babs, A perfect opportunity to let others take care of you. Let them.....they'll love it. Love, Patti",
      "MessageIndex": 4038,
      "PostDate": "21/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Dec 10, 2016 10:49AM Sattipearl wrote: hi Babs, I hope yesterday was easy for you, and that your energy today is as you wish it. Love, Patti",
      "MessageIndex": 4089,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 5, 2017 09:50PM Sattipearl wrote: Mattie, At my CareGroup there are a bunch of different folks I have access to including a pain manager and a social worker. Social worker is in fact free. Hope that helps. Love to you. Patti",
      "MessageIndex": 4146,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 13, 2017 12:55AM Sattipearl wrote: regarding stability and NED: My favorite phrase, after a year of chemo and rads for the initial bone mets, was \"stable abnormal\". Since the initial chemo, the bone mets never progressed and I was stable abnormal for almost 3 years. The liver mets showed their face in July 2015, and in the lungs in July 2016. Also, I would like to gently caution against thinking any doc has all the answers, as others have mentioned. They are humans, they make mistakes, and so much new is happening with cancer that it shouldn't be a surprise when your doc says, 'I don't know why'. This is not an easy disease for anyone involved. No 2 of us show up exactly the same and the cancer can change. Yes, advocate for yourself/loved one. I recommend doing it in partnership with your med team. Read, read, read. I know I'm preaching to the choir and we get scared, and when we get scared, that little monkey brain thinks unhelpful thoughts. With love, Patt",
      "MessageIndex": 4202,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Mar 3, 2016 01:23AM Sattipearl wrote: mybug, enzymes on an empty stomach reportedly reduce inflammation and destroy cancer cells.",
      "MessageIndex": 46,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jul 19, 2016 12:54AM Sattipearl wrote: thank you all very much for your responses. I just awoke from 3 hours of deep sleep. A different perspective is nowavailable.",
      "MessageIndex": 6,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/846076",
      "Title": "Onto the lungs Sattipearl zarovka"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Nov 2, 2016 04:27AM Sattipearl wrote: hi all MRI came back stable abnormal. Nothing new happening. Yea! Thank you for your love and support",
      "MessageIndex": 3981,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Nov 15, 2016 01:33AM - edited Nov 15, 2016 01:33AM by Sattipearl Mom, and everyone else, I'm with Stephanie regarding quality of life and treatments. I recently stopped treatment because I was progressing while receiving chemo and having more side effects than I was willing to tolerate. It is the right choice for me. I am now getting all my loose ends tied up and waiting for my docs to agree that I have less than six months so that I can get the meds to end my life. I feel free from the constraints the chemo placed on my QOL. I'm spending time with friends and my kitties who love having my lap around all the time to sit upon. They trade places because they're too large to sit together. Both of my docs told me that I'm in a very small group of people who choose to stop treatment .. Something like 3% of us do that. No one can say what the right choice is for anyone else Just sharing my experience. Love, Patti",
      "MessageIndex": 4029,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Oct 26, 2016 02:33AM Sattipearl wrote: has anyone heard from Shelby",
      "MessageIndex": 3965,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Nov 9, 2016 03:13PM Sattipearl wrote: hi coni, My experience wasn't so great. Nausea, extreme fatigue and the cancer progressed while I was on it. It was my third chemo so it's not a surprise that I progressed. I've since stop treatment. Patti",
      "MessageIndex": 4000,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 9, 2017 11:18AM Sattipearl wrote: Alissa, Fingers crossed! Love, Patt",
      "MessageIndex": 4174,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Aug 27, 2016 11:18PM Sattipearl wrote: Some members in another Stage IV forum recommended I come here. So, hello. Just recovering from SEs of Gemzar carbo + Granix this week....screaming headache most of the day, nausea. Took zofran which makes the headache worse and does the job for the nausea. Ingested a bit of CBD - cannabis - and hope that will lull me to sleep. I'm usually pretty perky. Today I am not",
      "MessageIndex": 1739,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 17, 2016 10:30AM - edited Jan 17, 2016 10:31AM by Sattipearl just got through week 1 of A/A. Slight diarrhea, nausea and headache the first three days I took it in the morning. Switched to nighttime dosing and doing fine.",
      "MessageIndex": 35,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Feb 27, 2016 11:23PM Sattipearl wrote: Sue, and all, I had my living memorial on 2/21. It was the most amazing experience of being loved that I had ever had. Over 250 people attended. Three of my friends performed songs, two of which were written for me. Others came to the stage with me and shared how I had made a difference for them in their life and/or told some funny story about me or us. It was fabulous fabulous fabulous. I recommend it to everyone whether you're currently dealing with a terminal illness or not. If you would like more details or know how I organized it you are welcome to inquire via PM. ",
      "MessageIndex": 44,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 27, 2016 06:19PM Sattipearl wrote: 2ATHENA2, thanks for the advice re the toilet. I have 2 cats and while I've never seen them drink from the toilet, I will take no chances. Sitting outside my clinic awaiting my monthly with my onc. Labs earlier this week for blood and chemistry don't look bad. I feel good most days. Acupuncture weekly is also a big help. Had a 99 degree fever 10 days ago, then 2 days later woke up pain free. Lasted 8 hours and pain mostly remains reduced since. Film at 11.",
      "MessageIndex": 41,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Jan 28, 2016 11:56PM Sattipearl wrote: test results = stable abnormal. It is my favorite phrase. I've been having some intense hip and knee pain off and on and now that it's more \"on\" am going in tomorrow for radiation consult to reduce pain. Will be my 4th radiation treatment series. Since April I've been having acupuncture weekly with a therapist who only works with cancer patients, am taking a load of enzymes as recommended by a trusted longtime nutritionist, and drink an elixir of beet kvass, ginger juice and turmeric juice, last 2 freshly squeezed, and I make my own kvass. So glad to have found this board. Thank you for your participation",
      "MessageIndex": 43,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sattipearl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227346/profile",
      "Content": "Sattipearl wrote: I've had 4-5 different chemos and this last one was a doozy with SEs and no appreciative effect on my shortness of breath due to mets to my left lung. Just wondered if anyone is willing to discuss your experience or a loved one's with this. Thanks, in advance Much love to you, no matter what is going on Dx 11/2006, IDC, Left, 6cm+, Stage IA, Grade 1, 0/1 nodes, ER-/PR-, HER2- Dx 9/2012, IDC, 6cm+, Stage IV, metastasized to bone/liver/lungs, Grade 1, 0/1 nodes, ER-/PR-, HER2- Radiation Therapy 12/7/2012 External: Bone Dx 7/26/2015, IDC, Left, Stage IV, metastasized to bone/liver/lungs, Grade 1, 0/1 nodes, ER+/PR-, HER2- Chemotherapy AC + T (Taxol) Chemotherapy Carboplatin (Paraplatin), Gemzar (gemcitabine) Hormonal Therapy Aromasin (exemestane) Chemotherapy Doxil (doxorubicin) Hormonal Therapy Arimidex (anastrozole), Aromasin (exemestane), Faslodex (fulvestrant) Radiation Therapy External: Bone Hormonal Therapy Hormonal Therapy Faslodex (fulvestrant) Surgery Lumpectomy: Left Surgery Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847862",
      "Title": "Thinking about stopping treatment Sattipearl Rosevalley"
    }
  ]
}