{
  "AuthorID": "savgigi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
  "Posts": [
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Apr 24, 2015 06:39AM savgigi wrote: Insurance covered mine with no problem. I hope all goes well with your surgery and treatment.",
      "MessageIndex": 2,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/830702",
      "Title": "IORT and Insurance Coverage sailorbev savgigi"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Apr 25, 2015 03:11AM savgigi wrote: Sailorbev, I was happy with my choice of IORT. I had some side effects. I had a seroma, which can happen but apparently happens more often with IORT. But it was easily drained at my post-op visit. I had a reaction most people do not have - I felt like I was sunburned from the inside out and believe I have some neuropathy as a result. But it is manageable. I should mention I had the full dose. They dose IORT based on the size of tissue removed and I had 43 minutes of radiation during surgery. I guess there should not be a surprise I had some side effects. I am 2 years out and my scar is barely noticeable. I hope all goes well for you. My RO said IORT costs about 1/3 of what regular radiation costs.",
      "MessageIndex": 6,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/830702",
      "Title": "IORT and Insurance Coverage sailorbev savgigi"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "May 5, 2014 02:30PM savgigi wrote: Hi, Chris. I had the same extreme fatigue with arimidex. My MO switched me to femara and I am tolerating that a lot better. Lots of women have to try more than one AI to find one that is tolerable.",
      "MessageIndex": 5,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/820805",
      "Title": "Concerns about Anastrozole (Arimidex) chris42 exbrnxgrl"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "May 3, 2016 07:48AM savgigi wrote: Twinmar, I had the same thing happen 18 months post-op and it was fat necrosis. It was scary as hell and according to my docs, fat necrosis is very common. I pray all is benign for you.",
      "MessageIndex": 5,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843763",
      "Title": "Not again Twinmar Twinmar"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Jul 11, 2014 10:11AM savgigi wrote: You may want to request a copy of your report, not the letter they send out. The actual report will have all the measurement details and is a good thing to have for future reference.",
      "MessageIndex": 3,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/822683",
      "Title": "Breast density pfalk53 Moderators"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Mar 23, 2015 08:32AM savgigi wrote: I had IORT 2 years ago with my lumpectomy. I have a ridge of scar tissue that can still be sore, but I have no idea if that is from radiation or surgery. I also have some nerve damage that resulted in some itching, sunburn feeling and general irritation. Again, I don't know if it is from surgery or radiation or both. Both my BS and RO say my nerves are taking longer to heal than most. I had the maximum dose (43 minutes of radiation during surgery), so perhaps that is why I have more problems than most. But I would definitely choose IORT over external radiation if I had to make the choice again.",
      "MessageIndex": 4,
      "PostDate": "23/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/829329",
      "Title": "IORT - Have or planning for lumpectomy? gypsyjo Moderators"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Mar 8, 2013 04:53AM savgigi wrote: Sue, I also stressed big time about my wire guided localization. Surgery itself did not worry me much. I can tell you my experience. I had the stereotactic biopsy from hell and was terrified the wire procedure would cause just as much pain. But my radiologist was wonderful. She made sure I was sufficiently numb and slowly guided the needle in. She stopped any time I felt anything at all and added more lidocaine. She ran into one area she called \"firm tissue\". This may have been the cause of my pain at biopsy. But this time she stopped and made sure the area was totally numb before proceeding. I started by telling the radiologist about my biopsy and how terrified I was. She was very kind and made sure I did not have pain. So be open with your radiologist about your stress and hopefully yours will be as kind as mine was.",
      "MessageIndex": 1,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801509",
      "Title": "Stressing about surgical biopsy SueInMN LibraryLynn"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Jul 22, 2014 04:06AM savgigi wrote: Please trust your instincts and do not let this go. I have a friend who felt a lump right after she had a baby at age 23. She insisted on testing and the radiologist said he was sure it was nothing but would do the biopsy anyway. It was scheduled for a later time and the 2nd radiologist refused to do it because of her age and was sure it was nothing. The lump grew and 6 weeks later she finally had a biopsy. Turns out she is a stage 3. Her mother had BC at age 40. In spite of her family history, her lump was dismissed because of her age. She had a UMX, 6 rounds of chemo and 33 rads. Now she is going to have the other breast removed and have reconstruction.",
      "MessageIndex": 9,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/821320",
      "Title": "Can Surgeon tell by touch? RentingSpaceForFree barbe1958"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Jan 16, 2017 04:50PM savgigi wrote: Are you taking tamoxifen at the same time as other meds? I was taking femara and my statin at the same time and had significant pain at night. Once I changed femara to morning and the statin to night, the pain significantly reduced.",
      "MessageIndex": 4,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/851877",
      "Title": "Pain at night from Tamoxifen? Suggestions for treating? lchinitz savgigi"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Aug 23, 2013 04:05AM savgigi wrote: I had the stereotactic biopsy from hell and the radiologist scared me to death when he told me I could expect the same kind of pain with the localization. When I was taken to the breast center for the procedure prior to surgery, I told them I was more terrified of what they were about to do to me than anything else. And I told them about my biopsy experience. The radiologist in this case was a dream. She had a double mastectomy herself a year or so ago. She told me she was not into pain and she would slowly advance the wire, making sure all along the way I did not have pain. It truly was a painless experience. She calmed me, relaxed me, and I was no longer afraid at all. Good luck to you.",
      "MessageIndex": 19,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809670",
      "Title": "Lumpectomy Told different stories about wire localization IrishDancingMom dogsandjogs"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Feb 13, 2013 11:11AM savgigi wrote: I do something similar. I found the medical records department where I had my mammo and biopsy will provide electronic results if you request it. They sent me a form to complete, which I faxed back. Within a couple of hours I received by email a link to the results along with an ID and password. I looked up my results and printed them. I saved the form so I don't have to request a new form every time I want some results.",
      "MessageIndex": 13,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800383",
      "Title": "It's been a week, no results, I can't take this much longer!!! OldOakTree Moderators"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Dec 31, 2014 04:34PM savgigi wrote: Hi, mcj. I understand your confusion about the doctor's opinions. Some feel a woman at age 23 cannot have breast cancer. But that is exactly what my 23 year old friend just went through. She had difficulty getting doctors to take her seriously. She found a lump right after her baby was born. The first radiologist reluctantly scheduled a biopsy. When she arrive for the biopsy, the second radiologist refused saying it was not needed in someone her age. 6 weeks later when the lump had grown, she finally had a biopsy and learned she is stage IIIc triple negative. Her mother was stage IV at age 40. I don't tell you this story to scare you but just to emphasize that you have to be your own best advocate in these situations. I would get the ultrasound report and read for yourself what the radiologist said. Then follow your gut and insist on a biopsy if your read of the report makes you feel like you need it. A biopsy is the only way to know for sure what your lump is. I wish you the best in your decision and I hope that this turns out to be a benign condition so you can go on with your life.",
      "MessageIndex": 1,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827285",
      "Title": "Two doctors each different results. mcj mcj"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Aug 3, 2016 09:12PM savgigi wrote: I had calcifications show up at 18 months. The biopsy showed fat necrosis. I had the same fear as you that I would be facing biopsies on a regular basis, but all has been quiet since. My MO said he has a fair number of patients who find themselves with something always showing up and a fair number of them decide at some point to have a mastectomy because the stress of the biopsies and the fear at some point become too much. I have thought a lot about that and have in the back of my mind the magic number where I will make that decision. I hope all calms down for you and you do not have to face any more surprises.",
      "MessageIndex": 1,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/846624",
      "Title": "After previous DCIS dx am I doomed to biopsies every 6 mos.? Quirky74747 savgigi"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Jul 17, 2014 09:43AM savgigi wrote: Mom, I had an experience with one doctor's PA (not my MO) where she could not answer my questions. Now my chart for that particular doctor says \"NO PA\" and I only see the doctor. If you are more comfortable with your oncologist than with the NP/PA, you may want to think about that option. I have found with some doctors that I trust them but cannot trust the office staff that filters things before they get to the actual doctor.",
      "MessageIndex": 23,
      "PostDate": "17/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/822794",
      "Title": "Standard of Care? MomtoIrishQuads voraciousreader"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Nov 26, 2013 08:04PM savgigi wrote: Pokemom, I had IORT in Feb. My RO said it cost about 1/3 of conventional radiation and he had never had a problem getting it approved with my insurance, United Healthcare. They paid with no problem except for the portion that was applied to my deductible.",
      "MessageIndex": 5,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/815029",
      "Title": "IORT & Insurance Pokemom1959 Pokemom1959"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Jun 23, 2013 04:56PM savgigi wrote: Sara, I had something similar. I could feel the fluid moving when I bent over. It was a seroma like the surgeon warned me could happen. She drew 30cc of fluid out when I went for my post op check. It took a few weeks, but the remaining fluid reabsorbed just fine.",
      "MessageIndex": 2,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/806604",
      "Title": "sound of water or liquid slushing around in the breast sarajaneevans sarajaneevans"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Mar 1, 2013 02:26PM savgigi wrote: April, I totally understand. I am normally someone who is in charge of big projects, makes decisions, and gets things done. So all this waiting around for others while my future hangs in the balance is the biggest stress-inducer I have had over the last couple of months. I am usually ver strong but have been reduced to a blubbering mess by this diagnosis and waiting for results. I was told my results would be available Tue or Wed and the surgeon would call me. By Wed afternoon I was frantic and I called Pathology to see if they had released my results. The very nice lady I talked to said my case was not signed out and there could be any number of reasons including special stains, etc. Of course my mind took me to the very worst scenario. I assumed there were lots of bad things in my specimens and the pathologist was having to do all kinds of testing to see how bad things were. I was planning how I was going to handle a BMX and chemo and still keep my job. Then I got a call late Thu telling me all was clear. I got a copy of my path report and reading between the lines I think the pathologist had my slides on Monday but just did not get around to reading them until Thu. Talk about unbelievably cruel. Sounds like your surgeon wants to deliver the results personally so you can discuss it together. That is a great plan except you have to go through the weekend wondering about your fate. I think if I had not gotten some kind of answer yesterday I would have had a stroke from the stress. I wish I could offer something to help with the waiting but I really sucked at it. I was raging at the insensitivity and in tears in the grocery checkout line. I could not have a conversation with anyone without tearing up. PM me if you want to talk.",
      "MessageIndex": 1,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/801240",
      "Title": "I think I might lose my mind waiting for my pathology reports! april485 marie5890"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Mar 1, 2013 03:33PM savgigi wrote: I had the stereo biopsy from hell - not because of the position, although that was uncomfortable. But apparently the core needle went through scar tissue that was not numb, so I felt everything even with additional medication. I believe they do the stereo biopsy when there is not a palpable lump they can aim for with US. If I have to do it again, I will ask for a needle localization and excisional biopsy. I was terrified the needle localization would hurt as much as the biopsy. But it was guided by a very compassionate radiologist who was confident she could do it without causing me pain. I think the stero biopsy is computer guided, so it just plowed it's way through the scar tissue. But with the needle loc, when the radiologist hit some firm tissue, she slowed down and made sure it was numb all the way through. In the end, it was not nearly as bad as I feared and I was not on that uncomfortable table.",
      "MessageIndex": 4,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/801190",
      "Title": "Stereotactic Biopsy Irishwfl kathindc"
    },
    {
      "AuthorID": "savgigi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169732/profile",
      "Content": "Oct 3, 2013 06:26PM savgigi wrote: I understand your anxiety - I was a nervous wreck before mine. I told the radiologist I was terrified of the wire localization and she was very kind and patient. She said she was not into pain and would make sure I did not have pain. She had a double mastectomy last year so she understands what we go through like few physicians can. I would be very open with your doctors about your anxiety so they can help you. Good luck and let us know how you are doing.",
      "MessageIndex": 1,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/812142",
      "Title": "Preparing for wire localization/Surgical Biopsy.....ANXIETY gtgirl gtgirl"
    }
  ]
}