{
  "AuthorID": "Saviorlives…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224388/profile",
  "Posts": [
    {
      "AuthorID": "Saviorlives…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224388/profile",
      "Content": "Dec 7, 2015 07:54PM Saviorlives17 wrote: I had a similar story. Lump found at age 32 and all they did was an US and they said they only saw a fat nodule. After being on antibiotics for 7 days the issue was still there. My doctor ordered a mammo again this time. Radiology said I'm really too young for the radiation from a mammo. Well I'm going in for one tomorrow. Have you had any news since your last post",
      "MessageIndex": 5,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836843",
      "Title": "Lump in breast, 29 yrs old, had a ultasound, showed nothing? Naychristine2011 Saviorlives17"
    },
    {
      "AuthorID": "Saviorlives…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224388/profile",
      "Content": "Dec 8, 2015 04:44AM Saviorlives17 wrote: I guess I was just needing some reassurance from some women my age. I feel like I'm being put off because of my age. I live in a small town so I think some have that mentality that \"you're too young so it can't be cancer\". I'm not saying it is but honestly, any diagnosis of what's wrong with my left breast would make me feel better. After today's mammo if I don't feel reassured I'm going to check out a second opinion and push for a biopsy. Thank you so much",
      "MessageIndex": 7,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836843",
      "Title": "Lump in breast, 29 yrs old, had a ultasound, showed nothing? Naychristine2011 Saviorlives17"
    },
    {
      "AuthorID": "Saviorlives…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224388/profile",
      "Content": "Dec 3, 2015 08:42PM Saviorlives17 wrote: Thanks gals! Didn't get a WBC count. Had my FU appt. yesterday and my DR still feels something. He said it doesn't feel bad but he ordered a diagnostic mammo and that happens this upcoming Tuesday. Still have some sharp mild pains in the breast and under my left arm. Hoping just a stubborn infection I suppose. Trying to keep things updated on here.",
      "MessageIndex": 3,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/837008",
      "Title": "Still not feeling right. Maybe I'm crazy. Saviorlives17 Saviorlives17"
    },
    {
      "AuthorID": "Saviorlives…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224388/profile",
      "Content": "Nov 17, 2015 10:12AM Saviorlives17 wrote: I will be 33 in December and I suppose we are going through something similar. Before my last period I discovered a small lump at 3 or 4 o'clock in my left breast. My doctor checked it out and said it may a clogged duct (my youngest is 9 years so not breast feeding related) or period related. So I waited until after my cycle to see what the deal was. My period ended last Thursday. The lump seemed to go away but then on Friday something new came up. In the same area I found a lump redness showed up and I now have a lump in my left armpit. It could be a lymph node. I've had pain and aching since I discovered it. I waited the weekend out to see if it would go away. Still there on Monday so I gave a ring to my doctor and on December 3 I have a diagnostic mammo and an ultrasound. Whatever these symptoms are, they confuse me too. Being our age if this is \"normal\" we sure haven't experienced it before to know what \"normal\" is. Not to mention that we are young and sometimes medical professionals and even ourselves may think we need to ignore it. We're too young for serious issues. I begin to think like that and then I'm glad I'm getting it checked. I'd rather be told it's nothing than to wait longer and find out I should've checked it out earlier. Hang in there!!",
      "MessageIndex": 1,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836829",
      "Title": "Experiencing Symptoms at 30 rnyoung85 rnyoung85"
    }
  ]
}