{
  "AuthorID": "scannon82",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
  "Posts": [
    {
      "AuthorID": "scannon82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
      "Content": "scannon82 wrote: Hi all I would love some advice please from people with a little more knowledge that me. To start, my mother's mother (my grandmother) died of breast cancer aged around 50, and her sister (my grandmother's sister) also died of it. My mother had it too at around 55. She is now 64 and doing well. My mother was tested for the gene, and does not carry it. Whilst this is clearly good news, what I want to know is, does this mean that my sister and I are still at high risk of getting it, just not AS high risk? Or does my mum not carrying the gene mean that our risk has gone back down to that of someone whose mother/grandmother doesn't have it? I am worried about this for obvious reasons, but even more so recently as I have been diagnosed with endometriosis. To manage the symptoms, my doctor has suggested going on the pill. I am 34 and have never been on the pill before, and was happy to do so until... I discovered through the dangers of Googling that it can increase the risk of breast cancer. According to some studies, everyone is at increased risk whilst they take it and for 10 year after, but other studies state that you're only at risk if you're already at risk (I.e family history, gene etc). So what I want to know is, am I already at risk? Despite that my mum doesn't carry the gene? Or am I at normal risk, in which case it might be OK to take the pill? I am really upset as I clearly don't want to increase my risk, but I need to manage my endometriosis and stop it getting worse. I feel like I can't win. Any help much much much appreciated. Stephanie xxx Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851872",
      "Title": "Advice please scannon82 muska"
    },
    {
      "AuthorID": "scannon82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
      "Content": "Jan 18, 2017 06:40AM scannon82 wrote: Thank you! And do you know if that was prescribed because of the BC history? :)",
      "MessageIndex": 8,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851872",
      "Title": "Advice please scannon82 muska"
    },
    {
      "AuthorID": "scannon82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
      "Content": "Jan 17, 2017 06:21AM scannon82 wrote: Many thanks for your helpful message Muska. I had heard about the non-estrogen pill. So is that the progestin pill she is taking? (mini pill?) As I did read that the risk linked to BC was less with this pill, and it would work on endo. So maybe I will go for that. My 'plan' is only to be on the pill for around two years, between pregnancies (my son is due any day now, and I plan to have another in a few years). Once my second child is born, I will not go back on the pill, and have the endo treated via lap surgery instead (I just didn't want anyone going in there and interfering between pregnancies). Then eventually, maybe, a hysterectomy :(",
      "MessageIndex": 4,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851872",
      "Title": "Advice please scannon82 muska"
    },
    {
      "AuthorID": "scannon82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
      "Content": "Jan 17, 2017 06:22AM scannon82 wrote: Thank you for your reply. Good luck to you too! :)",
      "MessageIndex": 5,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851872",
      "Title": "Advice please scannon82 muska"
    },
    {
      "AuthorID": "scannon82",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245452/profile",
      "Content": "Jan 17, 2017 06:23AM scannon82 wrote: Thank you Melissa. Best of luck to you.",
      "MessageIndex": 6,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/851872",
      "Title": "Advice please scannon82 muska"
    }
  ]
}