{
  "AuthorID": "scaredmum",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181259/profile",
  "Posts": [
    {
      "AuthorID": "scaredmum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181259/profile",
      "Content": "Jun 10, 2013 10:33AM scaredmum wrote: Airianna I also feel your pain, it is 12am here atm and i have all but had 2 hours sleep for the past 3 days, the thoughts that run through you mind are endless, Im also young wife and mother of 3 children, my ordeal has been going on for 4 years now, ultrasound kept saying nothing there, now I have a hard lumpy mass about 3 to 4cm form what I can feel under my armpit on the side of my breast. Im so scared that 4 years is way to long, not only has it been so long, everyone seems to talk about a small pea size lump and mine is that big already, cant help but think IM DONE FOR SURE!! I have another ultra sound today at 10am, Iam going to demand a boipsy, as I should have done 4 years ago. Iam also finding it hard to breath with pains in my back, Im sure that is stress, I have been worried before, but never like this, I feel I just know in my heart that I have BC. There has always been pain under my armpit and a pulling feeling when I am cleaning or moving it, hurts to lie on that side, has on and off for the past few years, although the pain does go away every now and then. Im so scared for what I may face in the near future, I am not a strong person and I dont think i will have the strength for what I may hear. Have you ever heard of someone have such a large mass that has caused a problem for years and turned out to be B9? I think at this stage I have more chance of winning the Lotto, they say stay positive, but when all point to BC its hard to let your mind think anything but. I just want to scream, cry, throwup, everything rolled into one!!",
      "MessageIndex": 10,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805800",
      "Title": "2 wks till Excisional Biopsy- too long to wait? Airianna23 leaf"
    },
    {
      "AuthorID": "scaredmum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181259/profile",
      "Content": "Jun 10, 2013 04:29PM scaredmum wrote: Thankyou Southernangle, so happy that your lump was B9. your post has given me the first bit of hope I have had this whole time.",
      "MessageIndex": 12,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805800",
      "Title": "2 wks till Excisional Biopsy- too long to wait? Airianna23 leaf"
    },
    {
      "AuthorID": "scaredmum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181259/profile",
      "Content": "Jun 23, 2013 06:28PM scaredmum wrote: Your story sounds very like mine and the mass sound the same in the same spot that has been growing for the past 4 years I have also got some thickning in the smae beast near the nipple and under. The mass is also a odd shape and bumpy, it get tender around mid cycle but never goes away or gets smaller, Mine also never showed up on ultrasound or memmo, we can all feel it but no one can find it, Iam having mass removed tomorrow and even though my doctor doesnt recommend it Im am having a MRI next week as well. Your story gives me hope that this my not be BC even though that is where all my thoughts have been going for the past 2.5 weeks. Iam so happy for you and pray that I will have good new aswell.",
      "MessageIndex": 3,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805686",
      "Title": "Any experience? Mass not visible on US/Mammo- waiting for MRI Issymommaof4 scaredmum"
    }
  ]
}