{
  "AuthorID": "Scaredinca",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185243/profile",
  "Posts": [
    {
      "AuthorID": "Scaredinca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185243/profile",
      "Content": "Aug 1, 2013 09:25PM Scaredinca wrote: The office staff said I could not get a mammogram while breastfeeding...so I can?",
      "MessageIndex": 3,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808678",
      "Title": "Confused by ultrasound results Scaredinca Beesie"
    },
    {
      "AuthorID": "Scaredinca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185243/profile",
      "Content": "Aug 2, 2013 05:40AM Scaredinca wrote: Please let me know how things turn out for you. I'm not sure if it's just my imagination but the pain seems to have gotten worse over the last two weeks but that is also the time frame that the whole second opinion/ultrasound was happening so I was focused on it much more than I have been. It's weird to me how doctors just don't seem too concerned just because we are younger than the typical cases. You'd think they'd want to cover all bases because of that reason...",
      "MessageIndex": 6,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808678",
      "Title": "Confused by ultrasound results Scaredinca Beesie"
    },
    {
      "AuthorID": "Scaredinca",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/185243/profile",
      "Content": "Scaredinca wrote: Hello everyone. This is my first time posting here but I've been googling alot of information in the last few weeks and this forum always seems to pop up in the results and all the answers are so helpful. So I thought I'd post about my own situation to see if anyone could ease my mind and lend their experience. So here goes! I am 34 years old, currently still (somewhat begrudgingly) breastfeeding my 2 year old daughter. I noticed a lump sort of underneath my breast tissue on my right side back in April. It almost feels like part of my rib but is not bone hard and starts to get sore after I mess with it. I went to an OB and he felt it, agreed it felt different than the other side but wasn't sure what it was and said for me to come back in 3 months. Three months past and back I went. The lump was still there. He felt it again. He asked if I had had a mammogram and I said no because one was never ordered and I am also breastfeeding. As soon as he heard that he seemed to dismiss it as a problem and said he thinks it's muscle and maybe it feels different because it's my right side and I'm right handed so the muscle is more palpable. I told him I have been through the ringer with breastfeeding related issues and this didn't feel similar to any plugged duct I'd had before. I left feeling like I wasn't heard. I went to get a second opinion with another OB. She couldn't feel the lump on her exam but did when I showed her (like I said it is somewhat underneath the whole breast and can really only be felt when lying down and some of the tissue falls away from it) and ordered an ultrasound. I went and had the ultrasound done last week and the result came back that it was clear, no lesions found. The doctor suggested I go get a mammogram. So now my question. Wouldn't the lump have showed up on the ultrasound if it was an area of concern? She had the little wand directly on top of it to the point where it was causing pain from the pressure. So if nothing showed up am I to believe it is indeed muscle and not be concerned? I ask because I am really not interested in abruptly weaning my daughter to have a mammogram if it's already showed that there is nothing there. And I'm not sure a mammogram would really answer any questions because don't they typically do an ultrasound after a lump is detected on the mammogram anyway? On the other hand it is still there and I don't want to miss something. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/808678",
      "Title": "Confused by ultrasound results Scaredinca Beesie"
    }
  ]
}