{
  "AuthorID": "scaredmommyof6",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133496/profile",
  "Posts": [
    {
      "AuthorID": "scaredmommyof6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133496/profile",
      "Content": "scaredmommyof6 wrote: My name is Melissa. I'm 34 years old and a mother to 6 beautiful children ranging in age from 9 to 4months.  I found a lump, actually my husband did, on Wednesday July 27th.  I was able to get in to my obgyn that day and she ordered a bilateral mammogram and a ultrasound of my left breast.  We had those test done on Friday, the radiologist said what they look for is something that they can say \"its nothing\" and unfortunatly they didnt see that so they've scheduled me for a biopsy for tomorrow morning.  I'm a complete wreck, the dr prescribed me xanex for anxiety and I've taken a couple but I'm not really one for taking medicine unless really needed.  My lump is right in my areola.  In November when I was 5 months pregnant I had a lump in the same area, they had a ultrasound done and they said it was a clogged milk duct....so after that I really didnt pay any attention to it.  But here I am 8 months later with this \"lump\".  The waiting and not knowing is driving me crazy. Every other little ache and pain is making me worry, making me think...\"why is that hurting, what is that from\".  I find hope when I see so many stories of survivial but I'm so scared.  The thing they measured on the ultrasound is just over 1cm.  My mind is going a million miles a minute with \"what ifs\".  I just want to know one way or another, if it is Cancer then I want to tackle it head on and get it over with, if it isnt then I want to know so I can go through my days without this feeling on me.  I dont know anyone personally who had had to deal with breast cancer, I've never felt so alone in my life.  I know that 80% of biopsies are benign but I'm super scared because after my mammogram and ultrasound they assigned me to a \"care coordinator\" who they said will work my ins company and schedule my appts with the breast surgeon. They say they do that to be proactive and have appts made but it makes me worry that they really suspect something bad and dont want to tell me until they are sure.  But the unknowing is so scary....I've cried and cried and cried more.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772513",
      "Title": "scared and worried like never before... scaredmommyof6 SarahsMom"
    },
    {
      "AuthorID": "scaredmommyof6",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133496/profile",
      "Content": "scaredmommyof6 wrote: So in July we found a lump, 8/24 we had it removed, it came back as benign. YAY, done with that ....or so I thought. For the last 2 weeks I've had pain along my left breast, the breast that the lump was removed from, the pain is where the lymph nodes are and the pain goes up into my armpit.  I've tried \"advil\" thinking maybe muscle pain, no relief. I dont know that the lymph nodes are \"swollen\" but they are definatly painful and hard. I've called the breast surgeon and she called me in antibiotics and wants to see me again this week.  My question is for those of you diagnosed and it traveled into your lymph nodes, what did they feel like??? Also has anyone ever heard of pathology getting it wrong?  I had both a core biopsy and an excisional biopsy both showed benign, but my breast surgeon said when she cut me open she \"Thought\" it was cancer.  Makes me worried even more..... any words of advice or testimonials about your journey are welcomed!!  ***** One more thing, I have NO INSURANCE...so what, if anything, can I do to get the test done that need to be done to rule out any cancer???**** Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776914",
      "Title": "worried and scared...once again. scaredmommyof6 meme31"
    }
  ]
}