{
  "AuthorID": "scaredinal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162361/profile",
  "Posts": [
    {
      "AuthorID": "scaredinal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162361/profile",
      "Content": "Oct 14, 2012 09:37AM scaredinal wrote: Thank you to all who posted. I had both lumps biopsied on Thursday afternoon and am now just sweating the results. My boob looks awful as a result of the biopsies...a 3 inch strip of bright-red bruising--I think some blood must have gone under the skin. I am dreading that phone call. It's just so weird to me that the mammo saw neither lump and came back benign and then the u/s can be so different. I thought it was just 20 year olds who were supposed to have such dense breasts. I'll be 40 next month.",
      "MessageIndex": 6,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794855",
      "Title": "Melting down over ultrasound report scaredinal scaredinal"
    },
    {
      "AuthorID": "scaredinal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162361/profile",
      "Content": "Oct 15, 2012 01:19PM scaredinal wrote: Just got my results...everything was benign. They did not say WHAT it was but I imagine I will get more information when I have my biopsy care follow up Wednesday morning. Oh I am so relieved. I have been just sick with anxiety for 2 weeks. I will never drink caffeine again...it is just not worth it. I know they say that it can't cause fibrocystic breasts but when I don't drink it, my doctors don't say they are fibrocystic...just dense. It will make me feel like I am doing something positive to give it up anyway.  I will post more info on Wednesday when I hear what it was, for anyone else who might come along in this situation and wonder what the outcome was. Thanks to everyone who responded. I really appreciate you all.",
      "MessageIndex": 9,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794855",
      "Title": "Melting down over ultrasound report scaredinal scaredinal"
    },
    {
      "AuthorID": "scaredinal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162361/profile",
      "Content": "scaredinal wrote: I am waiting for my biopsy and I am sick with worry over my ultrasound report, which I just saw. I feel like the breast surgeon was downplaying her concern after reading this.  My ob/gyn sent me for a mammo & u/s due to my symptoms (deep itching, pain) and history of fibrocystic changes. He could not feel a lump, just fibrocystic breasts. I am 39, no family history. He wanted me to see a surgeon due to my symptoms even though he didn't feel anything. (this was before the report was ready--the specialist did have access to it before recommending biopsy) Mammo said 'Breast tissue is extremely dense. Benign appearing lymph node in the left axillary tail. No significant changes when compared with prior studies. Assessment benign.' BUT the Ultrasound said: Findings: There is a 9.3 mmm ovoid solid nodule at the 12:00 psoition in the left breast which is somewhat ill-defined and demonstrates slight posterior shadowning whitout hypervascularity. Additionally, there is an ovoid 9.3 mm mildly lobulated solid nodule at the 11:00 psotion which also demonstrates faint posterior shadowing without hypervascularity. No other abnormality is seen. Impression: Solid nodules at the 11 and 12 position are moderately suspicous for malignancy. Biopsy of both lesions utilizing sonographic guidance is recommended.  I looked up 'moderately suspicious' on the Bi-Rads and it said that was a 4C and that made my chance of having cancer 79%. I am so scared!!!!  I don't know how I am going to get through this day at work. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794855",
      "Title": "Melting down over ultrasound report scaredinal scaredinal"
    },
    {
      "AuthorID": "scaredinal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162361/profile",
      "Content": "Oct 17, 2012 03:21PM scaredinal wrote: Thank you all so much for the information and support. CoolBreeze, I read several posts on your blog and you are such a talented writer. You have changed everything about how I view those pink ribbons and what they stand for--and what is being done compared to what SHOULD be done. Thank you for the eye-opener. I am so sorry you are going through what you are going through. All of you ladies are amazing. My pathology said they were both 'sclerotic fibroadenomas.' At the end of the second line it said WTD/slc (no idea what that means). I have to go back in 4 months for an ultrasound to see if they get bigger. If they get bigger I will have them removed because I don't want them to get so big that it hurts, etc. I had a myeomectomy in January to remove a 5-month's pregnancy-size worth of uterine fibroids that grew rapidly so I imagine these will grow too (even though she said they were not related). I am going to find a new doctor though. I had to call her Saturday because my wound was hot and I was worried about infection. I gave her my name and was explaining who I was and when I had had my procedure done and she cut me off and said \"Wait, are you even my patient? Because I have no idea who you are right now.\" She had seen me twice in the last 2 weeks, and just 2 days before. Granted, she has a lot of patients but I would not even say something like that to a patron and I am just a librarian, not talking to someone who is worried about their life. I just felt very dismissed by her. So I will be doing my follow-up care somewhere else. I thank you all again for your help and kindness.",
      "MessageIndex": 14,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/794855",
      "Title": "Melting down over ultrasound report scaredinal scaredinal"
    }
  ]
}