{
  "AuthorID": "scath",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
  "Posts": [
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "scath wrote: I am still here after heart and lung surgery so now it is time for the killer chemo. I start tomorrow...has anyone had this combo? Let's do it together... Please let me know- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735232",
      "Title": "Taxotere Plus Adriamycin any have this chemo combo? scath scath"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 24, 2009 04:27PM scath wrote: We should all be in cotrol of our own destinies. Don't let your family control this...it is your journey and you should be the one to make those decisions. We are all in this together!",
      "MessageIndex": 11,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734733",
      "Title": "when is it ok to let go? scath Sessna1"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 24, 2009 10:42AM scath wrote: Elaine: Thank  you for the response. It is so kind and considerate. The truth is, I am fine with letting go but I guess I need to verbalize this in a way that it can happen. I did the health proxy & living will thing but I think there is more information I should specify. It is so nice to know someone out there is at listening! Scath",
      "MessageIndex": 2,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734733",
      "Title": "when is it ok to let go? scath Sessna1"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 24, 2009 02:32PM scath wrote: Thank you for understanding and the information. Keep posting, I feel the connection!",
      "MessageIndex": 8,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734733",
      "Title": "when is it ok to let go? scath Sessna1"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "scath wrote: I have stage 4 met. breast cancer and have had one chemo treatment. In addition, I went through a pericardial windor proceedure and some otther stuff. I have been in an out of the hospital for a month but know in my mind and soul, this is progressing quickly. I am not afraid and very at peace but do not want to freak out my family. I am not sure I want to go through much more as there is no quality of life yet. How do you discuss this with your family? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734733",
      "Title": "when is it ok to let go? scath Sessna1"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 24, 2009 12:24PM scath wrote: Thank you all for your love and support. I was actually able to fully discuss my wishes with my husband (sole care taker) and doctor as well today.When you have lived a life with meaning and controlled your own destiny making it a rich and peaceful life, I do not fear dying. It is all about the quality of life for me and when there is none left, that should be a choice everyone should respect. I am so impressed at the physical strength you all have at facing operations, etc but for me, this is not my choice. We are all taking a journey and each of us should be able to make those decisions if able. I will continue to post when able and see what you have said. I only wish I were there to support each of you. Many of us will make it through and I am so gratefut for that. So, those of you reading this, do not be frightened, keep fighting your fight in your way. Thanks",
      "MessageIndex": 6,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734733",
      "Title": "when is it ok to let go? scath Sessna1"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "scath wrote: My oncologist is suggesting chemo and I got a second opinion who said hormone therapy. How do you know who to trust? I have to decide in 3 days..HELP!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733864",
      "Title": "Two opinions, what to do for treatment? scath luvtotravel"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 8, 2009 11:52PM scath wrote: Ok. It has spread to the lungs and some bone. Estrogen positive, her2 negative. So, one doc thought where I had done well on Tamoxifin for 5 years because of being estrogen positive-hormones are the recommendation. The other doc thinks we got to be agressive now with chemo and feels my heart is strong enough. I am trying to process as much information as I can but I am a bit stumped on which way to go. I value any input although the decision is certainly mine in the end.",
      "MessageIndex": 3,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733864",
      "Title": "Two opinions, what to do for treatment? scath luvtotravel"
    },
    {
      "AuthorID": "scath",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82824/profile",
      "Content": "May 9, 2009 01:38AM scath wrote: Thank you for these valuable replies. I will find out the specifics mentioned which may help me to evaluate the decision more carefully. I feel like since I have had to put any treatment on hold for several weeks now do to the pericardial window, etc.,  I am farely anxious to \"get on with it\". Any and all advise/guidance is truly welcomed!",
      "MessageIndex": 7,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733864",
      "Title": "Two opinions, what to do for treatment? scath luvtotravel"
    }
  ]
}