{
  "AuthorID": "SchoolBoard…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94668/profile",
  "Posts": [
    {
      "AuthorID": "SchoolBoard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94668/profile",
      "Content": "Dec 20, 2009 10:27PM SchoolBoardLady wrote: By now, you probably have your results--but I am trying to find the link between \"hyperplasias\" in the Thyroid (nodules of all kinds from benign to cancerous) and LCIS.   I have linked the Estrogen alpha receptor to both breast tissue and thyroid tissue--so one might conclude that Raloxifene-- which I've decided to take to block estrogen to the LCIS--might also shrink the thyroid nodules.  Ooops, there I go trying to do the endo's job!  I had the thyroid biospy thursday (on multiple nodules on both left and right lobes)... and I await the results.  I was told that 95% of thyroid nodules in the over 50 women group are benign. Do what's driving this cell 'hyper\" growth in various areas.    I also cancelled by colonoscopy--can't do the prep during the Christmas holidays.  I just find it ironic that everyone is running around getting the H1N1 flu vaccine to prevent \"the flu\" but I would induce worse digestive chaos for the colonoscopy than I have every experienced from a flu- Hoping and praying to be in the 95%! ",
      "MessageIndex": 27,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704614",
      "Title": "Thyroid Nodule? Msklapkin Honeybear"
    },
    {
      "AuthorID": "SchoolBoard…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94668/profile",
      "Content": "Dec 20, 2009 10:33PM SchoolBoardLady wrote: Michelle, hyperplasia's of any kind any  are not off topic in a breast cancer forum. It took a very experienced internist to feel my thyroid nodules during an annual \"check everything under the hood\" examine.  My doc \"looks for all the over 50 stuff\"--so did a very careful check on the thyroid and voila--So, last week I saw the endocrinologist who confirmed multiple nodules on each lobe of the thyroid and went ahead and did the fine needle aspiration. Waiting for results.  I could slightly detect a \"difference\" in swallowing--and not all the time. Now that I know where they are, I can find them myself.   The fine needle biopsy was nothing compared to breast biopsies of all types.  Waiting for pathology results. ",
      "MessageIndex": 28,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704614",
      "Title": "Thyroid Nodule? Msklapkin Honeybear"
    }
  ]
}