{
  "AuthorID": "Schweety",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
  "Posts": [
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "May 18, 2019 01:56PM Schweety wrote: Sam81 I was reading up on Pagets and the article said that with Pagets it is not uncommon that there is more cancer in the breast. I don't know if what you or I have is that. The radiologist did not mention that at all and I thought quite frankly that he was a bit vague.... the word concerning to me is a step down from suspicious so I am considering just not having the biopsy. 80% of biopsies are benign and my Oncodx was 1 with clear margins...grade 2 stage 1A on the last cancer a year ago....seems like overkill excuse the phrase plus I am 69 years old Monday, with other health issues....diabetes, RA to name a few.  When is your biopsy?   ",
      "MessageIndex": 22,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/871562",
      "Title": "Mammogram and Ultrasound results Sam183 Sam183"
    },
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "May 19, 2019 12:13AM Schweety wrote: I never even heard of bi rads.  Good luck on Tuesday. This just really sucks!",
      "MessageIndex": 30,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/871562",
      "Title": "Mammogram and Ultrasound results Sam183 Sam183"
    },
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "May 18, 2019 09:09AM Schweety wrote: I had dcis in May of 2000 lumpectomy with rads, July of 2018 idc, lumpectomy but hormone blocker side effects made me stop within 2 months. Monday had a mamo with follow up diagnostic mamo and then ultra sound. Doc said 1 cm area of concern he would suggest biopsy. What the hell????? This area in no where near the other 2, it is down under the nipple almost behind the nipple. Isn't this a rare spot for cancer to show it's ugly head?? and so soon after the other cancer? ",
      "MessageIndex": 20,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/871562",
      "Title": "Mammogram and Ultrasound results Sam183 Sam183"
    },
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "Jun 19, 2018 08:11AM Schweety wrote: KSil ~ Wow you have been through the ringer....and I hope you are doing well. I have a question for you and any one else who would like to answer.  Did you get yearly mamo's before and after your DCIS Dx?? I am asking because I had DCIS in 2000 and was just diagnosed in 2018 with IDC.  I have gotten my yearlys, and was amazed they found a1mm mass in the same breast as before. But because I had 6 weeks rads and the mass is in a little bit different spot, they are not calling it recurrent.(??)  They have not suggested I have an MRI. I found that odd being I have had it before even tho it was DCIS they said it was a cancer but not really a cancer...??? ok whatever the heck that means. So glad I found this board.",
      "MessageIndex": 83,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/834067",
      "Title": "What percentage ER+ and how many years NED? TectonicShift GraceB1"
    },
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "May 19, 2019 01:52PM Schweety wrote: Sam183 I don't know if Pagets show up on mamos or ultra sound.....I am kind of dumb with all of this information. I had a stroke in 2006 and so my rememberer doesn't always allow me the convenience of going to the memory bank! lol Ya, know....I don't think it is because my skin is not itchy or flakey or oozing. Years ago, in 1969after I had my first baby...and for years and years I had green oozing from that breast! When I went to see the doc he said, not to worry....I did worry a bit but since the doc wouldn't do anything about it...well, you get the picture.  Good luck on Tueday...I will be thinking and praying for you.",
      "MessageIndex": 35,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/871562",
      "Title": "Mammogram and Ultrasound results Sam183 Sam183"
    },
    {
      "AuthorID": "Schweety",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274278/profile",
      "Content": "Jun 19, 2018 01:42PM Schweety wrote: I was 50 with a dx of DCIS (lumpectomy with 6 wks of rads) I am 68 just Dx with IDC ~ Grade 2, 100% est & 100% pst, Her2- will have lumpectomy soon",
      "MessageIndex": 889,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}