{
  "AuthorID": "Scilla",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
  "Posts": [
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 7, 2011 06:56PM Scilla wrote: dixiebell, Like you, I have had a really busy day - I can't remember a time when I've done this much housework!  I've also been checking the list of items for the suitcase and, having read some posts on this website, already regret not owning a a lazy boy recliner or zip up hoodie with internal pockets for the drainage bag. How long are you in hospital for? The breast nurse is talking about getting me home for the weekend, but I expect you are in for much longer if you are having reconstruction. If it's any consolation I too am very anxious about my surgery - also on August 10th - so I'll be thinking about you. Good luck for Wed",
      "MessageIndex": 86,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 18, 2011 01:08PM Scilla wrote: Hi everyone, lilylady: thanks for the words of encouragement. I felt v.sorry for myself earlier today and had a good cry :( , but in response to your comments, I've upped the exercises and, together with some additional massaging of the shoulder area, I have been able to get a little more movement into my arm today. I'm still a long way from holding my arm over my head. Do you also suffer from numbness in the chest above the mastectomy scar and is the muscle there still all bunched up? blondelawyer: my chest looks like its been attacked with a bread knife and my stitches feel like knots on rope - so like you I'm feeling mutilated. I'm really glad you've had a better day. Like other ladies here, I know that we will continue to have good and bad days in the weeks to come. Eema: sounds like you've got a sizeable seroma. I can tell you that draining it will make it more comfortable. I had several rashes and lost some skin when they ripped off the dressings. It was at it's worst under the armpit where nodes had been removed and hair was beginning to regrow - ouch! I too am having spasm in the pectoral muscles - it must be more common than I thought. As dogeyed suggested, muscle relaxers may help - I'm going to ask about them tomorrow. I'm still spending most of the time in extra large nighties and as my good friend recovering from a lumpectomy told me  'after surgery you will be different and your new body will tell you to take one day at a time, not rush the recovery and enjoy taking things at a much slower pace' Good luck to those having surgery today and tomorrow. ((Hugs)) and love to you all",
      "MessageIndex": 213,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 15, 2011 08:43AM Scilla wrote: Hi girls,   I'm back - and according to my surgeon my mastectomy went well. Well yes, they did remove my left breast, but they also took 5 nodes in the process having said they would only remove one or two sentinel nodes!  The BS then decided to take out my drains after 12 hours (apparently, they were not filling), but, surprise surprise, I then developed a seroma and she decided the drains may have initially been put in the wrong place. It's strange, but I could have sworn the drains needed to be in for at least the first few days after surgery. The hospital were ready to discharge me the morning after the operation (no, I couldn't believe it either), but I felt terrible and started vomiting so I was kept in. I finally arrived home on Saturday afternoon and am now being very well cared for by my family. I have an impressive scar about 20 cm long across my chest which swooshes around like a water bed (apparently, that's the seroma). Fortunately, I'm not in much pain at the moment; the surgery area, shoulder and armpit feel quite numb, but I have an aching feeling all the way down to my fingers. I don't know if all of this is normal or if it will improve. I also discovered a new mound of flesh under my armpit which makes moving my arm backwards and forwards difficult and uncomfortable - is this a so called 'dog ear' and has anyone else got one of these rather unattractive additions?  I now have a follow up with the BS in 2 weeks to find out the finals pathology results. I've been doing some initial exercises, but I don't know how hard to push it. Any advice would be welcome. Thank you for all the kind words of support before the op and just to add that I'm thinking of abatellik, stcc, tlaquepaque, TML, blondelawyer, FLwarrior, RangerMom today. I now know that everybody's journey is different, but - to the ladies that are still to embark on theirs - I'm hoping yours is one of the easier ones. Take care Scilla",
      "MessageIndex": 169,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 17, 2011 06:01PM - edited Aug 17, 2011 06:16PM by Scilla Hi girls, Lilylady: What you are going through is entirely understandable, but there's no need to panic about the sloshing. It sounds like it's a seroma. I've discovered that most of us mastectomy ladies produce this fluid as part of the healing mechanism when our body is injured. If it continues to build up it can be drained to protect your stitches and to prevent it putting pressure on the wound and causing pain. For me having a small amount of fluid acts as a cushion and prevents the remaining breast skin from rubbing against the chest wall (which is painful and is what happened when they drained mine). Like you, I'm so pleased to be rid of those drainage tubes. For something small they really can kick a punch. One week on from my surgery, I'm now developing stiffness and finding it difficult to fully raise and stretch my arm over my head, surprisingly something I found I could do straight after the operation. I'm also getting a dull pain in the armpit area and feel as if the skin in the area will not stretch ant further. I've had quite a bad day with this and I'm getting quite anxious about it. Any advice/support from ladies further down the road would be appreciated. I've also ditched the bra! I have just started to get some feeling back into the surgery area and just cannot bear to have anything touching the scar. I've discovered that lazing around like Cleopatra, supported by a variety of cushions for under the arm, chest, back and knees while being waited on by adoring family is the best medicine. Unlike, Lilylady I haven't fully accepted the new me yet - probably because the scar is not very pretty and is continuing to cause me alot of grief. I think I would be coping better if I knew when it is going to start improving. I've had enough of feeling pathetic and sore! blondelawyer: Just read your post. I'm sorry to hear you have had such a bad time. If it's any consolation, the surgeon will have cut the nerves around the incision and, until the nerve endings start to regrow, the whole area may well remain numb. I also found that taking the prescribed number of painkillers definitely takes the edge off and helps you to sleep (for most of the day initially) I also find a short walk around the garden tends to iron out the kinks and makes me feel more comfortable. I hope you feel better tomorrow ((hugs)) Diagnosis: 7/13/2011, DCIS, 6cm+, Stage 0, Grade 3",
      "MessageIndex": 206,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Nov 12, 2015 10:35AM - edited Nov 12, 2015 04:19PM by Scilla Well, here's another one checking in. I wish that I could say that I was doing well and that there was nothing to report, but unfortunately this September I noticed a change in the skin around my mastectomy scar which subsequently turned out to be a new tumour - I completely freaked out! I underwent surgery on October 29th and am now awaiting my appointment with the oncologist. I was initially diagnosed IIA, but they noticed a spot on my lungs on the CT scans and so now I don't know what to expect. I've been told the minimum is radiotherapy and my surgeon suggested I be given Arimidex as an adjuvant hormonal therapy after any other treatment. I've also got cording and some swelling in my upper arm :( As you can imagine, I'm feeling a bit low. Any advice from you ladies at this stage would be very helpful. Dx: IDC IIA ER+, PR+, HER2-.",
      "MessageIndex": 912,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 8, 2011 05:24PM Scilla wrote: Wow, I've just looked at the list. August really is a popular month for surgery. Like dixiebell, I will be thinking of all of you over the next few weeks. I hope that our surgery goes well and that there are few problems and excellent outcomes. Jamie, we may not have signed up for BC, but it has given me the opportunity to join this forum and get to know you all - a definite bonus Good luck to everyone. Scilla",
      "MessageIndex": 96,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "Scilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131550/profile",
      "Content": "Aug 7, 2011 06:13PM - edited Aug 7, 2011 06:58PM by Scilla Hi ladies, I'm so glad I've found you all. What a fantastic group! It looks like the group has just got bigger by 1. I'm scheduled for a UMX on 10th August to remove a very large, high grade DCIS. I'm really nervous about the surgery, losing a breast and what to expect afterwards. The BS is also doing a SNB at the same time and I will have to wait 2 weeks to find out if my DCIS has become invasive. I've found it difficult to sleep since they scheduled my surgery - so being here in the early hours is not unusual. I keep going over things in my mind, telling myself I have no choice - it's the cancer or me, but I feel sick when I think about losing a breast. It seems as though the closer I get to the surgery the more lost and unprepared I feel.",
      "MessageIndex": 83,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    }
  ]
}