{
  "AuthorID": "SCMom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
  "Posts": [
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Dec 30, 2014 01:56PM SCMom wrote: Hi Jlynn - I had to google bolus, I'd never heard the actual name. I have to use one. It's amber colored, maybe 1/4\" thick and covers my radiated area. The technicians tape it down all the way around to form a seal. At the beginning it was used during every treatment. After about my 10th treatment my RO said that I was getting \"too much?!\" radiation so now it's used every other treatment. I get jealous reading of y'all that have such quick treatments. Mine is Tomo-therapy...the table slides me into the machine for about five minutes for a scan, then out for a few minuteswhile it calibrates or whatever it does, then back into the machine for about ten minutes of treatment. Both arms fall asleep every time! Today was number 15 out of 28, so far so good!",
      "MessageIndex": 604,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 6, 2015 08:03PM SCMom wrote: hi Yikes...thank you for your responses. Fortunately I feel confident taking the Cipro that my MO oncologist prescribed (without a urine sample.). He's prescribed this during my chemo (with a sample)...maybe he thought I had UTI's often enough to be pretty sure that's what it was. And Cipro seems to be the go-to antibiotic for this. I don't know if the RO even has cups to take specimens in, much less a lab to culture them in. I see my RO once a week after rads, the nurse has me step on a scale and that's it...no temperature or blood pressure taken. My alternative to getting a prescription called in would be to go to my primary care doctor, who works in a clinic, as a walk in...I've done this before and have had wait times up to 2.5 hours...not something I wanted to do as the flu has really been going around in my area and I've been lucky enough to dodge that bullet so far...knock on wood. Call me old, call me old fashioned...I just think that a doctor, regardless of his specialty, is still a doctor and should be able (and willing) to treat basic maladies.",
      "MessageIndex": 764,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Feb 4, 2015 07:59PM SCMom wrote: Coyote, I agree with you...I think that different machines can cause different reactions. I had the TomoTherapy also and really no side effects with it...pretty dark skin but more like a tan than a burn. I've actually been taking long soaks in the tub and trying to scrub off the dark skin with a washcloth...I'd like my \"girls\" to match again. As far as lotions, I'll admit now that I was just too lazy (or depressed) to care during rads...I'd be lucky to put lotion on once a day but more often than not went without. My center recommends Alra therapy lotion...you can google it and buy it online. I was also given samples of Aquaphor but hated the greasy feeling so only used it once. ",
      "MessageIndex": 1412,
      "PostDate": "04/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Dec 21, 2014 05:01PM SCMom wrote: Hi there. I started radiation on December 9th - 10 down, 18 to go. I'd like to know if anyone in this group did radiation with implants? If so I'd love to hear how it went/is going. Thanks! ( posted in Fall Rads also. )",
      "MessageIndex": 489,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 6, 2015 07:06PM SCMom wrote: Birdgirl, I'm so glad I'm not the only one to feel this was. In my case I know it wasn't a side effect of radiation...but I had just left the RO's center...and he IS a doctor. It wouldn't have taken much effort to go outside of his area of expertise and have his nurse call in a simple prescription. Eileen, thank you. I agree that if this is a change in the medical field it's definitely not for the better...I'm used to having just one doctor at a time! (With the exception of obstetricians when I was pregnant!)",
      "MessageIndex": 759,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 8, 2015 03:33PM SCMom wrote: Fionascotti - which part of South Carolina are you in? I live in a Myrtle Beach. It sure was cold today! Saltygirl - radiation has definitely been the easiest part of this journey. I've done 21 out of 28 now and no major side effects. I was tired the first week, and my skin has just started turning red but that's it. I had immediate implants and my PS said that any implants can develop capsular contracture, not just radiated implants. And he said that the alloderm he used adds a layer of protection over the implants. As for Herceptin I haven't had any side effects with it, other than that I do think it's causing my hair to grow in slower than it should :(",
      "MessageIndex": 809,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 19, 2015 03:39PM SCMom wrote: Coyote - I hope your rib pain is better. Before I started rads the radiation doctor told me only of three side effects...skin changes, fatigue and fractured ribs. Apparently radiation makes your bones brittle and thus easy to fracture. I finished this morning...28/28. Really red and really tired. I'm so happy this part is over.",
      "MessageIndex": 1033,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 6, 2015 05:18PM SCMom wrote: Hi ladies...today was number 18 of 28, just 10 left to go! The only side effect so far is that my left arm has really been hurting and it feels like there's a huge knot in my armpit. I'm guessing it's swelling from the radiation. Each treatment it's getting harder to hold my arm up for 15 minutes or so. But I can and will do it no matter how much it hurts! Over the weekend I felt like I was developing a UTI so yesterday I asked to see the nurse after my rad treatment. She was at lunch so the tech left a message for her asking if she would call in a prescription for an antibiotic. The nurse called me and told me I'd have to call my primary dr. because \"We are only treating your breast.\" I was completely blown away...I'm pretty sure the doctor as well as the nurse learned basic medicine in school. Do y'all think I'm over-reacting by being so miffed about this? When I went for my herceptin infusion today I told the nurse there about it and asked if my MO could write me a prescription...she came back a couple minutes later and asked, \"What pharmacy would you like your prescription called into?\" Gosh I love my MO",
      "MessageIndex": 756,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Jan 8, 2015 06:03PM SCMom wrote: Tangles - do you think the FAST shampoo works best if used daily? I ordered it and received it yesterday (it smells nice). My hair is less than an inch long so I haven't been bothering to wash it more than a couple times a week.",
      "MessageIndex": 21698,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Dec 21, 2014 09:28PM SCMom wrote: Blownaway, thank you! I'm so glad to hear that it's so far so good with you. I'll have to ask my RO about massage, he was adamant from the beginning that there would be no harm to my implant but I'm just not so sure. I'm just under two months out from surgery and it seems like almost every day I'm feeling some sort of change. I can't wait for this to be over! ",
      "MessageIndex": 1175,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "SCMom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205703/profile",
      "Content": "Dec 21, 2014 07:58PM SCMom wrote: Hi there. I started radiation on December 9th - 10 down, 18 to go. I'd like to know if anyone in this group did radiation with implants? If so I'd love to hear how it went/is going. Thanks!",
      "MessageIndex": 1171,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    }
  ]
}