{
  "AuthorID": "Scotty",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
  "Posts": [
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Jan 8, 2015 10:43AM Scotty wrote: I'm not too sure. I think one may have been 1cm but the rest were 6mm or less. My first scan after 3 months on letrozole they said they had halfed in size but I didn't ask what size they were. I had a scan yesterday and will get results on 15th. I'll post the results.",
      "MessageIndex": 10,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825021",
      "Title": "Would you mind sharing your story? Moderators jdmac1199"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Dec 31, 2014 06:40PM Scotty wrote:",
      "MessageIndex": 8,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825021",
      "Title": "Would you mind sharing your story? Moderators jdmac1199"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Jan 16, 2015 09:01AM Scotty wrote: Yes the waiting is hard. I hope your onc can put your mind at rest. I have to wait on an appointment onc said probably take about 3 weeks. I am in the UK. The onc said they may refuse an mri and then I would get an ultrasound. Not sure how accurate that would be. I'll just have to wait..",
      "MessageIndex": 14,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825021",
      "Title": "Would you mind sharing your story? Moderators jdmac1199"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Jan 15, 2015 08:38PM Scotty wrote: Hi, got my results today. The lung mets have continued to shrink. Again I didnt ask what size they are exactly. There is a mark or lesion on my liver though. 1.3 cm and it wasn't there 3 months ago. The onc is not sure if it is another met and I have to go for an mri scan. I thought that was quite large for something that wasn't there 3 months ago but the onc said not to think of it in a linear way. Just because it is that size now it may not progress for months. It may not be a met anyway but chances are it is. I won't know for a month. He said they would leave me on letrozole for the time being and will only change meds if the lesion grows.",
      "MessageIndex": 12,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825021",
      "Title": "Would you mind sharing your story? Moderators jdmac1199"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Scotty wrote: Has anyone read about how artificial light at night can stop tamoxifen from working and can speed up the growth of cancer cells. They also think it can add to the risk of BC in the first place. Seems to be something to do with melatonin production. Even very dim light can be problematic. Shift work adds to the risk. I have always slept with a light on or had a bright street light outside my window. I also worked shifts for ten years. I went onto tamoxifen in 2011 and had lung mets diagnosed Feb this year. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827277",
      "Title": "light at night Scotty Scotty"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Dec 31, 2014 10:53AM - edited Dec 31, 2014 10:54AM by Scotty I think it's quite important to know. Tamoxifen doesn't work for lots who take it. And this might make a difference.",
      "MessageIndex": 2,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827277",
      "Title": "light at night Scotty Scotty"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Dec 31, 2014 05:29PM Scotty wrote: Nurses and air stewardesses have higher than normal occurrences of breast cancer and blind women have lower occurrences. Such a simple thing to use black out curtains or an eye mask. Women on tamoxifen should be advised to do this.",
      "MessageIndex": 4,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827277",
      "Title": "light at night Scotty Scotty"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Dec 31, 2014 01:17PM Scotty wrote: Hi, i suffered from depression after my initial diagnosis and treatment. I went on anti depressants. I was warned I would feel worse before I felt better and it was truly awful for about a month, then I started feeling better. Just wondering if you weren't giving the drugs enough time. I know it's rough but if I had swapped onto another drug I wouldn't have known where the heck I was. I was reading about light pollution which hampers our ability to produce melatonin and also stops tamoxifen from working. It also causes depression and other problems. They say not to use electronic devices before bedtime. Try to get at least 7 hours sleep. Melatonin peaks between midnight and 2pm. You must sleep in total darkness. Even dim light is problematic. And try to get out in the sun during the day. Another problem with lack of sunlight is vitamin d deficiency which can also cause depression. Be careful with supplements though. If you don't have low melatonin taking it as a supplement may cause side effects. You also have to watch when you take it. Also with vitamin d you have to be careful you don't take too much. Read up on NAC I think it may help some depressions too but I may be mixing it up with something else. Exercise too can help if you are able. Sorry if this is all old news. I was 48 when I went through Chemo/tamoxifen menopause. Probably near it anyway but I've never had any symptoms to speak of. Like the others said i wouldn't take estrogen if your cancer was hormone sensitive. Hope you can find some relief.",
      "MessageIndex": 32,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/826766",
      "Title": "Estrogen replacement....am I crazy? Amoc1973 Scotty"
    },
    {
      "AuthorID": "Scotty",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209513/profile",
      "Content": "Dec 31, 2014 12:09PM Scotty wrote: I had a few lung nodules and a pleural effusion on both lungs. I didn't respond very well to taxol and the onc thought it was maybe  lung cancer or it had changed from er/pr positive. I had a biopsy. It was definitely breast cancer mets and it was still very hormone sensitive. I was put on letrozole and so far it's working very well. I've got a 14 year old with muscular dystrophy so no I'm not ready to go any time soon. ",
      "MessageIndex": 15,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823460",
      "Title": "Anyone with single lung met...and no other mets anywhere else? wrsmith2x LindaE54"
    }
  ]
}