{
  "AuthorID": "scoutmm56",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
  "Posts": [
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Apr 7, 2006 02:04AM scoutmm56 wrote: I just completed neo-adjuvant chemo/ 4 rounds AC and 4 rounds of Taxotere, surgery scheduled 04/24/06. I find the side effects from Taxotere harsh. Did anybody else get the whole list of side effects? Sometimes I feel like the side effects are underplayed. Did anybody actually go through 4 rounds of Taxotere without the following side effects: The day of and two days after I'm O.K., then like clockwork days 3,4,5 I feel like I have the flu-muscle pain throughout body. I have to take tylenol around the clock. About day 6 it starts to wreck havoc on the mucos membranes-mouth, gastro track and eyes. Every time without fail it rips the lining off my tongue and cheeks and eventually caused sores. I thought it was thrush but the medicine for that didn't touch it, and it happened every time. Along with this it hits your gastro track and I got the anal itching. Next like clockwork and this is absolutely the worst-it hits your eyes. I got sensitive to the light and my eyes were red burning and puffy, and looked like I had conjunctivitus. They finally started tearing. The literature mentions tearing which sounds annoying but innocuous-but what they don't tell you that the tearing is the end result of the itching burning photo-sensitvity. I also got a rash on my hands. This very last time I got it on my face as to red blotches. I'm I unlucky or did other people get this whole range of side effects.",
      "MessageIndex": 2099,
      "PostDate": "07/04/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/185035",
      "Title": "2005 ROCK-TOBER CHEMO GIRLS sherryhaire Curlylocks"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Aug 27, 2009 07:42PM scoutmm56 wrote: 1) -Schedule that first chemo session early in the day so that if you get sick they can call in a prescription (suppository) and you'll be able to find a pharmacy that is open.  (I was sick all night-awake and had to wait for a pharmacy to open in the morning-which brings me to the next point 2) Insist on the good anti nausea drugs from the get go and you might/probably won't have to go through a nightmare night of vomiting.  Tell the doctor you get sea sick air sick car sick really easy.",
      "MessageIndex": 41,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Oct 30, 2009 05:10PM scoutmm56 wrote: i have the numbness too that goes halfway down my arm and around back into shoulder blade and weakness in my arm no matter how much I try to strengthen it--and I only had 3 lymph nodes removed--I don't feel i was fully informed about how damaging the surgery would be--they need to show pictures with the area marked in black pen-just like they do prior to plastic surgery to show the areas that will be numb after surgery.  I want reconstruction of my arm more than my breast.",
      "MessageIndex": 6,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742955",
      "Title": "Numb Back still 1.5 yrs later Dejaboo DATO"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Jul 5, 2012 05:28PM scoutmm56 wrote:",
      "MessageIndex": 38,
      "PostDate": "05/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790072",
      "Title": "Expected Life SPAMgirl jocanuck1951"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Aug 1, 2011 03:52PM scoutmm56 wrote: Ditto..just when you thought the \"cattle call\" we call flying couldn't get worse...I too , because of the new scanning equipment got patted down and hands swabbed because I was wearing a prosthesis...tsa agent said yeah that was probably what made them question your scan...I deal with the indignity everyday and annoyance of being lopsided...I didn't need my face rubbed in it in public ..I too was also nervous about my bins of personal possessions which contained my wallet which were far away from me and had multiple persons walking by who could have lifted it...i too will be taking my prosthesis off the next time I go through airport security...I'd love to reach down my shirt pull it out and through it in the bin...but I know I would really get patted down then....",
      "MessageIndex": 5,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/771466",
      "Title": "Breast prosthesis & airport security 15yrscounting mthomp2020"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "May 24, 2009 07:56PM scoutmm56 wrote: I am not an \"expert\" but I wanted to chime in-I too did what I could do but finally had to say uncle.  In your case it is as though your body is saying uncle and your mind wants to carry on.  You had a wonderfully long time NED  and if I am reading you right you are concerned that if you skip that last dose you may not get that good long time before ( /if)  if it rears its ugly head.  I use to work at a health insurance company  while I was going through treatment I had the good fortune to be able to talk with the caseworker nurses .  When I mentioned I did what I could  (4 AC 4 T  left mastectomy) and was too tired to do more--she said that's fine, they always have their bag of tricks when and if  the time comes.... I have faith in that and it has been four years.  I know this doesn't answer your questions exactly...but you certainly have done alot...when the time came to step up again...best wishes",
      "MessageIndex": 1,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734743",
      "Title": "Anyone skip their final TC chemo? (long, sorry...) dmoh scoutmm56"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "May 16, 2010 04:13PM scoutmm56 wrote: Unfortunately I still have the neuropathy  and it has worsened and it has been four years.  It flares up and worsens at times.  It has moved to both feet and hands and sometimes keeps me awake at night.  I mentioned it to the oncologist's nurse and I commented that nobody told me the side effects of ACT  could last this long and be permanent and actually worsen and she said \"if we did then nobody would do it\".  My thought is-well if you had fully informed me that this was a permanent side effect-then I wouldn't have done it--it was my choice--that they never gave me a chance to make. ",
      "MessageIndex": 9,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/752576",
      "Title": "Peripheral Neuropathy - 18 months post treatment? moonchild64 dtad"
    },
    {
      "AuthorID": "scoutmm56",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/16697/profile",
      "Content": "Jun 13, 2009 08:54PM scoutmm56 wrote:  You can only do what you can do. Also 2 lumpectomies and four rounds of chemo...that is nothing to sneeze at.  You have fought a good fight.  I agree though that in this day in age your wicked side effects--it seems they could have tweaked the treatment to make it less grueling.  It takes courage to continue it takes courage to say I can't go on at this time.",
      "MessageIndex": 5,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735829",
      "Title": "I'm ready to just say no NAZSusan Seabee"
    }
  ]
}