{
  "AuthorID": "Scrappygrl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
  "Posts": [
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Oct 26, 2008 05:27AM Scrappygrl wrote: I had a bilateral last Friday with expanders put in...my Breast Reconstruction Surgeon said it would be outpatient but my General Surgeon had me checked in for overnight.  I got to hospital at 6am checkin, surgery at 8am....I didn't get a room until almost 8:30pm and was out before 1130am Saturday.  I think it depends on Surgeon.",
      "MessageIndex": 7,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723202",
      "Title": "Bilateral mastectomy as 23-hour outpatient econmom Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: Has anyone tried to get insurance on their own after being diagnosed with Metastatic Breast Cancer?  If you did, how much did it cost?  When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783397",
      "Title": "Getting Insurance Scrappygrl Chickadee"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Feb 29, 2012 12:14PM Scrappygrl wrote: Thanks for the information, I called them and they have scheduled me to see someone in person next week. ",
      "MessageIndex": 9,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783397",
      "Title": "Getting Insurance Scrappygrl Chickadee"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Feb 29, 2012 07:31AM Scrappygrl wrote: I don't have brain mets...it is bone mets.  He is military and we are not \"officially seperated\" just been living in seperate places.   If I filed for divorce, then he would take me off everything.",
      "MessageIndex": 3,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783397",
      "Title": "Getting Insurance Scrappygrl Chickadee"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Apr 18, 2012 05:09PM Scrappygrl wrote: I went through similar where they couldn't see it so come back in six months type of thing.  Luckily for me the mass showed itself weeks later and I demanded them to figure it out.  I would ask for a second opinion or just tell the radiologist that you want it done regardless.  Seeing that you have breast cancer in family history should be automatic grounds for Biopsy.  I agree with the previous poster, if he's uncomfortable with doing it because of implant then you should call around and find a dr that will do it.  You don't want to wait and see.  It could be the difference between a short stint of chemotherapy to chemotherapy radiation, and surgery.  Good luck.",
      "MessageIndex": 3,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786049",
      "Title": "Mass on MRI -- Dr. does not want to biopsy but I do BlueSky5 Mooleen"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: I saw my oncologist yesterday just before doing round 4 of chemo and right after he checked my breathing etc, he then turned and said to me that he wants me to have another heart test done.  I didn't think of it right off the back to ask him if that was normal or if he was concerned.  He didn't act concerned but now I wonder if it's normal or he thinks there might be something wrong.  Did anyone else get one done halfway or towards the end of chemo treatment?  If so was it just standard procedure or they thought something was wrong? When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729492",
      "Title": "Muga Scan test 1/2 way through Chemo? Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: Has anyone else gotten bad acne after starting Chemo?  My face is so overwhelmed with blemishes and it was ok because my hair covered a lot of the worser areas but now that my hair is gone, I feel like my blemishes are sticking out and ever so noticeable.  Nothing I had used before for ocassional blemishes is working to heal them.  Any ideas?  When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/726575",
      "Title": "Acne after treatment Scrappygrl Snappygoddess"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Apr 25, 2012 04:13AM Scrappygrl wrote: @Chickadee...I love the portal but I cannot find where I can write to my Radiation Oncologist anywhere.  It just allows me to write to the primary oncologist.  Do you know if you can write to a different dr on there?",
      "MessageIndex": 17,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785926",
      "Title": "MD Anderson 1701jms Chickadee"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Feb 29, 2012 03:34PM Scrappygrl wrote: I was just diagnosed with one spot in bone for sure..possible 2nd spot nearby.  I am going to be going to MD Anderson and doing a agressive radiation treatment for women with BC Bone Metasis. It will be a six and a half weeks treatment. ",
      "MessageIndex": 18,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781575",
      "Title": "Just found out.... DanaCox apple"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Mar 14, 2009 08:15PM Scrappygrl wrote: Where do I find out the information about the margins?  What exactly is that?",
      "MessageIndex": 12,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: Has anyone done their exchange before Radiation?  I just got done seeing my PS today who said he thinks it would be better to do before Radiation than afterwards.  I've not heard of this before and was immediately thrilled to hear that I don't have to wait a year or longer.  Any thoughts? Thanks! When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Mar 14, 2009 10:22AM Scrappygrl wrote: Well I got a second opinion about getting the rads and he said his only reason for me to have Radiation is because my initial MRI indicated a mass of 10 cm. And he said anything over 5cm would require Radiation. BUT the final reports (after surgery) showed only a 3.2cm mass.  So that would put me out of the criteria for Radiation.  After explaining all the possible risks of having the lung disease and especially higher chance of Lymphedema (I had a scare of it in Dec), I kinda feel like it is not worth the risks at this time.  I had long conversation with Onc about it yesterday and he kinda is leaning with me although he didn't say it directly.  Just agreed about the 3.2 cm putting me out of criteria area.  And also dismissed the Radiation Onc saying that the Chemo only goes through blood stream when Onc says no it will get the tissue area as well. But he did say Radiation will only affect targeted area (breast.)  He said if I opted no Radiation then he would have me do a Pet Scan every three months to see if anything shows up for at least a year.  Then back off the 3 month checks if nothing shows up.  So I think I am going to forego the Radiation. Thanks for writing you guys.  This is/has been a scary decision to make but in my case, I think I am doing the right thing.",
      "MessageIndex": 8,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730438",
      "Title": "Exchange before Radiation? Scrappygrl nurlaw"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Mar 14, 2009 10:56AM Scrappygrl wrote: My Radiation Onc told me Thursday that two studies done outside of the US showed about a 26% total overall non-recurrance after Rads.  Is that enough for me just a tad over 1/4 (of 100%).  After explaining all the possible risks involved, I'm gonna have to say no it's not enough.  If it was closer to 40-50% then I'd say yes.  Also, on one of these posts someone posted about this sitehttp://www.breastcancerchoices.org/FAQTreatment.html   where they say the chances of death increase in few years due to other vascular problems by up to 21% within 2 years after radiation.  So 26% chance of non-recurrance vs 21% of deaths...that is an easy decision for me. No rads, but then again all the other risks involved for me is not worth it in my case due to my tumor size being 3.2 cm.",
      "MessageIndex": 25,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/727714",
      "Title": "What % would make you do it? Estepp Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Feb 29, 2012 09:44AM Scrappygrl wrote: I absolutely loved having sex with my husband until the breast cancer.  It changed everything for me.  I no longer felt like a woman, gained a lot of weight from meds and just didn't like the way I looked.  My husband treated me badly during my chemotherapy treatments and it was never the same after that.  He finally cheated on me but kept it a secret until I found out last year.  My thought is....you marry for sickness and in health.  I never once thought about going to another man and he should have never thought about being with another women.  Although we are still seperated, I now see how and why he chose to find someone else.  He needed sex and I did not give it to him.  But he also should have said something as well so although I disagree with what he did, I also understand it as well and how I played my part.  I would think long and hard before giving him the option to find another sex partner.  It truly hurts to no end that your partner is \"with\" another person.   I know from experience, it still feels like yesterday that I found out and it has been seven months.",
      "MessageIndex": 171,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Dec 30, 2008 11:44PM Scrappygrl wrote: deeg- Bumping just means that when someone posts to \"bump\" the thread/topic to the top of the page because it can get lost in all the posts.  This way they keep it towards the top of the page for the newbies.  Hope that I explained it well enough. ",
      "MessageIndex": 212,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Apr 17, 2012 05:59AM Scrappygrl wrote: I fought and clawed my way into MD.  I called them every few days asking if they had gotten what they wanted, if they needed anything else.  Even called different departments just to get someone to answer. Left tons of messages. It was a PITA.  But Finally I got the call that we were up and running.  Just keep pushing.  Unfortunately that first person isn't the best person as someone else mentioned.  (You'd think they would give people a better first impression) but I stuck to it and my work paid off.  Don't give up hope. Just keep calling and leaving messages or just call the main line and explain that you have left messages with no call backs, etc.  Eventually someone will listen and help you out.  Good luck!",
      "MessageIndex": 6,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785926",
      "Title": "MD Anderson 1701jms Chickadee"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: Has anyone been on Zyrtec for allergies anyhow and not used Claritan for the pain relief of Neulasta?  Did it work?  Thanks! When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725955",
      "Title": "Neulesta Pain relief/Zyrtec ? Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Mar 14, 2009 11:02AM Scrappygrl wrote: Yeah I think he was just making sure everything was ok and normal.  This one came back better than the 1st one so yeah!!! :)",
      "MessageIndex": 4,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729492",
      "Title": "Muga Scan test 1/2 way through Chemo? Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Feb 29, 2012 02:23PM Scrappygrl wrote: I stopped in to say Hi to some acquantances today and was told I looked good.  I politely said thanks but inside just dying. What else can you say?  I put on a front for people (family and friends) so they can all pretend nothing is happening or going to happen to me. :/",
      "MessageIndex": 63,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783269",
      "Title": "I was rude ma111 katie31"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Oct 30, 2008 10:54AM Scrappygrl wrote: OMG sweetie.....my heart goes out to you and your family.  I wonder if she kind of knew but just decided on her own that she would just deal with it when the time comes or she made peace with what was meant to be.  I will send prayers to you and your family though.  Amira",
      "MessageIndex": 7,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723496",
      "Title": "Just been told my mum has weeks to live kazzyann TorchSong"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Jan 28, 2015 04:48PM Scrappygrl wrote: Well I went o MD Anderson and they chose not to focus on my liver mets but instead focus on why I had Issues in my legs and having a hard time walking. They did some tests and discovered my bone mets went from my s1 area to now in my s2 area and is pressing against my spine which is causing the numbness. The doctor said he believes I am on the best treatment for now with the Afinitor and Exemestane. Saw the radiation oncologist who talked to two other doctors(nerve specialists) and they all agreed radiation and surgery are not an option. They said if they treated they will either cause permanent damage to me not walking ever again and or damage to my bowels and bladder. So chemo is my only option at this point. I go back on February 26 to see if the chemo has done any good. But I fear if it has not then I know they will just send me home and I'll be done. ",
      "MessageIndex": 19,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: I went in on Tuesday for what I thought was a routine appointment to go over my pet scan as I've been doing really well for the most part with my bone cancer. My dr hadn't even read my scan so he started reading it to me and they discovered two spots on my liver. So he immediately recommended two pill form chemotherapy pills to try for a month. If it doesn't change anything then I will go to IV chemo. I'm devastated. This is my third round and I am terrified that his is the beginning of the end. My husband and I decided to tell our families tomorrow to allow them to enjoy the Christmas holiday. But it is eating me alive not being able to talk to anyone about this. I haven't told any friends because I know they will start posting on Facebook and I can't have my family members find out that way. I have no parents but one grandma whom I am close to but she is very old and frail. I don't even know if I should even tell her and I know my aunt will say no to telling her. But she and I became very close after my mom passed away a few years ago. I'm just lost and sad. Has anyone battled liver cancer and did chemo and made it for a lengthy amount of time afterwards or is this it, I'll be in chemo until I'm gone? When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Jan 6, 2015 07:17PM Scrappygrl wrote: Terri- thanks for pointing that out for me. My dr specifically called it chemo. I wondered why I wasn't sick already. So you forced me to do some more research. Hope you are able to get a different treatment as well.  Thank you ladies! I'm just waiting to get my authorization for MD Anderson.",
      "MessageIndex": 18,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Scrappygrl wrote: Has anyone else gotten this after their Bilateral surgery with Reconstruction Expanders?  Here's a link to a pic of it.  http://sternalvest.com/index.html I know some people have mentioned camisoles being covered by insurance but I wonder if this is what was covered by my insurance. It's not exactly pretty or as good looking, way too tight for me and my body type but it is doing the compression job quite well.  But if the insurance would pay for camisoles as well, I'd like to know.  Thanks! When one door closes another one opens! Dx 9/28/2008, DCIS, 3cm, Stage IIB, Grade 2, 2/5 nodes, ER+/PR+, HER2- Dx 2/10/2012, Stage IV, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723434",
      "Title": "Sternal Vest Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Jan 5, 2015 07:47PM Scrappygrl wrote: I'm just getting on the board so I apologize for lateness in replying. We decided on Christmas Day for me to go home and see my grandma and other family face to face to break the news. But I must say getting the emails from all of you ladies took me from sheer panic and despair to utter hope. I've never felt as hopeful as I did after reading all of the emails from you ladies so thank you for that! I had breast cancer in 2008 then bone mets in 2012 so this is liver mets. Sorry for the confusion. Last Friday I started the pill chemotherapy Afinitor. I'm also taking Exemenstane. Both the dr and the pharmacist said that these two drugs working together are highly effective. I decided since it was a vital organ I would go ahead and start the pill chemo. I'm on it for 30 days. But as far as other options, I live in a small town and so I'm afraid the other options are not an option to my knowledge. I'm in the process of getting a referral to go back to MD Anderson in Houston to have them tell me what options I have because I'm not accepting chemotherapy as the only option. Not now that I have digested and done a bit of research, and thanks to you ladies, I see the options that are available. It's a seven hour drive and I may wind up being alone yet again in Houston getting treatment but I feel like it's the best option for me in the long run. Amira",
      "MessageIndex": 10,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827190",
      "Title": "Just diagnosed with Liver cancer Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "Scrappygrl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73688/profile",
      "Content": "Aug 20, 2013 09:15PM Scrappygrl wrote: Sadly Rachel passed last week.",
      "MessageIndex": 16,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789856",
      "Title": "My nonprofit Suites of Hope at MD Anderson! pharmgirl Iwillwinthisbattle"
    }
  ]
}