{
  "AuthorID": "SCsummer81",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250079/profile",
  "Posts": [{
    "AuthorID": "SCsummer81",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250079/profile",
    "Content": "SCsummer81 wrote: I am a healthy 35 year old. I do have a strong family history of breast cancer on my dad's side. My grandmother and aunt both had breast cancer that was diagnosed in their forties. I also have a sister that was diagnosed with ovarian cancer. With all of this history my gynecologist recommended a baseline mammogram this year. I went and received the dreaded phone call a few days later that something abnormal showed up on the mammogram and I needed to have an ultrasound done. This past Friday I went in for the ultrasound and was very displeased. Initially the tech took some pictures and then the radiologist came in and did her own ultrasound for maybe a minute at the most. Her first words were I \" think\" this is a fibroadenoma. I'm 85% sure that's what it is. I just recommend a follow up mammogram in six months and then we will go from there. When I heard think she automatically made me question her. She was just very nonchalant about the whole thing. I was a nervous wreck and all I could do was nod at the appointment. I work in the medical field and after talking to some coworkers they said that the only way to be sure that it definitely is a fibroadenoma would be through a biopsy. A biopsy was never mentioned at the appointment. I have put a call in to my gynecologist office and I hope to hear from her tomorrow. I'm just not satisfied with she \"thinks\" it's a fibroadenoma and she's \"85% \" sure that's all I'm dealing with. I want to be 100% sure of exactly what it is and I do not want to take a wait and see approach. I may be overreacting but I think I have that right to be. I'm hoping my gynecologist will agree with me. Has anyone just been diagnosed by ultrasound with a fibroadenoma? Has anyone taken a wait and see approach and regretted it? I'm just feeling so anxious and would love some advice! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "10/04/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/854097",
    "Title": "Fibroadenoma and wait and see approach SCsummer81 MTwoman"
  }]
}