{
  "AuthorID": "scwalker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
  "Posts": [
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "scwalker wrote: I recently was referred to a plastic surgeon to see about getting rid of the \"dog ears\" left after my bilateral mastectomy. After asking me if I was sure I didn't want reconstruction and me saying I'm sure he made his suggestions. My scar line is somewhat concave but I wasn't too concerned about it. The main thing I want is to get rid of the bulges under my arms. Anyway, he said he could remove the dog ears and his suggestion was to also do a reverse tummy tuck and pull that skin up to level my chest out and get rid of the ugly scars. (I had a breast reduction about 20 years ago so some of the scarring is from that.). He said it would be out patient surgery and that recovery would be 3 days to a week. He also said I would have at least one drain and maybe two. I have to admit that it sounds good....but is it too good to be true? I have not been able to find any info online about this type of surgery. Does anyone have any experience with this? Any suggestions/advise will be appreciated. I'm just a bit afraid to go into this \"blind\" Dx 11/21/2016, IDC, Right, <1cm, Stage IA, Grade 1, 0/2 nodes, ER+/PR-, HER2- Surgery 12/7/2016 Mastectomy: Left, Right Chemotherapy 2/22/2017 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 5/26/2017 Lymph nodes, Chest wall Hormonal Therapy 8/1/2017 Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Sep 12, 2018 05:03PM scwalker wrote: Sorry for the delay... Yes, he is a plastic surgeon, and he did a great job on the mastectomy scar. I have actually seen pictures of some of the dog ear incisions and they did go around to the back. I think in some ways that the scar revision actually pushed the dog ears back further under my arm, but I can see where it might be necessary. I see him for a follow up visit next week so I'll have to see what he says. But, he will have to promise me that this will be the last surgery to fix this! I wish I could just say \"forget it\", but they are really uncomfortable and I honestly want them gone! On another subject that goes along with the scar revision I discovered something last week. I have been very worried about some pain that I've been having right below where my breast was on the right side. I thought gall bladder or something, but have had a ct scan and everything is fine. So...I have an amazing massage therapist and went to her last week. I was asking her if there was any way that could be muscular. She said it very well could be the scar tissue and the fascia being stuck after all the surgery! She did a process on it called \"blading\" that is not at all painful, but has amazing results. I will probably need to have it done again, but the pain was mostly gone immediately! She said we were probably dealing with fascial adhesions and restrictions and that she could fix it! So....if anyone is having some discomfort in that area, definitely see a good massage therapist! The pain would come and go....but was very sensitive to pressure. It also bothered me a lot if I would bend over like to cut my toenails. It's like it would \"pinch\" that area and set it off. Actually a pretty sharp pain. So anyway, it is good to have that solved...none of the doctors had a clue what it could be!",
      "MessageIndex": 17,
      "PostDate": "12/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Mar 19, 2018 04:07PM scwalker wrote: Lula, thanks for the response. I'm not interested in breast mounds but the idea that he could flatten the chest area AND take some of the belly off sounds really good. I never had much belly fat even though I'm overweight but between the chemo and letrozole it has grown. I'm definitely going to ask about pics because that will also tell me if he has actually ever done this before. I will definitely keep you posted on here. It would be great if it could help your aunt",
      "MessageIndex": 4,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "May 21, 2018 12:04PM scwalker wrote: Just a quick update. It has taken forever to get the pre-authorization but it has finally been approved. I still have questions for the PS but will ask at my pre op appt on June 19th. Surgery is scheduled for July 10th. I'll keep you posted.",
      "MessageIndex": 5,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "May 21, 2018 08:16PM scwalker wrote: Thanks sbelizabeth! I'm really looking forward to getting this done and hopefully being done with surgeries",
      "MessageIndex": 7,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "May 24, 2018 07:37AM scwalker wrote: Hi Calimom! It took forever to get the pre-authorization from Medicare but it finally came through last week. My surgery is scheduled for July 10th so I'll keep you posted on here.",
      "MessageIndex": 9,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Jul 27, 2018 06:40PM scwalker wrote: Sorry for the delay. I've been meaning to post an update. It's been almost three weeks since my surgery. I have mixed feelings about it. The good stuff is: I'm healing quickly and other than a few stitches that have not dissolved yet the scar is basically healed. I ended up not having any drains which was a great thing! I really dreaded having to deal with drains again. The surgeon did an awesome job cleaning up the old scars and leveling the chest area. He also sent the tissue that he removed to pathology and it was basically scar tissue and fat...no sign of any cancer cells. Yeah!! Now the bad news. He did NOT remove the dog ears! He didn't even mention it when he came by in recovery to see me nor did he tell my husband when he saw him after the surgery was finished. I was in a compression garment that I couldn't remove for two days so imagine my surprise when I took it off to take my shower! I was seriously devastated because my main goal was to get these lumps out from under my arms! He did take part of the left side out but not all of it. I really wanted this to be my last surgery! My last question to him at my pre-op appointment was if he was sure he could remove the dog ears...and he said no problem! So...when I went in for my appointment at one week after the surgery I asked him why he didn't remove the dog ears. (I'm trying to be fair about this, but I'm still shaking my head!) He said that in order to remove them he would have to take the incision around to my back....so I would have to be on my stomach for him to do that. Ok....that makes sense but why couldn't he have told me that before the surgery? I honestly think I would have asked him to do that first if I had known this was going to take two surgeries to complete! I've looked at some before and after pictures on the internet and it does look like the scars go around to the back. He would not have been able to get to that area with me on my back. So...it makes sense but I'm struggling with why that wasn't discussed up front. So....now I have to make the decision of whether or not to have more surgery. My first instinct was \"NO WAY\"...I'm done. But as the days go on I'm thinking I will probably do it. I really have recovered quickly from this one and hopefully that will be a quick recovery as well. I see him in two months in September so I'm sure we will discuss it. The fact is that this is very uncomfortable and I really want them gone! So....we smile and keep going! I've even thought about going to another surgeon, but he actually did a great job so I really don't know at this point what I will do... Any advice or suggestions would be appreciated. It looks like I have a couple of months to think it over... ",
      "MessageIndex": 15,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Mar 19, 2018 01:20PM scwalker wrote: Momine, it does sound like a great way to fix multiple problems. I'm hoping that someone on here has done it!",
      "MessageIndex": 2,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Jul 11, 2018 02:52PM scwalker wrote: Thank you glennie! The surgery went well. It took about 1 1/2 hours. I'm still wrapped up in a compression garment but will get to take it off and shower tomorrow. Then maybe I can tell what the end result will be. So far so good! I'll keep everyone posted",
      "MessageIndex": 13,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "Dec 29, 2018 08:24PM scwalker wrote: I had the second scar revision surgery in early October to get rid of the dog ears under my arms. The original scar revision along the breast line is really quite smooth now. The second surgery is not quite as smooth under my arms but much better than it was. Overall I’m glad I had it done and I’m very relieved to be finished with surgery. Another good part of the scar revision is that I think the whole scar line is much less sensitive to touch than it was before. It seems to have helped the nerve endings somehow.  Glennie19 definitely look into the blading. I just had another session of the blading last week and it is really helping to release the tightness from the scars! My massage therapist has been to another class and they discussed the issue of this pain for people that have had a mastectomy. The instructors told her that it is very common for people and doctors to consider gall bladder problems from the pain this causes!  Cfrank, I hope you have seen a plastic surgeon and hope you get good results. Good luck! ",
      "MessageIndex": 22,
      "PostDate": "29/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    },
    {
      "AuthorID": "scwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/270982/profile",
      "Content": "May 26, 2018 07:29AM scwalker wrote: Thank you Momine! I'm not really looking forward to another surgery but the PS says that recovery time should be short. I'm sure it will be worth it in the long run",
      "MessageIndex": 11,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/863307",
      "Title": "Dog ear removal and scar revision with reverse tummy tuck? scwalker Aussie-Cat"
    }
  ]
}