{
  "AuthorID": "sdavis",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
  "Posts": [
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 3, 2009 05:19PM sdavis wrote: I am so sorry to hear that we lost sweet annie. I joined this board in Oct and found one of her threads right away. She always made me smile and often laugh outloud. She will be missed by many people.  Sue",
      "MessageIndex": 45,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727488",
      "Title": "Happy New Year + Update HeatherBLocklear AnnNYC"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 18, 2009 03:44PM sdavis wrote: 35 first dx 39 loc reoccurance",
      "MessageIndex": 97,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 28, 2008 11:42AM sdavis wrote: sweetie we are all freaked out. and its okay to be scared. I hope that the one surgery will do it but if you have read any of these threads then you know that most of us have had multiple surgeries. Dont be scared of the treatments they are what will help you live a long life. With all of the new drugs out there to counter the side effects there really arent any to worry about. I know what you mean about the family not understanding the hardest part for me is that they worry about me and arent able to help or take the pain away. I think this desease is harder on our families than us. Keep your chin up and one step at a time. Ask questions, lots of questions make sure you have a good surgeon and that he understands what you want and expect. Your going to make it thru this thousands of us do every day. Sue",
      "MessageIndex": 1,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726415",
      "Title": "TOO SCARED TO THINK FreakedOut2008 LauraGTO"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 6, 2008 08:06PM sdavis wrote: Good evening all, I hope you are all having a good weekend free of SE's I just returned home from a wonderful gathering of my friends and family. I am NOT looking forward to next week but well as I keep saying my new motto is \"suck it up and do it\" so I will. I report on Monday morning for my port placement and I have a wig salon appt in the afternoon, my father is taking me if you can believe that, he said he really wanted to. Should be a hoot. chemo on Tuesday morning at 11:20. really wish I could convince someone else to go sit in that chair for me. Colleen and Lisa my prayers are with your families. Okay its 9 pm here and I am off to bed as I have a 12 hour day at work tomorrow, trying to get the hours in since I wont be working much next week. Sue",
      "MessageIndex": 225,
      "PostDate": "06/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 14, 2008 01:45AM sdavis wrote: hello all again, its 3:30 am here and cant sleep, headache is less but still there. No I don't think its caffeine withdrawal, I don't drink much of that to begin with. always half-calf of decaf coffee and decaf soda. My husband hunted up a huge massage heating pad he bought me the last time around and it really helps with the bone twitching and aches. I stopped drinking about 5 years ago also so don't have that craving. Sweet tastes funny and salt is just almost sour. Not eating alot all at once but a bunch of little snacks thru the day. Pudding still tastes good but I try not to over due it. I am going to take couple of Tylenol PM and go back to bed, hopefully to sleep.  night all Sue",
      "MessageIndex": 367,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 16, 2008 03:14PM sdavis wrote: Evening all. I am finally feeling human enough to spend some time online. Was very very tired for a few days and went back to work on Monday so after work just collapsed. I know what you all mean about sleep I fall asleep fine but about 2 am I wake up for a potty break and then my mind wont shut off and I spend the rest of the night worrying about just about anything and everything. Oh my second tx is Dec 30.  Hoping to be feeling great next week for christmas before they put me down again. Sue",
      "MessageIndex": 433,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 17, 2008 06:07PM sdavis wrote: Day one is day of TX",
      "MessageIndex": 463,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 19, 2009 07:52PM sdavis wrote: Firni -- talked to my doc about the neuropathy and he was happy to hear it cleared up mostly by the end of three days. He said as long as it doesn't last more than a few days to just take the pills I need to to get thru. He isn't worried about it being a lasting side effect just an inconvenient one for now. We also talked about the Gene testing (BRCA ! & 2) and turns out Medicaid doesn't cover them. Was really hoping to get that done so my sis and brother and their kids could get the secondary test and be sure they were cancer gene free. I also am having a insurance company nightmare. I have Michigan Medicaid. I have a deductible that I must meet each month which is equal to half my monthly salary. If this isn't bad enough I must resubmit paper work every single month to be covered. My Caseworker has stopped returning my calls and the last paper work I got from them said I was covered for Oct 25 -31st, Nov. 8 - 30 and Dec 9-31st. I had surgery on Oct 24th, Bone scan Nov 6, surgery on Nov 7 and port placed on Dec 8th. The biggest and most expensive things I am suppose to cover?? I added it up tonight and its over 18,000 dollars. OMG how do they propose I pay for that on 8.75 an hour and 20 hours a week that I can work right now. I can't even cover the rent and all the utilities. If I didn't have a little nest egg we would be freezing our buns off in the car which wouldn't have insurance. I have my stack of bills all set I am showing up down there without an appointment tomorrow, since she won't call me back to make an appointment and if she won't see me someone will. I refuse to let them drive me insane. On a good note I had Tx today and am feeling good, went to the grocery store and stocked up on easy to cook foods so the hubby can cook after he gets home. I work tomorrow but have the rest of the week off and since my son is off school on Friday my parents are taking him overnight from Thursday morning til Friday afternoon. Gotta love the grandma and papa. I am off until Monday morning so have quite a few days to just sit and veg if the housework doesn't distract me ( it never does. lol) Okay this is long enough I guess. Hope every one else had a good day. hugs Sue",
      "MessageIndex": 1063,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 18, 2009 02:49PM sdavis wrote: Hey all, I know its been a while. I have been very very tired with this tx I am day 10 tx #4 and finally feeling human today. I slept most of last week away. On the good hand that is the only side effect this tx. My fingers are a little more sensative but not so bad I cant type or function. I wasnt constipated at all this time around.I just slept. and slept and slept  lol I hope all are doing okay. Lisa I am so sorry to hear about your sister in law. Your family has already been in my prayer because of you and your sister but now to hear about your sister in law I am so very sad for you. Sue",
      "MessageIndex": 1492,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 18, 2009 03:06PM sdavis wrote: Tex our chemo center doesnt do anything special for the last one except a hug as you leave.",
      "MessageIndex": 1494,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Apr 30, 2009 08:05PM sdavis wrote: I think you will find that no matter what date you pick the doctors and others pick the day of your first surgery as your aniversary. I choose to think of my self as cancer free after chemo was done. I think January but the doctors and every one else things August. Now with the reoccurance I have to start over and I usually state \"Cancer one was 03 and cancer two is 09. Oh and I aint doing it again so dont ask about cancer three\"",
      "MessageIndex": 2150,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 14, 2008 07:47AM sdavis wrote: okay sorry for that silly obnoxious post, blame it on a bad sense of humor. Seriously I had not heard that hint. I am better this morning headache is only a 2 on the richter scale and it has warmed up outside so instead of snow we are getting rain. Glad I dont have to drive anywhere today. Going to try putting the tree up today as my five year old is sure that Santa wont come if we dont have a tree. May even try to make cookies. I do feel pretty human this morning. :)",
      "MessageIndex": 375,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 5, 2009 07:49AM sdavis wrote: hello all, I totally understand what you all are saying. The melt downs over nothing and the lethargy on other days. I am on day 8 Tx 2 and am finally feeling okay. I have been very out of it for the last week. emotionally and physically. Didnt care if I ate or if anyone else was doing okay and that is just not me. My stomach is still a little weird and my tongue feels thick but at least this morning I was more concerned about getting my son off to school than what was on tv. Oh well tomorrow is always better (unless its tx day) lol. sue",
      "MessageIndex": 827,
      "PostDate": "05/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 17, 2009 04:09PM sdavis wrote: hello to all, I am feeling okay today but here is another snow storm and its my weekend to work I have to drive thru this mess at least an hour away. oh well go slow and if im late they can just kiss my bald head. lol Mary - why was your DH in esky? small world huh. Linda- I made chili last week and made my husband check it before I added even my usual spices. was afraid it would be too harsh. my taster is way off. Coffee tastes aweful week one and two but by week three its heaven again. have switched to decaf for the most part and found some decaf french vanilla bean yesterday at the store and its fabulous. I know I wont want any after monday so am enjoying today and tomorrow. My Onc. nurse called yesterday and said the doc and been reviewing my chart and found the note about my feet. he is worried about it. I told them that it disipated after about three days and am feeling okay now. They were releived as neuropathy is serious side effect and they dont want to lower my dosage as this is my second time around with this cancer. We are going to talk about it on Monday. My vote is do what we gotta do now to make sure I survive if I have permanant problems with my feet oh well at least I will be allive. If I cant dance at my sons wedding at least I intend to be there. Good luck to all, hoping all have a SE free weekend. Sue",
      "MessageIndex": 1041,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 19, 2009 07:47AM sdavis wrote: Well number 3 of 6 is today. have to report at 9:15 for blood work. I should be home this afternoon about 2. I work tomorrow which is fine I usually feel okay the day after but have the rest of the week off as I will be too tired to do much more than run to the bathroom. Have to talk to the doctor about the nearopathy in my hands and feet, not much they can do except lower the dosage and I am not sure I would allow that. we will see. maybe he can at least give me a pain killer for when its really bad. Other than tiring easily and a few days of walking on glass shards I am doing okay and looking forward to this being over. again. lol Love to everyone and hope your all doing well with this bitter cold and snow. sue",
      "MessageIndex": 1049,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 5, 2009 08:26PM sdavis wrote: my favorite response when people look at my head is \" I am having a no hair day today\"",
      "MessageIndex": 1329,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 9, 2008 03:42PM sdavis wrote: hey ladies, I hope everyone is doing okay today. I had my firstTC today. One little change instead of 4 rounds I am going to get 6. I have a new Oncologist as mine up and moved away. the new guy agrees with my diagnosis and plan except he said he would prefer 6 treatments. I had to agree. The more we throw at it the less likely it will come back for the third time. I am doing okay tonight a little muddle headed and funky but nothing I cant work thru. The weather here in the beautiful UP was anything but and we had a snow storm this morning to wade thru. The ladies in my chemo room were amazed when I brought my bag of goodies in and pulled out books and a blanket and snacks and water. Our center has water there but I hate the brand they use. I was starving by the time I got home though as I went in for 11:00 and of course wasnt done until after 2 so had a huge bowl of soup when I got home. Anything warm was what sounded good.",
      "MessageIndex": 277,
      "PostDate": "09/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 10, 2008 08:00AM sdavis wrote: morning all, feeling pretty good today just tired from getting up every two hours to pee all night long. as I was walking into school I even had the random thought that maybe they goofed and only gave me salilne. lol I wish good luck to todays Diva's and keep the chin up.   Sue",
      "MessageIndex": 291,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 17, 2008 04:42PM sdavis wrote: Okay now I have to run our and buy pasties for dinner. I actually saw a commercial for them just yesterday and they looked so good then I get online and thats all you talk about. For those of you who have never had one its a treat. My first husband use to say that they were what made ketchup taste so great. lol I am feeling good today. Not tired or cranky, a slight headache but not enough to even worry tylenol about. I was awake half the night not being able to shut my brain off but not paying for that today at all. Tongue hurts today and still not hungry but since I am a good hundred pounds too heavy skipping a meal or two isnt going to hurt me. I had to stop with the orange juice it hurt my mouth. I cant do things that are too cold except milk shakes and nothing too hot. anyone else having the tips of fingers and toes tingle? Very sensitive to temperature changes and its been cold here so the other day I wore two pair of gloves. lol Okay jabbering on today I just cant believe that I dont ache for my bed. yipeeee. hugs to all and keep your chin up",
      "MessageIndex": 459,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 28, 2008 09:41AM sdavis wrote: I am so sorry Cindy, there are no words that will help so I will just say I am praying for your family. Sue",
      "MessageIndex": 667,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Nov 21, 2008 04:16PM sdavis wrote: I used a kerchief tied around it to camoflage it. I had a whole pile as my dog likes to dress up. lol so I could match any shirt I chose. Large shirt isnt the issue its the length. as the drain will hang to waist level or more. Safety pin it to belt loop worked for me. and if out and about a handkerchief to hide it.  Good luck. Sue",
      "MessageIndex": 7,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724842",
      "Title": "How large do tops need to be to accommodate drains? rayhope Dawnmrn1"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 3, 2009 07:54PM sdavis wrote: Caroline relax he probably put the wording on there so that insurance would pay for it. They have to justify every test. Speaking of cold OMG its frigid here in MI. And I have had enough of the snow for at least the next two years. This is the only time of year I consider moving south. Maybe just a long vacation in the hot, hot sun. Congrats to all finishing up this week. Sue",
      "MessageIndex": 1301,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Feb 9, 2009 08:14AM sdavis wrote: morning all, its a sunshiny day here in the U.P. and it is glaring off the six foot snow banks. lol  Well I have #4 today at 11:20am, why do they keep calling to remind me of appt. I will admit that my brain has some issues about short term memory but I am not likely to forget my appt. with number 3 i had horrible neuropathy in my fingers and couldn't type for the first week. I do come on and read up though as we have a great mouse with a spin wheel and I don't have to push hard on anything. Week 2 I developed an infection and they put me on bucko antibiotics which of course them made me feel like crap. week 3 I was tired. even yesterday I was just worn out. My legs feel like jelly most of the time. Cant stand for any period of time and any exertion and I am sweaty and need to lie down a while. Trying to continue every day life but its so hard when all you want to do is go to bed. Okay enough of my bitching. hope everyone else going in today has an uneventful treatment and may our side effects be minimal. Sue",
      "MessageIndex": 1371,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Nov 27, 2008 07:15PM sdavis wrote: Mary, so glad to meet a fellow yooper transplant to IN. I lived in Ft. Wayne for ten years and graduated from IPFW with a teaching degree in 97.  I moved back to the UP in 2000 and have decided no matter what we are not moving away again. I want to raise my son here. I just feel safer. My husband is a student at NMU right now and I work in home health, helping others with disabilities. Not alot of teaching jobs here in the UP. Marquette General the hospital I use almost primarily has a wig salon that gives people who need a wig one free of charge along with hats, scarves and turbans. They have a liscensed beautician fit you and trim it perfectly. I love this program I used it 4 years ago and have made an appt. for Dec 8th to pick out a new wig. My old one landed in the burn barrel during a \"thank god its over\" celebration. I hope everyone had a full, satisfying and wonderful thanksgiving. How many are doing the Black friday thing? I am not going out until about 8 am but I will be hitting the local mall. lol which has all of 4 stores in it. and probably hit the walmart. not looking for anything special just why not get out while I feel up to it. blessings Sue",
      "MessageIndex": 61,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jun 3, 2009 08:28PM sdavis wrote: \"dont worry you'll be so thankful later you had this surgery, your going to love them.\" Said by a nurse, in the hospital when I complained of pain, turns out she thought I had a simple breast reduction, ummm yeah I guess, from a b cup to a nothing.",
      "MessageIndex": 18,
      "PostDate": "03/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735274",
      "Title": "100 things never to say to a woman who has had a mastectomy: iwannabefree jillyG"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 16, 2009 02:24PM sdavis wrote: Hi all , I know I havent posted lately. I log in most every day to read up but by the time I catch up I am too worn out to post. I just dont care most of the time. I get thru the day and then crash by 8 pm. cant even carry the laundry downstairs without resting. I use what energy I do have to work as my husband is in college and doesnt. My job isnt physical usually but there are days that I come home and feel like dying. today I only worked til noon but have to go in the office soon to check in with schedule for next week. dont even want to go outside again. its flipping cold here. -5 this morning and a windchill of -26 not too much better now still windchill below zero. oh well guess I am just tired again. until tomorrow. Sue",
      "MessageIndex": 1028,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Nov 26, 2008 06:38PM sdavis wrote: Hello all. I am about to turn 40 on the 6th of December and start chemo on the 9th. I have a son who is 5 and a black lab that is driving me nuts. lol I can answer a few of the questions as this is my second go around with bc. I was diagnosed in 2004 and had a radical mastectomy of the left breast and chemo x8 reconstruction in summer of 05 with saline implants on both sides ( I had the right side removed proactively). We found a new lump on the left in Oct of 08 and I have had it removed along with the implant on that side and a bunch more tissue. I will have 4 treatments of TC every 3 weeks. and Radiation after that. Ports are a great idea, they save your arm veins from being ruined and dont hurt much after the first few days. Have your nurse use a numbing cream or spray and you wont feel a thing. you may want to include a bland snack in your chemo bag. plain popcorn or crackers work best, lots of water. our chemo room supplies bottled water but I know not all do. In case no one told you yet you should not have fresh flowers due to the standing water and the possible exposure to fungi and bacteria. Unfortunately this includes real christmas trees. they are a no no this year. small exposure is okay for example at your in-laws house for a few hours but you dont want it in your house. All food should be cooked beyond bacteria range - mushy and dead.or peelable like bananas. no apples unless you take the outer inch of flesh off, no grapes or blueberries. No yogurt -active cultures- no bean sprouts. I can tell you that doing it for the second time is just as scary because every drug is different. For those of you doing AC/Taxol you will find that when they switch drugs you have different side effects. One thing that will remain constant is the need to pee as you need to drink as much fluids as possible. it helps flush the toxins out of your system. Okay sorry about going on and on, You can do this each of you are strong enough. As a friend said today this is just a bump in the road of life. Have a positive attitude and find something each day to laugh about even if its yourself. And your lucky enough to have found this site so you have the support of others so you can bitch when you feel down or celebrate when there is good news. I wish I had had this site four years ago but am so glad I found it this time around. anyway have a great thanksgiving and forget about the impending toxic injections for a few days. Sue",
      "MessageIndex": 51,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Nov 28, 2008 01:07PM sdavis wrote: Oh so true about the fish frys there are none other like them. I totally get the off ramp idea. We are all heading to the same place at almost the same time. My mom today bought me a new bra. I havent worn one in three years since I was reconstructed after the last time and since they took my implant out on the left I am a little flat on one side . So I need a bra to hold the gel one I have but dont need support or underwires. I asked the lady for a training bra in a large size. She thought I was nuts until I explained. They threw in a T-shirt that says \"Cancer Sucks!!!!\" I will have to wear it to the first dose. I asked if they had one that read \"I am going to kick cancers a**\" but they didnt. I may have one printed up. lol Hope everyone had a great Thanksgiving. Sue ",
      "MessageIndex": 69,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 3, 2008 12:06PM sdavis wrote: As to the hair growing back its different for everyone but most its about 6 weeks. post chemo. keep in mind that usually any that you have retained will fall out as the new stuff starts to grow so your a little splotchy for a week or two.",
      "MessageIndex": 161,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 13, 2008 07:00AM sdavis wrote: morning all, I didnt check in yesterday, my son had his program at school and that totally zapped my energy. I spent the rest of the day on the couch. Lazy me. lol I am enjoying it because I go back to work on Monday morning. I work in home health care.  I told my scheduler to shorten my days and no evenings so I get my schedule and she puts in six 9 hour days and 5 evenings including two late nights (after 10pm) I dont know what she was thinking. I have to change it all on monday, like I dont have enough to do with dealing with this now I have to do her job too. I have had a raging headache for three days now. Tylenol helps but wears off after a few hours. Constipation gone and soft stools in play. I know what you mean about eating very little. wanted a snack yesterday and had 3 animal crackers and was full. I can stand to loose a few pounds anyway so not too worried about that. Over all feeling fine today as long as I can keep tylenol handy for the headache. drink drink drink thats seems to be all I do. Sue",
      "MessageIndex": 353,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 14, 2008 07:42AM sdavis wrote: What??? no sex oh man. lol seriously I hadnt heard that one no sex on week two and I was feeling all sexy and randy this morning too. between the pooping or not pooping the hair falling out and the complete lethargy I amsure my husband would have loved to jump me.",
      "MessageIndex": 374,
      "PostDate": "14/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 21, 2008 02:21PM sdavis wrote: Bkokie -- I had a raging headache after my tx for a week. It was so bad when the tylenol wore off in the middle of the night I woke up to find more. By 10 days post tx I was feeling fine and have been okay since then. I worked last night until late and was due to work this morning but woke up with a bad case of Diarrhea and called off. Not sure if I caught a bug or what.",
      "MessageIndex": 555,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Dec 25, 2008 09:52AM sdavis wrote: good morning and merry christmas to all. I hope that everyone has a SE free day. I am feeling great this week and my appetite is back for now so enjoying the holiday as much as possible. My second TX was changed to Monday the 29th due to Doctor issues. Mine left the practice and the others cant fill in on the 30th. Gotta have a doctor in house before they will give Chemo. Go figure. I am off to my parents to have a wonderful dinner and exchange presents. Remember Bald is beautiful. sue",
      "MessageIndex": 634,
      "PostDate": "25/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jan 1, 2009 12:34PM sdavis wrote: happy new year to everyone and may this year be much better than the last. I am day 3 TX 2 and am just very weak and tired. Laying onthe couch with no ambition except to drink fluids and sleep. Tx 3 will be 1/19 and I will be half done. Husband went with me this time and was wonderful but he is back in school for the rest so I am on my own. Sue",
      "MessageIndex": 740,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Jun 17, 2009 01:43PM sdavis wrote: Texas -- go for it.  I am done with rads and saw my OB/GYN and have a hysterecomy planned for June 25th. My left chest area is still sore and tender but is healing slowly. Chemo effects I expect for the next few years so they arent worth mentioning. Life is going on and I am enjoying every moment, Hugs to all who need it Sue",
      "MessageIndex": 2476,
      "PostDate": "17/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "sdavis wrote: I really debated on where to post this. How do I tell my family I am looking at another reoccurance? My husband is finishing up school this May, we finally had gotten back into a routine. I have to say I hate cancer. I am going to wait for the test results before telling anyone. this would be round 3 and I dont know how anyone will take it. Problem is I have no one to worry with me. I told my husband the scans are routine checks. I dont need him worried when he should be focused on school and finding a job. 2x survivor, dx 8/04 stage 2 IDC, 2/14 nodes, ER+/PG+ Her- AC/Taxol x8 Dx 10/27/2008, IDC, <1cm, 0/0 nodes, ER+/PR+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750059",
      "Title": "How do I tell my family again sdavis jc3win"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Apr 1, 2010 08:38PM sdavis wrote: Great news. finally was able to get into doctor today to get results and She said they are \"fine\" nothing to be concerned about. I of course wanted to know why she had to see me to give me that news and wasnt able to pick up the phone four days ago. :) anyway I am doing great and life goes on. thanks for all the prayers.",
      "MessageIndex": 16,
      "PostDate": "01/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750059",
      "Title": "How do I tell my family again sdavis jc3win"
    },
    {
      "AuthorID": "sdavis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74886/profile",
      "Content": "Mar 25, 2010 12:09PM sdavis wrote: thanks for the thoughts all, I had a bone scan yesterday and have a ct of the chest tomorrow. I am a year out of chemo for the last reoccurance. they found a lump under my armpit. I talked to my pastor and told my husband the scans were routine. I dont want him worrying until I know there is a reason to. Keep on praying. I should have results Mon, or tues.",
      "MessageIndex": 11,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750059",
      "Title": "How do I tell my family again sdavis jc3win"
    }
  ]
}