{
  "AuthorID": "SecretlyDis…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
  "Posts": [
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 15, 2018 02:43AM SecretlyDistressed wrote: exbrnzgrl, I think you’re still doing well despite your DX, because you are a determined person! I know attitude plays a huge part in a person’s health. I hope you live a long a fruitful life! Hugs ",
      "MessageIndex": 21,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 17, 2018 07:31AM SecretlyDistressed wrote: Hi buttonsmachine! Sorry for the delayed response. My life is crazy right now. I have 4 dogs and a cat to curl up on the couch with. I know I will greatly appreciate them during chemo. I live in the country on a dirt road. No neighbors. I walk everyday now and plan to continue if I can. I do yoga everyday too am hoping to be able to keep up with that. We shall see. From what the dr told me I may very well not feel up to it. I will plan to go to the grocery store at times that aren’t busy as well. There is no option to delivering groceries since I live out in the boonies. Lol I have to drive 45 minutes just to get to the grocery store. Thank you for the encouraging words! I really appreciate it a lot! I hope today finds you feeling halfway decent. Many hugs to you! Hu",
      "MessageIndex": 27,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 17, 2018 07:39AM SecretlyDistressed wrote: VLH, it is A LOT to absorb. My life has drastically changed in the last 2 weeks. Just a week ago I had NO IDEA I would have to do chemo. Nobody told me until my appointment with the medical oncologist the serious nature of the cancer I have. I originally was told I’d probably get surgery and MAYBE radiation therapy. So when I was told I had to do chemo and it needed to start right away, I was thrown for a loop. And apparently it didn’t sink in for me, the aggressiveness of the triple negative tumor. I was wondering about the sleepiness too, since I’m already so sleepy all the time. I worry I’ll just be knocked out for the next 6 months. Lol I guess I will find out. Did you by any chance take Zyprexa for nausea? I guess I’m supposed to take it for the first 4 days after chemo. I’m worried about that because I know that’s a very sedating drug.",
      "MessageIndex": 28,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 15, 2018 02:59AM SecretlyDistressed wrote: WC3, it sounds like you, too, are a determined person. It’s nice to hear that other women have made it thru chemo. And I KNOW I’ll make it thru, it’s just that I DON’T want to! Lol! Oh well. Such is life. I’ve been thru hell and back several times in my life. I suppose I can do it again. I just really don’t want to. Lol Thanks for telling my about your experience. I really appreciate it a lot. 😊",
      "MessageIndex": 24,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 08:15AM SecretlyDistressed wrote: Thanks Denise-G! This is my first post on here. Lol I’m happy for the couple opinions I got. An online community will be pretty much the only human contact I will be getting because I was informed I will be immune compromised. I even have to take a leave from my job for that reason. So when I say all alone I mean all alone literally. I have gone thru extremely difficult times all alone in the past. Chemo, however, seems like it will be more than I can handle. On the other hand, maybe I’m just having too much of an emotional reaction to the situation",
      "MessageIndex": 4,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 09:45AM SecretlyDistressed wrote: Thanks SO much, YoungTurkNYC!!!! That information is helpful for sure! I have to finish filling out my DX profile. I’m stuck on a few of them tho. I haven’t had surgery yet so some of the questions don’t apply to me. I have to get my pathology report too to answer some of the more detailed questions. I have one tumor that’s ER+, one that’s PR+, one tumor that’s HER2 positive and one that’s triple negative. Of course it’s the triple negative that the dr is worried about the most. I appreciate your explanation because I was under the impression that chemo for me is more of a preventative measure. Also am so very sorry you were alone with young twins when you went thru chemo. I think you’re a much stronger woman than I am! And here you are! You did it! That’s totally amazing!",
      "MessageIndex": 10,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 09:48AM SecretlyDistressed wrote: Thanks for all the tips hapa! I’m sure they will come in handy! I’m glad to know you worked out while you were doing chemo. I was under the impression that chemo leaves you too weak to do things like that",
      "MessageIndex": 11,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 03:06PM SecretlyDistressed wrote: Exbrnxgrl thank you for your input. Maybe I’m in denial about the severity of the situation. Ultimately over the course of the day after doing a lot of online research, I have decided it likely is in my best interest to do chemo, much to my dismay. Lol I get a PET scan on Thursday, so we shall see if I have any mets. This is a new journey for me that I’m not familiar with. I’m sorry you’re stage 4. That’s pretty scary I’m sure. What does that mean for you? Are you terminal?",
      "MessageIndex": 15,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 15, 2018 02:50AM SecretlyDistressed wrote: VLH, I have 4 tumors. One is ER positive, one is PR positive, one is HER2 positive and the last one is triple negative. (Idk how I got so lucky to get FOUR different kinds of cancer!) Anyhoo, that’s where the Perjeta comes into play. It sure sounds like you’ve been they a lot! Fibromyalgia alone is challenging (I have it too), let alone adding chemo on top of it. You made it tho! Thank you for all of the info and tips! I appreciate it a lot! I will be going forward with chemo I’m sure. So that means a week from today I’ll get a port put in and a week from tomorrow I’d start chemo. It just seems it’s the best option for a triple negative diagnosis. ",
      "MessageIndex": 22,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 03:16PM SecretlyDistressed wrote: ksusan, I am getting strong chemo treatments, I know. I can’t remember the exact combinations of meds off hand, but the first round of chemo will be extremely strong. I will get it once every 2 weeks for 4 times. Then I will get another round of chemo weekly with a different drug combo. I believe my last treatment will be Feb. 22, 2019. I was told it will be an extremely challenging time for me. Due to the nature of my job, working with animals, I am having to take a 6 month leave of absense because of low immunity. I was told even if that wasn’t a factor, I would need assistance with lifting heavy items (which is most of my job) so I physically wouldn’t be able to work anyway. This information led me to a state of panic, pretty much. Why would I want to do all that to myself when they don’t REALLY know for sure if there’s any Mets. But since one of my tumors is triple negative, it seems like chemo is the only option to wipe it out systemwide.",
      "MessageIndex": 16,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 15, 2018 02:54AM SecretlyDistressed wrote: buttonsmachine, I have not started chemo yet....one week from tomorrow. 😳 I was wondering about going out in public. Especially in the winter when sickness seem to be everywhere. I will just plan on staying home I think. Thanks for the encouraging words! Hugs",
      "MessageIndex": 23,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 08:08AM SecretlyDistressed wrote: Thank you for your input! I do appreciate it. I just found out my DX 3 days ago and forgot to go back and put it in my profile. Thank you for remjnding me",
      "MessageIndex": 3,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "SecretlyDis…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281044/profile",
      "Content": "Oct 14, 2018 09:33AM SecretlyDistressed wrote: Thanks Octogirl ☺️ Hugs back to you",
      "MessageIndex": 9,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    }
  ]
}