{
  "AuthorID": "Seektruth",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289450/profile",
  "Posts": [{
    "AuthorID": "Seektruth",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289450/profile",
    "Content": "May 23, 2019 04:34PM - edited May 23, 2019 06:13PM by Seektruth Hi Tyrone, I was treated with Taxotere in 2013. I was never given an option to take another drug. If I was, I would have chosen Taxol. When I researched Taxotere in 2013, I couldn't find much information about it - or about the women who experienced permanent hair loss. I thought maybe it was a fluke. I feel very differently now. I was lucky on some level - my hair back grew back after Taxotere, but it isn't the same. It's very thin and wispy and I have much less hair than I had before. My doctor told me that it might have been caused by my hormone treatment, but I disagree. I went through chemo in 1993 and afterwards my hair grew back completely normal. After that, I was on hormone treatment for 10 years and never experienced any hair loss. The first time I noticed a difference in my hair was after treatment with Taxotere. I was lucky because I had a lot of hair to begin with and I believe that helped me. If it had been thinner to begin with, I think I would have bald spots right now. Also, they had to reduce the dose of Taxotere I received after my first treatment because my white blood cell count was so low. That might have also saved my hair. I feel terrible for the women who are bald and I believe 100% that it was caused by Taxotere. I don't want to scare you. I just want to urge you to do your research. Ask your doctor if and why he would prefer one drug over the other. Also, read the stories of the women who were affected. Go to the website \"A Head of Our Time\". In the end, you have to make the decision that's right for you, but I wish someone had warned me before I agreed to it. Good luck! I wish you well!",
    "MessageIndex": 5,
    "PostDate": "23/05/2019",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871680",
    "Title": "How do I choose a chemo plan?!?! TyroneShulaces77 Scrafgal"
  }]
}