{
  "AuthorID": "seeswim",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199126/profile",
  "Posts": [{
    "AuthorID": "seeswim",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199126/profile",
    "Content": "seeswim wrote: After having 6 different lumpectomies and extremely dense cystic breasts, plus 11 instances of breast cancer in the woman in 2 generations in my family (including my mother and sister) the decision was made to go ahead and have a Bilateral Mastectomy. My doctor thought it was time to stop taking chances. On Aug. 22, 2013 the surgery was performed with Naturelle implants put in place and 250cc fill. The initial surgery and reconstruction went off without a hitch. However 5 weeks after the surgery after 1- 50cc filling of the implants I developed cellulitis in the right breast. I was hospitalized for several days with IV antibiotics. The cellulitis cleared up and after being filled to 650cc's the doctor replaced my extenders for the implants end of November That is when the trouble began with the right side again. The incision would not heal and he had to remove the implant and again replace an extender in there to hold some shape. Two weeks after replacing the implant for the extender on Jan. 3 he removed the extender as well because the wound would not close and the extender was exposed. He removed the extender and everything healed just perfectly. Mid February we decided to take the risk of putting another extender in place since it had healed so nicely with no complications. Again I started having wound healing issues and this time my body was literally pushing the extender out from the incision. So of course once again the extender has been removed.  I currently have no extender in the place and was having some wound healing complications but they have cleared up. In the mean time the left side has had no complications what so ever. His current plan is to wait and leave it alone until roughly mid August and then try to do the DIEP method to correct the situation. I have done enough research on this to know that I am not comfortable with that procedure. I have now been out of work for over 8 months. I am extremely frustrated. I am curious if anyone else has had such an encounter with this and in particular with the Naturelle series implants. Any help at all would be appreciated. Please! This has just taken over my life and I want control of my own life again.     Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "14/04/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/820163",
    "Title": "Bilateral Mastectomy problems on one side after reconstruction. seeswim Moderators"
  }]
}