{
  "AuthorID": "segunda",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
  "Posts": [
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 31, 2013 03:06PM segunda wrote: Hi, girls. Quick question: anyone doing chemo? I am choosing between ACT (does dense) vs TC because I am triple negative and BRCA2+. I have also posted on those other discussion boards, but I know all of you have done a lot of research on cancer, too (plus, I love your posts!). I am just ruminating here. My oncologist prefers ACT, but it has the potential to damage the heart and has a very small risk of leukemia. TC has no risk of heart damage or blood cancer issues, but ACT has a slightly higher chance of reducing my risk of second breast cancer than TC does. I am leaning toward TC (but I think that this is also because the SEs of TC are reportedly less than ACT's, but then that is mainly anecdotal). Would love to know what you guys think of these benefit/risk choices or if you have encountered them yourselves. Cheers to us all on our recovery. I am doing very well with the surgery issues. Feeling quite normal, actually, now that I am wearing NO BRA! My best to all!",
      "MessageIndex": 653,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Sep 23, 2013 04:22PM segunda wrote: I had my surgery sept 18 bilat mx one-step with alloderm breast reconstruction (positive brca2, sentinel nodes clear). best to everyone!",
      "MessageIndex": 263,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 18, 2013 08:04PM segunda wrote: wow! So happy for you, summergal! Great news. All best, everyone! I am feeling good at my fourth week. I am resigned to chemo--it is a blasted way to extend my life--but I am glad to extend it. Lovely fall days. I decided to recover where my boyfriend lives here in western Massachusetts. Will be doing chemo here also. Because support is vital, plus I hate my cooking!!",
      "MessageIndex": 567,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 2, 2013 09:17AM segunda wrote: Dear all, I have been reading posts off and on as I get off and on the pain meds: you are all so brave and beautiful: hang in there. All of your stories help me to imagine and bear my own. So sorry to hear about complications, vivian and schoolcounselor and now jo6202's pain. Please know we are all with you. I got off pain meds by day 8 because otherwise I cannot read, and that was more horrifying than the pain, maybe. Pain is subsiding at day 13. I was just told have to get chemo, though my cancer is small and all scraped off (barely 1cm), only on my right breast with left breast all clear and lymph nodes clear too--this is because I am triple negative with the hormone receptors, thus had a high-risk tumor. I expected chemo though because I am positive for the genetic mutation brca2 anyway. Will likely just take more time off from my job. Some things that helped during recovery, for cjc and others who will have surgery: a huge body pillow (called leachco body pillow), the red heart pillows called axilla pilla, and pliable straws (so I could take in fluid easily). There is a book called Now What: Recovery after Mastectomy that I read before the surgery and it was helpful: it also has exercises (very easy) that I am doing right now, very weakly, but good to do something. I have numbness and a kind of lump (nurse said it was normal) where the sentinel lymph node biopsy was done on the right, and the exercise helps.  Again, all my best, LOVE to all.",
      "MessageIndex": 370,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 24, 2013 10:39AM segunda wrote: schoolcounselor, so SORRY to hear about your dad. My best to you and your family. I am really sorry. Hope all goes well with your doctor's visit. I had my surgery in the Westchester area, too. Great doctors.",
      "MessageIndex": 619,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 31, 2013 06:52PM segunda wrote: Vivian, I just want to say I just read your post, and wow what a lot to go through after everything. You are amazing for hanging in there—I do hope the drain is enough and you have that great Halloween with your daughter! All my best!",
      "MessageIndex": 656,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 13, 2013 11:37PM segunda wrote: thanks so much for everyone's posts. Am so glad about the good diagnoses for Bella and others. I wanted to thank Schoolcounselor for her explanations about her chemo. They help me as we have very similar dx though I have the added complication of brca2 genetic mutation. I had a mammaprint, not an oncotype dx (are they the same thing?). The conclusion is high risk basal type with triple negative hormone receptivity. Chemo is definitely in order say bs and mo. Had a great visit with very nice mo (my first lady doctor). Two options: dose dense ac + taxol 16 weeks or tc for 12 weeks. She's still figuring out which. Any comments on those options? As for bras, my ps gave me a compression bra, American Sports Bra, that really hurts but he wants me to keep it in 23 hours a day for at least 4 weeks. I am used to its weird pain now. I air my breasts for an hour a day which is very funny for the household. All my best to everyone. This is an awesome group. Best of luck, Denise, to you and your child at the wedding!",
      "MessageIndex": 526,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 14, 2013 09:26AM segunda wrote: I teach high school and my BS has advised not working during chemo. Something about infections from kids, fatigue and such. The next step, chemo, is still hazy to me. I still don't know what my chemo treatment will be, and I am avoiding what chemo might mean to me while I am recovering from surgery. I am concentrating on recovering from dmx and recon (the one-step surgery). My school allows me time off, and like me they are just waiting for news from my MO, before I make my decision.",
      "MessageIndex": 28,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811093",
      "Title": "Working while going thru treatment Yogagal segunda"
    },
    {
      "AuthorID": "segunda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186914/profile",
      "Content": "Oct 24, 2013 12:53PM segunda wrote: TeamKim and batcatlady, thanks for your descriptions of your treatment. Helps us a lot who are waiting for it. batcatlady, I am so sorry to hear about your SEs, and I think you did the right thing to heal rather than push on and work. My BS advised me not to work after bmx, so I took time off for surgery. You have great students, TeamKim! Wow. I started the year not teaching, because all dx happened in August, so I do not know my students anyway. I am mulling taking the school year off, as that will be least disruptive for my school and for me. But it is all up to me what I wish to do. I definitely will take time off during chemo, because I am doing it where I can be supported (at my partner's house in another state) rather than being by myself in my apt. So that means returning to school in March, a very iffy time to return to classes as I will not know the kids. A reasonable choice for me then is to take time off, given the school's needs and my own. Less money (40% less) but time to heal carefully and deal with potential side effects.",
      "MessageIndex": 32,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811093",
      "Title": "Working while going thru treatment Yogagal segunda"
    }
  ]
}