{
  "AuthorID": "Septmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
  "Posts": [
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Nov 22, 2013 01:11PM Septmom wrote: I just saw the update on Amy Robach's diagnosis. She says that a secondary malignant tumor was found during her mastecomy surgery that wasn't seen on the mammogram, MRI or ultrasound. I thought an MRI would pick it up. I just had a lumpectomy and started chemo Nov 14. I had an Mammogram and ultrasound right before my lumpectomy which just showed the one tumor on the right breast and that there was nothing on the left side. This makes me wonder if I have something on the left side that wasn't detected my an MRI. Makes me nervous if MRI's can't be trusted. Any thoughts ladies?",
      "MessageIndex": 19,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 1, 2014 04:36PM Septmom wrote: JoJo, Your hair looks amazing! Thanks so much for sharing! I am week 8 of taxol and I keep looking for fuzz. I may be seeing a little.  Maybe I am just fishing to see it. But feel so discouraged. Your post gives me hope. I love your hairstyle! I have always had real long hair all my life. I could totally wear my hair in your hairstyle. Will take me a while. I don't finish taxol until April 4th. Did you use biotin? ",
      "MessageIndex": 20045,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 31, 2014 01:01PM Septmom wrote: Thanks Lago.  I was looking at Target's Nature Made 2500mcg. If it's safe to take 5mg I would rather do that.  I have 2 more taxols left and so want me hair to start growing :)",
      "MessageIndex": 20206,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 3, 2014 03:14PM Septmom wrote:  Here is my hair fuzz growth - I took this a few days ago. I have more growth on the sides compared to the back. I do see more growth every week. I noticed fuzz growth around 3 wks ago. It's more grey than I thought it would be. I ordered 5mg biotin today. I will start taking it soon. I have taxol #11 tomorrow. Hope to finish on time. Good luck ladies!",
      "MessageIndex": 20230,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 12, 2014 08:48AM Septmom wrote:  I finished taxol yesterday (12 weekly doses) This is my hair fuzz growth at the end of my taxol. Hope that it starts growing faster now that I am done with taxol and I will now start taking Biotin. ",
      "MessageIndex": 20241,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Jan 16, 2014 02:01PM Septmom wrote: Warrior70 - it's so great to keep hearing your fuzz updates! I am sure it's more like regular hair instead of just fuzz now. It's very encouraging for those of us just starting taxol. Congratulations on finishing #10 today! Two more too! I will have #2 tomorrow. My countdown has begun - stills seems like a long way to go but I sometimes can see the light at the end of this tunnel. I am hoping my hair fuzz starts growing soon. ",
      "MessageIndex": 19900,
      "PostDate": "16/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 1, 2014 08:25PM Septmom wrote: Thanks Jojo! I sure hope my hair grows nicely as yours. I am sure mine will come out grey too. Before BC my hair used to grow quite fast. Let's see how it grows after chemo. But your hair photo really gives me hope. Thanks!",
      "MessageIndex": 20049,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 25, 2014 08:08AM Septmom wrote: I started seeing some hair fuzz growth about 2 weeks ago during my weekly taxol ( around week 7-8). It appears to be growing every week but it's not growing evenly. There are areas where there's not much growth. Just wondering if it will fill in or is this hair fuzz growth just temporary and it will fall out.  I was so happy to see more growth this week but the unevenness of the hair makes me nervous. My Onc does not want me to take biotin or anything for hair growth until I am done with taxol. I have 3 more to go.  Thanks!",
      "MessageIndex": 20192,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 2, 2014 01:38PM Septmom wrote: JoJo is there a particular brand of mini flat iron that you used? I am no where near needing a mini flat iron yet as I just have fuzz growth. It is half an inch in some areas. I really hope my hair eventually comes back to it's original texture. I had really long straight hair before that was so easy to manage. I hardly ever used a blow dryer and would just air dry it. I don't even own a flat iron. Now I will have to learn to use hair gadgets and hair products  JoJo your hair looks amazing! ",
      "MessageIndex": 20227,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 28, 2014 01:35PM Septmom wrote: Hello - just wondering if anyone has lost just a quarter of their hair?? Amy Robach finished chemo a fews days ago. I read online that she said she was one the lucky ones that only lost a quarter of their hair. Just wondering if that was even possible. I  bet she used cold caps. If she did, she should say she used cold caps. I feel she may be misleading or misinforming people. ",
      "MessageIndex": 20249,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 2, 2014 12:58PM Septmom wrote: Thanks ladies for all the words of encouragement. I hope to pay it forward and help others when I am through all this.  Thanks again for giving us hope.",
      "MessageIndex": 20060,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 20, 2014 08:04PM Septmom wrote: PamelaC47, That's great that your eyebrows and eyelashes grew back 6 wks after you stopped chemo. I hope mine grows back as fast.  I will start taking biotin after I stop finish chemo. My ONC does not want me to start right now. I have a few weeks left.  Thanks again!",
      "MessageIndex": 20168,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 27, 2014 10:58AM Septmom wrote: Carol,  I too think she is using cold caps. There is nothing wrong with it. Good for her. But she had a lot of publicity after her diagnosis. She did the big people magazine cover and article. Then why not just say that she is using cold caps? Saying that her MO told her that she may loose some of her hair is misleading. I know that sometimes with CMF chemo protocol you don't loose all your hair. But that is an older less aggressive regimen. She had at least one positive lymph node. I doubt she is doing CMF. Also her working through treatment is not like us regular folk working through treatment. Celebrities don't paint a true picture. ",
      "MessageIndex": 20199,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 31, 2014 02:48PM Septmom wrote: Lisaj514 - thanks for the info. I know a lot of ladies were given the okay by their ONC to start biotin while on chemo. I think I will order a bottle of biotin and start taking it next week. I do have some hair fuzz growth that started about a few weeks ago. Do you take 5mg dose too? ",
      "MessageIndex": 20208,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 3, 2014 07:18PM Septmom wrote: Thanks Lago - I hope I have enough hair growth in 12 weeks to get it colored. I am hoping the biotin I will start taking soon will help. Also I am hoping that the hair growth will be faster once I stop taxol. ",
      "MessageIndex": 20232,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Apr 3, 2014 09:21PM Septmom wrote: Thanks Warrior70! I have bent thinking of you. I bet your hair looks great!. Hope your fatigue is less now that radiation is over. My WBC are on the lower side this week. But not low enough for shots. I didn't get neupogen this week or last. I have a feeling I will need shots next week for the last week. I am praying I stay on track and get done next week. ",
      "MessageIndex": 20234,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 1, 2014 08:07PM Septmom wrote: Thanks Jojo for giving us encouragement. What dose biotin do you take? I plan on starting as soon as I finish with chemo. Thanks!",
      "MessageIndex": 20047,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 2, 2014 07:41AM Septmom wrote: Thanks Timbek2  for all posting your hair pics! Your hair looks lovely! I too want my active mom life back. So happy to know that I can eventually get my energy back and have somewhat of a normal life after all this. Right now I feel like an old woman and I am still fairly a young 44 year old who loves to work out and be a very involved mom . I have had to cut down on my sons activities . It breaks my heart. Hope next year is better. Thanks for all the encouragementt!",
      "MessageIndex": 20052,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 27, 2014 09:02AM Septmom wrote: Thanks Pamela, I guess it will fill in. Just have to be patient. Now that I am almost done with taxol, I have started obsessing over my hair growth.   Also I was GMA and how is it that Amy Robache still has hair? She cut her hair prior to starting chemo and she has the same hair. I am pretty sure it's not a wig. She said her oncologist told her that she would likely loose some hair. So what kind of chemo do you think she's on if she's only lost some of it. Supposedly she is having 8 rounds. Some stories say 6 rounds. I wonder if she is using cold caps and not telling people. ",
      "MessageIndex": 20197,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 20, 2014 10:30AM Septmom wrote: Hello Ladies, Just wondering typically how long after chemo do the eyelashes, and eyebrows grow back?  I know everyone is different but just wondering how long it typically takes. I have some hair fuzz growth on my head that I noticed 2 wks ago. I am currently week 9 of weekly taxol. I have lost almost all of my eyelashes and eyebrows. I see a faint 5 o'clock shadow where my eyebrows used to be. I use the Anastasia brow products to fill in my eyebrows. I use eyeliner for my eyes. But I hate not having eyebrows and eyelashes.  Also do any of you use Nioxin shampoo?  Thanks!",
      "MessageIndex": 20165,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 26, 2014 08:33AM Septmom wrote: Thanks Anne,  It's hard not to focus on hair. I have about 1/2 inch hair growth in some areas. Guess it will take time to fill in. Since my hair used to grow really fast I was expecting it to grow quicker. Silly me! It will take a long time I guess. I used to have really long hair. ",
      "MessageIndex": 20195,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 27, 2014 06:26PM Septmom wrote: Thanks Carol for posting your hair growth photos. Your looks so nice! Do you have naturally wavy hair? I am pretty sure that Amy Robache is using cold caps. Why not just say it instead of misleading the general public. I am not much older than her and had very thick long hair. I lost my hair, it didn't just thin out.  Oh well. She doesn't have to reveal anything. But then don't do a cover story on people magazine about yourself in the first place. ",
      "MessageIndex": 20202,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Mar 30, 2014 04:43PM Septmom wrote: Hello Ladies, What dose biotin did you ladies take for hair growth? I plan on taking it after I finish my last two taxols? Which brand is good?  Thanks! Septmom",
      "MessageIndex": 20204,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "May 5, 2014 08:04PM Septmom wrote: I have a question about hair color, I am no where near the stage where I can get my hair colored. It will be 4 was this Friday since I finished chemo. I was wondering if there is a brand of hair color that is safer and/or less toxic than others. I read that Para-Phenylenediamine (PPD) and other petroleum products are used in permanent hair color and that is supposed to be bad for you. I read that it's impossible to avoid PPD if you are using permanent hair color but certain brands have lower levels than others. I used to get my hair colored at a salon regularly. I would get my roots done every 4 wks. But at 4 wks my roots looked real bad. My hair used to grow very fast. I would get highlights done a few times a year. I loved getting my hair done. I know my salon uses redken hair color. Any idea if that has a high level of PPD or not? I tried to search online and couldn't find anything. I did find a hair color that advertises no paraben, no ammonia, and low levels of PPD called herbatint. Amazon sells it. I really don't want to color my hair at home. But if I am using paraben and phthalate free lotions and cosmetics then I need to make sure I use safer hair color too. Does anyone know of a 'safer' hair color ??  Thanks!",
      "MessageIndex": 20267,
      "PostDate": "05/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Septmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/191533/profile",
      "Content": "Jan 1, 2014 07:47PM Septmom wrote: I have no family history of BC. I did 4 rounds of IVF after doing several rounds of IUI before conceiving my son who is 9 years old now. I have wondered about the link of fertility drugs and BC.  Interesting thread.",
      "MessageIndex": 16,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787140",
      "Title": "Fertility drug connection??? number5 NicolaSue"
    }
  ]
}