{
  "AuthorID": "Seraphima",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
  "Posts": [
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 1, 2016 11:47PM Seraphima wrote: I almost feel bad talking about any issues since I just had a lumpectomy and not a mastectomy. And I feel like if I comment on the shape I was left with, it might offend someone else who had a lumpectomy. I don't know how similar we all might be, or not. But I am still shocked when I see myself in the mirror. I'm almost 3 weeks from my first surgery. The second one he took more tissue, and what was a rectangular breast (no more nipple since I had Paget's) is now a rectangle with a bite taken out of it, lopsided and rather pointed at the outer corner. Puckered, bruised, two different sets of stitches meeting up. Bleeding here and there. It looks awful. I had kept myself covered and never let my husband see me after the first surgery. After the second, the nurse told me to get dressed and left me alone with him, so he had to help a little and saw it. He was shocked. The only word I remember was \"deformed\". I can't bring myself to be undressed in front of him. Ah ... I thought it bothered me just a tiny bit, but to be honest, it's bringing tears to my eyes to write this. I guess it's good to get in touch with feelings. I couldn't imagine being in a gym or anywhere where anyone might see me, outside of the medical setting. I hadn't thought I'd want any surgery to repair anything, but I don't know. I really doubt I'd be covered for it. And with pain and limitation and risks that come with surgery, it's probably not wise. I guess I have to find a way to feel better about it.",
      "MessageIndex": 9,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 2, 2016 07:33PM Seraphima wrote: Thank you, Meow. I might do that. I am sure it can be much improved. I guess I'm still working through how I feel about it and I'll have to consider risks of surgery. I had never had any surgery before, so at least I'm not so terrified of just not waking up anymore. Though I'm still thinking about pain I have (which is also better) and wondering about any increased risk of lymphedema. I guess there's a lot to weigh into the decision. But I hadn't considered it at all before. I will give myself some time (must get through rads first anyway), and think about it.  Thank you.",
      "MessageIndex": 17,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 3, 2016 09:52AM - edited Sep 3, 2016 09:53AM by Seraphima Thanks, Doxie. I can understand not wanting a constant reminder. It still shocks me every time I see myself in the mirror, and I wasn't sure yet how that reaction will change after time.  I think, really, I am too newly out of surgery for me to be evaluating myself in terms of \"body image after surgery\". My stitches are still in. So I don't think my opinion has much value in the question yet, but I do appreciate the responses to me here and the opportunity to work through it a bit and make some plans for dealing with it more later.  I hope I haven't hijacked the thread. Thank you all.",
      "MessageIndex": 20,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 2, 2016 01:08AM Seraphima wrote: Actually, I thought about what I said here, not knowing if we all look the same after a lumpectomy. So I went searching for images. I've looked and looked, and I'm starting to wonder if what I received WAS a lumpectomy. My surgery was nothing like any of the images I found. I also read a lumpectomy is typically 3-4 cm. I haven't measured my incision (skin curves in and out anyway) but I think it's around 7\". But they left tissue - I have a flap of breast. So it's not a mastectomy. I can't find any photo that looks like mine.",
      "MessageIndex": 10,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 2, 2016 03:22PM - edited Sep 2, 2016 03:23PM by Seraphima Thanks for the info.  I looked it up again online, and yes, it's a partial mastectomy that shows a few images somewhat like mine. I still feel more deformed-looking than those images, but maybe it won't be so bad once the incision heals. Scars don't bother me so much. The shape ..... Ah that is going to take some getting used to. Yes, it's kind of like a Mesa-breast, except now with a BIG bite taken out of the middle that leaves two points on each side, with the outer one especially noticeable. I am afraid I'm going to look like I have one normal breast and two small misshapen ones fused together. I am not sure I'll ever undress in the gym.  My husband is more understanding since the second surgery. He never has been very compassionate about such things before. Maybe it will help him too. I'm sure this pretty much shocked him like it all did me. Maybe more so. I've had a suspicion for a long time it could be cancerous, and I never wanted to tell him. So it was maybe less of a shock to me. His mother is also very sick right now and he's worried about losing her too, though they are not close.  I don't know about to coding. EVERYTHING says lumpectomy, and I never knew there was anything other than total mastectomy and \"whatever-I-had\". I'm not sure in the end if I would opt for any reconstruction. I guess we will wait and see how everything else goes and give me time to adjust.  But for now, no one sees me naked except the medical staff. :/  Thanks so much for the replies!",
      "MessageIndex": 14,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 2, 2016 03:25PM Seraphima wrote: Maybe ... I will just tell people it was almost bitten off by a shark. Or a bear. Or heck, I think I'll go with dragon! ;)",
      "MessageIndex": 15,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 3, 2016 03:57PM Seraphima wrote: Thank you, Doxie. :)",
      "MessageIndex": 22,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846937",
      "Title": "Body Image after surgery Blueorange Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 7, 2016 12:19PM Seraphima wrote: Thanks, Wren.  I hope cancer doesn't turn me into a hypochondriac. I just started feeling like myself mentally/emotionally a few days ago, and I felt better in my incision finally yesterday. Then last night I found that suddenly raised mole, and also bent WAY over deeply for the first time I guess, and got so dizzy I almost fell. Woke up today kind of dizzy and feeling \"not right\". It may be in the past I felt slightly dizzy in passing and just brushed it off and have forgotten. Probably a number of times. But NOW everything is kind of scary. And my lymph nodes were clear. So just days after surgery I don't think I should have any really increased worries. But my fear is not listening to logic. I was less afraid when I knew I had breast cancer and was just approaching treatment - or maybe my fear was deflected to the anesthesia. I've been through a lot of stuff in life, and I'm not used to being made afraid. I don't like this feelng.",
      "MessageIndex": 2,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847796",
      "Title": "Found something that concerns me Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 7, 2016 01:54PM Seraphima wrote: Well, just hearing that it is normal and common helps. Thank you, Wren.  Sometimes in life we have to adjust to a \"new normal\". That may be the case. In a sense, I am also thankful. I've lived 50 years in life, and never saw it as quite so precious as I do now. I tend to procrastinate anyway, and I could just as easily procrastinate living as things I wasn't especially looking forward to.  Trying to find the \"good things\" in this and minimize the bad ones ...  Thanks again.",
      "MessageIndex": 4,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847796",
      "Title": "Found something that concerns me Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Seraphima wrote: I was just diagnosed with BC a few months ago, but possibly had it for years (Paget's easily confused in my case with a benign condition, but I've had an eroded nipple since about 4 years ago). My surgeries were in August. My SNB was clear. First surgery left questionable margins, second was clear. Tonight I discovered changes in a mole on the skin of my shoulder. I'm pretty sure it's VERY recent. The skin is suddenly raised, it has a scab-like appearance, with a whitish border and slightly irregular shape. My oncologist wanted me to see a dermatologist to get two other questionable moles removed anyway. But they have been unchanged and I've had them for decades. So far attempts to schedule a dermatologist have not worked - they aren't taking new patients or they don't accept Medicaid (which I'm on temporarily just because of the cancer, my previous plan wouldn't have covered enough for treatment). He actually wanted me to see a number of doctors, and I've gotten most things scheduled, but with surgeries and all, I'm still looking for a primary and a dermatologist. I don't have a question really. I kind of want someone to tell me this can't be because I just had surgery. Heck, I want someone to tell me this is benign, but I know no one herecan do that. I'm planning to call the oncologist in the morning and let him know. My next appt with him is in almost 2 weeks. I should start rads before then, as far as the plan goes. And I guess I'll do what I can to find a dermatologist that will take me. The one the oncologist recommended isn't accepting new patients. Maybe I just want to hear a calm perspective in all of this. It's still too new. Dx 6/24/2016, DCIS/Paget's, Right, 4cm, Stage 0, Grade 2, 0/2 nodes, ER-/PR-, HER2- Surgery 8/8/2016 Lymph node removal: Sentinel; Mastectomy: Right Surgery 8/23/2016 Mastectomy: Right Radiation Therapy 9/15/2016 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847796",
      "Title": "Found something that concerns me Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Aug 26, 2016 04:27PM Seraphima wrote: Thanks, I'm starting to think it's just normal for me after general anesthesia?",
      "MessageIndex": 8,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Aug 30, 2016 06:06AM Seraphima wrote: That may be it too. My appetite seems to be steadily decreasing. In the beginning I made sure to eat, but I haven't done as well the past couple of days. But too, the shakiness is not as bad. Still, during that period I know I wasn't doing as I should have. I was more careful to eat after the first surgery. I have steadily decreased eating, and now I'm eating only once or twice a day. And for the past two days I have not drank enough water either. I think in the beginning, I did everything as well as I could, and now I'm just getting tired of dealing with it, so that I seem to be slipping on everything. I'm sure that's not the thing to do though. I am not recovering very well from my second surgery, so I need to go back to eating, drinking water, taking vitamins, and all that. I guess I need to find the motivation to do that. I just want to be done with this and back to normal. I am sure everyone else feels that way at some point in time. Just gotta make myself do better, I suppose. Thank you for the reply.",
      "MessageIndex": 10,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Aug 25, 2016 11:08PM Seraphima wrote: No, I'm 2 days post-OP. And I noticed it after the first surgery too.  Thank you for the reply. Maybe blood sugar issues. Not sure. But this is not normal for me.",
      "MessageIndex": 2,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Aug 25, 2016 11:50PM Seraphima wrote: I will ask the surgeon, but they have not been the most responsive. Unfortunately there is no one that can be here. I wish there was.  I think most likely it needs time and maybe more steady nourishment. I do have applesauce, pudding, almonds, cheese,etc. that I can get easily. I did not do such a good job today, mostly just slept.  Second surgery in two weeks, and I tend not to do well with pain meds or local anesthesia. This was my fist experience with a general. I'm not taking anything except tramadol - a few doses over several days after the first surgery, and just two doses now after this one .  I will ask them. But I guess I wanted to know if anyone else experienced this. Thank you for replies. Hopefully it will get better. :)",
      "MessageIndex": 6,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 2, 2016 02:03AM Seraphima wrote: thank you.  I am thinking it has to do with getting over surgery and eating. I'm 9 days past the second surgery now. I haven't had it in a couple of days, but noticed it again today. I also finally had an appetite today, and even though I haven't been hungry until now I still have had a craving for beef, which I almost never eat. Iron and protein, that may be it. I'll make it to the store tomorrow - I see the surgeon and the radiation oncologist. And I really need to start taking my vitamins again, I think. For some reason I've just been having trouble motivating myself to do the things I know I should do after this second surgery.  Thank you again.",
      "MessageIndex": 12,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Seraphima wrote: just wondering, is this a normal side effect of surgery? It comes and goes. It's not so bad that I can see trembling really, hardly ever. More a feeling of weakness especially in arms and hands, but whole body sometimes. I'm trying to eat a couple of times a day at least, and I keep water nearby. Been sleeping a bit more after this second surgery - probably 12-14 hours a day. I don't have fever or anything. No one here to help during the day and I don't feel up to driving. I took a tramadol today but that's the first pain med I've had since last surgery. Seems more painful this time. Doesn't feel like an emergency. Just wondering? Thank you all. Dx 6/24/2016, DCIS/Paget's, Right, 4cm, Stage 0, Grade 2, 0/2 nodes, ER-/PR-, HER2- Surgery 8/8/2016 Lymph node removal: Sentinel; Mastectomy: Right Surgery 8/23/2016 Mastectomy: Right Radiation Therapy 9/15/2016 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847364",
      "Title": "Shakiness after surgery? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Seraphima wrote: Hello all, Just wondering if anyone else had a reaction to the CT scan? It's almost depressing, I had JUST started feeling somewhat normal physically (except for ongoing pain in my arm, maybe cording). But I felt pretty good when I went in for my appointment. Some hours later, I developed a high fever. My breast turned deep red. I later saw a patch of deep red on my back. I had a migraine. I was nauseated. My breast swelled and started draining a little. I had gastrointestinal symptoms. The fever went down a little after 24 hours, but everything else is still going on. I called my surgeon's office, thinking it was an infection. Not very happy that the on-call doctor never bothered to return my call. I found a study online that I couldn't read but skimmed over, some images noted that symptoms typically begin resolving at 96 hours - so I wonder if that means I have another day and a half of this. I've never heard it mentioned. Just wonder if anyone else experienced? Dx 6/24/2016, DCIS/Paget's, Right, 4cm, Stage 0, Grade 2, 0/2 nodes, ER-/PR-, HER2- Surgery 8/8/2016 Lymph node removal: Sentinel; Mastectomy: Right Surgery 8/23/2016 Mastectomy: Right Radiation Therapy 9/15/2016 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847992",
      "Title": "Anyone have a reaction to CT scan? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 26, 2016 09:06PM Seraphima wrote: I would answer if I knew, but I don't. People may not really be reading this one? I'm sure your RO could tell you, or probably the tech or nurse. You might ask in a new thread, or post in one of the more active ongoing RADs threads?",
      "MessageIndex": 5,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847992",
      "Title": "Anyone have a reaction to CT scan? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 27, 2016 12:06AM Seraphima wrote: Thanks, Keepingitreal.  No, they are totally mystified. No idea what the cause could be. Pretty much every step of this process has involved something rare, some small chance of occurrence, or something they can't explain.  I am having minor skin issues, and my RO says it's too early to be the rads (I had 6/30 today). But it's helping to remind me to take care of my skin so I'm hoping it will lessen effects later on. I still have skin peeling on my breast and the area of my back that was affected. A little redness and itchiness. Nothing else I can identify as being part of that. I have some fatigue that comes and goes, small headaches that also come and go, rare minor nausea, and some joint pain and stiffness that is probably unrelated to cancer treatment, unless it's just decreased activity. But I'm doing pretty well, much better than the surgery recovery period. I had shingles once before during a period of major stress - much worse than the stress of the cancer diagnosis and treatment - my husband was (mis)diagnosed as having a brain tumor and I was told he had only a short time to live - we were not much beyond being newlyweds - he was in hospital far away, I was in a city he had been transferred to away from my family and friends, he lost his income, and my job laid me off. I don't know if shingles presents in different ways. Mine was many smaller lesions, each one producing a stabbing pain every few moments. This was more like a burn that covered an area a little larger than my breast in front, and wrapping around to an area slightly smaller on my back, with pain consistent with a burn - itchy and blistered skin that peeled. Anyway. I think I'm just weird. I've seen doctors look puzzled and eyebrows go up quite a few times during this process. I'm just glad it hasn't been over anything really scary like the general anesthesia.",
      "MessageIndex": 7,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847992",
      "Title": "Anyone have a reaction to CT scan? Seraphima Seraphima"
    },
    {
      "AuthorID": "Seraphima",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237921/profile",
      "Content": "Sep 12, 2016 06:44PM - edited Sep 12, 2016 06:54PM by Seraphima Saw the surgeon today. He seemed a little puzzled too. Red, inflamed breast and fever - infection of surgery site. So I asked why I had a large red patch on my back too, and he said he didn't know. And that it was too long post-OP to be reacting to any of that.  I did find a study published here: http://www.ncbi.nlm.nih.gov/pmc/articles/PMC287591...!po=46.0000 that talks about reaction to CT scan with contrast as opposed to without contrast. But only 1 person (in almost 300) without contrast had a skn reaction, and as far as I can tell, no one had as dramatic a reaction as I did. If that's even what it is. And my daughter also correctly pointed out to me that a single study is not much to go on. Thankfully, my headache is much better, just a little one now. Nausea settling down. Still dizzy, still red, still heat from red areas. But I have learned that severe headache and nausea are the symptoms I hate most, so by comparison I am feeling MUCH better. I don't know if I'll know what it is. I think I'll be careful of any CT Scan in future. And I'll ask if they used any contrast. I don't thnk they did anything at all, no IV, and I didn't drink anything, but the surgeon seems to think they would have. This may be pointless info, but in case anyone is ever searching for it. That one article is the only thing I turned up involving no contrast. Doctor gave me 10-day course of antibiotics. I'm taking them in case it IS an infection, and even if it isn't, the skin appears to be blistering, so if I end up with a bunch of open sores, at least it might help prevent infection. It may be irrational, but this is making me pretty afraid to begin rads. The last three days have been awful. If I had something like that or worse for six weeks, I'm not sure I could handle it. Cancer isn't for sissies. And I'm starting to feel like one.  Thanks for the replies.",
      "MessageIndex": 3,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/847992",
      "Title": "Anyone have a reaction to CT scan? Seraphima Seraphima"
    }
  ]
}