{
  "AuthorID": "serenity4al…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
  "Posts": [
    {
      "AuthorID": "serenity4al…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
      "Content": "Sep 25, 2012 04:02PM serenity4all wrote: Hi Kita, I am sending your way love, hugs and positive thoughts. Remember you're never alone in this, and also, enjoy life whenever you can, as often as you can, to the fullest.",
      "MessageIndex": 30,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793997",
      "Title": "tumors showing, chemo not working, turning 25 kita barsco1963"
    },
    {
      "AuthorID": "serenity4al…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
      "Content": "Sep 23, 2012 09:06PM serenity4all wrote: Sorry about your son. You're going through very tough times, but remember, you're not alone. May Strength and Peace be with you ! ",
      "MessageIndex": 3,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793953",
      "Title": "Lump in armpit...strong family history missy21 Rocket"
    },
    {
      "AuthorID": "serenity4al…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
      "Content": "Sep 23, 2012 08:32PM - edited Sep 23, 2012 08:33PM by serenity4all Hello missy21, First of all, the word you're looking for is probably \"discomfort\". Secondly, there does not seem to be anything typical, when it comes to differentiating between cancer and benign tumors, based on external characteristics. However, if the lump is really in your armpit, and not your breast, chances are, it is either a lymph node ( adenopathy), a cyst, or a lipoma. The last two are benign, but a possible enlarged lymph node deserves investigation. If you cannot speed up your appointment with the breast center, maybe you can see a regular, general physician in the mean time, so a likely diagnosis could be made, based at least on physical exam. Make sure to follow any changes ( in size, mobility, sensitivity, etc) in the lump by regularly inspecting it, so you can report to your doctors, since this may be helpful clues for diagnosis. It sounds you have been followed quite adequately , so far, preventively, by the breast center. That's reassuring in itself. Let's take one day at a time for now. I wish you the best.",
      "MessageIndex": 1,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/793953",
      "Title": "Lump in armpit...strong family history missy21 Rocket"
    },
    {
      "AuthorID": "serenity4al…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
      "Content": "Sep 23, 2012 09:18PM serenity4all wrote: Hi Dawn, I feel for you, and after all the advice posted so far, I have little to add, except maybe mindfulness meditation that helps to deal with anxious thoughts, distressing emotions, and has been shown to make some positive impact on physical health as well. All the best.",
      "MessageIndex": 9,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/793935",
      "Title": "Scared to death and back to reality Dawn1008 Dawn1008"
    },
    {
      "AuthorID": "serenity4al…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161016/profile",
      "Content": "Sep 22, 2012 10:05AM serenity4all wrote: Remember : _  You are not alone in this life experience. You have the support of many who care. _  It's normal to cry. That's our natural way of facing a difficult moment. Acknowledging the difficulty will allow us to move on, and find constructive solutions. _  There's so much more about you than this physical condition. Nothing will take away who you are, ie, a beautiful human being.     So, look out your window. What you see is Life beckoning out there. Go enjoy the day !",
      "MessageIndex": 4,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793889",
      "Title": "Not a good day today - feeling overwhelmed..... nextnln mamabee"
    }
  ]
}