{
  "AuthorID": "series",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122384/profile",
  "Posts": [
    {
      "AuthorID": "series",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122384/profile",
      "Content": "series wrote: My mom has just diagnosed and found a 3 cm and 2 cm breast cancer. The doctor didnt found a significant signal at lymph node from the mamogram but he said when he actually touch it he felt like he found something there. The x-ray film (or something else that can detect cancer I'm not sure) from 4 months ago did not show any sign of cancer (Well it's kinda too old, I know). I wonder that my mom is risk of being on stage 4 of cancer? and are there any treatment that can actually cure cancer at this stage or just a treatment to maintain life?  Sorry for my poor English. I'm not really a native. Thank you for any future reply.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/764877",
      "Title": "About probability series flash"
    },
    {
      "AuthorID": "series",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122384/profile",
      "Content": "Feb 14, 2011 04:33PM series wrote: She will recheck the whole body again in the next two weeks but the problem is that shw is worried about her looks so much that she does not want to lose her breast. She was like \"doctor how long can I live without surgery\"and I was shcoked! By the way, i'm from thailand and the insurance here treated people so badly and my mom is so sick of these liars that she did not have any insurance and now that she is dealing with this she has no help from any institute. So this is kind od hard. I'm so hoping that the whole checking thing will turn out that my mom is only at stage 2 or 3. And that she will have suergery soon.",
      "MessageIndex": 2,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/764877",
      "Title": "About probability series flash"
    }
  ]
}