{
  "AuthorID": "Seriouslysa…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
  "Posts": [
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 3, 2013 01:45PM Seriouslysammy wrote: Guess I'm a little behind to post but I've been reading lots of stories by brave women during my journey and they have helped a lot. I just finished surgery. I had a lumpectomy January 29th with a node dissection and port removal. I got my pathology results Friday and everything looks good. There was a micro amount on cells in 1 lymph node and tumor margins were clear. I did 6 rounds of chemo before surgery which allowed for a lumpectomy. I started with 2 tumors 1 which was 2.5cm (which was found at my first mammogram at 41) and another tumor of 1cm and 1 node at 3 cm which which was found on pet scan. The chemo did its job and shrunk everything to almost nothing before surgery. I am scheduled for hormone therapy and radiation to start in a few weeks. It's been up and down for sure. Half way thru chemo the doctors thought the tumor was actually growing. I'm a Canadian living in the US trying to deal with a new health care system as well.",
      "MessageIndex": 949,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 3, 2013 02:33PM Seriouslysammy wrote: Thanks peanutsgal for cording info. I googled it. Sounds like exactly like what's going on with my arm.",
      "MessageIndex": 952,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 3, 2013 02:23PM Seriouslysammy wrote: I just had lumpdectomy Tuesday and 5 nodes removed. I have the same pain underneath my arm to. Feels like someone pinched my arm from armpit to elbow. I have a follow up appointment on Wednesday and I'll see what surgeon has to say.",
      "MessageIndex": 951,
      "PostDate": "03/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 8, 2013 07:00PM Seriouslysammy wrote: Got pathology report from dr and saw that I am actually a grade 3. My original biopsy report said grade 2. I asked why different and was told that with a bigger sample to check they could more accurately stage it. Dr also said that my case was going in front of a board and they will discuss taking more nodes. I only had 1 node with 0.2 cm cancer left after chemo the other 4 were clear. My dr will argue that it's not necessary so we shall see. Have appointment with radiologist this week. I also still have an egg size lump under my arm from lymph dissection. I ha it drained on Wednesday and it came back the next day. I decided to leave it alone to see if my body can figure out what to do with it.",
      "MessageIndex": 1017,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 10, 2013 10:00AM Seriouslysammy wrote: Mmss, thanks for your reply. I was curious about the whole board thing. I truly hope they do not want to take more nodes. My Dr really doesn't feel it's necessary and after all the reading I've been doing neither do I. I'm having enough issues with just the 5 nodes they took for the biopsy. I have a huge sonema now that is so un confortable. I'm debating getting it drained again on Monday or leaving it to see if by body will figure out what to do with it only problem is I'm taking a cruise in less than 2 weeks ( before radiation ) and i would hate if I had to deal with it the whole time so I'm not sure what to do. Oh and it was my diagnosis grade that changed from 2 to 3. Apparently it's because they had more tissue to test during post surgery than the original biopsy. If anyone has any suggestions on what could help with the senoma I would love your input.",
      "MessageIndex": 1038,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "Seriouslysa…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161044/profile",
      "Content": "Feb 10, 2013 10:04AM Seriouslysammy wrote: Hey lifewithlemons, looks like we have very similar diagnosis at around the same time.",
      "MessageIndex": 1039,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}