{
  "AuthorID": "Sgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207115/profile",
  "Posts": [
    {
      "AuthorID": "Sgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207115/profile",
      "Content": "Dec 16, 2014 12:06PM Sgirl wrote: Did any of the doctors ever give you an explanation of what you had, since they were sure you don't have ibc? I have been concerned about having it too, but I will say that after 17 months, if your symptoms have not gotten worse, it s likely that you don't have ibc . I would like to see what they say s",
      "MessageIndex": 3,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827000",
      "Title": "after 17 months alicki alicki"
    },
    {
      "AuthorID": "Sgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207115/profile",
      "Content": "Dec 24, 2014 05:45PM Sgirl wrote: Hi, I am several years older than you (23) and have also recently been diagnosed with fibrocystic breasts.  I have read that fibrocystic breasts changes can cause lumps, but I don't have any lumps that I can feel.  My symptoms began as burning, tenderness, aching, itching and some slight swelling.    I was very alarmed when I first started having the symptoms.  They were more pronounced in my left breast, but since it started about 5 months ago, my right breast has been having more of these symptoms also.  I worry a lot about my health and immediately began starting to worry about the possibility of breast cancer.  I have never taken birth control, but have heard that it can affect breast issues/health, so it could possibly be playing a part in your situation.  I ended up going to two breast surgeons; the second one I went to did an ultrasound.  I didn't have to wait for the results; she did it right in her office, and I looked at the screen as she was doing it.  My breasts both showed up solid white on the screen; she said this is because me breast tissue is very dense.    I hope your results are good!  I just wanted to stop in because I am young too and have been diagnosed with the same condition that you have. ",
      "MessageIndex": 4,
      "PostDate": "24/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/827174",
      "Title": "Waiting on Ultrasounds Results KimberlyAnnette Moderators"
    },
    {
      "AuthorID": "Sgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207115/profile",
      "Content": "Jan 16, 2015 10:06AM Sgirl wrote: Hi, I am about a year younger than you; I have been having concerns about my left breast since July (six months ago).  I had burning, tenderness, and itching.  It was very uncomfortable, and my left breast never seems like the feelings have completely gone away.  I have been to two breast surgeons who both said it is most likely fibrocystic changes.  I have been watching constantly so if I have any changes I can go back and get checked immediately.  However, nothing has reallyl changed in the past 4-6 months.  I have been really scared, too.  In fact, I have been on anxiety medicaction since this started. I hope you can get to a good doctor soon and that everything is OK!",
      "MessageIndex": 1,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/827626",
      "Title": "Fibrocystic adenoma questions? sophie23 gapeach79"
    }
  ]
}