{
  "AuthorID": "Shannon_A525",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164305/profile",
  "Posts": [{
    "AuthorID": "Shannon_A525",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/164305/profile",
    "Content": "Shannon_A525 wrote: I am a 35 year old single mother of an amazing 5 year old and I just want answers.  I have had a red/pink swollen, very tender, warm to touch, skin has pitting, nipple flattening on right breast.  I have seen my primary and a surgeon.  They first said mastitis put me on Cephalexin, no improvement, had a breast ultrasound that showed significant skin thickening and subcutaneous edema.  Put me on Augmentin and tole me to use warm packs.  So did this for 10 days no improvement, swelling seemed to be getting worse.  Saw the surgeon he said cellulitis, put me on doxycycline.  After one week no change did one single punch biopsy. came back as dermal fibrosis, pancytokeratin negative.  He said he could not tell me there was no cancer but that he thinks it is an infection.  When asked what kind of infection he said maybe could be CA-MRSA and that the doxcycline should cover it.  I am a nurse so it would make sense for me to have this infection, but I can't stop the feeling in my gut it is not.  I have never had a fever WBC are normal, no aches, no chills, no sweats.  I had a staph skin infection a while back after surgery and I remember feeling like crap.  I don't feel this way with this, feel great except for the knife like pain in my breast.  I also get the feeling of milk let down in that breast.  My lymph nodes under my arm are swollen and sore, I feel lymph node just below my shoulder that is tender and swollen. Any input would be wonderful!!!!!  Thank you Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "14/11/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/796324",
    "Title": "scared Shannon_A525 marie5890"
  }]
}