{
  "AuthorID": "Shansen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125423/profile",
  "Posts": [
    {
      "AuthorID": "Shansen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125423/profile",
      "Content": "Mar 13, 2011 10:30AM Shansen wrote: I had a double mastectomy with tissue expanders 2/17. Anyone starting ecxercising yet? Running? Yoga .",
      "MessageIndex": 384,
      "PostDate": "13/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "Shansen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125423/profile",
      "Content": "Mar 9, 2011 01:45PM Shansen wrote: Hello I am from St Paul Mpls and had a double mastectomy on 2/17/11 and am 42 years old. I have tissue expanders and stage 3 cancer IDC with 6/18 lymph nodes. I start Chemo Friday with 4 doses of AC followed by 12 weeks of Taxol+Herceptin then 6 weeks of radiation 13 more cycles of Herceptin and then a breast implant exchange and tamoxifin for 5 years and another drug I cant remember for 5 after that. Seems like a very long road and I am anxious to get going. Not looking forward to it but want to get the show on the road. Its scary waiting and its scary starting. I am adding massage and accupuncture to my protocall and fully expect to lose my hair by the end of the month. My mom died of breast cancer 4 years ago and presented in very much the same way I have though she was older. She did lumpectomy and chemo and a type of radiation where she wouldnt lose her hair. Her cancer came back 3 years later and she had mnore radiation and chemo but didnt make it. I am hoping I have some soul sisters out there.",
      "MessageIndex": 95,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    }
  ]
}