{
  "AuthorID": "Shappy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
  "Posts": [
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Aug 7, 2009 10:51AM Shappy wrote: I had stereotactic one month ago and am still having pain from a hematoma (pain to touch or when my boob bounces around during exercise etc not enough for motrin).   Is it possible she has a small hematoma she can't really see or feel too well?  I don't expect mine to go away (actually the body to reabsorb) for several months, I just try to ignore it since I know it's of no real significance. I had a clip placed too but never dreamed it could cause discomfort. I'm sure mine is just unresolved hematoma.    ",
      "MessageIndex": 8,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/738556",
      "Title": "titanium clip in breast.... Veryhopeful Sallye"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Aug 24, 2009 11:05PM Shappy wrote:",
      "MessageIndex": 4,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739303",
      "Title": "Biopsy today sheila1951 Shappy"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Sep 5, 2010 11:21PM Shappy wrote: BTW, Is it normal to have extreme bruising after the biopsy? My whole right side over there is deep purple! Well for me it was.  Horrible bruising. I also developed a hematoma the size of a plum that lasted for months. Finally all went away and breast looks normal. ",
      "MessageIndex": 11,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/757592",
      "Title": "Good morning! My diagnosis is \"worried!\" Jenlm lago"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Aug 10, 2009 08:24PM Shappy wrote: Shelia Sometimes when it rains it pours. As I was recovering from my breast biopsy my husband dropped the chest pain bomb on me. (Already had cardiac cath and  2 difficult stents 18 months ago.) Fortunately he was ok (I was sure the stents had occluded). Well your DH probably had his cath today and I hope all was o.k. I was amazed at how routine stents and cardiac bypass surgery are  today.  I know someone recently with bypass surgery who was doing fabulous just two weeks post-op. Unfortunately we are at the 'age' where suddenly all this stuff happens and it's so overwhelming. Well you probably had your MRI today and hubby his cardiac cath--that's a pretty full plate! Hope all went well. (((Hugs))) and good thoughts from California.  ",
      "MessageIndex": 9,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738550",
      "Title": "MRI Monday and I am freaking sheila1951 sheila1951"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Shappy wrote:  Permalink  HEALTH Cancer Society, in Shift, Has Concerns on Screenings By GINA KOLATA Published: October 21, 2009 The American Cancer Society says screenings can come with a risk of overtreating many small cancers while missing cancers that are deadly. www.nytimes.com/2009/10/21/hea...  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742553",
      "Title": "American Cancer Society Shappy LavenderNLace"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Sep 4, 2009 07:31PM Shappy wrote:",
      "MessageIndex": 5,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739494",
      "Title": "Bone Scan somerset72 Shappy"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Aug 25, 2009 10:41PM Shappy wrote: I know you are really worried about this and medically I can't advise you but . . . If I had a nickel for everyone who has back pain . . . a myriad of reasons most of which are just a annoyances.  I can't tell you the number of pains I've had that have come and gone. The latest was a pretty severe hip/pelvic pain that lasted 6-8 weeks.  I joked to DH if I were a normal patient I would have already had a CAT scan.  But I get severe anxiety from going to doctors and guess what?  The pain that brought me to tears 8 weeks ago is just completely gone. If I would have been treated I would have said the treatment was successful. I'm so sorry you have to wait but try to tell yourself that back pain is extremely common for all sorts of reasons and hopefully yours will turn out to be nothing.  ",
      "MessageIndex": 1,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739494",
      "Title": "Bone Scan somerset72 Shappy"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Nov 22, 2009 11:14PM Shappy wrote: Dear Miriam I too have been following your saga and have been hoping you would receive good news. But obviously life doesn't always go as hoped and I'm truly sorry you received this news. You've got your head on straight when it comes to medications--take advantage to help you cope.  Hope Tuesday goes well.  Please keep us posted on how things are going.  Love & Hugs ",
      "MessageIndex": 4,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744315",
      "Title": "Horrible News re Swollen Groin Node mshalto mshalto"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Sep 25, 2009 09:27PM Shappy wrote: Angela I'm sorry you are going through this.  I can't comment on the thermogram as I know nothing about it. But I wanted to comment that I think your worrying on the liver isn't warranted.  First, they would do a biopsy if anything were suspicious.  Secondly if you had four malignant tumors in your liver a year and a half ago, you would be very sick now.  I can understand why you are so concerned, but I think the fear over your breast condition is coloring  how you feel about the incidental finding on the MRI.  I hope everything goes well for you.",
      "MessageIndex": 2,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740976",
      "Title": "Positive Thermogram, Neg Mammo & U/S, 4 Liver Tumors angela_m georgie430"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Jul 24, 2009 10:59PM Shappy wrote: Well I can't give you medical advice but I had a stereotactic biopsy two weeks ago.  I was terrified because of what I heard but knew the doctor very well and trust him implicitly so I was calm during the procedure.  There was no pain.  I received two injections of numbing medications and that was adequate.  I do know the biopsy was in a pretty 'easy' area to reach.  Whatever your decision, don't base it on fear of the stereotactic biopsy, at least for me it was a painless procedure.",
      "MessageIndex": 1,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737940",
      "Title": "Sterotactic Biopsy? sjr carolsd"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Nov 24, 2010 07:13PM Shappy wrote: What great news!!  Your description of the biopsy was amazingly detailed.  I'm the world's worst medical wimp and somehow I got through a biopsy last year but my mind has blanked most of it out!!  ",
      "MessageIndex": 33,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/760830",
      "Title": "Somewhat Silly Stereotactic Biopsy Questions JellyShoes JellyShoes"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 20, 2009 03:19PM Shappy wrote: Well here's my take. FWIW I'm also intensely interested in this subject.  The theory behind the bra theory is that it constricts the lymphatic system which is important in detoxing the body naturally (like the liver, kidneys) and in immune response.  I think the underwire bras are very constricting and I've always avoided them like the plague. Medical care in this country is much driven by the drug companies.  If the disease doesn't exist they make it up to sell the drug (like restless leg syndrome).  They pumped hormones into post-menopausal women and made it seem like you were crazy if you didn't take them (I've sat through many of those 'benefits outweigh the risks' lectures).  The HRT was a pretty good gig, all women needed them and you took the menopause till death!   Steady source of revenue. There is no money to be made by looking into the role of constricting bras. So there will be no research.  But think logically, men who wear jockey shorts have lower sperm counts than those with boxers.  Is it a a coincidence  that Lance Armstrong got testicular cancer?  I don't know but obviously clothing (or prolonged hours of bike riding) change the body's physiology. I would think a constricting bra could change breast function so I think the theory should at least be studied. Are there more toxins in our modern living that cause cancer?  Probably yes, but maybe we are constricting the body's natural defenses. I don't proclaim to know the answers but having been married to someone in the medical field for 36 years and being an RN myself I don't believe entirely in the \"science\" the drug companies are pushing.  I think they are self-serving and most of the public is unaware that the drug doesn't even necessarily have to work, it just has to work better than the placebo. And the side-effects are minimized. So, since I don't know I choose not to wear an underwire ever, and the bras I do occasionally wear are not constricting at all.  And I don't believe nipples are offensive either which our culture seems to believe.  I think breasts and nipples are beautiful, functioning parts of our bodies. And for the record I got into many disagreements with my OB/GYN brother in law who felt it was gospel that all women should receive HRT.  My exact words were \"if got intended you to have hormones after menopause, you would be producing them.\"  Guess I was right after all. ",
      "MessageIndex": 1,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742418",
      "Title": "link between bras and breast cancer MayRunner RunswithScissors"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Nov 9, 2009 11:39AM Shappy wrote: Jalmom In my case I have an area of sort of flat hardening after stereotactic biopsy in July.  I originally had no lump, just calcification. Here's how my progress of healing went. Biopsy in early July Lots of bruising, swelling.  Development of large hematoma (plum sized). Hematoma felt very hard.  As it's slowly resolving I can feel an area of flat hardening.  It's getting better very slowly as the body reabsorbs the hematoma. Is it possible that you have a resolving hematoma?  As your doctor.   I thought once the biopsy was over healing would be quick.  For me that hasn't been the case.  Good luck",
      "MessageIndex": 3,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/743431",
      "Title": "Ok I know yall are probably sick of me but.... Jalmom09 flash"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "May 27, 2011 12:29AM Shappy wrote: Wabi Sabi I like your attitude very much, I wish I could be more like you! Wishing you the best. ",
      "MessageIndex": 10,
      "PostDate": "27/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769348",
      "Title": "Birads 5 Wabi-sabi leaf"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Sep 10, 2009 07:05AM Shappy wrote: Patty I'm quite familiar with Kaiser coverage. They have the highest mammography compliance rates of anybody!  Patient's are red-flagged if they come in for ANY appointment and haven't had a mammo, they are told to get one! Mammograms are 'self-referral' at Kaiser.  You don't need an MD referral, you can just walk-in and get one M-F. The only reason I can think of they wouldn't do one is if it wasn't indicated (like you had a normal one in the past 12 months and wasn't medically indicated for follow-up).  ",
      "MessageIndex": 4,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740170",
      "Title": "calcifications/mammogram coverage PattyCakes PattyCakes"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 28, 2009 11:50AM Shappy wrote: I felt that the arnica helped the bruising dramatically FWIW. For the hematoma I've been using a heat pack and I think that helped.  My pharmacy had a clay one I heat in the microwave and it stays warm a long time,  I've been using that the past couple of weeks.",
      "MessageIndex": 4,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 21, 2009 11:12AM Shappy wrote:   What's so provocative?  It's just an idea,  a possibility. This is the \"not diagnosed\" forum btw.   I've read that neurosurgeons who do brain cancer do NOT put cell phones to their heads, they use speakers or wires.  Something doesn't have to be \"proven\", esp. if the something doesn't hurt you. I don't think not wearing a bra will hurt you, nor will not using a cell phone.   Hormones were proven not to cause breast cancer until they were so science is always changing.  What's wrong with keeping an open mind?  I don't see any harm in discussing something like not wearing a bra.  Nobody says it's a fact.  It would be really difficult to do a controlled study anyway, there are so many variables, known and unknown. I'm really disappointed to see the people be so paranoid about the intentions of the original poster.  I'm just hard pressed to see what in the world is so \"provocative\" about  a theory of not wearing a bra.  I gave up my old deodorant for the Crystal stick.  Will it help?  I don't know? Does it make me feel a little better?  Ya, I guess. Am I nutz?  Probably! I think the common ground here is, at least for me, trying to gain a little bit of control over our risk factors.  I can't undo the fact that I got my period at 10.5 years.  But I can control a few other things.     If everyone had such a closed mind there would never be any new  medical discoveries!  ",
      "MessageIndex": 15,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742418",
      "Title": "link between bras and breast cancer MayRunner RunswithScissors"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 22, 2009 03:58PM Shappy wrote: May Thanks for coming back and posting.  I take big offense when people suspect someone is a troll because they don't like what they say.  You have a healthy curiosity, keep it. I agree with you, prevention is preferable to treatment.  That would be ideal.  But to those who have already breast cancer, treatment is most important. Leaf I think you are a top poster here and I would like to compliment you on your thoughtful, insightful, educated and sensitive replies here.  You are a source of information and comfort to many and I respect you greatly.  But . . .   As far as I know, in Victorian England, when women wore corsets, the incidence of breast cancer wasn't higher than it is now.  Who knows what women died of in Victorian England, I doubt if they had the capability of diagnosing breast cancer with pathology reports!!  My father's mother died in the 1920's, I was always told she had T.B.  Now I find out maybe it was the flu.  Who knows?    When women want to stop breastfeeding, sometimes they bind their breasts. So manipulation/constriction of the breast is not associated with breast cancer, as far as I know.  Women haven't bound their breasts in this country for the last 30+ years --which is how long I've been teaching breastfeeding to new mothers. There is a HUGE push now to encourage breastfeeding--more than 90% of our mothers breastfeed.  When I was born bottlefeeding was the norm.  I think the lymphatic system is underrated--most of postpartum engorgement is lymph fluid. My personal axe to grind in this is I personally hate underwire bras.  Always referred to them as medieval torture devices.  Didn't buy bras sometimes for years because I could not find a bra without an underwire.  Now I see companies are making softer bras. I doubt if underwire bras have ever been so widespread as they have been in the past 20 years.",
      "MessageIndex": 22,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742418",
      "Title": "link between bras and breast cancer MayRunner RunswithScissors"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 23, 2009 03:52AM Shappy wrote: I think one area that should be fast tracked for research is finding out which cancers need to be treated and which ones won't hurt us. ",
      "MessageIndex": 23,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742418",
      "Title": "link between bras and breast cancer MayRunner RunswithScissors"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Dec 16, 2010 05:50PM Shappy wrote: Nina I'm so hoping everything will turn out well for you.  I don't have enough knowledge to comment on your lump but the fact that you've had it for three years is certainly in your favor. I do sense a lot of anxiety about the breastfeeding.  If possible, make an appointment with  a Lactation Consultant.  If you are worrying about pain meds and breastfeeding, don't.  Pain meds, esp. short term,  are perfectly compatible with breastfeeding.  If you are away from your baby, however, you need a hospital-grade pump to maintain lactation.  If your hospital is 'baby-friendly' they should provide one for your use during your stay, or just rent one.  If it's an out-patient procedure which I'm pretty sure it will be, any electric pump should do. ",
      "MessageIndex": 3,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/762108",
      "Title": "now it's my turn... ninastar julie75"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Jan 8, 2011 12:06AM Shappy wrote: I wouldn't read too much into what the radiologist said or implied before you get the path results back. I had one biopsy and after the biopsy when the radiologist wasn't reassuring (he said nothing) I was SURE it was cancer since the radiologist is one of my husband's best friends and is very quick to say, \"it's nothing.\" Well it was nothing, no cancer and no atypia. I wish you the best!!",
      "MessageIndex": 1,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763088",
      "Title": "How many of you were told.... BioAdoptMom3 marie5890"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Aug 18, 2009 06:44PM Shappy wrote: Stacy I can't tell you not to worry because I've gotten the 'call' and have gotten panic attacks but I will say this . . .. I was at work the other day and everyone kept saying \"you've lost so much weight.\" I said you don't want to lose weight my way and I told them my biopsy story (we're nurses so we're pretty upfront about all this.) Literally everybody in the group had a story about how they had been 'called back' and almost all had been called back for ultrasound. My point is it's pretty common to be called back for additional tests.  If you look at the stats if you go for yearly mammography for 10 years they are going to nab you at some point.  One of the nurses who had gotten 'the call' says she doesn't want to go back for mammos again. I can hear you about reading other posts until you find out about what is going on, that might tend to make your mind race.  Remember most of the posters here that stick around have gotten positive results,  As you probably know 80% of lumps are benign and those ladies don't tend to post. The waiting is the hardest part but please take comfort that LOTS of us have been there and can commiserate.  I'm sending you the best that everything will go well for you. ",
      "MessageIndex": 2,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/739162",
      "Title": "Pretty scared stacyRuss stacyRuss"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Apr 8, 2007 11:34PM Shappy wrote:",
      "MessageIndex": 5,
      "PostDate": "08/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/579904",
      "Title": "pain during wire guided procedure LouiseLouise leaf"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Oct 27, 2009 10:23PM Shappy wrote: I had a stereotactic biopsy the beginning of July. I had severe bruising for 4-6 weeks.  I developed a plum (or larger) sized hematoma.  Now, almost 4 months later, the hematoma is almost, but not quite, gone.  It's taken a LONG time to go away but was told there isn't much to be done but let the body reabsorb.",
      "MessageIndex": 2,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/742890",
      "Title": "Bruising after excisional biopsy miadora miadora"
    },
    {
      "AuthorID": "Shappy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/48986/profile",
      "Content": "Feb 5, 2011 10:09PM Shappy wrote: I've had 2 call backs because of microcalcs--the first one they just did magnified studies and said it was nothing.  The second time I was called back it was again new microcals I was told just like you -it's probably nothing- but btw we can biopsy it so you don't worry.  I was confused--if it's nothing--why the biopsy?   My facility doesn't use the BIRAD system but I was told 2% chance of malignancy so I guess that's BIRAD 3 .So I had the biopsy--it was nothing.  I hope your results will be the same. And BTW I totally freaked out too.  If your doctors say it's probably nothing I don't think you have a 20% chance of malignancy--probably way less.  Calcifications don't mean you will get cancer in the future.  I hope this makes you feel better--and remember--radiologists get sued over this stuff all the time so there's a lot of CYA medicine. Best of luck.   There has to be a better way sometime in the future --there is just too much stress caused to women over these mammogram results.  Sometimes I feel like never having another one. ",
      "MessageIndex": 4,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764466",
      "Title": "microcalcifications and now... panic! momoschki vmudrow"
    }
  ]
}