{
  "AuthorID": "ShariMancus…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162193/profile",
  "Posts": [
    {
      "AuthorID": "ShariMancus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162193/profile",
      "Content": "Oct 13, 2012 11:31AM ShariMancuso wrote: Thanks everyone. I'll try those suggestions. I can see where I was trying too hard too quick. I was walking about a 1 1/2 miles and I got hot. Yes, I think my sleeve and glove fit correctly. The weather is cooler and so maybe I can get back in a walking routine (and off the couch).",
      "MessageIndex": 1898,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "ShariMancus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162193/profile",
      "Content": "Oct 15, 2012 04:57PM ShariMancuso wrote: Thanks for the question dispatcher906. I'm new to this also and didn't understand all I read. Glad to see some web sites to visit. Today I received the Lebed DVD in the mail, so I did that (most of it anyway). And early this morning I walked about 15 minutes with a walking stick my friend loaned me. It's almost 5:00 p.m. and NO SWELLING! I am so excited. There really is hope that I can get back to a semi-normal life. This stuff has been dealing me misery all summer.  One other note: Last Friday I spent the day shopping with friends (with sleeve on most of the time) and had no swelling that day. I've told my husband that shopping with friends is my new lymphedema therapy. (He's so sweet. He said if that would keep the swelling down then, go for it!) ",
      "MessageIndex": 1909,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "ShariMancus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162193/profile",
      "Content": "Oct 11, 2012 09:08PM ShariMancuso wrote: Tina, thanks for starting this discussion. I am new to these discussion boards. I have been battling with lymphedema since last May. I have had the MLD training and how to wrap my arm. I have a sleeve and glove. I tried to walk for my exercise but everytime I walk, my arm swells. Do you folks know a secret that I don't know? What weight exercises do you do? Would love to hear from others. Everything goes fine if I just lay on the couch with my arm elevated and do NOTHING but obviously that's not very realistic. I've been reading the above post about drinking lots of water, food choices, and exercise. Is there a site I can go visit to get move information about these topics?",
      "MessageIndex": 1880,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "ShariMancus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162193/profile",
      "Content": "Oct 11, 2012 09:59PM ShariMancuso wrote: Thank you so very much for the advice and sites. I had not thought about using a walking stick. It just might do the trick. I am so excited to find a place to talk with others about lymphedema. I live in a small town and there is not much in the way of information. I appreciate your help.",
      "MessageIndex": 1882,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    }
  ]
}