{
  "AuthorID": "ShareTheLig…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245624/profile",
  "Posts": [
    {
      "AuthorID": "ShareTheLig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245624/profile",
      "Content": "Jan 18, 2017 03:27PM ShareTheLight wrote: Thanks everyone! I did get to speak to my surgeon today but as it so happens, I don't feel the weakness in my leg at all today so maybe it was just a weird happenstance. She did say that wasn't normal and that if worsens to call but like I said, I'm fine today. The good news is, lymph nodes came back clear! Bad news is the margins did not so I'll go back in next week. I think I'll start a new thread simply because she said thought it started as IDC, it's now ILC. She explained it all but I didn't process any of it so I'm meeting with her next Tuesday, day before surgery to go over details again as I'm confused by that. Thx for the support! :)",
      "MessageIndex": 5,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851948",
      "Title": "Weakness after SLNB ShareTheLight BarredOwl"
    },
    {
      "AuthorID": "ShareTheLig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245624/profile",
      "Content": "Jan 24, 2017 12:44AM ShareTheLight wrote: GT1965 that's awesome news for you! I had my lumpectomy and SNB on 1/11 and my nodes were clear too although my margins were not so looks like I'll be going back for surgery either this Wed or next. :( In regards to the numb breast, that's what I had too. Looks like I'm just about a week ahead of you in recovery time and now I mainly just feel the numbness near the axilla incision though it seems to be getting better. I know each person heals differently but as for me, it seems like the first 3-4 days post-op were the easiest. Now it seems like the nerves are coming alive so even my vibrations from walking cause weird sensations in my breast with some mild pain. My steri-strips on the axilla just came off today. I feel less pain in my breast when it's compressed so definitely be a good girl in regards to that. Here's hoping the rest of your recovery goes smoothly and that you continue having an optomistic attitude through treatment.",
      "MessageIndex": 1051,
      "PostDate": "24/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    },
    {
      "AuthorID": "ShareTheLig…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/245624/profile",
      "Content": "Jan 22, 2017 01:41PM ShareTheLight wrote: Hi everyone! Had 1st lumpectomy on Jan 11th but margins weren't clear so going under again on the 25th just to remove more tissue. Requesting an MRI so depending on results, date and type of surgery may change. Best wishes to all!",
      "MessageIndex": 970,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851243",
      "Title": "January 2017 Surgery Group BeachBabyK Elem"
    }
  ]
}