{
  "AuthorID": "sharingwith…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90009/profile",
  "Posts": [
    {
      "AuthorID": "sharingwith…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90009/profile",
      "Content": "Oct 4, 2009 03:01PM sharingwithu wrote: Hi Cath, So sorry to \"invite\" you to our club...but what amazing, wonderful, caring women you'll find here!!! You sound like such a caring and giving person!!!  Taking in Patrik's mom...nurturing little Patrik!!  This is unique...a wonderful humane answer to another person's suffering. You're in shock!!!  Panic!!!  I know...I was just diagnosed a few weeks ago...at least I think that's when I found out.  First...it's normal and perfectly fine to feel and express panic!!!!!!!!  We are here for you...vent, ask questions, describe how you're feeling...we're here and will respond. Receiving the diagnosis that you have cancer turns your whole world inside-out and up-side down.  Everything feels crazy!!!  Every feeling you have is perfectly normal.  The most important thing to remember is to express your feelings...and get as much info as you can...join a support group...reach-out and give back to this forum...remarkable women. We are all sisters...instant sisters.  We are all fighting our personal battle and we're also fighting our collective battle. Go with how you're feeling at the moment.  Don't push your feelings down.  You sound like a fantastic, GIVING person.  Now it's time for you to allow people to help you!! Think positive thoughts...feels a lot better than freaking out, but then again, freaking out is a part of a long process. Know that there's a 59 year old lady from New Jersey, USA thinking about you.  Send me an e-mail.  Maybe we can become e-mail pals! ubehpy2003@aol.com sharingwithu",
      "MessageIndex": 6,
      "PostDate": "04/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/741399",
      "Title": "I am really scared cathmoss cathmoss"
    },
    {
      "AuthorID": "sharingwith…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90009/profile",
      "Content": "Sep 28, 2009 11:16AM sharingwithu wrote: I certainly can relate to how you're feeling as I was just diagnosed a week ago.  Now I have to undergo so many tests to determine the stage of my cancer and whether some cells have traveled to my bones, liver or lungs. I waited 10 days to get the results of a painful biopsy so I know how you're feeling about the anxiety of waiting.  I can't offer you any answers as to how dangerous it may be to wait.  I'm sure your doctor is  perfectly in control of this and is not risking your health regardless of how crowded the halls of cancer may be. You are in my thoughts and my prayers. Sharingwithu",
      "MessageIndex": 13639,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    },
    {
      "AuthorID": "sharingwith…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/90009/profile",
      "Content": "Sep 29, 2009 05:06PM sharingwithu wrote: Hi Everyone, This is the second day I've been part of this wonderful support group.  I am almost completely alone in the world.  I have many, many serious problems and now breast cancer. I begin extensive testing to determine the stage of the cancer and whether any cells are renting space in my bones, liver or lungs this coming Friday.  My surgery is scheduled for October 20.  At this point I don't know the extent of the surgery.  I will have an active part in the decision making.  My breast surgeon is absolutely wonderful. I'm considering having a double mastectomy.  I have to do all that I can to reduce the risks of a recurrence.  I can't imagine having only one mastectomy. For all of the positive things I've read on these posts, I am so thrilled for all of you who are having fun and once again enjoying life.  It sounds to me as though it's possible to make friends through this forum even though we are all occupying space in different parts of the palnet. Today I'm just falling apart.  Maybe tomorrow will be better.  I'm just beginning to allow myself to cry.   I think joining a local support group would be a good idea. Prayers to all of you. Thanks for listening. Bo",
      "MessageIndex": 13651,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/692045",
      "Title": "please help sueps barbe1958"
    }
  ]
}