{
  "AuthorID": "SharonS",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
  "Posts": [
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "May 20, 2008 12:20AM SharonS wrote: Hi Ladies - I went to the LT last Tuesday for the first time and she measured and wrapped my arm...then Friday she did the massage.  I have kept the wrapping up and it does get easier to do...it was hard for me b/c my surgery was right side and I am right handed. Today the swelling was down and b/c she didn't feel anything during the massage she went ahead and fitted me for the sleeve and glove which I have on now...and told me to continue the wraps at night.  I see her again next week..I have my simulation on Wed... She wants me to continue the sleeve wearing and wrapping 24/7 at least through radiation.  My swelling was mild, and I do have to admit that it feels better in the sleev/bandages.  I like the sleeve better already.  any suggestions appreciated...I was VERY active before diagnoses...ran marathons...I have tried to keep up my activity...but since my LAST chemo...my legs have swollen and I am more tired than with any of the treatments...I go out to run, but end up walking and running.  Tonight I am going to try playing volleyball with the sleeve and glove.",
      "MessageIndex": 13,
      "PostDate": "20/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "May 23, 2008 08:31PM SharonS wrote: so what happens when we have LE and are retaining fluid in legs...and feel short of breath.  They gave me fluid pills, but now I don't know what to do. Arm is better...and I got a sleeve...they said to wear all the time and wrap at night.  Binney I think I am with you will wear it when exercising and using the arm.  The le is not that bad and I can't see wearing it all the time What about the arm wrapping at night...should I do it every night? Any help appreciated...went for the first rad yesterday...#2 today at 300",
      "MessageIndex": 28,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "May 23, 2008 11:17AM SharonS wrote:",
      "MessageIndex": 32,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 30, 2012 01:14AM SharonS wrote: Mfml the reason my onc gave was that the smaller doses more frequently seem to do away with the long term side effects like neuropathy I have a little from last time so really want to avoid that. I saw on here that they are doing the TC every two weeks now too. So it is good to know they have learned new things to help people in the last four years. I am doing chemo again to reduce my recurrence. Oncotype came back high. All cancer is gone and no lymph nodes this time. Getting tired now so will sign off for today. Paula you still are upside down. How are your treatments going?",
      "MessageIndex": 748,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 21, 2013 02:00PM SharonS wrote: LeeA - I know that sore head feeling. My hair started falling out when I was back in the hospital. We got home late Fri afternoon, but as soon as I got going Sat morning I had my DH cut and buzz my hair. That dead hair hanging makes your scalp hurt. Then every time I took a shower part of the buzz would fall out. DH would say, you are ruining my good haircut, do you want me to fix it? The few hairs left on my crown might have to go when he gets home tonight. Kiwi kid - glad you are getting another one in the books! I wish you few SE. I loved my port in 2008 and got one again. So glad I had it for my week in the hospital. I don't think my veins in my one available arm would have made it. Love your sign off, yes we will fight as warriors and WIN!",
      "MessageIndex": 1202,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Feb 11, 2013 12:02AM SharonS wrote: Hi All - so glad to see the finish posts, having done this once I know how incredible it feels. I had AC 2 on Wed, Fri and Sat we're rough. Worst SE this time was that my skin hurt everywhere! Today things are much better. Had a great surprise when I went to our last BBALL game, my CC team had decorated my door and left cards for me. Then when I get home my son from Memphis is here. He had left to return to Memphis when I was in the ER in Jan. He is my worry wart and after all the complications he had to see for himself that I was ok. A very good welcome out of the chemo cave.",
      "MessageIndex": 1415,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 3, 2013 01:54AM SharonS wrote: Jenjenl and Bren58. I did four rounds of taxotere, didn't do anything with my nails. I kept them but ended up with a line on each nail with each treatment which eventually grew out. Soteria so sorry you are having a bad day On the topic of chemo, rads, hormonal I think everything that reduces recurrence is worth it I did the BMX and thought all I would need would be hormonal but when I met with Onc she explained that bc my tumor was greater than 1 cm that Chemo would really further decrease my chances. So I went with it. I might have gone without the reconstruction if I knew I was doing chemo, but hindsight is 20 20. Ports are wonderful!!!! Hang in there all One day at a time",
      "MessageIndex": 838,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 30, 2013 12:07AM SharonS wrote: Been away for a bit. Started teaching my classes in person this week and then I leave about 1130 or 1200. Went yesterday to get a little fake foob for my Bra since I only have one expander now. Tomorrow will be 3 weeks since that surgery and all seems to be healing. Yesterday when she said this should hold you over until you decide what you are going to do down the road kind of got to me. Right now all is on hold. Not sure if I want to put TE back in right since that side was radiated and seemed to have an issue. Not sure that I will want to screw up my summer when I finally finish chemo in June. Chemo 2 AC will be next Wed if all blood levels are normal. I went back to work because just thinking of all that happened last time has me scared. They will decrease dose some. Sandra hope you are ok, didn't see any follow up posts about your fever. I know many had treatments this week. I hope your SE are few. On a positive note, a former vball player who does hair is going to do a once over on my wig for me tomorrow. Two former cadets came by and walked with me today in the beautiful weather. We went 2 miles. And yes it was a beautiful warm day here in Virginia.",
      "MessageIndex": 1304,
      "PostDate": "30/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 29, 2012 10:51PM SharonS wrote: Hello All Read through the first couple of pages and the last page of threads. I started AC on Dec 27. Will do 4 cycles every two weeks and then taxol every week for 12 cycles. In 2008 I did 4 cycles of taxotere and cyto every 3 weeks. I read someone's post about not having many bad side effects and I can agree for my first go through. Really just a down day on day 3 or 4. The day after shot caused me bone busting pain the first time but the other three were ok. I might have brought that on myself as I went for a little run after the shot because I was feeling so good. So here we go with round 2 of Chemo, hair loss, etc. My hair fell out last time exactly on day 14. Wondering if it will be the same this time. Last time I didn't get a wig, but I already have one for this time. My husband did the shaving last time and I will probably do the same this time. I decided that the wig will make everyone else feel better. People really don't know how to react to bald women. Really it didn't bother me. I just did hats and scarves. I teach and am an athletic director at a small college. Last time my treatments came in my off semester but this time I will be teaching. If needed I can switch to online teaching but I hope to get through this like last time. Only missed on my chemo days and would leave when I got tired. So right now I am about 48 hours after first chemo. This morning felt a tad rough but got in a walk and a lunch with my YaYas for my upcoming birthday. Felt better after lunch. My biggest complaint is that my skin hurts everywhere. Does that make sense? I did the Zyrtec with the shot, they didn't know about that last time. I wish everyone a side effect free day. A little worried about the upcoming day 3 and 4, but for now one day at a time.",
      "MessageIndex": 741,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 30, 2012 02:08AM SharonS wrote: They gave me steroids with the treatment but none before or after like last time. Yes they do blow you up like a chipmunk. I have some of that today. Nicole503 are you doing the taxol with the ac or later like me? Yes I walked 2 before the shot yesterday and about 1.5 today. I am a usual runner but cant run til Jan 1 which will be 6 weeks from my surgery. I would like to bc it will be my usual bday run and it is my 5 year anniversary from first cancer. When I got the path from right side it was AOK do I guess I can still celebrate!?",
      "MessageIndex": 752,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 1, 2013 04:41PM SharonS wrote: Happy New Year All! 5 years ago I was waiting on biopsy results. A good friend had called to wish me Happy Birthday and the call waiting rang through from the hospital. Didn't interrupt my conversation and then found it was the number you can't call back. The next morning when the my surgeon called with the bad news of DIC I asked him if he had called and he said yes but I saw it was your birthday and hung up. Things went quicker that time and I had my surgery on Jan 3. Sorry for rambling, it is taking me longer to get going this am than yesterday but we did hit the High St progressive dinner last night. Maybe I overdid. Sandra I was just mad when I woke up and felt bad again, but it seems if I get upright and eat things get better. Nicole I have been wearing the wig here and there and had fooled lots of people too. Last night I put it on for the last stop bc everyone wanted to see it and it got rave reviews even from the neighbor who does all the hair cutting on our street. She said she could help with any adjustments. I am waiting til my hair starts to fall on the chance that it may not. I had a friend who had treatment and all the guys shaved their hair in support and his never fell out. :). I know it is wishful thinking. I have rambled enough. Happy And Healthy New Year to all!!",
      "MessageIndex": 796,
      "PostDate": "01/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 5, 2013 03:44AM SharonS wrote: Jenjenl and Nicole - I felt like I gained 10 lbs on day 2, then felt like I was in the bathroom all night for the next few days. I am pretty much back to normal now, but no appetite at all which is highly unusual for me. Still eating because I know I need to. Nasty salty taste in my mouth all the time. Doing Biotene but it doesn't go away. Nose is starting to dry out. Those doing TC my hair came out day 14 and over the next week lost all body hair except my brows and lashes. Once I had finished chemo, then my eyebrows fell out. I think I had a short buzz about 4 months after Chemo. Have had a few good days, but get tired at weird times. Didn't walk the last couple of days, so right leg is a little swollen. Had to deal with some big issues at work, but at least it made me feel normal. I need to wash my wig and get it ready for next week. Hope everyone has a good weekend.",
      "MessageIndex": 894,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 20, 2013 04:58AM SharonS wrote: #2 has been delayed until early Feb. I had to have a TE removed on my formally radiated side. It has been quite a mess. Hospital for a week, Infection, tons of antibiotics, 20 lbs of fluid (now gone), and a blood transfusion. Someone asked about their Mom's being delayed. They told me the first one still counts no matter how long we have to wait for #2. They want me to be healthy first. I am moving in the right direction hopefully, but this is the worst I have ever felt in my life. Hopeful for a stronger day tomorrow.",
      "MessageIndex": 1179,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jul 9, 2013 01:18AM SharonS wrote: Great to hear from everyone. I have given up tge wig too . Mine looks like a mostly grey buzz cut and Gwen is right. It is nice in this heat. Might try to spike it up a bit when it gets a little longer the Dh thinks it would be cute. Picked up my Vit D and Calcium today. I need to call the insurance company about the arimidex to find out the hold up have a good week everyone",
      "MessageIndex": 1766,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 31, 2012 02:13AM SharonS wrote: Jenjenl thanks for the feedback. Sorry you had it so rough. I hope the second round is better for you. I know when I did just the TC, the first one was the worst. I think the adriamycin is the heavy hitter. Today has been up and down for me. I did get my walk in this afternoon. Hopeful tomorrow will be better for everyone. We need to send out 2012 feeling good!",
      "MessageIndex": 779,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 31, 2012 02:31PM SharonS wrote: Peb - I did TC 4 years ago on a 3 week cycle. After day 4 I would feel better each day and pretty normal by the third week. In fact before my second round I ran walk a half marathon. Hang in there - hope it goes by quickly. My hair did fall out on day 14. This time I just want it to hurry up and go so I can get on with the wig transition.",
      "MessageIndex": 781,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 20, 2013 10:34PM SharonS wrote: Bren 58, Runnergirl2, Nichole, Sandra 60 - thanks for the encouragement. Today is better. Just took my first walk outside in 2 weeks, very short but a start. Dunster I had a small scab since surgery. When my whites dropped the scab went crazy along with redness Lee A The PS said something about the alloderm and she is researching it. But she has only seen issues with smokers. She is also researching implants after rads. But my radiation was pretty uneventful no blisters, etc and she thought my skin would do great. Hope everyone has had a great weekend with few SE.",
      "MessageIndex": 1197,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 22, 2013 10:01PM SharonS wrote: Congrats Peggy on finishing the AC. I just went for some bloodwork, and creatinine was still high. I finally can stop the antibiotic. Yesterday I started to turn the corner and I hope to get back to work Monday. Have not felt like myself since Jan 5, so it has been a long haul. So glad to make it out. I go back to Onc on Feb 6, if all BW is good I will have AC #2. Sharon",
      "MessageIndex": 1215,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jul 1, 2013 06:56PM - edited Jul 1, 2013 06:56PM by SharonS Another AWOL Dec Chemo groupie checking in!  I finally finished Taxol on June 7th.  I believe my RBC's made an appearance about 5 days ago, so starting to really run instead of intervals.  This 6 months of Chemo trumps my first bout with Chemo, but it is great now to keep active all day instead of my afternoon/evening horizontal position on the couch. I still have one TE and not sure what to do about the side where they removed the TE.  I have two balanced forms for that side that I love.  The one I keep in my new sports bra and then use the stick on one for daily wear.  I started all this surgery, etc two days after my cross country season finished in Nov.  I want to have my strength back and feeling good when the ladies return on Aug 25th.  So I am a bit leary of doing any other surgeries now.  If anyone can advise on the exchange process and how that recovery went I would be thankful.  I think it would be nice to get rid of that TE if I could. I am so glad we all are on the other side.  The vacations, graduations and fitness and health plans sound great.",
      "MessageIndex": 1759,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Dec 30, 2012 08:17PM SharonS wrote: jenjenl - how many down days with the AC before you felt better?",
      "MessageIndex": 777,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Jan 26, 2013 03:19AM SharonS wrote: Sandra - day 9 after my first AC is when everything went downhill. That is when WBC are at the lowest even with the shot. I had a temp. It was on a Sat so I called the Onc on call and they said go to ER. The ER had notes on me and I went right into assessment and then to an ER room. So I didn't have to wait in the waiting room, which would have been the worst place for me. I hope your temp went down and you are feeling better without an ER trip. I am still recovering from everything. AC 2 should be Feb 6, would have been #4 if I stayed on track. Just want to get it behind me at this point. Hope everyone has a Symptom Free weekend.",
      "MessageIndex": 1261,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "SharonS",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62913/profile",
      "Content": "Feb 7, 2013 02:24AM SharonS wrote: Nicole We started together. Glad you are finishing on time!! I had AC number 2. So I am back on the train. Volley mom sorry to hear of your hospitalization. Hope you recover quickly. They gave me two units on the 15 Jan and things did get better.",
      "MessageIndex": 1370,
      "PostDate": "07/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    }
  ]
}