{
  "AuthorID": "shaw77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75751/profile",
  "Posts": [
    {
      "AuthorID": "shaw77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75751/profile",
      "Content": "Aug 29, 2009 02:42PM shaw77 wrote: I had no chemo, did 5 weeks of rads, was exhausted by week 4, which increased over the next couple weeks - it was horribley debilitating. Since March I have slowly increased my energy - was actually able to finally start bicycle commuting 2 weeks ago, finally feel like I'm back to (almost) normal, 6 months after treatment.",
      "MessageIndex": 130,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/730002",
      "Title": "RADIATION FATIGUE - POLL bluejay1 Siciliana"
    },
    {
      "AuthorID": "shaw77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75751/profile",
      "Content": "shaw77 wrote: Anyone else have a painful mammogram after finishing rads? I'm 6 months past rads, had my mammogram 2 days ago, and it was really painful, then all my radiation SEs came back - pain, hot sore breast/underarm, exhaustion... Dx 9/23/2008, IDC, 1cm, Stage I, Grade 1, 0/11 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739696",
      "Title": "First Post Treatment Mammo PAINFUL! shaw77 Binney4"
    },
    {
      "AuthorID": "shaw77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75751/profile",
      "Content": "Jan 9, 2009 11:52PM shaw77 wrote: I am halfway - well, a little more - through my radiation - today was 15 of 25. I am doing fine with it so far. My skin started to be uncomfortable last weekend, but it's not more than that. I have worked almost full time without a problem. I am definitely tired at night, but it's also stressful adding in the hour/plus that the rad tx takes out of my day. can only say what everyone else does: everyone is different. It also matters if you're coming out of chemo or not - I am not, and I think that may make rad a little easier.  good luck!",
      "MessageIndex": 8,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/726961",
      "Title": "side effects of radiation therapy Maria217 Imasurvivor"
    }
  ]
}