{
  "AuthorID": "Shayvoe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
  "Posts": [
    {
      "AuthorID": "Shayvoe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
      "Content": "Feb 17, 2016 03:54PM Shayvoe wrote: I just received the results from my needle biopsy today, and it came back as atypical intraductal papilloma. Was told there is a 15% chance it could be precancer or cancer, and it needs to be removed for further biopsy. I have to see a cardiologist before I can schedule surgery. Sounds like we are in the same uncertain boat. The waiting is the hardest part, and after almost 6 weeks from my initial mammogram, I still don't know if I have cancer. My lesion is 5mm, which is very small, but it could still be invasive cancer per my surgeon. Good luck to you!",
      "MessageIndex": 1,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/841128",
      "Title": "Radial Sclerosing Lesion and Intraductal Pappiloma flamom Shayvoe"
    },
    {
      "AuthorID": "Shayvoe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
      "Content": "Mar 2, 2016 06:09AM - edited Mar 3, 2016 01:38PM by Shayvoe My surgeon called yesterday to tell me the news, even though I have an appt today. My heart dropped to my stomach when I saw his number pop up, because he never gives result over the phone...good or bad....that's just his policy. He said it was fine, no cancer cells, just a papilloma, and he did not want me to worry for one more day, and that is why he called. I am so relieved, and after almost 8 weeks I feel like I have my life back. I still have to go in today, so he can check my incision, but i will certainly go in with a different frame of mind than I have in the past weeks.",
      "MessageIndex": 10,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/841128",
      "Title": "Radial Sclerosing Lesion and Intraductal Pappiloma flamom Shayvoe"
    },
    {
      "AuthorID": "Shayvoe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
      "Content": "Feb 18, 2016 07:11PM Shayvoe wrote: Hi Flamom, I have an appt tomorrow with my internist for an EKG, so I can be cleared for surgery. I will schedule my surgery if all is well with the EKG. I vacillate as well, between it will be OK, to what if it's not. Please post when you have your results. I will be hoping and praying for the best outcome for both of us.",
      "MessageIndex": 5,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/841128",
      "Title": "Radial Sclerosing Lesion and Intraductal Pappiloma flamom Shayvoe"
    },
    {
      "AuthorID": "Shayvoe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
      "Content": "Feb 26, 2016 04:56PM - edited Feb 26, 2016 06:40PM by Shayvoe Hi Flamom...Yay...hooray for your news! I had my excisional biopsy today and have only been home about two hours. A little sore, but nothing unmanageable. Sent me home with pain pills, but I have only taken tylenol and using an ice pack. I did have to have the wire placed when I got there. The same radiologist who did my core needle biopsy and placed the marker, inserted the wire before surgery today. I love her...she is the best and so sweet. She told me that even though they found atypical cells in my papilloma, the chances of it having cancer cells is very small, because the papilloma itself is so small, only 5mm. She said that the chances of cancer cells being present, and the core biopsy missing that area, is minute. She said the bigger the mass, the more chance that a core needle biopsy could miss a part of a mass with cancer cells. My BS also feels pretty confident that it will be just atypical cells, and said there would be no further intervention needed, if that is the case. So, I am feeling cautiously optimistic. I will get my results some time next week. They will call me when they are in, for me to come in for the results, as my BS will not give results over the phone, even good results. I will post when I get the results. Again...so glad to hear your news!",
      "MessageIndex": 9,
      "PostDate": "26/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/841128",
      "Title": "Radial Sclerosing Lesion and Intraductal Pappiloma flamom Shayvoe"
    },
    {
      "AuthorID": "Shayvoe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228055/profile",
      "Content": "Feb 18, 2016 07:05PM Shayvoe wrote: Hi supportive, I believe that when it comes back atypical cells as mine did, that is when the percentage goes up to 15%. He said that it can hide precancerous or cancer cells. At least this is the way I understand what he told me.",
      "MessageIndex": 4,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/841128",
      "Title": "Radial Sclerosing Lesion and Intraductal Pappiloma flamom Shayvoe"
    }
  ]
}