{
  "AuthorID": "She-Angel",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
  "Posts": [
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 3, 2014 11:49PM She-Angel wrote: Had my first infusion on Halloween. It was a very long day with my veins not cooperating. I will be getting the port put in. All in all I have felt fine just tummy felt off kilter not nauseous just weighted down. The anti nausea stuff I took the first 3 days worked well. My energy level seemed what is norm for most, when I am tired I sit it down. I just thank God for carrying me because it is a lot to deal with. My chemo bag of stuff came in handy to keep me occupied and not room watching so much with me being a newbie and the headphones for my music were a must. I normally have dry skin but since the first treatment my skin is like the dessert and my hair feels like straw. Over moisturizing a must now. I really think working out is one reason I have been doing well, it takes away a lot of my stress and refocuses me of only for an hour. Just looking forward to moving ahead and getting better. I pray for us all as we continue with our own personal journey through this trial of life. Have a good week ",
      "MessageIndex": 452,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 6, 2014 09:18PM She-Angel wrote: Sjacobs146, I have it on my calendar when it should be coming out. November 15th is the day, so far my oncologist has been target on for everything else so I am going with that he is probably right. I have it on my calendar and I planned to have it shaved down and start wearing my short and sassy wig the 17th at work so it appears seamless, but since nothing has gone the way I would have planned it I suspect it will start before then. I washed it last night and blew it out on a low setting but even my co-worker who helped me get it into some type of order this morning agreed with me it feels strange, like a synthetic wig and it won't curl at all and has no body. I know its just hair but I guess I want just a little control of something and with my husband being bald I never thought we both would be. Has anyone starting losing eye brows? I was told that it shouldn't happen but now I am thinking if you lose it in other places wouldn't the eyebrows and eyelashes go too. I have no idea how to draw on eyebrows so I would be at a total lost!",
      "MessageIndex": 493,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 11, 2014 07:23PM She-Angel wrote: I was on the fence about registering for the LGFB classes but from reading your posts it seems like a good idea and it will give me a bit of confidence in applying makeup to look good even if I don't feel it. Thanks for the information.",
      "MessageIndex": 515,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 14, 2014 04:48AM She-Angel wrote: OMG....that happened from adjusting your pillow! Now I am really worried about getting back to my 'pole fitness' classes. I can feel it, but it doesn't appear to be too far out but who can tell. I will try to remain relatively docile on the workout front for two weeks to get adjusted. I wanted to work out tonight but thought I better save some energy for round 2 tomorrow. I am hoping all goes well with this Port. Positive prayer and energy for us all.",
      "MessageIndex": 552,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 15, 2014 01:04AM She-Angel wrote: Tks Leto baking soda it is. I know baking soda has a lot of uses, never knew about that one. Just bought a new box yesterday for something totally different. Looking it up now.",
      "MessageIndex": 565,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 20, 2014 08:51PM She-Angel wrote: llovecoasters, What is a chemo class? Maybe I need to take this. The nutritionist did say I should avoid soy and refined sugars and gave me a list of things that would help me not feel sick. Every thing on that list except apples and grits make me feel sick so the list is in a folder. I know we all have different things going on so different regiments call for more extreme measures I am sure to avoid complications.  There is a real sad face nurse who advocates for the BC patients where I am at who comes in to help break down what the doctors say. When I asked my MO what could I eat he said I am not restricting you right now, then I said can I still teach pole fitness he said if you feel up to it you can do what your body tells you. After he left the sad face nurse came back in and said, \"you may want to take a break from the pole for awhile, it's probably not good for you to be flipping around\".  I had to laugh. I don't over do it, but I still teach part time. I have my next treatment 12/1 too and look forward to hearing back from you as to if they lift some of your restrictions.",
      "MessageIndex": 592,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 25, 2014 07:18PM She-Angel wrote: ml143333, I am not tired most of the time but it comes on me from no where. I carried four bags of groceries up the four steps in the garage on Saturday and you would have thought I had completed a marathon, my breathing was even heavy. I just closed my door and took a 30 minute nap for my hour lunch (lol). I have a love seat in my office that is becoming very handy here lately. I printed off my blood count results from the last two infusions, I look at lab reports for autopsy anyway so I felt why not go over the numbers. The hemoglobin looks a little off but about normal since I have been anemic forever.",
      "MessageIndex": 632,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 3, 2014 01:30AM She-Angel wrote: Hi Group, I have missed checking in and had to look at all the posts I have missed. It seems we have run the gambit on emotions and physical issues since before Thanksgiving, but that is to be expected. I am glad I got to enjoy all the food I wanted this time, I think it was more of I savored every bite this time instead of just stuffing myself. I only ate what I wanted, which was mostly starches. Today is my birthday and I am one day post #3 infusion which is usually and okay day it just with the anti nausea medicine I am so slow an sleepy. If I sit still I am out, and having to sit up 2 hours after I take it makes it hard to nap like I want but if I lay down I find I start coughing and wake myself up as if something is stuck in my throat. I also noticed yesterday during the infusion I was starting to cough a lot, not sure if it was the port or not but I finally got it under control and it went a bit faster, although I have decided I like early morning. Too many sour puss faces late afternoon. I had a 76 year old man come up to me when he was done and say \"you are the happiest face I see in here smiling, nodding at people and listening to your music while filling out Christmas cards, what a treat\". I have folks sending me gift certificates for the spa and fixing me meals and dropping them off. I don't even know if I can use the gift certificate now with the treatments and just between us, not everyone is a good cook but I don't know how to tell folks not to do. I know they just want o feel helpful anyway they can and I just try to remember that just because I am fine without all the fuss and hoop la, they may not be and that's why they keep doing. I have my consultation with the plastic surgeon tomorrow morning so one more doc to add the list of many that I now see. When the nurse was taking my blood yesterday she was saying it's rare to run across someone as healthy as me no health issues, no medications, etc. and I broke out laughing. I told her I use to be as healthy as a bowl of grits, now I tote around a black book with all my meds, doctor information, appointments and business cards for all the people I see to mention some of the diagrams the doctors have written out that is the size of a phone book (for those of you who remember a phone book). I feel anything but healthy knowing they are pumping poison into my body on a regular basis and my body knows and doesn't like it, and knowing that eventually we are cutting it out. The MO came in and checked me out and could no longer feel the lump an asked me had I felt it in two weeks, another bout of laughter from me as I pointed out to him I never felt it the first time, my husband did. So I guess the chemo is working to shrink it and may even make it non existent. I shall keep you all posted, one more round of this on December 12th, then on to the next 8 weeks of the journey. I think I may have been a bit ambitious wanting to participate in the Pole Competition in June, but we all have to look ahead at something. Better days are coming. My work partner sent me \"Dear God, They say It's Caner a companion guide for women on the breast cancer journey\" by Janet Thompson has anyone else read it?",
      "MessageIndex": 649,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 19, 2014 07:33PM She-Angel wrote: Does anyone else get up a dozen times a night to go to the bathroom? It doesn't matter if I drink after 9 pm or not. I am up about every 45 minutes, and then I get these hot flashes that start at my head and just engulf me when I am sleeping. My poor husband is huddled under the electric blanket about to freeze while I have the ceiling fan going and covers thrown all over the bed. This has become a nightly ritual. Along with that I have a rash around my port,  and a small wire protruding from my neck in which the online nurse believes is a suture that has come through. Since none of it seems life threatening we will address it on Jan 2nd at my next doctors appointment. We will count it all good and keep pressing forward. I hope everyone is doing and feeling well and get a little reprieve for the holidays with good health. It's not how we would have planned it, but it's still good. ",
      "MessageIndex": 701,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 1, 2015 05:58PM She-Angel wrote: Happy New Year. Leaving 2014 in the rearview and pushing ahead to 2015. Ready to get the next phase of this started tomorrow.......hello Taxol are you ready for She? Enjoy the day!",
      "MessageIndex": 755,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 5, 2015 06:21PM She-Angel wrote: llovecoasters, no hair growth on my head just stuble, but I swear it seems like the top of my thighs might be getting some however that might be because I had a 3 week break before I started this second round. I noticed my eyebrows are very thin and appear to be getting thinner and considering I had to get them done before to keep from looking like a bush woman its kind of funny. As for the soy products, I had a nutritionist before this and when I told her about the bc and asked about food restrictions she did say to stay away from soy. Chinese is my favorite and I love sushi, but I have made small adjustments to have things prepared without but its more of a pain going out so I have fired up the wok and bamboo steamer at the house to take the edge off. Leto, I have found that a cup of coffee every morning, along with a bran cereal with extra fruit in it seems to keep me from having the stomach issues, but if I miss it like over the weekend it comes back with a vengeance. I am not a big coffee drinker but now that have found something that works with movement I will keep at it. How are folks doing with hot flashes, I am a minute away from stripping naked about every 30 minutes it use to be more at night, now its on and off all day.",
      "MessageIndex": 771,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 28, 2015 04:36AM She-Angel wrote: Leto, great news on that last treatment, you go girl. My first treatment of Taxol had the fingers and feet numb but since then nothing. I have super dry hands and feet. I have been using Aquaphor also for diaper rash its like Vaseline to the 4th power. I also will be seeing what the topic recommendations are for surgery since mine is coming up in March. I got a letter yesterday from my surgeon advising that at the end of March she would be leaving the practice. That's 2 weeks after she works on me. I am not sure if I feel some kind of way about it or not.",
      "MessageIndex": 839,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Feb 1, 2015 04:48PM She-Angel wrote: There is no bell to ring at my center but that's OK because I know I would not ring it. Not because it doesn't deserve to be marked but because I do see the folks who won't have that opportunity, some older and many younger than me. I will mark the occasion though I have been thinking about hitting the trampoline bounce house just to flip out a bit. Lol We think maybe 3 more treatments. Yay!",
      "MessageIndex": 855,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 2, 2015 01:35PM She-Angel wrote: Hi Ladies, catching up on the threads while awaiting the start of a conference I am attending at Sunset Beach, NC. I have time between registration and was looking forward to getting in the thread. I actually did look up the \"Casting for Recovery\" program in this area the location is breath taking but I would have to be sedated for the drive, it is real mountain driving which I am a wreck driving nerves just shot. I remember the MO saying it would take about a month to get the meds out but my fingernails hurt so bad. I can't button anything and opening a can of beverage is impossible. Saturday I had my medical massage and I was so tired afterwards I had to go home and take a nap. It was like the switch was turned off. The same thing happened yesterday. I had a 3 hour drive and by the time I got here I could barely text the honey that I made it safely before I had to lay down....it was 2:30 in the afternoon. I am suppose to be getting stronger not weaker, what gives? It is so good to read about the continuous movement forward at our various stages. Today I actually saw a couple of eye lashes that I could put mascare on..its the little things. Lol",
      "MessageIndex": 909,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 17, 2015 01:04PM She-Angel wrote: llovecoasters, there is no time to give in and throw in the towel, you have come too far and you still have some traveling to go. You have people who are looking at you. Refocus and repurpose what you need to do, write it down and get on it because there have been some good suggestions thrown out there. Not only will it get you moving on it, it will take your mind off the 10,000 other things going on with the cancer that can seem to consume your world.  If you can, pray on the matter the battles that we see are never truly ours and if you can't, know that there are others who will keep you lifted up in their prayers",
      "MessageIndex": 936,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 18, 2015 03:09AM She-Angel wrote: Leto, that is a lot to be caught up on an a lot for you to be dealing with. I am in awe of the positivity that comes through with your report. I will continue to keep you in my prayers and you continue to press forward, it will get better and because you know this it makes your battle easier than those who don't realize that. If it wasn't for the rain we could not truly appreciate the sunshine. Kisses, hugs and much love.",
      "MessageIndex": 938,
      "PostDate": "18/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 4, 2014 09:08PM She-Angel wrote: First full day back at work, I seem better in the morning than I am in the afternoon. I have a slight head ache, am achy all over and my stomach feels iffy. I remember something about the shot in my arm would cause my bones to be sore so to take the Claritin for five days, which I did. I didn't notice that till last night. I have been sipping gingerale on and off today. I notice  this feeling  tends to get worse if I get over heated or cold. Tomorrow should make for an interesting day since I have to spend the first half of the day on the firing range in full gear which can go either way as far as hot and cold. I suspect I will have a 'airplane bag' in my pocket just in case I feel I am starting to lose it.",
      "MessageIndex": 472,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 11, 2014 07:38PM She-Angel wrote: Got the Port put in yesterday, didn't realize they were going to bandage me up halfway up my neck. Needless to say I am sitting in my office with a scarf on and its 70 degrees outside today, but if it keeps me from spending another 6 hours in infusion on Friday it is so worth it. I been reading posts from other folks and looking at pictures of ports and I think I have freaked myself out sufficiently so  I will have to wait and see how it goes. I feel a bit sore so I am not sure what to expect now. ",
      "MessageIndex": 516,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 11, 2014 09:42PM She-Angel wrote: ml143333, I have a BARD too. Thanks for the info, I thought it was just me feeling weird with this side neck thing. I am trying not to look weird looking to the right. Like you said not unbearable but I do know its there....I will keep two weeks in my head to feel somewhat normal again. I remind myself everyday its the destination not the journey on this but jeez....it seems like something different every day",
      "MessageIndex": 520,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 14, 2014 10:12PM She-Angel wrote: Round 2 is done with just a slight headache. That \"red devil\" is an interesting mix. I got clumps of hair coming out here and there, glad to be shaving it tomorrow. Although the red when I go to the bathroom is still a mind blower. Got to say the port is a game changer, glad I got it and will pray I have no problems. It cut out my time by an hr and some change from the last infusion. So the doc says I have 4 weeks with the AC, then 6 weeks of taxol and should be finishing up between 14 -18 weeks from now pending how I do. Then a month to let the body do its thing, then surgery. I say that to get it out so I can see there is a light at the end of the tunnel. Because my next treatment would be the Friday after Thanksgiving and the offices are closed the following Monday December 1st the day before my bday. And I was wondering what to do this year.lol They want me to start taking laxatives which I really don't want to but I know I need to. Any natural remedies folks trying that are working? I eat prunes, have apple and raisins in my oatmeal, sprinkle Metamucil on food....I even had a milkshake and being lactose intolerant you would think it would work. Happy Friday! ",
      "MessageIndex": 563,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 18, 2014 05:33PM She-Angel wrote: I am so sore, just poking myself in the arm hurts, it's almost funny. I hate not being able to get a massage. Yesterday during my lunch break I think I dozed off at my desk I didn't even realize I was that tired but that little 30 minute power nap revived me for the rest of the day. Everything taste funny, people keep dropping by the house bringing food that I can't really taste unless its over seasoned. I know they are doing what they can so I don't want to say stop, and at least my husband gets to try new things. Since I am still mobile and able to cook I find it a bit strange to have people sending food or bringing food. Maybe after surgery it would make more sense. My stomach was not feeling good, just blah heavy and off kilter not to make me nauseous but icky I finally decided to just eat like I normally do with bad stuff when my stomach feels like crap and I actually feel better than I have since I started this. I just had lunch at my desk which consisted of grits, eggs, bacon and cheese and for the first time in 2 weeks no heart burn and no indigestion...who knew my body craves grease. I hope everyone is finding some silver lining out of all this chaos, I know some days are harder than others. My goal today....at least a 30 minute workout.",
      "MessageIndex": 577,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 21, 2014 06:26PM She-Angel wrote: Hi Sophie14, this board has been like a Godsend for me. I got the news the end of September and that day I felt like I was gut punched when I walked out of the surgeons office after the bombarded my husband and I with so much information I couldn't see straight. I walked into the bathroom came back out and met him in the hallway and fell apart for all of 5 minutes, we just cried and held each other, after that I went to O'Charleys and had 4 straight whiskey shots and went and told my family. It took a few weeks but the calm set in, my husband and I have been growing our faith for some time now and once I realized that this is a test to strengthen it all the worry went away along with the anxiety. I spend more time trying to calm the worry of my mother and younger sisters who want me to just sit and do nothing. I have always been a planner and this was not in my plan so it has been an adjustment and those days when my energy level is not turbo like it usually is it frustrates me and the emotions are all over the board. I have always been curvy with great hair, now the things that I thought were me are being adjusted, the hair is gone, the boobs are soon to be gone and replaced it's not anything that I thought, but I guess it is to be what it is suppose to be. We just keep living, my husband and I are both in law enforcement so there are rotating shifts and call outs and trying to work some to conserve some of your sick days for when you really need them is a task but he has been at all my appointments even when he is coming off night shift. The last time he was asleep in the uncomfortable chair while I was crocheting getting my cocktail, he just wants to be there and even though I tell him I am fine to drive myself which I am and have done he insists. I know it makes him feel good and he says if he could take it away he would, but I know even if I could give it to him I would not. My chemo bag has my favorite blanket made for me by a friend, one of my pillows, crosswords, and my crochet I also have my tunes and where I go has tvs so I watch that to. I even took a little nap the first time with my ear buds in. I like to have shoes in which I can slide in and out of so I can get comfy when I let the chair back. It is a journey but so many have made it and been able to testify to it and we will too. When you feel overwhelm remember we are all here for one another.",
      "MessageIndex": 605,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 26, 2014 07:11PM She-Angel wrote: Happy day before Turkey Day everyone. Work is a ghost town and all is quiet in the city, if it was not for the fact that I am sucking up all my sick time and vacation time with treatments I would have taken it off too. I did make it to the studio last night for a workout. I was a little tired when I got there but once I started moving I felt so much better, I soaked in Epson salt and jumped up my regular time this morning for prayer and reading but I do feel a bit tired and my eyes feel dry but look watery.  I think I will try the tear stuff to see if it makes a difference. Normally I stay around the house for Thanksgiving if my husband is on  shift and just have Chinese food and watch movies but my mom seemed adament that I drive the 20 minutes to her house this year for what our family considers to be a gathering. We are such a hodge podge, family members just comes and go throughout the day fixing a plate from the buffet she sets out so it's not like we all sit down together and eat. I figured since she seems to be worried that I am not eating, I should make an appearance so she and my sisters can see that I am doing fine and looking well. I got on the scale this morning and have gained 5 pounds in two weeks, I see why the greasy food keeps me from being nauseated, it doesn't go anywhere its just sitting around making me fat. :-) But I will happily take that over being nauseated and sick so I am thankful for that and thankful for having stumbled upon this discussion board. When I was given the news and went online looking at everything I could find I was so lost. I would come to the site everyday reading what people were saying and doing afraid to join in because it would make it too real. I thought if I kept it to myself it would be so much easier, I am so glad I finally said something. Its so much easier talking with people who have an understanding of what is going on. \"..all things work together for good to those who love God..\"Romans 8:28",
      "MessageIndex": 637,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Feb 23, 2015 06:30PM She-Angel wrote: Thanks so much for all the well wishes for completing chemo, and well wishes for those of you soon to complete yourself and move on to the next step. I had a make up date for the look good feel better last Tuesday but the snow came and it was cancelled again so I think that is devine intervention saying I don't need to worry with it. I envy those who did not lose their hair because except for the hair on my forearms I got nothing. Slick as a baby...everywhere. I suspect my hair is going to come back white but oh well I know how to color and will be glad when I can return to my stylist with hair. As I read some of the threads,  i think we do need to mark all occasions as we know not what tomorrow brings. Bills are always going to be there so if you get a moment and can take a little time to enjoy a little vacation, go for it. Between the cancer and the school loans on paper I should never go anywhere ever again, I will be in Atlanta in June for a mini vacation and I will be in Miami in September for a longer vacation. Life is too short so sweat the things that make us anxious.  ",
      "MessageIndex": 891,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 11, 2015 06:24PM She-Angel wrote: Hi group, just a quick check in from work. My fingernails are still super sensitive and hurt but are still hanging in there. :-) No sign of any real hair yet and Friday will make three weeks since the last chemo treatment. I did get a few more eyelashes though. :-) Surgery in 8 days, ready to get it done and move forward. My hope is for everyone to be experiencing some type of rest between treatment where they are not having severe side effects.",
      "MessageIndex": 921,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 24, 2014 02:52AM She-Angel wrote: Nottoday I loved the poem! I have been taking the Prilosec more consistently and that seems to be helping. The rash appears to be drying up and I snipped the suture myself in my neck. They can look at everything when I go in is my thought. I am a bit apprehensive after reading some of the posts as I start the Taxol January 2 and I will be doing it every Friday for 8 weeks. I hear its suppose to be easier, but I am not convinced that will be the case now. It takes me a week to get my stomach back right and now I won't have that. Having this long break between chemo has made me feel almost normal.I got my nails done two weeks ago and got them done again today because they had grown out so much,energy level is good, stomach is finally normal just I'm time for Christmas. Then back at it. Redporchlady- I would have hot flashes before but not like this. It's like I go super nova from head to toe then am soaked, then 5 minutes later freezing. Its crazy. Leto- I hope your SE diminish as I watch how it seems to effect you as we seem to be taking some of the thing Cherice I will be thinking of you and got you I'm my prayers for an easy day tomorrow and afterwards Merry Christmas, get some rest and stay positive folks.",
      "MessageIndex": 715,
      "PostDate": "24/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 20, 2015 06:18PM She-Angel wrote: llovecoasters, I am sorry to hear that your Look Good Feel Better session was a bust. Sounds like they had to get a stand in for the holiday and she didn't know what to do. I have my session tonight at 6 an am still looking forward to it. I have tried for two months to get in and they are always full. I finally called the hotline before Christmas and they said they would get me in the next available one if I could wait until after the holidays. I will let you know how it goes. I read something this morning that reminded me to count it all good, so whatever happens I will. So far I have seen a beautiful sunrise, hit a deer on the way to work, went for a walk on my fitness break and was extremely winded and have a pile of work on my desk. It's a good day!",
      "MessageIndex": 822,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 26, 2015 01:43AM She-Angel wrote: How about I got off work early on Tuesday to make the Look Good Feel Better class after hitting that deer, the car was drivable but the check engine light came on, so I swung by my house traded cars and kept going. It put me in peek rush hour traffic, and my husbands car did not have as much gas as I thought but I made it to the location with a few minutes to spare. I go in and find out the class was cancelled because the facilitator had the flu and they had been trying to call people all day to reschedule, of course I did not get a call. As I left the gas light came on in the car, it was just too funny. I may try to go again but that was such a let down after I had been looking forward to it, I don't know if I want to wait an entire month again to see what happens, not to mention I need some eyebrow help now. So youtube here I come. I did notice during my infusion session Friday they had the email address for the person setting up the classes so I may send her an email to see if February is full yet.",
      "MessageIndex": 830,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 29, 2015 04:06AM She-Angel wrote: Way to go Leto!!! Keep us posted. I too am glad that my surgery is after the chemo as I get a break before it happens and I can focus on things besides indigestion, black fingernails,no hair and thinning eyebrows. Love the photo!!!",
      "MessageIndex": 846,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 5, 2015 01:28AM She-Angel wrote: LMBO, night sweats gone, no way. I have been having flashes even worse and Friday will make two weeks since the last treatment and I am still only sleeping 3 1/2 hours. I find that one Tylenol pm and a light toddie with a squirt of adult beverage gives me a full 5 hours. I tried not doing it that way last night just the toddie no pill, I was up in 2 hours and tossed and turned all night which made for a trying day since I had a 3 1/2 hour drive back from the conference. I have a little peach fuzz on the back of my head, the wild thing is that at night when I have those flashes my head becomes super hot, the pillow even gets hot. I feel like Drew Barrymore in Firestarter. I was having a meeting with my partner when I got back to work today and I swear in the span of 20 mins I took off and put on my sweater 5 times just because I would go hot, cold, hot, cold, hot, cold. Last week I went in my office dead bolted the door and laid on the sofa in my underwear until I stopped sweating. I feel like I am about to jump out my own skin. I know it will pass as will the sore fingers but when you are going through it you just want to scream. Now I am reading about the scans, and us triple negatives are more prone to getting them? I wonder if that is if you are getting radiation. Since the 5 lymph nodes they took were clear although clearly in distress and I am having a double mastectomy the MO said no radiation needed especially with the tumor completely going away feeling the chemo would take care of the rest. I will be doing some additional research, as always reading the posts are always informative.",
      "MessageIndex": 919,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 21, 2015 03:13PM She-Angel wrote: Remember when we are feeling less than what we could...\"if he brings us to, he will bring us through\" and that's all you need to know. I will keep up the prayers.",
      "MessageIndex": 945,
      "PostDate": "21/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 4, 2014 09:19PM She-Angel wrote: Leto- I normally have low blood pressure but after reading your post I am wondering is it too low and is that why I am having these head aches and mild dizziness. I remember they gave me a packet with the Neulasta information but I was kind of freaked out about the possible side effects and was still wrapping my mind around getting a port in the next few days to read with any comprehension. I will revisit my info when I get to the house. I am so overloaded with information, I look to the posts to help me weed through some of the stuff. Keep posting, this is helping me so much more than reading clinical trial information.",
      "MessageIndex": 473,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 12, 2014 12:59AM She-Angel wrote: Welcome Eleanor53, I am relatively new to the site too but have found it a valuable resource. They are right everyone reacts differently to treatment. I have been working still and am a crime scene investigator, I actually had to do the police fitness test the day after they told me I had cancer, and I had to shoot for certification a week after they took 5 lymph nodes out of my left armpit. It has been a bit uncomfortable at times and when I get too hot I tend to feel nauseous but for the most part other than being constipated and a bit dizzy I have been getting through. The ever constant headaches after the infusion were a bit much, I found that I was trying to tough it out but when they have such great medicines there is no need to be in pain when you don't have to be. I have tons of information on natural herbal remedies that a friends mother who went through this years ago used and sent to me and I have a great oncologist. I am willing to try the herbs in conjunction at this point but not as the treatment. I think it is good to have as much information as possible to decide what is best for you. The type of cancer I have responds best to chemo, that is why I went with it. Advances in medicine have made things better and more effective but then again I am looking at treatments until March. For the amount a treatments you are looking at there may be a better option, keep focusing on what you need to do for you and what gives you peace of mind.  ",
      "MessageIndex": 523,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 13, 2014 03:13AM She-Angel wrote: Just ordered the magic berry  off amazon after hearing good things from a friend....it should arrive on infusion day...yippie!!",
      "MessageIndex": 538,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 25, 2014 06:24PM She-Angel wrote: Beth, day 11 seems to be the day for me too. Both times so far the indigestion sets in really awful, my esophagus and stomach burn and feel like crap. The doc said Prilosec 2x a day but I feel weird taking it when I am fine and by the time it sets in it does nothing. I went back and tracked it in my diary and it was the same time, the aloe vera juice does help. It's weird, I can be eating something totally non abrasive and I start to feel bloated and about an hour later the tummy is unhappy. Has anyone else's nails started turning dark. It is starting with my thumbs and I am not sure if its going to be all my fingers or not. I know two people at church whose nails turned black one was a guy so he didn't care. I am trying to decide to paint them or just cut them down and put on some tips until all of this is over. Any suggestions?  ",
      "MessageIndex": 631,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 25, 2014 08:20PM She-Angel wrote: nottoday, congrats on that new grandbaby!!! Cherise, you look great, love the buzz cut as well as the sassy bob, I wish I could get my eyebrows to look that good!",
      "MessageIndex": 633,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 16, 2014 07:15PM She-Angel wrote: llovecoasters, do not be disheartened, doctors look at the numbers and percentages in their field because of the science but science does not account for it all. Think of 25% as a number given out not a determinant of what is to be, just keep living everyday. I pray that your appetite and tummy are kinder so that you will stop losing weight, as I seem to be going in the other direction with my stomach issues and weight I can only assume at some point it all evens out. At this point I would love to sit here at my desk without burping every 5 seconds to a burning throat which feels like I have a tree trunk in it, but I know this too shall pass. In a year from now these will be conversations that we use to have and it will be something different. Focus on the destination and not so much the journey, we are getting there.",
      "MessageIndex": 695,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 17, 2014 05:56PM She-Angel wrote: Mandy, if you can get in a power nap it does help even if its just 30 minutes. I have gone out to the car for a break once or twice in the pass few weeks. When I get home in the evening I also sit down and do nothing, even if I don't sleep I rest, and I have no problem with going right to bed some days when I walk through the door. I was awake at 3 the pass few mornings but I felt rested when I came in to work. **I see that the deal with Prilosec is that I need to be consistent, see I thought if I didn't feel bad no need to take the meds so I see where I am falling short. I am letting it get ahead of me and control things. With my absent mind here lately I will set my alarm to take it twice a day. Thanks for the tip.**",
      "MessageIndex": 700,
      "PostDate": "17/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 3, 2015 04:32AM She-Angel wrote: First day of the Taxol. I didn't realize I was getting a large double dose of Benadryl before. I felt like I had been drinking and very sleepy, luckily it wore off in about 40 minutes. I did come home and crash could not even get up for a evening yoga class. I feel I could push it if need be but I also feel I could sleep for hours. This every week is going to be interesting.  ",
      "MessageIndex": 761,
      "PostDate": "03/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Feb 21, 2015 05:17PM She-Angel wrote: Yesterday was my last infusion yippie. I got a certificate with my name on it from the Treatment Team with all their signatures and best wishes. Now time for surgery in a few weeks. I feel tired more but I am pushing through, but it is what it is. We will get through this, God loves us he has not forgotten us and is constantly with us.",
      "MessageIndex": 880,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Oct 27, 2014 12:56PM She-Angel wrote: Hi I am new to the website. I got my diagnosis of Triple Negative Breast Cancer 9/30/2014 and had to complete a mandatory physical assessment for work the next day that I blew out the water. Since then it seemed like I have been in a confused state of: \"what is everyone waiting for get this crap out of me since then\", but now that lymph node testing is done and biopsies of other areas things are progressing. My first chemo session is on Friday and that is when I find out what my cocktail will be. As this type of cancer responds very well to chemo I will have the surgery after I am done then radiation. I love my oncologist, he is smart, funny and tells me like it is without making me feel sick. When I asked could I shave my arms and legs, he said yes however you will lose the hair there so you don't need to. I wanted to know when would I lose my head hair. He was not evasive he said Day 16 is when hair starts to fall out, since I wear wigs sometimes to switch it up I have plenty. I have just never worn one with no hair. So while everyone else is gearing up for trick or treat I will be in the \"infusion room\" getting drugs.",
      "MessageIndex": 376,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 4, 2014 12:05AM - edited Nov 4, 2014 12:05AM by She-Angel",
      "MessageIndex": 453,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Nov 20, 2014 03:58AM She-Angel wrote: Avoiding crowds and public places does not mean to sit home isolated. You can go for walks and you can have visitors that are not 'sick' life is still going on and you are still part of it. I hate crowds anyway and that is really part of my job but with this I have taken a less active roll with the public. I have all these little projects that I wanted to do so I have been kind of setting them aside like doing a shadow box, to dyi around the house and crocheting and knitting. I have yet to actually get a walk in but I have it on the docket for my next bit of time off. I am trying to save up some stuff for after surgery when I know I will be a real pill to deal with. Just 3 days at the house and I am looking out the front window like a cat ready to make a break for it. Be prayerful, be safe and be you, everything else will work itself out. We do have somewhat of an immune system even with the stuff they are constantly shoveling in us, our bodies were truly designed to help us fight against things that harm us it's just over the years the things that can harm became an overwhelming number. I am actually contemplating skydiving for my birthday in two weeks....can't wait to hear what the doc says about that!",
      "MessageIndex": 585,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 3, 2014 10:19PM She-Angel wrote: So I saw the plastic surgeon today to get an idea of what we are doing. A very personable man who said the #1 goal is to be cancer free, then on to what my expectations are. I just want to feel and look natural in my clothes and if we can do that from a DD to a full C, then I could be OK. Now it seems I will be going through the summer months and he already said no pole for 2-3 months after and my kind of workouts also will be a no go, but I can walk and they will give me arm exercises...oh and no swimming. I really will be like a bird with clipped wings. Good thing the police agility test is not till the end of September I should be able to lift the 150lb dummy by then. I know I am tired but it's hard to give in to it sometimes, I think if I don't see how far I can go. I may never know I can go that far. But I am learning to pace myself. Happy hump day, back to work for me tomorrow. If you see me posting at lunch time I am fading.lol",
      "MessageIndex": 658,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 8, 2014 07:39PM She-Angel wrote: llovecoasters, you are not the unlucky one, you have a lot going on but do not be discouraged and do not give up the fight. Your husband may be exhausted and your son is having a time, but they are doing the best they can because you struggle and there is nothing they can do to take that from you. The bills are mounting, let them mount they can't get blood out of a turnip, the #1 thing is that you get better, you have people that are depending on you to get better to be there to talk to, to console to laugh. There are services out there that can help with cost, I know its hard for you without a family support system nearby but enlist your local Christian charity groups. My doctors office had payment plans for financial issues and as they told me, it will get paid one way or the other. There is always more than one way to skin a cat, it may take a bit of time and a lot of emails and phone calls but it's easier when you are at home. When you feel like crap it is easy to say I am tired and I want to be done, but this is not your fight. God fights for us all, he wants us all to be drawn closer to him and although we may never understand why this befell upon us there is a reason for it. There is someone watching and listening and taking what we say as the law because it's all they have to hold on to because they are going through the same things except they are signed on like I was and afraid to engage. We are helping and supporting more than just the one's who post a reply. There are days when I am exhausted, depressed and it hurts to touch me but I refuse to let the enemy make me think I am ready to give up. I dreamed the other night that I was Wonder Woman, the strangest dream in a while but I took that to mean I am stronger than I think and got up with a bit of renewed energy...for all of 4 hours before I needed a nap. There was a moment that I thought it would be easier to walk out in the surf and let the water engulf me when I first found out that I had this thing growing in me. I stood on that beach for a long time, my husband had gone to the store and I had no one keeping a watch over me it just seemed so easy but as I watched the water and it continued to mesmerize and relax me as it always does I had this total since of calm and peace and I heard in my head \"calm your mind and turn your worries over to me, I am here and have been here all along\" that was my turning point with worrying about the things with this. I still get anxious moments here and there when I get denial of claims from my insurance or when I see another letter coming in, but I can't worry with that and won't as I remind myself it's going to work itself out with our without me. As my husband says there is nothing else until I am better he could give a hoot about what is stacking up. I will continue to pray that you see a movement soon that restores your sense of balance physically, mentally and emotionally. \"Come to me all who labor and are heavy laden, and I will give your rest. Take my yoke upon you and learn from me, for I am gentle and lowly in heart and you will find rest for your souls for my yoke is easy and my burden is light\" Matthew 11:28-30 \"Have I not commanded you? Be strong and courageous. Do not be frightened, and do not be dismayed for the Lord your God is with you wherever you go.\" Joshua 1:9  ",
      "MessageIndex": 678,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Dec 30, 2014 12:48AM She-Angel wrote: Just checking in to catch up on the posts and see how everyone fared through the holidays. I am anxious to get started with treatment on Friday so I can get through this cycle, reading about some of the SE's folks have had make me a bit apprehensive, but  I will remain positive that this too shall pass. Looking forward to a New Year and a new me at some point during this new year. Congratulations to all those who have completed their treatments, gives me hope.",
      "MessageIndex": 748,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 8, 2015 07:09PM She-Angel wrote: Hey I managed to sleep in PJ's last night, of course it was 7 degrees outside and I did break a sweat at 3:30 but that's a start. I have number 6 treatment tomorrow so from what I see from the taxol, the SE's last all week and then I get another treatment. Becca it is good to see the humor in this, I know I do. Some of these posts have kept me sane these pass few months since getting on this merry-go-round that I didn't know I was going to ride. Sjacobs146, I hear you about the taste, the last treatments took them away but remember this too shall pass. Now I have super smell and can taste again, but last night at the Italian restaurant someone fish dish from another part of the restaurant sent me gagging to the restroom. Tomorrow will be interesting since I was told to tell the nurse that the bandage they put over my port makes me nauseous because it smells very antiseptic. I was told by the other nurse last week they can cover it with tape and gauze and not use it if it bothers me. I hate to be a bother when I go in, I just sit and go with the flow but since I would hate to lose my breakfast I think I better say something. On a lighter note I finally got into one of those Look Good Feel Better sessions that are always full around here. I actually called the 1-800 number the first of December because the one's here were booked for the past 2 months and they said that someone from the center would call me in January to ensure I got into a class. So January 20th I am there at 6pm, such good timing since I have bags under my eyes, my skin is super dry, and my eyebrows are fading into my face. Putting on powder, swiping on mascara, and lip balm is all I know how to do, drawing in eyebrows is way too advanced for me. They even help with wig styling so I am a bit excited. My wigs are super easy with a bit of frutese in a spray bottle with water I spray and style but then again I style it the same way so some variety would be nice. I have five different versions of the one I wear in case I want to change it up a little on the weekend, my husband says walking in the closet and seeing all the mannequin heads fully made up with wigs on them does take some getting use to. lol  ",
      "MessageIndex": 789,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 15, 2015 08:09PM She-Angel wrote: Hi Group, finally got a moment to play catch up. It seems to have been one of those weeks, then we had ice on Wednesday that caused all kinds of chaos. I taught a lap dance class Tuesday night at 8:30pm an although I made it through the class I had a hot flash that drenched me down to the skin, when I got home my legs and arms were so fatigued I could barely lift them. I woke up with the worse headache, called out sick and slept in all day got up at 5pm yesterday had my husband take me out for Thai came back home and went back to sleep until this morning at 5:45 when I got up to pray and read....and I still feel tired. I have never slept that long. I know they said I would be tired, but I just assume just tired not exhausted. I guess it is time to cut back a bit, but I am already only teaching about every other week and just feel like with the steroids I am becoming so heavy. The doctors office called Tuesday to say they have scheduled surgery for March 19th pending no issues with the remainder of my chemo. I think I should feel relieved but I just feel like it's another thing that I will have to recover from. Anyway tomorrow is treatment #7 more than half way done, I should be feeling excited. I will let you know when I get the excitement. lol Have a good weekend ladies, we deserve it.",
      "MessageIndex": 803,
      "PostDate": "15/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Jan 17, 2015 03:04PM She-Angel wrote: After treatment yesterday slept from 3pm-11pm got up took a shower and went back to sleep till 7am. I couldn't make myself get up which was just weird. I have never felt that, just thankful to be able to rest and be up today. I know we all have different SE that range from mild to severe but don't let them dishearten you...this too will pass. We have so many who can testify to this.",
      "MessageIndex": 811,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "She-Angel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206268/profile",
      "Content": "Mar 4, 2015 02:49AM She-Angel wrote: Sjacobs, sorry to hear about the fingernails. Can they adjust your meds? Mine did not fall off however they all turned black, and are still black hence why I keep them painted right now. They are super sensitive and hurt, I can' t button clothes or hook jewelry. A friend advised hers fell off and they changed her meds. It can't hurt to ask the oncologist,they have made such strides with the meds now. If nothing else you can opt for the Michael Jackson look and tape up all the tips, just put a bandaid on before to pad the fingers. I think he said it was an Asian good luck thing, but mayhaps he was having a health issue too.",
      "MessageIndex": 914,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    }
  ]
}