{
  "AuthorID": "sheila77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
  "Posts": [
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 18, 2019 08:51PM sheila77 wrote: HI Ladies, I have not been experiencing constipation but I have been having stomach cramps with some diarrhea. The stomach cramps were the worst! I never felt like it was enough diarrhea to take Imodium. But yesterday, I started apple cider vinegar and then got some Kombucha. I'm not sure if you are suppose to drink Kombucha while on chemo, but I'll check with my MO. Does anyone know about this? After my surgery, I did experience constipation and I did use Phillips Milk of Magnesia - after trying ducolax, prunes, and everything else. That was the thing that worked. Since I am 8 days post my first treatment, I was considering cutting my hair. And so sorry that Jean and Lauren that you are on track with the hair loss. I think I will cut it in the next few days, just to have some control. I'm much better today than last week. Not sure what to do for that bone pain for next round. I know it does not last long, but it is quite painful. I'm not sure if my Claritin is working.... I did go to work today for four hours!!! I feel like that was an accomplishment! Hope everyone has a good week. Sorry so many are having SE's. They really suck.. But then - this too shall pass Hang in there warriors!",
      "MessageIndex": 187,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Jun 1, 2019 09:30AM sheila77 wrote: HI All, Just checking in. I got to RING the bell on May 16!! - What a feeling. I of course did not want to deal with my SE's following ringing the bell....it's really hard not to feel normal. I am looking forward to getting my port out on June 21! - I was planning on scheduling my second part of my reconstruction surgery for July - but instead, my husband and I are going on a cruise to celebrate that chemo is over!!!! But then I had to remind him that he will be going to the beach with a bald headed woman!! He just laughed and said - \"That's OK\"! He really does not seem to mind my temp new look! I know that I will have to reamin in the shade for the most part - but I just want a week with NO doctor appointments!! I have developed GERD!! - I'm currently on Nexium for that but the pain is pretty bad. I am hoping this is all chemo related and will go away soon. I still have difficulty drinking water!! How can water cause pain?? Hopefully the fatigue will diminish as well! Dawn - I do understand how you feel about not knowing all the details. I was told I just needed mastectomy followed by oral meds for 1-5 years. But then my onco score came back and it indicated that I had to have one round of chemo. It is what it is.... We adjust - we are strong - we are warriors!! I also understand about the drains - they are not fun. I came home with three. I never thought my husband could take care of me, but he was incredible! He emptied my drains and changed my dressings. (He was never able to handle anything medical with my kids or me before!). Thinking of all of you and praying for you often. Looking forward to next week since it will be three weeks post infusion and I should feel better. Hugs to all!!! - We are WARRIORS!!! - Sheila",
      "MessageIndex": 449,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Feb 23, 2019 07:47PM sheila77 wrote: Did you have to have chemo? Just starting this journey. thanks for sharing",
      "MessageIndex": 13,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869287",
      "Title": "Roll call - Oncotype Score, Length of Time and If Recurrence Sadlynew2018 Rwns"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 10, 2019 03:12PM sheila77 wrote: Happy Sunday All! Jean - I am so happy to hear that you are doing better! It will be good to have one under my belt as of tomorrow!! I will follow your advice and go walk tomorrow after I am done with Round 1! I started my steroids and Claritin today so I am sorta on the train.... LizzieAG - I actually went to a three year old bday party yesterday - I only stayed for a little while, but i did want to go see family. I think Friday night was just something that happens when I get anesthesia. You will probably be fine! Hope everyone had a wonderful weekend and got the rest that they needed. Sheila",
      "MessageIndex": 108,
      "PostDate": "10/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 5, 2019 10:06AM sheila77 wrote: Hi Gang, I will begin a TC protocol on March 11, my port placement is scheduled for Friday, March 8. I am stage one, had a left mastectomy with a SGAP reconstruction on Jan 13. I had 8 lymph nodes removed and all were negative, unfortunately my onco score came back at 33 so my my oncologist suggested the TC protocol. I am scheduled for four rounds every 3 weeks. Apparently on taxotere, it is common for the hair to fall out between days 14-18, so I will probably cut my hair short one week after my first infusion. I think I am ready to face this journey, but sometimes get overwhelmed by all of the suggestions of what I may need. After my surgery in January, I was convinced that breast cancer is not for WHIMPS!! We are strong women who will get through!! Wishing you all a positive experience!",
      "MessageIndex": 58,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 9, 2019 08:24AM sheila77 wrote: Good Morning all,  I had my port placement yesterday. The process went well but I am very sore today. I was not expecting this soreness. I will definitely get some rest today. So anyone waiting to get their port placement - Beware of the soreness and plan your schedule accordingly. My insurance denied Neulasta, but they will pay for Fulphila which is biosimilar to Neulasta. Hopefully it works. It would be nice if it does not cause the bone pain! I guess I will know on Tuesday. Hope everyone has a good weekend. Remember to get your rest! Hope everyone finds relief from the SE's. This is the part that concerns me the most (SE). I got up in the middle of the night (3;30ish) to let my yorkie out and had trouble getting back to bed. I almost passed out, which was scary. (I use to pass out often, so I know what to do). I think my blood pressure dropped - maybe from the meds given during the port placement. I eventually made it back to bed and my husband took care of me. It just seems so silly that the things that we do normally will take a different meaning of \"normal\" while we are going thru this process. We are warriors!! And this to shall pass! hugs to all",
      "MessageIndex": 104,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 26, 2019 08:47PM sheila77 wrote: HI I am on the TC protocol and had to shave my head today. My hair was falling out, so i just had my daughter buzz the remainder off. I have continued to work this week. But next week on Monday, I will have my second infusion, so I will only work on Tuesday. My days 3-5 were not good the first time around. I did have lots of mouth tenderness so I used warm salt water rinses. I also use a toothpaste from Young Living (Thieves) and I feel like it has helped with my sores. Stay rested and good luck with all the SE's. Sheila",
      "MessageIndex": 272,
      "PostDate": "26/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 31, 2019 11:28AM sheila77 wrote: Good Morning - Ghcpd- you sound like you responded to TC round 1 just like I did. I also have to take the Fulphila shot. I have round 2 -TC tomorrow and have blocked my calendar for days 3-5. I must say, this past week has been good. I did have to shave my head - but I'm doing better than I thought with that issue. I started on my steroids today so I will be proactive and take melatonin tonight, use lavender and cedarwood essential oils in my diffuser and anything else I can think of before bed tonight. I have stocked up on Kombucha for my stomach issues and will hopefully make a pot of soup today. Fallschurchgirl - I also think I scared the UPS guy when I had to sign for my Fulphia when it was delivered. I answered the door without anything on my head. I didn't realize it until he said - \"I hope you feel better\". I am going to try and rock this bald head!! It is what it is! I do have a wig, but it seems like I like my hats and wraps better. I just feel like an alien in my wig! Have a great Sunday! Get rest when needed! Sheila",
      "MessageIndex": 314,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Apr 11, 2019 05:58PM sheila77 wrote: Fallschurchgirl - hope your are doing well and things are working out with all your changes and reactions.... Please let us know how you are doing. I had Round 2 of TC last Thursday and it seemed to go better than last time. No complaints here!!! The bone pain was not as severe this time. I did have more abdominal cramping. I rested the weekend and made it to work on Tuesday! I have only been working 4-5 hours per day so it is manageable. I really work with a great group of women!! - Yesterday all the women put on these \"bald\" caps and/or put on a head scarf to support me in my baldness!! It was really cute. Of course it was the day that I wore my wig! I am really blessed to work with such a great group. They have been very flexible since I began this journey. Hope everyone is having a great week. Get your rest!! Take care of your self!! And do something fun! Sheila",
      "MessageIndex": 354,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "May 4, 2019 08:18PM sheila77 wrote: Hi all, I have been having a harder time bouncing back since my last infusion. I guess this stuff just builds up. But I am on the up swing. Jean - sorry you are hitting so many bumps on your journey. I know you can not take the Neulasta, but i am taking Fulphila - its bio similar. I guess you can't take that either?? I guess I should be thankful for that injection - I have been blaming on my side effects on that injection, but I need to be thankful since my wbc has been good. Hope everyone has a great Sunday - and you are able to taste the tacos for Cinco de Mayo!!! xoxo sheila",
      "MessageIndex": 402,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 7, 2019 08:06AM sheila77 wrote: Hi All, Hope everyone is having a good day! polyspider - you mentioned cording. I also had issues with cording. I am still going to Physical Therapy, but yesterday was the first day that I did not have cording. During PT the therapist would stretch something (it felt like she was squeezing something out) on my arm. I do feel like I have more mobility now and the pain has subsided. fallschurchgirl - hope you are doing well. I see that you are a week ahead of me with your TC protocol. Has your insomnia improved? I already use my essential oil diffuser with lavender and cedarwood to help me sleep when I go to bed with lots of things on my mind. So I will not be surprised if I also will experience this SE. sugarcactus and unbreakable- hope you are managing your SE.  I go for my port placement tomorrow, so it is getting real!! I hope to continue to use my essential oils to help with my anxiety, nausea and insomnia. And this to shall pass!",
      "MessageIndex": 75,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 14, 2019 10:58AM sheila77 wrote: Good Morning, Today is CD4 since my treatment on Monday. I must say, last night was the worst so far. The body aches, bone pain, headache were pretty intense. The nausea is better today - somewhat. I just took a hot bath to try to alleviate the body ache. I was also very fatigued yesterday which is still an issue today. I went for a short walk and was winded when I returned!! But I will attempt another walk today. Even with the pain that I am experiencing, I still feel like I should move...some. LizzieAG - good luck on your port placement. Ask for the numbing cream to put over the port before you have your infusion. Just take things slow at the teacher conference. Don't over do it! Rest when you can.",
      "MessageIndex": 140,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 21, 2019 10:33PM sheila77 wrote: Fallschurch - I think I will feel as you do when my hair falls out. I am cutting it short tomorrow, hopefully it will get me ready. But what can really get you ready for that?? - Shingles - sorry you have that too. It its not one thing its another.... pokyspider - so sorry you had such a bad first experience. I hope you are doing better with the SE's. dinabee - I also got my eyebrows microbladed. It was time for a touch up anyway. What are you taking the Vit B for? LizzieAG - sorry you are having such a hard time with the SE's. I used a THC tincture that also helped with my nausea. I prefer that over the Zofran. Sophie - sorry you are having such an issue with SE's. Rest when you can. I have a good week so far. The fatigue is even getting better. I do have a rash/skin irritation on my chest where they used tape for my port. Maybe I'll post a pic for my MO to ensure it is nothing. Hang in there - the bad days will get better.",
      "MessageIndex": 215,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Apr 1, 2019 08:32AM sheila77 wrote: Gratefulgrandma - I have a wig, but I don't feel comfortable when I wear it. I will still wear it, but I have now switched to scarves and hats. I was also thinking that I should go back to the wig shop and ask for a tutorial. You can also watch tutorials on you tube. Margun - I have lived a healthy life style with no health issues other than a low Vit D level. So I don't question why, I just look as this journey as a bump in the road. This too shall pass.... I'm going in for round 2 of TC today. No sleep last night due to steroids but I'll try and sleep during my infusion. Have a great day! Sheila",
      "MessageIndex": 320,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Apr 19, 2019 07:32AM sheila77 wrote: pokyspider - I also have trouble with water for the first week after my infusion. I have been able to drink coconut water and LaCroix. Hope you find something that you can drink. I usually eat toasted french bread with butter and I have smoothies that I make at home with fruit and greek yogurt. For me, I only struggle for the first week, then I can start eating again for about 12 days and then I get my infusion. Hope everyone finds something they can eat, but the taste buds have definitely changed.  Jean - How are you? Did they find a combo . that works for you? How are the SE's with the new medication?  Hope everyone is having a good week and enjoying time with family. Rest when you can! Remember we can not do everything right now - But this too shall pass.... Hugs to all - Sheila",
      "MessageIndex": 373,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Mar 13, 2019 10:31AM sheila77 wrote: Good Morning Warriors, I had my first infusion of TC on Monday (3/11) which went better than I expected. I think the mystery of the unknown was the cause of my anxiety. I felt good on Monday and went for a walk. My main issues have been headaches, fatigue, insomnia and some nausea. I did go to work yesterday for four hours and then went to get my Fulphila injection. Took a good nap and took it easy. I just felt like I was \"coming down\" with something all day. Headache, fatigue and a heaviness. Today I am staying home to rest and be prepared if I experience any other SE's. I am doing all that I can naturally so that I don't have to take medications!! I will be using my essential oils and CBD oil if needed. UCFKnights- I am happy to see you on here for your mom. My daughter has been very supportive to me as well. It is a blessing to a mom! Stay strong with her - you will both get through this! Get your rest when you can and go for a walk. And this to shall pass. Sheila",
      "MessageIndex": 128,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "Apr 1, 2019 08:38PM sheila77 wrote: Margun - Don't let cancer scare you. You need to find a way to find peace in your circumstances. For me, I have a strong faith in God and He helps me keep my positive attitude. I did not have my TC infusion today. My onco thinks I may have cellulitis in my right breast (had that side reduced). I started antibiotics today and will have my infusion on Thursday. So not much of a delay. I just have to adjust my calendar. Hope everyone is having a good day. Sheila",
      "MessageIndex": 324,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    },
    {
      "AuthorID": "sheila77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286147/profile",
      "Content": "May 15, 2019 11:13PM sheila77 wrote: Solobroker - I had the SGAP flap. I was able to do reconstruction at the same time of my mastectomy. The recovery was hard for the first two weeks, but I started working from home by week 3. I do have to have another surgery to make things even.... That will be 4-6 weeks after chemo. I am scheduled for my fourth and Final round of TC tomorrow. I am optimistic that my numbers will be good and that I will be able to finish my infusions, This last round (round 3) I developed some serious GERD - the pain was really awful. My doc prescribed Nexium and now that I have been taking that for a week I am not having the pain in my chest.... Never really had heartburn, just pain in my sternum. I am not able to drink much water or anything else. Everything upsets my esophagus. this weekend, I will just take it easy and rest. I look forward to feeling back to my old self - if that ever happens. I do have to start oral medications after my last TC an of course get my port removed. But I am moving in the direction on healing... For this i am grateful  Unbreakable… - Congrats on finishing this phase.. I know you still have things ahead but your are moving in the right direction. Hope everyone is hanging in there. This is a hard thing to go through. I feel I am most honest with my husband (he is a good man) and for all others - I usually just tell them the basics - fatigue, nausea , GERD. I just want to keep a positive attitude and be grateful for the good things that happen ( good lab results to finish tomorrow, etc). Happy Wednesday - Sheila",
      "MessageIndex": 425,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869914",
      "Title": "Chemo starting March 2019 Fallschurchgirl Laurencl"
    }
  ]
}