{
  "AuthorID": "ShellyJo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
  "Posts": [
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Aug 11, 2009 07:52AM ShellyJo wrote: Of course, Massive doses of hormones. My surgeons team was all over that too. Could of cared less I smoked 20 years ago for a couple years. Once they heard oral contraceptives I got 20 questions pertaining to it and they wanted me to be very specific. I ended up being TN though. The doctors have no clue what causes that. BRCA negative too.",
      "MessageIndex": 1,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738755",
      "Title": "EXTENDED ORAL CONTRACEPTIVE USE & BREAST CANCER...RELATED? AmyMarie89 AmyMarie89"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Jun 21, 2009 05:26PM ShellyJo wrote: FIrst instinct was Bilat mx. After chemo i had NED so doc said lumpectomy was all I needed. SO I listened and got that and my axilliry nodes because one tested positive in Needle aspiration before I started chemo. I was spent from treatments and honestly didnt have the mental capacity at that point to make such a huge decision as the BiLat mx. But now 8 months later and pretty much fully recovered from treatments I can't wait to get rid of these things. My surgeon said its almost 100% I cant get any new breast cancers, I see too many woman here and in the waiting rooms at hospitals that have new cancers years later on other breast or new cancer on lumpectomy breast. For me Its the best choice. But everyone is different. I used to love my 34 c cup, almost perfect breasts. Now I can't even look at them without a sinking feeling in my stomach..",
      "MessageIndex": 3,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736265",
      "Title": "Happy Father's Day! Alaina ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Aug 11, 2009 12:22PM ShellyJo wrote: I agree, I think this sudden increase in Breast Cancer in younger woman is environmentally driven. My onc said there has been a marked increase over the past few years of breast cancer across the boards... See the thread, \"What caused my breast cancer\" I think it was super elastic bubble plastic.lol",
      "MessageIndex": 8,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/738755",
      "Title": "EXTENDED ORAL CONTRACEPTIVE USE & BREAST CANCER...RELATED? AmyMarie89 AmyMarie89"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Jun 21, 2009 02:19PM ShellyJo wrote: Alaina, That is beautiful! I too miss the days when all I had to do was run crying to daddy and he would take care of everything, Up until the day he died. He was always on my side always faithful. If my dad were alive now he would be moving heaven and earth to get me the best treatments possible. Of course being his daughter I think I made good decisions thus far in treatment options. I do miss my dear dad and the 70's!! Looks like your pic was taken in that time period. Nutrients are important you can tell him you appreciate that input and when you are done with MUST NECESSARY chemo, maybe he can help you with some diet and supplement tips. I think it all comes together at the end of the day. Always remember you need to be your own advocate. I am done with treatments which included a lumpectomy. I feel in my gut that i need to have a bi lateral mx seeing I am TN and grade 3. I know the mets are in God's hands now but I can prevent any NEW BC. I am scheduled in July for my surgery. I can't wait to get rid of these cancer pods. And yes I have had many people tell me that I am crazy., none of which had ever had bc btw. But I just smile and don't argue.  God bless Shell :O) ",
      "MessageIndex": 1,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736265",
      "Title": "Happy Father's Day! Alaina ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 10, 2008 08:51AM ShellyJo wrote: I am starting rads this month as well, I had chemo first and surgery on Oct 7. I am still a bit stiff from surgery and scars still a bit raw. How long after surgery do they usually start rads? I had lumpectomy and full aux node removal. I don't want to wait too long but I don't want to aggravate my scars and the healing process from surgery..Whats average timeline post surgery to start radiation?",
      "MessageIndex": 54,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 10, 2008 01:58PM ShellyJo wrote: so about a month or so after surgery seems to be the start time for rads I guess. I just didn't want anything growing back while I am waiting. My scar is on the upper outside quarter of my right breast about 2.5 inches and a longer one where my nodes where removed under my arm. Also I have the little puncture wound scar from the drain, that one bothered me a lot surprisingly. If I can't wear a bra for a month that will be a problem seeing I am a large c cup. I definitely need support, I don't even have any baggy cloths just a couple flannels my brother gave me for after surgery because I needed the button up with the drains. I can't wear those in public. Oh well just another thing to deal with I guess. I am VERY happy though to be having this over and done with by Christmas!! ",
      "MessageIndex": 56,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "May 11, 2009 10:56AM ShellyJo wrote: Seriously, I wish I had known the anti nausea drugs were like pouring cement into my colon. The first round of chemo I got so bound up i had internal hemmoroids, Was a  painful nightmare. After I figured out what the problem was,  I took a healthy dose of Milk of Magnesia after every chemo treatment for the first 4 days. Stool softeners and metamucil where not at all effective. But not everyone has that effect, some go the other way. I also cut way back on the dosage, I found after first 2 days I didnt need them.",
      "MessageIndex": 3,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Jul 25, 2009 11:29PM ShellyJo wrote: Hi Laura, :O) My MRI was NED post chemo. But my path came back with a tiny spot of DCIS  in breast and .04 size tumor in one node. I was told I had multiple nodes prior to chemo. But again they really never will know how many when chemo is done first.. ",
      "MessageIndex": 4,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737919",
      "Title": "Neoadjuvant chemo Beth7 kae_md99"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Jul 26, 2009 11:25AM ShellyJo wrote: Thats refreshing to know Lexi. Because I had estimates from 2-8 nodes according to various doctors..I did have a horror of a false positive after my first MRI. The whole left side of my right breast lit up like the fourth of July. I kept telling them I had my period full force when I had that MRI, but i was sent for a wire guided biopsy anyway. THAT was a nightmare. They got me all hooked up, wired up and drugged up and after 20 minutes in the scan they could not find that area. So Yes, the false positive with MRI scans is a huge problem. They also did ultrasound and made me do headstand in the mammogram to try to find out what that was..Thankfully it was gone. I think it was the surge of hormones from my period. I also did needle biopsy on 2 nodes and only one came back positive. They never sent the other to the lab though. SO I hope you are right.",
      "MessageIndex": 6,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737919",
      "Title": "Neoadjuvant chemo Beth7 kae_md99"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Oct 23, 2008 06:11PM ShellyJo wrote: I don't think anyone loses all their hair with chemo. I think we all panic and shave it down. I do wish somedays I left the handful of hairs I had left... The hairs that I shaved and didnt fall out sat there in hibernation till chemo ended...Now I cheer them on every day while they are trying to make a comeback...Winter is settling in here in the North East and my Head is COLD DEMMIT!!!",
      "MessageIndex": 473,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 10, 2008 07:00PM ShellyJo wrote: Nothing more attractive than being bald with a big red zit on your face...haha what a pretty bunch we all are.. Sunshine, I am thrilled to just have hair  growing back The. hair on my lower legs could use its first shave since May. But i smile when I look at it. I think I will keep it for awhile...The facial hair I can live without.  Aww Christi, The hair thing. Honestly, be proactive, shave it once you can pull handfuls out at a time. don't torture yourself. Do you have a wig ready? I know its all so sucky but chemo will pass. 12 weeks will go by quick Mine dragged on for 18 weeks.. Christi to answer your question on exercise. YES you need to make yourself walk. Heres what I did. Once I knew I had enough rest ( say 2 days on couch and still feeling like crap anyway) I put my sneakers on and walked out the front door. I walked even though I felt weak and sore from the taxotere. Somedays I walked only one block some days I walked a mile. I was on 3 week cycles by week 3 i felt decent enough to walk a couple miles but not always. Listen to your body. but I found the more I walked the better I actually felt after. And my post recovery from chemo all together was very good. 4 weeks post chemo I felt like myself again. Than of course I had surgery and that was just another knock down. But we go down we come up again and again and again...",
      "MessageIndex": 607,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 13, 2008 12:21PM ShellyJo wrote: Haha Yes, that was Posted by me originally I found it in some old mail that a friend sent me He was trying to make me smile and it worked, SO I figured I would pass it forward and make others grin..lol Uncanny how that is exactly what the hair looks like when it comes in. I think that is the same expression we all have when the doctors tell us \" Yes, this is a cancer\"  \"SAY WHAT~!!!\"",
      "MessageIndex": 636,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 15, 2008 09:28AM ShellyJo wrote: Hey Artese, Have you researched the Nioxin shampoo? I am shy of it because I am paranoid of more chemicals? Is it natural? Everyone seems to boost about it. Pam I bought the Emu oil at Vitamin Shoppe, It was 20 dollars for 4 ozs. I bought it orignally for radition and scars but I started using mederma for the scars and that seems to be working. Not sure yet what I am going to use for radiation which I start next week. I figure I will ask the staff there what they recommend. But my gf was using the emu oil for dry scalp a couple years ago and she loved it so I started rubbing it in to my nubs and it makes it feel very soft and supple..lol My hair is growing in very dark now and thickening up from the roots, I would guess one more week till solid coverage. My esthesian said Its very \"G. I. Jane ish\"   I have definite hair outline all around my head. can't wait to go topless!!",
      "MessageIndex": 644,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 19, 2008 10:06AM ShellyJo wrote: Lets do it Joia. 6 weeks out from chemo was when my hair JUST started kicking in.I was hoping to have more hair by now. Its growing in but I didnt realize how long it takes to fill in the bald patches. I think it has to do with the cycle thing. Eyebrows need a wax badly but I am scared of round 3 of the fall out. I will kick myself if  am eyebrowless again. I am starting radiation this week. At least hair can continue to grow through out that!  I am with you Kerry, Nothing is going to prompt me to trim, cut or shape a single hair on my head I am sure for a long long long time. GROW BABY GROW!! ",
      "MessageIndex": 685,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Dec 2, 2008 04:59PM ShellyJo wrote: I just bought some temporary color to fill in those white ends and maybe make it look a little fuller and longer. I am DONE with my wig..Its growing in very evenly and the hairline is nice and symectrical (sp*) I have been going to gym and shopping without it and I feel so freeeee and natural..I was out today and big burly biker type man winked at me, I must have that bad ass look. Maybe a couple henna tats to complete the look...haha",
      "MessageIndex": 800,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Oct 21, 2008 02:05PM ShellyJo wrote: I LOVE your hair, Its real and ITS YOURS!! I am exactly 6 weeks out of chemo and am only at the 5 o'clock shadow stage, the smooth bald patches are finally filling in with a soft stubble of white fuzz. My eyebrows looked fabulous till last week when to my horror they started falling out in patches. I tried filling them in with eyepencil but I looked like a drag queen and wiped it off. Eyelashes seem to be long and lush (with mascara) I hope those don't fall out :( When does the body hair come back? All I really miss is the hair on my arms. Use to smooth the hair in one direction all the time, for some reason that was comforting to me, I didnt realize this till I lost it all.. ",
      "MessageIndex": 452,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 5, 2008 02:33PM ShellyJo wrote: OK I give up i am just wasting space here. sorry :(",
      "MessageIndex": 566,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 8, 2008 10:28AM ShellyJo wrote: My chemo pause seems to have resided slightly since I finished it 2 months ago. I am down from 4 soaking sweats a night to 1 or 2. But man when those things hit it sucks. I have been increasing my exercise regime I think that is helping. Also, I find wearing a big warm scarf with a lighter or sleeve less jacket is a good solution to colder weather. Its easy to take the scarf on and off when the flash hits. I think my big heavy sweater  and turtle neck days are over...",
      "MessageIndex": 585,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 10, 2008 05:08PM ShellyJo wrote:  He does look like your little guy Sunshine.. lol I thought I had some nasty blackheads on my cheekbones (of course I was cursing the chemo for yet another aliment) and I couldn't get them out. I was ready to book a facial when I decided to grab the tweezers to try to pull them out because they were so dark and just huge. Turned out to be HAIR thick little man hairs on my cheek bone! like 5 of them ready to sprout. I grabbed them one by one with the tweezers and when I pulled they were about 1/4 long and very coarse, I wish the hair on my head was so coarse. I think maybe they got misdirected from my bikini area maybe?? how lovely would that be?",
      "MessageIndex": 603,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 18, 2008 08:10AM ShellyJo wrote: Kerry I am all about the makeup now. I don't walk the dog without full mask on. Just like a drag queen getting ready in the morning, Fake eyebrows ( not anymore) fake eyelashes, fake hair.. The dog gets her leash when she sees my hair going on..I am about one week away from going topless. I still have  litte see thru patches in the back. I am feeling a little rebellious lately and the Shenaid O Conner Bad Ass look suits that perfectly. and Muma, I remember those blanket over the mirror days YUK! At least most of you are married,. I am single how attractive do you think I feel for dating? lmao  xoxoxo to you all ",
      "MessageIndex": 673,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 19, 2008 04:37PM ShellyJo wrote: I think he drank the Whiskey and hot sauce Springtime. Than he didn't care if his hair was growing or not  :O)~",
      "MessageIndex": 699,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 21, 2008 08:22AM ShellyJo wrote: LMAO Nancy, I have been putting hats on over the wig and the same thing happens to me. It all comes off at once.  Gotta be careful with that... I am cracking up and thinking how much losing your does suck on so many levels..:O) By summer we should have a cute sassy hair style to sport around right!! Passing Springtime the whiskey and hotsauce... ",
      "MessageIndex": 712,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 3, 2008 09:58AM ShellyJo wrote: I finished chemo ( TAC ) Sept. 10 2008. My hair didnt start to grow back till 6 weeks after that, even at that its was just a guess. Kinda like you think you see some hair activity but are not sure. At the 7 week mark I saw a definite shadow. Now its starting to fill in and grow like crazy ( crazy of course being relevant meaning, YEP ITS DEFINITELY GROWING NOW! I have about a 1/4 of fine black, grey and white hairs. I try not to wash it everyday hoping the natural oils will strengthen it. Still see a lot of scalpage. Once I have a solid coating though ( no see thru) I am tossing my wig out the window!! I agree with Springtime. How much easier this journey would be if we had our hair to hide behind and pretend we at least dont LOOK like the walking dead,, Because that us what I felt like every time i looked in the mirror while on chemo with no makeup or wig. Sandy that must be a happy day pulling out the hair dryer. I had just bought a new one back in January of this year. I also got sucked in to one of those pricey ceramic curling irons before I got diagnosed. I used it once and now its just sits in my closet reminding me of the once beautiful hair i used to have... OK so I am having a bit of a pity party here. I think we are entitled once in a while.  on a side note, My pubic hair started to make a comeback this weekend... TMI? LOL I will take any hair I can get at this point....!! ",
      "MessageIndex": 538,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 5, 2008 02:31PM - edited Nov 5, 2008 02:32PM by ShellyJo I tried posting a picture of Natalie Portman's shaved head for inspiration but It didnt post. I will try again. Beauty isn't all about the hair. I like her makeup I think the idea is to play up the eyes and cheekbones.[IMG]i105.photobucket.com/albums/m2...[/IMG]",
      "MessageIndex": 565,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 15, 2008 09:49AM ShellyJo wrote:",
      "MessageIndex": 645,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 20, 2008 05:55PM ShellyJo wrote: What a cute pooch EJ!! How are you feeling post rads? I Just got tattooed today. Christi this is the true test for your man. If he can love you like he says though all this and be supportive till the end of treatments than he is a keeper!! I know its hard going from hot to not but its only temporary. I tried going wigless with just a cap today but its about 15 degrees in MA. now with the winds and just was too darn cold. I didn't realize how warm my hair kept me. I feel for bald men. I don't know how they go out in winter with no hat on. They must drink a lot of whisky and hot sauce...hehe",
      "MessageIndex": 708,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 22, 2008 12:27PM ShellyJo wrote: Its been ridiculously cold here in Boston and my head and body seem to be cold no matter what. I took a salsa class this morning and wore a knit skull cap the whole time. The bandana screamed chemo girl because I don't have long enough hair around the edges to just make it look like I have short hair. One woman asked me if I was hot with the hat. I said. \" No, I sweat alot\". The hair thing HAS to be the worst of it because even on good days that baldness is a constant reminder and downer..Looking at my big fat thighs in the aerobic room mirror was no fun either...a BIG FAT CANCER SUCKS from me today!!",
      "MessageIndex": 728,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 4, 2008 02:16PM ShellyJo wrote: I dunno about the tea sunshine. I do know I have forced myself to walk almost daily thru out this whole ordeal. Since I finished chemo I walk anywhere from 1-4 miles a day. During chemo I packed the weight on because of steroids etc. Now that I am almost 2 months out from chemo the weight is coming off and I am back in my pre chemo jeans. I am not taking any other drugs because I was not estrogen positive so I honestly don't know how those may be effecting weight. Keep the diet clean and balanced. Lots of dark greens, fruits, veges ( the more colorful the better for you )  enough LEAN protein ( 1 gram per pound of body weight per day ) and fiber filled carbs. I sprinkle flaxseed on hot cereals and plain yogurt. I also read blackberries are great for preventing breast cancer so I buy those frozen by the bag full at Trader Joes. Good for smoothies and yogurt and cereal toppings. Stay away from sugars, cancer thrives on it. Mom gave me a bottle of Cod liver oil. I am taking a spoon full of that everyday good for omega 3 etc. I buy everything I can Organic also. The weather is still nice, get out there and get your blood flowing..",
      "MessageIndex": 556,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 9, 2008 09:40AM ShellyJo wrote: Sandy, At this point I will be happy once my scalp doesn't show anymore  and I have something ANYTHING to run my fingers thru. The whole hair thing has been so depressing and making this so much harder, Ya Ya it will grow back they say. My hair was down to my waist. SO maybe in 5 years I will back to where I started.. Mumayan, They color is uncanny isn't it? Emu grey..my eyebrows are coming in that deathly color too..    I will share my what my hair looked like before it fell out in June..  ",
      "MessageIndex": 592,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 13, 2008 11:16AM ShellyJo wrote:  Hey chickys My eyebrows just started coming in like gangbusters very Groucho Markesque. I think I won't pluck them and wait and see if they fall out again. Bottom lashes were MIA last few weeks, It wasnt so much an issue because It made eyeliner glide on perfectly. But now the top lashes are saying a fond farewell..I have to laugh its all so crazy. I booked a facial for friday for the first time since spring so I am looking forward to that, She will want to wax my unibrow I will slap her hand and say MINE!! lol Been rubbing the ostrich oil into my scalp  my hair is very soft and shiny now albiet still standing up but thats ok it feels good to rub my head at least. Even my nine year old commented on how its growing in really well at this point. Although he did inform me that I must wear a wig in public because I look like a boy and that wont do...out of the mouths of babes.",
      "MessageIndex": 634,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Oct 22, 2008 09:22AM ShellyJo wrote: Thats one full head of hair GramaD!! How do you post pictures in the reply box? Thinkin I will share my 6 weeks of stubble with you all...lol  Also need to look into that powder kit, We have a Sallys in the next town.  ",
      "MessageIndex": 468,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 3, 2008 04:38PM ShellyJo wrote: I wear the lace caps at night too. When I get a hot flash I pull it off and tuck it under the pillow, than when I get chilled after the hot flash resides its right there handy for me to put back on...lol. I also wear little socks on my feet that come on and off all night too..Lets not forget the 2-3 wardrobe changes from the soaking sweats. It was an extra treat (NOT) to fumble around that horrendous drain thing in the middle of the night (I had surgery after chemo)...does this ever end? will I ever want sex again? haha just thought I would throw that out there..",
      "MessageIndex": 548,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 3, 2008 06:26PM ShellyJo wrote: ,,,,all that and the 15 pounds chemo packs on...I couldn't even look at my VS catalogs while going thru chemo, It just made me feel more disgusting..Thank goodness for elastic waistbands. Good news is the weight comes off the hair comes back, and maybe we will all feel sexy again by this time next year? and Sunshine your hubby is looking at you through the eyes of love. To him you are a princess no matter what...You are blessed...:) ",
      "MessageIndex": 551,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 5, 2008 02:26PM - edited Nov 5, 2008 02:27PM by ShellyJo",
      "MessageIndex": 564,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 8, 2008 10:37AM ShellyJo wrote:",
      "MessageIndex": 586,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 10, 2008 11:38AM ShellyJo wrote: I sooo wanted to donate mine but Locks of Love wouldnt take it because it was colored... I don't understand that as long as it was healthy, which it was. It takes 12 heads of hair to make one wig I was told and then they end up coloring it anyway, Thank you all for you comments its so great to be here because no one else can understand how all these things effect us unless they have been thru it themselves. But what doesn't kill us makes us stronger doesn't it!! Wishiwere- I took a bunch a pics., just knew I needed to be reminded that I wasn't always a blank slate",
      "MessageIndex": 597,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 11, 2008 12:15PM ShellyJo wrote: Kudos and ^5 for going commando Nancy. I know the exact stare you are talking about. I got them the day I went out this summer with just a bandana wrapped around my head. My mom was with me and said \" who cares what people think\" I was like \" Mom its sooo much more than what people think\" She doesnt get it though. I havent gone to the mall since without my wig. Anyway,Take a pic of your hair I think we all like to see the progress...:O)",
      "MessageIndex": 613,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 17, 2008 07:59AM ShellyJo wrote: Nancy I am envious you even have bangs in the front. Must be someway to control the curl. What about a tiny round brush to smooth out the curl and make it go in one direction? Some gel perhaps. What about those stretchy headbands and push it all back? Anyway. All my growth is going into my eyebrows it seems. They are getting thicker and thicker and I can't bring myself to take a tweezer to them. I want plenty in reserve for when they take their second nosedive.  Thank you Lisa. I have a 14 year old too. When I tell them to do something and they don't listen I threaten to show up at their school wigless and walk through the halls. That interestingly has worked..lol  On a good note I do believe the shiny spots are gone on my scalp. A solid head of hair is emerging! now for some length..YA RIGHT!! ",
      "MessageIndex": 664,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 22, 2008 02:16PM ShellyJo wrote: drag the pics and drop them into the reply box Judy and congrats on your 4 year cancerversary!! If it were summer I would go wig free right now. Buts its 10 degrees. I am wearing a wig and a hat..lol",
      "MessageIndex": 730,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "May 8, 2011 06:01AM ShellyJo wrote: On May 5 I celebrated my 3 year \"cancerversary\" Dx with advanced stage 2 grade 3 triple Neg BC in 2008. TAC saved my life. It is a challenging and debilitating chemo cocktail for sure. Stay strong and stick with it. Pray for strength and endurance. It  also helped me to take slow walks in sun and play with my dog. She actually brought me more comfort then most people for some strange reason. I guess its because she didnt think any different of me or pity me. The hair grows back, for some sooner then others, mine was down to my waist so I still have a ways to go!  Hang in their baby you are not alone in your suffering, remember Jesus died on the cross for us....God Bless and suck it up!! For this too shall pass!!",
      "MessageIndex": 27,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/765974",
      "Title": "TAC, anyone stop early? christine47 Luan"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "ShellyJo wrote:  Hey Ladies I need opinions, I recently just completed treatment for stage 2b triple negative BC. I had Neoadjuvant chemo so staging was a guess from MRI and needle biopsy. I had almost complete response from chemo( classified post chemo as stage 0 for explaination purposes) there fore my surgeon and oncologist said a lumpectomy would be just as effective as a full masectomy. So that is what I did. I had lumpectomy and full aux node removal where only one node came back with a few cells in. But since we did chemo first not sure how many nodes were actually invaded. Now I am done and awaiting radiation which I am looking forward too seeing its my last line of defense being I am triple negative.  I am seriously considering going back after the holidays and getting a double masectomy seeing I never want to deal with this again. I know it doesnt mean I wont but i think it will give me peace of mind. I am setting up appt in January at Dana Farber Inst. In Boston to ask them. But I want to know what your ladies opinion is of doing the double masectomy vs lumpectomy especially where I am borderline stage 3 and triple negative, for peace of mind? Dx 5/5/2008, DCIS, 2cm, Stage IIB, Grade 3, 1/14 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 14, 2008 07:53AM - edited Nov 14, 2008 05:06PM by ShellyJo",
      "MessageIndex": 7,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Feb 22, 2009 11:43AM - edited Feb 22, 2009 11:44AM by ShellyJo  You girls are the best and bravest woman I know, with that said... I am definitely going to ask for consultation at my mammogram. I pretty much made the decision to have my breastS removed with immediate reconstruction if that is possible. I do know I need to heal still from my lumpectomy and axillary node removal at this point anyway. I think July is about the perfect timing to get the ball rolling on all this...I can't even feel my breast without imaging I feel something. I can't live with this paranoia.. Not to mention my right breast is now noticably smaller than my left now that the swelling from lumpectomy is gone...This disease as all cancers is a never ending mind trip..I know there has to be a cure in the near future. I am also not convinced there is no cure now. The medical community and pharmacutical companies would be be about at a standstill if they didnt have cancer to treat.. God is still the greatest healer, In him all things are possible..   Shelly ",
      "MessageIndex": 18,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 14, 2008 07:52AM ShellyJo wrote: Thanx girls I do have nagging feeling that doing the double masectomy will be a good move for at least peace of mind. I don't want to analyze every lump and bump for the next years I think that will just about dirve me mad. Jelly, I am 43 was 42 at time of diagnosis I know I look very young I wont complain about that...I am DEFINITELY going to seek second opinion after the holidays. I start my radiation next week and need to finish this treatments and bring full history to Dana Farber. I already called them. I am thinking double Mastectomy with immediate reconstruction. I appreciate all the in put from the woman who have been there and done that already.. I want to live as long as life as possible with as little stress as possible. ROXI I am curious to what the grade your tumor was and how long you have been cancer free? and where were you treated? Kimi what is it you know now that would influence your decision to do double mastectomy? And Linny I was told same thing I know there are no guarentees in life. but there is maybe more peace of mind,,, ",
      "MessageIndex": 6,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Nov 14, 2008 05:05PM ShellyJo wrote: Oh Kim I am so sorry to hear this and May God give you peace while struggling with this. I am curious if you got tested for the BRCA1 gene? I did have that and came back negative I wasn't tested for BRCA 2...Do your doctors think a masectomy at original onset would have made a difference?",
      "MessageIndex": 11,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724379",
      "Title": "Masectomy after lumpectomy ShellyJo ShellyJo"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Sep 21, 2009 07:01AM ShellyJo wrote: I think of you also. My tears flow freely for you, You are in my heart and mind for the peace your family may find and to know the love you had for them and how hard you have fought. I do know you will be soaring with the Angels on those streets of Gold. And while you are there can you have a nice little sit down with the Almighty and ask him to bless each and everyone of us stage 0-4 for a cure for this horrific affliction we must all deal with on one level or another for the rest of our lives. My brother was my rock through this whole ordeal also. Peace to him and to you children. They will never forget what a wonderful, strong, brave mother/sister/friend they had Peace and love   ~Shelly ",
      "MessageIndex": 502,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "ShellyJo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73702/profile",
      "Content": "Mar 2, 2009 04:01PM ShellyJo wrote: I wore and am still wearing those cotton stretchy tank tops with a soft shelf bra inside. Its been 5 months since my surgery and I do wear traditional bras when I have to. But I find the cavity in my breast and my nipple are still very sensitive and I get lines from the bra on that breast if worn for too long. New york company sells them up to size XL and they have thicker straps that are adjustable.",
      "MessageIndex": 9,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729862",
      "Title": "what type of a bra did you wear after your lumpectomy? aris Hopeful82014"
    }
  ]
}