{
  "AuthorID": "shelleyfl48…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153713/profile",
  "Posts": [
    {
      "AuthorID": "shelleyfl48…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153713/profile",
      "Content": "Jun 9, 2012 04:57PM shelleyfl48 wrote: I absolutely agree that my gyn is misinformed. I'm so glad I went to Mayo Clinic and had a consult.  My best bet may be to find a local oncologist who can work with me.  I am very concerned about the false positive readings.  I have read that 1 in 10 MRIs give false positives; however, they improve once you have a baseline MRI to compare future readings to.  It is a tough call.  How did your doctor evaluate your risk?  Does a younger age at treatment result in higher risk.  I was 23 and I have no other risk factors for BC.  Just curious how they can come up with a number.  I am going to be more vigilant on the self exams.  It seems that a lot of people have found it that way.   ",
      "MessageIndex": 143,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "shelleyfl48…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153713/profile",
      "Content": "Jun 8, 2012 10:21AM shelleyfl48 wrote: I am so sorry for all of you who are dealing with a bc diagnosis.  I had Stage IIB HD 25 years ago in 1987-88 with mantle radiation/chemotherapy.  I have been pretty healthy up to this point, other than some thyroid issues, but just last year, I had an opportunity to go to Mayo Clinic for a checkup with an oncologist.  He highly recommended an MRI in addition to mammography for bc screening.  My gyn was skeptical - warning that there are so many false positives with MRI.  He said it would probably open me up to unnecessary testing.  Reading this board reminds me that I am at a much higher risk of bc and I would probably be foolish not to take advantage of this technology.  For some reason, I am having trouble going forward with the testing - it may be fear or a \"head in the sand\" issue.  I am praying for peace with the decision to start down the testing road.  Thank you all for posting your stories.  I would appreciate any advice or wisdom you might have in your personal journeys with HD. Shelley dx 12/87, Stage IIB HD ",
      "MessageIndex": 137,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    },
    {
      "AuthorID": "shelleyfl48…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153713/profile",
      "Content": "Jun 8, 2012 06:13PM shelleyfl48 wrote: I honestly did not realize the risk of bc was so high. I have always gotten mammograms and hoped for the best, but this year I have begun to take it more seriously. I had read somewhere that risk declines once you are 30 years out, but when I looked for that article again, I couldn't find it. I was curious how the risk factors were presented to you. I had the same mantle radiation dose that you had. Thank you so much for responding. I don't want to live in fear, but I find this decision very difficult. It is not helped by the fact that my current gynecologist seems to think MRIs are not a good choice because of the false positives. It may be time to find a new doctor, although I've been happy with him for everything else. Blessings, Shelley",
      "MessageIndex": 139,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/764830",
      "Title": "Hodgkin's Survivors/Secondary Breast Cancer lifelover Proog2"
    }
  ]
}