{
  "AuthorID": "shelly4321",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
  "Posts": [
    {
      "AuthorID": "shelly4321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
      "Content": "Apr 21, 2015 06:45AM shelly4321 wrote: MotherofFour I had the same skin saving bilateral with reconstruction surgery as you. The worst part of the whole surgery is the stupid surgical bra. I want to be free so bad. when they took it off at my BS follow up they said I probably don't need it, but to wait for the PS to tell me for sure, because he didn't want to tell me anything that would \"Mess up his(PS) Masterpiece. \" I don't know why it made me oddly happy that he called my empty skin sacks a masterpiece. So I am stuck wearing it until April 23 which also happens to be my 30th birthday, so I am hoping that the universe will make up to me by having the PS take out my drains and allow me to go without the surgical Bra.Well that was a whole lot about me when i just meant to say that I know your pain, and it is a sucky situation. just wait till the PS tells you what to do.",
      "MessageIndex": 3,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830434",
      "Title": "Binder after mastectomy? MotherofFour shelly4321"
    },
    {
      "AuthorID": "shelly4321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
      "Content": "May 1, 2015 02:28AM shelly4321 wrote: I was 29. i just turned 30 on April 23. I was diagnosed march 9, 2015. of course I was shocked but i was also determined. BMX with TE recon. on April 14. 2015. I feel pretty good. except for the drain situation, the drains suck.",
      "MessageIndex": 430,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "shelly4321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
      "Content": "Jun 20, 2015 05:53PM shelly4321 wrote: hey all, I was 29 when I got diagnosed on 3/9/15. I started CT on 6/11. The first week was a cakewalk. I had no side effects. But today I get home from work and have a sore throat achy muscles and a temp of 99.5-100 I don't know if I should call my dr or not because I took a nap and it went down to 99.4. And they say call if it's over 99.5 or 100.5.",
      "MessageIndex": 125,
      "PostDate": "20/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "shelly4321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
      "Content": "Jul 6, 2015 01:54AM shelly4321 wrote: hey everyone. Today is day 3 past my tc# 2. This time they had me take a nulasta shot. I'm pretty sure that is what is making me feel like crap. I still have most of my hair. I have a bald spot on the top of my crown. So far the cold caps seem to be working. I am still working my normal grave shift and my per diem job. Working keeps me busy, but I wish I was at home today. Does the bone pain and nausea go away?",
      "MessageIndex": 271,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "shelly4321",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212518/profile",
      "Content": "Jun 25, 2015 08:25AM shelly4321 wrote: magbrew. I am on TC as well I am 14 days out from my first infusion and let me tell you it hasn't been bad at all. I have felt pretty dang normal except for on day 9 I developed a \"mild\" case of strep throat and had a fever of 100.5 ( my onc didn't give me nulasta for some reason!) and so I freaked out and went to the er. They gave me the Zithromax z pack and in 3 days I was back to normal except I had some mouth sores. Now at day 14 those have pretty much gone away so I am back to feeling completely normal. Hope you have the same good luck I have had ( except the strep throat",
      "MessageIndex": 166,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}