{
  "AuthorID": "Shel",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
  "Posts": [
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 29, 2009 07:47AM - edited Nov 29, 2009 07:49AM by Shel Hello, everyone.  Hope you all had a good Thanksgiving. Littlebird, if you don't feel confident or cared for by your cancer team, get another opinion.  I am not on the same drugs as you, but I can read on this thread that several women are experiencing severe joint pain. Don't give up on the treatment.  You just may not have the right people handling your care.  Anamary, please feel good for all of us! Kayh, too bad bidets can't be prescribed for everyone undergoing this. I am not bouncing back from this tx (#2).  I have the energy level of a 90 year old woman.  I try and walk everyday and not just spend all day on the couch, but it's hard.  Also, my throat is so sore that I really only can eat soup and soft foods.  Lots of popcycles.    Btw, my cancer center sends me bills for treatment at the same time they bill my insurance company.  They are billing about $4,500 for each chemo tx (not including onc appt).  But the neulasta shot is being billed at over $8,000!  How could someone without insurance possibly do this?  I guess they obviously couldn't.  I think several of us have treatments this week.  I am really not looking forward to it.  Thanks to all of you for being there.",
      "MessageIndex": 674,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Dec 5, 2009 11:36AM Shel wrote: Hello everyone.  Sorry I haven't posted in so long.  I had some good days (Days 11-14) and had to be focued on work.  I haven't caught up on all postings, but I would like to send my support to all who are also dealing with issued beyond this cancer.  It must make this so much more difficult. I actually had my infusion on Thursday and was scheduled for my Neulasta shot of Friday.  I totally forgot!  So I went in the AM (Saturday),  I hope it won't make a big difference but not a good move on my part. Otherwise, I am doing OK.  Fatigue is the worst and I am worried this month which is usually so busy.  I am trying to dial back but it's hard. I hope everyone has a restful weekend.  Shelley ",
      "MessageIndex": 798,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Dec 6, 2009 08:56AM Shel wrote: Hello, everyone.  I am so sorry to hear about anyone suffering more than normal with SE.  I am on day 4, so just feeling generally druggy, weak and tired. Like everyone, I have had times that I wanted to give up on chemo.  My very thoughtful boss, sent me an email message with this quote:  \"Courage is the first of human qualities because it is the quality which guarantees all others.\" - Winston Churchill So courage everyone.  Peace Shelley",
      "MessageIndex": 807,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Dec 19, 2009 09:33AM Shel wrote: Hello to everyone.  This is day 3 after my last AC influsion.    So far the steriods are still doing the trick so I am hopeful I can finish Christmas shopping today. For those of us starting Taxol soon, I heard there are two ways that we might react.  First, at infusion time, it is not the Taxol people react badly too; it is the alcohol they use to deliver it.  So I wonder if we shoud take something like Benadryl or Claritin beforehand.  I didn't think to ask my onc, but I may call prior to the next appointment. The other problem with Taxol is the bone pain of course.  Some women find it intolerable, so they switch to 12 weekly treatments which doesn't require the neulasta shot.  But I want to do the DD as I would be done February 19th.  I just didn't know if anyone else had additional info on Taxol or had already started and had some advice. Melinda, for the lyrics, it would be great to fit in sleep deprivation.  I so miss sleeping through the night. Hope everyone has a SE free day. Shelley",
      "MessageIndex": 1045,
      "PostDate": "19/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Dec 12, 2009 10:08AM Shel wrote: Hello to everyone.  I have been trying to concentrate on work so not been on the board.  Such a lot to catch up with. Cytoxin (funny I just noticed that toxin is part of the name), I get it over 60 minutes.  Everyone who gets headaches should request that.  My onc nurse offered that the first time and then said I could speed it up if I wanted.  I am happy to go more slowly and not risk another SE. Someone mentioned smelling like chemicals.  I absolutely think I smell; certainly everything coming out of me smells like chemicals.  I was thinking of starting a list of things I won't miss about chemo and the smells would definitely be part of it. I too start Taxol in January -- dense dose.  I am a little worried about the bone pain and neuropathy.  But I won't miss the fatigue. So many of us on this board have teenagers.  I am wondering how everyone is managing Christmas (or Hanukkah).  My 14 year old is trying to be understanding, but she is young so she is inconsistent.  One minute she is fine and the next she is desperate to get the tree up.  I am also a single parent so I don't have anyone to fall back on.  I am most worried about the shoppiing; I hate shopping at good times and it doesn't seem to be anything I can delegate to someone else.  Hope everyone has a good day today. Shelley",
      "MessageIndex": 936,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Jan 24, 2010 08:01AM Shel wrote: I haven't been posting for awhile, trying to work and spend time with kids.  I am on day 4 with DD taxol and all I can say is Ouch!  But only two more infusions to go. Nette, I am also anemic from the chemo, but my onc nurse told me to eat things with iron, specifically oatmeal, raisins, dried apricots and molasses.  I haven't figured out a way to eat molasses yet, but I do have oatmeal and raisins about every morning I can now.  It has helped a little I think.  I was less anemic this time around. Have a restful Sunday everyone. Shelley ",
      "MessageIndex": 1399,
      "PostDate": "24/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Jan 11, 2010 08:50AM Shel wrote: Alicia, good luck today.  A week of pains and aches.  Ugh, I thought it would only last 2-3 days. Shelley",
      "MessageIndex": 1276,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Feb 19, 2010 12:34PM Shel wrote: I haven't posted in a long time on this thread as I have been mostly reading the Triple Negative forum stuff, but I have tried to keep up with everyone's posts on this thread and have been thinking of all of you.  I think this forum was instrumental in getting me through the first two or three infusions and I really appreciate that.  I was so glad to read that Alicia and other people had lost their eyelashes for example or I would have been shocked when I did.  And I never yet learned how to get a picture up.  Or well, I don't look so great lately. I am done with chemo as of yesterday.  I was a little weepy during blood draw and my onc appointment, but by the time the steriods kicked in I was feeling pretty tough.  No Neulasts shot this time -- yeah.  That's a good thing because my daughter and I are going to Florida on Sunday for five days and I don't want all that awful bone pain as I try and keep up with her.   Lots of hugs and best wishes to all of you.  I am off to rads sometime in March. Shelley ",
      "MessageIndex": 1665,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 5, 2009 05:34PM Shel wrote: To my fellow Warrior Wimps, I have completed my first tx!  So far so good.  I had no troubles while getting the infusion and although I feel different than usual right now, it's not bad, no pain, no nausea.  A little bit energetic in fact.  This must be the steriods.  I am hoping to get through a day of work tomorrow and then take it easy over the weekend. If I stay still I feel sleepy.  But, yeah, one down! menevermind, I hope the rest of your tx went well.  Were you able to work today? Thanks to all of you you wrote to encourage me this morning.  It really meant a lot. Shelley ",
      "MessageIndex": 151,
      "PostDate": "05/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 6, 2009 01:42PM Shel wrote: Bottkota, welcome.  I think i have seen info on those drugs on other threads -- maybe the triple negative thread.  Maybe you can check out specific side effects for your drugs on those threads but stay here with us for general November Warriorship and encouragement as we go through this together.  And you're absolutely right, cancer does suck!",
      "MessageIndex": 175,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 8, 2009 08:36AM Shel wrote: Good morning to everyone.  The weather is beautiful here in Michigan -- 60 degrees (16 Celsius  for all you down under - it doesn't sound so warm in Celsius).  I may have overdone it a little yesterday with a very long walk with my sister and my dogs.  I am planning a much quieter day today.  I am also getting face flushes and I am postmenpausal.  I do think I have heard about the before -- chemo blush I think it was called and should only last a couple days.  My biggest mistake was not to take the laxative immediately.  Lesson learned for next time. I am so happy to hear that those of you a few more days out from your treatments are feeling better.  So great for you and such positive news for me.  Thanks so much for that. Wishing you all a good day!  Shelley",
      "MessageIndex": 212,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 11, 2009 03:03PM Shel wrote: Melinda, I have to say I cringed when I read your question about the best days to work.  I am at work (day 7) and haved been here everyday.  I can't honestly say I have been very productive.  I do a lot of work on the computer and the monitor seems to be vibrating all the time, only magnifying my headaches. I think everyone is different and you can't schedule side effects.  But, please, take all the help you can get.  People, especially family, want and need to help.  If someone wants to drive you and be with you, I would let them.  You will apppreciate the company and it is really important to have a second set of ears during any encounters with the medical community.  Re dairy question, apparently the rap on dairy is that dairy fat stores toxins, etc.  However, if you are eating low fat or organic stuff, it should minimize the risk. Looking forward to day 8 and maybe my world will stop moving! Shelley",
      "MessageIndex": 303,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 12, 2009 07:07AM Shel wrote: To Cafelovr, I am so sorry about the mets, but I love your spirit and think it will help sustain you through this.  I also think it is great that your onc is ready and willing to fight this with you.  I have seen the opposite.  Having your doc's support, encouragement and resources behind you can really make the difference. Hang in there. Shelley ",
      "MessageIndex": 316,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 13, 2009 10:19AM Shel wrote: To my fellow November Warrior Princesses, I feel so good today.  Day 8 for me, though it started in earnest yesterday afternoon.  I even got up before work and cleaned up my kitchen.  And I was happy about it.  So it can and will be done! Congrats, to those of you who can through yesterday in flying colors.  Keep drinking water, tea, soup, whatever works for you.  Love the PacMan image, AroninMia. coolbreeze, so sorry to hear about your dog.  We had a black lab named Smudge; they are such sweet, faithful dogs.  I don't know if anyone saw this, but apparently a woman in Texas faked breast cancer to hold a benefit for breast implants.  If you don't feel good today, maybe you don't want to read it, but I was glad to see she got her comeuppance.  http://www.msnbc.msn.com/id/33907426/ns/today-today_people/ Rest, drink and be positive!",
      "MessageIndex": 349,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 16, 2009 07:44AM Shel wrote: Melinda and Susan, good luck today.  After this first treatment, the uncertainty will be over and you will have a better understanding about what this is all about.  We will be thinking of you. Omarsmom, welcome to the November Warrior/Wimp/Princesses - whatever label fits today.  You will find this group so supportive.  Great news that you are already one down. I am feeling much better today.  I consumed about a gallon of water yesterday.  I will try some sudafed as the ibuprofen isn't taking care of it totally. Have a good day everyone.",
      "MessageIndex": 393,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 17, 2009 01:54PM Shel wrote: Ah, ccnani, what a bummer!  I am so sorry to hear that you have to go back for the restitching and that your chemo is postponed.  You are definitely a member of the November warriors so no worries there.  And Thanksgiviing dinner will still taste good to you, so you and coolbreeze have to enjoy it for all of us! Shelley",
      "MessageIndex": 443,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 18, 2009 07:17AM Shel wrote: Kimmy, looks like you're up to bat today.  We will be thinking of you. BoxerSue, sorry it didn't go so well.  I think they can slow the Cytoxan if it is giving you a headache.  My nurse said it can go in anywhere from 30-60 minutes, but you can ask for the slower rate if it gives you a headache.  I go to my LGFB class today, so I expect to be all set for the next ghastlies. Have a peaceful day today, everyone. Shelley ",
      "MessageIndex": 454,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 21, 2009 07:55AM Shel wrote: November sisters, sorry I haven't posted for a couple days.  I was not at work on Friday and my home network is down.  Back up today maybe. Yesterday was my 2nd TX.  I got poked 4 times.  The first two by my assigned onc nurse.  I could tell from the beginning she was not going to work for me.  All she talked about was how crumby my veins are and how much she wanted to go home.  So her first two pokes didn't work.  Then a sweet nurse can over and got a vein that they used for all the pre stuff.  But because they couldn't get good blood drawback, they didn't want to use it for the \"red stuff\".  So they called over the head nurse, Miss K.  She of course got it on the first poke and it went fairly smoothly from there.  When I left, I told that I Miss K was asking for her next time.  She said she said a prayer as she walked over to my chair to be me finally set up.  Whatever works. They want me to get a port, but I only have six TX left.  And some people, like LittleBird, are having trouble with ports as well.  Have to think about this one -- but quick Anyway, it's Steriod Day for me, so I am feeling pretty well. doronet - 120 at 5'7\" - I remember those days; anyway my PA says 8 glass of liquid at presumably 8 ounces.  But she stresses that it can be juice, ensure, carnation breakfast drink, herbal tea, along with the water.  She is afraid I will be water logged and not eat.  I am about an inch shorter and maybe 10 pounds heavier, so you may want to bump it up eight ounces of so.  But a gallon seems like a lot.  I would be in the bathroom constantly. pam -- love the wigs.  My sister bought me a wig and is bringing it tomorrow.  I lint rolled my hair this AM and it's coming out.  But my hair is so thick, it may take a while to show. Hang in there everyone and take a nap today! ",
      "MessageIndex": 549,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 24, 2009 11:35AM Shel wrote: Hello to all.  A reasonably good day for me.  I am wearing a scarf today at work for the first time.  People sure treat you differently.  LittleBird, I am so sorry to hear about your pain.  I am not on the same drugs so I have no advice, but I hope you get help from some of these other great women.  This is a bad enough ordeal without being in terrible pain as well.  I talked to my PA about getting a port or not.  I don't want one and at least two nurses have had no trouble hitting a vein.  I just had the nurse from hell last time.  My PA said I am fine saying I want a specific nurse or the best poker on the floor.  I will take my tough sister with me because I can be a whimpy warrior. Have a good day everyone! ",
      "MessageIndex": 611,
      "PostDate": "24/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 26, 2009 08:48AM Shel wrote: Happy Thanksgiving, everyone.  Day 7 here.  Yesterday I worked more than a full day (so many people already gone for the holiday) that I am wiped out today.  I was really happy to do it because the people at work have been so incredible to me through this. And luckily, my sisters are taking care of dinner; my daugthers and I just have to show up.  Don't think much will taste good, but I look forward to the company. Welcome to GrandmaMickey and Psalm 121.  This is a great group of women and I know you will get the support and advice you need here.  Also, welcome to anyone else new.  I don't want to page back or I will lose the post. I hope everyone has a day full of family and maybe small good tastes of food. Shelley",
      "MessageIndex": 640,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Jan 11, 2010 07:46AM Shel wrote: Hello all and a belated Happy New Year. I also haven't posted for awhile.  Just thought I would jump in about Taxol.  I am doing dense dose and had my first influsion last Friday.  They do take forever (2 hours and 45 minute just for the Taxol, not including the stick and pre meds and post flush), especially as I am getting all the steriods and benedryl in the pre-mix.  So for SE -- with the AC, I felt drugged out all the time, super fatigued, no energy, sensitive mouth and taste buds gone awry.  With the Taxol, so far it is the bone pain.  It is manageable though and I would rather have it then the druggy, not able to concentrate AC feeling.  It is best if you move around with the bone pain, which is hard with a desk job.  But if I get up every hour or so (to go for more Tylenol/Advil), I think I will be fine. Anyway, so far, I am happy to be off the AC and only three more treatments to go. A good Monday to everyone.  Shelley",
      "MessageIndex": 1273,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Jan 13, 2010 07:27AM Shel wrote: Good morning, everyone.  I am on day 6 after dd Taxol and Neulasta shot and still experiencing bone pain plus stomach bloating.  I thought this Taxol would be easier to take than this.  Cafelovr -- I don't think you will get the bone pain because it comes from the combination of the Taxol and Neulasta.  I don't think people on weekly dosage get the Neulasta, so hopefully you will miss out on this SE. Alicia -- I hope you get good news on your husband's scan today!  I am curious if the bone pain is about the same each time or gets worse.  I am not sure I can work if it is much worse as I am only taking the vicodin at night before bed.  I tried some claritin today so we will see how that goes. SLV -- congrats on your last chemo today!  Hope it goes very well. Best wishes for a SE free day! Shelley",
      "MessageIndex": 1300,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Oct 29, 2009 07:28AM Shel wrote: Hi, jkwick74 I am in Michigan.  I don't think it is the same the same trial.  I am triple negative so no herceptin for me.  I don't see anything in my trial literature that says Lapatinib.  My trial has four arms with different delivery methods (ie, IV, orally) and different combinations.  But all the same drugs (AC-T).  Because of the length of time (26 weeks as opposed to 18) and because they can't tell me what the benefits will be, I don't think I am going to do it.  Chemo scares me a little anyway and I would like to be done with it ASAP.  Best of luck with your decision.  It's very difficult to make a good decision when you have no idea of the outcome.   ",
      "MessageIndex": 14,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Oct 31, 2009 02:17PM Shel wrote: Hello to all my November sisters.  I start chemo this coming Thursday and like everyone on this post, I am dreading it.  I have the same regime that many of you have mentioned,  AC every other week X 4 and then Taxol every two weeks X 4.  Doronet, I have kids the same approximate age as yours -- one in college and one still at home.  Since this has been breast cancer month, they have been very supportive, but I don't think they really get it.  My friends and family have been so great.  Though it's not in my nature, I intend to take any help with meals and rides where ever I am offered them.  I always think that I would do it gladly from them, so it is OK to accept the help now. I am sending positive thoughts and energy to all those starting chemo this week (including me!)",
      "MessageIndex": 39,
      "PostDate": "31/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 6, 2009 11:49AM Shel wrote: Hello at all my fellow November warriers.  Kimmy, I am not a big water drinker, but my PA said I could count green/herbal teas, juices and soup broth as part of my 8 glass a day.  Maybe your doctor would feel the same way. As for the demographics, I am probably one of the older one on this board.  I am 59 and a widow.  I lost my husband to cancer two years ago, so all this has bee really hard on our girls.  I have two daugthers 14 and 18 (we had our kids late).  Both are freshman, one in high school and one in college.  My college ager is fairly close by so that is good.  Plus I have two sisters in state (Michigan) and one sister-in-law in town.  And friends who have been great about scheduling meals as well as rides for my 14 year old. I guess it take a village to get through chemo. I have to go for my Neulasta shot soon and then I am done for two weeks.  I hope everyone has a restful and healing weekend. Shelley",
      "MessageIndex": 170,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 9, 2009 07:23AM Shel wrote: Best wishes to Melinda, who starts treatment today.  We will be thinking of you. I am on day 5 and I feel weak, but I think it is because I didn't eat much of anything yesterday.  Or maybe this is just what everyone describes as fatigue.  I am at work but it is difficult to concentrate.  Plus I have the worst taste in my mouth all the time.  Ugh! Someone asked about the steriods.  My onc said the steriods just \"make everything go better\".  Not sure what that means except that they maybe allow you to tolerate some of the other drugs that might be overwhelming.  Kimmy, I think some people do tolerate the Taxol better and my onc says some women begin to get some hair back on Taxol.  Everyone seems to take things differently too, though. Wishing you all a good day, Shelley",
      "MessageIndex": 236,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 23, 2009 08:19PM Shel wrote: Dear Sisters, I haven't been on due to technical problems and fatigue.  This is day 4 for me and I really tried to take it easier this time.  Less activity, more liquids and lots of prunes.  So far it is working but if the schedule holds the next two days will be tough.  My hair started coming out today so I had a very nice lady at Great Clips take the whole thing down to 1/2\". It should all be gone soon.  Just wanted to say that my daughters are 14 and 18. They have unfortunately been through this all before with their father.  But they have been great.  We had a makeover tonight with all the goods from the Look Good Feel Better bag! Welcome to all the new November warriors.  I will try and catch up with everyone in a few days. Have a good night, ladies. ",
      "MessageIndex": 596,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 12, 2009 02:05PM Shel wrote: Brenda, I second that you should call your onc.  I think they really want to hear about this stuff.  You could be lightheaded due to lack of calories or something.  Like I said yesterday, I am having trouble with my PC monitor seeming to vibrate (better today).  We are \"on drugs\" so these kind of vertigo feelings may be natural.  Take care of yourself. ReadheadPam, congrats on being two down and yeah to cake (and naps)!",
      "MessageIndex": 327,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 15, 2009 08:45AM Shel wrote: Good morning, November sisters,' I didn't post yesterday because I didn't feel well.  I am really disappointed because I thought I had this figure out -- days 3-6 would be tought, but the rest doable.  I am not drinking 64 fluid ounces, but I am up approachiing 48.  Plus my eyes feel funny -- kind of puffy.  Today I feel better, but I am taking it easy and not trying to do much. Yesterday I got my hair cut to about 3/4 inch with a little more on top.  I also bought a new lint roller.  It actually doesn't look bad.  But the hairdresser reminded me that hair sometimes comes back differently than what you had before.  That's too bad as I like my hair. Melinda, so sorry about the news.  This is like a rollercoaster.  Hope this chemo kicks butt with your glowing nodes. Have a good day, everyone. Shelley ",
      "MessageIndex": 381,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 17, 2009 07:13AM Shel wrote: Cafelovr and CCnani, we will be thinking about you today.  I hope it goes very well.  One down after today! Mouse and doronet, second treatment today!  It will be great to get two smiley faces and be that much further down the road. BrendaSharon, I am so hopeful that this is nothing more than a nasty side effect of the chemo, maybe sinus or something.  We are thinking of you and pulling for you.    Welcome to all the new sisters.  I will have to catch up later.  I actually need to (and feel capable of) doing some work today at work. Shelley",
      "MessageIndex": 427,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 19, 2009 12:17PM Shel wrote: Brenda -- great news and what a relief that must be!  Wishing all of you who have had treatments in the last several days ease and rest. Shelley ",
      "MessageIndex": 503,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Oct 28, 2009 09:09AM Shel wrote: Hi, this is my first post, although I have been reading the forums since July when things started to look dicey for me.  I am scheduled to start chemo on November 5.  It was a no brainer for me whether or not to do chemo as I am triple negative.  The oncologist took a long time to describe the standard regime -- dense dose AC every two weeks for four weeks, followed by T for 2 X 4.  At the very end, however, he offered a clinical trial.  He is calling this trial \"denser dose\".  There are four arms, but basically you go longer and get more chemo -- same ACT drugs though.  The trials last 27-29 weeks instead of the normal 18 weeks on the standard treatment.  This trial has been going on for awhile but there are no results yet.  They have found apparently that patients who get chemo prior to surgery in this \"denser dose\" see greater tumor shrinkage. And as my tumor was largish (2.7 cm), he thought it might was worth consideration.  My dilemna is how do you decide whether to go on a trial or not.  I work full time, so the longer time frame is problematic.  But I have too older teenagers who have already lost a parent to cancer, so I owe them my best effort.  Does anyone have any advice about how to make these decisions?",
      "MessageIndex": 12,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 3, 2009 02:38PM Shel wrote: Hello, November sisters.  I am thinking of all of you who are starting today -- doronet and mouse.  I just found out yesterday that it is not standard operating procedure to do a port where I am going (U-Michigan).  After all, I am only doing 8 treatments.  I don't like the idea of getting poked all the time, but a port sounds problematic as well.  So I guess I will see how it goes.  A shout-out to menevermind.  I think we are the only triple negatives in the November crew.  Your diagnosis date and pathology are remarkably similar to mine.  I will ask on Thursday why some people get the Taxol every 2 wks for 4 tx and some get it in 12 weekly doses.  I am not anxious to add more tx's but I am curious.  I don't know if any of you are feeling this way, but I am so emotional, I get chocked up at commercials, NPR radio stories, writing this post, anything will pretty much do it.  It must be all the pressure of this and trying to keep up a good front for everyone, especially my daughters. Thanks to all of you who have already started for your words of encouragement and great ideas.  I will be happy on Thursday (or Friday depending on how I feel) to report that I have earned my first smiley face. ",
      "MessageIndex": 90,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 7, 2009 08:16AM Shel wrote: Good morning, November warriors.  Today is day 3 for me.  I feel a little headachy, still waiting for the tylenol to kick in. Otherwise a little light headed but OK. Portergirl, you do count treatment day as day 1.  At least I hope so because a lot of my meds are marked day 2, day 3. Ann, I am so glad you found this site.  You will feel so much support and encouragement from these women.  On the morning of my first treatment, I got on and felt so teary and positive by all of you who sent me messages of support.  Ann, you will find the same thing is true for you.  Don't feel like you are being too needy as someone will always be available to send you a positive message.  You might also check the September or October Chemo thread to see if there is anyone there on FEC.  I know I have seen that regime, but there doesn't appear to be anyone on the November thread taking it.   My sister is coming to visit today and I am planning on tooling around town with her running some fun errands.  After she leaves, it will be nap time for me. I hope everyone has a good day today. Shelley ",
      "MessageIndex": 187,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 8, 2009 02:21PM - edited Nov 8, 2009 02:22PM by Shel ccnani, you should definitely insist on the emend and neulasta.  I have had no issue with nausea at all, My insurance isn't the greatest but I am getting both these drugs and you should too! I am tired today.  Just vacuuming a rug wears me out and nothing tastes good.  But my sweet neighbor from next door is sweeping up all my leaves outside with his cool tractor toy.  What a relief that I won't have to do that.  People are so great! It's a SmartOne for me next time. Have a good everning everyone. Shelley",
      "MessageIndex": 221,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 10, 2009 02:11PM - edited Nov 10, 2009 02:12PM by Shel Dear fellow whimps and warriors, I wanted to wait and post until I could say I felt pretty good today.  Comparatively, I do feel better, but I had hoped for more.  If you are like me and having all kinds of stomach issues (like mine feels like it's on fire all the time), someone here at work has suggested papaya powder.  I am going to try it and will let you know. Thanks to Sherri on the advice about the hair.  I am thinking of getting it cut short (1 inch) this weekend and then just go with the roller from there.  Somehow I am really not into the clippers deal.  Also it was good to hear about the Look Good Feel Better program.  There is one here in my town, so maybe I will check it out. Hope everyone it having a good day and feeling stronger by the minute. Shelley",
      "MessageIndex": 268,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 11, 2009 07:25AM Shel wrote: Good morning, sisters.  I do feel better today -- day 7 for me.  I couldn't eat a real meal, but I can get stuff down and it is beginning to taste more normal, especially fruit. Someone asked about diet.  I am going to go over on the \"nature girls\" thread in the Alternative section and ask about dairy.  I understand the fruit and veggies, non-processed, no-red meat thing, but don't know exactly why dairy is bad.  I eat a lot of yogurt and really think that has helped me feel more normal through this.  Welcome to our new international sisters.  And I want to add my thanks to Brenda for keeping all this gong. Have a good day, everyone.  Shelley",
      "MessageIndex": 282,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 12, 2009 06:58AM Shel wrote: AroninMia and SLV Sherri, we will be thinking of you today.  At least the uncertainty will be over and you will know what you are up against.  Wishing you all the best. Also the schedule says that ReadheadPam is up for her second TX.  If so, you will be the first of us to go for the second round.  Best of luck. Shelley",
      "MessageIndex": 315,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "Shel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91611/profile",
      "Content": "Nov 19, 2009 07:55AM Shel wrote: Welcome to BeccaS and iammom2four!  You will find incredible support and comfort on this site. Brenda, good luck today! Fingers crossed that your MRI comes back negative and it's just these nasty SE's making you dizzy. I don't go in for my second TX until tomorrow as they couldn't get me in today.  The one drawback is that I will be one day less able to enjoy Thanksgiving. Things I miss most on chemo = wine, enjoying dinner out with friends (nothing taste the same and I am too tired and out of it to sit and talk) Things I miss least on chemo = working 60 hour weeks.  I just can't and I don't even feel guilty Most annoying side effect = getting up in the middle of the night to pee.  I have never needed to do that before.  It's sleep deprivation in my mind.  But I just keep repeating \"get the poison out, get the poison out\" and get up. Silver lining = the totally amazing support of family, friend, neighbors, co-worker and complete strangers. It makes me teary eyed just thinking about it.  Good day everyone!",
      "MessageIndex": 481,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    }
  ]
}