{
  "AuthorID": "sherryhuttR…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
  "Posts": [
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Jul 10, 2011 10:31PM sherryhuttRS wrote: I know what you mean about being a number and not a person. I had 4 months of chemo and surgery. The pathology came back negative for both the SNB and the tumor itself, so I guess I should be happy. I was called to make my portacath appt. for removal. So I called back and was told to be NPO and bring a driver. They numbed me up and pulled it out, OMG. First off who made the freakin mistake about my appt being just lidocaine, and not conscious sedaton like it was to put it in. Then I had my simulation appt, first I could not find a parking place, then the elevators were not working, and finally they were running behind so I had to wait an hour and half. I read that sometimes they can use markers instead of tatoos, but I had both. I could not believe the pain from those freakin tatoos all 6 of them. I felt like a lab rat instead of a person. Changes need to be made about how we are treated for bc, maybe they assume with everything we go through bc patients can handle anything. I keep telling my self just 6 weeks of torture left, and then I can take control of my body. Sherry",
      "MessageIndex": 166,
      "PostDate": "10/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 10, 2011 02:34PM sherryhuttRS wrote: I just had my 3rd tx of AC, followed by the neulasta shot tomorrow. Usually the first 3 days are okay because, of the steriod. I went to olive garden the other day and was waiting for our table, when a lady came up to and touched my knee. She said that she was in my shoes 2 yrs ago and that eventhough I have a long road ahead of me, I will survive this and become a stronger person. She really made my day and I got a little teary eyed, because most of the time you catch the odd glance from people but nothing positive. Between this website and support from family and friends, I know all of us will survive and no longer be cancer patients but cancer survivors.   Sherry",
      "MessageIndex": 748,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Apr 6, 2011 09:06AM sherryhuttRS wrote: jcoutee I hope to be in your situation soon. I have one more taxol then surgery. Am really hoping  with lumpectomy, clean margins and no node involvment then rads. One good thing is that my tumor shrunk considerably after my third cycle of chemo. I really want my surgery scheduled soon because until then it is so hard to know what will be found. Good luck to you. We have so many decisions to make. Sherry",
      "MessageIndex": 1149,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 3, 2011 06:54PM sherryhuttRS wrote:  My 21 year old moved out last July with such anger and hatred, I did not recognize that person standing in front me saying all those hurtful words. Since then she has texted me 3 times when she needs something, but no how are you, just I want, want, want. I have not told her about my cancer she is so negative and angry and right now I need positive, uplifting people around me. I do miss her, but am I wrong to not tell her my diagnosis?",
      "MessageIndex": 652,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 8, 2011 06:42PM sherryhuttRS wrote: Hi ladies, I took your advice and e-mailed my daughter about basic info about my treatment. She e-mailed back and said that she is there for me. What a relief to have that dealt with. I will always love her no matter what and with time I hope our relationship can be renewd. My husband just had his head shaved and will continue to do this until my hair grows back. I am amazed how he has really stepped up. He has gone with me to all the appts and chemotherapy. I love this website, encouraging each other and sharing info. Sherry",
      "MessageIndex": 714,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 13, 2011 08:57AM sherryhuttRS wrote: I get AC every two weeks followed by neulasta shot. I have been told that eventhough my tumor is small, it is aggressive. I just had round three and feel like crap. Shaky, dizzy, headache, ringing in the ears, naseau. The meds my Dr. gave me help, but it gets hard to stay positive. I have a great support group that calls and e-mails almost everyday, but unless you are going through it like we are it is hard to tell friends how bad you feel. Again, I am so grateful for this website and the support we give each other. I worry more about my husband then myself. He doesn't sleep well, looks stressed and tired all the time. Oh well, I am told after round 4 it will get easier for both of us.",
      "MessageIndex": 779,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 27, 2011 09:11AM sherryhuttRS wrote: Hi everyone, I just finished round 4 of AC, the next 4 will be only taxol. Have a question. My Dr. says that I won't need emend or the nuelasta shot for taxol. Are any of you doing this? I live in Running Springs, Ca and we have had a huge snow storm, 2 feet of snow overnite. Thankfully I am not working right now so I can take my time shoveling. Before bc I could be outside for at least 4 hours, now after half an hour I am wiped out. The thing I hate the most is being tired, achy, dizzy all the time. I hope taxol will be a walk in the park. My eyebrows have thinned a little, eyelashes as well, but no hair on the body which is kind of nice. I still get emotional over little things. Every once in awhile I have a good cry then I am good for awhile. I am jealous of you guys that are taking a vacation, have a wonderful time. My DH and I plan to get away later on in the year. Thanks to everyone posting comments, I usually feel less overwhelmed after returning to this website. Goodwishes to everyone.",
      "MessageIndex": 939,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Mar 11, 2011 09:21AM sherryhuttRS wrote:  I started taxol last Tues, and it is so much better to handle. With AC I was always dizzy and lightheaded. I was walking up stairs and felt dizzy so I leaned against the door jam, but ended up on the floor. Thankfully I did not hit my head just bruised my backside. So my Dr. ordered an echo and ekg, but I doubt anything will show up. The echo would have been done anyway because of the AC. My Dr. stopped the emend and neulasta and so far it has been okay. My biggest problem is my Hgb, each Dr. visit it keeps dropping and I do not want a blood transfusion. Anyone else have this problem? I am going to get a multivitamin with alot of iron and hopefully that will help. Glad to hear everryone is doing better. Sherry",
      "MessageIndex": 1012,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "May 26, 2011 09:39AM sherryhuttRS wrote: I had chemo for 4 months and will have surgery on Tues. I thought that chemo was the worst, but now am not sure. I have to go to the main hospital for the dye, then over to radiology for the wire to be placed near the clip is from the biopsy. Then I have the lumpectomy. So, the surgery won't be until after the other procedures probably around noon. Has anyone had the surgery done in this order? I am freaking out, because I was hoping to be in happy land with the general anethesia. Am I overreacting? Proably, any input would be great. Thanks, Sherry",
      "MessageIndex": 1458,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 4, 2011 06:57PM sherryhuttRS wrote: I like the letter idea, do not know it would be wise for a face to face confrontation. This has been bothering me since I was diagnosed, I still love her and want the best for her. All my family and friends kept saying to keep the distance for now. But you never stop being a mother. Thanks for the advice.",
      "MessageIndex": 665,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Mar 18, 2011 11:19AM sherryhuttRS wrote: I had my first taxol almost two weeks ago without emend or neulasta, I didn't have any naseau. I have shooting pains up and down both legs and stabbing pain on my ribs. Anyone else have these symptoms? Otherwise it was better than AC, with AC I felt like death warmed over. After the chemo I will have surgery then radiation. Is it wise to do reconstruction before or after rads? I am so tired of being the sick bc patient. Friends and family call or e-mail alot but it is hard to stay positive. I usually have one day per cycle where I have a good cry and then I am okay for while.  Again I thank all of you for words of advice and sympathy.",
      "MessageIndex": 1049,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "May 5, 2011 08:46AM sherryhuttRS wrote:  I am two weeks past my last Taxol, and now am doing post chemo tests. I had my mammo and Petct yesterday. With the Petct the IV was the worst part beause I am used to having them utilize my portacath. But the best news is that my tumor has shrunk so much that it looks like a little speck compared to what the mass used to be. Yeah!  It is good to see that the chemo was worth all the SE's. I think all of us will feel better when the hair comes back. The onc keep telling me that losing hair should be the least of my worries, but I cannot look into the mirror without something on my head. Next week I have scheduled breast MRI and appts with plastics and surgery. Still hoping that there won't be much left to cut out. Positive thoughts and prayers to all of you, Sherry",
      "MessageIndex": 1328,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Feb 3, 2011 08:48AM sherryhuttRS wrote: I was diagnosed in December and will do 8 cycles of chemo, surgery, then radiation. I have had 2 cycles of A/C. The first cycle I felt pretty good. After the second I was very shaky and fatigued, and my hair is falling out quickly. I know that it is only hair but it was still hard to take. My scalp is itchy and sore in places, any remedies to help with that? So far no node involvement. I am really glad that I found this website.",
      "MessageIndex": 636,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Apr 18, 2011 09:25AM sherryhuttRS wrote: I get my last taxol tomorrow and am so excited. There is light at the end of the tunnel. Having this website to share everything going on with all of us is a life saver. Most of you seem to have had your surgery already, where I have started with chemo then surgery, followed by radiation. I made the mistake of watching the sentinel node surgery on youtube. It seems to be a bigger deal then I thought. My ONC thinks because my breasts are smaller that I will need some reconstruction. I am still hopeful for no node involvement and clean margins, because of that I want the surgery as soon as possible. We are closing on the finish line.",
      "MessageIndex": 1198,
      "PostDate": "18/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Jun 9, 2011 12:10PM sherryhuttRS wrote: I have not posted for awhile. We are having foundation issues with our old house. I had my lumpectomy and sentinel node dissection and got the results yesterday. My surgeon got clean margins and nothing in the nodes. I was so happy to hear the news, because so many bc pts that had lumpectomies had to have one or two more surgeries. My hair is finally coming in, little fuzz balls all over. Like petting a soft kitten. Happy to see most of had chemo and have moved on to other treatments. I start RADS in July.",
      "MessageIndex": 1508,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Apr 21, 2011 11:00AM sherryhuttRS wrote: I had my last Taxol on Tuesday and could not wait to get out of that chair. The nurses at the infusion center were great, but hopefully I wo'nt be going back. They gave me a certificate of chemo completion and on the back all the nurses that took care of me signed it. Eventhough I have finished that part of my treatment, still feel that I am behind all of you, because most of you have had surgery already. I still think the worst part about bc is the hair loss. I know it will grow back but I still want it now. When I go out shopping and get looks or maybe their not even paying attention to me I still feel overwhelmed. I know this is silly because who cares what other people think. Have any of you gone to a bc suppport group in your area? This forum really helps alot but I was just wondering if meeting face to face with other pts would help even more. At my last chemo I met a bc survior and she really stressed the face to face meetings. She had bc 4 years ago and still goes to meetings to help others. As for sleeping I have a chronic pain condition, so I take norco for the pain and elavil to help with sleep. Thankfully I have one thing going for me.  I really need to get to the surgery part to see what of the bc is left. Then I can start thinking more positively.",
      "MessageIndex": 1230,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "May 26, 2011 12:48PM sherryhuttRS wrote: I am having the dye first, then go across the street for the wire placement, then have surgery. I am having lumpectomy after 4 months of chemo, Why is it done this way? I was hoping to be asleep for the whole procedure. Any input would be great. Thanks, Sherry",
      "MessageIndex": 5,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    },
    {
      "AuthorID": "sherryhuttR…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120911/profile",
      "Content": "Jun 4, 2011 11:55AM sherryhuttRS wrote:  I had the blue dye first that contained lidocaine as well, so it was painless. But the wire insertion was unbearable, staying squished in that F@%&$ machine while the pushed and pulled the wire to get it just so. I have a chronic pain conditoin and thought that the bc stuff would be easier, but not. OMG. I just hope that there will clean magins and that the sentinel node will be negative. I find out next Wed. I'm so grateful for this website, communicating with women going through the same issues.",
      "MessageIndex": 32,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769441",
      "Title": "Radioactive Injection into Nipple NOT TERRIBLE waynesgirl50 Motherofall6"
    }
  ]
}