{
  "AuthorID": "sherbab",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
  "Posts": [
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Nov 12, 2013 06:20PM sherbab wrote: Spoom - I just happened across your post today and I am very sorry to read this. You are definitely at a very fast paced time in the process...when I look back, I can't even imagine how I processed every decision we made but you will get through this. Be sure to take some me time while you are in the middle of this whirlwind of decisions. Wishing you the best. Chipmonk & Blissful, I am sorry to read about your recent diagnosis as well. Hugs to all of you! Sherri",
      "MessageIndex": 83,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813365",
      "Title": "Found breast tethering while fixing my hair. :o( Spoomsister Roxybabes"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 5, 2013 09:27PM sherbab wrote: Hi Marty, I have checked off two since September and now I am on Carboplatin/Gemzar combo.  The MO showed me the list of the various chemo combos I have should this one not work but in my case, the TN typically only responds to chemo so I will just have to go through the process and see how they work out I guess. ",
      "MessageIndex": 1,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815417",
      "Title": "Poor Response to Every Chemo MartyMart MartyMart"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Jun 19, 2014 04:01AM sherbab wrote: I am actually Triple Negative.  I did see it is given as a combo as well as alone and it looks to me like mine will be given alone.  I did get scheduled to see the MO before they start it Monday afternoon.  I am so happy to see the two of you have had good luck.  I have no hair now from the last go around with a clinical trial drug so to see it come back some would be an actual bonus.   It sounds like the side effects are not the worst but frankly I am willing to take them on too if it will just slow down the tumor growth I have.  For some reason for me chemo is like fertilizer to my tumors.  I am still looking for the 'one' to get me stable.  Thank you for sharing!  I am actually looking forward to Monday to get this started again!",
      "MessageIndex": 4,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822043",
      "Title": "Starting Navelbine on Monday - Any advice sherbab RonnieKay"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "sherbab wrote: Good Evening, My doctor is putting me on Navelbine on Monday though I have not met with her, the orders just showed up and I have an appointment.  Anyone with experience on Navelbine alone?  TIA.... Dx 6/7/2012, IDC, 1cm, Stage I, Grade 3, 0/13 nodes, ER-/PR-, HER2- Surgery 7/10/2012 Lymph node removal: Left, Right, Sentinel Surgery 7/27/2012 Mastectomy: Left, Right Surgery 7/27/2012 Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 9/5/2012 AC + T (Taxol) Surgery 6/7/2013 Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Dx 9/3/2013, 4cm, Stage IV, Grade 3, ER-/PR-, HER2- Chemotherapy 9/6/2013 Taxotere (docetaxel), Xeloda (capecitabine) Chemotherapy 11/25/2013 Carboplatin (Paraplatin), Gemzar (gemcitabine) Chemotherapy 1/22/2014 Ixempra (ixabepilone) Chemotherapy 3/26/2014 Taxol (paclitaxel) Radiation Therapy 5/29/2014 Brain Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822043",
      "Title": "Starting Navelbine on Monday - Any advice sherbab RonnieKay"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Sep 16, 2013 09:07PM sherbab wrote: Please add me to this list now as well.  Originally Stage I with a BMX in July 2012.  Just had my DIEP flap reconstruction in June 2013 after I went through 20 weeks of A/C chemo and in September it was discovered I have a recurrance in my newly reconstructed breast, my left lymph nodes and bone mets in my left femur.  This is all very new to me and a little overwhelming but I am reading a lot on here and a lot of you have great words of wisdom and insight and I appreciate that this board is here for that reason.  I am now on Taxotere and Xeloda and will find out about the bone mets as soon as I get scheduled to see that doctor.",
      "MessageIndex": 460,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 10, 2013 10:41PM sherbab wrote: schubemj, I am very sorry you are here!  My husband, who is overly supportive, doesn't agree with the boards only because he thinks they complicate the thinking process but I believe I just get expert opinions.  Welcome!!",
      "MessageIndex": 509,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 5, 2013 09:35PM - edited Dec 5, 2013 09:35PM by sherbab",
      "MessageIndex": 10,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815405",
      "Title": "I'm crying all the time Roxie43 Kjones13"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Feb 12, 2014 12:22AM sherbab wrote: I am in the same boat, just started losing my hair last week for the 3rd time...not sure I will ever get my own hair back.  Need to figure out how to put an avatar here but I would never have guessed the hair in this picture to be a wig!  Can't wait to see the new look.  I may have to venture over to HSN myself!  Enjoy your trip!",
      "MessageIndex": 3,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817949",
      "Title": "Getting ready to welcome a new wig!! justjudie Annie62"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "sherbab wrote: Good Evening, I am hoping someone has some ideas for me......I am currently being treated at MD Anderson in Houston but it is not a clinical trial any longer,  just standard chemo because I am TN and they can't seem to get me under control.  About a month ago I had brain mets and had full brain radiation.  I am now being presented with the potential opportunity to relocate to the Denver area, dream relocation for my husband and I.  Can anyone tell me about where to look for a new MO and care? I am not sure MD Anderson is actually a requirement for me any longer but I want to make sure before we make a major decision like relocation we have quality of care.  We understand relocation at this time could be an interesting prospect but honestly if I can spend my time in the location we have wanted to get to ultimately it could be a win win not matter what at the end of the day. I just need to understand exchanging MDA for some place in the Denver metro area.  Thank you!  Sherri Dx 6/7/2012, IDC, 1cm, Stage I, Grade 3, 0/13 nodes, ER-/PR-, HER2- Surgery 7/10/2012 Lymph node removal: Left, Right, Sentinel Surgery 7/27/2012 Mastectomy: Left, Right Surgery 7/27/2012 Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 9/5/2012 AC + T (Taxol) Surgery 6/7/2013 Reconstruction (left): DIEP flap; Reconstruction (right): DIEP flap Dx 9/3/2013, 4cm, Stage IV, Grade 3, ER-/PR-, HER2- Chemotherapy 9/6/2013 Taxotere (docetaxel), Xeloda (capecitabine) Chemotherapy 11/25/2013 Carboplatin (Paraplatin), Gemzar (gemcitabine) Chemotherapy 1/22/2014 Ixempra (ixabepilone) Chemotherapy 3/26/2014 Taxol (paclitaxel) Radiation Therapy 5/29/2014 Brain Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822478",
      "Title": "Denver area treatment locations? sherbab sherbab"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Jul 7, 2014 09:28PM sherbab wrote: Thank you to all!  I now have a comfort level that I can get the treatment we need in the Denver area.  Now time to sit back and wait to see how the other part, the work part, of the process goes and then I will probably be in touch for the recommendations. Take care!  Sherri",
      "MessageIndex": 3,
      "PostDate": "07/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822478",
      "Title": "Denver area treatment locations? sherbab sherbab"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Apr 27, 2014 03:29PM sherbab wrote: Adnerb, I have to go one more 28 day cycle that starts tomorrow.  All of my staging will be on 5/28 and then they will tell me on 5/29 what the next steps are.  ",
      "MessageIndex": 710,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Sep 22, 2013 05:49PM sherbab wrote: It is nice to read that there is a new normal everyone is attempting to adapt to out there. I am so overwhelmed I am not even sure if I have my diagnosis correctly set up. I went from stage I to IV since June and my tumor is visible in my reconstruction. Totally not right!. My head is spinning. I am on Xeloda and Taxorere and Xeldoa fave me hand and foot on my feet at day 13 so I didn't get 14 days. I find out tomorrow what we are going to do next. It is nice to see there are options out there, I just pray everyone finds that silver bullet that has been mentioned a lot. I will definitely be hanging out in here more and hope I get to know everyone better! Take care!!!",
      "MessageIndex": 358,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Apr 27, 2014 08:28AM sherbab wrote: Hello All!   I am not sure when the last ti e I posted here if much at all but I spent about an hour catching up from March to now to see where everyone is.  It is amazing there is such a wealth of information here.  I am currently in a clinical trial at MD Anderson in Houston.   It is 3 weeks on, one off with Taxol and the trial drug Bay.  I completed my first 28 day cycle and start again Monday.  I am pretty sure it is not working.  I noticed someone in early March said their TN tumors regenerate at the rate of something like 90%.  I am pretty much in that same area.  I can get new tumors every week.  It is crazy.   If I get taken out of this trial, which I won't know about until after Memorial Day it could be a 4 week wait to be able to join another if there is one.  This is already causing me anxiety because I definitely have 2 more tumors that have come up during this first cycle.  The spread is now nodules in my lungs and adrenal glands. They won't biopsy anything until they know how my restaging goes after this 28 day cycle.  Halaven is my only option that I have not tried that is outside of a trial.  The weird part is mentally I feel great.  I work full time and lead a pretty normal life.  Other than fatigue chemo doesn't impact me too negatively which is so weird I always wonder if it is actually getting in my veins then I remember I don't have hair so yep it is in there.   Not sure what to do next.  Jump off the trials train and try Halaven or find that next trial.  This is so frustrating and hard.  Where is the handbook for cancer! Thanks for listening !",
      "MessageIndex": 706,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "May 9, 2014 05:54PM sherbab wrote: Cat - how long did it take your MO to get the results back on that test?  I signed the release on sending my off for Foundation One testing when I had my very first to the clinical trials side of MD Anderson and that was at least 7 weeks ago and was just wondering about it this week.  I actually don't see my doctor again until the 28th of May so I was hoping they might have something by then. It sounds like these results along with your CT scan made for a interesting appointment!  I can't wait to see mine now.  I had no idea what sort of things it would report out.   ",
      "MessageIndex": 738,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 5, 2013 11:51PM sherbab wrote: wishing you the best test results surfdreams! ",
      "MessageIndex": 480,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 9, 2013 01:32AM sherbab wrote: Myra, I was trying to convince them I didn't need the port but got the chemo vein on both hands from Taxotere and between the 3rd and 4th session I had the port surgery and very happy I did. I am not sure if they spots will scar but they are definitely on the tops of both hands and on my left it runs past my wrist and since they are on the top where the veins are you can't really cover it up.",
      "MessageIndex": 2,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815521",
      "Title": "Anybody have Chemo vein? MyraVH MyraVH"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Apr 30, 2014 05:38PM sherbab wrote: Gma, sorry to hear this, while I did not know her I but definitely pray for her and her family during this time.  Slow, thank you for your update on the Halaven, I am going to push through until the 28th of May when I get restaged but they said if there is any sign of progression I will be removed from this trial in particular so I have a feeling they will pull me out because I have found the new lymph node or tumor, not sure which but I will see it through to the testing and then determine if there has been any success since I just started my 2nd round.   My trial is Taxol and Bay (trial drug is called Bay and it is by Bayer).  If you do go into that one I will PM you some of the details they forgot to tell me about for the first three weeks....they were some VERY long days.  Brenda, so excited for you to be going to Alaska.  We were supposed to be leaving on May 16th for Alaska but the clinical trials is not as forgiving on the schedule as my regular MO so we had to cancel and if I get any break where we can manage a quick last minute trip we are going.  I do not have a bucket list but this is #1 on my to do list!  Quality of life is definitely important to me during this time - getting this somewhat stable has to be a little more of a priority so I deal with the rigid schedule for now but if I find that things just aren't working like they should I may jump out of the trials and stay local and try the Havalen.  Picking up and relocating 3 - 4 days a week to Houston is taking its toll and we are only in cycle 2.  Thankfully it is only a 4 1/2 hour drive and it is drivable but being home has its merits! ",
      "MessageIndex": 724,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Oct 8, 2013 01:07AM sherbab wrote: Thanks for posting so much information! Lots of things going on with everyone and it sounds like there are many options depending on where the mets are and what has already been covered as far as surgery and chemo. I have seen a couple of references to superficial bone mets....are there different types? I am having my first CT guided bone biopsy tomorrow to look at my femur where they are 99% sure I have bone mets. Did many of you seek a 2nd opinion even if you like your oncologist? I am told mine is one of the best in the Dallas area but I can go to MD Anderson for a 2nd opinion if I want but they don't think I will get any different outcome right now, even my breast surgeon said she didn't feel I would get a different outcome. What have you all experienced in this area? Xeloda doesn't seem to like me - I took 12 of 14 days for my first round and had to stop because of hand, foot and mouth but the issues were on my feet and hands, thankfully not my mouth and this round they put me on 10 days with 8 pills a day vs. the 10 pills and now I am having issues on my hands and feet after 8 days. I hope there is another option or maybe my body will adjust on the next round....I have no idea how many times they will try before they change to something else. As for working, I am working full-time and haven't stopped but I do have the ability to work from home when needed and have found myself working from bed when I just can't seem to get moving forward some days. And finally, I have lost my hair for the 2nd time due to the Taxotere but if the chemo is working I will deal with it, though bummed because it was just starting to get long enough to style from the last round. Thanks for listening and your input! Sherri",
      "MessageIndex": 404,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Dec 5, 2013 10:04PM sherbab wrote: Staypuff - I totally agree!  To hear from Adnerb and marywhy that there is progress makes me very happy.  Adnerb, I have just completed my first two weeks of Carboplatin/Gemzar and am praying for positive results!",
      "MessageIndex": 478,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sherbab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159560/profile",
      "Content": "Apr 28, 2014 12:23PM sherbab wrote: Jen, I love your post.  I was early stage 2 years ago when I started coming to BCO and now I am stage IV with mets in a clinical trial because my body hates me.  I too have no ill will toward AR but at the time I was originally diagnosed my MO said I had less than 10% chance of recurrence...education is something I would have preferred any day over a celebration.  I didn't understand what I was personally dealing with and I didn't have enough people in my life to help me understand the severity of my personal BC.  BCO has been a good educator for me and while I don't post a lot I do read a lot and a little education by those in the public eye would go a long way.  Not trying to stir it up more, just pointing out that some of us don't even know enough to advocate for ourselves because there is no magic BC handbook and maybe someone we see every day in the public could put enough of a little question mark out there to push someone to keep pushing personally. ",
      "MessageIndex": 117,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/820513",
      "Title": "ARRGGH, Amy Robach kebab tangandchris"
    }
  ]
}