{
  "AuthorID": "Sherri125",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85405/profile",
  "Posts": [
    {
      "AuthorID": "Sherri125",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85405/profile",
      "Content": "Sherri125 wrote: Hello everyone. I started reading some of the messages in this forum yesterday, and decided to post today. I am in the waiting process to get biopsy results back, and am to call the general surgeon's office in 3 days to schedule a consult and discuss my biopsy results. I was surprised that the radiologist's office refers patients to general surgery after they have a biopsy. I just had a core needle biopsy today, and right after the radiologist took 2 core samples, I developed a hematoma. So far, they are leaving the hematoma alone, and just letting my body absorb the blood. I have dense fibrocystic breasts that feel lumpy, but around 2 months ago, I accidently discovered a pea sized lump that felt different. I watched it to see if this lump would reduce down like my fibrocystic lumps do during menstrual cycles, but this one didn't change. I scheduled an appointment with my PCM and she also confirmed that I had this little bugger in my right breast. Last week, I went in to mammography and they did a mammogram and an ultrasound. At first, they said everything looked great on the mammogram, but because both my PCM and I could palpatate that lump, they were going to check it out with the ultrasound. Well, what appeared on the monitor was \"a suspicious mass\" that did not appear to be a cyst, and apparently wasn't characteristic of a fibroadenoma. So now today, I have bruising all over my right breast, due to the core needle biopsy and hematoma. I'm wondering if anyone else had a hematoma develop during their biopsy and if so, how long did it take for you to reabsorb it? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736147",
      "Title": "New to board and waiting for biopsy results. Sherri125 Sherri125"
    },
    {
      "AuthorID": "Sherri125",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/85405/profile",
      "Content": "Jun 19, 2009 03:28PM - edited Jun 19, 2009 03:30PM by Sherri125 Angeljoy - Thank you so much for your compassion and you're helpful advice. I'm putting ice packs on it, and using tylenol. I think the waiting game is the hardest part for me. I've been doing my research using pubmed and webmd and was relieved to see that there was a good chance that this thing could turn out to be benign. I was hoping they would see the image on the ultrasound monitor and say that it was one of my fibrocystic cysts and just aspirate the fluid from it, but no dice. I had to have another mammogram of my left breast yesterday, as they wanted to compare my previous mammograms to see if there were changes occuring in that breast too. The good news was, nothing showed up. I suppose they are going to watch me now, since all of my mammograms have shown nothing suspicious, but I still felt that right breast lump, and the ultrasound did reveal something there. Anyways, I wanted to thank you for your compassionate support. It is scary waiting with this uncertainty, but just having you're support and words of wisdom helps to lesson that fear. If all goes well, I should be getting my results back by Tuesday or Wednesday, and will post about it then. Idaho - I wish you didn't have the same thing happen to you during your biopsy. It is comforting to know that I'm not alone in this, though. They put a marker into the lesion after they biopsied the site. The actual biospy wasn't that painful at first. The core needle went a little further into non lidocaine treated tissue, which felt like a moderate sharp pain, but nothing too bad. The second sample was alot better, I didn't feel it at all. It was while they were applying pressure that this hematoma lump started forming in my breast. It wasn't painful until the lidocaine wore off. Its only mildly sore today, but the radiologist was concerned that I would need stronger pain meds than tylenol. I opted for just regular tylenol. It doesn't seem to be that painful to where I would need something stronger. Thank you again for you're words of reassurance. It helps to calm those \"what ifs\" that linger in the background.    Crystella - I will be keeping you in my thoughts and prayers during your treatment. Medical advances have come a long, long way, and there are so many better choices in treating BC than 30 years ago. I can't fully understand what any of you wonderful ladies are going through, since I haven't traveled in your shoes, and am still in the biopsy results waiting stage, but I wanted to say that I'm here for you as well. ",
      "MessageIndex": 4,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736147",
      "Title": "New to board and waiting for biopsy results. Sherri125 Sherri125"
    }
  ]
}