{
  "AuthorID": "sherrmue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
  "Posts": [
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Oct 30, 2018 12:58AM sherrmue wrote: Do I have to be stage 3? Was initially diagnosed 3c. 8 years alive after 10cm left, 8cm right with all positive margins. 15 nodes positive with extension in 2010.My ILC does not show on imaging, except in bone. Docs knew I was stage IV in 2010, but could not see it. Cancer had been there for a long time. I’m still here even with a bad start! Fight,Fight,Fight!",
      "MessageIndex": 41,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/845339",
      "Title": "Large tumour survivors LM070917 Mumoftwo416"
    },
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Jan 13, 2019 10:11AM sherrmue wrote: Hi! I think it’s great that you are thinking ahead. If it turns out you don’t need masts, nothing lost. Just a thought on totally flat and removing fat: comfort! I had double masts with 3rd level LN dissect. All the fat on my chest and axilla were removed. It was necessary to close my chest and remove as much disease as possible. There is no padding between skin and bone and I must say, is uncomfortable and sensitive even after almost 9 years. Having a nice even layer of fat over your ribs will keep you comfortable. Sherri ",
      "MessageIndex": 9,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/869129",
      "Title": "Going Flat: Choosing a surgeon CJB71 Q4life"
    },
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Oct 25, 2018 12:40PM sherrmue wrote: Hi! Sherri here. Advanced BC since 2010. Was already stage IV, but they couldn’t see it in imaging, still doesn’t show up in imaging. Very web-like. Negative tumor markers all though the years. Labs and more recent spread to the skin on my upper back and stomach are the only ways to monitor this very insidious and persistent cancer. Earlier this year I was 2-3 months from death from liver infiltration. Imaging did not show tumor. After ever liver test known, I had a trans-jugular biopsy which proved extensive disease. Id exhausted every hormonal therapy so though it was curtains for me. My doc tried an old oral chemo and it’s been a miracle! Liver function back to normal, skin tumors gone, peritoneal cancer causing much less pain than in past years. I’m still here 8 years on! I’m not the same person as I was. Cancer has been very aging for me, but I’m ALIVE! And ok with looking old. I’m thankful for every day I have. The little things give me pleasure now, the warm sun on my face, chilly autumn nights, a cuddle with my dog Frankie birds singing in my yard, a delicious meal, talking with my son.......",
      "MessageIndex": 623,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Oct 29, 2018 02:19PM sherrmue wrote: Hi, Bumble-bee 34, Wow! You sound like an incredible young woman. I’ve been without breasts for 8 years and have found most mastectomy bras and inserts to be quite uncomfortable. I can’t wait to take them off each day. Even the soft and light sports bras for non mastectomy women are uncomfortable. I’ve been “making do” for a long time as many of us do. I’ll take some time to really think about how I would like my mastectomy bras and inserts to feeland function. Talk to you soon, Sherri ",
      "MessageIndex": 1,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/867159",
      "Title": "Mastectomy bra and inserts Bumble-bee_34 Robyn57"
    },
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Oct 31, 2018 10:55PM sherrmue wrote: Hi, lissagayle, Just read your post this minute and that you went to the doc today. No words can really ease the worry you must be feeling. Can say there are many reasons for breast pain and a lump or lumpiness. A clogged duct, infection,broken blood vessel, an area of the breast with more breast tissue and therefore more sensitive to hormones and much more. I knew since childhood my grandmother, her sisters, their cousins and my mother had breast cancer. It didn’t help very much, really. Anxiety! yes! I don’t tend to be an anxious person and have always hit crisis straight on, but my diagnosis threw me for a loop. I had to take some Ativan for awhile at first. Don’t hesitate to ask for what you need from your docs. They are there to care of all of you. Please let us know how you are doing if you feel like it.",
      "MessageIndex": 11,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868050",
      "Title": "Feeling lost, worried, anxious and mad. lissagayle sherrmue"
    },
    {
      "AuthorID": "sherrmue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137367/profile",
      "Content": "Oct 28, 2018 05:37PM sherrmue wrote: Hi! I’m Sherri, I’ve been living with advanced BC since 2010. My docs feel I was in stage IV for several years before diagnosis. If docs are throwing up their hands, get another opinion. NOW. Find the best cancer center you can reasonably get to, even if it means driving farther than you’d like. I live in a small town with a small town cancer center. Docs were throwing up their hands when I was diagnosed. The spread was so extensive on my chest and presumably lymph nodes they were flummoxed. They knew it had already spread. I got a second opinion at a well respected cancer institute 100 miles from my home. I truly believe I’d have long since died had I stayed in my hometown to be treated. I’ve had several scares, most recently earlier this year. I have ILC with a particularly invisible growth pattern that does not show on imaging, other than in bone. My labs were showing that my liver would soon fail or I would bleed to death as my platelet count became very low. My liver looked fine on CT & MRI. Biopsy confirmed extensive infiltration of ILC. I had lost a lot of weight. I am 5’6” and weighed 110#. I’ve used up all of the hormonal and targeted therapies. During this period I additionally began sprouting skin tumors on my shoulders and back at the rate of 1-2 per week. I thought it was the end. My doc prescribed Xeloda, oral chemo, in May. It’s really a newer generation of an old chemotherapy drug. After taking this drug for only about 2 weeks my skin tumors began shrinking rapidly. My liver enzymes began falling. I’d has cancer related (or so they thought) anemia for about 2 years. I no longer have anemia, I weigh 126# (gained 16#), my liver enzymes have returned to normal. Xeloda may not be the right drug for your breast cancer, however I’m telling you these things to let you know that there is hope. My end of the road is not yet here, although a few months ago it appeared so. Get the best treatment you can. This is your life. There’s no time for doctors feelings (yes, docs down here were calling the doctors at the cancer institute where I am seen, angry because I went to them). They tried to guilt me into staying put. I knew finding the best treatment possible was my only hope of extending my life for more than about 2 years. 8 years later I’m feeling less burdened by cancer than I’ve felt in a long time. And, driving is not so bad for such an important cause if you have a good cancer institute where you could be seen. Let loved ones shuttle you about. Sit back and enjoy the scenery and sip you favorite drink. You deserve it. I’m sorry you have to face this terrible disease. It’s frightening and confusing. I’ll be thinking of you and wishing you the best for a substantial and long lasting reprieve. Fight,Fight,Fight! ",
      "MessageIndex": 4658,
      "PostDate": "28/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}