{
  "AuthorID": "shiny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
  "Posts": [
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 5, 2010 03:15PM shiny wrote: I am glad you will be seen by the lymphoedema clinic. On your first visit which should be asap, ask to see the senior therapist and gie that most experienced person the full unabridge story of your rash, from the start. Don't loose that mobile number, and.. maybe get a second opinion, unless you 100 % trust this physician's experience. Good luck to you. Shiny",
      "MessageIndex": 18,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751959",
      "Title": "Rash and fever? TerriD TerriD"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 4, 2010 02:56PM shiny wrote: try anyone who will act, bottom line it needs tending too. Go girl, Shiny",
      "MessageIndex": 16,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751959",
      "Title": "Rash and fever? TerriD TerriD"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 4, 2010 02:18PM shiny wrote: Hi Terry, Very concerned for you reguarding that. I agree with everyone here that you should not leave this be and must get the correct diagnosis and treatment. I have just gone and got the  name of the med for you that I am meant to have with me at all times in case of any hint of infection etc on my side slightly affected by lymphoedema. In summer 2008 I had a very suden rash with feeling very ill and the kind of red hot rash pictured in the thread above, and some fever. I was prescribed \"KLARICID 500\"(clarithromycin and it started to work overnight and resolved things very quickly so I was very lucky. (I don't know if this is the one they would prescribe for all as I have a very delicate stomac and many allergies but it did do the trick very efficiently). BTW: I had no sign of a cut etc to show an infection introduction site. I am seen at the Lymphoedema clinic at one of the best cancer hospitals in Europe. I was told  to always have  a two week course of the meds in my posession and to take for any possible repeat of the symptoms as it is very important to limit any flares. So, based on this, I concur with the rest of the ladies that you need to be looked at and probably followed by a specialist lymphoedema clinic. I am very suprised at what you have been told so far, considering the risks if these docs are wrong, so do press on and I wish you the very best. Shiny",
      "MessageIndex": 11,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/751959",
      "Title": "Rash and fever? TerriD TerriD"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 21, 2008 08:49PM shiny wrote: Mia, glad you've got some great support from all the above. As you have the strength to be a super mom, you have the strength to tackle this bc too.  Try to be a super mom TO YOU this year, I always think that's good advice. Just helps you think about being kind, generous, patient with yourself as you figure out how to manage this one day at a time. It takes a while to transfer some of that great nurturing onto yourself when you are used to being the selfless mom, but honestly you need to. The kids are great though for keeping you in the now and positive. BTW: on the mastectomy front. I am 40 with young children,had a double mast with siea immediate reconstruction. Kids were fine with it, as I kept the info simple. They like my new boos with the happy face stitches. (2 circles where nipples were,1 circle around new belly button place, and 1 happy smile one( from hip to hip). I explained the whole bc thing as mum has bad \"lumps\"(cancer) that have to come out. I will have a very strong special potion (chemo) to help with the lumps. It's very good with the lumps, but will make my hair fall out, but that's OK because it will come back. Will you help me choose some nice hats? It will make me feel sick and tired some of the times but I am not scared as I know it is working to make me better. Mia,I hope that's not too much info. I just found it really helped me cope to know that the children were coping and the above was right for us. Hope some of that helps you. Sending you very strong good vibes and a great big hug. Shiny   ",
      "MessageIndex": 13,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/705460",
      "Title": "Newcomer of Breast Cancer at stage III JoyMia7 apple"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jul 15, 2009 10:26PM shiny wrote: Ben, So sorry for your loss.  I pray that you will in time find some comfort in that she no longer suffers. Also in clearly how much she was cared about and valued here on the boards as attested by the replies to your very sad announcement.  My sincere condolences to you and to our children Bless you, Shiny ",
      "MessageIndex": 37,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737409",
      "Title": "my beloved rooni has went home to the lord rooni janie44"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jun 3, 2008 05:10AM shiny wrote: Hi Tweeker, I have a high incidence of bc in family. I am not a BRCA 1 or 2 +(had test, but only showed a slight difference in my BRACA 2 gene which is not recognized as BRACA 2 +). Anyhow, I had left IDC but chose bilat mast with immediate recon for peace of mind, on at least a new local cancer. I have no regrets at all, one less thing to worry about, a very good symmetrical look (SIAE flaps) and natural feel. My cancer surgeon said that she supported my decision to have bilat,as in any woman with BC there is at least 30percent chance of a new BC and with my high family history of BC at around my age (40) that the risk was likely to be higher. That was good enough reason for me. Good luck with your decision. take care. Shiny",
      "MessageIndex": 12,
      "PostDate": "03/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/706536",
      "Title": "prophylactic mastectomy-your input wanted tweekerbeeker lilith"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Aug 31, 2009 01:58PM shiny wrote: Hiya, I totally understand the worry. The onc just has to be thoughrough, as you would want him to be. I had 2 bone scans ofter my initialy staging one, both for scares, but turned out fine. But there is no denying that knowing it just coudl be \"something\" is a stress and a drain, no matter how optimostic you are, the waiting, sucks. I am 2 yrs post dx and at least I can say that with every scare, it takes a little less out of me, I am learning to just do the darn test and keep busy busy. What will be will be. Praying for a likely good ol, B9 for you. Take care, keep busy. Shiny",
      "MessageIndex": 3,
      "PostDate": "31/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739494",
      "Title": "Bone Scan somerset72 Shappy"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Feb 18, 2009 01:00PM shiny wrote: Hi, I just seen your thread.  I am triple neg too, with young kids. Last July (see my signature for my stats) I had a enlarged lymph node biopsy scare. I was at the PS to have a routine post surgical check, I mentioned a swelling in my groin. They thought, just maybe a hernia or something, so sent me up for an ultra sound there and then. I was shocked when the ultra sound doc said, it's an enlarged lymph node, so as you are here, we shall do an immediate aspiration type biopsy. They had just installed a new ultrasound machine so the technician offered me a picture of said enlarged lymph node, and boy did I look at that picture over the following week. I spoke to a cancer nurse who did reassure me somewhat that it was much more likely that it was just \"reactive\" due to fighting an infection etc and not cancer, which just about made me breathe. It turned out to be fine. It still is swollen, up and down. I think I am used to it now and see it as my \"super lymph node\" the one that does all the work for the 16 others that are missing. It can be nothing and I pray that is the case for you. Great you are going it sorted now. And great you are giving a present to your angel, angels should be celebrated, they make such a difference! Shiny",
      "MessageIndex": 24,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729279",
      "Title": "OH MY FREAKING GOD!!! PART 2 HELP ME!!!!!!!! whoopsiedoodles JoyRebecca"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 21, 2010 01:39PM shiny wrote: To River's family, my heart felt sympathy. To her Husband John, I am rarely at a loss for words but when I read the letter you posted a little while ago during your stay at the beach house, I was so moved and touched by it that I coudn't post. Your familie's bond and love came accross with such clarity. The peace your dear wife felt surrounded by her most loving family in such a beautiful place, I can't imagine the pain and the strenght it took you, yet your family is clearly so rich in the best possible sense.  No doubt, your lovely wife will continue to impact and improve lives and shine her brilliant strenght and grace in many many lives in so many special ways;  As indeed, she did when she was here. I read her many times, and so many were inspired by her as you know and understand. Wishing you and your family much love and healing. Shiny ",
      "MessageIndex": 97,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746933",
      "Title": "River is an Angel now. Fitztwins susanmary"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 21, 2010 02:13PM shiny wrote: Eliza, So sorry you are going through this worrying time. Glad you found this site. It's a God send whilst you wait. There is not much to say at this point except. 1- You are absolutely doing the right thing calling your doc in the morning. ANY changes have to be investigsted. You are doing exactly the right thing, not to ignore it, and stay worried any longer. 2-If it is BC, it's always good to find out early. If it isn't BC and you know the majority of breast issues are not BC, then there  is no sense in prolonging your worry for nothing, as even the stress coming from your worry is not good for your body. So, Yes daaling, you are being a sensible, pro active, inteligant women, so don't let anyone \"fob you off\" until you are satisfied that this has been correctly and thouroughly checked out; By that I mean, mamo and ultra sound as a minimum from a specialized centre for bc, so that the people looking at the mamo or performing the ultrasound are experts. The majority of investigations will reveal B9 conditions of the breast, however, that is no reason to not fully investigate breast changes. You know your body, you've had 4 kiddos, you go get that peace of mind back. And take care, Wishing you all the best, you are doing the right thing. there is no point in guessing about things tonight, no crystal ball here, but making that call and following through is indeed, the best thing you can do for you. Keep poping into BCO and posting as much as you need through the waiting, you won't be alone here. Lots of support from lots of great ladies and lots of people in very similar position. All my best, hug. Shiny",
      "MessageIndex": 1,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750099",
      "Title": "no lump, but dent (indentation) on one breast eliza0104 Jujube43"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jun 17, 2011 12:58PM shiny wrote: Hi Kathleen, I had about 1 year of chemo menopause as of the last round of my high dose FEC-T 100 back at the end of 2007. The oncs all said it was very unlikely that the periods would come back as I was 40 at end of chemo. Well, they came back, soon regular as clock work, now in the last 6 months they are unpredictable, all or nothing. Get very tired etc as if about to have one, then nothing, or  the oposite.  I would look into it, get a blood test, and thyroid test for starters, with your hormone levels (what ever the basics are for this stuff). It's always good to know, cause i firmly beleive that it's best to be aware of what is going on, so you can feel your best and act on anything that could do with some attention. Sure more insight will follow, all the best ! Shiny ",
      "MessageIndex": 1,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/770462",
      "Title": "Is my period trying to come back? kathleen1966 kathleen1966"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 16, 2010 02:47PM shiny wrote: Your too kind..hi hi. You'll be back!! Food's fab and chief girl, top cookie Kona also. Have a lovely high cal day. Thinking of you too Kona. Shiny",
      "MessageIndex": 563,
      "PostDate": "16/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 2, 2010 04:35AM shiny wrote: Kona!! Happy Birthday!! Hope you get to Boston in one peice, and that your cake fantastic party is deeeeelicious in everyway! I used to have a B/F in Boston in a former life, great place. Enjoy, then have a decadent sleep in in the moring and get your B/F o bring you coffee and breakfast in bed. xx All my best Shiny",
      "MessageIndex": 788,
      "PostDate": "02/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Feb 20, 2010 11:31AM shiny wrote: Konakat, I haven't been posting much lately, kids off school busy mummy. But I wanted to send you a hug and tell you that I have read your latest challenges well that's one way to put it and am keeping you in my prayers. Sounds like you have an action plan, and from what I can read there are some great outcomes from those protocols mentionned up here. Anyhoo, just thinking good thaughts for you- and sending you out my peachiest vibes. Shiny",
      "MessageIndex": 196,
      "PostDate": "20/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 8, 2010 12:17PM shiny wrote: Hi Konakat, I don't think anyone is taking down a list but, yep just chimming as one more of your fans. Chiming in with lots of good peachy vibes coming in for you, especially on Wednesday.. mind with that fab beach you describe I rather think our \"good vibes\" with have a hard time getting a \"look see\"!! Still, know that you are very much in my thaughts and that you are just brill, it comes through in all your posts. Will be thinking of you. Shiny",
      "MessageIndex": 368,
      "PostDate": "08/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 9, 2010 01:15PM shiny wrote: Grocery shopping in Canada, one of my most tame but no less excitting fantasies.. Go for it madame, just don't over cook, singe, the mars bar!! Althaugh it has been decades since I last did it I remember burning the flipping mars \"sauce\" and ohhh the dissapoitment!! Happy shopping! Vibes on the way. hug Shiny",
      "MessageIndex": 409,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 17, 2010 10:52PM - edited Mar 18, 2010 03:04AM by shiny Thinking of you Kona, oh and by the way.. If you look at the bottom of the pizza menu, in the little box marked deserts, you should find things like Tennessee Mud pie, hot fudge browny cake and toffee cake. If you ring the pizza delivery guys, and charm them, and I am sure you can, you can get them to deliver the yum pie, minus the usual pizza. I did that once a long time ago, they were a bit suprised but they didn't mind.. something to think about.. I am with Barbe, with your tiredness, mind, the chronic fatigue from chemo can linger so it's a double wammy sometimes. Sweet sweet dreams Kona. edited after a bit more sleep to insert the missed bit in bold. Shiny ",
      "MessageIndex": 568,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 19, 2010 06:10AM shiny wrote: Kona, xx hugs and peachy sugary vibes on their way to you, super srweet, tuff cookie. Hope the blues have packed up and left town. xx be seriously decadently good to you this weekend, what ever way leagaly possible. Take care, Shiny",
      "MessageIndex": 583,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 6, 2010 12:42AM shiny wrote: Long distance romances, grrrr. You can't ever, really, squeeze all your plans and tick all your fav boxes in those short escapes, they are just plain too short!!! And we do all need our sleep. The weather will be even more beautiful when you are driving back there next time. I do still rightly wish you could get driven there each time in a Mc Hunky driven limo, with vibrating massage heated seat, bar, cake fridge etc.. Now that would make the taveling good fun. Planes are ok too, but the door to door transport by a yum scrum sweety pie, well, that might just be more fun, and maybe worry your BF a wee bit too, which would be ok (just a wee bit, he he). BTW: It was your party, so is it just me or shoudn't you have had FULL CONTROL of when you could dive into the cake, then, leave and enjoy \"part deux\" of your celebration with BF?  Hope it was a good time thaugh!! If you need it now, make sure you take it easy for a wee while after all that driving. Hug Shiny",
      "MessageIndex": 829,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 6, 2010 12:56PM - edited Apr 6, 2010 12:56PM by shiny Just in case it crashes momentairily.. Quick, yea ha!! For your nurses revelation. Always nice to hear. hugggggg. Good luck with your \"puter\". We'll keep sending you peachy, cake-y vibes whilst we await news about your \"blue screen\" laptop! Be good to you, hope they get your scheduled in nice and fast. xx Shiny",
      "MessageIndex": 835,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 9, 2010 12:46PM shiny wrote: Will be thinking of you too Kona, I will just add one of my fav treats I used to make when i lived \"outwest\" for the girls I worked with. If you want to try it out in your \"I am sooooooooo worth it and deserving\" decadent feast after tomorrow. Crush a pack or 2 of thin dark choc dry waffers or graham crakers with melted butter to make the base of a pie dish. pour in soft vanilla ice cream which you have laced with either Kahlua or a concentrate of strong coffee (diluted  \"top quality instant\" -if there is such a thing in a wee bit of boiling water). Pop into the freezer, when seriously hardened, overnight, put a thin layer on top of a dark chocolate icing, or coffee choc icing. ahhhhhh you can imagine cutting into this one with your mc dreamy or whom ever on your seriously wonderful fantasy beach. Thinking of you and sending you my best quality vibes right now. Shiny ",
      "MessageIndex": 402,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 11, 2010 04:06AM shiny wrote: Brill news. You are one cool cookie (well and you are probably extra cool from all the ice cream too!). Glad you got a \"looker\" of a doc, never a bad thing is it,ehhhh. Hope you have a very indulgent rest week. Stay well. Shiny",
      "MessageIndex": 471,
      "PostDate": "11/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 1, 2010 11:15PM shiny wrote: Hi Kona, Thinking of you. Just spent an hour or so catching up! and I have got to say between your humour the hunks paradd on this thread and the lovely cat pics, not to mention the recepies.. this is the best I've felt all week. N Been quite a lemon lately so not many visits here, just hearing your brilliant spirit shine through here is something to rejoice in. Sure hoping this weekend, now is going  e x a c t l y as you want it, or want him..I will be thinking of you and sending you peachy vibes for this week. xxx Shiny Shiny",
      "MessageIndex": 1014,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 9, 2010 12:58PM - edited Mar 9, 2010 12:59PM by shiny The key is to wait, that IS so the hard part.. until the ice cream is nice and hard before you even attempt to smooth on the thick... or, not so thin, layer of icing. I am talking butter and seriouas coco icing, with usually a lash of coffee so it lessens the sweetness a weeeeeeee bit. It is seriously easy. Another cheat one of the girl did at the office, but this could be considered just too bad, was microwave or in any case melt a mars bar and pour over good vanilla ice creamw hilst still hot....... Oh I am soooooo in the naughty food zone at the minute! and I do have ice cream in the fridge and the kids are in bed.. I may have to do some practising of these recipies to see if I recollect them correctly,, for study purposes only of course! xx Shiny",
      "MessageIndex": 406,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 21, 2010 02:33PM shiny wrote: Kona, Just to let you know, I am thinking of you and sending vibes from over here in England many times a day. You are a real gem. Take care of you, good luck with sleep. xx hug Shiny",
      "MessageIndex": 627,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 12, 2010 11:59PM shiny wrote: I think dreams idea is puuuuuurfect! Good advice. I used to have a boyfriend from around Boston. It is a very beautiful journey in through vermont etc from where I lived, especially in the fall. Would love to see it again. Take care of you Kona, you know what's best for you, you are one clever cookie. Shiny",
      "MessageIndex": 530,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 4, 2010 01:40PM shiny wrote: Kona, So glad that you had a loverrrrly time in Baaaston.. tired hey.. Anyhoo, thinking of you tonight, gosh I love the way you label your docs etc, you should colaborate with a cartoonist and get images to match the names. Hey, It will be Wednesday much sooner here, andam often up by 4 so I'll be sending you your first of many batches of good vibes for you day's proceedure bright and early. Loved the pic of your cat btw. Love cats but my family's allergic so can't have one, sniff. Hug Shiny",
      "MessageIndex": 1021,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 4, 2010 02:28PM shiny wrote: Good plan, you have enough excitement in your life without adding a close encounter with a pit bull! Right! thanks for setting me straight on dr. Mc \"stuff\" such a hoot thaugh, you are such a creative girl. If Sharon's back, pls say sorry from me, bit too queezy and lemonette tonight to be on the phone, but sending her my bestest vibes too. Donuts are one of my weaknesesssss, probably good then thst I moved here, where they just don't make them like in Canada/USA, it's probably saved me 50 pounds, on me hips living here. xx xx xx Shiny",
      "MessageIndex": 1027,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 14, 2010 11:07AM shiny wrote: Great news, for a great gal. xx Peachy hugs. Sharon, you should hear from me next week lovey. Shiny",
      "MessageIndex": 1121,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748273",
      "Title": "Really crappy news :-(((( konakat pee"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Dec 27, 2008 03:19PM shiny wrote: Hi, am not often logging in these days, but I just thought i'd say hi and mine went well. I hope you get some replies soon, sure you will. I had my double mast and imediate SIAE reconstruction done last feb. I had my nipples reconstructed last month and am getting tattoes in the next few months. I was very very happy with the result. I hope you get lucky like me and that they find when they get \"in there\" some artery material that they can use without having to cut through the muscle as it made my recovery a lot faster. I just wanted to wish you all my best with your surgery and recovery ( i thought also, it might be nice while you wait to hear happy recon stories!). take care. Shiny",
      "MessageIndex": 1,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 14, 2010 12:30PM shiny wrote: You don't know me, am a Canadian in England, but I have \"read you\" many many many time. So sorry for the ****** results, what a shock. Hoping the trial is a brilliant match for you and that you respond exceptionally well. Everyone is different. Sending you hugs, loads of hugs. Shiny",
      "MessageIndex": 15,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 16, 2010 04:28PM shiny wrote: Hey there Konakat, This Canadian, here in England is just off to bed, but just a wee note to send you \"smore\" good strong \"whoop that*****\" stuff, and hug vibes. BTW: I always have loved you saying in your signature. It speaks to my \"guilt is optional\" and \"firstly be gentle with yourself\"theory. As a tri neg, I should be super skinny and a marathon winner...God I love brie..so be it. Thinking good thaughts for you. Shiny",
      "MessageIndex": 85,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 15, 2010 01:43PM shiny wrote: Elizabeth, I have some more going spare, and they are good quality so here's a few more for today. Thinking of you. Hugsssss. Sounds like a plan,  doing away with the power suit and pressure that goes with it.  And it sounds like it just \"feels right\" from your post. Wishing you blessings. Shiny",
      "MessageIndex": 69,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Aug 30, 2009 02:52PM shiny wrote: Hang in there girl, You are not a member of the club yet, you might still not get your membership card. Your story sounds absolutely normal, that is your reaction, all of it going so fast whilst you are talking with yourself. It is great that they got on and took a sample right away. If you are destined to become a BC sister, then you are best to get on with \"the programe\" ASAP, then at least you will feel in charge again. This is a great place and I am glad you got on here before your results cause in many ways it is one of the hardest period. You could be a B9 lady, but if not, this is a great place to share and get support. For now, whether it is luxury ice cream, late \"spring cleanning\" silly movies, what ever do what it takes to keep busy and get yourself some sleep if you can whilst you wait for your results. I am 2 yrs out after double mast/recon and super high dose chemo, with 2 young kids and feel grateful as ever for everyday. Hang in there. hug Shiny",
      "MessageIndex": 1,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/739725",
      "Title": "Waiting and hoping Chickadee AmandaP"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 24, 2009 06:02PM shiny wrote: Thank you LuAnn, for taking the time and being your special thoughtful self in letting us know. So glad you are going to get stuck into so many good projects. I'll pray an extra prayer for you tonight, cause you are one special person and I wish you a wonderful Spring and summer with your family and your garden too! Take care hug Shiny",
      "MessageIndex": 13,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733043",
      "Title": "Will be out of touch for a while LuAnnH marshakb"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Nov 9, 2009 06:20PM shiny wrote: Watson, I am sure you don't feel like one, well maybe not all the time, but sure are some kind of wonder woman. Sooooo glad you said \"don't mind who posts\" cause we so care and want you to get the d.... drugs you need and fully deserve, and having to insist or make a fuss when you have gone through so damn much, has got to be such a load of... Anyhooooooooooooooooooooooo Wishing you a sack full of exactly whatever it is you find you need to make things better. I am alergic to so much, so guess am not the person to sujest drugs, but looks like the list here is growing. Go girl. ((((Watson)))) thinking of you. Glad you came on to share your rant, man it is fully deserved!! Shiny",
      "MessageIndex": 34,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/743559",
      "Title": "Waah! I had a meltdown. I don't care who posts! Watson konakat"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 19, 2010 02:14PM shiny wrote: Konakat, you are a tuff cookie, and fun with it too. You sound \"really sound\" like you have yourself as figured out as a girl can be. Hope you find the Volunteering,or Art making thing that suits you, and that you enjoy many many snuglled up warm cossy, margaritas in bed, and, that if you go ahead the trial will suprise and reward you beyond your imagination. Night night, Shiny",
      "MessageIndex": 118,
      "PostDate": "19/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746762",
      "Title": "Progression in liver and bones :-( konakat dreamwriter"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 26, 2008 05:56PM shiny wrote: Dukemom and Joann, Goodmorning from sunny hampshire. It's been so special finding this site, and the people that I get to share thoughts and good wishes with. My blood results will be out next week and i've been refered for a bone scan, but it's not been confirmed yet. Have load on with the kids, so I focus on that. Shame am so shattered and achy, but I manage as best I can. Can't complain, know am lucky! BTW:I realy beleive in both the statements you make in your signature, they sum up my thoughts too. Joann, have you treated yourself yet, make sure you do! your results are something to celebrate and enjoy, so make sure you find time for that! All my best coming over to you! have a peachy week end! shiny",
      "MessageIndex": 7,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 1, 2016 04:52AM shiny wrote: good! Good idea Barbe! X Shiny ( sorry ladies for piping in!) Be good to you all. Bestestest wishes, Shiny",
      "MessageIndex": 2600,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 16, 2009 07:17PM - edited Mar 16, 2009 07:19PM by shiny Dear Karen4u,  I was just checking into the boards before bed (late here) and saw your original post. I was intrigued as I had chemo induced menopause, that they said woudn't come back then nearly 11 months later, they did.  I saw you just posted. And you are now doing the awful waiting thing.  I just wanted to let you know that I will pray for all the best news to come your way. I am sending you my best quality \"hug vibes\" from here. Hang in there. Shiny",
      "MessageIndex": 10,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730604",
      "Title": "Breakthrough bleeding after menopause karen4u lovinmomma"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 29, 2010 08:21PM shiny wrote: I see Terry's started the good ideas coming in. all my best to you both Shiny",
      "MessageIndex": 3,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751997",
      "Title": "No bone mets surgery for me:( Lisa73 palaminoridesagain"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 13, 2016 04:42AM shiny wrote: Just sneaking in to say ' you are a super star Barbe!' You always impress with your awesome attitude! Just pm'd you. Hug to you and Super gentle hug and best wishes to you ladies on this thread. Gosh, what grulling treatment. I did not have rads as double mastectomies. All my best! Shiny",
      "MessageIndex": 2478,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 27, 2008 06:55AM shiny wrote: Joann, Denise,Dukemom, Thank you so much for your thoughts. I appreciate those good vibes coming my way. Brilliant day, super hot and sunny here. Out with the kids so shattered now. Bloods should be in early next week. Bone scan not scheduled yet. Bless you all. Night night. All my best wishes coming your way. shiny",
      "MessageIndex": 12,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 30, 2008 05:24AM shiny wrote: Oh Joann, I can totaly understand you feeling in limbo. Such a frustrating situation. Do you have to wait 6 months? Can they tell you more? Sometimes its the film  that doesn't come out right. Can you also have an ultrasound, that sometimes gives different info. I hope they are just totaly over cautious and it turns out to be poor mamo. my best vibes coming your way. big hugg. btw, if it is a slight change in the end, they will have caught it super early, which will still be a blessing. You hang in there.I am sorry for all your extra stress.",
      "MessageIndex": 14,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 1, 2008 04:29AM shiny wrote: Joann, glad that is all sorted for you now. Because of my family history, I went for bilateral/recon. So no mamos anymore for me. Know what you mean re hair. Finished chemo in November 07. Mannn, I do think eyebrows and lashes are a good look! So pleased they are back. Strange, but for me the hair loss (had it shaved off at 10 days into chemo, as it was falling out so) was not a big deal. Now that it is back though, I want it back to long again.. gonna take a longggg time. Let hope we are truly through with chemo for always! be peachy, take care. shiny",
      "MessageIndex": 18,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Feb 20, 2009 03:43PM shiny wrote: Luann, SOOOO pleased for you! You are always a really inspiring person, so keep the good news coming! Fantastic!  Shiny",
      "MessageIndex": 56,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729384",
      "Title": "Got Excellent News Today!!!! LuAnnH Calico"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jun 8, 2008 03:44PM shiny wrote: Hi, I was 39 last year when diagnosed (see my stats in my signature). I opted to have bilat mast for my peace of mind, with imediate reconstruction (SIEA flaps). I have a high incidence of BC in my family in younger woman, so I was told that I was possibly at an even higher risk for a second primary in either breast. My Cancer surgeon said that for any woman who has had a bc, there is an aprox minimum of 30% chance of second primary. With my quick aggressive type of bc first time around, that was good enough reason for me; I didn't want to have to keep checking and worrying about any little bump. Also, as I am triple neg, I felt this was the one thing, apart from loosing weight that I could pro actively do to \"help myself\". I have  not had to have any radiotherapy (which was nice as daily trips to hospital would have been tough on the kids and on the pocket book). I am very happy with my decision. I though very carefully about it and asked alot of questions. Take the time to really look into and understand your options and motivations. You can only do your best and what ever you decide, it has to be right for you.  Good luck, and hang in there! take care of you. Shiny ",
      "MessageIndex": 3,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 29, 2010 08:17PM shiny wrote: Hope it's ok with you Lisa, but I just wanted to send you a hug from over here in England whilst you wait for some inspiration from a person with experience of this kind of bone mets, there is so much good knowledge on these boards, so you should get some responses soon.  It's 1 am here, and just poped downstairs to get some meds and thaught i'd pop in to BCO and saw your post. I'll be adding you to my prayers when I go back up in a bit. Bless you,  hug. Shiny",
      "MessageIndex": 2,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751997",
      "Title": "No bone mets surgery for me:( Lisa73 palaminoridesagain"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 30, 2010 03:12PM shiny wrote: Lisa, hug, hug. I'll be sending you some extra good vibes whilst you search for better answers to your painful problem. I sure hope you  find an expert with a more doable scenario then what is currently being proposed for you. take care, Shiny ",
      "MessageIndex": 8,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751997",
      "Title": "No bone mets surgery for me:( Lisa73 palaminoridesagain"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 6, 2008 02:05PM shiny wrote: Sarmcl, The oncs will work with you if they can. They would rather you come to the \"table\" rested and most recognize the benefit of keeping  your holiday time \"if possible\". Just ask them about it asap,so you know where you stand. They should be able to give you a straight anwser based on your specific stats quite quickly. They will not put you at risk. There is often a few week's flexibility. I sure hope so for you. (In my case they delayed initial app due to a very special birthday celebration I was preparing for my daughter (4). In my friend's case, they delayed a few weeks so she could go on hols. It will all be based on your stats. You take care of you. Sorry you've had to become a member of the club. Big canadian hugg. You will find help and support here. take care of you. You are in charge. All my best.",
      "MessageIndex": 1,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705121",
      "Title": "Trip scheduled--dont know what to do! sarmcl rogam"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 21, 2010 09:50PM shiny wrote: Hi, just adding more of the same here. I had a cluster of cals the year before DX it was in the non BC side, it was B9. It was still B9 only when tissue was examined post my double mast. My sister also had a cluster exised a few month's ago, and it was B9. Hang in there. Do what ever is legal and works for you to keep sane whilst you wait. Odds on your side, but the waiting is still, the waiting. Take care, Shiny",
      "MessageIndex": 3,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750101",
      "Title": "Clustered Microcalcifications SCMartin shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 30, 2008 05:26AM shiny wrote: I just want to reword something..cause I don't think I would want my surgeons to ever be anything less then \"over cautious\", I just meant, hope they got things wrong.",
      "MessageIndex": 15,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 21, 2010 10:13PM shiny wrote: Beesie, very very good point! Shiny",
      "MessageIndex": 5,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750101",
      "Title": "Clustered Microcalcifications SCMartin shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 26, 2008 07:33AM shiny wrote: Hi, very happy for you! I was just looking in before bed (it's 11 pm here. I am very pleased for you! Nice news to finish up my day. Am waiting on some tests, pretty calm and thinking positive. Have a brilliant day, go celebrate and treat yourself! you deserve it for the stress! take care, hugg.",
      "MessageIndex": 3,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704548",
      "Title": "Going for followup mammogram today cp418 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 12, 2010 04:08PM shiny wrote: Hi there. Deep breath. So sorry for all the stress you are going through.I am under the weather today, but had to post \"something\" wilst you wait for more \"switched on girls\" to come and post. So, sorry for my choppy output but hope it still helps you a wee bit. Hang in there. 1- You have not had a definitive diagnosis. The biopsy will tell you more. 2-The waiting is THE most stressful and unsettling part of what you are going through. 3- It is near impossible not to worry yourself silly at this point and it is totally understandable, so try to get this core biopsy done ASAP as whatever you find, knowing what is in there will start to empower you. In the meantime, come here, you are not alone.  Also, try to find a good friend to share this with at the least, if that would help you. Eat ice cream, watch fav movies, do very very early spring cleaning.. whatever to keep you busy, so that you are not thinking of this every second, and it might help you get some sleep too. 4- The core biopsy is totally doable. There is a loud \"bang\" when they punch. I found that I was more comfortable with being told \"3-2-1 punch\", each time they punched, so that I expected the \"bang\" noise and it helped me stay calm. If you think it might help you ask them to count them down for you. I was chatting away to the friendly nurse the whole time, it was over fairly quickly and I just felt as if I was quite bruised after. 5- If you are diagnosed with BC. Glad you found this site, the ladies here are fab and will help you along. You are in charge, once you have a better understanding of what is being sujested for treatment and you have a good idea of what is coming hopefully you will start to feel more focussed on \"getting on\" with the treatment to make you better and that will give you a positive focus. Make sure you ask as many questions as you want and ask your \"Cancer team\" to repeat anything that is unclear to you until you understand it. Make sure you are happy with your team. 6- Take all the support that is offered to you and be gentle with yourself. Take good care of you. The waiting is the worse. You can do this. hug. Shiny ",
      "MessageIndex": 1,
      "PostDate": "12/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746652",
      "Title": "going for biopsy jdemco Lisa1962"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 26, 2008 04:58AM shiny wrote: Hi Sue, Just a quicky from England to say. Hugg and hang in there. I just posted for the first time a week ago, it's been brilliant. You just keep remembering that you are here now and yes, 1 node is good. This is a great site and am sure that like me, you will find it rewarding to share your thoughts and receive and give support here.  Re: chemo, just enjoy crossing the doses OFF  as you go through your sets.  I found it helped especialy at the start of chemo to check symptoms of side effects on my \"possible symptoms list\". Then, even though I had a rough time on FEC-T, I knew that the symptoms would pass. And remembering what I was doing chemo for (for my good) was a good way off thinking about it, instead of dreading it.  I wish you the very best with it all. take care and be gentle with yourself (think of it like, this year you have to be a super mom, to yourself) all the best  ",
      "MessageIndex": 1,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704601",
      "Title": "Starting my journey suzyb suemed8749"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Dec 26, 2009 09:15AM shiny wrote: Nearly there girl, You will get through this. Keep busy, hit your fav shop in the sales?? or maybe just relax with hot choc, your sista and a great movie. You take good care. Be thinking of you, especially Tuesday. We're all here if you need to \"talk\". hug. Shiny",
      "MessageIndex": 34,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744982",
      "Title": "Was told it was benign- Now double the size RockiesGirl shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 13, 2008 07:59AM shiny wrote: LoriFl, I don't have the answers that you have asked for re the Ixempra and Tomoxifen, no doubt many will come and write to you on that. I just wanted to give you my best vibes from over in England whilst you come to terms with this news. My heart goes out to you. I am sure you will find lots of support here.  I hope you find the  drug combo your onc suggests very successful. There are so many more treatments out there now. Hope you find the best fit for your specific mets and that you start to feel the difference asap. I wish you lots of strength and blessings. shiny",
      "MessageIndex": 1,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705487",
      "Title": "It is what it is...the verdict LoriFL LoriFL"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 11, 2009 07:37PM shiny wrote: Fantastic LuAnn, You are such a great part of this place and I read you and enjoy your contributions. I think our BC makes us (if that's possible)even more dotting mums and although my little ones are far from those mile stones, I can totally get how thrilled and just bursting with pride this makes you. Clearly your CAN DO attitude has rubbed off on your brilliant kids! thanks for sharing Shiny",
      "MessageIndex": 13,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730539",
      "Title": "Some good news about my kids! LuAnnH ozzie2"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "May 22, 2008 10:12PM shiny wrote: MR1, I responded to you on your same conversation, then I think you must have seen you'd duplicated and deleated, so look up the conversation list to see reply. and, all the best! shiny",
      "MessageIndex": 1,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705961",
      "Title": "Fretting...Am I crazy? TexasMelody jalydiju"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jun 20, 2008 02:22PM shiny wrote: Estepp, Hi there. Yes, I remember the wait, what an intense time. There are alot of factors involved in deciding the protocol. Its hard to avoid trying to figure it out in advance of your results, but reading up here to get to grips with some of the terminology and possible scenarios AND also keeping yourself busy with non BC stuff (spring cleaning, fav film, exercise etc) will keep you going while you wait. Just remember, you may get a peachy result and that will be terrific. If it is BC, you will rise to the challenge and do what you have to do to manage it. I had FEC-T chemo 100 x 6 rounds for triple negative grade 3 BC with node involvement. My hair was my crowning glory, and yes I lost it all quick. I didn't even mind that much because I though, hey, this chemo is the best protection/defense available to me right now and side effects and all, I want the stuff! You get through it. I finished it in mid November and now my hair is 2 inch long and thick as ever. Hope you get a B9 result, if that is not to be, you do your best, be gentle with yourself, take the love and support of loved ones and you go girl, just go through it and whip that BC!  You stay in charge and ask as many questions of your doc team as you need until you understand enough to make your decisions on your treatment.  Take care, Shiny ",
      "MessageIndex": 3,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707738",
      "Title": "Newbie Question Estepp shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Mar 24, 2010 11:32PM shiny wrote: So very glad for your news. Thanks for sharing. Brill! go spoil yourself you deserve it after all that stress. Shiny",
      "MessageIndex": 8,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/750101",
      "Title": "Clustered Microcalcifications SCMartin shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 28, 2009 02:57PM shiny wrote: Hi, I really like the hats (from thin cotton knitt onto a frame to fully lined wool plaid ones) from  www.headcovers.com. I did have trouble with their shipping departement.They seem to struggle on that point, so a bit of friendly chassing, goes a long way. Still despite this, I really like the quality and the variety of the hats etc that you will find on there. Also they are very well made,wash very well and are great value. Good luck, hope you find lots of fun stuff to wear.  I didn't do wiggs in the end, just cute little hats for me.  (I finished chemo in late november 2007, now I have very curly, shoulder lenght hair (way more culr then before btw). Take care.  Shiny",
      "MessageIndex": 6,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730586",
      "Title": "Hats, scarves, wigs. Where to get them?? michele54 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Apr 9, 2016 01:08PM shiny wrote: hi Ok1, read your post and then responses of the cleaver ladies above and felt you'd had a really good lot of quality information, so all I wanted to add was.. I know, as we all do how stressy the biginning of this journey is, and you are right, initially TNBC can read as very scary when you first read it, but as you know now, there are positives as well. You sound alot better from your fitst text. Keep coming over to BCO when you need to, and if it helps..look at my dx year. Had 2 little kiddos, was under 40 but here I am. You take care of you. One day at a time. And to all who responded, great explanations. Hug. Shiny",
      "MessageIndex": 21,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/842342",
      "Title": "So scared... Need to hear some positive stories! Nina27 shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Dec 28, 2009 06:29PM shiny wrote: Hi there Rockiesgirl, I echo Meece, I have had many times when my lymph nodes were swollen,(in my case the ones left in other areas after my full node clearence) because they were doing their job.  Do what you have to do to keep sane until tomorrow(ice cream, internet shopping,decluttering,resting, if you can!!) the stress of waiting, is, the worse bit.  Hang in there lovey. The  waiting is nearly over. big hug. Shiny",
      "MessageIndex": 39,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744982",
      "Title": "Was told it was benign- Now double the size RockiesGirl shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Dec 21, 2009 09:34PM shiny wrote: Hi RockiesGirl! I have just read your thread, you are one tuff cookie! Good for you. Your attitude will really give you an advantage no matter what your results are. Hope they are totally B9!! I was very positive during my treatment, am just \"made that way\" and it was all quite doable, I was 38 when diagonsed with 2 little kiddies. It is suchhhhh a pain the waiting thing! Thankfully in a way all the Christmas stuff will keep you very busy until your appointment. Good luck to you lovey, you are right, you can handle things, no matter what, you have the right attitude. Sounds like you have a cool consultant too, that takes you seriously, brill. May the next week or so go super fast,do keep your close friends and mum \"in the loop\" it is still pretty stressful the waiting thing. Well done with the surgery! Hug and best wishes, and Happy Christmas too! Shiny",
      "MessageIndex": 28,
      "PostDate": "21/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744982",
      "Title": "Was told it was benign- Now double the size RockiesGirl shiny"
    },
    {
      "AuthorID": "shiny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65869/profile",
      "Content": "Jan 9, 2010 11:52AM shiny wrote: Wow girl!! Great news, so very very happy for you! Talk about a good start to the new year!! You go and enjoy yourself, and remember, everything you did was good, it is excellent that you are pro active with your health. Continue to trust yourself and act on your concerns over the course of your life and you can't go far wrong. Take good care of you daaaaling. hug and \"wow-brill-great and wow again\" Great news. Shiny",
      "MessageIndex": 50,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744982",
      "Title": "Was told it was benign- Now double the size RockiesGirl shiny"
    }
  ]
}