{
  "AuthorID": "shineonme",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/27047/profile",
  "Posts": [{
    "AuthorID": "shineonme",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/27047/profile",
    "Content": "Apr 7, 2006 08:10AM shineonme wrote: hello lifesaver forum..... At last,people that know what I'am going through with this tough TAC protocal. Isn't it strange, that no one knows what it is like not to have enough energy to walk across the floor(Day 6 for me). March 6 begin TAC program, heading into cycle 3 in one week. I'll just throw out things that happened and things that helped. Hair loss day 21. Daughter and husband shaved my head -- great therapy for my 8 year old. Also, I gave my daughter my oncology business card to put in her bill fold and that made her really feel involved. The steroids on day before and day after are really annoying to me. Doctor prescribed Lunesta for sleeping problems. The Neulasta shot is really worse than the chemo for me. Back pain and bone pain persist for 2-3 days. Tylox seems to work well and doesn't really make me sleepy. Weight loss/weight gain. I lose 10 pounds the week of chemo and gain it back on the third week off. lol. I try to clean my house up really good on the weekend before, that seems to make be feel better the week of. Questions for you all: the dreaded constipation/diarrhea and hemmorroids. Any suggestions? Also, eye changes - my eyes hurt and water all the time. I don't think it is tears? lol. I really appreciate this forum. again, nobody here in this family or city knows what I am going through. This is really great to have you all. I could keep going on and on, but I will stop for now. all of us, need to hang in there.... there is a light at the end of the needle.",
    "MessageIndex": 92,
    "PostDate": "07/04/2006",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/282378",
    "Title": "For those starting TAC in March/April 2006.... kburns jpsgirl96"
  }]
}