{
  "AuthorID": "shlee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
  "Posts": [
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "shlee wrote: Hello, I had surgery 2nd week in Nov. for Stage I IDC + DCIS 1.2cm (Invasive at least 1.05 cm). Since i am at a very high volume cancer center, to get one of the top oncologists, i apparently have to wait until the second week in January to even get my first appt.!!!!!!!!  Well, considering the size of my tumor at least 1.05 cm Invasive, I read guidelines that say chemo is recommended. Considering I was given a grade of 2, then I am assuming chemo will work well on my cancer. I am waiting for the Oncotype test to come back, but I still don't understand how that can tell you whether or now there are circulating tumor cells that have already started to travel. I understand it tells the risk of cancer wanting to come back, but it doesn't seem to say the risk of whether or not you already have tumor cells circulating that should be killed by chemo.  I would really like to have the best oncologist by all accounts, but i also feel like at this cancer center they don't truly give a darn if waiting for chemo affects my survival. I heard that 12 wks after surgery is unsafe. I also heard that ideally should be started 6 weeks after surgery.  Anyway, i am very confused about what to do! What are your opinions? How long did you wait for chemo following surgery? I really don't want to have chemo but if it means never having to deal with this crap again i am more than willing to put up with 3 months of feeling sick! However, I also think 6 wks would put me right into the christmas and new years holidays... Dx 9/2012, IDC, 1cm, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797010",
      "Title": "When to Start Chemo following BMX?? shlee Sassa"
    },
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "Nov 29, 2012 06:41PM shlee wrote: Hey, Rose_d, i am also at sloan and i would get it sooner but apparently they can't get me in any earlier... im supposed to seeing the cheif h udis but i heard dickler is also good....its just, i've been told by hopkins breast service that 6 wks is the recommended time frame, and im at week 3... i can't believe that there are no national guidelines for when to start chemo and what is safe... ive tried looking it up but i cant find much... i like sloan kettering, but everything is so overbooked and they don't seem to care if they make you wait months...they are supposed to be one of the best and the doctors do seem to be good but they don't seem to worry about wait time and what it does to one psychologically or how it will affect prognosis... cjm, i haven't gotten oncotype back yet- they didnt do mammaprint for me, but the other results are supposed to be coming in 1 wk...its just this guy who is supposed to be very good adn who came recommended by someone who worked for him can only see me in jan. otherwise i don't know who to go to and i understand that you have to be with them for several years so its hard to just go to anyone you haven't heard anything about... so i guess i just have to decide whether i should pick someone else depending on whether 8+ wks is putting health at risk",
      "MessageIndex": 3,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797010",
      "Title": "When to Start Chemo following BMX?? shlee Sassa"
    },
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "shlee wrote: Hi i am confused by the bloom richardson score vs the other grades given on my path report. I was told I have a grade 2 cancer by doctor. It seems pretty straight forward, but the bloom richardson score was never given as a number on my path report and I am getting a different number when i calculate it myself! I am getting grade one or a score of 5. I assume bloom richardson is used to determine grade. My question is, is bloom richardson score considered your grade or is histologic grade your grade? Much thanks! Histologic Grade: II/III Score 2 Nuclear Grade: II/III Score 2 Mitotic Grade: I Score 1 Well to Moderately Differentiated 2+2+1=5 (Grade 1) am i correct? Maybe my doctor read the report wrong?- he looked at very briefly and told me it is unimportant Dx 9/2012, IDC, 1cm, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797058",
      "Title": "Bloom Richardson Score vs. Grade? shlee knits"
    },
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "Dec 6, 2012 08:40AM shlee wrote: Hi ladies, thanks so much for your help. yea i guess i am just confused period. i also asked on the hopkins site and she said 2 but this just doesn't make sense and she didn't really explain why. and the doctor just looked very quickly so im not sure if the doctor really gave me correct grade. the doctor said it doesn't matter, but i would still like to know!  This is exactly how my pathology report read: Histologic grade: II/III: moderate tubular formation (between 10% and 75% of tumor) (score 2) Nuclear grade: II/III: moderate variation in size and shape (score 2) Mitotic Count: <8 mitoses per 10 high power fields (score 1) I keep getting 5 and thats a grade 1 so im not sure why im being told grade 2 i realize its the highest of the grade 1 but it is still a grade 1! http://breastcancer.about.com/od/diagnosis/tp/tumor_grade.htm ughhhh its so frustrating! unless there are different ways of grading other than bloom richardson....",
      "MessageIndex": 3,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797058",
      "Title": "Bloom Richardson Score vs. Grade? shlee knits"
    },
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "shlee wrote: This Post was deleted by shlee. Dx 9/2012, IDC, 1cm, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/796944",
      "Title": "Pathology confusion- need some help shlee Moderators"
    },
    {
      "AuthorID": "shlee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162706/profile",
      "Content": "shlee wrote: So i know survival varies within each stage depending on different characteristics... i was diagnosed wth stage I and 1.2 cm IDC (T1c-- 1cm-2cm), no nodes, hormone sensitive. Can someone explain the difference in survival for me had I fallen into the T1b category (.5 cm-1cm). Is my prognosis really that different. I am just curious because in truth .2cm doesnt seem like that much difference but on adjuvant is seems to show odds going down. Is chemo typically recommended for over 1cm and why? Im just confused how like a few mm can really make that much of a difference! I keep being reassured that i caught it early, but obviously it could have been caught sooner... Dx 9/2012, IDC, 1cm, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/796840",
      "Title": "Stage I: Is tumor size that important? T1a vs. T1b vs. T1c shlee fifthyear"
    }
  ]
}