{
  "AuthorID": "shmabby1098…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183876/profile",
  "Posts": [
    {
      "AuthorID": "shmabby1098…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183876/profile",
      "Content": "Jul 9, 2013 10:52AM shmabby1098 wrote: hi, first post here - brand new member.  Hope I'm in the correct thread.  Today was supposed to be my first radiation (triple +, her2+, lumpectomy twice then surgery for an infection) but I postponed because I'm going nuts on IMRT v. 3D.  Nothing I read is telling me definitively one is better for ME than the other.  I recently read about how radiation increases risks both short term and long term (up to 20 years) for heart disease and I have several factors that increase that risk.  This causes me to prefer IMRT but then I started reading how some people not only think IMRT exposes more tissue to radiation but because it's newer there are user error that while not common can and have led to horrific deaths.  Also apparently there is no outside 3rd party that provides oversight to places with IMRT and the financial incentive is just too tempting for providers to not jump in. Also, my insurance, Cigna denied the RO's request for IMRT so I requested an appeal (due to my elevated risk of heart disease) and now I'm freaking out over user error which I guess is less of an issue with conventional 3D because it's less complicated for the technicians. Clearly, I must have radiation and SOON and I'm mentally stuck.  I postponed the treatment because my RO happens to be on vacation this week and the temp RO did not want to get involved in the appeal (and I can't say given his position I blame him). My first thought was do an expedited appeal since apparently Cigna is known to routinely reject IMRT on the first, thinking perhaps they'd approve it on second attempt and if not, I'd just go with traditional.  Now I'm just confused.",
      "MessageIndex": 843,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "shmabby1098…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183876/profile",
      "Content": "Jul 10, 2013 01:52PM shmabby1098 wrote: Re the study on increased heart disease for women receiving radiation for bc.  i read that even though it acknowledged that newer radiation uses lower doses ALL women receiving ANY radiation for breast cancer are at increase risk for heart disease. My RO didn't discuss this with me (if she did, I don't recall) nor was the breath holding technique nor any of my other risk factors, treatment for Her2+, diabetes mentioned.I'll ask this when i see her on Monday. thanks everyone",
      "MessageIndex": 863,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "shmabby1098…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183876/profile",
      "Content": "Jul 14, 2013 04:33AM shmabby1098 wrote: Has anyone here appealed their insurance's denial of IMRT?",
      "MessageIndex": 941,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/803360",
      "Title": "Summer 2013 Rads Wildlyshel sandiesau"
    },
    {
      "AuthorID": "shmabby1098…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/183876/profile",
      "Content": "Jul 14, 2013 05:36AM shmabby1098 wrote: I recently read that it will be coming to Georgia in 2016.",
      "MessageIndex": 10,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/794475",
      "Title": "Proton therapy instead of traditional radiation? damiana9 shmabby1098"
    }
  ]
}