{
  "AuthorID": "shreyapande…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261509/profile",
  "Posts": [
    {
      "AuthorID": "shreyapande…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261509/profile",
      "Content": "Oct 25, 2017 02:58AM shreyapandey wrote: Hi, You have made a very valid and important point, to which I agree. Relying only on online doctor is not the conclusive approach. You are absolutely correct that medical conditions such as breast cancer need a physical examination for accurate diagnosis. And the decision should be final only if conclusive tests are conducted in a pathology lab. Actually initially I lacked the courage to visit the doctor, but after reading an article in New York times I built some courage to get myself tested. The cancer doctor online, suggested some generic tests at a nearby clinic. The consulting just helped me to subside my fear and guide me. But as you rightly said, at the end of the day, its important to bite the bullet and visit a clinic nearby and get tested. BTW thanks for the information, it was very helpful. ",
      "MessageIndex": 113,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    },
    {
      "AuthorID": "shreyapande…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261509/profile",
      "Content": "Oct 23, 2017 08:37AM - edited Oct 23, 2017 08:38AM by shreyapandey I am really sorry to know that you had to go through anxiety. I myself had been anxious at one point of time in my life. After 4 months of anxiety and fear of the future, I found myself in hospital not for the reason I was anxious about but for the anxiety itself. I was worried that I am suffering from Breast cancer because for 2 weeks, my right breast was awfully paining when touched. In my mind, I was sure that I have breast cancer and I am going to die very soon. I did not have the courage to get tested. My anxiety kept on building and my fears started to reflect in my body. I use to sweat in a cold winter night. One day, I woke up shivering although no one around me was shivering. Finally my sister took me to the hospital and I was tested negative. My anxiety started to reduce and now I am back to normal Irrational fears can cause huge psychological damage to an individual and its important to know and read the symptoms of anxiety beforehand. In case you have fear of cancer, you can consider consulting doctors online at websites such as JustDoc.com . Many people like me, lack the courage to get tested and it is natural for a human to be afraid. I believe consulting a specialist online can help in subsiding the fears to a great extent. I will advice please rely only on correct sources of information and avoid relying on information from non authentic sources. Hope the answer helps. Thanks",
      "MessageIndex": 111,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/855477",
      "Title": "Anxiety MTwoman godisone"
    }
  ]
}