{
  "AuthorID": "shygal",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
  "Posts": [
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 29, 2010 01:40PM shygal wrote: Hi Ladies, count me in for July Rads.  I just finished up chemo and will have 21 sessions and then tamoxifen after that.  I have my planning session on July 8 and then start on July 12.  I'm a bit nervous about what to expect but with your help, I figure I can get through this as well.  Cheers.",
      "MessageIndex": 12,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 7, 2010 04:56AM shygal wrote: Hi Bailey1958 - yes the 16 sessions with 4 boosts must be a Canadian thing as this is what I'm getting at Sunnybrook in Toronto as well.  I start next week (having my planning session tomorrow) and I'm getting very nervous about the unknown - even more so than chemo I think. Anyone have any good experiences to share so far?  Thanks.",
      "MessageIndex": 45,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754618",
      "Title": "July 2010 Rads Houndmommy BARYAN"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 9, 2010 10:00AM shygal wrote: Can I join this group too?  I am starting 4 x TC on April 12 and have my teaching session in a few hours.  I have read every post (all 600+ of them) on Starting Chemo March 2010 group so I think I know what to expect, but I'm still very anxious.    By the way, as a chemo patient, losing your hair, you qualify for a free scarf or wrap from this company:  www.franceluxe.com  Just click on the \"Good wishes\" link at the top right of their website.  This very generous company has allowed me to share this website with other chemo warriors.  I just ordered my free wrap today.   Check it out.",
      "MessageIndex": 29,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 12, 2010 01:28PM shygal wrote: Well ladies, just waiting to go in about 15 minutes for my 1st time.  Rereading some posts to get some extra strength from you all and it worked!.  Decided to get all made up and look beautiful for the last time....ha ha.  Good luck to everyone else starting today as well.  Cheers.  ",
      "MessageIndex": 63,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 25, 2010 09:11AM - edited Apr 25, 2010 09:13AM by shygal So today's my big hair buzz day.  It's day 13 and right on schedule (so I've read for TC) my hair is coming out like crazy.  I did not have any sensation prior to this on my scalp.   I have put it into a pony tail since it's falling into everything until I get my husband to buzz it tonight.  I must admit, just thinking about it is making me weepy.  I hope that the anticipation is worse than the result.  I am not looking forward to start wearing \"Raquel\" (from the Raquel Welch line) on a regular basis even if it is cute. Hope everyone is having a better day and SGJ05, I hope that your pain has subsided.",
      "MessageIndex": 204,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 28, 2010 07:33PM shygal wrote: Glad to hear that most everyone who is participating is feeling better today. However, I am also concerned about fatigue, tcpjkk and consequently I am getting every errand, appointment and social commitment completed this week prior to starting TX#2. fg2000 I too was worried about my daughter away at university writing her exams during the beginning of my treatment and found that if I called her everyday, she felt more calm about my situation and could study without too many problems.  She also came home to study for a couple of the exams and that helped her as well. Saralmom your hair buzzing sounds like it went well considering.  My girlfriend saw me bald today for the first time and said that I could pull off bald and I looked like Sinead O'Connor!  This was a major mood booster for me.  I wonder if I could really ditch the wig. Maybe as I get used to the bald look (and get tired of that wig...it's itchy and hot) I will be able to go topless.  Wishing everyone a good, quiet night.",
      "MessageIndex": 257,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 1, 2010 08:23AM shygal wrote: Marcy4 - Docetaxel is also called Taxotere (it's the \"T\" for people like me who are doing TC - the \"C\" is the Cyclophosphamide, also called Cytoxan).  Taxol is in the same family as Taxotere and I believe they have called Taxotere the evil twin of Taxol (they are both considered Taxanes)  From what I've read, both Taxotere and Taxol cause hair loss so I would think that either drug would have the same percentage of permanent hair loss, but ask your oncologist. fg2000 - please post those pics of your head scarves....would love some ideas.  Thanks. ",
      "MessageIndex": 301,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 13, 2010 10:02AM shygal wrote: For you ladies who have not yet shaved your heads, this youtube video is very uplifting.  She also has a few follow on videos about scarf tying and how to wear hats etc.  I think it's worth a look.   http://www.youtube.com/watch?v=UC_mXSVU1nc&feature=related             ",
      "MessageIndex": 420,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 14, 2010 11:10AM shygal wrote: DancerMel28- I might have some of the scalp issues you have mentioned as I seem to have either small sores or maybe even pimples? at the back of my head on one side.  I was using just plain shampoo but then switched to Neutrogena Acne Body wash and it seems to have helped eliminate those sores. I received my head buffs from Planet Buff and I must admit, I am very pleased.  They are extremely comfortable and when you wear them as a beanie hat, they have a bit of extra material at the top so it's not as noticeable that you do not have hair underneath.   I actually wore one out yesterday which was remarkable since I never go out without my wig. Even though I'm using the Magic Mouthwash (but obviously not enough) I think I have a mouth sore (on my tongue).  Ugggg.  Feels like someone pierced my tongue last night.  I'm on day 12 after TX#2 and I thought that the worst was over for this round, but I guess not.  The fun never ends. Good luck on Monday Marcy and SGJ05 hope you have an SE free weekend after your #3. ",
      "MessageIndex": 433,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 22, 2010 11:19AM shygal wrote: Hot flashes galore over here too.  They are driving me insane, especially at night.  I'd say that I always have a really big one at 4am which wakes me up for a few hours.  The Onc said that they should dissipate with radiation (a bit) but I expect them back with Tamoxifen.....oh Joy! I looked into taking Effexor to control them but the Onc told me it's an anti-psychotic drug that just has the additional benefit of controlling hot flashes.  The withdrawal symptoms, apparently, are brutal.  I won't be taking it but I do hope to take Black Cohosh once the chemo/radiation is completely done with the Onc's approval.....let's hope it works.",
      "MessageIndex": 673,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 14, 2010 04:46PM shygal wrote:",
      "MessageIndex": 790,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 16, 2010 09:19AM shygal wrote: Wow, day 4 knocked me off my socks.  Wasn't expecting such a dramatic change from day 3 when I was feeling just okay.  Today is my day 5 and I feel almost completely normal.  I guess the lesson here is to just take it one day at a time.  One of our mantra's should be:  \"Just get through the day\" since you never know what tomorrow will be like.  Hoping everyone has a SE free day. ",
      "MessageIndex": 111,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 22, 2010 04:06PM shygal wrote: KimW, I'm doing TC  and did not actually ever vomit (although I'm only part way thru the first cycle on day 11).  Felt like I was walking through fog on days 1 and 2 and then part way through day 3 and all day 4, I was very nauseous and weak and I fainted in the morning (have heard that drinking a lot of water can prevent this - will drink before getting out of bed next round and make sure to eat something small (2 crackers) every 2 hrs on all those first days). Felt much better on day 5 and then only had a small relapse on day 9.  Yesterday and today I have felt 100% normal.  So for me, it wasn't so bad.  Some other minor SE's but nothing worth writing about.  If this is as bad as it gets, then I consider myself lucky. Felt gingerale and ginger tea were both helpful and using the salt water or baking soda/salt combo's about 5 times a day help prevent mouth sores. For me, losing my hair is going to be the biggest thing.  Not that I have great hair or anything but I don't suit hats/scarves and I hoping that I love that wig. If you don't get offered ice for your fingernails during Taxotere, ask for it.  And if your sinuses are bothering you during Cytoxan, ask them to slow the drip down a little.  Good luck next week",
      "MessageIndex": 177,
      "PostDate": "22/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 23, 2010 02:25PM shygal wrote: KimW, I had previously thought that ice for fingers was to prevent neuropathy in your fingers, but the onco nurse said that Taxotere can cause brown marks in your fingernails or other discolouration (some people said that their fingernails have fallen off) and the ice bath protects your fingernails from having this happen. And coincidentally for those that are taking vitamins/supplements, I had just asked my oncologist that exact question by email and he responded this morning: As a rule, \"supplements\" are not recommended when someone is receiving chemotherapy. The reason being that the supplement \"industry\" is an unregulated industry. While the contents of the supplement must be properly labeled on the package the actual amounts do not. Because the understanding of how chemotherapy really works (i.e. on a molecular/atomic level) is not completely understood there is a concern that supplements may in fact negate the benefits of chemotherapy. So you may eat whatever you like and whatever amount is healthy for you however I would avoid all supplements, except as mentioned above, vitamin D. Or course, he could just be more conservative that other oncologists, but I have decided I'm not taking anything except vitamin D until this is over.  (He recommended 1000 units of D) Good luck Kad22, I'm not far behind you. ",
      "MessageIndex": 188,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 24, 2010 08:13PM shygal wrote: Arubajan, so glad that your first TX is over with.  Hope your night and tomorrow is okay and you that you can sleep tonight.  SGJ05 - I am so sorry that you have a UTI.  That is awful.  I hope that your antibiotics kick in quickly and that tomorrow is a better day.   Hang in there.  Sending you gentle ((((hugs)))).",
      "MessageIndex": 202,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 25, 2010 03:13PM shygal wrote: So went ahead and had my DH buzz me while I had tears streaming down my face.  He's a sweetie and kept telling me how much he loved me and kissing my head and neck as he's buzzing away.  One day I hope to be able to laugh at all of this.  Putting on \"Raquel\" I realize that I need my stylist to help reduce the volume a bit....will have to get her cut so I can bring her out in public. One thing that the Wig guy told me...that when you're buying hats and you still have hair, make sure that they are very tight since they will be too big when your hair is gone especially if they are not specifically made for chemo paitents.  Hoping for a good week for everyone.  Cheers.",
      "MessageIndex": 212,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 28, 2010 08:10AM shygal wrote: SGJ05 - How is your UTI?  Did the antibiotics work?  Haven't heard from you in a few days... Question for anyone who has had one or two TX's:  Has your body hair started to fall out too?  I have not noticed any difference in my arm, underarm or leg hair at all, but certainly the hair is falling in the nether regions....how long before everything goes?  Is anyone completely naked yet?",
      "MessageIndex": 245,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 30, 2010 08:23AM shygal wrote: Hi everyone.  I just realized that I love checking this forum each day to see how everyone is doing.  For some reason it brightens my day to have other people going through the same experience that I am, at the same time.  Even though we have all had our bad days, there seems to be enough good days in between. ArubaJan, you make me laugh.   You're worried about the wind in San Diego?  I guess you're thankful you're not back in Aruba with their non-stop winds!  For anyone who hasn't yet looked into the Comfy Band for wigs, I recommend it.  Seems to keep my wig on more securely and helps with the pressure points of the wig sitting on my head for hours at a time.  I bought mine on ebay for about $20, and I think it's worth it. For those of us with kids, I must admit that they have been super supportive and very caring throughout the whole process.  They have also managed to brighten my darker days during this experience. Hope everyone has a great day and just about everyone has now completed at least round #1, which puts us all closer to the end! ",
      "MessageIndex": 288,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 8, 2010 02:35PM shygal wrote: Susiesue, thanks for reminding me about the lint roller for stubborn hair.  I have been buzzed for almost 2 weeks now and although the sides are completely gone, the mohawk section was staying put.  Yes, I could pull out the hair with my fingers, but it wasn't falling out.  Considering it's been 2 weeks, I also thought \"when is this sore sensation going to end?\".  I just now, lint-rolled my mohawk area and a lot of hair came out.  It's not completely naked, but it's much better.  I hope that the soreness stops soon...it's driving me crazy. I have a question....did anyone hear from an oncologist or onco nurse about NOT flossing their teeth?  I read this but was never actually told this by anyone - even my dentist.  I haven't been flossing, but it's driving me crazy....any input??   Second question.....on the Hair, Hair, Hair thread under Chemo there is a lot of talk about Nioxin shampoo/conditioner scalp therapy and treatment...I have bought this but don't know when to start using it...does anyone know?  Do I have to wait until the hair is completely gone and I have finished chemo?  There are so many posts in that thread, that it's hard getting through all of them. Thanks in advance and Happy Mother's Day to all of us who are moms!!",
      "MessageIndex": 378,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 21, 2010 09:01PM shygal wrote: Susiesue, nice to have some good news.  Congratulations.  I know...why don't you invite all your \"new\" friends (us) to the wedding so we can meet and compare hair length!! Regarding having wine?  I am embarrassed to say that I have been drinking wine almost the whole way through my treatments (white only...red seemed to bother me) with the exception of the chemo infusion week.  Geez....now I feel like a lush!",
      "MessageIndex": 1000,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 29, 2010 12:38PM shygal wrote: Raerae I too have noticed that my nails are very strong and growing and I'm on Taxotere which can cause you to lose your nails.  However, I've had very little hair regrowth on my legs and need to shave them about once every 3 or 4 weeks.  I just finished my 3rd round of TC and it was the hardest yet. ",
      "MessageIndex": 537,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 21, 2010 11:42AM shygal wrote: LauraM - wow...that is very interesting and different than what I was told.  Thanks for setting me straight.",
      "MessageIndex": 841,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 27, 2010 11:20PM shygal wrote: Hi Ladies, so we're all in the same boat with the hot flashes.  Honestly, I don't think my oncologist took my complaints about the hot flashes seriously enough and I'm mad that the only drugs offered are effexor (a anti-psychotic drug that has some difficult withdrawal symptoms) or anti depressants.  Why aren't the big pharma companies try to help out more on this?  Surely there are enough women going thru menopause naturally and then all of the chemopause women on top who would be happy to find a solution?  It frustrates me that there's nothing we can do especially since it affects our sleep so drastically.  Sorry I am ranting here but I'm getting cranky not getting enough sleep each night and having a puddle of sweat gather on my chest. I'm still waiting for approval to take Black Cohosh from my oncologist as I've heard that it may help. ",
      "MessageIndex": 874,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 21, 2010 08:55PM shygal wrote: Must be something in the air.....I have been feeling weepy lately too.  I'm not even sure why and cannot put my finger on it, but sometimes I think that I have been going through the motions of diagnosis, surgery, chemo, hair loss like it's happening to someone else.  Then all of a sudden, I think....OMG...this has really happened to me.  People seem to expect me to be strong, but like many of you, I try and be there for everyone (kids/spouse/parents/friends) and fix everyone else's problems and never focus on my thoughts and fears until it gets to be too much and then I get periods of weepiness.  At least this is what I think is happening.  Thankfully, they don't last too long.  ArubaJan and anyone else on Tamoxifen....other than worse hot flashes (oh great) what other SE's are you having?  I have heard about weight gain, but hoping it's a myth .  I'm another one who is not starting Tamoxifen until Rads are over, so I'm hoping the SE's are minimal.   ",
      "MessageIndex": 999,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 29, 2010 07:02PM shygal wrote: Hi everyone.  Just thought I'd let you know that I went and coloured my very short hair.  I couldn't take the salt and pepper gray and put in a dark blond no-ammonia colour.  It actually looks a lot better and people are telling me to start going without the wig.  Not sure I'm ready yet but I'm definitely getting closer.  I'm 11 weeks PFC now and think that maybe in another week or 2, I'll go ditch the wig.  Finally something positive to celebrate about. My hot flashes have been getting worse since it's gotten quite warm again and I've decided to try acupuncture to see if that helps at all.  Some women have reported great success with it, so I'm hoping that I see an improvement.  They are ruining my sleep.  I'll report back after I've had a few sessions.  I start my Rads this coming Thursday. Susiesue so happy that you're now finished chemo as well.  For those of you who are finishing up chemo over the next few months...we'll still be here cheering you on until all of us are done. Hang in there.  ",
      "MessageIndex": 1046,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 22, 2010 07:44PM shygal wrote: First of all...Kelli and Marcy...congratulations on being done chemo....what a huge relief.  Now you can look forward to finishing up the rest of your treatment and/or surgeries......yay. JenC thanks for that suggestion; it's an excellent one and I will look into finding a chiro that does acupuncture. Dutchgirl:  thank you for thinking of me on my/our anniversary.  I hope you and DH had a nice dinner.....my evening out with friends was quite a bit of fun. Re going topless.  I still get some stares but my rad tech today told me that my hair was fabulous so that was a great boost and makes me think that I'm right and that it doesn't look like I'm a cancer patient.",
      "MessageIndex": 1124,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 22, 2010 07:52PM shygal wrote: Saralmom,I too noticed that I had elevated bilirubin but only from reading my reports (where it gives you acceptable ranges).  No one ever mentioned it was a problem and I had a creatinine test before my last MRI that was in the normal range so perhaps as Caltex has said that your Onc is just being cautious. Keeping my fingers crossed it turns out to be nothing.  Hang in there. ",
      "MessageIndex": 1125,
      "PostDate": "22/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 10, 2010 07:03PM shygal wrote: Thanks Dutchgirl6 - I couldn't get into the links you provided but was able to find the documents once I went into the bccancer.bc.ca website.  I'll take a look at these 2 documents to make sure that the vitamins and supplements I'm taking will not cause a problem.  BTW...my Mom takes Metformin for her diabetes so I'm curious to understand how metformin can help with BC.",
      "MessageIndex": 1161,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 26, 2010 08:59AM shygal wrote: Goodluck today Caltex, I hope it goes well for you. Toughmom38, I love that at least there is some benefit from all this.  Let's hope for better hair, skin and nails when we're done.  I think that you're right in thinking that when we lose our hair, we know that the chemo is working.  Great attitude! Marcy4 - I'm right with you on the not working bit.  I too am on a medical leave and am very thankful for it.  I cannot imagine trying to get up and work on those bad days and even just the stress of my regular job and the stress of chemo and cancer itself would be more than I could bear.  Sandcat, - I guess the only thing you can really say is that the medicine that is going to make you better is very strong and makes your hair fallout but that's how you know it's working.  I think that the hardest part is the first couple of days when they are seeing you with no hair or very buzzed, but then the shock wears off.  Already, my kids said that my buzzed head looks better than when I try and cover it up with a hat or scarf, so I'm over the embarrassment of that concentration camp look and have already started going topless in the house.",
      "MessageIndex": 223,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 27, 2010 03:25PM shygal wrote: Saralmom, I hear you about the hair.  I'm just 2 days post buzz down to 1/8th inch and I'm still not used to seeing my face in the mirror.  I have been trying to make fun (at my own expense) and asked my husband if he likes sleeping beside one of the seven dwarves in their sleeping cap? I mean what else can you do?  I have already cried enough over the hair.....it's done and now I just have to live with it.  Toughmom38 I know what you mean about thinking that people are staring at you.  I wore my wig in public for the first time today and I keep thinking people realize that I have a wig on.  Talk about self-absorbed or what??  I have to get over myself.    I'm sure it will get easier as time goes on. JenC - My oncologist told me that if you're in fairly good health and younger than 50 yrs old, you should be able to manage all the side effects without a problem.  Even if you're over 50, the anti-emetics are very good and I felt that most of the nausea was tolerable with the meds (I am 49 yrs old.)  That Zofran is pretty great stuff and it seems like everyone gets it.  The other one that people are talking about is Emend (which I didn't get).  They will keep trying a new drug if the one they have given you doesn't work, so don't be afraid to request a change. Caltex I'm glad you are not having to shoot up the Neupogen as much....that's a relief.  Good luck to KimW and Dutchgirl6 today...the anticpation is worse than the actual Tx.",
      "MessageIndex": 237,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 3, 2010 04:16PM shygal wrote: Caltex, pls mark me done for chemo.  I'm now 3 weeks PFC and those nasty little chins hairs have started to come back.   I guess that's a good sign but certainly no new hair growth on my head.  My hair fluff that never fell out has turned white and has grown considerably since I started.  I think that it's around 5 or 6 weeks PFC that I'm expecting to see some stubble on my head.....let's hope so.  I am so over this bald head thing! I have Rads starting in another week and I go for 21 times as I had already had a lumpectomy and SNB in February. My continuing SE's include watery eyes, eye twitching, annoying hot flashes (esp at night) burning lips (this only started after #3) and I still have a funny taste in my mouth.  I also noticed that I have three horizontal lines in my nail beds.  The good news is that I'm off all meds and hoping that the chemo toxins are slowing dissipating. Happy 4th of July to our American sisters. ",
      "MessageIndex": 745,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 13, 2010 01:53PM shygal wrote: Good day all, thought I'd share my 1st TX yesterday with TC (Taxetere and Cytoxan).  Had my blood checked as a baseline (one small vial from inner elbow) and then waited to have it analyzed.  Had a hot pack placed over my forearm to help with IV placement.  Tried to start the IV and found out I have small veins.  Nurse put in the catheter beside the vein and boy did that hurt.  She didn't want to 'dig' any further so called the Sr. onco nurse, who did it painlessly in one try in another location.  Started on pre-meds of Zofran and Decadron and then waited 1/2 hr to start on the Cytoxan.  Did a saline flush after that and then we started very slowly on Taxtere which has a higher allery rate.  The nurse gave me 2 ice-manicures as she called them.  I thought this was to help eliminate/reduce the neuropathy symptoms but she said that hasn't been proven.  The reason was to help eliminate the discolouration of the nailbed.  Since I was on a slow drip (that they continued to increase) it took a long time and my fingers were freezing but they did give me a heated blanket which was very nice.  A final saline flush for a few minutes and then I was done.  Took 4 hours in total (in the chair and another 2 of other waiting/blood work)  this first time, but she told me to expect 2 hrs next time. Was sent home with Zofran and decadron for 2 days only and then have Stemitil (Prochlorazine)  for anti nausea after that (Pharmacist was telling me that Zofran doesn't work as well after 2 days). Interesting in that the Dr. ordered a \"Magic Mucositis Mouthwash\" that is mixed by the pharmacist - in looking online, I can see that there are many versions of this. This is to help counteract the dreaded mouthsores.    Overall, just feel hungover and \"off\" today on day 2, but know that day 3 is probably when the fun will be begin. Thanks to Amy for her encouragement.  It's greatly appreciated. Have a good day to all our April sisters. ",
      "MessageIndex": 76,
      "PostDate": "13/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 20, 2010 05:13PM shygal wrote: Thanks everyone for your thoughts and prayers. I really appreciate it as I await my (hopefully) final biopsy this Friday.  I had to arrange for an Ativan since it's MRI-guided and my previous MRI caused me to panic in \"the tube\".  I also have a strong family history and will be tested later for BRCA and will have to decide about surgical options if the biopsies come back with a new cancer..yuck. SJG05 - Congrats....it's a great feeling to be done with chemo and moving on.  My one piece of good news at 5 weeks PFC is that I can definitely see some new hair growing.  My white patchy stuff has continued to grow and now I'm filling out with more dark brown baby hair....this makes me very happy as I can kind of see a Sinead O'Connor look in the near future.  Hoping everyone is managing okay with the heat, hot flashes and the dreaded wig......these are my current annoyances but otherwise everything is good. ",
      "MessageIndex": 833,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 18, 2010 04:22PM shygal wrote: SGJ05 - so sorry you are having to \"do\" your hair today.  I figure I'm a week behind you.  I have decided that I can't bear having my hairdresser buzz me out in the open (he doesn't have a private colour room) so my husband is going to do it for me.  I am already anxious about the whole thing and keep pulling the hair away from my face to try and figure out what I'm going to look like bald; it's just too upsetting to even imagine. Re jaw pain.   Even though I haven't had a Neulasta or Neupogen shot, I have had a few moments of jaw and other joint pain.  Even thought I was getting an ear infection for about 5 mins one day.  I keep reading about taking Claritin D before and after your Neulasta shots...does this also work for Neupogen?  Welcome to the club saskabush58",
      "MessageIndex": 131,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 19, 2010 03:00PM shygal wrote: Good day ladies, well woke up with a furry white tongue.  Felt like the roof of my mouth had no feeling and extremely dry  - figured this was the beginning of thrush.  Called the onco clinic and they prescribed Nystatin. Other than that....a very good, one week anniversary today.  Feeling pretty darned fine except each evening when I can feel that familiar low-level nausea around 8:30pm.  I find if I have 2 saltines, some water and my anti-nausea drug, I can manage but it's causing me to have hours of no sleep.  The onco clinic suggested I try gravol instead of the Stemetil they prescribed - we shall try tonight. Susiesue - I have tried going without and so far (day 7) it has always backfired in the evening.  I can manage in the day, but not at night for some reason.  You should see what happens if you miss one in the day time.  If after a few hours you start to feel nauseated, then you can take the missed dose. I was told about today being my \"nadir\" day - lowest white blood count level day - and decided to stay in my bubble just to be safe.....made it a baking day.  Hope everyone is getting sunshine and nice weather today.  Julie, Look Good, Feel Better is worth it just for the free products.  They didn't really tell me anything I didn't know, but I got to try some new brands that I will keep using after this chemo is over with.  Cheers.",
      "MessageIndex": 142,
      "PostDate": "19/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 24, 2010 08:59AM shygal wrote: Kad22 so glad that it wasn't too traumatic for you.  I hope your husband was also plesantly surprised.  I think it helps to have a wig that you feel good in. Today is my day 12 and I have about 3 times as much hair in my hair brush while drying my hair, so I figure this is the beginning of the end.  In the next few day, I will have my husband buzz it as my hair dresser doesn't have a private room.  My sister says that this will be another bonding experience between my husband and me.  I hope she's right. Last night, I was able to drink a glass of wine  and I feel great again today......have a great SE-free Saturday everyone.",
      "MessageIndex": 194,
      "PostDate": "24/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 11, 2010 12:11PM shygal wrote: Hi Ladies, hope you're all enjoying your summer and winter (DancerMel28).  I am now 8 weeks PFC and my hair is about 1/4 of an inch long and looks like what it did when we first shaved it back in April.  However, it's way more grey and definitely a lot darker than what I was expecting.  (I used to have blond streaks so looked more blond than brunette).  The bad news is that almost all of my remaining bottom lashes fell out last week.  I am shaving my legs and armpits on a regular basis now and my pubic hair is also growing back.  I am planning on using an organic hair dye on my hair in about another 4 weeks so I hope the colour takes....I understand that sometimes the dye won't work on the chemo'd hair.  I'm an excited to even think about colouring my hair.... Last week I was fortunate enough to have my DH take me to Bermuda for 6 days while I'm waiting the results of my 2 new biospies tomorrow. Although I wore a baseball cap most of the time when I was out (with a lot people doing a double take) I did have to bring out the wig for dinners in restaurants etc.  Some people at the hotel then got to see me with both hair and no hair and really did a double take, but who cares...I'll never see them again.  Bermuda (and the break from being a cancer patient) was heavenly. I hope my results are in my favour tomorrow and that I'll be joining the RADS group soon.....",
      "MessageIndex": 940,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 13, 2010 12:56PM shygal wrote: Yippee....both of my biopsies were benign...I am so relieved not to have another surgery and even possibly more chemo....whew....now I can focus on getting into the radiation queue again and hope to start that late this month after we get my planning session done next week. Thanks for everyone's positive thoughts....it obviously worked. One other thing, yesterday at the hospital there was a notice about a controlled study for Hot flashes as a result of chemo for pre-menopausal women.  I called today and I'm going to try to be added to the study.....anything to help sleep through the night....I'll let you know how it goes and what they give me..... Cheers with a glass of wine (or 2) tonight and have a great weekend everyone - hoping for cooler weather in the days ahead.",
      "MessageIndex": 956,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 26, 2010 04:03PM shygal wrote: Hey ArubaJan, I was just thinking about your hat shower (now that I have been buzzed) and I think that is such a nice idea.  How thoughful of your family/friends to throw that for you.  I never realized that you need a lot of different hats for different situations and it would be helpful to have a large selection.  I wish I had read that earlier and I could have given my family a hint....! Saralmom....where are you?  You have dropped off the past couple of days....are you feeling okay?  Caltex, isheleM and Sandcat - did your TX's go okay today?? - wishing you all well.",
      "MessageIndex": 225,
      "PostDate": "26/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 28, 2010 07:48PM shygal wrote: Caltex_catlady - this is a pretty good video from the Dana-Farber Cancer Institute on tying 3 different types of scarves.  I think it takes a bit of practice.  http://www.youtube.com/watch?v=ezt-5nsIYXA",
      "MessageIndex": 258,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 10, 2010 04:59PM shygal wrote: Well I'm happy to report, I actually went to my Radiation treatment and my girlfriends house without a wig or hat yesterday.  It felt extremely liberating.  Although there wasn't much risk since I was going to a CANCER CENTRE with bald people, but since it was my first outing sans wig,  I was very pleased with my \"bravery\".  However, today at the grocery, I wore a hat so I guess I'm not really ready to go au naturel!.  JenC....love that comeback for ArubaJan's SIL.......PERFECT. Have a great weekend everyone.....hope the SE's are minimal!!.  ",
      "MessageIndex": 1079,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 11, 2010 07:33PM shygal wrote: Kelli, you're on Taxol...right?  Well her evil twin sister Taxotere causes the same mouth sores and I had one on my tongue after my first chemo round.  Call the Onco's office and they can prescribe something to get rid of it.  Do it first thing on Monday so you can get some relief.  In the meantime...keep on the salt and warm water rinse.  I'm sorry you're not feeling well and since you're back at school, I'm sure those germs are going to be tough to fight off.  Take it easy this weekend and hopefully you can get some rest....thinking of you.....and sending you hugs....",
      "MessageIndex": 1084,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 30, 2010 08:27AM shygal wrote:",
      "MessageIndex": 290,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 16, 2010 03:09PM shygal wrote: JenC....so sorry to hear about both your migraines and your neuropathy.....thinking about you and sending you warm hugs from Canada.....is it possible that reflexology would help your feet/hands?  Just a thought....",
      "MessageIndex": 1099,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 4, 2010 03:50PM shygal wrote: Hi evenyone, had an unexpected TX#2 yesterday that I thought I would share.  As most of you are doing, I have to write down any SE's and things that have happened since my last TX.  I thought that overall my SE's were pretty manageable and only had a couple of bad days.   On day four I had fainted like some others have also said happened to them.  Well the onco nurse wanted to know why I didn't phone after that happened.  I thought it wasn't a big deal and since I have low blood pressure and also fainted after my lumpectomy.  She suggested that I should have come to be hydrated and if it happened at night, I should have gone to the E/R.  I was very surprised.  She also said, that I should be phoning the clinic for any side effect that is new so that they can address it right away. Finally, the most unusual thing that happened was because of my fainiting and low level nausea for the whole first week, they reduced my chemo infusion by 10%.  The onco nurse said that this is very common and it's the least amount they can reduce the chemo.  That means that I'm going to have 30% less chemo overall by the end.  Not sure if I should be worried or not.  I didn't get a chance to talk to the Oncologist yesterday but will so I can understand how this affects the overall treatment plan.  Anyway, this is a good piece of info to know if case anyone is suffering a lot and perhaps then you too could have a reduction. The reduction made a difference in the way I felt yesterday and so far today....not nearly as foggy and don't have the hung over feeling...we'll see what the next few days brings. JenC sorry about your mood swings.  Although not happening to me, I have read that this is a common occurence.  I would definitely ask my Onc about it and see if they can give you something to 'even' you out. Good luck tomorrow Pickles and thanks for heads up on the Buffs.  I think I'll order some of those too.  I ordered a 2nd wig from the TLC on the ACS webpage but since it was so cheap ($45) I think it's going to be like Barbie-hair.  Has anyone been pleasantly surprised by the TLC wigs?  I bought the \"Arden\" which is basically a page boy/bob cut.",
      "MessageIndex": 323,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 21, 2010 08:21AM shygal wrote: Hi Ladies, met with the radiation onc yesterday and laid out the plan for radiation (I have 2 more TC to go).  Starts in July for 21 sessions that includes 5 boosts but wants an MRI first to ensure they got all the cancer out (I'm also multi focal so checking other breast for DCIS/LCIS).  Let's hope so since I had clean margins after the surgery. I was very pleased when he asked me if I was in the health-care industry since I had quite a bit of knowledge and asked very pertinent questions. Since I am not in the health-care industry, I have these boards to thank for helping me understand what to ask and what to expect. JenC, I have heard that eyelashes fall out very late in the process since they have a different growth cycle.  It's not uncommon (so I've read) to have them fall out more than once.  I have lost a few outside lashes on the bottom of one eye, but nothing else so far.  My eyebrows have thinned on the outsides too and I'm starting to pencil them in whenever I'm going out. For anyone having an itchy head, ( mine was so itchy under my wig) if you use body cream on your head at night, it seems to help.  I guess the dryness affects the scalp too, so I'm using hair conditioner in the shower and body cream at night.  Not perfect, but much better.",
      "MessageIndex": 492,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 15, 2010 08:14PM shygal wrote: Congratualtions JenC....you are finally one step closer to the end!!!.   Do we have anyone who is still in TX?????",
      "MessageIndex": 1165,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 16, 2010 06:12PM shygal wrote: SGJ05 - Re the rads timing.  I know they want you to finish your chemo cycle (3 weeks in total for me) so that would have been the earliest date.  However, he gave me an extra week off so I don't start radiation until July 12 which is exactly a month after my last chemo treatment.  Depending on the hospital, there can also be wait times, so I know that some people have not started for 6 weeks after their last chemo treatment.",
      "MessageIndex": 633,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Feb 3, 2011 07:15PM shygal wrote: Hi Ladies.  Good to hear about everyone and it seems most of us are doing fairly well.  I too have very curly hair that is about 3 inches long and I find it hard to manage since I've had poker straight hair all my life.  I have been colouring this mop since it started to grow and know that it would be pretty grey on its own.   I have been having terrible headaches for about 2 months so the Oncologist took me off Tamoxifen to see it was causing a problem and to let me get tested to see if I'm really post-menopausal and maybe to go on Arimidex.  Well I've been off the Tamox one month and I'm still having the headaches so I'm guessing it's not the tamoxifen.  They did a CT on my head this week to see if it's anything else and it's certainly worrying.  Since I didn't have lymph node involvement I'm not too concerned about brain mets, but I have to find a solution to get rid of these darned headaches. Otherwise, everything else is great and I find life is really getting back to normal.  Even my lumpectomy scar smoothed out and the scar is starting to fade!!.  Cheers to everyone.",
      "MessageIndex": 1205,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 6, 2011 10:19AM shygal wrote: Hi Ladies.....It is hard to believe it's been a year since we started our Chemo journey....in some ways, it has gone incredibly fast but in so many ways it seems like a lifetime ago.  I think of you all often and hope everyone is doing well. PS:  My curls are starting to straighten out and my hair is starting to look much more like my regular hair.  If you didn't know about my cancer, you'd think I just had a regular short hair cut.",
      "MessageIndex": 1230,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 20, 2010 05:33PM shygal wrote: ArubaJan and Saralmom, you both asked about the MRI prior to radiation.  My Rad Onc actually suggested we do a mammo only on my lumpectomied (?) breast to validate that all the tumor was gone prior to radiation.  I requested that we do a MRI so we could see both breasts in case they had missed something at the initial diagnosis since I was never initially offered a MRI in January and I know that DCIS shows up in MRI but not in a mammogram.  This makes me realize that you have to be your own advocate because the Docs are not necessarily focused on all of you....just your one cancerous breast. I'm glad I asked for it since I'd rather find out any new issues now rather than after I have completed radiation and have gone back to my real life.",
      "MessageIndex": 835,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jul 27, 2010 11:23PM shygal wrote: Karen, congratulations on being done and if you're not doing Rads then you're really done......way to go!  You'll have to let us know how Tamoxifen goes......",
      "MessageIndex": 875,
      "PostDate": "27/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 25, 2010 06:11PM shygal wrote: Emme, so sorry you're going through this on top of everything else.  I'm sending ((hugs)) your way.  Hang in there.",
      "MessageIndex": 1029,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 30, 2010 12:32AM shygal wrote:",
      "MessageIndex": 1048,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 10, 2010 03:11PM shygal wrote: Dutchgirl6 - you mention Tamoxifen counselling.  Did they give you a sheet that tells you what to avoid?  I did not get anything when I started taking tamoxifen and I don't know if there are any problems with some of the OTC stuff I take.  Can you share your info?  Thanks.  Happy Thanksgiving to you too.....",
      "MessageIndex": 1159,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 13, 2010 04:29PM shygal wrote: Hi Caltex_catlday, The Magic Mucositis mouthwash looks like it can be a combination of many things; each Dr. must have their own recipe they ask the Pharmacist to put together.  Mine includes:  Nystatin/Benadryl/Dexam....the label cuts off so not sure what that last ingredient is but it's probably Dexamathasone.  Here is something I found on the internet that looks like it might be the same recipe. A: Duke's Magic Mouthwash Formula: 1. Nystatin Suspension, 100,000 u/ml, 30 mL. or Nysatin Powder 3 Million Units 2. Hydrocortisone 60 mg. 3. Diphenhydramine HCL Syrup q.s. ad. 240 ml. And, the Pharmacist said to use it to prevent the mouth sores so I have 6 repeats and plan on using it every 2 hrs. Just noticed that my face is very flushed.  No fever, but not sure what this is from...anyone else having that issue?  The only thing I have taken today is Zofran.  Thanks.",
      "MessageIndex": 79,
      "PostDate": "13/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 16, 2010 03:52PM shygal wrote: Just noticed how bad my skin has gotten.  Day 5 and I'm breaking out like a teenager.   Anyone else having skin issues?  Today, my 20 yr old taught me how to do my eyebrows in anticipation of losing them.  There is a great kit from Sephora that uses a stencil to get the right shape and then a few different colours to make it idiot-proof.  I'm sure I would not be able to draw free-hand, so will be thankful for the stencils when the time comes.",
      "MessageIndex": 116,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 17, 2010 12:09PM shygal wrote: TPCJKK  - Julie, I think your list is a good one and I'm going to try and remember it for my 2nd infusion on May 3.  Won't have my WBC and RBC checked until that day, so won't know if my chemo will go ahead or not until then.  Where I live (Canada), they don't automatically give you Neulasta or Neuprogen unless you have private health insurance and request it. I guess if my WBC comes back low, then I will request it each time.  I don't want to delay my whole schedule because my WBC is too low. Glad I'm not the only one with skin issues.  Got out for a good walk today and felt somewhat normal.  Always feel that the nausea is coming from my brain stem instead of my stomach.  It's such a weird sensation and hard to put into words for anyone not going through it.  I think Gingerale is my new best friend. Happy Saturday to everyone. ",
      "MessageIndex": 122,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 20, 2010 10:49AM shygal wrote: Hi everyone - Starting my 2nd week out from TX#1 and my taste buds have disappeared....ahhhh.....I can't taste hardly anything.....coffee is weird, spices disappear and even spicy heat doesn't show up.  Does anyone know if this lasts throughout or is this just during a certain timeframe in the round?  Thanks.",
      "MessageIndex": 154,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Apr 29, 2010 08:43AM shygal wrote: SGJ05 - so sorry to hear of your hell week.  Did they change up your anti nausea drugs?  I really am sorry that you had to go through all that.  I am hoping that you have a better day today and that you can get through the rest of your round 2 without any further SE's.  Hugs to you.",
      "MessageIndex": 268,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 3, 2010 11:20AM shygal wrote: Arubajan05 - I definitely had a very dry mouth and I think that's what caused the Thrush that I got on about day 8.  I had to get a presciption for it, so if your tongue gets white and you lose the feeling in the roof of your mouth, you might want to call the onco office to see what they can do.  I think that thrush is sometimes caused from dry mouth so it's pretty common. Doesn't hurt but annnoying. Just getting reading to go to TX#2 and really do not like the Dexamethasone premeds.  They make me feel very wonky.  I'm feeeling a bit bummed out knowing I'm going over this whole process again, but what can you do.  Today will put me at the 1/2 way mark, so I can't complain.  I hope my WBC is okay or I guess there'll be a delay. Some of my hair is hanging in (all 1/8th inch of it!) but very naked on the sides of my head where you can see the veins in my scalp - lovely.  Very sore at times but that's been going on for at least 5 or 6 days so not sure when all the hair is going to be gone.  At least point, I'd wish it would go since I'm getting little hairs all over everything - clothes, dishes, sinks, face, shower etc. Good luck to everyone today.   ",
      "MessageIndex": 313,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 4, 2010 09:31PM shygal wrote:",
      "MessageIndex": 329,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "May 12, 2010 08:16AM shygal wrote: Marcy4, I read on the Wig tips pushpin under the Chemo thread that it helps to have a wig liner underneath your wig.  Since I do not have one, I really wish I did.  It find the wig not only hot, but very itchy.  One of the Wig Tips posters said that wigs are really meant to be worn over hair and that's why they are uncomfortable on our balding heads.  I do find that the Comfy Grip helps since it's a gel-filled band that keeps the elastic of the wig away from my scalp.  I find I cannot wear my wig for more than a few hours at a time because it's so itchy. SGJ05, good luck this week on your #3.  I hope it goes smoothly for you.",
      "MessageIndex": 412,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 8, 2010 11:32AM shygal wrote: Marcy4 and Saralmom, I too, am sorry you're both having problems.  Marcy I really hope they can find something that you are not allergic to - that must be so frustrating. I have a couple of questions for you ladies today and I'm hoping someone can help me out.  Is anyone taking Zometa (for osteoporosis prevention) yet? I had requested it but not sure of the side effects (if any). Also, I am suffering from annoying hot flashes and have them every hour in the night that can last up to 15 mins.  Consequently, my sleep is being disrupted constantly and I can be up for hours throwing the covers off and then putting them back on again once the heat subsides.  Is anyone else experiencing these?  I am hoping that they end with the end of chemo but I hear that Tamoxifen causes hot flashes too, so I'm not happy about that. ",
      "MessageIndex": 601,
      "PostDate": "08/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 14, 2010 09:51PM shygal wrote: Well ladies, I am happy to report that I have completed my final TC today. I think this makes me first in completing chemo.  I know that some of you are still in the middle of your treatment and that a few others are not too far behind me.   I am thinking about all of you with more treatments to come and realize that although I'm finished the actual infusions, I still have a few weeks of SE's to deal with including the now debilitating fatigue I have been experiencing and worse stomach acid each time.  (which I finally got a prescription for today).  I move onto radiation in July and then tamoxifen in August. ",
      "MessageIndex": 621,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Jun 18, 2010 07:52PM shygal wrote: Kelli, hang in there.  Just try and get through one treatment at a time and only focus on that one treatment.  I figure that we have our best shot of eradicating the cancer this first time, so you want to do everything you can to make sure you don't have a recurrence.  Think of it as your first attempt is always going to be your best attempt.  As Saralmom knows, the Taxol wasn't as bad as the A/C.....please don't stop your treatment.....you are one step closer to the finish line.  Sending (convincing) hugs your way.",
      "MessageIndex": 638,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 24, 2010 04:05PM shygal wrote: Wow, we have three teachers affected by BC that started chemo the same time??  Amazing coincidence don't you think?  Everyone seems to be getting back into fall schedule now.  I am planning on returning to work on Oct 12 after I have completed my Rads which start in Sept too.  Congratulations Sara on being done chemo.  What a nice DH you have....I am sure your party was very special.  I'm hoping to throw a party for all my friends and neighbours once I am all done as they have been so incredibly generous with their gifts, cards and phone calls.  I really feel like I'm getting near the end now but of course have to get through the radiation and then hormone therapy (5 yrs) first. ArubaJan you mention stiffness maybe due to tamoxifen.  Funny you should mention that.  I noticed just over the past 2 weeks that I'm very stiff in the morning and feel like I have aged about 20 years since this whole drama began.  Anyone else noticing creaky bones??  I wonder if the chemo could be the cause? Have a good day everyone.",
      "MessageIndex": 1019,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 25, 2010 06:12PM shygal wrote: Emme, so sorry you're going through this on top of everything else.  I'm sending ((hugs)) your way.  Hang in there.",
      "MessageIndex": 1030,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 3, 2010 01:22PM shygal wrote: Hey Mel, that's exactly when I lost the rest of my bottom lashes.  I'm almost 12 weeks PFC and they have grown back but still very short.  I hear that we might lose them again....sigh. Toughmom - way to go on losing some of the chemo weight.  That is excellent.  Although I didn't put on any weight during chemo, I'd still like to lose during rads before the dreaded tamoxifen.  I hope September is a spa-like month.....but it won't happen on its own.....darn! Have a great long weekend everyone.",
      "MessageIndex": 1062,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 20, 2010 10:13AM shygal wrote: Hi Everyone, hope your weekend was good and JenC and Kelli, hope you're both feeling better. I actually went out for dinner and to a concert without a wig, hat or scarf on the weekend.  I'm 14 weeks PFC and decided it was time.  My hair doesn't seem to be growing much now, but I wore huge hoops, did up my makeup (especially eyes) and decided that it was a \"fashion statement\" instead of just a chemo patient growing their hair. Using gel definitely makes me look too butchy (like your SIL said, ArubaJan....a dyke!) so I'm just letting it lie flat (although it's getting very wavy which I guess I expected but I've had poker straight hair all my life) Some people stared at me, but perhaps they were just noticing how nice my earrings were?  ha ha. Hot flashes, joint pain (knees) and no sleep are my continuing SE's from this lovely journey.  I booked my acupuncture appointment for the hot flashes but it's not cheap.  $99 for the first session and $88 for each one after that!....unfortunately my private insurance doesn't cover it. Take care everyone.  Shygal",
      "MessageIndex": 1108,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Mar 2, 2011 04:57PM shygal wrote: Arubajan....you are bang on about my headaches. Turns out I have a sinus infection.  So far one course of antibiotics hasn't resolved it so I'm on my 2nd prescription...sure hope it works.  I had my one year anniversary of my diagnosis just recently too and constantly obsess about something coming back.  My weird thing now is that my radiated breast kind of feels fake.  It seems to be getting firmer and firmer and the texture is weird.  Will the fun and games ever stop?  how about those hot flashes...does anyone know if they are ever going to stop?  I am still awakened anywhere between 4 and 8 times a night with them and it's driving me crazy.",
      "MessageIndex": 1219,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Feb 27, 2013 10:17AM shygal wrote: Dear Lexie5.  So sorry to hear that you found another lump.  Please tell us the outcome since your post is about 10 months old now.  Hoping for the best for you.  Sincerely, Shygal.",
      "MessageIndex": 1244,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 10, 2010 10:50PM shygal wrote: Dutchgirl6 you asked about what I'm doing for my 27th anniversary on the same day as yours?  Well nothing that day but actually going to see Pink Floyd and out for dinner with friends on the 18th  Not too romantic, but still a night out.  I hope I'm not too tired.  I have now had 6 sessions out of 21 and have noticed that I've been more tired in the evenings.  It may be from getting up at 6am and leaving the house at 7am and then driving for 45-50 minutes in brutal traffic...not sure. Today at Sunnybrook almost all the Rad machines were behind and my appointment (which was supposed to be at 11am) was 90 minutes late.  That is what I find most tiring. Someone mentioned that the zap time seems to be getting longer....I agree.  I think the first few times it seemed like mere seconds, now they can play almost half a song before they are moving the machine to a new location.  Maybe I'm just paying more attention now..... Glad the zaps are over for the weekend.  2 blissful days without shaving my armpits or driving that drive....yay.  Have a great weekend everyone. PS:  They started me on tamoxifen this week, so now I'm on the lookout for any SE's from that.",
      "MessageIndex": 156,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 5, 2010 08:10PM shygal wrote: I also finished my rads yesterday and I am very thankful.  My aureola and nipple are much darker (and look larger?) than the other breast and the pores on my radiated breas look like dark dots....very itchy and quite tender.  I am finding the fatigue surprisingly more intense than I expected and if I don't have a nap in the afternoon, I am a mess.  I was able to extend my work leave because of this and will have the next month or so recuperating which the Rad Dr and staff highly recommended. I'm glad that no one will be drawing on my chest anymore...for some reason that really bugged me.",
      "MessageIndex": 462,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 16, 2010 02:26AM shygal wrote: Dutchgirl6, we must be twins....same Wedding date and now....same #7 TX was cancelled due to machines being down that day.  I too will add another day to the end of the cycle......sigh. Boca, I'm having the same 2 zaps are you......down low (from outside breast) and then up high on the opposite side of the breast....  My skin is starting to pink up a bit now although I'm not getting any discomfort.  I have also been very tired before dinner but find that eating really helps me feel better.   Just 2 more zaps to go this week....yay....I'm thankful that we're not doing this 7 days a week!!!",
      "MessageIndex": 218,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 16, 2010 10:38PM shygal wrote:",
      "MessageIndex": 227,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 12, 2010 10:50PM shygal wrote: 8 days post final rads and my skin is still very red, blotchy and itchy.  I am still fatigued but have continued to walk daily.  Bloody hot flashes still keeping me up at night!!. I hope everyone is managing their (hopefully) final days without too much discomfort.   Zap-on ladies.",
      "MessageIndex": 510,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 3, 2010 01:25AM shygal wrote: Hi Ladies.  I had my first Rad session today and was told to only use Baby Shampoo during treatment (on my head since other shampoos can leave chemical residue on the skin).  I had been using Nioxin but will stop to \"follow the rules\".  I must admit, I had myself in a bit of a tizzy worrying about the radiation since I had a bit of a freak out during my first MRI.  Well let me tell you....this was an absolute breeze compared to MRI.  Besides what has been described above by Marantha about the procedure, the machine made a slight buzzing sound when it was working.  I kept my eyes closed and the whole thing only took 3 minutes.  There really was no sensation at all.  I really had myself worked up for nothing.  My mental image was of the beam killing all those remaining cancer cells, just like a fire-fighter using a full-blast firehose!! I was told only to wear a cotton (if possible) no-wire bra and like Dutchgirl6, I am in love with my sports bra that I had after my surgery.   I was also told that my radiated skin will be susceptible to burning for the rest of my life and I should always wear SPF 40 and above on that breast. So one down and 20 more to go....the whole thing took about 2 hours of my day, so really....not too bad with the remaining sessions taking a lot less time because I won't need another tutorial and will not need the x-ray that they did first today.",
      "MessageIndex": 60,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 28, 2010 10:49PM shygal wrote: Started my boosts today and thought that maybe they'd be different somehow?  Wrong.....the beam is more intense but it's not something that I could tell.  A bit more pink in the middle of my chest now, but the Rad Onc suggested more Glaxal, more often to help.  5 left...yay!",
      "MessageIndex": 418,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Aug 29, 2010 09:15PM shygal wrote: Hi Everyone and thanks Dutchgirl6 for starting the thread and nice to \"see\" you and my April chemo buddies here.  Saralmom, I was told only 5 days week - no weekends. I start Rads this Thursday, Sept 2 and then get a three day weekend off due to the Labour day holiday.  I hear there's machine maintenance one day a month as well so I will be finished about Friday October 1 after 21 sessions. I've been told to use Glaxol base (I think it's a Canadian thing) and I also plan on use my Aloe plant which I've been nursing along since chemo started.  I was wondering about wearing a bra during the treatments...does anyone know if this is not advised?  I cannot imagine going bra-less.",
      "MessageIndex": 22,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 6, 2010 09:58PM shygal wrote: Hey Dutchgirl6 - I've been married 27 years on September 17th too!!.  Congratulations. So glad that today is a holiday and there is no radiation today.  I'm sick of the drive and whole process for radiation already and I've only been 2 times!!!.  Where I go, there are a lot of machines and apparently they go down often.  On my second visit my machine was 50 minutes behind schedule.....geez....I really don't want this daily appointment to be 2 hours a day.  I have tried to re-arrange my appointments so they are all first thing in the morning so that they won't be so far behind.   I'm hoping everyone is enjoying their Labour Day holiday !.  Good luck to all of us getting zapped this week.",
      "MessageIndex": 95,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Sep 23, 2010 02:19AM shygal wrote:",
      "MessageIndex": 337,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 16, 2010 01:55AM shygal wrote: Boca, I did not get inked up again for boosts.  They used the same tatoos and used the same sharpie marks for the boosts.  I hope that this is the case for you. Dutchgirl, I am sorry you are feeling your fatigue now, but I am right with you..  I am surprised at how much fatigue I am feeling so late in the game (about 10 days Post final rads).  PS:  Thank you for the tamoxifen info...it was helpful.  I have a question for everyone.....the tattoo that is about 5 inches below my arm pit has a mole that has turned black and slightly raised.  At first I thought this was a sharpie mark, but I am so surprised that it's looking like a \"bad\"  mole.  I am going to my family Doc in the next 2 weeks to check it out but now I'm thinkng that radiation might encourage skin cancer?  I certainly hope not but this mole has gotten black, irregular and raised in a matter of months.",
      "MessageIndex": 531,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    },
    {
      "AuthorID": "shygal",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/100092/profile",
      "Content": "Oct 7, 2010 11:24PM shygal wrote: Bon, the rad staff and nurse told me the same thing.  They said that you really need about 2 months totally recover from Rads especially after chemo.  Our bodies have been through a lot over the past 6 months and just because we're finished our invasive treatment, it doesn't mean that we're back to normal. People are starting to treat me like I'm \"cured\" now since I'm no longer wearing my wig and I'm finished up all my treatments, but I think I'm going to try and take it slow over the next month or so.  I'm glad I have some time to recuperate before Christmas. One thing I've noticed this week is that my nipple has started to peel.....I'm still using the polysporin on it and of course the glaxol base so I hope it doesn't last too long. Each day is one day closer to the END....hang in there ladies. ",
      "MessageIndex": 480,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757094",
      "Title": "September 2010 Rads dutchgirl6 Teka"
    }
  ]
}