{
  "AuthorID": "sibi436",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65415/profile",
  "Posts": [
    {
      "AuthorID": "sibi436",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65415/profile",
      "Content": "sibi436 wrote: My mom was diagnosed with DCIS, 10cm mass, and had a masectomy 3 weeks ago. 5 lymph nodes were removed and they came back negative. Now the results are back and it states that she has a 5mm invasive point, grade 3. The surgeon says oncologist will be more detailed in regards to plan, but that definitely my mom will need chemo. Hormone receptors are negative, HER-2(don't know what that is or if I'm spelling it correctly) are positive, and therefore she will also need biological herceptina or something like that? Is this the treatments that are usually prescribed? Or is this doctor being extra cautious? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706623",
      "Title": "Is this the norm??? sibi436 Cathy-CA"
    },
    {
      "AuthorID": "sibi436",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65415/profile",
      "Content": "sibi436 wrote: My mom was diagnosed with DCIS, 10cm mass, and had a masectomy 3 weeks ago. 5 lymph nodes were removed and they came back negative. Now the final results are back and it states that she has a 5mm invasive point, grade 3. The surgeon says oncologist will be more detailed in regards to plan, but that definitely my mom will need chemo. Hormone receptors are negative, HER-2(don't know what that is or if I'm spelling it correctly) are positive, and therefore she will also need biological herceptin. Is it realistic for her to think that she is going to be able to work? She was working as a Nanny taking care of a 2-year old and a 4-month old. Are you able to work if you're getting chemo? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706741",
      "Title": "Work? sibi436 tooyoungtohavebc"
    }
  ]
}