{
  "AuthorID": "Silverpulle…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
  "Posts": [
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Jan 28, 2017 08:31PM Silverpullet wrote: I want to add my story here. I am 43. I have strong family history of Breast Cancer, 9 people on my mom's side, my mom is one of 9 kids, 8 girls and a boy. 4 of which have had cancer. About half had the gene mutation BRCA2. I was told after I requested a genetic test years ago by a gynecologist that removed an ovary due to a large cyst that I did not carry the gene mutation So I did not worry and did not go for any mammograms after that.. For some reason, I wanted proof. My doctor sent me to a oncologist for a genetic testing. Turns out I am positive for BRCA2. They immediately told me I need the other ovary out, and post breast removed due to strong family cancer. That was all around August. I had an MRI and no unusual masses or anything found. I went for a total hysterectomy and double mastectomy with nipple sparing at the same time and that was the end of October. I could not live with the unknown. I live with daily anxiety, and I couldn't deal with the constant fear. Its not the best choice for everyone, but for me it was. As it turned out, I had the surgery, (the hysterectomy was a piece of cake) the mastectomy was harder. Physically hard, and I went with reconstruction. Immediately put in 200cc of saline in tissue expanders on the same day. After the breast were removed, the pathology report came back with a 6mm spot of cancer under my left nipple. DCIS. I was told the left nipple would have to be removed. I opted for both, as I am extremely paranoid and OCD so can't be uneven. LOL. Expanders are uncomfortable, and maybe I am tough. But they had to unfill me for the second surgery 2 weeks after the first, A small set back. I have been routinely filled since 3 week after the 2nd surgery to remove both nipples, and am just over a week away from my real implants going in. YAY!!! Because it was DCIS, they said no cancer could have spread to other areas as of yet, but I plan to go for future MRI's. I need no more mammograms and no more periods! though hot flashes are a bitch. If you need any support, feel free to contact me. I feel good about my decision and would do it again.",
      "MessageIndex": 26,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/851623",
      "Title": "Positive BRCA result Laura25 joy2"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Feb 7, 2019 02:27AM Silverpullet wrote: I feel like I need to comment on what I have dealt with myself. I had a double mastectomy in October 2016 recommended by an oncologist because of extensive family history and I have the BRCA2 gene. After surgery they found stage 0 cancer under a nipple, so went for second surgery to get both nipples removed. No treatment necessary after that, I did get implants put in later as well.. Anyway so now I am just over 2 years out. I still get the “itch” under the implants so not reachable. I don’t get it as often anymore. As far as pain, I had extreme pain under each armpit after surgery, including the burning pain. I attribute it all to the drain tubes and the scar tissue in that area. I will have days still where even the sports bras hurt even if they are not tight. It feels a lot like the pain when I would wear a bra that had an underwire that would dig in. I will physically get red welts. My PS told me to never be without a bra though to keep implantsfrom navigating and that’s okay as I cannot tolerate going without one anyway. Had that pain tonight which is what prompted me to come here looking for answers still. My absolute worse pain though, is just in my little fat rolls ( for lack of a better description) just under each breast. That is where I had gotten much tingling sensation from the nerves, but when I am just standing at work and not physically doing anything like lifting, the pain is excruciating. Anyone have any of that pain here",
      "MessageIndex": 89,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860079",
      "Title": "Hypersensitive skin/nerves after mastectomy az2017 Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Sep 26, 2016 12:12AM Silverpullet wrote: I am not sure on your doctors exact reasoning, however, I know my plastic surgeon and the general surgeon both had said that sometimes the reason that the nipple cannot be spared is if you have alot of sagging in the breast that the nipple, would end up in an awkward place and would be more under or the bottom of the breast in the finished product and would not look normal. I have had no kids (not sure if that matters to saggy breast issues, but, mine were in such a place that I was a excellent candidate for nipple sparing. Just something to possibly consider as a reason?? Anyway, I am a month away from surgery. almost all my pre ops scheduled, need to have a ultrasound done now in my lower regions to make sure there is nothing abnormal and no biopsies needed.",
      "MessageIndex": 18,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Sep 26, 2016 09:14PM Silverpullet wrote: wow, you know, I never really thought about not being able to use my arms or stomach to sit up or down. My husband will be here to help me the whole time but, how will he grab me to get me up? I do not know I have had operations on my ovaries before, and had a large 6 inch incision, but I could still use my arms. I am seeing two of the doctors next week, so will be sure to ask about a chair ",
      "MessageIndex": 22,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Aug 31, 2016 12:21AM Silverpullet wrote: yes, I take a small dose of Xanax, butt ace increased it from 1x a day to 2-3 times a day because of my increased stress levels. I appreciate this forum group so much",
      "MessageIndex": 7,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Sep 11, 2016 07:13PM Silverpullet wrote: I am glad I am not the only one thinking about it. I would rather have one hard surgery than 2 smaller ones. No surgery is easy, and the lass I have to go through the better. My husband will be nice enough to stay off of work while I am recovering so will be able to get the care I need. To be able to get him away from work for more than one would be really pushing it with his job. Mine too. Getting closer, a little over a month away.. Nervous",
      "MessageIndex": 12,
      "PostDate": "11/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Oct 7, 2016 01:30PM Silverpullet wrote: I am 20 days away from surgery, and have had the full run down of what to expect.as far as the drains, how to empty and so forth. I already got my medications for post op. I will look deflated on both sides, not sure how I am going to handle that. They told me when I go home I will receive a fanny pack that will automatically administer numbing agents to the breast areas for a while. hysterectomy wise for me, pretty simple and straight forward, robotic surgery, minimal recovery, but have to do a bowel prep the day before and cannot eat at all for 24 hrs prior to surgery. I am not looking forward to that.",
      "MessageIndex": 25,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Feb 7, 2019 02:45PM Silverpullet wrote: I had a double mastectomy with expanders and a total hysterectomy on the same day. Robotic hysterectomy, and was super simple. Had no issues, took a lot of time and healing for the mastectomies thoug",
      "MessageIndex": 12,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738163",
      "Title": "Breast and Ovary Surgery at the Same Time strngwmn39 Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Aug 25, 2016 11:17PM Silverpullet wrote: Thats actually pretty encouraging, as I just expect that part to be the worst.",
      "MessageIndex": 2,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Sep 1, 2016 11:11AM Silverpullet wrote: MarieB, thanks for your input! I do not want to go through more surgeries than necessary, so if that means hurting all over at once then fine. I have always done well with surgery, gall bladder surgery and then my cyst, fallopian tube and ovary removed all a month later. I handled both well with pain meds. I am not sure about my aunts reasoning for sure. lh 1357, sorry about your diagnosis. Worst time of year to be away from work for our employers, maybe the best time for the employees? My boss is freaking out about me being gone through the first of the year. Oh well. I need as little stress as possible. I find it depressing knowing I have this upcoming major surgery, and worried that they might find something else, and time is going so fast!! I do not feel prepared. Hang in there. Sounds like we will be in it together.",
      "MessageIndex": 10,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Aug 29, 2016 11:32PM Silverpullet wrote: No I do not have any new information, I mentioned it to my new OB GYN and she did not disagree with my want to get a hysterectomy. I just want everything out of me that I possibly can to decrease my risk. I only have the one ovary,but I feel like while they are down there, they might as well take everything out that I do not need. I do not know what condition anything is in down there, it could be both ovaries and my old doctor lied to me about removing the other one. With who I had for a doctor, my new doctor is expecting anything. My old doctor was removed from practicing due to being not sober during most surgeries, and she burned all the records she had. I have such bad anxiety that I will be constantly worried about getting cancer, and mentally, its the best option for me. Of course, I will talk to her before hand, and will get her opinion. But, the surgery is going to be the same either way, same holes whether I get the ovary removed or a hysterectomy, and time down from that is minimal anyway. Its the breast surgery that is the worst I have been told. Who knows, if she feels I do not need the total, then I wont get it. Its not set in stone, I just think I would feel better with it all out ",
      "MessageIndex": 5,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Oct 12, 2016 08:52PM Silverpullet wrote: spent some time with my friends and family who have had these surgeries this week and co doesn't I am making the right decision. I am thinking of all my people on here who are coming up on surgeries as I am and hope all goes well for all of us",
      "MessageIndex": 28,
      "PostDate": "12/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    },
    {
      "AuthorID": "Silverpulle…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235045/profile",
      "Content": "Oct 26, 2016 04:51AM Silverpullet wrote: going in tomorrow, all day fasting, clear liquids only, and drinking all the laxatives to clean me out. I am having the double mastectomy and hysterectomy at the same time. Surgery should be at 8:30 am on Thursday, not so much worried about the surgery now, just the cleanse before and how I will feel afterwards, the pain etc",
      "MessageIndex": 32,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/847321",
      "Title": "Heading into surgery in October Silverpullet Silverpullet"
    }
  ]
}