{
  "AuthorID": "Sirena_Gord…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75581/profile",
  "Posts": [
    {
      "AuthorID": "Sirena_Gord…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75581/profile",
      "Content": "Dec 16, 2008 10:35PM Sirena_Gorda wrote: Thanks to both of you for your replies.  No, they didn't throw out the slides; I went to the hospital to get them and personally delivered them to my new doctor when I had my first appointment.  Beesie's explanation that maybe there wasn't a large enough sample of the cancer makes sense.  The slides have been re-examined by the radiologist(s) at my new facility, and I definitely need another biopsy to get the info they need because I am not having surgery before chemo.  My doctor plans to do neoadjuvant therapy--shrinking the tumor with whatever chemo or hormones they decide to use after they get the additional info they need, like ER/PR + or -, etc.  Then they will do a lumpectomy.  I'm not sure I'm comfortable with that though.  I just want this stuff OUT of my body asap. Has anyone else out there had neoadjuvant therapy before a lumpectomy or mastectomy?",
      "MessageIndex": 3,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    },
    {
      "AuthorID": "Sirena_Gord…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75581/profile",
      "Content": "Dec 18, 2008 03:15PM Sirena_Gorda wrote: LifeIsGood, thank you so much for telling me about your treatment.  It really lifted my spirits because everyone I have to tell about this says \"Why don't you just go ahead and get them both taken off and then you won't have to worry about it anymore?\"  Actually, that was my first reaction also, until I met with my surgeon whom I trust implicitly.  And, yes, I know that a double mastectomy won't remove all danger of recurrence anyway. So, they removed 17 nodes when they did the lumpectomy?  I'm assuming you also had a sentinel node biopsy before you started chemo, right?  If so, what did that show?  I am a bit confused, being new to all of  this.",
      "MessageIndex": 9,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    },
    {
      "AuthorID": "Sirena_Gord…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75581/profile",
      "Content": "Dec 17, 2008 05:26PM Sirena_Gorda wrote: Mine is Dr. William Wood at Emory.  Have you finished treatment?  I assume that you have by looking at your diagnosis date.  What treatment did you have?  And where? Yes, I would love to meet sometime.  I have a hectic schedule right now with exams going on, and then we are going out of town from 12/23 - 12/28, but maybe after that?",
      "MessageIndex": 7,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    },
    {
      "AuthorID": "Sirena_Gord…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75581/profile",
      "Content": "Dec 19, 2008 03:27PM Sirena_Gorda wrote: Oh, LifeIsGood, thank you, thank you, thank you again for the positive words, especially about being able to work while having chemo.  I have spoken to a colleague who went through this at about this time last year, and she had a horrible time with chemo and had to miss a lot of work.  She even lost some of her fingernails and toenails because of it, and that horrifies me.  I don't mean it is horrifying from a vanity standpoint, but just the thought of the pain involved in losing them just freaks me out, and I am not a wimp!  I realize that everyone takes a different journey through this, so I just hope that mine is similar to yours.",
      "MessageIndex": 11,
      "PostDate": "19/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/725978",
      "Title": "What does a core needle biopsy test for? Sirena_Gorda omonim53"
    }
  ]
}