{
  "AuthorID": "SissyK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205965/profile",
  "Posts": [
    {
      "AuthorID": "SissyK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205965/profile",
      "Content": "Jan 31, 2016 11:00AM SissyK wrote: I, too, was diagnosed in 2013 at stage 1. I have had no MRI's since the one before surgery. I had a lumpectomy. Mammograms every six months for the first year, and then annually since then. MO has said he will release me this fall, assuming all remains as is. I would really like to have an MRI to give me peace of mind before being released and \"left on my own.\" He said he will order one if I want it, but insurance will not pay. I'm going to investigate how much it will cost, and then decide what to do.",
      "MessageIndex": 2,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/840893",
      "Title": "Yearly MRI's trsmith26789 SissyK"
    },
    {
      "AuthorID": "SissyK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205965/profile",
      "Content": "Apr 1, 2016 12:24AM SissyK wrote: I just saw my radiation oncologist for the last time - 5 years out from initial diagnosis.  I saw him annually after my 30 treatments ended.  At each visit, he did a breast exam, felt my arms for swelling and my neck for swollen lymph nodes, and listened to my lungs and heart.  While there were times when I wondered at the need for the visit, I liked the reassurance of having 3 breast exams in a year (every 6 months with surgeon/oncologist).  He was also very easy to talk to, took lots of time to answer any questions.  His responses, while basically the same as the answers I got from my surgeon/oncologist, were sometimes easier to understand.  It was like getting a continuing second opinion throughout my treatment. During this last visit, I asked him to remind me of long-term side effects that I should be aware of.  He said there are no longer heart/lung issues from \"today's\" breast radiation treatments.  There is the possibility of a secondary cancer developing from the radiation, but that usually happens 20 years down the road and there is no way of predicting who will develop it.  I think he said the odds were 1 in 3000.   ",
      "MessageIndex": 80,
      "PostDate": "01/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/816658",
      "Title": "Long Term Radiation Side Effects 10+ years After? Barbarella60 Raebrewster1971"
    },
    {
      "AuthorID": "SissyK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205965/profile",
      "Content": "Mar 11, 2016 10:20AM SissyK wrote: Juzo sleeves work for me.  I was really happy to see the new designs when I recently needed a new sleeve, but was very disappointed that there were no matching gloves. A glove is a must for me, gauntlet a definite no-no.   I just bought my standard, boring beige.  Yuck!  Then, someone pointed out that a plain, but colored glove would coordinate nicely with the patterned sleeve!  DUH!  Of course it would!  That is what I'll do when I buy my next one.",
      "MessageIndex": 8,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841364",
      "Title": "Juzo print sleeves--take a look! Binney4 SissyK"
    },
    {
      "AuthorID": "SissyK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205965/profile",
      "Content": "Sep 23, 2016 07:15PM SissyK wrote: I heard nothing about lymphedema or cording during my visits with oncologist/surgeon or radiation oncologist.  When I first went to physical therapy for my lymphedema, I commented the therapist about the \"void\" left in my armpit where I assumed surgeon had removed lymph nodes.  She gently corrected me: it wasn't a \"void\"  in the armpit, those were two cords that had developed in the armpit, raising the skin and leaving a hollow between them.  She was able to show me that they continued down into my upper arm.  She did a lot of manual stretching in the area, saying that sometimes one could even hear them pop when they break.  Mine would not break - and let me tell you she tried!!!! Ouch!  She did get eventually get them stretched. It was a surprise to me to realize the range of motion that I had lost in that arm.  With her stretching manipulation and having me do arm exercises, I got my range of motion back. That was three years ago.  Now, when I feel my arm tightening up and that pulling feeling in my armpit, I start back with the snow-angel stretches that she started me on:  Lay on your back on the floor, arms at your side, palms up.  Keeping arms in contact with the floor, raise them as high as you can overhead - like you are a child making a snow angel.  Works for me!   ",
      "MessageIndex": 4,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/848172",
      "Title": "cording problems MDAng SissyK"
    }
  ]
}