{
  "AuthorID": "Sissy1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129431/profile",
  "Posts": [
    {
      "AuthorID": "Sissy1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129431/profile",
      "Content": "May 20, 2011 03:36AM - edited May 20, 2011 01:45PM by Sissy1 Hello, I see this has been a thread that was posted some time ago. I hope someone will still reply. I started having brown discharge from one duct on the left hand discovered with a mamo for follow up after lumpectomy. Lumpectomy was not close to the duct that has the discharge. The mamo was my 3rd(?) 3 month follow up. The first 3 month follow up I had no discharge. Discharge Tested positive for blood. Had a ultra sound and the duct is enlarged with a small lump seen in the duct. The discharge is no longer dark brown after having it for a couple months and has seemed to chaged to a very tiny amount of light red mixed with the discharge. Will see the Dr. in a couple weeks. My question is could the discharge possibly be from the lumpectomy? Even if the lumpectomy was on the bottom part of the breast and the duct is not close to it? Is it normal to have something change so fast? Is this hormonal? My Dr. did mention that if the ultra sound came back with anything on it they would want to remove all the ducts. Is this the right thing to do? I feel like I am loosing a peice at a time and am stressed. I don't feel the wait and see what happens is ever a good idea.  Your thoughts and support please. ",
      "MessageIndex": 16,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724698",
      "Title": "Pending Duct Excision.....PLEASE HELP Rene48 Grannyx2"
    },
    {
      "AuthorID": "Sissy1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129431/profile",
      "Content": "May 20, 2011 01:41PM Sissy1 wrote: Thank you for the reply. I had to try and figure out when it was...The lumpectomy was before Oct.2010 and the discharge was not present when I had it done. My mind is not as sharp as I would like for it to be. I have lost several feet of intestine from a different illness and have nutrition challenges that make my memory somewhat challenged to say the least. I guess in a way it makes the waiting not to awefu since I seem to be able to loose track of time easily. But I do get anxious from time to time.... Did they do other test for the discharge? I will let you know what is next when I see the BS. I figure it might help others since I could find little info on the www. Most info seemed to not say too much.",
      "MessageIndex": 18,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724698",
      "Title": "Pending Duct Excision.....PLEASE HELP Rene48 Grannyx2"
    }
  ]
}