{
  "AuthorID": "Sita505",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172090/profile",
  "Posts": [
    {
      "AuthorID": "Sita505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172090/profile",
      "Content": "Feb 27, 2013 07:42AM Sita505 wrote: Hi there. I am new to this forum. I started Rads 1/31, have 11 more to do. I am very small breasted w/ the cancer on my left side and worried about my heart and lungs. My Doc said when I asked about heart protection that I may have to do breath holds, but then did not say I needed them. I am sort of trying to do a little breath hold anyway, just because I have lost fullness in that breast and am so worried about my heart. I have had a low grade temp and nausea too. Additionally, I have had very low iron and had to have blood and iron transfusions possibly from a bowel resectioning this summer. It has been hard. I am single and some of my friends are I guess burned out from the summer. This is an informative board.",
      "MessageIndex": 51,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Sita505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172090/profile",
      "Content": "Feb 28, 2013 06:51AM Sita505 wrote: Hi Can you tell me what the homeopath recommended for skin breakdown? Both the cream and the remedy? I am using Calendula during the day and Aquafor at night. I have 11 sessions left, six full area and five targeted breast only. My skin is breaking down badly under my arm . I don't know what to do for the breakdown. I used wound dressing last night, but the challenge is keeping the dressing in place w/o irritating the underarm area. My clinic nurse gave me a net that stretched over my torso, but it slips under my arms. I just need to get thru the next six sessions and then the underarm area can start to heal. I had a very hard time when I first started Rads, then I was told to visualize healing beams of light. That has helped me. Good luck with your Rads, you will get through it! Sita",
      "MessageIndex": 53,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Sita505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172090/profile",
      "Content": "Mar 1, 2013 08:01PM Sita505 wrote: Thanks Robin. My Rad doc said that if necessary they would have me hold my breath when I asked about damage to my heart. Then he said nothing more about it. I am s little concerned that I am changing the position if the markings when I try to hold my breath? Any thoughts on that? I have 8 sessions to go and my skin is really breaking down. I started Silvedene for the broken skin and use Aquafor at night and Calendula during the day. I welcome any suggestions. Thanks, Sita",
      "MessageIndex": 56,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    },
    {
      "AuthorID": "Sita505",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172090/profile",
      "Content": "Mar 4, 2013 07:10AM Sita505 wrote: Thanks Robin. I am now using prescription Silvadene and it seems to be helping. I will ask the techs about breath holds. I am now really tight under my left arm and terrified about Lymphodena. I get an iron transfusion today; they still don't know why I am so seriously anemic. Having cancer impacted my denial mechanism. I never believed I would have cancer! Since I did I now am afraid of everything. I just want to be healthy again as I know we all do! Sita",
      "MessageIndex": 59,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/798115",
      "Title": "PacNW or anyone else close to starting rads in 2013? Robin_Brooke SwgeeWi"
    }
  ]
}