{
  "AuthorID": "SJI",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
  "Posts": [
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Apr 2, 2017 09:28PM SJI wrote: Had lumpectomy Thursday, March 31 at noon. Surgery took a bit over two hours. Was on the ferry headed home at 5:30 pm. (It's an hour from surgery center to ferry). Both my older daughter and my 6 year old grand daughter have been here from out of state helping me.. They leave tomorrow. I've felt more relaxed since having surgery - maybe just the thought that the cancer was removed but most likely due to having family around. Getting anxious about pathology results. Waiting seems to be the most stressful part of bc. At preop appointment surgeon said he was going to consider my cancer multi-focal. Said if the lumpectomy didn't get it all we may be looking at a mastectomy and either way I would need radiation. Post surgery I have found the sentinel biopsy area more painful than the lumpectomy area. But it hasn't really been that bad. I have been really tired and have slept a lot. Am ready to work tomorrow.",
      "MessageIndex": 585,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Mar 25, 2017 10:35PM SJI wrote: i am scheduled for a lumpectomy and snb on Thursday and am feeling nervous. My ilc looks like a string of pearls in a MRI but in an ultrasound only one \"bead\" shows up. The radiologist and technician spent a lot of time and effort figuring out a way to mark both ends last week. I'm hoping it all works out.",
      "MessageIndex": 438,
      "PostDate": "25/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Apr 29, 2017 08:50PM SJI wrote: This article just came across my desk. It describes who is at a higher risk for having lymphedema. http://www.medpagetoday.com/meetingcoverage/additionalmeetings/64916",
      "MessageIndex": 52,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/853781",
      "Title": "Constant fear of lymphedema--VENT gb2115 ChiSandy"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "May 26, 2017 10:50PM SJI wrote: tappermom We had surgery on the same day. Glad to hear your first week of ears went well. I start next week and am really apprehensive about it. At the planning appointment the nurse said to use lotion right after the first treatment. Funny how everyone seems to be getting different advice. I'll be riding the ferry a lot in order to get the 20 treatments. The way the ferry schedule is I'll leave at 11 am and get home at 6 pm. At least I work on a computer so I can take my work with me.",
      "MessageIndex": 199,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 1, 2017 08:38PM SJI wrote: Peetie1- I asked the tech today. She said I'm only receiving radiation during the breath holds.",
      "MessageIndex": 241,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 28, 2017 10:53PM SJI wrote: Finished rads yesterday - 20 including 4 boosts. Traveled 2,100 miles to do so - had to take a ferry and a car every day. Besides the infection I got - due to an aspiration from BS 2 weeks in, I didn't have much of a problem. Did get fatigued, hoping It goes away soon and I got a rash under my arm. Volunteers at the hospital make lap quilts and you get to choose one on your last day, also got a certificate and got to ring the bell. I'm going to focus on getting my strength back. I found it too difficult to work out the last couple of weeks. Hoping we all get back to feeling like ourselves again.",
      "MessageIndex": 421,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "May 30, 2017 02:16PM SJI wrote: Law 193: I am sure it's different for everyone but I am supposed to see my breast surgeon halfway through my radiation treatment. See the MO a month after I finish radiation. I'm starting today and am incredibly apprehensive about it.",
      "MessageIndex": 225,
      "PostDate": "30/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 16, 2017 12:26AM SJI wrote: I just finished my 13th rads have 3 to go plus 4 boosts. Fatigue has been my only se. I added more protein to my diet and it seemed to help.I am self-employed so I need to keep working. Part of my fatigue is due to the 4- hour roundtrip for each appt. Something weird has come up. My breast has swelled up in the area of the lumpectomy - 11 o'clock position. The bs drained fluid out during a followup appt yesterday. It didn't reduce the size much. Today I got a cat scan after rads. They said they would have to make some adjustments since the breast profile had changed. I was told rads made your breast smaller not larger. Has anyone else had something like this?",
      "MessageIndex": 330,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jul 3, 2017 05:05PM SJI wrote: Hi, It's been six days since I finished my 20 radiation sessions. I've noticed \"freckles\" on my breast and have had a bit of itching. My biggest problem is muscle weakness. The fatigue is getting better but today I had trouble climbing stairs. Not out of breath, actual difficulty getting up the stairs. I had to partly pull myself up using the railing. I didn't work out much during the four weeks of radiation due to fatigue and time available. But I don't think I should be this weak. Anyone else have anything like this. ",
      "MessageIndex": 431,
      "PostDate": "03/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 17, 2017 07:49PM - edited Jun 17, 2017 07:49PM by SJI Kimberly-B: Sorry you got the diagnosis. The forums on this website are a great resource. A lot of us have found that the most stressful part of this journey is the waiting. I'm now in the last week of radiation and then will go on anti-estrogen pills. So I am almost done but I know the worst times for me were the days just before appointments. I got really anxious about what the latest news would be. Once the treatment plan was decided upon, it was a huge relief. A lot of my anxiety about bc went away. It took from January 10 to mid-March before my treatment plan was finalized. I think a lot of people get theirs sooner. Hope things go swiftly for you. Today's treatments are really tailored to the individual and light years ahead of what women went through before. It is overwhelming at first. I knew nothing about the types of bc before. With this site you'll be an expert before you know it and gain confidence in what questions to ask your docs. Hang in there.",
      "MessageIndex": 349,
      "PostDate": "17/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/748296",
      "Title": "Just Diagnosed- Get Prepared sas-schatzi Amyadipose"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "May 31, 2017 12:13AM SJI wrote: Had my first radiation treatment today. Was really anxious about it. I have to hold my breath for part of the treatment. That ended up being easier than I expected. Now that the first one is behind me I feel much more relaxed about the 19 more to go. I was surprised by how big the machine is.",
      "MessageIndex": 231,
      "PostDate": "31/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 16, 2017 06:53PM SJI wrote: Just as I was thinking things had gone smoothly and as I was counting down my radiation treatments (I have 3 plus 4 boosts left) my breast became infected. So today's treatment was cancelled. I was on the table ready for treatment when the decision was made. I'll be on antibiotics for 10 days and may be able to have radiation on Monday. Anyone advice?",
      "MessageIndex": 333,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Jun 22, 2017 06:37PM SJI wrote: Congrats to those who finished radiation. I'm down to the last three boosts. My infection cleared up with the antibiotics. Ended up missing only one session due to the infection. Luckily it was a Friday so ended up having three days in a row off which I think helped. Been using aquaphor and aloe vera and my skin is in good shape. Only problem is a large lump in area of lx. Surgeon drained a seranoma a week ago. This lump didn't go down. He mentioned it might be tissue that folded over. I am hoping it is something related to radiation and will go away once radiation ends. Might be wishful thinking on my part. ",
      "MessageIndex": 392,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/854527",
      "Title": "Starting Radiation in May 2017 Tappermom383 smarchez"
    },
    {
      "AuthorID": "SJI",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247418/profile",
      "Content": "Mar 12, 2018 11:22PM SJI wrote: Yesterday my left breast, the one I had the lumpectomy in, was swollen, red, warm to the touch, extremely painful, skin was bruised and looked like an orange. It hurt to walk, any jarring motion was painful. I went to the Dr today. She diagnosed mastitis, ordered antibiotics and an ultrasound to determine if there was an abcess. Unfortunately I looked up mastitis and saw the symptoms for inflammatory breast cancer. It said the difference is mastitis usually includes fever. I'm post menopausal so mastitis seems an odd thing to get. So I'm starting to panic a little. Hoping the antibiotics kick in and it's just an infection. Anyone else have this experience?",
      "MessageIndex": 42,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861853",
      "Title": "Worried about IBC chelleb1017 sbelizabeth"
    }
  ]
}