{
  "AuthorID": "Skee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
  "Posts": [
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Aug 8, 2013 05:14AM Skee wrote: Update at last- it's taken this long to get referral to breast clinic etc.  Good news!  I had a clear mammogram and was told the inverted nipple is probably due to a shortening of the milk ducts which then pull the nipple in, apparently it's quite common in older age (I'm 41!).  The doc seems quite certain this was the case due to the appearance of the nipple which is reassuring and I am relieved beyond belief!  The weeks of waiting were difficult and sometimes when I looked at my 2 young children a terrible fear would descend- but now I can move on with an appreciation of how lucky I am and it certainly changes your perspective on things.  I was someone who didn't really check my breasts before this happened but now I will always be very breast aware. Leaf- When I was having a 'what if' day I would sometimes re-read your post and get my perspective back in order so thank you! My happiness is tinged with sadness though knowing that so many lovely ladies are not as lucky as I have been, and my heart goes out to you all.  xx",
      "MessageIndex": 9,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    },
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Skee wrote: Hi, I am new to here and am just looking for a bit more information.  I am 41 and over the last couple of months have noticed that my left nipple has become inverted.  It isn't like that all the time- sometimes its almost back to normal, at other times half inverted and sometimes fully inverted and completely flat. Over the course of the day it can be all of these although it is becoming fully inverted a lot more of the time now. The nipple has never been like this before (they usually protrude enough to hang your coat on!)  Initially I wasn't too concerned and put it down to one of those things- getting older, recent pregnancy etc. (although I didn't breastfeed- I did with my other child but the nipple was fine throughout that).  It wasn't until I saw something on television the other day about breast cancer awareness that I became more concerned and thought I had better get it checked out.  I have no other symptoms though, have had a good feel and no lumps or anything.  Therefore I am not too worried at this stage as I know it could also be other things.  Anyway I have made an appointment with the doctor but they can't fit me in for 2 weeks. I don't want to google and keep frightening myself when there probably isn't anything to worry about, but 2 weeks waiting to see a doctor seems a long time, and I'm also quite worried in case they don't take me seriously especially if the nipple isn't fully inverted at the  appointment.  Am considering taking a photo of it to take along to the appointment but this somehow seems quite wrong! Any info/ people's  experiences would be welcome- thank you!   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    },
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Jun 25, 2013 08:16AM Skee wrote: Thank you- that's just the sort of information I was looking for and it has put my mind at rest somewhat and feel much better about waiting a couple of weeks.  Realisitcally the chance of something being seriously wrong is as the studies indicate very slim, so I shall keep positive and I know I'm doing the right thing in getting it checked out anyway just to make sure. Will keep you informed.",
      "MessageIndex": 2,
      "PostDate": "25/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    },
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Jun 26, 2013 09:02AM Skee wrote: Thanks for responding. Did you have any other symptoms at all?  Must have been a real shock to receive your diagnosis especially after clean mammogram in Feb.  How are you now, treatment etc.?  Feel bit of a fraud on here more than likely worrying about nothing when people like you are going through such awful times.  But as you highlight it's definately worth getting it checked.",
      "MessageIndex": 4,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    },
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Jun 29, 2013 06:05AM Skee wrote: Thanks for your message and taking the time to reply.  I feel the same really- it's not obvious all the time and doesn't seem like something to be overly concerned about.  However after hearing yours and other's stories it makes me feel less silly about getting checked out! ",
      "MessageIndex": 8,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    },
    {
      "AuthorID": "Skee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/182769/profile",
      "Content": "Jun 28, 2013 08:33AM Skee wrote: My goodness, what a journey you are on, am guessing your emotions are all over the place.  I hope you are keeping as positive as you can, my thoughts are with you.",
      "MessageIndex": 6,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806676",
      "Title": "New inverted nipple Skee Skee"
    }
  ]
}