{
  "AuthorID": "Skiboots42",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
  "Posts": [
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 10, 2018 04:47PM Skiboots42 wrote: Hi ladies, this is my first post. I had surgery early May and went back to work last week. I felt like it was time to get back to a normal routine. I work part time, but long days. I am still really tired all the time. How is everyone else doing with energy? I also have a 3 and 5 year old so that might have something to do with lack of energy. I have Tamoxefin in my future and hope I end up being able to tolerate it. I have read that getting vitamin D level and magnesium level to normal may help with decreasing side effects. Does anyone else have any insight on preventing side effects. I just found this thread and it is helpful to read about everyone’s journey",
      "MessageIndex": 393,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 15, 2018 11:01PM - edited Jun 15, 2018 11:01PM by Skiboots42 SLL I guess I have been really lucky after reading so many having a lot of discomfort with the fills. I have found the fills just a little bit uncomfortable. I also only have one side. I try to do lots of stretching and massage around the expander. I think if you already have air expanding the muscle the saline should not be much different. I am really curious to see how everyone does on Tamoxefin. I hope everyone tolerates it ok ",
      "MessageIndex": 437,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 19, 2018 04:24AM - edited Jun 19, 2018 04:59AM by Skiboots42 sn75- I would call and ask about the drain wound still draining. I have no idea if that is normal, but seems a long time. Are you still on antibiotics? Was your output under 30 mls before they were pulled? Mine closed up after about 48 hours, however I did have my drain in for over 24 days... horrible. I am on day 4 of Tamoxefin with no noticeable side effects. Hope is continues. I am taking it at night with dinner. When are others taking it and why? It sounds like peak plasma level is about 5 hours after taking it, so I think I would rather be sleeping. However steady state takes about 4 weeks and its metabolite about 8 weeks. So it will be between 1-2 months to know how we all really respond to it. What have others heard or read",
      "MessageIndex": 461,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 16, 2018 03:25AM Skiboots42 wrote: ReadyAbout- Another suggestion on medical appointments try to get either the first appointment in the morning or right after lunch, the provider is less likely to be late. I also hate waiting. I hope things improve for you!!",
      "MessageIndex": 441,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 16, 2018 04:13AM Skiboots42 wrote: SPDgirl- Yes... I am hypersensitive to changes. I am sure that will increase with Tamoxefin. The cancer diagnosis is all consuming. I hope it becomes a new normal and forgotten most of the time",
      "MessageIndex": 443,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 29, 2018 06:39AM Skiboots42 wrote: Ljm- I was also exhausted at 5.5 weeks. I am now close to 8 weeks and feel so much better. I would say normal, but I find myself a little short tempered. So much has changed hormonally I feel I should get a little slack... Is it the surgery removing part of me, the removal of the IUD, starting cycles after not having one the last 7 years (back to back pregnancies, breast feeding, then IUD). I forgot how much monthly bleeding stinks (that in itself could make me moody) or is it the starting a medication that mimics menopause. Oh and I completely changed my diet to plant based andno refined sugar. I just want to say I love ice cream in the Summer, say bye bye. Yeah... I think we should all get a little or a lot of slack if we are not quite ourselves for a little bit.",
      "MessageIndex": 528,
      "PostDate": "29/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 16, 2018 02:38AM Skiboots42 wrote: ReadyAbout-  I am so sorry about your experience!! I am actually waiting until October for my exchange. My PS said that it is actually beneficial to wait a little bit because the implant softens the further out. I am also trying to plan the second surgery with time off. I truly hope things improve for you. Have you discussed your nerve pain with your oncology surgeon or MO? They would also be able to prescribe gabapentin. Some providers are not comfortable prescribing that because it needs to be titration up to therapeutic dose. I am a physician assistant. It can help with nerve pain. Try a different path to get it and try it. There are side effects as there are with everything... sigh .",
      "MessageIndex": 440,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 23, 2018 04:57AM Skiboots42 wrote: spdgirl- I also had glue. It took awhile for it to come off, about 5 weeks. It just peeled right off. I am so sorry for those of you suffering from chronic pain and nerve pain. It wears on you both physically and mentally. You are correct those who have not experienced it do not understand. Hang in there and hopefully some of the alternative therapies will help. Being in the hands of a pain specialist is probably the best place to be. Surgeons are great at surgery, but generally at a loss with continued post-op pain. It is not their specialty and honestly they stink at it",
      "MessageIndex": 490,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jul 4, 2018 04:47AM Skiboots42 wrote: I have also started Tamoxefin. I am about 3 weeks in. I think I am doing ok, just very temperamental. It is hard to say why, lots of changing variables. I hope we all tolerate it ok",
      "MessageIndex": 551,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jul 11, 2018 09:08AM Skiboots42 wrote: sn75- i am over 2 months out. I agree on the emotional side of things. I am the rock in my family, it has been hard to keep that up. I have been lucky and have had a pretty smooth recovery, but emotionally I feel numb. My joys are not as high. I feel like I am just trudging through time. It is hard because I was a very up beat positive person. I hope I can find joy again",
      "MessageIndex": 585,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 15, 2018 04:39PM Skiboots42 wrote: Hi ladies I too had a good report from the MO. Although my case is going to their tumor boards. My DCIS was right up against my pec wall. They are going to discuss if I would benefit from radiation. I hope the answer is “no”. I am going to do a trial of Tamoxefin, hopefully I can tolerate the side effects. If not it is strict plant based diet for me, which I am starting anyway. I am about 6 weeks out and have no real pain. My expanders are full 550cc and I am back to work and exercise. It does get better!!! Hang in there. My energy is also starting to come back. Just a little bumb in the road called life!! I have three very important reason to make better lifestyle choices they are Austin (5), Sawyer (3), and my hubs. I was not necessarily unhealthy before, but I can do better. For those that are looking for other ways besides medication to decrease recurrence risk check out the book “Breasts, the owners Manuel”. Have a great weekend everyone",
      "MessageIndex": 432,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 19, 2018 11:37PM Skiboots42 wrote: I am actually jealous of all you braless folks. I only had my right removed and expanded. I still have to wear a bra for the left, which much more droopy than the right. I am hoping I can get a little lift to that side during the exchange. I would totally go braless if I had both done",
      "MessageIndex": 470,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jun 21, 2018 01:15AM Skiboots42 wrote: wow... there are a lot of us with young kids. Mine are 5 and 3. It is tough!! I actually did not have any restrictions from day one. More or less went by how I felt. I think stretching has really helped me. I have full range of motion. I am back to my normal workout routine. It is a really weird feeling when I contract my pec, not pain just weird. I could be one of those guys in the gym who makes there pecs jump on command. Probably not attractive for a female 😂. I am at 550 on my fills. Trying to decide if I want a little more. Looking to be a full C. To match the other side. I think my recovery has been much easier only having one side reconstructed",
      "MessageIndex": 479,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Skiboots42",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275236/profile",
      "Content": "Jul 12, 2018 06:57AM Skiboots42 wrote: blessedinthismess- I totally agree. I am much more short tempered and grumpy. Unfortunately my husband and mother get the “tamox” wraith. I can hide it from everyone else. I hope it becomes better over time. I am just not the happy person I use to be. I really feel sorry for my husband, who has been incredibly supportive",
      "MessageIndex": 593,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    }
  ]
}