{
  "AuthorID": "skimommi",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
  "Posts": [
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 12, 2012 03:39AM skimommi wrote: Itsalltemporary how did you skip the 'A' part - which stands for adriamycin by the way. My current MO said the only way I could take TC and not the TAC is if I participate in a study. However, even if I sign up for the study they basically flip a coin and decide whether I get to take the A or not. He also explained the A is a little harder. I had talked myself out of the study, but I'm getting a second opinion anyways so we shall see what the new MO has in store.  I can only imagine after this taking up so much of everyones life for the better part of a year, it must be hard to find a new routine. Can you join a \"survivor\" support group?",
      "MessageIndex": 1391,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 9, 2012 06:12AM skimommi wrote: Hello all of you beautiful warriors! I have been trying to read through many of the chemo posts from those of you that started early this year and learn what is in store. I also posted this question in the February 2012 post. I would love to hear from anyone that worked during their treatments. How did that go and did anyone start out with the intention of working and then was unable to due to SE's? I anticipate taking a long weekend after treatments, and can work from home a couple of days a week when feeling up for it.  But, for insurance purposes I want to be realistic and if I need to plan more time out of work do that now. I heard it is easier to file for STD in the beginning rather than trying to do the right thing by working through treatment and if learning that I can't make it the STD company makes it more difficult to apply mid-treatments. Did anyone continue a regular workout regimen during treatment? Or did that become too much? I was pretty active prior to DX, and then everything came to a halt. Following my BMX I've tried to at least keep up some walking each day. I was hoping to utilize the gym during treatment, but have also heard that may not be wise due to the germ factor. I should begin chemo in December. Meeting with a new MO on the 20th. Pretty sure I will be told the same as my current MO, that I will take 6 rounds of AC/T, but getting the second opinion because of this particualr MO's reputation in working with young women. Also, the facility offers integrative medicine, such as massage therapy, acupuncture, etc. on site. I would like to take advantage of those treatments the day following chemo, and think it wil be much easier to do it all at one location. So far I have been driving myself crazy trying to locate and coordinate the additional care.",
      "MessageIndex": 1361,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 11, 2012 06:38PM skimommi wrote: Thank you ladies for the feedback.  Itsalltemporary I am striving to mimic your story and have in mind that I will take long weekends and work through the chemo. I work in an office and fear the germ factor. Is that a major factor the entire time you are taking chemo, or more so just for a time frame following each sessions when blood counts are lower? SusanHG123, I grew up in El Paso, Texas.  I sure don't miss those dust storms. ",
      "MessageIndex": 1383,
      "PostDate": "11/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Sep 29, 2013 11:36PM skimommi wrote: Really, my hair took forever to start coming back too. Be patient. It will return. ",
      "MessageIndex": 19529,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 8, 2013 07:19AM skimommi wrote: shore1 how long is your hair? About what timeframe did everyone start feeling the need to trip the fuzz that grew in after chemo? Did you trip the new growth pretty quick and on a regular basis so it came in even? Also, for those that sport scarves more than anything. What was your favorite thing to wear under your scarf, if you opted for anything at all. I've been wearing a three seam turban, but have seen another product by TLC specifically for giving padding and guidance (so the scarf doesn't slip). Just wondering if it is worth looking into or if I'm better off remaining with the turban.",
      "MessageIndex": 18961,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 9, 2013 11:04AM skimommi wrote: Denise51 I've heard from a lot of women that are undergoing chemo right now that didn't loose their brows or lashes, or that they may have just thinned. It does sound like those don't bail out until PFC. I've been using Brian Joseph's gel since a week before starting chemo, and every day since. It is expensive so I hope it will work, but based on everyone else in the same part of treatment as I am I can't say for sure yet. Good luck to you!",
      "MessageIndex": 18983,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 5, 2013 11:48PM skimommi wrote: Hi Ladies! I've been reading up on some of the posts. I was intrigued to find out what could be learned from this thread thanks to my dear friend LeeA. ;) I'm just halfway through chemo, so quite a while before I can think about real hair. From what I've read so far it seems there is a lot of sharing for dealing with the no-hair thing too. I'm looking forward to learning more, and sharing where I can. Like some of you have posted, I have opted to go with just scarves and buffs. I bought an expensive wig and wore it for a total of one hour . . . two months ago. It sits on my dresser still not to be touched (other than for my 11 yo DD to ask once just to check it out on me). She was even looking at it again and shaking her head in disagreement. LOL HVV and Ulightup, not sure how different the method is, but when I use to blow my hair out I used the super large velcro rollers to help in the process. You can buy them just about anywhere for cheap. Ulightup, you can section out your hair over the velcro rollers while you go about doing makeup or whateer else your morning routine entails, then dry out section by section with a round brush. It makes the process go much \"smoother\".",
      "MessageIndex": 18950,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 6, 2013 02:45PM skimommi wrote: Ulightup there are so many straightening products out there nowadays. I think Aveda has a good one, and I love got2be products. Those are inexpensive and you can get them at Walmart.  Many moons ago I swore by John Frieda. Those products are really good for keeping the frizz at bay.",
      "MessageIndex": 18953,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 27, 2012 09:23PM skimommi wrote: I posted here early on in the month, but then got caught up in the craziness of doc appointments and trying to figure out my treatment plan.  Looks like I am a December girl too, but you all have way too much fun here so I will continue to follow you all.   I went for a second MO opinion and will begin 6 rounds of TAC beginning on the 13th.  Like a few others on here, I could have started already, but that would have put me at doing round #2 on the 20th, and sick for Christmas.  Bad enough I will be going for cocktail hour on Valentine's day, and my b-day is the next day.  I'm curious . . . has anyone started loosing eyelashes/brows? Anyone using the Brian Joseph cream and think it may be helping? May be a little early yet to know I guess.  Also maybe too early to see changes in your nails? I just bought a uv light and gel polish and will try doing that to save my nails.  I read someone on another post suggest that. L421, I am totally with you on people's comments.  The hardest thing for us all is that people on the outside can be sympathetic all they want . . . but they will never really \"get it\".  This isn't something that goes away after the chemo and when our hair grows back. I'm tired of everyone telling me how strong I am and that I look great.  I just want to say \"Well give it about a month\".   LOL For those doing the mouth rinse of baking soda and water, are you also adding salt? I've seen suggestions for doing just the soda/water thing, and others suggesting soda/water/salt. And, are you using filtered water, or that right out of the tap? And just a tip.  Anyone interested in a free head wrap, check out goodwishesscarves.org. Here is another goodie, check out cleaningforareason.org. In certain areas they offer free house cleaning services. There wasn't a maid service in my area, but one company that works with them has come to clean my carpets for free.  Can't get any better than that when you feel sick and can't clean your house.",
      "MessageIndex": 699,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 27, 2012 09:45PM skimommi wrote: Txjunebug will your wig be short too? Just wondering if you, and others, did the short cut to prep and will also wear a short wig.  Anyone keeping with long wig? I had longish hair, cut it to shoulder length before BMX. You have all made the decision to shave easier, although I won't do it too primitive. I had thought about doing a pixie cut to prep myself and others.  But, if I wear a shoulder length wig there may not be a need . . . except for my own emotional messatude. ",
      "MessageIndex": 702,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 08:56AM skimommi wrote: Sounds like the steroids are giving you gals a lot of energy.  What is the purpose of those? I wondered about the red meat thing, in order to increase iron deficiency.  But, are you afraid that with SE's it will make you hate red meat - or anything else you love and eat during treatment? Hope you all get some rest today! If this stuff is keeping you up at night, not sure how I will survive being up and trying to go to work.",
      "MessageIndex": 722,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 07:55PM skimommi wrote: macyhen111 so sorry to hear you have this additional worry in addition to everything! Positive thoughts are being sent your way. txjunebug it must be so deflating to be at this point and now have to face yet another hurdle. Here I am being the person I hate most and about to tell you the BMX isn't that bad, except I have actually been there while most of those people we hate haven't.  I've been a 'D' since I was in my early 20's and probably pretty vain. But the surgery didn't bother me. I actually had more of a melt down over the port surgery. Think that was only because it made chemo all the more real. sickofpink I am so sick of people saying how brave and strong I am too! Really, what choice do we have? They don't know what else to say, so we must just accept. Good intentions are meant.",
      "MessageIndex": 738,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 10, 2012 11:34PM skimommi wrote: Eleni hear you loud an clear, and thanks for brining the subject up. After surgery sex just wasn't going to happen with the limit on the arm range/movement. If it took all I had to even roll out of bed how could we even think about getting busy? Ha  Then felt better and had the port put in, so another set back. Tried once. I cried and laughed the whole time. Cried because it just wasn't working well and all I could think was how he would ever be able to live with someone that couldn't meet his needs. But some of it was funny too. Guess a lot of pent-up emotions came out at once. macyhen111 so sorry to hear that you now have this new worry. Gee girls, I'm more worried than ever about chemo brain. Just with everything else that is going on I seriously am forgetting things, mistyping words and loosing thoughts unlike ever before. I'm sure this has been covered through the posts, but would like to hear a quick review from those on dose dense versus every 3 weeks. I was suppose to start 6 rounds of TAC this week. Which is interesting enough as I don't think anyone else is doing the tri-cocktail regimen.  Semms like everyone else is staggering the AC and then T. But I've had 2 MO's recommend the same thing so that isn't much of a worry. However, I just want to be through all this. So, the option I do have is dose dense which will be 4-by-4 every 2 weeks (I think AC and then T), or stay with the 3 by 6. I'm just thinking I can still be on track to be done by the end of march if I go dose dense.",
      "MessageIndex": 1049,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 27, 2012 09:40PM skimommi wrote: Oh, and Tlym thanks for the earlier post with the poem.  I love that! And just when I needed it most. My husband is adamant about needing to not miss more time from work and so won't be going to chemo treatments with me.  Instead I have a girlfriend that has insisted on going to every treatment. I was a little put out thinking that he wasn't showing support, and not that I want him sitting there for half a day with me bored.  But the point is that he should WANT to be there.   Geez, that sounds like a line out of a sitcom. politicomama, our dx is similar, although I had the full BMX.  My mom was dx at 35 with BC, had BMX, chemo, rads and then mets which eventually took her from us.  I too am BRCA neg. Sorry for all the additional questions, but for those with expanders I'm just curious if you had them filled to the full potential before chemo. I'm not quite there and wonder whether I should have them completed now. I don't know whether it is necessary or not, as my PS sais I could wait.  But, I don't want my tissue/muscle to not accept bigger squishies when the time comes. We will have to take down one side for rads after chemo.  I have an appt with the PS Thurs. I guess I can see what he says, but I didn't want to take more time off work to go there if I don't need to.  I've had to miss so much work between surgery and all the appointments.  And my boss just keeps laying on the work and increased responsibilities as though nothing is going on.  Ugh! I know that FMLA will protect my job to an extent.  But I'm afraid that if I lay it all down and tell her I can't take on more because of what is going on that it can backfire on me and turn out to be that my performance is an issue.  I think they can fire you for those grounds regardless of what is going on health wise.  Not that she is vendictive, I'm just saying. I shouldn't stay away for so long.  Looks like I really needed to vent. ",
      "MessageIndex": 701,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 5, 2012 10:50PM skimommi wrote: banksy I have an arm port. My surgery was at a different location than my current MO, and MO stated they prefer the chest port. Not sure why. My surgeon stated the same as yours . . . don't want more scars on the chest than needed. I have extenders, not immediate recon, so maybe that has some to do with it. Once in a while it is bothersome when I'm carrying my purse . . . kinda knocks it.  But otherwise, probably wouldn't even know it was there now. Doesn't bother me at all when walking, so I would suspect the same with running.  Would just suggest you wear sleeves as to avoid having the skin get irritated. One week and counting to C-day. And of course, today I get a fever and feel like crap. Timing sucks! My last good week/end and I'm going into it sick. Also have odd little water blisters showing up on my chest, arm, shoulder, and face the past couple of days. I don't know if that is related or has anything to do with the lymph removal. Anyone experience anything like that? Called MO and they just said to see my PCP tomorrow.  Ladies with tummy yucks here is a tip that was shared with me. My co-workers brother is fighting a very rare, unidentifiable cancer. Long story short, he had a lot of vomiting. The triage nurse told them to place his feet in warm water - think maybe like 30 minutes, but maybe not that long - and then cover the feet.  That took care of his vomiting. Although I haven't read anyone having much of the serious issue and more just tummy ick's, it still might be worth a try. Anyone doing acupuncture for SE's?",
      "MessageIndex": 929,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 9, 2012 09:24PM skimommi wrote: ckolendar - I am so glad you mentioned the gel nails. I think I will try that route. Sounds to me like cold caps only make for a more uncomfortable juicing session.  :) txjunebug and pbrain - do we work for the same lady? LOL  Only my boss can't relate because she has never had any health issues, has a neverending supply of leave time built up because she has worked for the same company for 30 years, has no kids and both of her parents are still alive and healthy.  Heck, her husband had an infection and she dropped him off for outpatient surgery in order to come to work for a while, and then picked him up - rather than staying with him.  She is very nice, don't get me wrong, can be somewhat sympathetic, but still thinks none of this should interfere with work. Can you believe she was surprised that I didn't log in and check e-mail while I was recovering from BMX?!?! I was only off for three weeks as it is. She thought it would be a good distraction.  Ha! I've got plenty to distract me, between trying to coordinate doc appts and researching what the he!! to expect from all of this. I am planning to work through chemo, taking long weekends following treatments and teleworking a couple days a week between.  I'm just worried about all the germs.  I might not begin chemo until December, as I am seeking a second opinion and can't get that appt until the 20th. Hope to know more by then as all of these follow-ups and waiting is killing me. I thought I would have started already, but we waiting for Onco testing.  That ended up a deadend - and only by a percentage.  I was 26 and you have to be 25 or less. Good thoughts with you all on your upcoming treatments!!",
      "MessageIndex": 187,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 11, 2012 11:25AM skimommi wrote: Traii - I have read on other discussion boards, one lady that used gel nails to save her nails. It is not the fake nails, but a heavier polish that is dried under a uv light.  She said she had one crack, but otherwise didn't experience any other problems. I am going to try that, because I just can't imagine having my hands and feet cold during the juicing session that will already be enough for one day. Ladies, I think it was mentioned from someone in an earlier post, but I've also read alot about using Biotene mouth wash for mouth sores.  Just another option.  And also when using aloe vera, buy a real plant. I know it is easier said than done, but chins up!",
      "MessageIndex": 205,
      "PostDate": "11/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 07:41PM skimommi wrote: elimar, my first MO did the oncotype test. One has to be at a 25 or less in order to be eligible for the randomized selection of not taking chemo.  I was a 26. Crap!! Well, I have to admit a little relieved at the same time though.  I was super worried that if they said the Onco showed I possibly could get out of chemo I would always be looking over my shoulder at the shadows to follow.  ;) Same reason I opted for BMX rather than just the one side that had the tumor. Don't think I could live with making that decision of not taking the chemo on my own. FriendGwen, I am so discouraged right now with exercising! I was in great shape, but then came the BMX.  Was finally able to get back to doing a good 2 mile walk and then had the port placed.  Ugh!! Now I am feeling like I can get back into some cycling, but only have two weeks to get my motivation built back up. I like the idea of a PT to help stay on course though. It has been suggested that I not start with strength training until my range of motion is back. Double Ugh!! Have to say I am envious of you gals doing only TC and not the A. I was hoping to do a clinical trial to avoid the A, but the MO didn't have the trial open. She was adamant that standard of care for me was the tri-cocktail.",
      "MessageIndex": 74,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 11, 2012 08:57PM skimommi wrote: Here is to everyone that can use a little cheering up today . . . ",
      "MessageIndex": 221,
      "PostDate": "11/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 08:09PM skimommi wrote: Oh, and anyone else \"Sick of Pin\".  This doesn't apply to you sickofpink.  Hahaha I think we get the picutre.  Why does everyone insist that each and every gift they give me must be pink?!? I didn't like pink to begin with. I am well known for wearing high heels to work - it is kind of a thing at work now.  So my boss, bless her heart, game me a cute high-heel shoe tape dispenser . . . . but it's PINK. Rant over!",
      "MessageIndex": 740,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 8, 2013 07:39AM skimommi wrote: I just had chemo yesterday, so the days begin now wondering where my taste will be at. I think all day long about what I may want to eat, and also in fear of ruining my taste to whatever it is that I induldge in. I find the following day not to be extremely bad. But after my last round of chemo my neighbor brought over his infamous homemade macaroni and cheese. You haven't had mac n cheese until you've tried his dish.  Anyway, my tastes were already starting to get that bad reaction. I dove in, ate too much, and regret it of course because now I can't face another bowl of mnc. Should have know better though. I just hate this constant burden hanging on me each day as I think long and hard about what I want to eat and what I should eat.  Ugh! I could stick to my protein shakes, but also fear I'll be ruined to those if that is all I have.",
      "MessageIndex": 1,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/801545",
      "Title": "So . . . what's for dinner? skimommi skimommi"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "skimommi wrote: With so many issues circulating around chemo and food I thought it would be fund to start a new thread and bounce ideas around.  Whether you are dealing with nausea and trying to subside that, bad tastes and finding foods that work, the lack of appetite, or like mine the lack to control eating too much. So ladies - men if we gain some - post away. What are some of your tricks, or what share some great recipe ideas. Melissa \"If God brings you to it, He will bring you through it.\" Dx 9/2012, IDC, Stage IIB, Grade 2, 1/11 nodes, ER+/PR+, HER2- Surgery 10/12/2012 Lymph node removal: Left, Underarm/Axillary; Mastectomy: Left; Prophylactic mastectomy: Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Chemotherapy 1/3/2013 Adriamycin (doxorubicin), Cytoxan (cyclophosphamide), Taxotere (docetaxel) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/801545",
      "Title": "So . . . what's for dinner? skimommi skimommi"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 04:27AM skimommi wrote: Hello my fellow warriors! I will start 6 rounds of TAC on the 13th. My port was installed a couple of weeks ago.  The doc just took off the bandage strips yesterday, and now I am seeing some small bumps on the port site.  Not sure if that is part of the machinery and I'm just now noticing or if I am beginning to breakout.  I have noticed it was a little itchy today.  Good gosh almighty I hope I'm just being paranoid.  Anyone doing any integrative methods with treatments? My onc suggested acupuncture. I'm hoping to keep up exercising (or should I say start back up).  I was finally getting into solid shape and feeling good before surgery, then started walking again until the port was placed.  Now I feel like I am starting over all over again, and can't help but think I would have been so much better off to face chemo pre-surgery. jenjenl I was in your shoes following surgery.  Thought I'd jump right into chemo, but had to wait for the oncotype results, which came back at 26.  Have to be 25 or lower to not do chemo.  That was a blow, but also somewhat of a relief because I just kept thinking \"what if I don't have to do chemo . . . but should\". That decision was pretty much made for me.  The one I'm struggling with is radiation. Then I decided to get a second opinion and had to wait another 2 weeks to see that doc.  But, here I am and all scheduled out to the last cocktail hour on 3/28/2013.",
      "MessageIndex": 52,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 7, 2012 08:39PM skimommi wrote: Well, I was suppose to start chemo next Thursday.  Been spending days and nights reading posts, reading books, looking at nutritional guides and researching what to expect.  Then out of nowhere I breakout in chickenpox.  WTF?!?!? I would have been prepared for and expected this to happen during chemo maybe, but NOW?? Now not only am I having to use more leave time from work that I don't have and will need for chemo, but my chemo will be delayed a few weeks. Life is really trying to tell me something this year - and I am standing up and taking notice. Ok, maybe lying here taking notice becuase I have no energy.  Just itch all over. ",
      "MessageIndex": 200,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 9, 2012 05:58PM skimommi wrote: steiner18 I had my time mapped out too with what I \"expected\" to take off work with SE from chemo. Expected when the time would run out and pay without leave would start. Luckily I can work from home with the pox so I hope not to take any more leave. Isn't it awful having to worry about being short on leave and pay during all of this? We should be able to just concentrate on getting better.   Funny how some of the tips in the chemo threads have helped me this week. Mouth rinses for mouth sores, baby wipes for \"issues\" downunder, and foods to eat when you just don't have an appetite. Boy if I am not ready for treatment now I never would have been. Thinking I may not be able to stand a wig. Even when everything scars over. From what I hear about the wigs being so uncomfortable I don't think I can take the discomfort now.  Ugh!! This is the worst year ever for us ladies! I'm getting on line and booking my summer vacation to Florida now!! We all deserve something great to look forward to next year.",
      "MessageIndex": 223,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 11, 2012 05:08AM skimommi wrote: Mfml that is a great story ... What a laugh. To address your ? about the every2 week treatment versus 3, I actually had a choice. There are so many different treatments and timing. I could take dose dense which would be 4 treatments of AC every 2 week's followed by 4 of T. But I opted for TAC every three weeks. Thought that would give me more time to recoup between treatments. I haven't seen anyone else doing the tri-cocktail af TAC. Anyone else on this plan? Seems like everyone has the cocktail split.",
      "MessageIndex": 265,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 24, 2012 12:23PM skimommi wrote: Paula I watched a video on Youtube about tying head scarves. You can buy fabric at a fabric store and don't even have to sew it. Just look up how to tie a turban. The fabric should be rectangular and large. The ladies of color make these look so awesome. I'm a simple white girl, but hope I can pull it off too.  I love that you ladies are setting a goal to run a 5k. I will run the KissMeDirty again this year. The proceeds to towards gynecological cancer research. If you have that or the Dirty Girl Mud Run (Godirtygirl.com) in your area I highly recommend either one. And the Dirty Girl benefits the National Breast Cancer Foundation. So much fun and adds just a little more to your typical 5k. My last chemo day is April 18th, so my goal for anything extrenuous will be out a little further. There is a 60 bike ride that I've wanted to do for years and told a friend of mine that I will aim for doing that in June. DH bought me a road bike for Christmas, so it is the perfect thing to work towards. Judaday does the glue from the eyelashes bother you? I contemplated that route, but read that the glue on the already sensitive skin was too much to bear. Has anyone bothered with the eyebrow stenciles? Similar to the fake lashes, just glue and go. I was worried how it would look. Jenjenl are you taking the tri-cocktail (A, C and T all together)? That will be my regime as well. While the MO said there is much difference between that and doing dose dense, where you have AC followed by T, I'm so worried that hitting hard with all three will be more than I can bear.",
      "MessageIndex": 581,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 28, 2012 11:41AM skimommi wrote: Thanks elimar! I thought that may be the case, as it doesn't really look rashy.  Just odd.",
      "MessageIndex": 65,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 29, 2012 08:05PM skimommi wrote: What do you think people's reactions would be if I showed up to chemo wearing a wonder women outfit?  Just saw a pic of a women skiing in one of these.  Would definetly make for a different atmosphere . . . don't you think? Ok, that really isn't me, but it sure was a funny thought for a minute.",
      "MessageIndex": 86,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 11, 2012 04:20PM skimommi wrote: Dawn1008 I haven't started treatment yet. Was suppose to start this Thursday, but am delayed because I came down with chickenpox.  Un-effing believable! Everything is so out of control right now I'm starting to think maybe the Mayan's were onto something . . . is this all leading up to the end in a couple weeks? LOL",
      "MessageIndex": 271,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 21, 2012 12:29PM skimommi wrote: That also brings up another great discussion. Is anyone continuing to use their regular face wash these days? Or have you had to go gentle? I've always used expensive products, buy wonder if I can continue.",
      "MessageIndex": 529,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 28, 2012 05:15AM skimommi wrote: Dwihtd and mfml, I have been looking for something form fitting to wear under scarves and hats as well. Try looking at Headsweats.com. These are typically for cycling wear, but should work just as well under scarves. I am going to give it a try. It seems that everything else out there has too much material, like the turbans you mentioned, and not as form fitting to simply act as \"traction control\". LOL  Let me know if you ladies find a good solution.",
      "MessageIndex": 705,
      "PostDate": "28/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 6, 2012 11:27PM skimommi wrote: Hi Ladies! Just joined the site, as I was looking for resources and support concerning all aspects of BC treatment. I will meet with the Onco next week to schedule chemo - 6 rounds of either TC or TAC, although I've seen others refer to that as AC-T rather.  Hoping to learn and share with others going through the same.  Friends and family can provide support only to a point, as they can never even imagine what this is all like.  And txjunebug, I hear your frustration loud and clear.  My boss has the same demeanor.  I was in good shape and eating healthy pre-diagnosis. Now, post surgery, I am only walking maybe a mile a day and eating complete crap! I just can't seem to pull myself together to refocus on my health.  I am not quite 4 weeks post surgery, and just had drains removed last Thursday, so I haven't even begun arm exercises. Really worried that I'm going into chemo in this shape.  Is anyone looking at additional treatments while doing chemo, such as yoga, message, reiki? I've been spending a lot of time looking for these treatments to complement the chemo.  There are so many appointments to coordinate, and I work full-time, it is very distressing. Live Fiercely!",
      "MessageIndex": 91,
      "PostDate": "06/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 21, 2012 02:52AM skimommi wrote: sunflower71 thanks so much for the tips! Much needed.  I've really been wondering about what the heck to wash my head with when I start to loose.",
      "MessageIndex": 524,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Dec 30, 2012 05:03PM skimommi wrote: Paula, you are upside down to me and I'm on a laptop.  Thought it was on purpose and I think it is kinda fun.   kiwikid your pic is right side up for me, so the ipad upload doesn't seem to be the link.  Isn't that strange?",
      "MessageIndex": 768,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Nov 29, 2012 07:59PM skimommi wrote: I too can see the port.  Looks like the biggest misquito bite ever.  Mine though is on my arm.  So, luckily with sporting long sleeves through winter it won't be noticable.  If I have short sleeves on and raise my arms it is very noticeable.  Finally comfortable that the tiny bumps are suppose to be there. steiner18 are you sore after the expansions? Two weeks ago I was so sore I could've cried.  Today they did another 80cc and am starting to feel sore, but nowhere near last time. Last fill next week until I'm done with chemo. Then we have to over-expand the rad side and deflate the other until rads are over. Made an appointment for a wig fitting next weekend. Girls, this is our opportunity to rock some new looks, experiment and try the new styles we didnt' want to risk before. There is no choice at this point.  If we must lose it then let's abuse it instead of it abusing us!  Think I will get one wig to match current cut/style, then I am cutting my hair pixie-like so the fallout isn't so tramatic . . . then comes the buzz. One of my bff's is buzzing with me. Just haven't decided whether we do it ourselves or have the hair dresser do it.  At that point does it matter much?",
      "MessageIndex": 85,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "skimommi",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163908/profile",
      "Content": "Mar 9, 2013 12:16AM skimommi wrote: Oliverhog it is a little bit about the association of time. I've found that anything I eat during treatment is ruined to me. Then the bad taste thing starts. It alters the way many things taste. Even once it subsides there are just something I can't stand the taste or - or maybe the lack of taste and/or sensation on my tongue. I love cheese, typically, but can't stand it these days. Same with salad - ick! There are some sweet things, certain fruits, that taste awful too. But then other sweets are delish! I'm loving the Famous Amos chocolate chip cookies and Girl Scouts thin mints. Tomorrow, which is day two usually starts the worst part of it. If I indulge in something that actually tastes good, and then over do it in the least, I won't be able to stomach it any longer. Luckily I haven't suffered from much naseau either.",
      "MessageIndex": 4,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/801545",
      "Title": "So . . . what's for dinner? skimommi skimommi"
    }
  ]
}