{
  "AuthorID": "skkydiamond…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
  "Posts": [
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Feb 14, 2011 12:55PM skkydiamond wrote: having BMX and reconstruction on 2/22.  i was told I may be able to leave the same day, although I and everyone else in my family are convinced I might be in a day or two.  I am happy to find this group so we can go through it together! Heather",
      "MessageIndex": 148,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Mar 14, 2011 12:51PM skkydiamond wrote: I was out walking with my pugs today, they wernt pulling on their leashes at all, seems like they know to give me a break.... My drains will come out tuesday, three weeks from surgery.  i am glad for that. Renannsus-  do you have any expectation when you will be able to do upper bosy stuff?  Like after the implants are in?  I ask because i am going to join a dragon boat crew of all BC survivors, and rowing is involved.",
      "MessageIndex": 391,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Mar 9, 2011 11:14AM skkydiamond wrote: Hi ladies, I'm two weeks post MX and reconstruction,  still have my drains in, mysurgeon only wanted to have one per side instead of two which reduced the areas for possible infection.  i was hoping to get them out by the end of the week, but it may be early next week.  I haven't felt like driving, or much of anything, although I manage to only take the Percocet at night to help me sleep, but I'm still up half the night anyways.  I'm sleeping well enough on the couch propped up on pillows, very squishy comfortable pillows.   These tissue expanders take some getting used too, my husband is off from work and able to take me to doctors offices and go graocery shipping.  He's always been a saint because he cooks, and I lack the skill, so I get to be well fed!.  I decided last week that I wanted to go bigger, so I am hoping the the filling will start on the 18th at my next appointment.  I actually came out of surgery with something, which surprised me, and delighted me, to not have to adjust what I thought of myself.  my husband and I both think that the scars aren't that bad, and he still finds me attractve (minus the drains).  Advil or ibuprofen have helped me the most with the surgery pain, I still have fibromyalgia to deal with, so I have to take some of my regular pain meds like tramadol, and muscle relaxers from time to time.  And neuropathy left over from chemotherapy. On other good news, my eyelashes and eyebvrows are returning, slowly but surely!",
      "MessageIndex": 360,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Mar 9, 2011 10:27PM skkydiamond wrote: Im so frustrated, i just di my P.M. measuring of my drains, my right side, which was the cancer breast, with more breast tissue taken out is within 30 cc or less to be able to take the darn thing out.  The left side, the prophlactic masectomy, in which more tissue was left over is still outputting 45cc.  I guess its next week, Tuesday, when the PS is in the office.  Crossing my fingers that that's the day, 3 weeks post op.  But I have to cut myself a break, I knew I wouldnt recover as fast as I would like.  its hard to take it easy once you feel normal. Hollyin Mich-  I also have some nasty nerve pain in my upper right arm, as well as some numbness in some positions, it is so sore to the touch, especially my tricep muscle.  I had four lymph nodes removed on the right side.  Are these two things related? Thank God for pajamas, there the only things that feel soft and comforting right now.",
      "MessageIndex": 371,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Mar 19, 2011 01:53PM skkydiamond wrote: Today I had my first fill, 30cc.  With everything healing so well, I asked to start the fill up process.  I go back next week for 60 cc.  They said I would feel pressure, and I did, but it wasn't bad.  They use a magnet and a small needle, Which I barely felt after being stuck so many times for blood work, chemo, and surgery,  and put in the fluid.  They said no pain, and I felt some pain, but then again, I have fibromyalgia too, so that's not surprising. So I took some Advil for that, and I was ok. As far as my activity restrictions, I can vaccuum a little, but not the whole house ( does anyone want to go back to that?) Anything with repitition is still out, things like car washing and window washing, probably raking.  But I can try things out and see what I tolerate.  I should be able to join training camp for The Dragon Dream Team, a local Ohio all breast cancer survivor dragon boat team on April 30.   This is exciting for me as ihave wanted to be active more since before my treatment started but had no idea what the best exercise was for me except to walk. I could never find an activity that kept me motivated to keep exercising! Ok, turning off the light, watching some t.v. and eventually i will try to sleep!  goodnight, ladies!",
      "MessageIndex": 402,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Feb 26, 2011 12:05AM skkydiamond wrote: We'll ladies, I'm 3 days post op, and my biggest complaint is that my back aches all the time.  Sore muscles in the shoulders and back, along with trigger points are all active and sore from improper support in the hospital and  the surgery aggravated my fibromyalgia.  I spent a day in the hospital, which the first 24 hours I just layed there, I was glad I had the catheter, so I didn't have to figure out how to get up until the next day.  Not much sleep, a little more each night, naps happen during the day. I don't think being in the hospital was better for pain management, contrary to what I thought before sugery!  If the nurses could have given me regular medication at regular intervals while there, but they didn't.  I was hungry right away, and have been glad to have an appetite with the medicine.  Taking an antibiotic as well. Had nipple sparing reconstruction with tissue expanders, hope the cancer side nipple survives intact, and my ONC took as much tissue as possible.  The other annoying part is the drains pull from time to time and are a nuisance, but emptying them and recording the fluid is not as bad as I thought.   The best thing is I was told no bra, and my drains are on a very comfortable velcro belt.   i made them find one at the hospital after they mentioned it.  keep on them for one if you want one, they do exist! I can keep the drains velcroed near my belly button so I can at least lay on my back and sleep sporadically without discomfort.  I am able to manage my pain better at home because  I didn't have to wait for a nurse to get meds.  At first, I was using the Percocet, along with Dilaudid for some leftover neuropathy from chemo in the hands and feet, but then I switched to Advil for the muscle pain, with the Dilaudid.  Tha's what the doc recommended, with the tissue expanders.   It really works!!!  So I feel really good, have help, including my mother in law, mother and husband.... but my mother in law is making it difficult.  She is supposed to be her to help with anything I need and the cleaning and cooking and stuff as my mom has to go back to work soon, and my husband is preparing his new business, but it appears she has no interest or intiative.  She just won't do it if it isn't like she does it at her house, which is the hard way.  or unless we can all praise her for doining it.  dont get me worng, she's a nice person, but if shes here to help, why is she on the couch with me? I brought her here even though my husband would prefer his mother not to be here (me too!), to give my husband a break.  He is starting his own business in the next month, and he needed to be able to make appointments and work with his new partner.  So far its not working that way.  Do I have to direct her?  I thought she would see things around the house and just do them. We'll time to rest again, will try to keep up with you gals over the next few days and weeks. Heather  Ugh... So far, my back must have been messed up from surgery and being stuck in that bed and not being able to move.  my surgery went well, and my sentinel node showed no cancer cells, so I finally am relieved to say that I am cancer free!  I forgot to call my oncologust today for the final pathology, but they told me they had a hard time finding the cancer on my right side, so that was good news.",
      "MessageIndex": 272,
      "PostDate": "26/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "skkydiamond…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105648/profile",
      "Content": "Dec 7, 2010 11:13PM skkydiamond wrote: Will like to hear your progress will be having bi lateral masectomy and reconstruction in late February, early March.  Good Luck!",
      "MessageIndex": 1,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}