{
  "AuthorID": "SleeplessIn…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
  "Posts": [
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 23, 2012 08:50AM SleeplessIn wrote: Happy Monday everyone!!!  Judy 67, Can you please elaborate a bit (in terms of dose) on the L-carnosine you are going to take. I love food, and the thought of potentially losing my sense of taste long-term scares me. NancyHB, I don't understand why your insurance company would deny to pay for the genetic testing. From a logical point, shouldn't it be exactly a \"case\" like yours, where there isnt an obvious family history, where testing should be covered?! Jenn28, Good for you, that it wasn't your memory, but the bank's fault.;-) I wasn't as lucky filling out an onlline order yesterday, I could not remember the last 2 (of 4) digits in my address. Total brain freeze and very scary. Janetanned, Hats off to you for not taking a leave from school. I have stopped volunteering in my older son's classroom, and have been keeping my younger son home from preschool since just before my surgery in December, because I am so scared of catching another bug. I cought the last one my son brought home from preschool, and it took me 3 weeks to recover, plus I also had to postpone my surgery. - I hate having to live like a hermit, and especially for depriving my children of some of their regular interactions, but I decided I can be selfish for once in my life, and to do what is best for me (although feeling guilty about it). Wishing all a good week, with few, if any, side effects and tears!!!",
      "MessageIndex": 710,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 5, 2012 08:31PM - edited Feb 5, 2012 08:46PM by SleeplessIn HI Madeline, Sorry to hear you are having such bad side effects. Like you, I also started AC on Jan. 13 (except dose-dense, every other week). - The first treatment was not all that bad for me, side effects were worst days 3 to 8 into it. Then on day 9-13 I was feeling almost \"normal\" again. The first time around I had eaten greek yogurt every day, which is supposed to fight candida/thrush, so I did not get any. After my second treatment I did not eat yogurt, and sure enough, I got thrush. But again, ate yogurt twice, and it was gone the next day. The one SE that is different this time is that my sense of taste is gone (still), today, day 9 after my 2nd treatment. :-( And I am cold a lot, which may have something to do with the fact that my head gets cold easily now that it's \"bold\", and my nose is constantly running (also probably just due to the fact that there is no nose hair to stop it). :-) FLDreamer, RachelVK, I have also had some sort of ear ache today. Wonder if it has to do with the fact that my long hair no longer covers my ears - and I spent an hour inside the freezing ice hockey rink, watching my kids today... kblack, This time around I have not bounced back as quickly as I did with the first treatment as well. Wonder how it's gonna be like after the upcoming third treatment....;-( My oldest son and I went wig shopping yesterday. After trying on what seemed like every wig in the store, I let him \"pick\" the wig that he thought suited me best (well, sort of), and then we went out for lunch afterwards. It was a \"fun\" outing, as weird as that may sound; may have also had a little something to do with the beautiful sunny day and blue sky. ;-) After getting home, my hubby shaved my head, which I had dreaded for so long. Weirdly, again, it felt really good to do it - afterwards anyway. No more dreading hair loss - it's gone! Such a relief! - I look in the mirror and see GI \"me\" - totally able and ready to start kicking cancer's butt!!! ",
      "MessageIndex": 1011,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 20, 2012 06:23PM SleeplessIn wrote: Denjak, Will be thinking about you tomorrow and sending you lots of positive thoughts. You are getting closer tonthe end of treatment.... You can almost see the finish line now. I know that's what I will tell yself on Friday, when my next tx is. Annie, Best wishes for you tomorrow as well!!! Don't be scared - remember why you are doing this, but also remember that many, if not most, people's SE are very tolerable!!! Moreover, the onset of SE is not until at least 2 or 3 days afterwards, so you should definitely be ok for your reading the day after dx!!! Kristin, I took Ativan (a few times) for nausea while I was on AC, and that was all I needed (for nausea, anyway). Nancy, Well said, \"my biggest fear in the world is mets, so I like to think that all this sh*t right now may be taking care of or curing something I don't know exists!\" - I soooo second that! :-)",
      "MessageIndex": 1746,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 2, 2012 02:05PM SleeplessIn wrote: Congrats to all who already finished chemo, and positive thoughts and well wishes for all who have a few more treatments to go!! There is light at the end of the tunnel. Keep looking, and you'll see it!!! ;-) Momof2inME:: You are getting there. You'll be done before you know it!!! Jen, No, Taxol is NOT a breeze. Not for me, and not for many of us, it seems!!! - If pain persists, can you not take any more time off work if need be, or at the very least work from home? - I hope you (and your hubby) will be feeling better soon. Bela, hang in there!   Well. I had my final Taxol tx last Wednesday, and I am glad I stuck it out - when I was very close to quitting chemo after the debilitating first two dd Taxols. At the time my MO wanted to switch me to weekly infusions (saying that was going to be easier on my body - yeah right?!), after the pain meds barely worked for me. I refused. Luckily, SE after infusion 3 were much less severe than after the first two, and SE after number 4 even less so than after number 3. My white blood count has come back to normal range (7.3) for the last three weeks, up from only 3.3.-3.4 during AC and Taxol 1&2. - So for the last infusion I told the nurse I did not want the Neulasta shot. That ticked her off a bit, but I really didnt care much about being extra polite at that point! She said that she needed to double check with my Oncologist, and the MO was o.k. with it. - As a result, I am sooo glad to experience \"recovery\" without that darn shot. I'm one week out today, and what a difference it has made!!! I had 7 Neulasta shots over the past months, and this last infusion without the Neulasta has been the by far \"easiest\" in terms of bone pain. Yay!!! Finally. Now I am ready to move on with my life. Well, soon.... :-)  I have a ton of appointments in the next two weeks to figure out what kind of follow up treatment (if any) I will be doing. I'll have to weigh the risks with the benefits as best for ME, something that my \"wonderful\" and well respected MO doesn't really seem to understand or care about.  Has anyone else opted out of, or thinking about doing so, any additional treatment after chemo? Just wondering....  Gentle Hugs to all!!! ",
      "MessageIndex": 2103,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 14, 2012 01:05PM - edited May 14, 2012 01:08PM by SleeplessIn Peggy and Jennifer, Wishing you a Happy Belated Birthday, and good health for many, many years to come!! I couldnt agree more with what Nancy and Jennifer said, it sure seems like cancer is so much more prevalent these days then it used to be. Like you, growing up, I also do not recall knowing any (not one!!!) person who had cancer and /or died of cancer. Nor does my mother! Other than maybe due to a car accident, everyone in my family and my mom's circle of friends died from \"old age\". Despite the fact that everyone smoked and drank a lot more alcohol in the 60s and 70s. Not so these days. My children had several friends' moms die of breast cancer just these past two years. One lady's children were 6 (twins) years old at the time, the other lady's children were 5 and 9. One of my DH cousins was recently diagnosed with bc at age 29, and another one with uterine cancer at age 25. It is not \"normal\" for all these young women (and men) to get these cancers. It just isnt. As in regard to follow up care, Nancy, I feel the same way. While I am really tired of seeing doctors, it's also extremely scary to me to not get regular follow-up screenings. What adds to it is that I have not been pronounced NED after surgery and chemo, which REALLY bugs me. But on the other hand, I have not had any scans (ordered by my \"cancer treatment team\") since before surgery last year. Even if I had mets, they wouldn't know, because scans are not part of the \"standard protocol\" for someone with my pathology?! - And even with all the pain I have been experiencing over the past few months, they \"put it off\" to chemo SE; Some \" normal\", some \"rare\". End of story. I am very disheartened with the medical industry right now, particularly with my treatment at this\" top rated facility\". - Sorry for the ranting, just having one of those non-pms \"PMS\" days today!!! ;-) Hugs to all, especially Pc-barbie!!!",
      "MessageIndex": 2176,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 21, 2012 08:03PM SleeplessIn wrote: Hello ladies! Have been reading all your posts for a while now. A few days before my first chemo (Fri, the 13th) I wrote a long post myself, just before my computer power went out. Of course all my typing was gone when the power came back. Oh well. :-) So here I go again. I am scheduled for a total of 4 x AC (every other week), followerd by 4 x Taxol (every other week) right now. The Taxol part may be changed to weekly, I will have to see. I had gotten a second opinion (from an naturopathic oncologigist), and he suggested weekly EC instead of AC, followed by weekly Taxol. So now I am waiting to hear back from my regular oncologist as to what she thinks about that, or why she would want me to stay on this path.. I am 8 days out from my first dose of AC and feel ok for the most part. - The infusion itself was not uncomfortable at all. My port was numbed with a Licadene shot when they did bloodwork in the morning, so there were no issues. Later, when I got home from the infusion, I got really nauseous though, and actually even had to throw up. - I'm thinking maybe that was from the Neulasta? I noticed that most of you get the Neulasta shot on a different day. I wonder why? Mine are scheduled on infusion day, after I am done with everything else. Hm. Since treatment 1 I have only taken 2 of the pills that are supposed to help with side effects. I also followed the advice of some people on the board here, and rinsed my mouth with salt/baking soda - water combo several times a day the first few days afterwards, and have been wearing \"sea bands\" on my wrist. My naturopath suggested accupuncture, but I do not need it for now. I just don't want to add one more \"to do\" things to my list. I try to drink tea (ginger, peppermint and green tea), sometimes also Gatorade, as much as possible, but I just don't feel like I want to ingest anything most of the time. My son was eating a snack of roasted seaweed the other day, and the smell of it made me gag the same way the pure thought of eating the chocolate cookies I was eating during infusion made me gag. Haven't lost more hair than usual so far (60-100 hairs/day is considered normal), but also have not washed it (I know, kinda gross), because I want to hold on to it as long as I can. Some day soon, I told my kids that they can cut my hair short. Hoping that will take some of the scariness out of it for them (and for me). And then I'm planning on having my husband shave my head while thee kids are watching. I have an appointment for a wig-fitting next Friday (before chemo #2), and they told me it would be better to have no hair left for that. :-) Thank you all for sharing your stories, kind words, advice and support for everyone here. It means the world to me to know that I am not ALONE going through this.",
      "MessageIndex": 669,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 7, 2012 11:04AM - edited Feb 7, 2012 11:09AM by SleeplessIn NancyHB/waitress169 In addition to taking something like Prilosec OTC / Zantac, you may also want to avoid eating too late in the evening (or before taking naps, if you do), and avoid spicy and, most importantly, acid-rich foods like tomatoes, pineapple, as well as acidic juices (OJ etc). My GE also recommended to always sleep propped up on multiple pillows, which seems to help a bit. - Hope you feel better soon. Wishing everyone who is having a treatment this week best of luck & few SE!",
      "MessageIndex": 1044,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 7, 2012 11:15AM SleeplessIn wrote: Judy67, Absolutely! We really do not have much of a choice, so the only way to look at it, is, as you said \"We will get there\"!!! Have you noticed that the supplements you are taking help? I hope so, and that SE, if you have any after this treatment, will be few and tolerable.",
      "MessageIndex": 1045,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 22, 2012 10:44PM SleeplessIn wrote: Grateful33, Ditto!!! SE after treatment 3 have been by far the worst and longest for me, starting on day 2 after treatment, all the way until day 11 yesterday. Definitely cumulative, too, so I can only hope and pray that #4 will not top what came after #3. - The worst was literally feeling like \"being eaten\" on the inside - lungs, heart, kidneys, and feeling totally weak and \"broken\". ;-( Curious to see what my bloodwork is going to be like on Friday, and if I \"can\" go ahead with treatment as planned and have my last AC then. Wishing everyone lots of strength to get through this!!!",
      "MessageIndex": 1378,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 15, 2012 09:10AM SleeplessIn wrote: Momof2inME, Same here. My tastebuds never came back after treatment 2, and so far, 5 days after treatment 3, everything tastes gross, like chewing on a handful of coins all day long. Don't feel like eating or drinking anything most the time. :-( Started taking the Zinc L Carnosine yeaterday, maybe that will help? - At least I was able to sleep last night, because the night before I could not sleep at all.",
      "MessageIndex": 1218,
      "PostDate": "15/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 23, 2012 03:19PM SleeplessIn wrote: Nancy, Did you look through your health insurance benefits? Many policies have an out-of pocket/copay maximum of a few thousand ($5000 often) per year. Once you reach that, everything after that will be covered at 100%. I reached my limit last year and my insurance ended up covering my OncoDX test at 100%, even though they had only covered 80% of my treatments prior. Keeping my fingers crossed that you will end up having a low out-of-pocket maximum and won't need to worry about payment issues on top of everything else!!!",
      "MessageIndex": 1402,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 23, 2012 03:31PM - edited Feb 23, 2012 04:24PM by SleeplessIn ",
      "MessageIndex": 1404,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 23, 2012 03:54PM SleeplessIn wrote: Shera, Janetanned and NancyHB did a great job explaining what I feel also. My bc journey was similar to Nancy's. The sentinal nodes they removed showed no cancer involvement, my tumor was stage 1, and I had clear margins. However, my OncoDX test result changed my treatment from \"only\" radiation, to chemo AND rads. Although my last chemo \"treatment\" has been horrible, the two treatments before were not too bad. But even after all the side effects I have to say that I am glad that I am doing this aggressive treatment after all - because I feel that I am throwing everything and the kitchen sink at this crappy disease. I feel that the more aggressive the treatment, the better the benefit will be - and the distant recurrance is lowered, and psychologically it lets me feel like I have done what could have been done. Thinking it will be \"worth\" all the SE in the end is helping me through the dark moments.... Best wishes, and good luck coming to a decision that will work for YOU!!!",
      "MessageIndex": 1406,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 18, 2012 02:25PM - edited Mar 18, 2012 02:28PM by SleeplessIn Nancy, Grateful, Jenn, Momof2. and everyone else having such horrible side effects... I am sooo sorry!!! Sending you gentle hugs and positive thoughts. I know exactly how you feel like. The first two days after my first Taxol (dd, 300 ml) I felt better than I had the entire month before on AC. My hand and foot syndrome was almost gone and I was actually able to function normal. Then, day 3 I started having excrutiating bone, joint, muscle pain from my head to my tows - and everything in between, plus pelvic cramps and a sore throat. It lasted for 3 days at a pain level 8-9. I took Oxycodone! and it didn't touch the pain at all. So I added 2 Aleve to the Oxucodone and that brought the pain down to a level 7 maybe. I cried, and cried.... Like someone else put it so well. The last time I had this kind of pain, I left the hospital with a baby! And labor pain did not last 3 days!!!! For me, The pain subsided somewhat on day 6 post tx, but I still have intermittent pain in lower back, knees, headaches.... I have also noticed significant Chemobrain (cant come ip with names for people and things), which I did not have on AC, and have gained 4 pounds in the 9 days since I got the Taxol. I am really, really dreading the next Tx of Taxol!!!! I wonder if the Neulasta, which I get the day of my Tx, is to blame for some of this hellish bone pain? PS: I am taking 20 Mg of Glutamine powder (10mg twice a day dissolved in water), and vitamins B6/12 and Claritin for 3 days after Tx.",
      "MessageIndex": 1711,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 31, 2012 07:11PM SleeplessIn wrote: CharB22, I am having a day just like you. Hazy, cloudy, nauseous, disgusting \"metal\" taste in my mouth... and watching my hair come out the way it does is not making things better. I chickened out shaving it off last weekend, hoping I could string along a bit longer. Yesterday, day 3 after AC #2, I woke up and had a bushel of hair in my hand. So I got the scissors and cut it just below the ear. - Then, last night, I woke up with a nightmare, thinking I lost all my hair at once on my pillow.... I can't believe I am being such a baby about losing my hair. When I was a teenager I would have done it on a dare at the drop of a hat.... :-) Gosh, I hate to whine, but I hope you gals understand. I don't want to \"unload\" on my kids, and hubby, because I don't want to worry them more then they already do. But it sure gets hard \"pretending\" everything is better than it is sometimes. :-(",
      "MessageIndex": 900,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Apr 26, 2012 03:08PM - edited Apr 26, 2012 09:04PM by SleeplessIn Nancy, Sorry for the insurance issues you are going through, and hope you can find some kind of mediator or ombudsman involved who can straighten out the Neulasta issue. It should not get billed as pharmaceutical if it is given to you by a nurse in the clinic, hence it should count towars your medical deductables, and max allowance. CharB22, Congrats on finishing up chemo today!!! Enjoy your happy dance today, you earned it!!! Jenn, Hope your hubby will be better soon. Hugs to everyone!!!",
      "MessageIndex": 2061,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 12, 2012 03:06PM - edited Feb 12, 2012 03:07PM by SleeplessIn Catwhispurrer, I am also getting the 4xDD Taxol after AC. I, too as wondering about the difference between the 4xDD I was \"prescribed\" versus the 12x weekly treatment. After looking for info and studies to support that either was \"better\" I couldn't really find anything, So I questioned my ONC at my appointment last Thursday. She is the head Onc at the Seattle cancer clinic I am being treated at (which is rated #5 in the country). She told me about a study that has not yet been published officially, but presented in San Antonio the year prior, and that the 4 x DD (bi-weekly)  was just as effective as the 12xweekly. Below is a study comparing 3 week Taxol and Taxotere with treatment every three weeks versus weekly. \"Overall, paclitaxel [Taxol] caused fewer side effects than docetaxel; however, peripheral neuropathy (grades 2, 3, and 4) was highest in the group treated with paclitaxel once a week.\" The report of this trial was published in the New England Journal of Medicine in April 2008. Publication: Sparano JA, Wang M, Martino S, Jones V, et al. Weekly paclitaxel in the adjuvant treatment of breast cancer. New England Journal of Medicine. 2008 Apr 17;358(16);1663-1671 Hope this helps. If you can find anything else, please let me know.",
      "MessageIndex": 1138,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jun 22, 2012 02:05PM SleeplessIn wrote: Congrats Peggy and Annie!!! On to a new chapter now.... :-) Jenn, like you, I have been having problems with my lungs (as well as ribs), and eyes (poor, blurry sight). Joints and bones hurt (especially the back, knee and hip bones), although I am glad to report that I finally had a bone scan, and it was ok!!! - You had asked about the \"window\" between the end of chemo and start of radiation, my RO (at a highly ranked university clinic) said they like to start within 8 weeks after end of chemo, however, their \"window\" is up to 12 weeks! I was 8 weeks out from chemo last Wednesday, and my team was thinking I may change my mind - which I am not. It took me a lot of agonizing to come to this conclusion, but after (too much?) reading a lot of studies and papers, and \"listening\" to my body, I know that I can Not do radiation. I will see my surgeon for my 6 month follow up soon, and am going to ask about possibly having a mastectomy instead. We will see. We all have to make and live with our choices, and it is not easy. I had a total of 8 eyebrows and 6 eyelashes after chemo, and now my brows are back almost completely and my eyelashes are also, almost 1/2 the length they were before.   Positive thoughts and hugs to all of you. I am so glad to have been part of this group on our shared journey during these past months. It made it all more bearable, albeit not \"easy\" per se. :-)",
      "MessageIndex": 2350,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 10, 2012 05:31PM SleeplessIn wrote: One more thing: I am hoping someone can help me de-stress about this, as I am really worried about one number on my recent blood test. - For those of you who have also had Neulasta shots, would you please share your IIMMATURE GRANULOCYTES numbers with me!!!",
      "MessageIndex": 1600,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 26, 2012 04:17PM SleeplessIn wrote: Hi all! Hope everyone was able to enjoy the weekend, at least a bit! Kitchenella, Wishing you a week with few side affects, so you can enjoy your daughters' visit!!! My last week was not all that great. I had a bad cold last week, so I could not do my scheduled tx last Friday. Bummer!!! Feeling better today, and so they rescheduled my biweekly Taxol for tomorrow. Yay - only 3 more to go!!! ;-) Something else I've had lately, problems swollowing correctly. Or rather, after I am done eating, I start coughing and coughing until I get dizzy. While I am coughing it feels like a tiny bit of food is moving into my lungs. A weird kind of food aspiration, that does not happen while I eat, but as soon as I am done eating?! - And one more thing I was gifted.... To add to the list of SE: Chemo acne!!! But that's ok, because - on a positive note -- the sun is out today, and that small fact really helps my overall mood A Lot! So I am grateful for that!!!",
      "MessageIndex": 1785,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Apr 16, 2012 02:55PM SleeplessIn wrote: Having had debilitating bone/muscle/joint pain with DD Taxol tx 1 and 2, I thought of just stopping tx early. I just didnt think my body could take any more of this stuff. Because of all the SE my ONC wanted to switch me to weekly Taxol (no mention of Abraxane), which I declined. No way I'll extend this!!! -I cant stand to look at my bold head and chemo-acne, lash-and almost browless face in the mirror any longer, therefore I decided to toughen it out, no matter what.- Had dd Taxol tx3 last Wednesday and so far the SE have been very tolerable. I am very happy about that, of course, but i dont understand it... How SE are so unpredictable from tx to tx?!- In any case, just one more tx to go now - cant wait!!! I am IN AWE of all of you ladies working through this!!!! I don't know how you do it!!!",
      "MessageIndex": 1996,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 3, 2012 02:20PM SleeplessIn wrote: Jenn, just wanted to suggest to try yogurt that has probiotics like bifidus regularis. I had thrush yesterday for the first time, and ate some yogurt last night and some this morning, and gargled with salt/baking soda water twice - and it's gone! I have also found that protein is helping me with nausea... haven't eaten as many eggs in years as I have since starting chemo. :-) Nancy, Your blog is awesome! - Love the title, too! Judy, Thank you for the wig sites. I am just having a hard time with finding a wig here locally. It's not so much with finding a style, but with finding a color and for the \"hair\" to look somewhat natural. - My hair has gone from long, to chin-length, to pixie in one week. Tomorrow I think I will go get a wig, finally. :-)",
      "MessageIndex": 972,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Apr 23, 2012 11:03AM SleeplessIn wrote: Nancy, Does your center offer radiotherapy in the prone position? I believe it is a relatively new way to deliver radiation to the ( \"partial\" only) breast. Being on your tummy during the process, with the breast hanging down (like during a breast MRI), is supposed to decrease the damage done to the heart and lungs. - I just came across this and have to read some more about it. But it may be something to consider, especially for us \"left boob women\". :-) not made up my mind, either, whether to have radiation done. online.medphys.org/resource/1/...",
      "MessageIndex": 2044,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jul 6, 2012 09:20PM SleeplessIn wrote: Julie, Sending you positive and healing thoughts for a quick recovery! Hope you will be well soon!!!",
      "MessageIndex": 2407,
      "PostDate": "06/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Feb 23, 2012 04:31PM SleeplessIn wrote: Thank you, Denise. I am glad to hear that you experienced something similar. That doesn't sound right, I hope you know how I mean it. :-) I dont want be be \"special\" when it comes to SE - as it could mean complications. Thans again, feeling much better now.",
      "MessageIndex": 1409,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 8, 2012 03:06PM SleeplessIn wrote: Thank you, Momof2inME, for posting that. Sounds like something that would happen to me. :-) Good thing it went well in the end, and that you had no allergic reaction! Hope you're side effects will be minimal. - Wonder if they (SE) will be cumulative, though. - Did you get a Neulasta shot, also? - I am having my first Taxol tomorrow, and am very anxious. It took me 12 days to \"recover\" from AC 4, and the bottoms of f my feet are still a little painful. Nothing like only 2 days ago, when I had a hard time wLking from the pain. Who said hand/foot-syndrome SE was rare?! dang!!!!",
      "MessageIndex": 1562,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 10, 2012 05:22PM SleeplessIn wrote: For those with upcoming first Taxol treatments, I jist wanted to give you a heads up. I had my first one yesterday. Premeds (benedryl) literally made me feel like I was drunk, so I kinda welcomed that, in a weird kind of way. :-) I really kind of missed the point when the nurse started the Taxol, that's how spaced out I was. At some point she said, well, you seem to be doing well, I think we can turn the drip rate up to normal. I looked at her and asked \"what\". My husband grinned.... Oh, and I iced my feet and hands for about half the time (the nurse made awesome icebags with openings just for the tios of the fingers, after I could not \"take\" the extreme cold from the c\"coldgloves\") in an effort to avoid Peripheral neuropathy. Slept well last night, and no nausea so far, just what I think are Hot Flashes. Wow! I took some L-Glutemine powder (in water), which, some say, can help avoid neuropathy. We'll see. I also took a Claritin to help with the bone pain from Neulasta. Oh, and one Ativan last night, to help me go to sleep, but otherwise NO meds. Feeling better today than I have in the entire last month! yay!!! Gentle hugs to all of you",
      "MessageIndex": 1599,
      "PostDate": "10/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 20, 2012 06:32PM SleeplessIn wrote: NCbeachgal, What were your blood counts like, do you know? My MO automatically gives me the Neulasta shot (the day of dx) and I had severe bone pain with AC also, not just with my first Taxol (although with my first Taxol it was waaaaay worse). I have been thinking about asking to not get the Neulasta shot (if my bloodwork is Ok), but on the other hand that worries me, as my kids are constantly sneezing and have runny noses....",
      "MessageIndex": 1747,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Apr 16, 2012 03:18PM SleeplessIn wrote: Cat, I am so sorry for the loss of your kitty. Hope you find comfort in the fact that she had a long and happy life and that you were in each other's lives! Laura, Sending you a big hug and much strength!!! Janet, Congrats!!! You did it!!! How awesome does it feel to be done with this (cr*ppy) part of treatment?! Bela, Sending you lots of positive thoughts and well wishes for your surgery Wednesday, and for a easy recovery!!! Jenn, Happy to hear about your positive US results. One less thing to worry about -yay!!!! - I was wondering if you ever had your breasts checked, as a result of the pain you were experiencing a little while ago? - I have had similar pain (in both breasts, oddly enough), also nowhere near the surgery site/scar tissue, as well as what I would describe as several big lumps. My onc dismissed it, saying it is a SE of sorts, brought on by inflammation.",
      "MessageIndex": 1997,
      "PostDate": "16/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 7, 2012 05:17PM SleeplessIn wrote: Janet, Thank you for sharing your thoughts on radiation. Ideally, I would like to include radiation in my further treatment, like you said, to be sure thay I threw everything possible at this stup*d cancer. I will meet with RO tomorrow and will try to keep an open mind, but I was previously told that the actual position of the tumor bed is is not favorable(in terms of avoiding beams to heart and lungs). Another negative for me is that I smoked for 23 years, so my lungs are not in the best of shapes to begin with. Kitchenella, I am 12 days out from my last Taxol, and I have no hair to speak of - just peach fuzz in grey. I sure hope it will grow out and change color, because I am only 40!!! - I wish it would grow faster, because I am tired of wearing a wig. Denjak, Sorry to hear the numbness and tingling in your hands and feet is still bothersome after completing tx. I only have mild tingling in my fingers, but I had hand/foot syndrome while on AC, and it took several weeks for the SE (pain in the sole of my feet and not being able to walk normal) to subside after my last tx of AC.",
      "MessageIndex": 2125,
      "PostDate": "07/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/779525",
      "Title": "January 2012 chemo ely Momof2inME"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 18, 2012 06:30PM SleeplessIn wrote: Hi Bestbird, I have read about the Budwig \"shakes\" (in various forms) in a number of books and articles. I started doing a version of it (3 tablespoons flaxseed oil / 3 tablespoons ground flax) the day I was called back for a second mammogram, before I even knew I had BC. - It helped me feel \"healhty\". :-). I have a friend who used to have cystic lumps in her breast for years and after doing the flax/cottage cheese shakes (juice added to make it drinkable, rather than scoopable) the cysts in her breasts have completely disappeared. The pathology of the cancer I had removed also was estrogen+ and I was worried about the negative effect some claim flax could have. But after all I read, and - most importantly - what I heard from my naturopathic doctor, I am continuing with it (as well as a few other things I have added to my regimen). - Ditto, I really miss my coffee, and miss having a glass of red wine (or two) with dinner. That said, I am hoping that by doing \"the right things\" (even if it is just a placebo effect), I will be able to get through my treatment ok and can hopefully minimize the risk for recurrence.",
      "MessageIndex": 7,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781098",
      "Title": "Flaxseed 30DEBBIE Bestbird"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jul 3, 2012 06:12PM SleeplessIn wrote: Bkala, If I were you, I'd push to get at least an ultrasound, or, ideally, a breast MRI. Younger, premenopausal women typically have dense breasts, which are hard to be \"read\" by a mammogram. Actually only about 40% of lumps can be found by mammograms in women with very dense breasts.... www.everydayhealth.com/breast-... That said, your lump may very well be a benign cyst (over 90% are), so try and stay positive, but try to get tot the bottom of it, even if it means you have to go to see a second or third doctor. Best of luck!!!",
      "MessageIndex": 4,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790039",
      "Title": "palpable mass - negative mammogram bkala SpecialK"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235818/profile",
      "Content": "Jul 11, 2016 01:47AM SleeplessinUtah wrote: Hello everyone.  Guess my next CT scan will tell me what is going on.  I am on 500mg of Faslodex, and I after about four months, I have started getting radiating pain that moves.  Sometimes in my neck (scalenes), sometimes in my trapezius, sometimes in the top of my shoulder (deltoids), sometimes in shoulder blade, and between the shoulder blades (rhomboids), and tonight it is pretty painful just to the right of my seventh cervical vertebrae.  It makes it impossible to sleep. Have taken two Aleve, and it isn't touching it.  I have been told it is Faslodex, and if so, I am hating it.  It is also giving me horrible insomnia. ",
      "MessageIndex": 26,
      "PostDate": "11/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/802321",
      "Title": "Shoulder Blade Pain alilou7497 shodali"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 29, 2012 01:41PM SleeplessIn wrote: Congratulations, Kerry! - What an achievement! Hats off to you!!! Thank you for your inspirational and motivational post!",
      "MessageIndex": 11,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/788234",
      "Title": "I ran a frickin' Marathon!! KerryMac NancyD"
    },
    {
      "AuthorID": "SleeplessIn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "SleeplessIn wrote: My dull chest/rib area pain and shortness of breath started a few months ago, not too long after my first chemo treatment. I also have sharp pain in the area just under my breasts when I take a deep breath or sneeze. The MO put it off, just like all the other SE I experienced during chemo, saying SE were temporary - not to worry. No scans or tests to figure it out. Basically told me to get with the program, meaning take pain killers and shut up. In any case, almost three weeks after finishing chemo, I found out this \"rib pain\" and shortness of breath is pleurisy and is just another \"rare\" SE from chemo. Apparently it is more common (though still \"very rare\") during/after radiation. I just happened to be the unlucky gal that got some of these \"rare\" SE from chemo.... Anyone else had \"rare\" SE, the kind that you treatment team tells you they have never seen before? left breast lumpectomy/SNB: 4 dd AC, 4 dd Taxol Dx 11/4/2011, IDC, 1cm, Stage I, Grade 3, 0/2 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787457",
      "Title": "Who got Pleurisy and other \"rare\" SE from chemo? SleeplessIn kltb04"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Mar 5, 2012 07:29PM SleeplessIn wrote: Same here!!!! After my third AC chemo my fingertips were tingling a bit, but now, 9 days after AC 4, that is almost gone. However, for the past 4-5 days the soles of my feet are extremely tender and and dry (not peeling though), making it hard and painful to even walk. Clearly hand-and-foot syndrome. - I have read that icing 15-20 minutes on/off may help, as well as adding vitamin B6? - I, too, was hoping to hear from anyone who has gone through this and what helped?",
      "MessageIndex": 2,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/783498",
      "Title": "Hand and Foot Syndrome everhopeful CMS2011"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 15, 2012 12:14AM SleeplessIn wrote: jenlee, That is the kind of treatment (being sent to cardiologist) ever MO should subscribe in an effort to monitor any potentially serious SE from chemo. Did you have any pain, or were your scans more \"routine\"? ma111, Did you take steroids in order to heal the inflamed lining of the lungs, and if so, how long did it take?",
      "MessageIndex": 3,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/787457",
      "Title": "Who got Pleurisy and other \"rare\" SE from chemo? SleeplessIn kltb04"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "May 17, 2012 06:12PM SleeplessIn wrote: Thank you, jennyboog! I found this... sorry I don't know how to make a link hot, so I'll just copy part of the news release below. \"MD Anderson News Release 05/16/2012  A breast cancer vaccine already shown to elicit a powerful immune response in women with varying levels of HER2expression has the ability to improve recurrence rates and is well tolerated in an adjuvant setting, according to new research from a clinical trial led by researchers at The University of Texas MD Anderson Cancer Center. The findings, released today, will be presented on Monday, June 4 in an oral presentation at the 2012 Annual Meeting of the American Society of Clinical Oncology (ASCO). It builds on previous research showing the vaccine, known as AE37, to safely and effectively raise immunity against human epidermal growth factor receptor 2 (HER2) – an oncoprotein that promotes tumor growth and is expressed to some extent in 75-80% of breast cancer tumors. The researchers found that patients who received the vaccination had an estimated recurrence rate of 10.3% compared to 18% in the control group at a median follow up of 22 months....\"  http://www.mdanderson.org/newsroom/news-releases/2012/hybrid-vaccine.html",
      "MessageIndex": 1,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787677",
      "Title": "BC vaccine...there is hope! jennyboog ma111"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Dec 6, 2011 02:23AM SleeplessIn wrote: I'm scheduled for a lumpectomy and SNB for Thursday, 12/8, after (me) cancelling my original surgery date last week due to a nasty cold. I actually still have cold symptoms but have not taken any of my vitamins after being told not to in preparation for surgery last week, and now this week. This is the longest cold I have ever had. Right now I am really contemplating taking Vitamin C and possibly also D, to help recoup from this cold and to gain some strength for op and post-op. Neither vitamin has blood thinning indications, nor could I find any info on how they could potentially interfere with anesthesia.... I'm torn.",
      "MessageIndex": 209,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Dec 8, 2011 04:17AM SleeplessIn wrote: Hugs and prayers for all you ladies, and lots of positive thoughts tomorrow for all my \"Thursday sisters\"!!!",
      "MessageIndex": 261,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 15, 2016 05:38AM SleeplessinCO wrote: pmevans50, I've been getting up at 3:30 since I was diagnosed! I can fall asleep fine, but always get up in the middle of the night and can't get back to sleep. I'm afraid it will get worse when I start my chemo, but I was prescribed Ambien. I took it once last week to see how it worked, and I woke up pretty foggy and dizzy, so I really don't want to use it. I'm in Colorado, and I'm thinking of asking my MO if I can get a prescription for cannabis. Has anyone tried that to help with sleep or nausea? It seems like it would be less toxic. Four more hours and I'll be at my first chemo. Good luck to all of you starting with me today. I hope it goes well for all of us.",
      "MessageIndex": 332,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 22, 2016 10:39AM SleeplessinCO wrote: Good luck today Eileen! We'll be praying for you.",
      "MessageIndex": 577,
      "PostDate": "22/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 29, 2016 07:24PM SleeplessinCO wrote: amw5 - my chemo went well today. Feeling pretty good so far. I'm glad you are too. My hair started to go in the shower this morning. Had a good cry, then counted my blessings. I just wanted my hair to make it through Thanksgiving so my son (on leave from the army) could see me looking normal. We had a great weekend with him. I decided to just go back in for the neulasta shot tomorrow. My cancer center is so close, it seemed easier to just do it that way (another thing I'm grateful for). I hope your week goes well.",
      "MessageIndex": 748,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 2, 2016 08:57AM SleeplessinCO wrote: That was amazing Leslie. You must be so proud. Thank you for sharing",
      "MessageIndex": 822,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 9, 2016 04:43PM SleeplessinCO wrote: Becky - I haven't had any itching on my head and I've always had very sensitive skin, so I'm actually surprised. I had my husband buzz it last weekend, but I still have a little hair. I've honestly just been shampooing/conditioning with my regular shampoo (Pantene) to help the remainder fall out, and that seems to keep the itching away. I wonder if the powder you're using might make it dry out more. Wishing you the best!",
      "MessageIndex": 958,
      "PostDate": "09/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 13, 2016 12:29PM SleeplessinCO wrote: Rachel - I only take the nausea meds for 3 days and that seems to work for me. Mine is a steroid and Zofran. I take them 3 times a day starting the day after chemo. I hate them but it was better than the first time when I didn't take anything. Good luck to you! Cindy",
      "MessageIndex": 997,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 29, 2012 10:13PM SleeplessIn wrote: Thank you for being so inspiring, ladies. I am 2 days past my second AC treatment. Yesterday, I did a 30 minute walk outside. Today, I was going to do a little hike with my family, but it rained. Surprise. So I figured I use that as an excuse not to do anything. But then, after reading this thread, I decided to get on the elliptical at least. And I did it for 30 minutes. I am so proud of myself. - Thank you again, ladies, for being so encouraging!!!",
      "MessageIndex": 18,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780592",
      "Title": "Exercising During Chemo jenlee Claire_in_Seattle"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 31, 2012 05:26PM SleeplessIn wrote: Claire_inSeattle: I am definitely waiting for nicer weather. My favorite walk is along Seaward Park, 2.3 mile loop, perfect distance for me and my youngsters, and the view is lovely. Not just the water but sometimes also of Mt. Rainier. - Hope spring will come sooner this year than it did last year, though. That rain seemed like it was never-ending. NancyHB. Wow! Running 2.5 miles the day after chemo - that is something else!!! Awesome!!! - I could have not done that prior to chemo.:-)  And Yoga, too. I agree that stretching and yoga (and really all exercise) provide awesome benefits for not just the body, but also the mind. Keep doing what you are doing, even if it's at a slower pace. I hear you in terms of being afraid of your heartbeat. I went hiking and snow shoeing the week before I started chemo and my heart rate was fine. Now, after starting chemo, my heart starts pounding hard - quickly. I can definitely tell how fast its going when I'm on the elliptical and holding on to the heart rate monitor. Just gotta roll with the punches sometimes, I guess. Regarding the port, mine is not moving, but it feels awkward to have it. I am always aware that it is there. My 5-year old bumped into it (well my chest) yesterday, and I screamed. Not in pain, but because it felt weird, like it just shouldn't be touched. Ok, off to school pick-up. First I need to \"de-hair\" myself, I guess. I cut my hair to chin-length yesterday, 17 days past my first AC tx, and it is still falling out pretty badly... I hope I can hold onto some of it until Fri, when I have my new appointmt for wig fitting. Can't believe it's been so hard to let go of my hair. :-( Good luck, and few SE with your AC #2!!! - Counting down the treatments, that's the way I'm looking at it. :-) ClaireinAZ: Thank you for your post. - I know it is so important to stay hydrated, but it's just so hard to get myself to \"put\" anything in my mouth sometimes, especifially something that will fill up my stomach and may (or probably will) make it feel worse. - The mere thought of drinking more ginger tea, peppermint tea (and/or eating many foods) makes me nauseous these days.",
      "MessageIndex": 26,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780592",
      "Title": "Exercising During Chemo jenlee Claire_in_Seattle"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 20, 2016 10:42AM SleeplessinCO wrote: Thank you for all your advice ladies. Next time I start zofran on day 1. I'm now on day 6 with stomach cramps and D. When will this end? I feel like they gave me too big a dose of chemo or something. Will talk to MO. On a side note, for those with yucky taste in mouth after eating like me - I found Mentos peppermint mints very helpful. Biotene works too, but mints are sometimes more convenient. Have a beautiful Sunday!",
      "MessageIndex": 522,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 20, 2016 07:30PM SleeplessinCO wrote: Welcome livin-on-a-prayer. I'm sorry you have to handle so much all at once this week, especially before the holiday. We'll be here for you. Good luck tomorrow Javamama. Chemo day for me was actually much easier tha I expected but the anticipation was rough. Deep breaths.",
      "MessageIndex": 540,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 2, 2016 07:16AM - edited Dec 2, 2016 07:19AM by SleeplessinCO latinmxy - I had the bilateral with tissue expanders, but I only got in 150ccs before my chemo started. My next expansion is on Tuesday. I am looking forward to getting the expansions going so I feel more normal looking. I can't wait for the reconstruction though, so I can finally sleep on my side again!",
      "MessageIndex": 817,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 30, 2012 09:56PM SleeplessIn wrote: Thank you, Claire! Kudos for doing the ride in the rain yesterday. - I am still kind of new to Seattle and have not adjusted to that kind of lifestyle (going out and doing things in the rain) - not sure if I ever will :-) If nothing else, I am trying to at least walk my kids to school everyday, which used to be about 30 minutes or so RT, right now it takes me 45. My back is hurting/burning while I walk (on the way back usually), and I am getting out of breath easily, so that is a bit frustrating. But I know I need to do it, no matter what. I am so glad to be able to read about all you guys doing what you are doing. It really inspires me!!!",
      "MessageIndex": 20,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780592",
      "Title": "Exercising During Chemo jenlee Claire_in_Seattle"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Dec 6, 2011 03:35PM - edited Dec 6, 2011 05:56PM by SleeplessIn You guys are starting to freak me out - even more so than I already was. I am having the wire placed tomorrow at 2PM and then have to drive myself home afterwards. My surgery is not until the next day in the morning. - Somebody PLEASE tell me it's not a big deal to be walking around with a wire placed in your chest....???!!!! ",
      "MessageIndex": 226,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Dec 7, 2011 03:00AM - edited Dec 7, 2011 03:56AM by SleeplessIn Cookie, Thank you. I called the nurse today, and indeed I had misunderstood. I am not having the wire placed tomorrow (one day before surgery), but rather I'll have a lymphoscintigraphy, which is nicely described by CatWhispurrer above. :-) At least now I know what to expect. In any case, wishing you a smooth oohph tomorrow and a speedy recovery. Jenn28: Good for you to be able to schedule surgery so quickly after diagnosis! It will save you that dreaded sitting around being scared of surgery, a wating game that is not fun by any means. - You will have plenty of time to research and decide what kind of treatment you want to get afterwards. I know that I want to see a few more oncologists before I decide on a treatment. It all depends on the pathology, of course, too. - All the best to you! noodle6: Hugs and best wishes for your surgery. Catwhispurrer: My cats send you purrs, and I wish you good luck and a speedy recovery.",
      "MessageIndex": 233,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 7, 2016 07:24AM SleeplessinCO wrote: So glad I found this thread. I get my port this Friday and start AC/T chemo 11/16, every two weeks. I've held up pretty well after bilateral and tissue expanders, but going bald seems the scariest. (How crazy is that?) My cancer center provides free wigs, but the one I got is just not me so I'm hoping to find a better one at a wig shop this week. I have so much to be grateful for - my boys are grown, my husband has been amazing, and I work from home. I wish I could embrace going bald and \"rock it\" like my husband says I can. Maybe I'll surprise myself. Thank you all for your posts.",
      "MessageIndex": 172,
      "PostDate": "07/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 11, 2016 07:55PM SleeplessinCO wrote: I had my port placement this morning. I couldn't believe how easy it was. I was actually awake through the whole thing but didn't feel much pain at all. Fast forward 7 hours and yikes! The anesthesia has worn off. I feel like someone punched me in the neck. Not as bad as the mastectomy pain though so I'll live. I got my wig yesterday. Not as cute as dbear's but I think I can get used to it putting it on without crying. I'll post a pic tomorrow. Welcome new members and thank you to all who have posted about their chemos. It helps so much. I'm ready for my first one on Tuesday! Everyone have a great weekend!",
      "MessageIndex": 252,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 15, 2016 05:49PM SleeplessinCO wrote: I apparently already have chemo brain because I swear I posted about an hour ago and now I don't see it. I had my first chemo today and it wasn't bad at all. Now I'm just waiting for the side effects but they gave me plenty of drugs for just about everything. I also got the marijuana script, so I'll let you all know how that works when I try it. They gave me steroids in the IV and I will take pills for 3 days. Neulasta shot tomorrow. The fun never ends. Pmevans50, I've never liked tea for some reason but I wish I did. I may have to try it again. Javamama, I was awake thru my port install too. Kind of weird but no pain and no nausea so I was happy about that. It hurt for a couple of days but not unbearable. It is scary when they mention possible heart damage but they won't do chemo if your heart's not strong enough. I've had to put my faith in the docs and hope for the best. My sister is a 23 year survivor, so I'm optimistic. I'm feeling more like a warrior today. Thank you ladies! And if I already posted all this, forgive me for being a little loopy. I hope everyone else who started today did well!",
      "MessageIndex": 355,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 16, 2016 08:28AM SleeplessinCO wrote: pamela23, I wish I had asked about the Xanax. I was almost hyperventilating on the way there, but I didn't know if I could take one. Once I was there, though, I was fine. Good luck today",
      "MessageIndex": 379,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 21, 2016 01:32PM SleeplessinCO wrote: bg46tn, looks like your 2 days behind me. Hang in there. The headache finally went away on day 6 for me. Hopefully it will for you too.",
      "MessageIndex": 559,
      "PostDate": "21/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 22, 2016 09:59PM SleeplessinCO wrote: pmevans50, I have the hairy tongue too. I have to brush my teeth after eating anything. So annoying. Sorrlla, I will definitely try the acupuncture for the headache. Thank you",
      "MessageIndex": 600,
      "PostDate": "22/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 24, 2016 10:49PM SleeplessinCO wrote: Latinmxy - that must have been so scary. I'm glad you have such a great husband, and I now know I won't ignore any issues like that if I have them, so thank you for sharing. I hope you feel better soon. amw5 - I've never had heartburn either and I got it a couple of days ago. It was horrible, but my sister had told me to buy Prilosec before my chemo just in case. So glad I did. It took about an hour to start working but helped so much. I'm starting to think I need to push myself to get more exercise. I can't imagine walking around my block, much less walk 30 blocks, but I'm determined to make a better effort going forward. I was walking 3 miles a day before my surgery. It's so easy to become lazy when you have an excuse. ",
      "MessageIndex": 645,
      "PostDate": "24/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 5, 2016 06:05PM SleeplessinCO wrote: I'm on day 7 of my second AC and I did much better taking the steroids and zofran, but yesterday and today I've had a stomach ache that won't quit. I've been on a bland diet. Pepcid helped a little but it wears off and you can only take it twice in 24 hours. Has anyone felt like there's a rock in their stomach? So annoying.",
      "MessageIndex": 888,
      "PostDate": "05/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 6, 2016 07:11AM SleeplessinCO wrote: nfullblume - I'll try the yogurt. Thank you. I'm thinking now it may be stress causing my stomach pain. Losing my hair has hit me hard. I'm sorry you have to deal with hemoroids onon top of all of this. And aren't you also doing your Invisalign treatments? I'm so glad I finished mine in September. I can barely wear my retainer at this point. I admire how positive you always are. You are a true warrior!",
      "MessageIndex": 894,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 7, 2016 09:23PM SleeplessinCO wrote: Dbear your wig looks great! Now I'm actually excited to shop for my wig this week. Thank you for posting the pic. Very encouraging",
      "MessageIndex": 185,
      "PostDate": "07/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 12, 2016 07:04PM - edited Nov 12, 2016 07:06PM by SleeplessinCO Oh Nanpop, I feel your pain. I had the double mastectomy too and just when I felt like the pain was finally tolerable I had the port put in (yesterday) and I feel so beat up today. I cried in the parking lot after grocery shopping with my husband because I was so tired of being in so much pain. I'm doing the opposite however - I think I've gained at least 5 lbs this past month (stress eater). I do think the worst of the physical pain is over. Now it will be more emotional. I honestly get through it each day by counting my blessings, and I thank God it is me with cancer and not one of my children. Cancer sucks, but we can do this. Please see if your cancer center has someone you can talk to and hang in there. You're stronger than you know and you're not alone.",
      "MessageIndex": 268,
      "PostDate": "12/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 16, 2016 08:17PM - edited Dec 5, 2016 09:01AM by SleeplessinCO",
      "MessageIndex": 408,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 20, 2016 05:15PM SleeplessinCO wrote: Wow, after this morning's tummy trouble, I finally felt human again for the first time in 6 days! I got my table set for Thanksgiving (the only thing my sisters are letting me do - yay!) and I took a drive to see the beautiful Colorado scenery with my hubby. Finally a good day. I feel so lucky to work from home. I don't know how you all manage to go to work and/or watch small children while going through this. God bless you all. Here's to a great week for all of us!",
      "MessageIndex": 535,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 23, 2016 07:19AM SleeplessinCO wrote: Sorry for your rough week Javamama. I hope you feel better soon. Hang in there",
      "MessageIndex": 602,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 28, 2016 09:38PM SleeplessinCO wrote: I can't believe how great I've felt the last few days after feeling so horrible the first week of Chemo. Tomorrow is Chemo #2. Hoping it goes better this time, but I think taking the Zofran will help. I did get great news today - my RO said I won't have to have radiation after chemo. Tumor was small and my margins were good. Yay! I'm preparing myself for losing my hair this week. Wish I had cut it shorter than I did in preparation. Oh well. I'm feeling strong, and counting my blessings keeps me going. Good luck to all this week! Cindy",
      "MessageIndex": 717,
      "PostDate": "28/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 29, 2016 09:10AM SleeplessinCO wrote: Javamama - Yikes! That sounds painful. Hopefully you don't go through that next time. Nfullblume - I hope you get the same good news about no radiation. Sending you positive thoughts. Good luck today amw5! I'm on my way to my second one too.",
      "MessageIndex": 723,
      "PostDate": "29/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 30, 2016 02:35PM SleeplessinCO wrote: Kelly - I don't really like Gatorade either. Thanks for the tip about the Nunn tablets. Leslie - I'm so sorry you're down. Hang in there. February isn't that far off. Nfullblume - you look so cute in that hat. My RN said Taxol is usually a little easier, so I was glad to hear that. I listened to Robin Roberts' podcasts yesterday. They sure helped pass the time, and so inspiring. ",
      "MessageIndex": 769,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 1, 2016 11:01AM SleeplessinCO wrote: Kelly - Happy Birthday! I hope you have an easy day! Amw5 - my AC this week took about 3 1/2 hours. I feel your pain on the hair ladies. Mine started coming out on day 13. My hairdresser is going to buzz mine on Monday (when the salon is closed). She is the sweetest, and I think it will be easier than having my hubby do it. I've got the wig, hats and lots of scarves, but still not ready for that day. Between losing the breasts and hair, it's like losing your femininit, but I know a year from now, we'll be through all of this torture. Looking forward to the holidays in 2018 already.",
      "MessageIndex": 798,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 7, 2016 06:00AM SleeplessinCO wrote: Becky, I just sent a request to join. Cindy (Ryan) Schreiber, profile pic is me with a Denver Broncos hat. Thank you for creating the page.",
      "MessageIndex": 918,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Apr 23, 2012 01:20PM SleeplessIn wrote: Mary, I 100% understand what you are saying. And, yes, I realize that a lumpectomy is \"supposed to be\" followed by radiation. However, I am wondering exactly the same thing, and no one has been able to give me an answe that makes sense. - If one has chemo following surgery (I did chemo because of grade 3 and high oncotest score), then why does require additional treatment with radiation, too?! Chemo is supposed to kill or stop cancer cells from growing further (depending on the chemo), and it targets the entire body, right?! So is the breast not also part of that entire body?! Therefore chemo should also kill any stray cells left over in the breast and avoid local recurrance, shouldnt it?! - For me it's really hard hard choice to make, given that my RO (who is also a professor and practices at a NCI designated center) told me there is NO WAY to completely avoid the heart and part of the lungs, if they were to radiate my left breast. So with a relatively small cancer, clean margins and clear sentinel lymph nodes, as of right now I think the rsik/benefit is simply not in favor of radiation. In my case, that is. I am keeping an open mind and have a bit over 3 weeks to make up my mind. For now, I am looking forward to completing chemo in two days. What a ride it has been - but glad I did that part. Yay!!!!",
      "MessageIndex": 13,
      "PostDate": "23/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783886",
      "Title": "Radiation Necessary marystnow55 purple32"
    },
    {
      "AuthorID": "SleeplessIn…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140486/profile",
      "Content": "Jan 15, 2012 12:51PM SleeplessIn wrote: Amen, Kaara! I could not agree more with you in terms of the \"one size fits all\" treatment women with breast cancer are offered. I am 40 years old, and therefore there is a good chance that I may get another cancer at some point. That said, treating me with Chemo, followed by Rads (left breast) and 5 years of Tax feels a bit much, particularly since the very real long term side effecs of all these treatments are known to include secondary cancers and very serious heart disease. - Having said this, I also agree with some of the other posts here, that doctors prescribe what they do just to be on the safe side. And in my opinion, also to not open themselves up to potential lawsuits. Personally, I am open to explore less conventional treatments perhaps (after having had a lumpectomy and undergoing chemo right now), if that can be geared more to my personal situation and medical history. I have not made a choice yet, but continue to read and learn for now. I also have an appointment with a naturopathic oncologist next week, to see what other treatment options may be. There are many paths and options for treatment, I believe. Unfortunately all the choices are Not presented to us on a display to pick and choose. It takes a lot of time, reading, time, reading... To learn what is out there, and to ultimately choose what we feel is best for us - as individuals.",
      "MessageIndex": 15,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/781063",
      "Title": "Radiation Therapy for early stage Kaara mimikitty"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 13, 2016 06:43PM SleeplessinCO wrote: amw5, That story made me smile. My hairdresser has also been amazing. She refused to let me pay for my last cut and color in September after I was diagnosed. And the woman I bought my wig from was also amazing. She booked me a full hour appointment to privately try on wigs and then she styled the one I chose as well. I could tell she did this from her heart and it made the process so much easier. I start my chemo the day before you on Tuesday. The same AC + T. I'm now getting scared and hoping I can stay strong. Reading these posts have helped so much. 36 hours to go (not that I'm counting or anything). Good luck to all of us this week!",
      "MessageIndex": 307,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 15, 2016 07:43PM SleeplessinCO wrote: nfullblume - You look great and thank you for the funny TMI story! I guess that will be a shocker. Javamama - no need to apologize. I think this is the best place to vent. We all understand. One thing that helps me is reminding myself how lucky I am that I have the cancer and not one of my kids (21 and 23 year old boys). I know there are parents out there that have children with cancer and they wish they could trade places with them. I'm glad I'm not one of them. I'm thankful my boys are happy and healthy, and I will beat this so I can be a grandma someday like my sister did. Now when is this friggin chemo headache going to go away?!!! 😩 So annoying!  ",
      "MessageIndex": 359,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 16, 2016 07:46PM SleeplessinCO wrote: Day after chemo - no nausea (thank goodness), but super tired like you Amw5. I got the Emend in the IV and they gave me a prescription for steroids to take for 3 days, but I'm wondering if I need them. They already made my face red. Leslie2016 - I wish I had done my port a few days earlier. I had it Friday and chemo on Tuesday, and it could have used another couple days to heal, so you'll be thankful, and it must have felt good to make that hospital worker's day! Nanpop - Eat a good breakfast - I had the exact same thing nfullbume had - scrambled eggs and sourdough toast. Now I'm eating mint chip ice cream for my comfort food. The chemo has left a weird taste in my mouth, like I want to brush my teeth all the time, so the mint chip is perfect! I hope I have more energy tomorrow. Sleep well ladies.",
      "MessageIndex": 406,
      "PostDate": "16/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 19, 2016 07:19PM SleeplessinCO wrote: I really messed myself up. I had the 1st chemo Tuesday with the Emend, took my steroids and got the neulasta shot on Wednesday, and had the worst headache for 3 days and constantly queasy but never threw up. I never took the zofran or compasene because they said it could give me a headache and the hydrocodone could make me nauseous. I'm finally feeling human today but I really need my MO to tell me exactly what to do because I was way too confused with all the meds they gave me. No way I can do it like this again. I'm not feeling much like a warrior right now. :",
      "MessageIndex": 517,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 21, 2016 11:36AM SleeplessinCO wrote: latinmixy, stool softener tablets worked for me. Now I'm dealing with heartburn, ugh!",
      "MessageIndex": 553,
      "PostDate": "21/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 30, 2016 08:01AM SleeplessinCO wrote: BG46TN - FYI - I went in for my second chemo yesterday and asked the NP why I was still so thirsty when I was drinking so much water. She said drinking too much water could be reducing my electrolytes. She suggested I drink some pedialyte, Gatorade or juice as well. I ate way too much on Thanksgiving (including too many sweets) and felt like crap the next day. Back on a bland healthier diet. Not worth cheating when it makes you feel like that. I hope you feel better soon and good luck on Friday",
      "MessageIndex": 760,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Nov 30, 2016 07:38PM SleeplessinCO wrote: Pmevans50- My RN did say to cut the Gatorade with water, probably because it has so much sugar. She said pedialyte would actually be better.",
      "MessageIndex": 777,
      "PostDate": "30/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "Sleeplessin…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/242172/profile",
      "Content": "Dec 1, 2016 06:50PM SleeplessinCO wrote: Aldea and nfullblume - you rock the shaved head, and I love the smiles. It gives me strength for my buzz appointment on Monday (if my hair lasts that long). Dbear - your story about your son playing the piano made me cry, but it does feel good to cry sometimes. When I feel like this is too hard, I think it will all be worth it to be able to see my sons marry and give me grandchildren someday I so appreciate this message board. It helps me so much. Thank you all. ❤️",
      "MessageIndex": 811,
      "PostDate": "01/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}