{
  "AuthorID": "slh_tn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
  "Posts": [
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Oct 13, 2010 06:50PM slh_tn wrote: I had treatment #2 today and asked the technician to point out the area that is considered radiated skin since I had no idea if I was placing lotion on the right place on my chest.    The tech outlined the area for me with a washable marker so I can see. I was surprised to see how big the area was.  Wow!  ",
      "MessageIndex": 193,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Oct 6, 2010 05:08PM slh_tn wrote: hmh23, I love your quote!  It reminds me of what my oncologist says every time I have an appointment.  He tells me I'm healthy except for the cancer.  It doesn't seem to make sense sometimes, but I need to remember that when I get frustrated with treatment.   I just need to appreciate this wonderful autumn weather we are having where I live.   Wishing you all a wonderful day tomorrow!",
      "MessageIndex": 107,
      "PostDate": "06/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Nov 22, 2010 05:03PM slh_tn wrote: I just wanted to tell someone that I'm finished as of today! The six weeks of driving 1 hour to and from my treatment is over.    I can't believe it but I will miss the rad techs, staff, and doctor. They were all so supportive!  My \"graduation\" consisted of lots of hugs and encouragement.   Best wishes to all the October ladies who have finished or will soon finish this part of the journey.   Though I don't often post, I appreicate you all for sharing your experiences. Sandi ",
      "MessageIndex": 506,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Oct 5, 2010 07:10PM slh_tn wrote: I am also starting rads this month.    I had my mark up and simulation on Monday and will go back this Friday for my initial set up.   Like several of you I am still experiencing SE's from Taxol since I'm only a couple of weeks out.   Has anyone else been emotional since they ended chemo?  Believe me, I'm not sad about ending chemo.   I'm hoping it's just the transitioning to radiation and not knowing what to expect.  Or many it's just being tired of being tired.   Reading your posts have really helped.  It's good to know that others are experiencing the same thing.  ",
      "MessageIndex": 94,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Nov 26, 2010 07:24AM slh_tn wrote: I finished rads on Monday and the fatigue has hit me like a rock too.   I can go for a couple of hours and then feel like I need to take a nap.    Online shopping even takes too much energy.   Instead of fighting this, I'm just going to go with it and take it easy.    My eyebrows and eyelashes are finally back, so life is good!   We all have had a difficult year, and this part is almost finished.  Sending blessings to everyone during this wonderful time of Thanksgiving. Sandi ",
      "MessageIndex": 521,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/758249",
      "Title": "October 2010 rads mamaof3bugs JFV"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Apr 30, 2010 10:37PM slh_tn wrote: Count me as another addition to the month of April.   My first treatment was last week (April 22).  My treatment is AC x 4 every 3 weeks, then T x 4 every three weeks.  Next radiation.   Overall, side effects were minimum and I was feeling really good this week.   Found out my white blood cells are low today so I'm disappointed.    Hopefully, taking it easy this week-end will boost my count.   I am so thankful to everyone sharing their experiences.   It was helpful to know what to expect for my first treatment.",
      "MessageIndex": 298,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/750829",
      "Title": "April 2010 starting chemo caltex_catlady kad22"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Dec 5, 2012 11:20PM slh_tn wrote: Congratulations on your 3 year anniversary!  Your words are just exactly what so many of us are thinking.  I'm also looking forward to my 3 year anniversary in February.",
      "MessageIndex": 20,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797000",
      "Title": "Grateful! -Celebrating My 3 Year Anniversary as a Survivor CharlotteMe hmh23"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Jul 20, 2010 06:27PM - edited Jul 21, 2010 07:07PM by slh_tn TMariana, My surgery (left mastectomy) was the end of February.   I chose not to have reconstruction at that time so I could focus on getting through chemo and radiation.   My surgeon did not recommend it either but did skin sparing surgery for the future.    I was concerned the radiation might affect the results of any reconstruction.  I know how you feel about not pursuing the reconstruction.  Most of the advice given to me by survivors was to reconstruct during surgery or have a double mastectomy.  Neither felt right at the time.  It really is such a personal decision.   I plan to wait about a  6 months to a year after I finish radiation to schedule surgery.  That should give my skin time to heal from the radiation.   I am a d/dd also and find it awkward sometime to go without my prosthesis at home but it feels so much better.  Since I'm limited to the special bras for my prosthesis, some of my clothes are too tight and I really hate that.  I miss my old bras.  The swelling and numbness is finally going away after 5 months and it almost feels like my arm again.   I tried shaving under my arms the first couple of months but it was too difficult- too much swelling.   The chemo (started in April) took care of the hair so shaving hasn't been an issue.   I also have a slight case of truncal/arm lymphedema that shows up after chemo.    Radiation will probably continue to aggravate the situation.  It's probably one of the most irritating things to deal with.  The surgeon referred me to a PT early in the game so I hope to keep it under control.     I've decided to use my time waiting to research reconstruction options and surgeons.   I can't wait to get rid of this fake boob but do believe I made the right decision for me.    This disease is one inconvenience after the other.  It's difficult to have patience to get back to \"normal\" or what ever that is.   Everything seems to go in slow motion, but we all will get there someday.   I think it seems like a longer journey for us because no one chose to go on this \"trip\".   Thank goodness we have each other to provide support.       ",
      "MessageIndex": 7,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/755600",
      "Title": "spring/summer '10 uni's and bi's w/out recon TMarina TMarina"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Feb 19, 2011 04:31PM slh_tn wrote: You definitely have had more than your share of health issues.  The treatment we go through takes a toll on our bodies.  It doesn't take much for us to end up at doctor's office.   I pray that all goes well and you will find some relief from all the pain and sickness.  ",
      "MessageIndex": 3,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764978",
      "Title": "I need a break! carcharm slh_tn"
    },
    {
      "AuthorID": "slh_tn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98213/profile",
      "Content": "Sep 18, 2010 03:49AM - edited Sep 18, 2010 03:52AM by slh_tn Trish, Congratulations to you and to everyone else who have reach various anniversaries!  It is very encouraging to me since I'm only 7 1/2 months out.   I wish you all continued good health for the future.  Way to go! God bless.... Sandi",
      "MessageIndex": 6,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/758178",
      "Title": "Celebrating 7 years! Trish03 karen1956"
    }
  ]
}