{
  "AuthorID": "slinky",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
  "Posts": [
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 25, 2011 07:33PM slinky wrote: I'm so sorry you had to join this club.  I was where you are two months ago and felt the same emotions as you.  I am now recovering from a BMX with tissue expanders and I have never regretted my decision.  Like you, I wanted the cancer out - like yesterday! I stopped exercising because my irrational mind was telling me I was going to make it grow if I moved too much.  I told a nurse that and she said \"yes, that is very irrational\".  The waiting is the worse, but once the ball starts rolling, everything happens very quickly.  And before you know it, you will be sharing your experience with a person who is newly diagnosed. ",
      "MessageIndex": 4,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/766648",
      "Title": "IDC - Histo grade 3; just waiting - forever Melinda_in_NC DanielleSurvivorSince03-09"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 13, 2011 12:27AM slinky wrote: I had my bmx about 6 weeks ago.  I remember I just wanted the cancer out (the sooner the better) and I knew that my breasts can be reconstructed.  I have a friend who had a bmx and showed me her final results - wow, I would have never known had she not told me.  When I first saw my chest after surgery, it looked all deflated and flat.  I am very self-concious when I go out and wear a padded bra.  I was trying to rush this whole process, but now I am resigned to the fact that this is a process and it will take time.",
      "MessageIndex": 3,
      "PostDate": "13/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/766118",
      "Title": "how to mentally prepare for a mx? --- ---"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Dec 15, 2011 10:47PM slinky wrote: I have been experiencing tingling and numbness in my fingers on a daily basis.  I have no idea why this is happening, but I suspect some nerves are pinched in my shoulder or neck.  I have not sought medical help, but I have been getting massages to relieve tension in the shoulders and neck. ",
      "MessageIndex": 6,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767466",
      "Title": "Hand numbness one year after mastectomy momofcuig Shrek4"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Jun 12, 2013 09:53AM slinky wrote: I was SO fatigued before I found my lump.  For almost six months leading up to my discovery, I was going straight home from work and went directly to bed.  I sometimes called in sick because I was so tired.  After I was diagnosed, the fatigue made sense - my body was fighting cancer!",
      "MessageIndex": 29,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/778724",
      "Title": "Anyone have problems with fatigue prior to diagnosis? cfdr dlj140"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 14, 2011 03:14PM slinky wrote: JBinOK, I look like an 11 year old boy, too.  I am considered thin (although I like to think of myself as having an athletic body), and my chest is flat and sunken in where the nips are.  I can see the tissue expanders jutting out on each side of my chest, ready to be pumped up.  I can't get filled for another month because of an open wound on the cancer side, but I did just pick up a cami with inserts from the breast clinic.  It looks sorta round and phony, but nobody would mistake me for an 11 year old boy with these on!",
      "MessageIndex": 5,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764851",
      "Title": "Mastectomy Appearance rosiemills"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 12:09PM slinky wrote: jeskachi, yes, the doctor is concerned with a lawsuit.  I just want to recover from all this breast cancer related crap and move on with my life.  I wish the doctor who performed my emergency surgery was in the same town where I live.  He had excellent bed-side manner and tried to make me laugh because he saw how distressed I was getting.  He was very relaxed and explained EVERYTHING that was happening and what he was going to do.  He also reassured me that this has happened to other women and he has operated on the same type of complication in the past.  I really felt at ease with him.",
      "MessageIndex": 23,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 03:35PM slinky wrote: Ann, yes, I was thinking of calling the doctor who did the emergency surgery to recommend someone in my town.  Either that, or drive two hours for a follow-up with him.  Just the thought of the arrogant bastard touching me makes me cringe! Plantlover,  that sounds like a great plan.  I think I will write a follow-up letter to everyone you suggested.  Funny thing is the original surgeon had a complicated surgery prior to mine and kept me waiting an additional 4 3/4 hours! He could have easily rescheduled my surgery, but, instead decided to operate on me when he had already put in a full working day.  I can't help but to think maybe he rushed through my surgery just to get it over with.",
      "MessageIndex": 26,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 08:21PM - edited Aug 12, 2011 08:23PM by slinky Ladies, you are an awesome bunch! I really don't have the energy or fight in me to complain about this doctor.  I don't know, I guess I just want this cancer s**t to be over! I am sure my case has really alarmed the bastard enough, because he is still calling to check on me.  I am just letting his messages roll over to voicemail.  I know his arrogant, pompous self is calling just to cover his ass, but let him think that I am going to file a complaint!  The network of doctors is very small and if I file a complaint, it will get back to the network of doctors - I might not be a patient anyone would want to take on.  With more work needed, I don't want to alienate myself to the doctors that are covered under my insurance. I am just resting up for the next surgery in two weeks and I hope this will be it for the year.  I can then focus on getting better and getting on with life! My mom said to pick my battles carefully, because there will always be battles.  This battle was won by the doctor that performed the emergency sugery on me - he is my hero! So is my husband who was by my side every step of the way and made me laugh in the ER because I always have one calamity after another.  He said there is never a dull moment with me - that is for damn sure!",
      "MessageIndex": 32,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 10:29PM slinky wrote: Thanks, Liz.   My original ob/gyn that I turned down to do my surgery called me back.  I asked if she would still take me as a patient and she said \"of course\".  I told her what happened and that the PA told me I was being \"dramatic\".  The doc said she thinks I am really mellow and understood why I didn't want to do my follow-up with the bastard doctor.  She did know the bastard who did my surgery and she said he is really good.  I told her I feel uncomfortable going back to him - she didn't press anymore so I left it at that. I went out for the first time in five days.  Still sore/crampy around the lower abdomen and still bloated - par for the course. ",
      "MessageIndex": 56,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:00AM slinky wrote: Thanks, apple.  I did not know the severity of it until the emergency room doc told me it was an artery.  Yes, it was basically severe hemorraging.  I know I was getting very weak and disoriented at the hospital - I almost felt like I was going to pass out right before surgery.  Not sure if it was from being scared or from the blood loss.",
      "MessageIndex": 4,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:15AM - edited Aug 12, 2011 10:16AM by slinky Lovetosail, thanks for the moral support! Kira, I couldn't even find the papertowels to wipe my hands because my vision was a bit blurry and I could feel my disorientation! Susan, I was told that as the new tissue regenerates, a rogue vessel could push its way to the top and pop through the stitches.  This is the laymans version of what happened. Letlet, so sorry you had a similar situation of being \"dismissed\" by the doctor.  The original doctor who performed the surgery wants to see me in ten days for a follow-up.  I really don't want anything to do with him or his office.  Anyone have any ideas if I should try to find a new doctor, or just follow up with this bozo one more time? But request that his PA not be in the office when I come in?",
      "MessageIndex": 11,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:32AM slinky wrote: Susan and Letlet, I am probably going to follow-up with the arrogant bastard.  Like you said, knock him off his ivory tower.  He is now calling twice a day to check-up on me and is now expressing concern - a day late and a dollar short! Ren, I didn't bleed out, but came extremely close! If I bled out, I would have died.  Because I was bleeding from an artery, the blood gushes out in large quantities, versus just trickling out.  We (doctor and husband), could actually see the blood pumping out. I could actually feel the pumping blood rushing out.  Imagine using a garden hose and the water spicket is in the \"on\" position and the water is gushing from the water hose.  Same thing that the artery does.  That is how the blood was \"gushing\".",
      "MessageIndex": 15,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 08:22AM slinky wrote: MRDRN, I will take action with negative reviews after my next surgery (lets hope there are no complications). The bastard surgeon is calling every single day! I told him last night when he called, that I do not want his PA anywhere in the office when I come in for a follow-up visit.  He said \"anything that will make you feel comfotable\".  It would only make sense to keep her away from me, since she was patronizing, unprofessional and bascially making me feel foolish for calling them to begin with.  Bastards!",
      "MessageIndex": 46,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 01:31PM slinky wrote: Thanks, Liz. I just put a call out to my old ob/gyn to see if she would do the follow-up.  She might not want me back, since I decided to go to this jerk for the surgery.  My husband will definitely be there! He won't say anything, but he is extremely intimidating just with his looks.  I am sure if I follow-up with the bastard, words will be very few.  I want to be in and out - I doubt if he will bring up the matter since it is a very hot topic and I don't have anything to say to him. Worse case scenerio is I will drive the two hours to follow-up with the emergency surgeon who is an ob/gyn.",
      "MessageIndex": 50,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 03:32PM slinky wrote: Problem solved! My husband told me to call my primary care physician for a referral.  It is such a small network of doctors, that I recognized half the names that were given to me by his assistant.  There was one name I did not recognize and the assistant said that was her personal ob/gyn.  I made an appointment with this ob/gyn - now I am breathing a sigh of relief! I appreciate all the different point of views I have gotten - sometimes my tiny brain can't think outside the box!",
      "MessageIndex": 54,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 17, 2011 08:18PM slinky wrote: I found my lump because of the pain I was having.  I thought it was my muscle that was hurting, which caused me to massage that area, which in turn is how I found the lump.  Never, Never, Never even considered cancer! I asked my DH to feel it and he said he felt a lump and insisted I go to the doctor.  I would not have gone had he not insisted.  I am now 16 days after a BMX. I hope your lump turns out to be nothing, but get it checked out for your peace of mind.  Hugs to you!",
      "MessageIndex": 16,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765076",
      "Title": "Please help, did your lump hurt? Betterwannabe mtks"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 09:53AM slinky wrote: Thanks kira! I haven't really moved from bed since I returned home the same night as my emergency surgery.  I am scared that the stiches will open up again! I rarely cry in public, but I was so scared I cried in the ER and the operating room.",
      "MessageIndex": 2,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:05AM - edited Aug 12, 2011 10:05AM by slinky dlb, I still get teary eyed thinking about it.  My kids and husband who were with me are now extremely protective and helping me get everything so I don't have to get out of bed too much.",
      "MessageIndex": 7,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 13, 2011 09:04AM slinky wrote: Nh, thanks for the hugs.  I have my feelers out for another ob/gyn! Phila, that is funny! Yes, it would make a great segment on a TV show.  My whole life would make a great book!. voracious, Wow! Tallk about being blown off - and you had two little lives in you , too.  My incident could have turned the blood transfusion route if I didn't stop at the out of town hospital.  How are your twins now?",
      "MessageIndex": 35,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 16, 2011 07:51PM slinky wrote: Thanks, LisaAlissa! I actually surfed the net and this is the site that had some women that experienced similar, if not the same, complication as me.  They were very old posts, though, so I don't know if it happens as often anymore.",
      "MessageIndex": 58,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:46AM slinky wrote: Kira, I plan to wirte a negative review after I see him.  He had one negative review that really painted a true picture of him and his office staff.  But because he is the \"Director\" of this type of surgery, I thought the reviewer might have had a bad visit.  Now, I agree with everything she wrote! dlb, my mom is extremely mad - she reacts on the emotional level, too.  I try to be rational, but yes, since I was already in front of another hospital when I had called his office, they should have said to get checked out  - just in case.  Instead, they said \"if you want, you can drive back and get checked by us since we are the only ones that know how to do this\", again, his PA and her elitist attitude! I kept asking if I should drive back or just go into the hospital - she told me the doctor was not \"concerned\" and \"try to relax\" and enjoy the rest of my day. ",
      "MessageIndex": 20,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 13, 2011 12:30PM - edited Aug 13, 2011 12:30PM by slinky Thanks ladies - you are all the very voice of reason.  I am not going to write a letter of complaint.  I think it is best just to move on and be thankful I am alive.  It was a very rare complication, but it is a complication that is stated in all the literature about a vaginal type of hysterectomy.  The really ironic part of all of this is I insisted on a vaginal hysterectomy, because my mom pushed me to get one! I don't know if it is standard to remove all the parts through the vagina even with a laproscopic hysterectomy? But I consulted two other OB/GYN's that didn't mention anything about the vagina being involved.  I am sure my mom is feeling some guilt for pushing so hard to get everything removed through the vagina. I am probably going to go back to one of the other OB/GYN's that I consulted with or a new one.  I cannot fathom looking at the phony smiles and phony happiness of the doctor and his entire staff.",
      "MessageIndex": 40,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 01:01PM slinky wrote: Thanks, Leah.  I don't know if insurance will cover a follow-up with another doctor.  I guess I should find out, since the man makes my skin crawl!",
      "MessageIndex": 48,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "slinky wrote: Hey everyone! Just wanted to post a complication of a laproscopic hysterectomy that rarely occurs, but can occur.  Of course, I was one of the rare cases! I was fifteeen days out from a total hysterectomy - laproscopic and then everything taken out vaginally.  I planned on attending a dinner two hours away from home.  Halfway through the trip, my family and I stopped for lunch.  While seated, I felt a gush of liquid in the vaginal area.  I ran to the bathroom only to discovery blood and clots running down my legs! My shorts were soaked with blood and the clots were all over the bathroom stall.  I asked the lady in the next stall to get my mom - the lady could see the clots on the floor and she was scared!  My mom came in and helped me clean up.  Luckily, my daughter had an extra pair of shorts and some pads.  I decided to go to the local hopital, but on the way, called the doctors office who did the surgery. His PA said \"you are being dramatic\", \"you should have been using pads\" and \"are you hot-flashing? Maybe this is causing an over-reaction\".  Mind you, I was sitting in front of the hospital at this point trying to decide if my doctor wanted me to get checked.  The PA said she was going to let me talk to the doctor.  He didn't even bother getting on the phone with me, instead the PA got on the phone and said \"the doctor is not concerned - continue on with whatever you are doing, but try to relax\". The bleeding had stopped after I hung up, so I thought it was a one time event. Fast forward six hours later and 100 miles further.  I felt that rush of liquid again, but this time blood and clots were literally pumping out of my body! I was two hours away from home, my whole family was with me and the on-call doctor in my hometown wanted me to travel back to get emergency surgery.  We all packed up in the car, but I could actually feel the blood pumping out.  I knew I could not make the drive back.  I had my uncle (whom we were visiting) meet us and lead the way to the local hospital.  I was soaking through full sized towels every three minutes, with blood clots the size of oranges.  I was bleeding all over the ER so bad that the janitor had to follow me around to clean up all the blood and clots!  The ER was wonderful and the doc knew I needed immediate surgery.  He said I would not have made it back to my hometown without needing a blood transfusion - as the best case scenario and without hitting traffic! Bascially, it was an artery that was pumping the blood out. I am glad I listened to my body and decided not to chance the drive back - I probably would have bled out. The doctor that did the initial surgery prides himself on being \"the best\".  I guess he trained his staff to have this elitist attitude.  He called me the next day sounding sheepish.  I told him his PA told me I was being \"dramatic\".  She was on the other line and chimed in \"I am sorry you feel I said that\".  I told her I didn't \"feel\" she said that, she did say that.  I told her she had horrible bedside manner and I never want to deal with her again. The doctor apologized for the \"inconvenience\", and downplayed the whole event as a rare occurrence that can be easily fixed.  What an a**hole! I am alive today because I listened to my body, not a bunch of arrogant doctors and assistants.  The doctor that did my emergency surgery was fantasic - he explained everything to me and never acted arrogant.  My poor family is traumatized by the event.  But my doctor chalked it up an \"inconvenient\" event. Thanks for reading my long post! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 12, 2011 10:51AM slinky wrote: Letlet and 3mons, yes, he is very scared of a lawsuit, that is why he always has two or three \"witnesses\"  (nurses) in the room with him at all times.  And, obviously, he has his staff on the other line listening in on phone conversations.  I wouldn't doubt if he tape records the conversations. I plan on writing a letter in the near future.  For now, I am laying low until all my sugeries and revisions are finished.",
      "MessageIndex": 21,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "slinky wrote: Hey everyone! Just wanted to post a complication of a laproscopic hysterectomy that rarely occurs, but can occur.  Of course, I was one of the rare cases! I was fifteeen days out from a total hysterectomy - laproscopic and then everything taken out vaginally.  I planned on attending a dinner two hours away from home.  Halfway through the trip, my family and I stopped for lunch.  While seated, I felt a gush of liquid in the vaginal area.  I ran to the bathroom only to discovery blood and clots running down my legs! My shorts were soaked with blood and the clots were all over the bathroom stall.  I asked the lady in the next stall to get my mom - the lady could see the clots on the floor and she was scared!  My mom came in and helped me clean up.  Luckily, my daughter had an extra pair of shorts and some pads.  I decided to go to the local hopital, but on the way, called the doctors office who did the surgery. His PA said \"you are being dramatic\", \"you should have been using pads\" and \"are you hot-flashing? Maybe this is causing an over-reaction\".  Mind you, I was sitting in front of the hospital at this point trying to decide if my doctor wanted me to get checked.  The PA said she was going to let me talk to the doctor.  He didn't even bother getting on the phone with me, instead the PA got on the phone and said \"the doctor is not concerned - continue on with whatever you are doing, but try to relax\". The bleeding had stopped after I hung up, so I thought it was a one time event. Fast forward six hours later and 100 miles further.  I felt that rush of liquid again, but this time blood and clots were literally pumping out of my body! I was two hours away from home, my whole family was with me and the on-call doctor in my hometown wanted me to travel back to get emergency surgery.  We all packed up in the car, but I could actually feel the blood pumping out.  I knew I could not make the drive back.  I had my uncle (whom we were visiting) meet us and lead the way to the local hospital.  I was soaking through full sized towels every three minutes, with blood clots the size of oranges.  I was bleeding all over the ER so bad that the janitor had to follow me around to clean up all the blood and clots!  The ER was wonderful and the doc knew I needed immediate surgery.  He said I would not have made it back to my hometown without needing a blood transfusion - as the best case scenario and without hitting traffic! Bascially, it was an artery that was pumping the blood out. I am glad I listened to my body and decided not to chance the drive back - I probably would have bled out. The doctor that did the initial surgery prides himself on being \"the best\".  I guess he trained his staff to have this elitist attitude.  He called me the next day sounding sheepish.  I told him his PA told me I was being \"dramatic\".  She was on the other line and chimed in \"I am sorry you feel I said that\".  I told her I didn't \"feel\" she said that, she did say that.  I told her she had horrible bedside manner and I never want to deal with her again. The doctor apologized for the \"inconvenience\", and downplayed the whole event as a rare occurrence that can be easily fixed.  What an a**hole! I am alive today because I listened to my body, not a bunch of arrogant doctors and assistants.  The doctor that did my emergency surgery was fantasic - he explained everything to me and never acted arrogant.  My poor family is traumatized by the event.  But my doctor chalked it up an \"inconvenient\" event. Thanks for reading my long post! Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 13, 2011 01:05PM slinky wrote: Voraciousreader, oh my god, I just cried reading your post.  I am so sorry that happened in your life.  But on a happier note, your miracle son has proven to be a brilliant man! I am so thankful this site is available for women (and men) like us, who not only survived through cancer, but alot of other issues women have to endure.  I certainly can not talk to my co-workers about any of this and I don't want to bore my family with all my medical related issues - it sure does help to put all my thoughts and feelings in print and it is comforting to know that others have gone through similiar, if not worse, than what I have been through.",
      "MessageIndex": 44,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Aug 15, 2011 02:56PM slinky wrote: dlb, thanks for weighing in - believe me, I have been wrestling with this.  I did call the emergency surgeon and left a message for a referral where I live.  I was extremely impressed with him (not just because it was an emergency), but he really made me feel comfortable.  I hope he can connect me with someone in my area, but if not, my husband suggested driving the two hours to see him.",
      "MessageIndex": 53,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/773024",
      "Title": "Almost bled to death after a laproscopic hysterectomy! slinky slinky"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "May 6, 2011 05:49PM slinky wrote: So sorry about your diagnosis.  Big hugs to you and your family.",
      "MessageIndex": 9,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/768365",
      "Title": "Does this sound like BC? katie31 GoldenEyes"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 21, 2011 09:50AM slinky wrote: So sorry your friend is going through this.  I agree with the above posts, reach out to her and let her know you are there for her for whatever she might need.  I know that throughout this whole experience, I have been very touched when people reach out to me.  I really don't want to call people and tell them I have cancer because I feel I am burdening them with my hardship.  But when they contact me (because they heard I was sick), I really appreciate that I am in their thoughts and prayers.",
      "MessageIndex": 3,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/765094",
      "Title": "What to say to friend? iHEARTu Shirlann"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 29, 2011 03:58PM slinky wrote: My maternal aunt is a 45 year survivor!",
      "MessageIndex": 95,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Apr 26, 2011 11:12AM - edited Apr 26, 2011 11:13AM by slinky On Easter Sunday, I was at a family dinner with my auntie who is a BC survivor for over 40 years and my other auntie who is a survivor for over 30 years! And then there is me (4 month survivor) and my little sis who was just diagnosed with Hodgkins Lymphoma.  We were a group of strong women who survived!",
      "MessageIndex": 149,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 11, 2011 06:30AM slinky wrote: I forgot to mention that the nurse told me that my visitors had to leave by 6 pm - sorry to all the great nurses out there, but I got one that took an instant dislike to me and was a real biatch!  No use sending a letter since I have to have more surgeries at this hospital - and God forbid if one results in an overnight stay! And I get the same nurse, lol!",
      "MessageIndex": 379,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "May 20, 2011 02:42PM slinky wrote: beija, I am in the same quandry as you.  I need to have my ovaries removed because of positive BRCA1, but I was not sure about the uterus being removed, too.  I have decided to get it all removed to lessen my chances of cancer in this region of my body.  I also had my thyroid removed with radioactive iodine over 20 years ago and I have not had any problems with the daily pill I take. Take your time making your decision - I know it is hard, but you have to follow your gut instinct.",
      "MessageIndex": 4,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/769210",
      "Title": "have to make desicion had dbm should have my ovaries removed beija beija"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 2, 2011 12:50PM slinky wrote: Rennnasus, I can totally relate to feeling like my old self, but having to function as my new self. I am into my 4th week post BMX, and I am still being a couch potato. I have ventured out about 6 times, but have caught 2 colds. I definitely have to stop pushing myself to go out so soon after such a traumatic surgery.....my immune system is too low to be in the general population!",
      "MessageIndex": 298,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 11, 2011 04:09AM slinky wrote: I was lucky enough to have my own room after my BMX.  Problem was across the hall there were about 6 people acting like it was a giant frat party.  I complained to the nurse who told me \"oh, those are her Navy friends\".  It was 10:30 at night! Not only that, the nurse left my door and drape seperator open and all those \"friends\" were using my restroom.  This went on until 1:00 in the morning.  They were screaming, laughing, talking loud and using their phones in the hallway.  No one put a stop to it.  Wow, it still pisses me off! I was going to write a letter, but I don't think it would accomplish much, so I decided to concentrate on my recovery.",
      "MessageIndex": 377,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "May 16, 2011 08:44PM slinky wrote: When I found out I had cancer, I knew immediately that I wanted a BMX.  I did not want to have to deal with this on the other breast.  While waiting for my BMX surgery, I had the gene testing done.  One week before my surgery, my surgeon called to say I was postive for the BRCA1 gene and I made a great decision with the BMX.  My oncologist has suggested a full hysterectomy - I am interviewing gynos for this procedure. This whole journey has been about decisions...should I do chemo? radiation? It all comes down to what feels right to you and statistically what will produce the highest survival rate with the best quality of life. Enjoy your daughter's graduation from college - you deserve to pat yourself on the back for raising a child that has finished college!",
      "MessageIndex": 1,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/769062",
      "Title": "BRAC testing and PBMX rehm046 vmudrow"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 17, 2011 11:31AM slinky wrote: Annettek, You can quit smoking!  When I need to overcome something that is not healthy (such as smokiing), I visualize my lungs expanding to the fullest extent, my running around a track without feeling out of breath and me being able to taste the deliciousness of food).  Not saying it is easy to quit, but when I make my mind up, I cold-turkey and don't look back.  I am 13 years smoke-free.  What helped was I found out I was pregnant with twins...I could not ruin two little lives that have not even taken their first breath yet - I quit that day. You are strong - you've been through BC.  You can do it!",
      "MessageIndex": 6545,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 17, 2011 11:25PM slinky wrote: Annettek, wow that is scary! I know I have had some side effects with various medications in the past, but nothing this extreme.  I hope you feel better soon. ",
      "MessageIndex": 6555,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 19, 2011 10:33AM slinky wrote: Chabba, thank you for the reassurance.  I know if I don't take Tamoxifen, I will regret it if I get a reoccurence.  I guess I have read too many horror stories about the bad SE's that I never wrapped my head around the mild SE's that some people experience.  I hope I am one of the lucky ones that will have mild SE's.",
      "MessageIndex": 6578,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 11, 2011 09:21AM slinky wrote: I was dx on 1/4/11 with IDC 8mm, grade 2/3, ER+/PR+,Her-, and  found out I was BRCA1+.  I knew at biopsy I had cancer by the look on the radiologist face.  I decided on BMX right then and there.  When I went to see the onc, he thought he would be doing a lumpectomy on me (since the cancer was so small) and was surprised when I told him I wanted a BMX.  After we got the BRCA report, he told me he was glad I had made the decision to do a BMX.  I am now 11 days out from BMX with sentinel node biopsy.  Dr called and told me all cancer was removed and nodes were clear - no further treatment required.  Really? I am in disbelief that there will not be further treatment (other than removing my ovaries) as I am scared the cancer will pop up in other parts of my body.  The doctor told me the actual tumor size that they removed was 1.2cm.  I was so excited that I would not need further treatment that I forgot to ask what stage I was in.  I will ask for a report when I see him in two weeks - in the meantime, would I be considered stage 1 or 2? Thanks!",
      "MessageIndex": 6478,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 24, 2011 11:17AM slinky wrote: Annettek, I am 3 weeks post BMX with node removal.  My upper arm, underarm and shoulder blade is still numb, with some itchiness and tingling.  There is no size difference from the other arm, so I know it is not lymphdema.  My underarms are getting flabby from not excercising for over two months - this seems to be the first area that goes once excercise is stopped.  Now I feel like one of those teachers that write on a chalk board with their underarms flapping away!  Better than cancer, though!",
      "MessageIndex": 6615,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 19, 2011 04:10PM slinky wrote: Thanks for posting this question.  I am also having this procedure when I get my TE's exchanged.  My Dr. doesn't want me to start Tamoxifen until after the oomph because he does not want to overload me with symptoms related to the suppression of estrogen and whatever else is related to the ovaries being removed.  He did mention hot flashes, night sweats, dry vagina and weight gain.  He also said this is part of menopause (which I would have to go through eventually).",
      "MessageIndex": 13,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764485",
      "Title": "What to expect for oopherectomy recovery? Latte nikola"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 18, 2011 11:47PM slinky wrote: I went for my followup with my onc surgeon.  He referred me to an onc Dr.  He advised that if I did not do anything further, my survival rate is approx. 85%.  If I have my ovaries removed, rate goes up 5% and if I go on hormone therapy, rate goes up another 5%.  After reading all the SE's of the hormone therapy, I'm wondering if that 5% is worth it? Any comments would be appreciated.",
      "MessageIndex": 6575,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 3, 2011 05:11PM slinky wrote: Atjina, welcome. Your dx seemed to be the same as mine, although I am Brca so I had a BMX. I have an appt with an onc next week, so I am hoping he will be on the same treatment plan as mmy onc surgeon.",
      "MessageIndex": 6689,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 12, 2011 08:08AM slinky wrote: I am premenopausal and was dx with IDC which turned out to be 1.2cm. Er+/PR+, Her-,and BRCA1+, grade 2/3. I had a BMX 12 days ago and will take out my ovaries when I do the TE exchange (probably 4 months from now).  My doctor told me I do not need further treatment, either. He was able to get all the cancer and there was no lymph node involvement - they took 7 nodes.  Keep in mind that he does know my plan to remove my ovaries.  I am still relatively new to all of this, too, and am so dubious that no chemo is needed.  He did mention hormone therapy when I first met him.  But that was before I knew I was BRCA1+ and decided on removing my ovaries.  I am in the same boat as you - quite confused.",
      "MessageIndex": 19,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764716",
      "Title": "Does what my surgeon said sound accurate? BioAdoptMom3 BioAdoptMom3"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 11, 2011 01:08PM slinky wrote: Raincitygirl, thanks for your response.  The oncotype will be on my list of questions to him.",
      "MessageIndex": 6481,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 6, 2011 12:39PM slinky wrote: Annettek, I'm so proud of you! I took the cold turkey route when I quit smoking.  The first week is the hardest because old habits are hard to break.  Just keep envisioning healthier lungs, pinker gums and a stronger sense in taste (or whatever will keep you from smoking).  Keep it up!",
      "MessageIndex": 6731,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 3, 2011 03:01PM slinky wrote: Hi Cling, I am into my 3rd day of my bilateral mast with expanders and sentinel node removal.  I had set up my room with an adjustable bed before my surgery.  I did (and still have) alot of help - people to drive my kids to and from school, etc.  I can't raise my arm too high, or put my arms too far behind my back to raise the pillows that slip down.  My husband is home and he is all the help I need even though there are so many others that want to help. It helps to have some extra hands and legs to get water, make something to eat, answer the phone, feed the animals, etc. I need some quiet time without having to look my best so I prefer not to entertain people right now.  I told my friends and family to call or e-mail instead of visiting - this way I can sleep when I want to (which seems very difficult). I was able to move around the same day as surgery - I refused to use a bedpan! I can easily move around right now and wish I could raise my arms and wash my hair.  Everyone is different, one person around is enough help for me.  Wishing you all the best on your surgery - it really isn't that bad!",
      "MessageIndex": 443,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 4, 2011 10:43PM slinky wrote: Renmars21, thats great news! I also just got the great news that all the cancer was removed and it had not spread to any of my lymph nodes.  I am so happy I could cry!  I have three months left to fill, then I will have exchange surgery and have my ovaries removed, too.  Wow, I feel so blessed right now!",
      "MessageIndex": 461,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 23, 2011 05:25PM - edited Feb 23, 2011 05:26PM by slinky I had my BMX 3 weeks ago.  I have been taking it very easy and not doing much of anything, except reading and watching TV.  I can't get a fill yet, because I have a wound that is refusing to heal!  I went off pain meds after 7 days, because I know what it is like to get hooked on pain meds and I never want to travel that route again.  My PS was surprised and asked if I was taking tylenol or advil.  I said yes, two every 6-8 hours.  I am now pain-free, but still have alot of discomfort and numbing.  I also get very tired after 2-3 hours out.  Is it because I am used to lounging on my bed, or because I am still healing and my body is telling me to rest?   I can't help but to feel that I am turning into a lazy person or too cautious about over-doing it.  What ever \"IT\" is.",
      "MessageIndex": 600,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 2, 2011 01:22PM slinky wrote: SuperSally, Thank you lifting the guilt I have for spending so much time in bed. I guess I am trying too hard to show my family and myself that this isn't all that bad, but I am just fooling myself. I am trying very hard to think about myself and not feel guilty about wallowing in bed from sunrise to sunset.",
      "MessageIndex": 633,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Mar 1, 2011 12:12PM slinky wrote: I am into my 4th week post BMX.  My cancer side is still slowly healing from a large wound.  I have caught two colds in 4 weeks - last one is subsiding to an occasional cough and tickle in my chest. Am I the only one still in bed so long after a BMX? Am I normal, or just lazy?",
      "MessageIndex": 626,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Jan 30, 2011 04:14PM slinky wrote: I am having a bilateral mastecomy with expanders and some lymph nodes removed.  All this tomorrow! I can't wait to get this cancer out of my body - every ache, pain and cough I have makes me think it spread to my lungs, legs, etc....my imagination is running wild. I keep wondering how long I will live - if this cancer has shortened my lifespan.  I guess this is normal thinking for someone with cancer?",
      "MessageIndex": 382,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 23, 2011 07:30PM slinky wrote: dmho, I am so sorry you are experiencing complications.  I could barely stand one night in the hospital, much less 8 days.  Sleeping is a form of healing, so I say sleep as much as you can.  Six months is a ways down the road, so you do have time to think about TE's again.  In the meantime, take good care of yourself. SuebeeBC, we seem to be on the same road to recovery - SLOW! My wound was called a partial thickness wound.  Initially it was not looking good, but over the last two weeks, it is now red in color with a dime size yellow center.  I am hoping the red is from the blood circulating really well (and not an infection).  I know two weeks ago, it was starting to get pale pink and the doctor said that was a good sign of blood circulation.  He then drained the yellow area, which was much bigger then.  I will see him at the end of the week and hope for good news.  I won't even dare to exercise right now, even though some days I think I can.  Just some light walking around the mall has been great for my legs for now!",
      "MessageIndex": 603,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 1, 2011 08:55PM slinky wrote: I had my bilateral mx with expanders and seven nodes removed - this happened  yesterday and I just got home a few hours ago.  Doctors were able to spare the nipple on my good side and grafted a new nipple out of my old nipple on the left (after coring it out).  Expanders filled to 180cc's. I feel like I have been hit by a truck!  I am so happy to be free of the cancer - of course, the final path results won't be in until next week, but an inital dissection of one node showed free of cancer.  I am hoping the results will be negative and I am so thankful that this is not as hard as I imagined it would be.  It hurts like heck, but I am cancer free!",
      "MessageIndex": 420,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    },
    {
      "AuthorID": "slinky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/120544/profile",
      "Content": "Feb 4, 2011 03:46PM slinky wrote: Great to see that everyone is slowly mending! I am on the 4th day of bilat with TE's.  Today my ribs feel so sore.  I can't laugh or cough or move without them hurting - so I had to up the pain meds.  I showered my lower half of body and thought I was up to going to dinner, but I am a little cranky from not being able to sleep through the night.  I am up every hour on the hour.  I was prescribed sleeping pills, but they only work for two hours of straight sleep. I am trying to be normal and cooked breakfast for my kids two days in a row - they got really scared looking at the drains.  I told them it is just blood mixed with the liquids used during surgery.  I can move my arm that had the sentinel biospy only to shoulder height.  The itching under my dressings is driving me crazy!  I have been using a knitting needle to scratch under my dressings where the tape is. I will be unveiled on Monday when my drains come out - I did sneak peek and saw that my breasts in the middle look all sunken in.  At least they were able to keep one nip and areola!  Take care everyone....love, Slinky",
      "MessageIndex": 454,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761678",
      "Title": "January 2011 Mastectomy ibcmets SuebeeBC"
    }
  ]
}