{
  "AuthorID": "slortiz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
  "Posts": [
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Jul 3, 2008 04:10PM slortiz wrote: Traci, You might try following/posting to \"Anyone Just Taxotere and Cytoxin\"",
      "MessageIndex": 3,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708409",
      "Title": "taxotere eileen1 kmenurse"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Jun 24, 2008 07:27PM slortiz wrote: Thanks PinkVelvet. I missed noticing your thread. Is there a way for me to fix that and merge my stuff into yours. No point in having two separate groups going. I'm new to this and don't know how to fix that kind of mistake. Sorry!",
      "MessageIndex": 6,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707928",
      "Title": "Starting Chemo in July 08? slortiz slortiz"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Jun 24, 2008 10:11PM slortiz wrote: Please note that this thread has merged with another: Please go to \"Anyone Starting DD AC July 08\" if you are starting any kind of chemo in July 08. Thanks,",
      "MessageIndex": 9,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707928",
      "Title": "Starting Chemo in July 08? slortiz slortiz"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Jun 24, 2008 05:30PM slortiz wrote: Carolyn, Thanks for replying and I hope we can help each other get through this. Even though it is scary, it is important to learn as much as you can about your cancer, and why the oncologists are recommending a specific treatment. They may feel you need the port because the type of chemo you will receive is best delivered that way, or they may recommend it because your veins are too small or some other reason. My friend had a port and liked it because it meant she did not have to get stuck in the hand as often for IVs and blood tests. Don't be afraid to ask for them to use a topical anesthetic and don't be afraid to ask for anything that might help you. Regards,",
      "MessageIndex": 3,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707928",
      "Title": "Starting Chemo in July 08? slortiz slortiz"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "slortiz wrote: Hi! I started this thread before I realized there already is a thread on this topic. Please go to \"Anyone Starting DD AC July 08\" instead. It is for any and all starting chemo of any kind this July. Thanks! Sandra and 66! Dx 3/6/2008, IDC, 3cm, Stage IIA, Grade 3, 0/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707928",
      "Title": "Starting Chemo in July 08? slortiz slortiz"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Apr 23, 2009 03:41PM slortiz wrote: Aha! I had to lurk on this topic in order to see your recent picture, Otter. You look good and so does Jean. We all seem to have the same hairdo! Regards, Sandra (finished chemo in August)",
      "MessageIndex": 5958,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "slortiz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68644/profile",
      "Content": "Jun 24, 2008 05:54PM slortiz wrote: Hi Otter:  I have been reading the Taxotere and Cytoxan thread, and, frankly, deriving small comfort from it. That's where I got the idea that my docs are being overly Pollyannaish--like, duh. I understand their motives in down-playing the significance of the SEs, but it really irks me. For instance, they are telling me the anti-nausea drugs should solve that problem entirely (probably pretty much true) and that my hair is unlikely to fall out (probably not true at all!!) They haven't even begun to address some of the other issues, nor to discuss the Neulasta, other than to say I will be getting it, and giving me the standard handout. I am glad to hear you got through the four treatments without any problems with the veins.  This has been an ongoing issue with me for the past few months. They seem to have so much trouble drawing blood on me now, though IVs are a little less problematic. They hope to avoid the port thing, but it may prove necessary in my case. We'll see. I'm trying to get up my courage, and drink a few more glasses of water before going to get yet another lab drawn this afternoon. Maybe it can wait till tomorrow? I was pretty much a wreck yesterday after labs for the research study, and PET and CAT scans too. That is vile stuff they make you drink, and who knows beforehand if they're violently allergic to the iodine in the IV contrast medium? What kind of thing is that to ask someone? Sheesh!!!  Whine, whine",
      "MessageIndex": 4,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707928",
      "Title": "Starting Chemo in July 08? slortiz slortiz"
    }
  ]
}