{
  "AuthorID": "slowloris",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
  "Posts": [
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 5, 2014 09:52AM - edited Apr 5, 2014 09:52AM by slowloris Wonderful news Lotusblossom.!!!! Would you please copy your post to the Calling all Triple Neg thread ? There are some newbies who are really emotional now and I think if they see that there is always hope and some tx do work, it would put their minds at ease. I am soooo happy for you!! Praying for many years of dating NED. I think you should marry him! Lori",
      "MessageIndex": 10,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819883",
      "Title": "Finally dating NED! lotusblossom aic"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jan 16, 2014 09:35PM slowloris wrote: I know this is a morbid question, but I just can't get it out of my head. What is the longest that anyone knows of someone surviving with stage IV?  I want to prepare many future notes and cards for my children to read, but I don't want to go through the emotional turmoil quite yet.I may not feel as pressured if I know the possibility exists for a longer life.   Thanks",
      "MessageIndex": 537,
      "PostDate": "16/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Feb 2, 2014 12:06AM slowloris wrote: Kimmie and Surfdreams, I have had 2 surgeries, both bmx. 1st was skin sparing with TE's. 5 wks after rads were done, tumors came up in my skin. 2nd was a more complete mx with flap recon . 4 wks after surgery, tumors came up again between my breast and on the unaffected breast skin. When I spoke to the MO about seeing the BS again, she said no. Her exact words were \"It's like whack a mole... If you take them out, they will pop up somewhere else\". Apparently, my cancer likes to set up shop in the skin on or near the breast. It's better to treat it there, keep it there, and try to prevent it from going to an organ. When I talked to my niece who is a veterinarian, she agreed. SOME cancers will stay where they are for a long time, and if their preferred spot is no longer available, it forces them to go somewhere else. I never actually read any papers on this, but my experience shows that it can be true for some of us.",
      "MessageIndex": 553,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 2, 2014 11:35AM slowloris wrote: Good morning all! doing my taxes, thought I's take a break and pop in. I had my brain MRI and PET scan on Friday, and I see my MO this Friday, so I'm praying the results show no progression.  Cat, as Lost said, nadir is the low point in your blood counts. It's when I felt my worse physically,  usually hitting 3-5 days after treatment. On those days, especially with AC/T, I'd stay in bed most of the day.Current tx not so bad, just really tired on those days, but still functional. Bluebird, When I see my MO on friday I am also going to ask about proton therapy. I get my tx at Penn's Perelman Center. They don't want to do surgery on my chest nodules, so I'll ask to see if the proton therapy can be used, or , God forbid, I need something done to my brain. Lost, When I joined the boards, I felt like all I had were questions. Now, I'm happy to share some answers with my experiences. As for Vit D, my pcp started me on 1000mg/day before I was dx with bc. Just this month , I've increased it to 2000 only because the pharmacy was out of the 1000. I think the 1000 must have been good because my blood tests were good. But I've also increased my intake of dark green vegs and also make sure I sit in the sun for atleast 15 minutes a day. Now that it's getting warmer, my sunshine should increase. Now, as far as the chemo goes, I'll give you some insight. My 2nd tx of chemo was Xeloda. 2 weeks on, 1 off. It kept me stable from May til Dec. It started out fine, but I got cumulative se's as time went on. I got pretty bad hand/foot syndrome. Not neuropathy like taxol, put pain, redness, and skin peeling. My hands felt stiff and it was hard to do fine motor skills, like counting money or separating papers. I was on a pretty high dose though. There's a thread called \"all about Xeloda\" that will help you. My current tx is Carboplatin and Gemzar. As far as se's,very slight swollen feeling in fingers and toes. My nadir is not too bad, just tired 3-5 days after, and just very slight nausea feeling. I only take my ativan and compazine for 2-3 after tx. The biggest problem I had so far was the drop in platelets , that I had to skip dosages until the count came back up. We've since changed from 2 wks on 1 off, to every other week so I can get a shot of neulasta. My MO is already talking about maybe changing to something else. We'll see how my PET looks first. And There is a Carbo/Gemzar thread also. In the research I found, some MOs prefer cisplatin over carbo. It makes you more nauseous, but the platelets don't drop so low. It's worth it to ask about. Good luck with your regime.. Keep us informed on how you do. Lori",
      "MessageIndex": 661,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 5, 2014 10:29PM slowloris wrote: Well, we're playing the good news/ bad news game again. My brain MRI Is clear, thank God. PET though, labeled as showing progression. There are no organ mets, but possible bone mets in clavicle, although it could be a false positive from the neulasta shots. Some of the soft tissue nodules have shrunk, but others have popped up. And now there are more deeper level lymph nodes involved, the most reactive showing a suv of 20. So, I am now on Halaven, and have started paperwork to see if I can start a trial for PD-L1. It's an immunotherapy tx. If my tumors have the right biology, my MO thinks I would be a good candidate. Fingers crossed, since I seem to be immune to the current chemo's, I feel as if immunotherapy is my only hope.   wishing you all a great Sunday. Enjoy. Lori",
      "MessageIndex": 667,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 28, 2014 05:48PM slowloris wrote: Sherbab, I just got refused for one trial, PD-L1, because I wasn't a match. My MO has 2 more trials she thinks I would match for, one is taxol and a trial drug combo  - I wonder if it is the same as yours. Because we had to wait to see if I was a match, and I have a high grade cancer, she started me on Halaven. (she didn't want to wait and have me on nothing). After being on Carbo/Gemzar and noticing no shrinkage, I see shrinkage after just 2-3 tx with the Halaven. My ANC levels have dropped though, so I am alternating between nuepogen and nuelasta. If and when Halaven stops working, we will revisit the trials again, but for now, we're not going to stop if this is working. Other than fatigue, I too have not had bad se's. I have noticed handfulls of hair coming out when I shampoo, so I guess I'm on my way to losing it again. Maybe that's how I know it's working.... The drugs that did nothing to my hair also did nothing for the tumors. I hope the Dr.s can determine if yours is working in a short period of time. Keep us posted on your progress.  (((hugs)))",
      "MessageIndex": 714,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Mar 30, 2014 08:42PM slowloris wrote: Catwhisperer, I had DD AC/T with my initial dx. AC was fine, had nadir 3-4 days after infusion, just tired like the flu. The first dose of T was horrible for me. I did not have an allergy, but SE's were severe. I had SEVERE nerve pain in both legs from my waste down. I have a very high pain tolerance, but I was actually crying in tears for an entire weekend. It felt better to punch my legs than to have the shooting electrical impulses coursing through my legs.So they switched me to Taxotere for the last 3 treatments. It was better, but still no picnic. I got neuropathy pretty bad and some intestinal problems, pretty bad nadir with extreme tiredness. And don't even forget about what it did to my toenails!! I'm sorry you have these se's. My MO is also talking about putting me in a trial with a new drug combined with taxol. When I mentioned my first experience (different MO), she said the same as you.... probably won't be as bad since it's not dose dense. My thinking is, if I can handle the pain, I want them to do whatever they think will prolong my life, so I can be with my girls until they reach adulthood. I can work through most pain, and the joy I get from being here for my kids outweighs almost any se's I may get. Aimee, Let us know how you 2nd opinion goes. Lori",
      "MessageIndex": 644,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 25, 2014 03:17PM - edited Apr 25, 2014 03:19PM by slowloris Springwatch and Allison, I 'm so sorry to hear you are both going through a tough time. I, too, cannot seem to find the right tx plan. I've just started Halaven (1st dose of 2nd round today) and so far I can't tell if this one is working.Although my progression is relatively slow (?) it still is progressing non the less. I often wonder how long it will take until it renders me invalid , or worse. And just when I start to throw myself a pitty party, my dear daughters get me busy again, get me laughing, give me no sympathy, and can you believe this....   They actually want dinner and clean laundry!!! I guess I am saying, I can let the fear paralyze me or I can make a conscious effort to enjoy life and push the fear to the back of my mind. In practice, it's tough to do, but I try every day to make the most of it. Give yourself time to fear, mourn, rant, whatever, but then force yourself to do something that you used to enjoy. I actually went bike riding to the river park a week ago with my husband. 7AM and it was so peaceful and beautiful. I would have never done it if he hadn't pushed me to, and I'm glad he did. So please, remember you are loved, we support you in your times of need, and we encourage you to find your inner peace. I'll be praying that that right tx is found for the both of you. BTW, I had a trans flap on both sides. Recovery was very hard, but I am so much more comfortable than when I had TE's in place. At this point though, I really couldn't care if i was completely flat. Yes, it's gotten to that point emotionally. Just don't care. Todays appt left me a little deflated. I found out that I am not eligible for the PD-L1 trial I signed up for. So, we have 2 others we may look at if the Halaven does not work. Carpe, Congratulations on the encouraging news.  Hawaii sounds great!",
      "MessageIndex": 699,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Apr 26, 2014 12:35PM - edited Apr 26, 2014 12:38PM by slowloris Allison, wow! French Polynesia??!! That is definitely on my bucket list. Financially, we prob can't do it this year bc I want to spend a family vacation with my 2 girls also. It will prob be the last summer family vaca because my oldest will graduate high school next year and be going off to college. So we are still contemplating where to go. Maybe Punta Cana. We live on the east coast, so airfare won't be too expensive there. Of course my girls want to go to the furthest place away.... Australia!! I don't think so, unless they don't want a college education! I was excluded from the trial because I am tn. Even though my MO knew this, she tested anyway hoping i had atleast a little ER+. But no, nothing! So unless they open the parameters a little further to include tnbc, I have to look for another. I thought when I read the parameters initially, tnbc was included, perhaps they filled up their quota for it. My nurse navigator said everyone rushes to get into trials when they first open, especially tn's. everyone, try to have a wonderful weekend. :) OH, almost forgot to ask. Has anyone else been on Halaven. If so, after treatment, did any skin nodules start to itch and ache when touched? I can't believe how itchy they are today, but there is no rash, and it is just on the nodules themself, not surrounding skin. My NP said some people feel pain and they consider that tumor death. Hopefully, that means its working. Anyone else?",
      "MessageIndex": 702,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jun 20, 2014 08:57PM slowloris wrote: Lindsay, This is a new trial, phase I, so I am one of the first people to get this drug. Its only been tested in the lab with mice. I think I had to have a solid, measurable tumor. TNbc was one of the parameters they were accepting.. Other than having numerous tumors and nodules in my skin and lymph nodes, I am very healthy. You would never know I had cancer from looking at me. Because no standard treatment has stopped progression, (although it has slowed it), I have been diligent in researching clinical trials. I constantly bring it to my MOs attention, and she agrees that I shouldn't wait until I have organ involvement. I should do it now while I'm relatively healthy. I am being treated at University of Pennsylvania's Abramson Cancer Center, where much research is being done. I forget where my trial initially began, but Penn is one of the sites that is collecting data. If you go on   clinicaltrials.gov and type in CB 839 in the search box, it will tell you more. If you want to see if there are any trials you may want, search for specific criteria that pertains to you, and any trials you may be able to get into will come up. There, they give you all the parameters that must be met and what places are doing that trial. Brenda, I have never heard of a liquid biopsy for bc before. Is it new? What info would it give that a regular biopsy wouldn't? Is it just indicative of quantity of disease as opposed to quality of disease? I know they do it for blood cancers, but had not heard of it for solid tumors. I'm glad that the amount of disease has shrunk in your case. Keep up the good work, and always be positive. Everyday, new therapies are being developed, and sooner or later, one that works for each of us will be found. Take care, and have a good weekend.",
      "MessageIndex": 778,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jun 19, 2014 11:12PM slowloris wrote: Hi everyone. Its been a while since I've checked the boards. So here's whats going on: I have started 3 clinical trials. #1. A new drug called CB 839, a glutaminase inhibitor. I've been on it for 2 wks, and so far cannot tell if its working or not. I had to be off chemo for 4 wks before, and the wk before and 1st wk of the new drug, 4-5 more little nodules came up on my chest and breast skin. Wk 2 had no new nodules, but I really haven't noticed any shrinkage yet either. I get 8 hrs of blood draws, every hr, to test the pharmokenetics of the drug, every Wed. So we will give it a few more wks to see if it's helping at all. #2. METAMORPH study(at Univ. of Penn) to identify and study tumor markers in the blood. This may help future patients quantify the amount of growth or shrinkage of the cancer. I won't necessarily have access to these findings, if new markers are found. (They're looking for add'l markers, Like the CA 15 and CA 27 ones) #3. COMET study (at Penn). It's a genomic testing and education study. A panel of 27 gene tests for mutations was performed at Penn's Center for Personalized Diagnostics (CPD). I also was given an education session to discuss what it means to have this test, and what the results could indicate. I was then given a questionaire to answer. I guess they want to know if the education session is worth giving to people along with the gene panel, or if they should just do the tests without education. My tests showed 2 mutations, one on the TP53 gene, and one on the RB1 gene. My MO needs to confer with the tumor panel and geneticists and physiologists to interpret these findings, and then she and I will discuss what it all means. She did mention that with the RB1 mutation, The trial phases of a drug targeting that mutation is almost finished, and it's possible a new drug will be on the market in 1-1 1/2 yrs. So I have been very busy with all of the pretrial tests (CT, PET, Echo, biopsy, etc.) and now with the full days of blood draws, not to mention all of the end of school year things going on with my children. In 2 wks, we go on vacation to Punta Cana, and I am SO ready!! I hope everyone is stable or doing better. I think of you all often. Lori",
      "MessageIndex": 774,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jan 18, 2014 07:32PM slowloris wrote: Brenda, No I am not stage IV YET. In 18 mo.s, I've had the cancer pop up 3 x. I had a PET on Wed, Friday confirmed I have numerous nodules subcutaneously over sternum with possible deep level node involvement. I started my 3rd treatment of chemo, this time gemzar/carbo combo. I can count atleast 9 different lumps, with 2 now on left breast. First recurrence was only 5 wks after I was done initial tx. This recurrence was only 6 wks after 2nd mx.  So , no, although I'm not there yet, I do believe it will happen someday. My cancer is so high grade, it replicates so fast. I'm not pessimistic, just more pragmatic. My prognosis for life expectancy was not given (nor asked), but I was told I would probably be on some form of chemo for the rest of my life, however long that is. I am not pessimistic by any means, I know that a vaccine is being worked on at this time, as well as numerous trials for tnbc. I'm always hopeful for better treatment as well as a cure. I guess I asked that question bc I developed a slight cough and I thought perhaps it had traveled to my lungs. Thank God the scan proved otherwise. Thanks for your answer. I hope you are well.",
      "MessageIndex": 539,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jan 28, 2014 05:48PM slowloris wrote: So sorry to hear of debbiej. I did not know her, but i grieve just the same. Everytime I hear of one of us passing, a little bit of my heart seems to be cut away.  May God rest her soul. Carolben, thanks for your well wishes. So far, 2 tx with Carbo/genzar  down. I can already feel it working, as the swelling in my hand has gone down since I've been on it. My \"bitchy\" tnbc likes to set up shop in the skin and lymph system, so now that I can see less swelling, I know the meds are targeting those little suckers in my skin. Praying for a long run on this . time to make dinner. The kids don't let me think I'm sick in any way. They still want their dinner! I thank God for my family every day.",
      "MessageIndex": 543,
      "PostDate": "28/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Jan 29, 2014 10:25PM slowloris wrote: Mamapeg,  so sorry to hear of your brain mets. I don't know anything about it, but I'm sure there are sisters here that can advise you. How did they find this out? Did you have symptoms, or just request a head scan? Praying for  a stop of spread and that WBR shrinks anything thats there down to nothing. God bless.  (((hugs)))",
      "MessageIndex": 547,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Mar 28, 2014 09:14PM slowloris wrote: Aimee, welcome to this board. Sorry that you are here, but glad there is a place for you to get info and support. I'm a little confused with what you posted. You say you have nodules in your back. Are they subcutaneous, in the muscle, or in the bones? Did any organs show any sign of involvement? I don't understand why your MO would say that they can't extend your life with chemo. To me, that doesn't make sense. I have numerous nodules in my skin and chest wall. I am currently on chemo, and with 2 opinions, both MO's absolutely said that chemo could extend my life. We just have to balance out QOL with tx. So Far I've been on 3 different cocktails, and I can say that the 1st was the worse. My recurrence tx have been very tolerable. Although the dr's say I won't be \"cured\", they are hopeful for an extended life expectancy due to the chemo, and we are also looking into clinical trials.  My stage is still technically IIIC even though I have skin and chest wall metastases. I was told stage IV was only if a visceral organ or bones were involved. This Monday, I will have a PET and brain MRI. Hopefully, it will show no organ involvement, although I know more nodules have shown up in my chest. I also was getting headaches, thus the MRI, but they could have been due to stress or soreness from my neck nodes. Aimee, please get a second opinion. I want you to be able to get the best treatment possible. Let us know how you make out. ((hugs))",
      "MessageIndex": 640,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "slowloris",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178961/profile",
      "Content": "Aug 20, 2013 07:41PM slowloris wrote: I have a PET scheduled for tomorrrow also.  Weird anxiety,like boarding a roller coaster. You want it done, yet afraid of what may happen. Keeps us posted, and i'll do the same. hopefully my recurrence is still local/regional, and not mets.",
      "MessageIndex": 9,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809627",
      "Title": "PET scan tomorrow brandall meima-Bev"
    }
  ]
}