{
  "AuthorID": "smackint",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175754/profile",
  "Posts": [
    {
      "AuthorID": "smackint",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175754/profile",
      "Content": "May 14, 2016 09:37AM smackint wrote: I am so glad I read your post. I have the same thing. Only my lumpectomy was almost 8 years ago. What did you find out. My itchy rash and soreness started last October 2015. Punch biopsy said spongitic dermatitis or bug bite. Yeah right only on the left side? MRI, tomo, and ultrasound shows nothing. Let me know what you found out.",
      "MessageIndex": 10,
      "PostDate": "14/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/842025",
      "Title": "Radiation recall after 4 1/2 years? Worried about IBC. rn4babies KBeee"
    },
    {
      "AuthorID": "smackint",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/175754/profile",
      "Content": "May 14, 2016 08:05AM smackint wrote: I had DCIS in 2007 and everything was fine. Last October 2015 I developed a itchy rash, pain behind the nipple and where the lumpectomy was. My breast feels bruised most of the time and is very uncomfortable. I had a MRI in December 2015 showing nothing except I have dense breasts. In December 2015 I had a punch biopsy that came back spongiotic dermatitis. Breast doctor sent me to a dermatologist. He prescribed Triamcinolone Ointment to use for 30 days. Fine. I used it once a day for 30 days and the skin started to lose the pink rash. 2 weeks later it came back. Since then I have had a Tomo and an ultrasound, showing nothing except I have dense breasts again. I am at the point I don't know where to turn now. Do I just live with this knowing it is not right or maybe someone knows another avenue I can travel to find out what this is. Apparently the pathologist who said it was spongiotic dermatitis or bug bite was an idiot. Do I go back to the dermatologist again and have him do a punch biopsy or return to my breast doctor and see what she says. I am beginning to lose my faith in doctors. Help!",
      "MessageIndex": 3,
      "PostDate": "14/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/843648",
      "Title": "IBC fear, biopsy spongiotic dermatitis B126 smackint"
    }
  ]
}