{
  "AuthorID": "smileygirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159219/profile",
  "Posts": [
    {
      "AuthorID": "smileygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159219/profile",
      "Content": "Aug 23, 2012 05:53PM smileygirl wrote: Thank you for your replies! I think I will get a second opinion. I was worried I was being a little over zealous about the \"unknown spots.\" And to Denise, you are a true inspiration! I loved your blog! Thank you for a little peak inside of your life and fight with cancer... I'll say a little prayer for you tonight and keep strong :)",
      "MessageIndex": 4,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792450",
      "Title": "looking for a little advise... smileygirl smileygirl"
    },
    {
      "AuthorID": "smileygirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159219/profile",
      "Content": "smileygirl wrote: I just returned home from a second mammogram and sonogram of my left breast. I received a call today about my suspicious mammogram and the breast center asked me to come in for further testing. My first mammogram showed to asymmetrical spots in my left breast. One 7mm the other 5x7mm. After the special mammo the radiologist sent me in for a sonogram. The radiologist said the testing revealed 1 cyst and she was not worried about that but there were 3 other spots she did not know what they were. She said I should come back in 6 months to see if they grow or not. My course of plan is to have mammo done every 6 months for two years. If they show growth then I will receive a biopsy. She said it could just be my natural breast tissue. My question is... Should I get a second opinion? Or just wait six months? I am 36 years old and had a hysterectomy 2 years ago. I am no longer taking hormone replacement. Sorry so long winded :) Thanks for reading and for your thoughts! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792450",
      "Title": "looking for a little advise... smileygirl smileygirl"
    }
  ]
}