{
  "AuthorID": "smiley2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
  "Posts": [
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: HI, I am wondering if anyone is using a COX2 inhibitor as part of your treatment?  I just found a study on my computer that I saved but havent taken to my oncologist yet talking about using these to help treat bone mets. Maybe it is supposed to be for before you get to stage 4?  But it talks about these inhibitors as being anti-inflammatory and I am wondering if it would help to prevent any further bone mets? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809977",
      "Title": "Is anyone using a COX2 inhibitor (like Celebrex, etc)? smiley2 smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Are any of you going through social security review right now for disability? It has been a couple of years since they approved me and the letter said they follow up every couple of years. In the paperwork it asked for three people that they can call to talk about my diagnosis. You couldn't put down your doctors though. I am just curious if anyone is going through this paperwork and if they called your family/friends and what do they ask them?! \"Is she dead yet?!\" I feel like they would probably prefer me to be that way. The hardest thing about living with stage 4 cancer is they don't get the depths of our pain, fatigue, depression, etc. all from this stupid disease. And then I have to deal with all this paperwork too? The stress of it all is too much some days! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858454",
      "Title": "Social Security Disability Review smiley2 Micmel"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: So what companies actually spend money on reseraching new drugs for Stage 4 breast cancer? We know it isn't Komen!!! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797779",
      "Title": "Stage 4 BC research? Who really puts money into it? smiley2 cheryl1946"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Sep 11, 2017 03:16PM smiley2 wrote: I agree Zillsnotforme!! We should be pretty cut and dry! It is not like we picked up a box, hurt our back and filed disability! I know what you mean about chasing the money! I usually get one call a month from a debt collector for my medical bills! Ugugh!",
      "MessageIndex": 4,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858454",
      "Title": "Social Security Disability Review smiley2 Micmel"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Sep 11, 2017 03:19PM smiley2 wrote: Thanks for your feedback Micmel and Lauriesh. I don't think there is a social worker at my oncologists office. A friend told me to get a lawyer that specializes in disability if there are any issues. I hope I don't need to go that route! Talk about more stress!",
      "MessageIndex": 5,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/858454",
      "Title": "Social Security Disability Review smiley2 Micmel"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Apr 12, 2012 04:36PM smiley2 wrote: Where did the cancer return?  Almost 5 years is a good run! ",
      "MessageIndex": 20,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785583",
      "Title": "For the Hormone Positive Gals smiley2 kaycancer"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Hi, I am wondering how many of you had your ovaries removed after 1st diagnosis and inital treatment only to have the cancer return and thus....now stage 4?  I choose not to have my ovaries removed after initial diagnosis.  I was highly ER/PR +++.    I am now considering having my ovaries removed just to get off of taking Zoladex and getting off at least one drug.  But is that surgery worth it at this point?  We can't change the past but I guess the time to have done this was when I was still stage 2! Just curious what others experience has been? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785583",
      "Title": "For the Hormone Positive Gals smiley2 kaycancer"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Apr 10, 2012 04:57PM smiley2 wrote: So aren't we all estrogen depleted now even through medicine?  My vagina has aged 20+ years (even my gyno told me in last year's pap/exam that my vagina looked like that of an old lady!  That was depressing to hear!) and I have no sex drive.  So when you have your ovaries removed...what kind of side effects are you guys talking about? ",
      "MessageIndex": 7,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785583",
      "Title": "For the Hormone Positive Gals smiley2 kaycancer"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Aug 18, 2016 07:17PM smiley2 wrote: Stage 2 invasive lobular-2005 Stage 4 mets to hip-2008",
      "MessageIndex": 195,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Hi amazing and strong ladies, First time to this discussion board.  I have stage 4 BC so they put me on Zometa, Zolodex and Femara.  I have been having blood in my urine and edema and now I feel like my kidneys kind of hurt or there is a dull discomfort..  My oncologist told me that these weren't side effects to Femara.  Then my husband and I look up on internet and there it says that Zoladex and Femara cause blood in urine and edema!  I am just curious if ANYONE has had this side effect?  Scan in January was stable, went and had ultrasount/sonogram at Gyno's office and that came back ok and normal.  WTF is going on?!  Obviously one of these drugs is really doing some damage or the mets has spread but it isn't showing up on any scans yet?  My mind is going crazy and I am so annoyed and pissed at how I feel like WE are the ones that are the doctors half the time!  Do they ever listen?!  There wasn't even any mention of \"maybe we should take you off this drug for a little bit and see if that helps?\"  Any insight or advice would be much appreciated! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785195",
      "Title": "Femara, Zolodex or Zometa Side effects??? smiley2 Naniam"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Apr 19, 2012 03:19PM smiley2 wrote: I am not done with treatment....\"almostdone\" is almost done!! =) And almostdone...glad to hear you are finishing it through to the end.  Don't leave yourself with any \"what if's\".  It is only a few more to go!  You can do it!  And then be done with it!  Enjoy your party!  You deserve it!",
      "MessageIndex": 6,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785195",
      "Title": "Femara, Zolodex or Zometa Side effects??? smiley2 Naniam"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 13, 2012 08:15PM smiley2 wrote: The breast that produced less milk and less perferable to baby was the breast with cancer!",
      "MessageIndex": 11,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789018",
      "Title": "Odd Question about Breastfeeding blainejennifer smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Are you taking Zoladex once a month or does your doctor have you on every other month or every three months?  I swear these drugs are taking a toll on my kidneys even though my numbers come up \"normal\" in the lab work.  I was curious what duration everyone else is doing and have you noticed in general your kidneys feeling like all these meds are just too much at times!? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804667",
      "Title": "zoladex schedule smiley2 barsco1963"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "May 14, 2013 04:50PM smiley2 wrote: Thx ladies!  I meet with my onc next week and I think I am going to have him test my levels again.  I have been thinking of taking the ovaries out.  Unfortunately, I can't have the laproscopic surgery b/c i have mesh from a belly button hernia from pregnancy.  So my gyno said we would have to do the old way which is essentially making a cut like a c secion and 2 week down time.  I really wish I could do the laproscopic!  SOunds like that has been an easy surgery for most ladies!",
      "MessageIndex": 4,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/804667",
      "Title": "zoladex schedule smiley2 barsco1963"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: My husband asked me today if once you go off a drug that isn't working anymore...can you go back on it at a later date?  I told him the oncologists don't usually do that.  There is a line up of drugs (usually  start with Tamozifen, Femara, Aromasin, Arimidex, Faslodex...what else am I missing?) and then if those don't work....you go on to chemo.  Do I have this right?  Anyway, it made me think....has anyone gone back to Tamoxifen or Femara after you have done the rest of the drugs and no chemo?  You wonder if that time off the drug (assuming a few years)...would your body take it in again and would it/could it be effective again?  Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789290",
      "Title": "Anti Hormonals...can you go back on them at a later date? smiley2 JillThut"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 18, 2012 09:52AM smiley2 wrote: Couldn't they do scans before 3 months?  What is it with this 3 month time line?  I know insurance has paid before the 3 month mark for a scan but I don't know if that is b/c of my staging?",
      "MessageIndex": 2,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789290",
      "Title": "Anti Hormonals...can you go back on them at a later date? smiley2 JillThut"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 7, 2012 06:33AM smiley2 wrote: I guess that in pathology they could count out 40-60 cells?  \"very mild\" invasiveness I guess.  But it is still invasive!",
      "MessageIndex": 2,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 18, 2012 08:52AM smiley2 wrote: I maybe didn't communicate it effictively in my first post but what I was also trying to say is that her portrayal of \"I just want to get on with my life, have a baby and live happily ever after\" is like putting your head in the sand after a cancer diagnosis.  Being stage 4 now but stage 2 earlier...what I have learned is you can't hide your head in the sand and you really do need to be PROACTIVE and not be in denial.  She is probably doing juices, exercise, etc now.  She certainly doesn't need to lose any weight. But I have seen and known many gals that are stage 0 and stage 1 and end up stage 4.  You assume you would never be stage 4 because you just have this \"litte tiny breast cancer\" and doctors even tell you that you will be fine.  But cancer is sneaky.  So for Guliana to act like she is just going to get on with life.....I don't think she is sending a good message.  And that isn't to say you should live your life after a diagnosis focusing only on breast cancer because God knows we all need a break from this disease and isn't it a great day when you can go a day, an hour or a minute without thinking about his disease.  But just the fact that she just wants to shove it out of her existance..... And I get the issue of having a baby.  I was stubborn and was determined to have more kids.  Maybe if I realized the severity of even a stage 2 breast cancer diagnosis and went all out on shutting down hormones and having ovaries out,  etc....mabye I wouldn't be in this stage today.  Bottom line, I would do so many things differently if I could go back to my stage 2 diagnosis and I just hope she is doing something rather than assuming \"I am just stage 0 or stage 1\"....nothing to worry about!",
      "MessageIndex": 15,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Apr 30, 2012 06:55PM smiley2 wrote: Hi LuAnn, Just curious if the long term survivor ladies mentioned all the treatments they had gone through or are currently on?  That is so inspiring!  Thanks!",
      "MessageIndex": 21,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786666",
      "Title": "Long Term Survivors at Conference LuAnnH 3littlegirls"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: How accurate is this test?  My blood never showed anything with blood tests but now a new doctor is ordering these.  Is it even worth it? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792332",
      "Title": "CA 27-29 Blood test...how accurate? smiley2 Mzmerz"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Do any of you watch Guliana and Bill on E?  I watched the season finale and I was a little surprised.  She asked her doctor if he had ever seen her cancer before and he said it isn't as common but he has treated a few women and they are all doing fine.  And since she is now taking Tamoxifen obviously her cancer was hormone positive but then the doctor said something about Her2.  I am not Her2 positive but there was no mention of Herceptin.  Isn't that a MUST to take when you are Her2 positive?!  And then she had another egg retrieval which surprised me as well that an oncologist would even allow that considering her cancer is hormone positive?  I was told I couldn't do any kind of egg retrieval b/c the drugs to get the eggs pump you full of hormones and that would feed the cancer even more.  They also said the cancer even though early stage is slightly invasive with \"40-60 cells\" so guessing she had a sentinal node that showed up positive. But the doctor made it seem like no big deal!  If you ask Dr. Block in Chicago, he would tell you that anyone with a cancer diagnosis whether you are stage 0, 1, 2 or 3....you assume that there is a cancer cell that got out and is in bloodstream.  It just takes one to get out and wreak havok!  I know this show is just for entertainment but I almost think this girl needs to be shaken!  She doesn't seem to get the severity of a cancer diagnosis!  And her husbnd told her to stay away from all of these discussion boards!  To only listen to doctors!  What an idiot!  If he only knew how much great information is on these boards!  If his doctor hasn't even mentioned Herceptin to his wife...he isn't getting \"the best\" treatment plan for his wife that is for sure! Even though it isn't reality TV, I also watch The Big C on Showtime with Laura Linney!  Love her F*** it attitude! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Feb 23, 2014 10:27AM smiley2 wrote: For those of you taking this drug, how long have you been on it? Is there a certain time period that we are supposed to stop it like Tamoxifen after 5 years? Are any of you experiencing any weight gain or other side effects in general?",
      "MessageIndex": 1,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817984",
      "Title": "How many years have you been on Zoladex? Any side effects? smiley2 smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Aug 21, 2012 04:11PM smiley2 wrote: THanks for the info Jenrio!  I didn't even know about a CEA test?!  Gees, I swear I learn more here than i do from the doctors!",
      "MessageIndex": 9,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792332",
      "Title": "CA 27-29 Blood test...how accurate? smiley2 Mzmerz"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 18, 2012 09:56AM smiley2 wrote: I guess there are benign brain tumors so hopefully it is just that.  Hopefully, she won't have mets! But I thought it was odd that they said \"she is doing fine and has no symptoms.\"  Ummm, yeah she did have symptoms b/c she forgot the words to her own song at a concert which is what led her to go get a scan of her brain!!!  It had nothing to do with being 50 and forgetful! ",
      "MessageIndex": 17,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 18, 2012 04:25PM smiley2 wrote: You are right DivineMrsM!  I forgot I was watching the E channel and not MSNBC or some other news channel!  Thanks for the laugh! I wish Guliana well on her path! ",
      "MessageIndex": 23,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: This Post was deleted by smiley2. Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817984",
      "Title": "How many years have you been on Zoladex? Any side effects? smiley2 smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 30, 2012 01:59PM smiley2 wrote: Congratulations to you and very inspiring!  Hold out for those grandbabies!",
      "MessageIndex": 22,
      "PostDate": "30/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789889",
      "Title": "Major Milestone Karen2012 seaperch"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Feb 22, 2013 12:31PM smiley2 wrote: Congrats!!!  That is awesome!  Celebrate big and every day!  =)",
      "MessageIndex": 19,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800871",
      "Title": "5 Years Out! JeninMichigan Jac53"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: I am curious for those of you that have been taking Zoladex for at least 5-6 years....have you noticed gut issues? My scans are stable. And has anyone's stomach gotten larger since taking Zoladex? Granted, I don't exercise like I should and I think I may have a hernia but I pointed it out to my doctor and she said \"oh yes, I have a lot of patients who's stomachs got bigger on Zoladex.\" I am sure part of this might be menopause as well? But the more I think about it, shot after shot after shot in my stomach every month is probably also causing a lot of scar tissue (I get double shot because I got the Lidocaine too) and with all those chemicals going directly into our stomach/gut/digestive system …..it has had to affect it, wouldn't you think?  Just curious if anyone else has the belly and your thoughts on gut issues...not absorbing nutrients properly?! etc etc? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869503",
      "Title": "Zoladex and gut inflammation/gut issues? smiley2 smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: This Post was deleted by smiley2. Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829305",
      "Title": "Vent for the Day b/c I can't put it on FB: smiley2 GatorGal"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "May 14, 2013 09:48PM smiley2 wrote: \" I would never want to be in your shoes.\"  Said twice by dumb ass \"friend\" who also told me \"It's just hair.  It will grow back.\" I don't want to be in my shoes either but I wouldn't trade my shoes for her shoes b/c I couldn't stand being that dumb!",
      "MessageIndex": 724,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Apr 21, 2012 11:43AM - edited Apr 21, 2012 11:44AM by smiley2 I was told chemo doesn't work on bone mets as well.  I would definitely go for a 2nd, 3rd and 4th opinion but I think hormonals is a good route to go.  However, it looks like he/she doesn't have you on anything for hormones.  Femara is for hormones and adrenal glands.  Zometa is for bone strengthener.  Good luck with your decision!",
      "MessageIndex": 23,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786140",
      "Title": "Best Treatment for Stage IV metastatic breast cancer sgupta EnglishMajor"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Has anyone else experienced really dry and brittle, peeling nails? I have never had an issue with brittle nails. I did chemo a long time ago so the only thing I can contribute this to is menopause due to hormone therapy. Anyone else dealing with this? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864420",
      "Title": "Extremely brittle nails smiley2 Lynne"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Hi, I have been on Zoladex for 5 1/2 years.  I am trying to figure out where this lower leg edema is coming from.  Both Zoladex and Femara list lower leg edema but my oncologist last week said no way is it coming from the drugs!?  I was reading Zoladex PI this morning and it said to inject below the naval line (which my nurses always go to the side of my belly button) and then it said make sure not to inject into muscle or peritoneum.  After all these years, I have noticed that my stomach feels hard on both sides and I was thinking it was scar tissue from the shot.  Technically don't they inject the shot into our muscle and peritoneum each time they give us the shot?  You would think muscle for sure!  Would be curious to hear thoughts if you are on this drug and any weird side effects you may have? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 23, 2014 07:43PM smiley2 wrote: Hi thisisme, I have thought about taking the ovaries out but after my mastectomy that same year I had my belly button hernia taken care of.  So, if I take the ovaries out they can't go laparoscopic b/c of the mesh.  So they would have to go the old way which is essentially like the csection I had and longer recovery, etc.  The main reason though is my husband got a new job and our insurance SUCKS!!!  We have paid so much money out of pocket this year.  The time to have done it was when we had BCBS.  I am also on Femara. They put me on that at initial stage 4 diagnosis.  I am certainly menopausal now! I haven't had a period for awhile now! That I do not miss! =)",
      "MessageIndex": 9,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: So they had this 73 year old doctor that had been out of shape and then he started exercising and changed his diet and now he as a 6 pack and has a great body.  But one thing he mentioned was that you have to keep your hormone levels balanced or as you age \"you will be doomed\".  I rarely watch this show but when I heard him say this I looked up at the TV and thought \"hmmmmm.....so what does that do for the BC gals that have hormones shut down\"?  Does anyone have any concerns about the long lasting side effects of no hormones?  Are we more likely to die of heart disease b/c of the lack of hormones rather than the cancer?!  It isn't like I am going to run out and stop having my hormones shut down but was curious if anybody caught this tonight and any thoughts? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793141",
      "Title": "Heard on \"The Doctors\" smiley2 Fitztwins"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 22, 2014 05:12PM smiley2 wrote: Hi tonihicks1, I was doing it on one side for awhile and then I can't remember if I read it in PI or if the nurses told me but they said you are supposed to alternate shot every month.  Have you heard this before?  So for the past 3 years, I have been alternating sides.  I am usually left with a good size bruise and I am a bleeder!",
      "MessageIndex": 4,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "May 2, 2012 10:01AM smiley2 wrote: can't click on link?",
      "MessageIndex": 1,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786802",
      "Title": "News on Dr. Tuohy vaccine BaseballFan jhammel"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Sep 11, 2012 10:03AM smiley2 wrote: Haha!  Thanks for the laugh coolbreeze!",
      "MessageIndex": 7,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793141",
      "Title": "Heard on \"The Doctors\" smiley2 Fitztwins"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Hi, I was curious how everyone is handling their medical bills? I have so many medical bills! Our insurance changed from BCBS to Aetna this year and Aetna has got to be the worst insurance ever!!  Someone told me to look into Medicare and that may have more coverage.  Have any of you switched from a primary insurance like Aetna, BCBS, Cigna, etc over to Medicare? Did it help! ?We are drowning in medical bills over here! Thanks for any help or suggestions! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823386",
      "Title": "How are you handing medical bills? smiley2"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "May 22, 2018 12:44AM smiley2 wrote: Meg101..can you post a pic of the oil you use? I looked on Amazon but so many choices of OPI and I don't see any of them that say oil that is specific to dry and brittle nails.  NancyHB….I see the OPI nail envy on Amazon. Do you just use the clear polish one? I have been using Sally Hansen from Target for weeks now and my nails still peel. I have also been trying to take Biotin supplements but still not noticing that much of a difference. It is amazing to realize how much we use our nails for a lot of things!! I was volunteering the other day and had to ask a guy to open a box for me. I am sure he thought I didn't want to open the box because I didn't want to ruin my nails but I really can't open a box because I am afraid my nail will rip off my nail bed!! So frustrating!",
      "MessageIndex": 6,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864420",
      "Title": "Extremely brittle nails smiley2 Lynne"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jul 8, 2014 08:09PM smiley2 wrote: Hi CJRT, I have gone a few times with not getting it at exactly 28 days.  I have postponed it due to flu or not feeling well, snow, bad weather, etc.  I don't sweat it.  That shit is in our bodies and being on it for 5 1/2 years, I don't think my ovaries are going to immediately awaken if I miss a week or so!  Those things are probably in a coma by now!  I would go enjoy your vacation and just schedule your shot for when you get back! I think I saw on this site somewhere that there are some girls that are doing it every other month!?  But I do think that is very interesting that you have the swollen lower leg too!  I went to see another doctor today to get an order for my lymphadema lady to start treating it.  She thinks I have \"subclinical lymphedema\".  It is very minor swelling and you wouldn't even notice a difference in my legs but I can FEEL the difference.  Do you have any feelings of fullness, tightness or fuzzy feeling sometimes? I think it is ridiculous that these doctors say that it can't be the medication...it says in the package insert under side effects (I think \"rare\") that it causes \"LOWER LEG EDEMA\".  Zoladex and Femara BOTH say it in their PI's and I am on both drugs.  Someone has to be the 1-3% right?!  I swear these doctors don't even know what the hell is printed in these package inserts!",
      "MessageIndex": 12,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jul 10, 2012 03:25PM smiley2 wrote: Sounds very interesting!  It is nice to see a study being done specifically for stage 4 ladies.  Thought it was interesting with the prostate referral becuase i think it was an article somewhere on this site that said that there is a possible connection with prostate cancer and breast cancer coming from the fathers side of family?  My dad did have prostate cancer so maybe there is a gene that they haven't found yet that I inherited?",
      "MessageIndex": 1,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790376",
      "Title": "Clinical Trial Using a Fairly Non Toxic Drug Bestbird Bestbird"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Just wanting to throw this out here b/c I can't remember if I read it here on this site or read a study somewhere but they talked about if you have progression on an AI....it could be beneficial to go off for a small amount of time before starting a new one? As this will maybe give your body a chance to accept the new drug and have it work more effectively?  Or i guess being off of it with no safety net to speak of and then you wham the cancer cells again with the medication is how I understood it.  Does this sound familiar to anyone or did I dream this?! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793711",
      "Title": "go off AI for a period of time before starting new one? smiley2 bhd1"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jun 22, 2014 04:21PM smiley2 wrote: Thanks thisisme for your response!  Actually, the needle on this drug is HUGE.  I have the nurses give me lidacain (sp?) first and then the injection. If the nurse doesn't wait long enough for the area to get numb, it can actually be painful.  And I have a high tolerance for pain!  I was curious about your treatments in your signature...is Affinitor an oral agent or is that IV?  Is that what they are putting with Aromasin?  I think my doctor mentioned this drug to me recently.",
      "MessageIndex": 2,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822183",
      "Title": "stage 4 zoladex users smiley2 Redheadfriendship"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: Does anybody else look like they are 4 months pregnant?!  I am sure some of it is my eating habits the past year but how much do these AI's have an effect on our weight?  And how do I lose the weight while still staying on all of these drugs? I am on Femara.  Anyone have any weight loss success stories? Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793355",
      "Title": "Abdominal Fat smiley2 redwolf8812"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Sep 11, 2012 06:15PM smiley2 wrote: BHD1....People with BC before diagnosis gain weight, during, or after?  I know that having extra weight on us is not good but it is hard to keep weight off when we are on all these drugs! Pattih..wish I still had my own boobs b/c then I would be balanced out.  But implant boobs are much smaller so tummy definitely takes on Homeer Simpson appearance!",
      "MessageIndex": 11,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793355",
      "Title": "Abdominal Fat smiley2 redwolf8812"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Feb 20, 2013 10:22PM - edited Nov 13, 2017 06:00PM by smiley2",
      "MessageIndex": 25,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800701",
      "Title": "I don't feel sick cheryl1946 NineTwelve"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "smiley2 wrote: I find myself wanting to scream at the top of my lungs to people who don't acknowledge their ages when they have birthdays. I think it is RIDICULOUS to not tell people your age when you are turning 40, 50, 60, 80...whatever to mark a milestone birthday. All I can think of are the friends I have lost that would give ANYTHING to celebrate their birthdays because it would mean that they are here another year to celebrate with their friends and family and small children that they have left behind. Does anyone else feel this way about birthdays or am I just ultrasensitive about the issue!? I just see it as completely ungrateful. Let me trade shoes with you ungrateful bitch and let's see how you feel not knowing if you will see your next birthday or not! Stage 4; 2/16 nodes; ER+/PR+; Her2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812948",
      "Title": "Ranting about Bdays smiley2 Jill49"
    },
    {
      "AuthorID": "smiley2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/148362/profile",
      "Content": "Jul 16, 2018 12:37AM smiley2 wrote: My lymphadema therapist actually suggested maybe I try the facial sonic cleanser. I haven't bought one yet but I would like to. I had cording after initial lumpectomy in 2005 and also had cording. I would consider trying another therapist just to see if that makes a difference for you. ",
      "MessageIndex": 1,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/865619",
      "Title": "Sonic massage for cording / lymphedema with Clarisonic Mia ? Jeremiah29-11 Rah2464"
    }
  ]
}