{
  "AuthorID": "Smoo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277051/profile",
  "Posts": [{
    "AuthorID": "Smoo",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/277051/profile",
    "Content": "Smoo wrote: about 7 weeks ago i noticed I my right breast was starting to 'bulge out of my bra. I usually wear a 36dd cup, or 38d and was bursting out of the cup.(as u can no doubt imagine they are plenty big enough without one getting any bigger!) After 3_4 weeks when i was still bigger (and having bought new bras) I visited my gp whom advised as he could feel a lump to be referred to the breast clinic. Last week the doctor at the clinic could also feel a lump and see the obvious difference in my breast sizes, so I was sent for a mammogram and a ultrasound. The ultra sound technician told me I had some small cysts but they looked ok, but didn't think it would explain why my breast was suddenly so much bigger and was sending back to the consultant as he thought it might need further investigation. I was so relieved to hear it was something benign from the said breast doctor i didn't ask anymore questions and have come away a little perplexed as to why the ultrasound chap implied the change in breast size was not because of the cysts and might need further investigations, but the registrar, when I asked him about whether my breast would return to normal size, he just said it might do, it might not do and sent me home. Over the weekend this right breast seems to be getting bigger, even a 36e cup is now much too tight on the right and i can actually get my hand in the other cup because the bra is too big. and I have tried a plethora of bras. Even my clothes are showing the difference, if I wear a top, a v-neck it is constantry pulling to the right and anything a little bit figure hugging is now too tight on the right breast. It's not hot or anything, but it being squished into bras that are too small is not very comfortable and it just doesnt feel right. So i was wondering if anyone had something similar happen. I've read the breast advice page and about cysts but am not seeing it being the cause of such an enlarged breast. I don't know whether I should just leave it and try and find a solution with a bra (other than shving some socks down the smaller breast) and hope it goes away, or whether I need to ask for further help. I really, really don t want to make a fuss over this when i know others are having such a difficult time, I wouldn't want to take up anymore clinic time for no reason when ladies need it so much. I guess I am hoping someone may have had or having a similar experience, it would be helpful to know if anyone with cysts had such a big change in breast size and if it ever shrunk back down again. Much appreciated for your time Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "15/07/2018",
    "ThreadURL": "https://community.breastcancer.org/forum/148/topics/865899",
    "Title": "Enlarged breast with cysts Smoo Bostoniangal25"
  }]
}