{
  "AuthorID": "Snobird",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
  "Posts": [
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Nov 22, 2011 05:59PM Snobird wrote: I'm just going to tell you my story but it may not be the right thing for your wife. She may need to see a nutritionist or counselor for additional help and support. I had a BMX/DIEP last dec 2010 three weeks before Xmas. 5 days in the hospital then home. The first week I pretty much rested and stayed home. The 2nd week I was getting bored and antsy so I started going into my office and working (self employed, desk work) for a half a day. I was moving around very slowly. I would come home and rest the remaining day. I slept a lot and laid down whenever I felt like it. During all this time I took a lot of vit c, vit d3 plus multi vit for women. I worked hard at eating a well balanced diet with lots of greens and I found that I could only eat smaller meals so I had more of them. I would take 1/2 my lunch and eat it later for a snack and that helped my energy levels later in the day. At three weeks I felt like I was beginning to see the end of the tunnel. It was almost Xmas and we kept it simple at home and went to relatives to celebrate. Right after Xmas down came the tree and our bags were packed up to drive from NY to CO for a month of downhill skiing that we had planned prior to my DX. 3 of us took turns driving out and it took 3 days. I probably drove 3 hrs at the most each day the rest of the time I slept or listened to a book on tape. Once out to CO I was not ready to ski yet still very tired but I made myself walk 2 to 4 miles everyday even if I collapsed when I got back and went to bed. I just needed to get moving. Some days I would do 2 walks and others just one. I napped everyday. By week 5 I couldn't stand it and went and skied the easy trails for 1/2 a day and it felt great to ski even though I was exhausted. I then did that everyday that week. The following week I took 2 days off because of bad weather but when the sun came out I went and upped the anty to intermediate runs and 1/2 days unless I felt good and did more, by the end of the 6 th week I was skiing all day. After that I just felt normal and the tightness in my chest and abs were going away and I really started to focus on having a good time. My last week in CO I skied black diamond runs pretty much all the time. Then my husband and I drove home leaving my niece out there. Because of the weather we ended up driving straight thru in 32 hrs taking turns. When we got home I think I slept for 3 days. Your wife has had major surgery and trauma to her body which will take time to heal. Make sure she is well off nutritionally and gets outside and gets some sunshine and exercise. I'm convinced that it was the sunshine and walking everyday that made a huge difference to me. It doesn't help that it gets dark so early and she could be affected by that like I am. (seasonal affective disorder) so when the sun is out no matter how cold it is I go outside and walk for an hour unless I can ski. Wishing your wife the best.",
      "MessageIndex": 5,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778363",
      "Title": "More questions for my wife Clams mawhinney"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "May 24, 2011 02:25PM Snobird wrote: All of us here have been in your shoes. We have all been terrified in the beginning. Wishing you the best today. Sending positive thoughts your way and hoping you don't need to return. If you do there is a pile of people here to help you through it. Keep your chin up and take someone with you for support if you can. This can be overwhelming and having someone one with you is very helpful because there are things that you won't remember later.",
      "MessageIndex": 3,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/769363",
      "Title": "what i thought was a ruptured implant may be bc instead trayxdogg karen333"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Jan 28, 2011 05:12PM Snobird wrote: I developed Frozen shoulder 12 months after lumpectomy. Did PT which helped get things started but when I started cross country skiing it really helped in short order. I did 2 weeks of formal PT and 4 weeks of at home PT and got 50% range of motion back. After 2 weeks of cross country skiing about every other day for an hour I had full range of motion and no more pain.",
      "MessageIndex": 12,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761635",
      "Title": "Frozen Shoulder stacey2275 brca1953"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 30, 2011 09:35AM Snobird wrote: Call the facility where you would get it and ask them for the cost after your insurance (out of pocket expense) will be. Each insurance is different and each has a negotiated rate with the hospital that you won't know until you ask.",
      "MessageIndex": 3,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/766815",
      "Title": "Bone Scan cost? D4Hope D4Hope"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Dec 4, 2011 02:03PM Snobird wrote: Hi. I am almost 1 year post BMX/DIEP stage 1 and 2 weeks post DIEP stage 2 (nipples and lipo). I can tell you that the first 2 weeks are very tough on you physically but after that you will find that you will improve daily. You will have serious pain meds for 7 to 10 days. You will tire easily. But here is the thing. 7 days post op I was walking, albeit very slowly, a mile. I was able to do short excursions and work at home on my laptop. You will not be able to go into work at a minimum of 3 weeks maximum 8 weeks depending on the type of job you do and how physical it is. Some women go back halftime to a desk job at 3 weeks and all is good. I was able to downhill ski in CO at 5 weeks out. Stage 2 is much easier and depending on how much lipo you have recovery is a couple of days. Your kids are old enough to be of considerable help after Stage 1. You will need to explain to them that they will really need to step up to the plate here to help you out during recovery. I would suggest that you make and freeze a couple of weeks of meals so that mealtime doesn't become stressful. Kids are always hungry it seems. Someone will need to be around for the first week to 10 days to help with getting up and out of bed etc. you won't be able to lift anything heavier than 5 lbs for the first 3 weeks or so and then gradually up that. No doing dishes, etc. Even at 5 weeks I had my husband carrying my skis because they were just too heavy and you don't want to compromise the flaps. The Docs will most likely want you to have an adult with you before and after surgery so they have someone to consult with about your treatment. You will be out of it for at least 24 hours. They won't release you without a companion either. If you don't have a friend or family that can go with you, you can probably hire a private nurse for a few days. Go to diepflap.com for PS in the NYC area.",
      "MessageIndex": 2,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/779019",
      "Title": "BMX DIEP/TRAM FLAP???? prncsviolet NatsFan"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Nov 27, 2011 07:25PM Snobird wrote: I had a LX with rads in 2006 then in 2010 I was Diagnosed with a recurrence. The first time I had extensive DCIS and didn't get clear margins so back in again. 2 yrs after rads I suffered from frozen shoulder so I ended up with 2 monts of PT. 2010 I had a recurrence of DCIS in the nipple ducts. Back in the beginning I knew nothing about the DIEP procedure. This time I had done my research and I knew exactly what I was going to do. I am 57 yrs. old. 5 weeks post DIEP I was skiing in Colorado. If I had known about the DIEP procedure the irst time that's what I would have done and skipped the rads.",
      "MessageIndex": 15,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778727",
      "Title": "Such heavy decisions... katiebug msphil"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 3, 2011 07:00PM Snobird wrote: God Bless You and keep you in his heart. Keep the faith and he will be with you on your journey. What a brave young woman you are. Keeping you in my thoughts and prayers.",
      "MessageIndex": 181,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764173",
      "Title": "28 YR Old Is Looking For Support from You wwaterlilyy ibcmets"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Jan 24, 2011 10:49PM Snobird wrote: I was recently diagnosed with Pagets disease of the nipple. You should see a dr. and have a biopsy done. My surgeon wasn't worried but I insisted on the biopsy and low and behold it was cancer. I have since had a bilateral masectomy with immediate reconstruction due to family history of cancer. Luckily there were no cells in the lymph nodes and nothing showed up on the scans so it was lucky for me that I had insisted on the biopsy.",
      "MessageIndex": 3,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763478",
      "Title": "Growth on nipple? ebent01 Snobird"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Dec 20, 2011 05:40PM Snobird wrote: Between the lines may mean she has no insurance until after Jan 1st and does not want it to become a pre existing condition which then would be denied coverage for the rest of her treatment. I don't know if telling the Dr. in January that you've had these symptons for awhile will also preclude insurance coverage due to a pre existing condition. Boy it's a tough call if that is the issue. But IBC is a rapid growing cancer and I'm not sure that I would take the risk. Wishing you the best and hoping it's not serious.",
      "MessageIndex": 8,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779800",
      "Title": "31 with rapid onset changes...scared TrishTheDish1980 Moderators"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 9, 2012 09:51PM Snobird wrote: Dr. Rachel Wellner, NYC (Diepflap.com)",
      "MessageIndex": 3,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/785542",
      "Title": "NY Breast Surgeons dventi ashla"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Nov 14, 2011 07:52AM Snobird wrote: Check out doing the DIEP Flap if you can. No fills or implants unless you are doing rads. It uses your own tissue to make new breasts. I am 11 months out from a BMX / DIEP and they look and feel great. Wished I'd been able to do it the first time around. Check out the DIEP 2011 thread and NOLA in Sept. thread under breast reconstruction.",
      "MessageIndex": 2,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777990",
      "Title": "Reconstruction with mastectomy mybodymydecision nora_az"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 24, 2012 09:17AM Snobird wrote: If you are concerned go see your Dr. and request additional testing if only to calm your fears. You can also try hydrocortisone cream for 10 days to see if it goes away. If that works it may just be a skin issue like excema (I had that on both nipples every once and awhile). But, please go with your gut feelings on this. I also had nipple issues on a previous cancer breast which concerned me but not my Dr. After fretting about it for 3 months I insisted on a biopsy and my BS complied and low and behold I had Paget's disease of the nipple. Luckily it turned out to be DCIS so I was spared chemo but I went ahead with a BMX/DIEP so as not to let my boobs take me down this road again. Best decision I ever made.",
      "MessageIndex": 3,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786297",
      "Title": "itchy left nipple molly70 Snobird"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 2, 2011 08:58PM Snobird wrote: Please do not hesitate to get this checked out now. Nipple retraction is classic for Paget's Disease of the nipple. Do not trust mammo or US. Ask for a biopsy and MRI. I was recently diagnosed with Paget's (I did not have a retracted nipple) but I had clear mammo and US. It was only my insistence in having a biopsy done that we found the cancer. Please, Please don't wait.",
      "MessageIndex": 9,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766886",
      "Title": "retraction of nipple jeaniem Carola32"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 4, 2011 08:42PM Snobird wrote: That is atypical OBGYN response. If it is mastitis then the antibiotics should clear it up in a few weeks. If not go see a breast surgeon specialistASAP!",
      "MessageIndex": 20,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766886",
      "Title": "retraction of nipple jeaniem Carola32"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 21, 2011 11:02PM Snobird wrote: 52 DCIS, IDC. 54 Paget's Disease of the nipple. Same breast.",
      "MessageIndex": 617,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 22, 2011 05:19PM Snobird wrote: I dont want to alarm you unnecessarily but if it was me I would go back to the Dr. now. Ask for an ultrasound and a mamongram or maybe an MRI and get and keep you reports. The only ammunition in this fight is early DX and treatment. Make sure you see a breast specialist and not just you OBGYN. Most breast specialists are surgeons but don't let that sway you. They see alot more breast issues than OBGYN's. I had a recurrance my breast cancer after 4 years which my surgeon didn't think was anything but agreed to biopsy it for my own piece of mind and it turned out that I was right and it was early stage Paget's Disease of the nipple (I'm not saying here that that is what you have or might have. It's pretty rare.) That biopsy probably saved my life. It could just be a blocked duct or Lobular Cancer In Situ (LCIS) which is not life threatening usually. Better to see a Dr. than wait.",
      "MessageIndex": 2,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766475",
      "Title": "I'm sorry to bother you all, but this has been worrying me! Napaoctober irish22"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 28, 2011 06:59PM Snobird wrote: Just voted Good Luck!",
      "MessageIndex": 12,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766689",
      "Title": "Determined to Win! Pure Pure"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 27, 2011 08:24AM - edited Apr 27, 2011 08:27AM by Snobird You will find lots of info on the Breast Recon main thread here. TRAM is really Old School now and if you want to avoid surgery 8 to 10 yrs later I would check out the DIEP. No reason you should lose your ab muscle too. Especially with a young active child to chase after. Also, see if you can do a nipple sparing procedure. You will be amazed at how real your new boobs will look and with a nipple sparing procedure they will look like yours never changed.",
      "MessageIndex": 20,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/768151",
      "Title": "I'm 39 with breast cancer, need advice mommyrnx2 waltersmith"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 27, 2011 04:47PM Snobird wrote: Just hit ignore and it shouldn't come back",
      "MessageIndex": 20,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768055",
      "Title": "Anybody else getting unwanted PMs? sincitydealer Moderators"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 23, 2011 11:49AM Snobird wrote: It sooooo! Not fair. You hang in there. My brother in law had stem cell surgery last year for lymphoma and he has been NED since. It's tough but doable. You need to research and travel to the best place for treatment of your specific type of cancer. My BIL had to go to Boston because that was the best place for him to go even though NYC is closer. Wishing you the best of outcomes for your journey. You are young and you have a lot to live for. As you gear up for the fight these ladies will be here to see youngish it.",
      "MessageIndex": 33,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767936",
      "Title": "stage 4 and I'm 29 with a new baby lindyw82 justjudie"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Dec 13, 2011 08:51PM Snobird wrote: I agree with TENMOM above but you should definitely get it checked out. I had Pagets Disease but it did not express itself with a rash or was it itchy but it was Paget's non the less. My BS didn't believe it was anything I should be concerned with but I insisted on a biopsy of the nipple tissue and low a behold it came back as Breast Cancer. I am 57 and I am doing well. Stay on the thread. The women here will guide you through it.",
      "MessageIndex": 2,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/779513",
      "Title": "I am very worried I have Paget's disease of the nipple MollyWoods Katy_a"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 23, 2011 10:12PM Snobird wrote: Listen to yourself and go with your gut feelings. Our intuition is amazing.",
      "MessageIndex": 8,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766475",
      "Title": "I'm sorry to bother you all, but this has been worrying me! Napaoctober irish22"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "May 14, 2012 01:40PM Snobird wrote: Luckily time is on your side. You need to take a copy of the federal law concerning Breast Cancer to your Dr. Go see the therapist it won't hurt and may help you get the surgery you need. The surgeon could just be covering his ass by requesting the therapy. Go to your legal aide and figure out you're legal options. Request a referral to another surgeon for a second opinion. Testing your mom is the preferred method but it also doesn't preclude your paternal. It is a very expensive test. The test is typically not covered by insurance. Not sure how it works with the military. Persevere.",
      "MessageIndex": 9,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787366",
      "Title": "High risk but doctors won't perform a BMX j2kbbax girlguru"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "May 10, 2012 10:00PM Snobird wrote: Try to find a Breast Care Center in your area. They are usually are affiliated with larger hospital. They will treat you with a team approach. But if you are ever not comfortable or confident with your Drs feel free to seek several opinions. Most see a Breast surgeon for their first appt. the oncologist comes in after the pathology is determined for adjuvant treatment if required. Please bring someone with you to your appt. You will miss a lot of what is being said and it's helpful to have another set of ears. Wishing you the best as you go forward.",
      "MessageIndex": 1,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/787289",
      "Title": "Which doctors do I need to see now that I've been diagnosed? 25weeks lago"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Apr 3, 2011 09:01PM Snobird wrote: I have Pagets with no rash, no itching, no sores, no nipple sores and no retracted nipple. The only way I new it was Pagets was by the the biopsy which the Docs didn't think was necessary due to clear mammo and US. I had a tiny almost the size of a pinhead blister on the tip of my nipple. Luckily I insisted on the biopsy and was able to catch it early before it became invasive. It was located with the duct and the end of the nipple. My BS said most Paget's doesn't get caught til much later because people just think they have a skin issue. It's still pretty rare but that doesn't mean one should be complacent. I don't wish it on anybody but I'm here to tell if you think there is an issue with your breast, if something isn't right then go with you gut and biopsy it.",
      "MessageIndex": 15,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766886",
      "Title": "retraction of nipple jeaniem Carola32"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 28, 2011 07:56PM Snobird wrote: Hoping everybody votes for yo. Want to keep this active.",
      "MessageIndex": 13,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766689",
      "Title": "Determined to Win! Pure Pure"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Mar 30, 2011 07:00PM Snobird wrote: Bump Vote Everbody",
      "MessageIndex": 22,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/766689",
      "Title": "Determined to Win! Pure Pure"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Nov 1, 2011 05:41PM Snobird wrote: I'm 57 and I had reconstruction after 4 yrs using the DIEPFLAP technique and it changed my life. I have soft warm real looking and feeling breasts. My husband says that they feel the same as the old ones and I feel like a million bucks.",
      "MessageIndex": 6,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777376",
      "Title": "I miss my breasts! topless karen1956"
    },
    {
      "AuthorID": "Snobird",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/119734/profile",
      "Content": "Nov 13, 2011 04:39AM Snobird wrote: Go to your school clinic. It is probably just a skin issue. Pretty rare for women your age to have breast cancer so don't panic. Whatever the issue it's best to get it checked out. Knowledge is power and you need to know what's happening or you will be constantly worrying. Good luck to you.",
      "MessageIndex": 1,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778007",
      "Title": "18 and worried Lsmith93 Mandalala"
    }
  ]
}