{
  "AuthorID": "soapsnug",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
  "Posts": [
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "May 25, 2009 08:58AM soapsnug wrote: Lisa--I'm sorry you're having a difficult time today--waiting for surgery is so difficult.  I tried to keep my routine as normal as possible, which was helpful to me.  In addition, I also tried to clean my whole house, do all the laundry, cook and freeze meals for my family, etc.  You've probably read the threads about helpful things to do before surgery, but one of the hints I found extremely helpful was to take my dishes and glasses out of the cabinet and put them on the counter, as you cannot reach up to get them for a while.  On a different note, a lot of women do something to \"say goodbye\" to their breasts.  I made a breast cast and also took some pictures.  I was very calm before my surgery and the morning of.  I hate getting an IV, so I always have anxiety when I know that that's coming.  Also, I didn't know what to expect as far as the sentinel node procedure was concerned, and I thought that getting the injections for that procedure would be really painful.  Actually, in my case (any so many people have had very different experiences as far as the sentinel node procedure goes), it was not really a big deal.  On the day of surgery, I was most afraid of being under anesthesia for such a long period of time.  But, of course, I woke up and everything was fine.  By the way, as far as having any cancer in your sentinel nodes is concerned--I can't remember the exact percentage (maybe someone more knowledgeable can chime in here), but my breast surgeon said that 90+ (maybe 98?) percentage of the time, people diagnosed with DCIS do not have cancer in their sentinel nodes, as the cancer is contained in the ducts.  They check to make sure there wasn't a microinvasion.  I had SNB on both sides--cancerous and non-cancerous--and in each case the nodes were clear.  Even though there's always a chance that one can develop lymphedema after node removal (even if only one node was removed), I'm so glad that I had the procedure, as I felt a great deal of relief knowing that the nodes they took were cancer-free.  Also, my breast surgeon said that, while there's always a chance of lymphedema, in 15 years of practice she never had a patient develop lymphedema from SNB.  All the best--I'll be thinking of you on Wednesday. Linda--All the best with your surgery and follow-up treatment.  I'll be thinking of you next week. Audrey",
      "MessageIndex": 22,
      "PostDate": "25/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/734029",
      "Title": "DCIS lynniejojo lynniejojo"
    },
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "Jan 13, 2009 11:22PM soapsnug wrote: Hi Sam, I had a bilateral mastectomy in November and had SNB on both sides.  During my consult, when I asked my surgeon about SNB on the prophylactic side, she said that it was controversial.  Her feeling was that it should be done, and I felt that way, as well.  I didn't want to find out that there was cancer in my \"healthy\" breast and then have to have additional surgery to remove numerous lymph nodes.  Best of luck.",
      "MessageIndex": 2,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727304",
      "Title": "Has anyone done sentinal node biopsy on prophylactic side? samiam40 Binney4"
    },
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "soapsnug wrote: Hi Everyone, I'm in the process of deciding which surgeon I want to use for my bilateral mastectomy.  Dr. Zingale is one of the doctors I'm strongly considering.  He works out of Huntington Hospital on Long Island.  Does anyone have any experience with him--i.e., did he do your lumpectomy or mastectomy, or has he operated on any women you know?  Any feedback would be most appreciated!  Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722628",
      "Title": "Does anyone know Dr. Zingale (Huntington, NY)? soapsnug nosurrender"
    },
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "Oct 8, 2008 12:35AM soapsnug wrote: Hi Bluedasher, I am having a sentinel node biopsy.  After doing some reading about it, I felt that it was necessary in my case, since I cannot ever have this done after the mastectomy.  Before I even brought it up to my surgeon, he told me that he would definitely be doing the sentinel node biopsy.  I know he has experience doing the procedure, but again, he may not have done as many as a surgeon who only does breast work.  Thanks for your reply--I appreciate all input!",
      "MessageIndex": 5,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722425",
      "Title": "Breast Surgeon Versus General Surgeon soapsnug Looneymom"
    },
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "soapsnug wrote: Hi Everyone, I am new to the board, and newly diagnosed with DCIS.  Because of my history with benign breast issues (especially hyperplasia), multiple biopsies, and my extremely dense breasts, I have been contemplating prophylactic bilateral mastecomy for the past year and a half.  Unfortunately, I was diagnosed prior to the \"prophylactic\" part, but I know that even if I had done the mastecomy last year, they would've found DCIS at that time, as well.  I have decided to have the bilateral mastecomy, and feel fine about my decision.  The surgeon who has done all of my biopsies to this point (4 over the course of the last 14 years) is a general surgeon.  He was recommended by my prior gynecologist after she found a lump (turned out to be a fibroadenoma) during my breast exam.  I had just moved to the area, and never contemplated having to have multiple breast surgeries (I was 27 at the time), so I decided to take my doctor's recommendation.  I have always felt good about my surgeon--I like him, and I really trust him.  Additionally, I don't have any scars or deformations, in spite of the fact that my breast are tiny (I truly wear bras that I got in the children's department--and they're not even the largest size!!), and he has had to remove fairly large sections of my right breast (relative to my breast size) during two of my biopsies (2 x 2 x 1 cm., and most recently, 3 x 2 x .08 cm).  I saw him today, and he took my bandage off from the biopsy I had last week, and there is no deformity whatsoever.  I am not planning any reconstruction at the time of my bilateral mastectomy, and, at this point, I don't see it in my future, at all. In spite of my very positive feelings about my surgeon, I have a nagging feeling that perhaps I should have the surgery performed by a dedicated breast surgeon.  On the one hand, that's all they do, so shouldn't they be more adept at removing all of the tissue, etc.?  On the other hand, I read a book in which the author made a good point.  He said that often the best outcomes he sees as far as breast surgery is concerned are from general surgeons, as they are continually doing other types of (more challenging) surgery to keep up a high level of expertise in their overall surgical work.  His feeling, therefore, is that a general surgeon who is well versed in breast issues (mine definitely is) may be just as good, if not better, than a breast surgeon.  By the way, I don't know how many mastectomies my surgeon does over the course of a year, but he told me today that he does \"several\" per month.  I know he's been in practice for at least 14 years, and I know he's been named one of the best surgeons in the \"Top Doctor\" guide for my area (Connolly's) multiple times--most recently, last year.  In spite of that, I keep feeling as though I should talk to a breast surgeon.  On the other hand, I think that even if I talk to a breast surgeon and like him/her, I won't really know much about him/her or his/her work.  Of course, I really want to feel comfortable with the doctor who's going to ultimately perform the surgery. I would love to hear anyone's opinion regarding this issue.  Plus, is there a special area of the board where people rate/discuss their experiences with their doctors?  Thanks a lot! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722425",
      "Title": "Breast Surgeon Versus General Surgeon soapsnug Looneymom"
    },
    {
      "AuthorID": "soapsnug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73257/profile",
      "Content": "Oct 16, 2009 01:10PM soapsnug wrote: Hi Ladies, I've been reading all of your posts and really enjoy this thread.  I've been a member of breastcancer.org since I was diagnosed in Oct. 2008, but I don't post very often.  When I do, it's usually on the alternative board, but I do read this board quite a bit, as well.  I was diagnosed with DCIS last fall, and after a number of years of tests galore, biopsies, and scares, I decided to have a bilateral mastectomy.  I didn't reconstruct, and I don't wear any forms.  I thought about getting a pair or two, for special occasions, as I know my insurance would cover the cost, but I haven't gotten around to it yet.  I was invited to a wedding in the spring and considered going for forms at that time, but my head always started to spin about two minutes after I started doing research about various forms--there's so much information, and so many different types to choose from!  Plus, I was very small prior to surgery--I wore flimsy cotton bras from the little girls department.  When I went to pick up some garments with drain pockets prior to my mastectomy, the woman at the place was really trying to convince me to go back to see her and get forms after I healed.  When I told her I didn't think I'd be wearing any, she became really insistent, and started to take some out for me to see.  The smallest size she had at the boutique (maybe a size 3?) was way bigger than my normal breasts, and it felt really heavy to me.  I'm guessing I would have to have them special ordered in a smaller size to even approximate my pre-surgical look.  Anyway, I procrastinated the whole thing, and never did order the forms before the wedding.  When I went dress shopping, I took poofies along, and I found a dress that I liked that looked good on me with the poofies.  On the day of the wedding, I just couldn't get the whole thing to look right.  One side was larger than the other, I didn't like the shape, etc.  Time was ticking away, and the wedding was on a ship, so if we were late, we would have missed the entire wedding.  Finally, I felt that I looked decent enough with the poofies, and we left for the wedding.  In the car on the way, I moved in my seat to look for something, and experienced a slight relocation of my unweighted poofy.  That was the final straw.  I just reached into my sleeveless dress and pulled out the whole contraption.  I felt so much better!  I'm happy with the way I look, and that's good enough for me.  I rarely think about forms--at this time, I have no interest in wearing them.  I do still think, from time to time, that I should get them since they'd be free--just in case I might want to ever use them, but I've still yet to go to the boutique--maybe someday! I wanted to chime in about chest tightness.  As I said, I've never worn forms, but I've been using silicone scar sheets for the past 6 months or so, because my scars are hypertrophic.  I try to keep them on around the clock--just taking them off for a few minutes when I shower, or for an hour here or there, if they start to get itchy or hot.  A couple of weeks ago, I had them off for a longer period of time, and I noticed that my chest felt tighter!  So, even something as light as a scar sheet can ease the tightness!  I was really surprised, and a little bummed, as I don't plan on wearing these scar sheets forever.  Since reading all of your posts about tightness easing with forms, or sports bras, I've been thinking that a tight shirt or sports bra might be helpful when I stop using the scar sheets.  Of course, by then, I'm hoping that my tightness will ease up a bit more, and that I may not need anything to compress the area.  In any event, thanks for a great thread!  I hope you all have a great weekend! Audrey",
      "MessageIndex": 243,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737036",
      "Title": "Wardrobe pics for boobless days mom2two ShadePink"
    }
  ]
}