{
  "AuthorID": "Sociologist…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
  "Posts": [
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 4, 2008 07:03AM Sociologist wrote: Hi Traci, I too had regular mammos since the age of 19. I was scheduled for my routine mammo a week after Hurricane Katruna (I live right outside New Orleans and had other things on my mind then!). I skipped it in 2006; went in 2007 where they found some suspicious areas. I was diagnosed with DCIS in 2 places (one close to the nipple, one near the chest wall). I had the core needle biopsy where the diagnosis was made. It's difficult to relax when waiting for tests but remember that 80% of the further testing is benign. Hope for the best! Post again and let us know how you're doing. Take care. Margaret",
      "MessageIndex": 9,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722128",
      "Title": "abnormal/nodule mammo/US terrie45 terrie45"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 1, 2008 04:05PM Sociologist wrote: Hi Terrie, Sorry you have to be going through all of this but you are not alone! This site is filled with wonderful, strong women that will support you throughout everything you're going through. The waiting sucks and unfortunately that's pretty much all you can do until you meet with the doc. It feels like forever no matter how long you have to wait. I got my diagnosis/results from my gp at 4:59 on a Friday! I was devistated to have to go a weekend nervous and scared. I can't imaging having to wait a week! Maybe you can call the office and see if they have any cancellations and talk to his nurse about getting you in sooner (in my own experience they can do more than the front desk in this area). Reading everything about others experiences is both good and bad...good in the sense that you can see we've all been through some of the same things and fight everyday, but bad in that hearing many of our stories can scare the dickens out of you! Everyone has their own unique experiences and how they handle things. Some of our experiences are better than some, worse than others. Whatever the experience, it is unique to that person and shouldn't be taken as the \"gospel truth\" about breast cancer. Everyone's cancer is different to them and they have to handle things in their own way. It is unnerving to have to wait to see the doc. However, the majority of call backs are not always breast cancer. Many times they will tell you they just want to watch the lump or do more testing (such as a needle biopsy) just to err on the side of caution. Telling to you take a deep breath and relax probably won't help (but that's what I'm telling you!). I hope you are able to get in sooner. Please post again to let us know how things went. Take care. Margaret",
      "MessageIndex": 3,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722128",
      "Title": "abnormal/nodule mammo/US terrie45 terrie45"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Jan 15, 2008 04:57AM Sociologist wrote: Hi Daisy, I too was diagnosed with DCIS in June. I had it in 2 different spots in my breast. After talking to several friends that had more than one lumpectomy to get cean margins, I decided the mast was the way to go for me. The doc agreed and also thought I couldn't tolerate the chemo or rads so this was a good choice. Good luck to you and keep us posted! Margaret",
      "MessageIndex": 5,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/698406",
      "Title": "What do I do?? crazydaisy crazydaisy"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Feb 7, 2008 03:35AM Sociologist wrote: Hi Pat, I'm a DES daughter. My mom had to take it after 2 miscarriages to keep me in for the long haul! I agree with Twink, it only we had a crystal ball...We had to make some hard choices when our youngest son (now 25) was 2 years growth delayed (at 6 he looked 4). He was given Humatrope (synthetic growth hormone) for 2 years to give him a shot of being over 5' tall (he now 5'6\"). The downside of our choice to give him a better chance of having a somewhat \"normal\" life is that he's sterile. I agree with Marin as well. We just have to take comfort in knowing we did the best we could with what we knew at the time. Best of luck to you and your daughter. Margaret",
      "MessageIndex": 3,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/699849",
      "Title": "DES and Breast Cancer Pat-I-Am Pat-I-Am"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Jun 17, 2009 06:55AM Sociologist wrote: Hi Missy, Sorry you have to join us but very glad you're here! The ladies on this site have kept me sane for almost 2 yrs. since my diagnosis. Like you, I had DCIS in 2 areas; one was grade 2 and the other 3. I opted for the mastectomy and didn't need radiation or chemo (which is why I chose that option). I had reconstruction and am in the process of scheduling a date to have my implant removed (it's not me and hurts like the dickens all the time!). Keep us posted on your progress. Tender, nice to see you! Take care. Margaret",
      "MessageIndex": 3,
      "PostDate": "17/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736007",
      "Title": "Just Diagnosed-feeling overwhelmed MissyKWVURN Deb-from-Ohio"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Jun 21, 2010 05:34PM Sociologist wrote: I just wore pants with pockets and put them in there. For showering, I just looped a long ribbon to keep them together and let it hang from my neck. Best of luck! Margaret",
      "MessageIndex": 6,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754382",
      "Title": "Drains Scrabblelady bigdogmom2"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 11, 2008 07:01AM Sociologist wrote: Hey Spar2, I meant buy the cocoa butter that's in the white tub. They also make a lotion but I found it not to work nearly as well for me. What I usually do is put it on first thing in the morning, when I get home in the afternoon, then after I take my shower at night. Maria, I still have these issues (I had recon in December). I had a rash under the mast site until I got the implant. It finally went away but I still have nerve pain everyday...hopefully the ps will take the implant out in December. I've just never adjusted to it. Margaret",
      "MessageIndex": 12,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721562",
      "Title": "Will I ever stop itching? Held Moderators"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 10, 2008 04:28PM Sociologist wrote: Palmer's Cocoa Butter (in the tub not the lotion) really helped me through the itching, especially during the expansion process. I occasionally have phantom pain where the nipple used to be...I just scratch it when I need to...the hell what other's think!  Margaret",
      "MessageIndex": 9,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721562",
      "Title": "Will I ever stop itching? Held Moderators"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 12, 2008 09:02PM Sociologist wrote: Hey Maria, Yes, I am going to deconstruct in December if I can talk the ps into it. I saw him in May to see if it could come out during the summer but he said it was too soon (6 months after it was implanted). It looks great but feels awful! It feels like it's under my armpit, just like the expander felt. I just have  one implant thank goodness (had a reduction/lift on the R breast at the time of the mast). As far as the rash...I've talked to several women that had this issue after a mast and it seems to happen to those of us undergoing recon. My rash never itched but did look like hives, just the skin stretching during expansion was itchy. It did freak the docs out though because they kept giving me antibiotics for it because they thought it was an infection of some sort. It did go away  about a week or so after the switch. Take care. Margaret",
      "MessageIndex": 14,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721562",
      "Title": "Will I ever stop itching? Held Moderators"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 16, 2008 07:17PM Sociologist wrote: Hey Danielle, I'm so sorry you have to be here but this is the best place to be for encouragement and support. I can't begin to imagine trying to wrap my head around all the questions you must have about having the gene and whether or not to have the surgery.  The best advice I can offer is to do your research about the pros and cons of the surgery and do what's best for you and your new family. The good thing is you don't have to make a decicion today or tomorrow; just take your time and do your research. I'm sure others who know more than I do about this will be along soon and be able to give you advice. Best of luck! Margaret",
      "MessageIndex": 1,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/722886",
      "Title": "I have the Gene-Is Surgery the Answer? dandee354 Bronwen"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Sep 27, 2008 05:25PM Sociologist wrote: Hey Samon, Here's another 2 cents...I had a mast on one breast with recon (silicone implant) a year ago and I can't wait to get rid of it! I had originally decided to not get recon but listened to friends that had been through bc surgery and almost all of them said I'd regret NOT having anything done. I wish now I'd listened to my gut and not be facing another surgery to get this thing out! I've never adjusted to having it. The thing is just think about what will work best for you. It's a tough decision and getting lots of opinions may help but at the end of the day, you have to be happy with whatever decision you make. There were days when I'd change my mind about 100 times...one minute no recon, the next recon. It just got so tiresome trying to decide. I kept playing the \"what if game\"...What if I look funny with just one boob? What if I look funny with an implant? What if people stare at me? What if hubby doesn't desire me anymore? What if made me nuts! I went ahead with the recon and once I made a decision I was fine...until now. I'm playing the \"what if\" game again myself, asking the same questions and it does suck! Everyone has their own unique perspective and things that work for some don't work for everyone. I wish it would be easy to decide....if we all had crystal balls and could see the future we'd be rich! I wish you luck, whatever your decision may be. Take care. Margaret",
      "MessageIndex": 17,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Feb 10, 2008 05:34AM Sociologist wrote: Hi Johnson, Words can't begin to express my sorrow for the loss of your child as well as the stuff you're going through now. Thant being said, FIGHT LIKE A GIRL AND CALL THE DOCTOR! As the other ladies have said, being in pain is no picnic and you need to be vocal about this. So what if a receptionist rolls here eyes at you and says \"You have to wait\", she isn't you nor is she in your pain (yes I had that happen... once with a different dr. and situation). You are your own best advocate and sometimes we have to get pushy to get what we need. Please, please, please get pushy and get in the door quickly to see someone! The waiting is the worst part for sure and telling you not to worry isn't going to cut it (or work!). We're human, we worry. Just know there are many of us who have been where you are and we're in your corner pulling for you every step of the way! Sending you good thoughts and please post again to let us know how you are. Margaret",
      "MessageIndex": 11,
      "PostDate": "10/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/699993",
      "Title": "Very Scared awaiting tests. johnson120 tygress"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Feb 10, 2008 04:37AM Sociologist wrote: Hi Jada, Glad Harold's gone (I just called my drains my \"testicles\"...there were 3 and one was with me for a month after the mast!). Sending you good thought for the remainer of the results. Kep us updated! Margaret",
      "MessageIndex": 5,
      "PostDate": "10/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/700044",
      "Title": "Eviction jadatemple crazydaisy"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 1, 2008 05:27PM Sociologist wrote: Hey Kerry, I hemmed and hawed until about 2 weeks before the mast and decided to go with opinions I'd gotten from others as well as some of the things I'd read (better balance if something's there, clothes fit better, feel better about appearance when you still see something there after surgery, etc). I just haven't adjusted to the implant. I have almost as much muscle pain as I did with the expander and I wasn't expecting that. The nurse practitioner at the ps' office said the implant may be pressing on a nerve and that's what's causing the pain. She also told me that some folks just don't adjust to having it...I am probably in that category. The boobs look fabulous. I had a reduction/lift on the R breast and it's great! My boobs look like they're 15 and I'm 52! I do have an appt. Nov 18 for the surgeon for my 6 month checkup and will probably see the ps then as well. I have talked to a few others that were deconstructed and their docs had them wait 2 yrs. before they'd do it. I guess because our bodies have been put under so much stress with surgery and recon it may take that long to get used to everything. If I have to wait another yr, then that's what it'll be. I do a lot of deep breathing and feeling myself up though Massaging the implant actually makes it feel a bit better but I can't go around all day everyday rubbing my foobie! Best of luck in your decision! Margaret",
      "MessageIndex": 19,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 29, 2008 05:42PM Sociologist wrote: Hi Ladies, Got back from the ps a couple of hours ago and he wants me to see a pain management doc before he'll remove the implant. I spent the last couple of hours crying and being REALLY PISSED!!!!! He believes the pain isn't with the implant but the tendon holding the implant and pain management may help. I am allergic to codeine, darvon, vicodin, percodan, and oxycontin...the only one I can take without hugging the toilet is meperedine which most don't like to prescribe. Lisa-e and Nagam, I totally agree with you in that an informed decision should require that ALL alternatives should be presented in an unbiased manner. They briefly mentioned not doing anything but talked more about what they could do to make me \"whole\". I am whole with or without a foob! His nurse spent a half hour on the phone with me a few minutes ago and said because I had such a good outcome he may be reluctant to undo his work (same thing you said Barbara). She's great and is making the required appt with the pain doc for me. Hopefully it'll be a short visit and he'll tell me he can't do anything for me and I can get this beast out of my chest! Thanks for letting me rant. Now where did I put that bottle of vodka and my scalpel... Margaret",
      "MessageIndex": 52,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Nov 6, 2008 06:12PM Sociologist wrote: Hey Maura, You just have to do what feels right to you. I only had cancer in one breast and that's the only one I had done. For me, I don't think I could have handled dealing with everything at once. If I went with my gut from the beginning, I wouldn't be arguing with my ps to remove this implant! I love your comment to the hairdresser! Some people should just shut up when they don't know the right thing to say. Time is on your side for making your decision. I'm sure others that are more familiar than I will be along shortly. Best of luck! Margaret",
      "MessageIndex": 55,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Jan 31, 2008 03:53AM Sociologist wrote: Hi MLM, So sorry you have to join us but you're in an excellent place for support! My children are old (28 and 25) but I have 3 grandchildren (8, 4, and 2). The 2 year old I didn't say anything to because anything not Elmo or Dora she doesn't understand. For my other 2 grandchildren, I told them that Maw-Maw had a boo-boo in her boobie (and yes I did use boo-boo and cancer) and that the doctor needed to take it out (of course there was an immediate song from my grandson about boo-boo boobies which was great!). That was enough. I let them ask questions (\"Does it hurt? Can I see it? and my favorite \"Can we still go to Chuck E. Cheese?) and answered them honestly (the trip to Chuck E. Cheese after surgery was interesting and definetly when you want to have 2 things: help with the kids and pain pills!). You kinda have to tell them enough so they'll know (they always know so hiding things is never a good idea) but you also don't want to overwhelm them with too much info. Play things by ear and let their question be a guide as to what you'll say. After the mastectomy was completed, they came to the house and had other questions (\"Can I see it?\" \"Why don't you have a boobie and where did your nipple go?\" and \"Will it grow back?\"). I did show them the scar (after it stopped being \"yucky\" as the 4 year old would say) and was very honest with them if I was tired or in pain. They liked seeing the new boob get bigger after the fills (I told them it was a very special balloon in my body so the doctor could give me a new boobie). The 4 year old was fascinated by that. She crawled on my lap one night when I still had the expander and told me \"Maw-maw, that boobie isn't squishy like the other one\". When I told her I was getting a soft boobie for christmas, her eyes lit up and said \"From Santa?\". It was toooooo cute. I broke into song and started singing \"All I want for Christmas is my new boob-ie, my new boob-ie, my new boob-ie\". It was funny and got funnier when her pre-k teacher asked me about the song when I picked her up one afternoon because they were learning \"All I want for Christmas is my 2 front teeth\" and she told her teacher that wasn't the song and proceeded to sing her my version. I know this is an overwhelming and difficult time for you and your family. Shirlann is a pro at this and always gives good advise and I agree with her and Cynthia. The only pearls of wisdom I can offer is this: Cry when you need to, try to keep a sense of humor because it really helps especially in the dark days, and hug your little man as much as you can-it'll make both of you feel wonderful! Take care. Margaret",
      "MessageIndex": 5,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/699458",
      "Title": "Diagnosed last week MLMClive LittleFlower"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "May 30, 2009 11:48PM Sociologist wrote: Hi Cajunlady, Are you from Louisiana by any chance (I live in Metairie and had my surgery at Ochsner)? I had a L mast 20 months ago. I came home in jammies with a button front top. Brought safety pins for the drains (I had 3) but found it was easier when I wore knit pants with pockets to keep them in. One was removed the first week; one the second week; and the last a month after the mast. They were like having testicles and boy am I glad I'm a woman! Best of luck. Margaret",
      "MessageIndex": 11,
      "PostDate": "30/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/734983",
      "Title": "What to expect with a Mastectomy? floridian tnmtnmomma"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Nov 21, 2008 05:51AM Sociologist wrote: Hi Cleomoon, I'm no expert about this but from what I understand is that breasts have their own estrogen supply and some breast cancers are feed by estrogen. When we're young, our breast tissue is usually very dense and as we age and go through menopause, the tissue becomes fatty.  Some studies have linked fat in general (being normal weight with fatty breasts or just being overweight) to increased incidences in breast cancer. Also, some women going through menopause may take hormone replacement which could increase their chances of developing breast cancer. We are also exposed to estrogen-like chemicals in the environment (such as some cosmetics, foods, plastics, etc) which some suggest could lead to an increase in breast cancer. In the end, cancer is cancer and it doesn't matter how one \"gets\" it....it just sucks! Hope I've answered some of your question. I'm sure someone who knows more than I will come along shortly! Margaret",
      "MessageIndex": 1,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724811",
      "Title": "Not sure where to post this question cleomoon wishiwere"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Jan 15, 2008 04:17AM Sociologist wrote: Hi Marlee, I did the expander and recon on the bc breast and regret that I DID THAT. It's more trouble than it's worth and will probably get the implant out during the summer. It's not worth all the crap and hubby doesn't care, just wants me healthy, happy, and in no pain! Good luck in your decision. Margaret",
      "MessageIndex": 138,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 28, 2008 07:42PM Sociologist wrote: Hi Ladies, Just want to add my 2 cents...I was reconstructed in December and HATE THIS FOOB! I have a ps appt tomorrow afternoon to see about being deconstructed. I have a silicone implant and the boobs do look wonderful but feel awful. The mast side is always sore and feels almost as uncomfortable as the expander. I saw the ps 6 months after the exchange and told him I wanted it out then and he said \"No, it's too soon\". I thought I had a say in this!!! I'm to the point that I should have a few strong Bloody Mary's and hop on the kitchen table and take this thing out myself! If he doesn't agree to remove it in December after my semester is over, I will find another surgeon to do it. Barbara, I love the breastfree.org site! I wish I'd see it BEFORE the recon so I wouldn't be in the pickle I'm in now! I think it provides a very needed service for people so they can truly weight all their options for recon or not. I'd originally decided against recon but others I knew that'd had breast cancer and recon kept telling me how much I'd regret not doing it, etc. I should have trusted myself more on that for sure. No worries though...everything in life is a learning experience and with that, I learned to trust my own judgement. Thanks for devoting so much time and energy to that site (and this one too!). Thanks for listening. Yall have a good night. Margaret",
      "MessageIndex": 48,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Oct 4, 2008 05:12PM Sociologist wrote: Hey Kjbell, Just want to send good thoughts your way. Please poste again and let us know how things are going. Take care. Margaret",
      "MessageIndex": 5,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722109",
      "Title": "This is scary kjbell Sociologist"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "May 28, 2008 06:30PM Sociologist wrote: Hi Ladies, Just want to add my 2 cents to the conversation...I had a mast w/recon in July 2007. I had a silicone implant \"installed\" in Dec 2007 and I HATE IT! While the ps did some beautiful work on the recon and lift side, I hate the feel of the implant (and no temperature control...that thing felt 10 degrees colder in the winter!). I was going for my 1 yr. check up last week and to ask the dr. to remove the implant (he said \"No it's too soon\"). They found a 1 cm. mass at the mast site so maybe my wishes will come true and I can get this puppy out! Best of luck on your decision. Margaret",
      "MessageIndex": 22,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "Sociologist…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/55529/profile",
      "Content": "Feb 7, 2008 04:15AM Sociologist wrote: Hi Shay, I was dx with DCIS and had it in 2 quadrants. One was grade 2 and the other 3. I opted for the mast because I couldn't deal with chemo/rads and possible additional surgeries if they didn't get clean margins (unlikely because one was close to the nipple and the other the chest wall). I'm very happy with my choice. Best of luck! Margaret",
      "MessageIndex": 11,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699847",
      "Title": "Multifocal DCIS Mastectomy or no? ShayRN HelenaJ"
    }
  ]
}