{
  "AuthorID": "sockmonkey",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57977/profile",
  "Posts": [
    {
      "AuthorID": "sockmonkey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57977/profile",
      "Content": "sockmonkey wrote: 3rd time in 9 years dealing with breast cancer that has spread. The first time to my other breast and the second time to my chest wall. Now I'm on femara (after having my ovaries & fallopian tubes removed to lower estrogen) to shrink tumor in the lymph note in my neck. Has anyone else experienced breast cancer that has spread to their neck??? My oncologist wants me to have a Pet scan next month...but I'm very anxious. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694162",
      "Title": "Breast cancer spread to lymph node in neck sockmonkey yangtan"
    },
    {
      "AuthorID": "sockmonkey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57977/profile",
      "Content": "Oct 21, 2007 09:38PM sockmonkey wrote: Dear Sallyk & Katie 11, Thanks for the reply. I'm a newbie @ this site. I've notived that the nodes in my neck are up and down a lot, but I definitely have cancer in this site because of the biopsy results. I haven't been able to find out too much info on this either. My onco said I just have to wait until I have my PET scan to see what the next step is going to be. I hate the waiting part...Are either or you on Femara or other hormonal treatments? ",
      "MessageIndex": 3,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694162",
      "Title": "Breast cancer spread to lymph node in neck sockmonkey yangtan"
    },
    {
      "AuthorID": "sockmonkey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57977/profile",
      "Content": "Oct 23, 2007 11:04PM sockmonkey wrote: My breast cancer spread to my chest wall after a bi-lat mastectomy. Now I have a tumor in my lymph nodes in my neck. Whenever I feel pain anywhere I get terrified & anxious. I'm on Cymbalta & Klonopin. I firmly believe that pain in your body, causes pain that takes over your psyche.  At times I also wonder if I could take pain meds if it would help me feel better...What about you?",
      "MessageIndex": 3,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/694204",
      "Title": "Pain from mets? Or is it all in my head? Kelolo Kelolo"
    }
  ]
}