{
  "AuthorID": "Soconcerned…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105519/profile",
  "Posts": [
    {
      "AuthorID": "Soconcerned",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105519/profile",
      "Content": "Soconcerned wrote: I'm writing about my Mom and looking for similar experiences because I need to hear a positive outcome. My Mom was diagnosed IDC,  ER+ PR+ HER-, 3 tumors same breast and quadrant (1) 1\", (2) 1/2\". Node biopsy positive. Stage 3. Mom went to cancer research hospital. Clean chest, ab, and pelvic CT, clean bone scan(they said her bone scan showed arthritis all over her body, even her ribs! I hope they are sure it is arthritis) at diagnosis in Feb. Surgeon wanted Neoadjuvant Chemo then mastectomy, more chemo, radiation, horomone therapy... her surgeon kept refering to her treatment as \"the kitchen sink\" I think Cytoxan and something else that required a baseline heartscan. Surgeon said she would futher stage after surgery. Mom completed 6 of 8 Neoadjuvant chemos. Supposed to be every other week. Mom was so sick most were 3 and 4 weeks apart. Dehydration, No white blood cells, anemia, low bp, low oxygen saturation, fainting, mouth sores, crazy nauseated. Young Oncologist says he's never seen anyone have such a hard time with so many complications but doesn't back off the dosage. And a week after 6th treatment she gets pnuemonia, then sepsis, then kidney faliure, respitory failure. Did I mention my Mom is 55 with no major medical problems before BC. She amazingly pulls through. Been a month in the hospital just got out. They stopped chemo just trying to get her well enough to see if she can have surgery which may take awhile. Shes using a wheelchair or walker to move through the house but she doesnt move a lot mostly in bed. So here is my questions if we wait a few months after she has discontinued treatment for her to \"get better\" so she can have surgery, what happens to the cancer? Because I am about to freak out! I feel like we are missing our window of opprotunity for a cure. Has this happened to anyone else? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755686",
      "Title": "Discouraged Soconcerned AnacortesGirl"
    },
    {
      "AuthorID": "Soconcerned…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105519/profile",
      "Content": "Jul 23, 2010 08:51PM Soconcerned wrote: Thanks for all of your posts. My Moms Oncologist is young and just finished his fellowship. My Mom was also not working and without insurance when diagnosed. She is on state Medicade. They have not done any PET scans. The only scans were when she was diagnosed and they have not done any to see what effects the the chemo have had on the tumors. I'm not sure why that is, maybe it's because of her insurance. My mom was getting weekly shots, at one point daily of some kind of drug that was supposed to go into the bone marrow to boost blood cell production, not sure of the name. They did do weekly blood draws to check blood counts. My mom was hospitalized through some of her treatment and put in isolation and on oxygen because of extreme low blood counts. Actually she was even on oxygen at home because of such low red counts. And they did do transfusions, plasma, platlets once she was admittited with the sepsis, pnuemonia after she hemmorraged while putting in a central line in the ICU. I'm not real happy with her Oncologist. My sister called his office because my mom was really sick. My mom said she was too weak to stand and had bad hand and foot pain. His nurse called back and said she talked to the DR and it was normal chemo complaints and it would pass. My sister took her to the ER where she had to be lifeflighted to a larger hospital. At that point her bp was 50/30 oxygen sat 70 with maxed output on oxygen mask. Thats when she had the pnenmonia and sepsis. When I flew in immediatley from out of state. The ICU docs didn't know if she was going to survive. But again she did. I feel her chemo has not been managed well but I think I'm just a little bitter wanting someone to blame. And I choose to blame hime because several times this oncologist has said to my family \"ive never seen...\" And I'm thinking then call your friends with grey hair and see is they have \"seen\" because your missing something. I think it has been too toxic for her can't they adjust dosages?",
      "MessageIndex": 5,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/755686",
      "Title": "Discouraged Soconcerned AnacortesGirl"
    }
  ]
}