{
  "AuthorID": "SoLinda",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165811/profile",
  "Posts": [
    {
      "AuthorID": "SoLinda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165811/profile",
      "Content": "May 6, 2013 11:20AM SoLinda wrote: I've been on warfarin for the past 7 months and my INR is getting more unstable (I was on Lovenox for 14 months after a pulmonary embolism).  Still having weekly INR tests. I miss having the Lovenox injections - they were so much easier to deal with!  Unfortunately, soooooooooooooooo much more expensive, too.  The drs. want to keep me on anticoagulants at least until I finish taking Anastrozole in another 3+ years, but this will depend on my Factor VIII blood clotting level.  Is anyone here having Factor VIII level tests, too? It is all so confusing - my new level is showing 68% and I have no idea what this means ...  I would love to hear whether anyone is taking the new anticoagulants ... My docs. will not let me take melatonin either ... it does not, not, not combine with warfarin .  However, this past week after having tests to see if I had another pulmonary embolism, I was diagnosed with arrhythmia and was given beta-blockers for my lovely, racing heart and breathlessness.  It is helping me sleep ...",
      "MessageIndex": 19,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802641",
      "Title": "Blood clots or DVT's K-Lo gonegirl"
    },
    {
      "AuthorID": "SoLinda",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165811/profile",
      "Content": "May 7, 2013 05:22AM SoLinda wrote: Oh, K-Lo!  Thank you sooooooooo much for your extremely kind, lovely offer!!!  I can't even start having the injections again because what would I do when the boxes run out ...  The injections are so unbelievably expensive here that it is impossible for me to continue with this treatment - for example - minimum wage is around R$700 per month and one day of injections costs R$150!!!!!!!!!!!!!!!!!  I had injections for over a year and now, I am done!!!  I am going off to the lab this morning to have my blood tested again and will be back in contact with my dr. some time today!  Thanks again for your offer    ",
      "MessageIndex": 21,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802641",
      "Title": "Blood clots or DVT's K-Lo gonegirl"
    }
  ]
}