{
  "AuthorID": "solorzw",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93932/profile",
  "Posts": [
    {
      "AuthorID": "solorzw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93932/profile",
      "Content": "Dec 2, 2009 04:14PM solorzw wrote: Thank you for the help. I am scheduled for a biopsy early next week. The radiologist informed my Doc that a biopsy would be the best option for now. So, I was all upset for nothing. I'm just a little nervous but happy that my mom and sister are going with me. My gut was telling me to take care of the situation and not wait. Good luck with your biopsy as well.",
      "MessageIndex": 2,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744823",
      "Title": "MRI or Biopsy solorzw kat56"
    },
    {
      "AuthorID": "solorzw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93932/profile",
      "Content": "Dec 11, 2009 11:10AM solorzw wrote: I had the aspiration and it is not a cyst like they thought it was. Now it is my choice to decide between a core biopsy or a surgical biopsy. My question is, should I stick with my family doctor or switch to a breast surgeon? Any advice would be helpful as I am new to all of this. Thank you : )",
      "MessageIndex": 5,
      "PostDate": "11/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744823",
      "Title": "MRI or Biopsy solorzw kat56"
    },
    {
      "AuthorID": "solorzw",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/93932/profile",
      "Content": "solorzw wrote: I went in to get a mammo and ultrasound because of pain in my right breast. They found a lump that they think is just a cyst because I'm only 34 and there has not been any breast cancer in my history. However, they are not sure and the radiologist wants to do a biopsy but my doc said no biopsy and just do an MRI. I am new with all of this and would like to know what path is the best to take. He also told me I could wait 6 months and see if it \"goes away\". In my opion, unless you are 100% sure the lump is a cyst and not a tumor, why wait 6 months? Plus I have pain and tenderness that does not go away with my monthy cycle. Any suggestions? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/744823",
      "Title": "MRI or Biopsy solorzw kat56"
    }
  ]
}