{
  "AuthorID": "solohiker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200188/profile",
  "Posts": [
    {
      "AuthorID": "solohiker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200188/profile",
      "Content": "solohiker wrote: I have been lurking on these boards for six days, ever since the doctor said \"you have breast cancer\".  This news came after two mammograms, a molecular breast imaging study, and a core biopsy.  The doctor said my suspicious ugly lump was surely cancer, and although we needed to wait on pathology, he was going to schedule me with the surgeon.  So I came here to this wonderful site to learn from all of you.  I spent hours each day and half the night, reading so many different threads and following so many of your personal stories.  Today I just received my pathology report and the diagnosis is atypical ductal hyperplasia, not cancer.  Instead of the mastectomy that was being planned for, I will be seeing the surgeon for an excisional biopsy.  When the tears of relief and hugs were done, I walked to my car, got in, and thought \"but what about them?\"  All I can think about now are all the wonderful warriors I have been secretly getting to know on these discussion boards.  Sure, I got good news today, but all you brave warriors did not!  I sincerely hope that I am in no way upsetting any of you, as that would crush me.  I only want to express what a godsend you all have been to me.  I was in a very dark place and you all \"got it\" and gave me hope.  I can't express how grateful I am to you wonderful souls.  I may not be joining the bc ranks at this time, but I absolutely want to be a warrior in spirit with you.  I will be looking for ways to pay this forward, as I never want to forget you.  With many thanks and many blessings... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820919",
      "Title": "Riding out the storm solohiker Redheaded1"
    },
    {
      "AuthorID": "solohiker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200188/profile",
      "Content": "May 9, 2014 09:02AM solohiker wrote: Cammy, thank you for sharing that! You all have certainly brought tears to my eyes too, both happy and sad tears.  I promise to say many prayers for all of you.  I just learned that the director of diagnostic imaging is being criticized for purchasing the new machine that detected my precancerous lump.  I wrote him a heartfelt letter expressing my gratitude that he had the courage to buy a machine that can help so many women.  Cammy, you hang in there, as well as the rest of you brave souls!",
      "MessageIndex": 3,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820919",
      "Title": "Riding out the storm solohiker Redheaded1"
    },
    {
      "AuthorID": "solohiker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200188/profile",
      "Content": "May 9, 2014 10:11AM solohiker wrote: Best to you too Ariom!  The part about slapping the doctor made me laugh out loud.  I must tell you though that just a few minutes ago, that doctor telephoned me at home and apologized for all I'd been thru this past week or so.  He was very sincere, hard for me to be mad at.  Of course, he also said there is that tiny chance that the next pathology report (after surgery) might tell us something bad.  But hey, you folks caringly beat it into me, just one day at a time.  ",
      "MessageIndex": 6,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820919",
      "Title": "Riding out the storm solohiker Redheaded1"
    },
    {
      "AuthorID": "solohiker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200188/profile",
      "Content": "May 9, 2014 09:16AM solohiker wrote: Coraleliz, I understand what you mean about hiking alone.  I love the \"my time\" to just think and admire my surroundings.  It is the best stress relief I have ever found.  And yes, I am also warned against it.  My dear significant other won't let me go anywhere out west, since he thinks I'll get eaten by a bear.  Wish you the best, thinking good thoughts for you!",
      "MessageIndex": 4,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/820919",
      "Title": "Riding out the storm solohiker Redheaded1"
    }
  ]
}