{
  "AuthorID": "Something152003",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262895/profile",
  "Posts": [{
    "AuthorID": "Something152003",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/262895/profile",
    "Content": "Something152003 wrote: Okay ladies, I am a little concerned here. I started out about a month and a half ago with a rash on my left breast. It spreads from just under my arm all the way to my nipple and about 1/3 of the way around. I chalked it up to just some dry skin at first but it continued to grow and become tender and under my arm is tender as well. Then a few weeks ago I started to notice some small lumps. Nothing big and they seem to almost come and go and \"move around\" as in different places have lumps at different times. There is a constant ache now all the way from my nipple to my armpit and my nipple is so tender I cannot stand for even the shower water to touch it. I went to my ob/gyn when i found the lumps and he referred me for a mammo and ultrasound. The mammo showed NOTHING even though I can clearly feel lumps. And she also said I do not have dense breast tissue so it was easy to read. She did an ultrasound as well and she could feel the lump but she could not see it on the ultrasound . She said she thinks it's fat deposits because I have lost 18 pounds in the past 2 months (not on purpose). She cleared me on the mammo and ultrasound so I felt a little better. But this rash and pain will not go away.. I have tried every kind of cream for fungal infections, bacterial infections, allergic reactions, even tried different essential oils. It will act like it's going to get better and them BAM its right back. Now I'm reading how sometimes a mammo or ultrasound can miss things?! I'm freaking out again... any kind of advice would be great. I am in nursing school and I didn't even know a thing like IBC exsisted until I googled my rash! Of course my ob/gyn yelled at me for not coming in sooner.. I'm only 32 and have had a hysterectomy but not due to anything cancer related. I just need someone to ease my mind or at least some advice on where to go from here. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "09/11/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859995",
    "Title": "A little concerned.. Something152003 MTwoman"
  }]
}