{
  "AuthorID": "somewherein…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122118/profile",
  "Posts": [
    {
      "AuthorID": "somewherein…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122118/profile",
      "Content": "Apr 26, 2018 10:18PM - edited Apr 26, 2018 10:25PM by somewhereinbetween Good Evening, Well all of that is fine. I had iissues with bras and sizing long before my diagnosis. It's different now. I have a fear about intimacy or getting close with the opppsite sex, or having to undress. I mean I'm okay on some level since my diagnosis in 2010. I'm somewhat comfortable but conscienous of the missing part of me. How do you feel okay enough to explore with relationships without feeling you have to give up ever being in one because of the part that is missing about me. I realize like there is so much more to me and I have some many other great qualities. How do you adrress the issue or when is it appropriate without feeling a sense of inadequacy?",
      "MessageIndex": 59,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "somewherein…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122118/profile",
      "Content": "Feb 13, 2011 01:14PM somewhereinbetween wrote: I just want to thank everyone for the encouragement being sent via the internet.Since being diagnosed with breast cancer my life has changed in very small and subtle ways. For instance my thinking is beginning to follow a certain pattern. It seems that I am more intuned to what's going on around me and i am more apt to live in that moment. Even when I want to cry, I just just laugh and savor the moment enjoying others experience as my own. I understand that all women do not have to die from their misfortune and can live full lives, but the reality of living with any cancer is that eventually it becomes terminal, whether this true or not. I must face the reality of my fate. Although I am encouraged, I am afraid of living. So while I savor the breaths I take, I know that each day counts towards the rest of my life.",
      "MessageIndex": 11,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764766",
      "Title": "Encouraging News I Hope.. !!!! mackers67 mackers67"
    },
    {
      "AuthorID": "somewherein…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/122118/profile",
      "Content": "Feb 18, 2011 03:57PM somewhereinbetween wrote: Today I must make a decision based radiology reports that the cancer is covering the entire breast area and now must have a complete masectomy. This is a bit frightening since I'm not sure of what to expect. It really has taken my breath away however I'm still encouraged. Sign Somewhereinbetween",
      "MessageIndex": 14,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764766",
      "Title": "Encouraging News I Hope.. !!!! mackers67 mackers67"
    }
  ]
}