{
  "AuthorID": "Sonata",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
  "Posts": [
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Mar 29, 2013 06:25PM - edited Mar 29, 2013 06:27PM by Sonata I am not positive, I am not negative...I am real. Some day I'm real positive, some days I'm real negative, other days I just don't give a damn one way or the other. But I'm real all of the time. I've learned who I can be myself around, and who I need to 'pretend' around because they can't handle reality. I believe for the most part that people have good intentions. But there are days when I just don't need to hear things like \"You can beat this!\" or \"God won't let this kill you\". I also believe that if you don't know what you're talking about, you really ought to keep your mouth shut. Something else that irks me is when those same positive people look at me and say \"Well, you look good, so it must not be THAT bad\". (Btw, your idea of looking 'good' is REALLY warped! I'm in my 30's, look/feel like I'm 70, no boobs...I could go on.) WTF am I supposed to look like?? Your impression of a terminal cancer patient is NOT the same as it used to be. I'm out living my life as best I can for as long as I can. When I can do it no longer, then I will lie in bed and wilt away gracefully (I hope). But just because I'm up walking around, purposefully living life and making memories with my kids, DOESN'T MEAN I'm not in pain or sick or fighting for my life. I just choose to live through it as best I can. I mean you've got to be kidding me, right? I'm supposed to look more like your idea of a cancer patient just so you will feel better about giving support and remaining positive? Give me a break. This is MY fight, damnit! I'll get through it however I need to...whether you like it or not. I know they mean well, but let's be REAL! I mean, what part of terminal do you not understand? ~Cate",
      "MessageIndex": 84,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 2, 2013 11:45AM Sonata wrote: Preach it, Angelfalls. ;)",
      "MessageIndex": 99,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800634",
      "Title": "Just think positive... BouncingBetties PinkShirtNow"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Nov 7, 2011 12:27PM Sonata wrote: Blessings -- So sorry to hear that you are sick and your surgery had to be rescheduled. :( I can imagine how difficult it is to mentally/emotionally prepare yourself for such a major surgery, only to be told at the last minute that it will be delayed. My hopes is that they are able to reschedule you pretty fast. Rest, get yourself well, and get back to that OR! :)",
      "MessageIndex": 8,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777654",
      "Title": "Drat! I caught a cold.....can I still have my BMX in two days? Blessings2011 Sonata"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Mar 27, 2013 05:22PM Sonata wrote: I haven't been around in awhile (9+months) due to a stroke, but I've spent the day reading and catching up. This post caught my eye because I believe I can answer you in the most simple of ways --- Its like coming 'home'. After being gone for so long, I was afraid that no one would remember me, or that I'd have to start all over again...but truly that isn't the case. As soon as I posted my return, I felt at home, like I'd never been gone. Yes, I've missed so much. But every day is precious and I look forward to what time I have left to be able to spend it here amongst family. I get such comfort and love reading and posting here, a connection I'm unable to get in most other ways because you all understand the road I'm on because we're all traveling on it together. I hope that makes sense to someone. XOXO",
      "MessageIndex": 50,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802014",
      "Title": "How do you get the emotional stamina to stay on the forum? AnacortesGirl ThereseD"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Dec 30, 2011 12:13PM Sonata wrote: I too slept in a recliner for the first 2 weeks following surgery on Nov 14th. I did not have reconstruction, just the BMX. Once I got the drains (all but 1) out, I began sleeping in the bed. But I still had pillows all around me. It was a few days before I could turn and sleep on my right side just because of the soreness of the drain sites. I could not sleep on my left side for a few more weeks because I still had 1 drain in on the left side. I just got it out the monday before Christmas. Although it was much easier for me to get myself up and down out of the recliner, I was much more comfortable and slept much sounder once I was in bed. Good luck in February!",
      "MessageIndex": 13,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780193",
      "Title": "Sleeping after Surgery mary625 Outfield"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 3, 2013 04:18PM Sonata wrote: If it is nothing, wonderful! If its something, you'll be glad they found it. Perspective. ;) I hate that you even have to spend a moment worried about it. I wish it would just leave us all the hell alone. Hoping the best news for you, Diane. Keep us posted.",
      "MessageIndex": 11,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802397",
      "Title": "\"deja vu all over again\"? DC197 AnacortesGirl"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 10, 2013 06:33AM Sonata wrote: I too feel the desire to reach out to others who seem to be in the same road. I usually just acknowledge them and wait patiently for them to approach me. That's hard for me if I see them struggling. But I remember how I've felt and the last thing I want to do is be pushy, offering unwanted advice. So I may just send a card that simply says, \"Thinking of you, my prayers are with you, here for you\" sort of thing. That way they know the door is open always. ~Cate",
      "MessageIndex": 12,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803036",
      "Title": "Reaching out to other cancer patients. What do you do? Fitztwins Fitztwins"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jun 14, 2012 10:37AM - edited Jun 14, 2012 10:39AM by Sonata Wonderful news to hear, Ann! Hope your tooth is feeling better.",
      "MessageIndex": 107,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788744",
      "Title": "Tooth - sinus infection, seriously ill CoolBreeze bhd1"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jun 12, 2012 03:49PM Sonata wrote: Having a real struggle today. I can't get the 'what's the point of any of this?' out of my head. How do you decide what and how much to do going forward when really its gonna end up the same no matter what?? It's all about quality of life for me. Of course I want to give myself as long as possible with my children. But I also want to be able to enjoy that time, not be so sick and fatigued that I can't enjoy that time with them. How do you find that balance? I'm just feeling a little lost right now. :( ~Cate",
      "MessageIndex": 30,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788796",
      "Title": "Feeling alone...and facing a new reality Sonata rosasmommy"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Sonata wrote: While I'm not ready to admit it, I belong here. As hard as it is for me to do, I'm finally allowing myself to reach out. I realize that ignoring it will not make it go away. And I need the support of others who truly understand the thoughts and feelings I'm having. First, I'll share what I posted earlier on 'Just Dx'd with Recurrence/Metastasis' board: **I've been putting off posting even though I've known the results for awhile. I thought posting would make it real and I'd have to face it, and I haven't wanted to do that. Is that normal, or is something wrong with me?? I left the Dr's office after hearing the findings, came home and ignored everything. Sure, I visited the board, played mindless games...but wouldn't allow myself to share anything with you all. I even kept myself from reading others posts for fear of letting myself feel something. But the time has come to face reality. Call my absence whatever you will, I was/am scared. That feeling hasn't dissipated, nothing has changed. I just know I cannot do this alone. I realize I need YOUR support---I know you understand. While I have many caring, supportive people in my life, suddenly I feel so alone. So here it is...my new reality---Mets....to several cervical anterior/posterior lymph nodes, cervical/thoracic vertebrae, sternum, and a rib. I still have no desire to talk about it, so please bear with me. Giving the 'facts' is all I can manage right now. I'm still adjusting to what it all means. I realize there are many of you who know what this feels like. A little encouragement would go a long way....** This is harder to accept than I ever imagined. There is no word to describe the state of mind I'm currently in. Will it get better? I have young kids to raise! I have to say I hoped that I'd never have to join your 'club'. Do you mind helping a girl feel like part of the family we never hope to become part of?  ~Cate ~Cate.\"For our light and momentary troubles are achieving for us an eternal glory that far outweighs them all.\" ~(2 Corinthians 4:17) Hormonal Therapy 4/2/2012 Arimidex (anastrozole) Dx 5/2012, IDC, Stage IV, mets, ER+/PR-, HER2- Hormonal Therapy 5/24/2013 Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788796",
      "Title": "Feeling alone...and facing a new reality Sonata rosasmommy"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jun 11, 2012 08:42AM Sonata wrote: Ladies, I want to say thank you for reaching out, for embracing me with love and support. I knew this would be the one place I would find acceptance and reassurance. I am making the choice to move forward. I am taking back control. I may be stage 4 but I am far from the end of my life. Thank you for being there for me, for being patient while I adjust and come to terms with my new reality. I look forward to getting to know you all. I hope to gain encouragement from the paths you've walked ahead of me and the battles you've all fought. I will be praying for all of you. Hugs to everyone! ~Cate",
      "MessageIndex": 27,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788796",
      "Title": "Feeling alone...and facing a new reality Sonata rosasmommy"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Sonata wrote: While I'm not ready to admit it, I belong here. As hard as it is for me to do, I'm finally allowing myself to reach out. I realize that ignoring it will not make it go away. And I need the support of others who truly understand the thoughts and feelings I'm having. First, I'll share what I posted earlier on 'Just Dx'd with Recurrence/Metastasis' board: **I've been putting off posting even though I've known the results for awhile. I thought posting would make it real and I'd have to face it, and I haven't wanted to do that. Is that normal, or is something wrong with me?? I left the Dr's office after hearing the findings, came home and ignored everything. Sure, I visited the board, played mindless games...but wouldn't allow myself to share anything with you all. I even kept myself from reading others posts for fear of letting myself feel something. But the time has come to face reality. Call my absence whatever you will, I was/am scared. That feeling hasn't dissipated, nothing has changed. I just know I cannot do this alone. I realize I need YOUR support---I know you understand. While I have many caring, supportive people in my life, suddenly I feel so alone. So here it is...my new reality---Mets....to several cervical anterior/posterior lymph nodes, cervical/thoracic vertebrae, sternum, and a rib. I still have no desire to talk about it, so please bear with me. Giving the 'facts' is all I can manage right now. I'm still adjusting to what it all means. I realize there are many of you who know what this feels like. A little encouragement would go a long way....** This is harder to accept than I ever imagined. There is no word to describe the state of mind I'm currently in. Will it get better? I have young kids to raise! I have to say I hoped that I'd never have to join your 'club'. Do you mind helping a girl feel like part of the family we never hope to become part of?  ~Cate ~Cate.\"For our light and momentary troubles are achieving for us an eternal glory that far outweighs them all.\" ~(2 Corinthians 4:17) Hormonal Therapy 4/2/2012 Arimidex (anastrozole) Dx 5/2012, IDC, Stage IV, mets, ER+/PR-, HER2- Hormonal Therapy 5/24/2013 Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788796",
      "Title": "Feeling alone...and facing a new reality Sonata rosasmommy"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 15, 2013 07:04PM Sonata wrote: Just checking in on the numbers. I added my name long ago. Like someone else said. I just wish the list would be final. But alas, we all know that won't be. At least we aren't alone. And there is strength in both numbers and in prayers. Each one of you I count as my sisters. You've all blessed me. We share a common bond. We are united together because of our individual journey through breast cancer. While I struggle with 'thanking' God for having bc, I do thank Him for all of you. And yes, **** cancer! ~Cate",
      "MessageIndex": 244,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 9, 2013 12:26AM - edited Apr 9, 2013 12:27AM by Sonata #110 Frequent reader, just starting to post more often after a 9-month absence.",
      "MessageIndex": 128,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "May 14, 2012 08:32AM Sonata wrote: I am so glad I decided to open this thread! I read from the beginning all the way to the post before my own...and every word was priceless. Tears rolling down my face, belly hurting from laughing so hard. I really needed that as I haven't felt much like laughing lately. Thank you so much!",
      "MessageIndex": 116,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786827",
      "Title": "Just Need to Wank sbelizabeth autism_mom"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Nov 7, 2011 12:18PM Sonata wrote: I'm right there with you, Vanlex. But you already know that since we're having surgery on the same day! ;) I've got something to do every single day this week to keep myself busy. But that doesn't help in the 'quiet' times of the day, like once the kids are in bed asleep and the house is still and silent.....its then my mind starts racing. My anxiety level is through the roof right now. And my emotions are all over the place. Combine the 2 and I never know what to expect. Like yesterday at church, I was singing in the choir, which usually calms me. Right after we finished, my heart was racing out of my chest, my hands were shaking, I felt hot and dizzy. I had to go to the bathroom and splash cold water on my face. And it came as fast it went. Other times, I am overcome by emotions, usually tears that appear for no reason. I feel like I'm stressing out the friends/family around me, but I can't control it. They have no idea how it feels to be in my shoes and so, in turn, they feel helpless. We'll do what we must to make it through this week. Then we'll walk with our heads held high into the hospital on monday morning, ready to face our surgeries head on, with healing/recovery waiting on the other side. It may be a bumpy ride this week, and for a few weeks still after surgery, but soon this will all be in our 'rearview mirror'. Vanlex, I'm thinking of you. And my promise still stands...my prayers will be with you next monday morning. Good luck this week~!",
      "MessageIndex": 3,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777694",
      "Title": "Seriously? How am i supposed to focus this week? vanlex Sonata"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "May 15, 2012 04:01PM - edited May 15, 2012 04:01PM by Sonata I was 33 at the time of original diagnosis. My children are currently ages 9 & 7. Just recently, I was dx'd with a recurrence following a bilateral mastectomy in Nov 2011. Since I was still pre-menopausal, and am unable to take Tamox due to the way my body metabolizes it, I began Lupron shots so I could take an AI. My onc then put me on Arimidex. Just in case you're wondering why I didn't just choose to have an ooph to prevent having to take Lupron? Personal decision---I've had so many surgeries recently that I just cannot endure another. I've already had a hysterectomy in 2008. At the time, my gyn preserved my ovaries because I was still young...and still 2 years away from a major BC diagnosis. Btw, if I could rewind time, I would have the ovaries taken at the same time. Damned if you do, damned if you don't, right? At this point, I feel there is really no point in keeping my ovaries since I won't be having any more kids. And it will suck if at some point I'm able to stop all the drugs (unlikely) and my ovaries magically start working again---who wants to go from Pre-menopausal to complete Menopause back to Pre-menopausal!?!? I don't personally like putting all of those drugs in my system, but what can you do? Does it suck to be in menopause at 35 with 2 young kids? Of course it does! In the world of breast cancer, we sometimes have to make choices that we don't want to. You do what you have to do. This is what works for me at the moment. Good luck with your decision! ~Cate",
      "MessageIndex": 14,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/786623",
      "Title": "Sucking out the estrogen Wrongchick vacationbound"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Sonata wrote: When scheduling it, my BS office did not specify which kind of biopsy I'll be having. Its tomorrow morning, so I don't have time to find out ahead of time. So I thought somewhere here may know. Background information: This is my 3rd recurrence. I had a BMX back in November. It has recurred in my chest wall (muscle or ?), just to the left of my sternum. So since I technically don't have breast tissue, how will they do a biopsy and what kind will it be? I know its possible since they've scheduled it. I just wondered if anyone here has experience with this. Thanks. ~Cate ~Cate.\"For our light and momentary troubles are achieving for us an eternal glory that far outweighs them all.\" ~(2 Corinthians 4:17) Hormonal Therapy 4/2/2012 Arimidex (anastrozole) Dx 5/2012, IDC, Stage IV, mets, ER+/PR-, HER2- Hormonal Therapy 5/24/2013 Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/785998",
      "Title": "Curious about which biopsy I'll be having Sonata marie5890"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 5, 2013 02:05AM Sonata wrote: She was so young; it's just not fair. My sympathies to her family. May strength and comfort fall upon them. Rest in peace, sweet Elisha.",
      "MessageIndex": 3,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802759",
      "Title": "Elisha82 is an angel debbiej Gingerbrew"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Mar 30, 2013 12:27AM Sonata wrote: So sorry to hear your news, Penny. Prayers are with you. Hope your next treatment does what its supposed to and at least slows things down. ((Hugs))",
      "MessageIndex": 38,
      "PostDate": "30/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802359",
      "Title": "Scan today - put me to sleep until I get the results redwolf8812 Bondgirl"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Nov 8, 2011 09:47AM Sonata wrote: Does anyone know how long they recommend you wait before getting a tattoo to cover the scars? I'm just curious, as I haven't even had my surgery yet (Nov 14). But it gives me something to look forward to. ;) I definitely want to do it, seems natural to me since I already have 4 others.",
      "MessageIndex": 13,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/775884",
      "Title": "anyone get a tattoo over their surgical scar? Natters dfranken"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 2, 2013 09:47PM Sonata wrote: Oh dear. *tears*",
      "MessageIndex": 7,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799679",
      "Title": "Any news on Elisha82 debbiej KeepingFaith69"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jun 21, 2012 11:08AM Sonata wrote: I started out as 'SouthernSoprano'. No real surprise here, as I am a vocalist from the south. ;) I've been a soprano, singing in some way my entire life. Music is my passion. Then after awhile, I wanted to make it simpler. I found another musical term that I liked, hence the change to 'Sonata'. Its short and sweet.",
      "MessageIndex": 59,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788005",
      "Title": "Maybe I'm just nosey... LouiseBogle SuperFoob"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Dec 27, 2011 02:15PM Sonata wrote: Sorry, I was offline. I sent another PM to you just now. Thank you!",
      "MessageIndex": 6,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/780010",
      "Title": "Free pair Microbead breast forms goldiebelle Sonata"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 3, 2013 04:45PM - edited Apr 3, 2013 04:54PM by Sonata I agree with the wise women before me...AnneMarie, Sue, Chrissy. Our experiences are unique as are all of the choices of treatment we make. What works for you may not with someone else, or it could for a few. No matter what, it's a personal experience. Please respect what has already been said. Otherwise it's distracting and taking away from others posting here. ~Cate",
      "MessageIndex": 1234,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 3, 2013 07:11PM Sonata wrote: WooHoo!! It is in fact \"Wayne-be-gone\". Magic! I too wish it were available for real life.",
      "MessageIndex": 1236,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 11, 2013 09:57PM Sonata wrote: Well said, scuttlers! It's a shame that someone feels the continuous need to be a disruption and/or distraction, even after having been asked to cease and desist! Smh. After awhile, it becomes obvious their only objective is to inflict (more) pain upon those who've already had their fair share...and more. While I've blocked said person, seeing that he's still doing it and upsetting others, possibly pushing people away, makes me further upset. Just leave us the hell alone! ~Cate",
      "MessageIndex": 1306,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Mar 29, 2013 09:51AM Sonata wrote: My sympathies to her family and friends. Rest in peace, sweet Lynn1.",
      "MessageIndex": 42,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802377",
      "Title": "lynn1 bhd1 Leah_S"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Dec 27, 2011 12:20PM Sonata wrote: I sent you a PM this morning. Just making sure you received it. Thanks!",
      "MessageIndex": 3,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/780010",
      "Title": "Free pair Microbead breast forms goldiebelle Sonata"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Sonata wrote: I am so sorry it took so long to be able to update you. I just got home a bit ago from a 2 day stay in the hospital. I am SO glad I decided to head to the ER that night---it probably saved my life! I just knew something was really wrong. By the time we arrived at the hospital, so much more had happened. It scares me that I'd considered waiting. The Dr determined that I had a TIA (transient ischemic attack). I'm sure some of you know what that is, but for those who don't, its basically a mini-stroke. Its usually a prelude to a bigger, more devestating one. Anyone here with any experience with this at all? At least we are aware of it now and know what to be on the lookout for. It just complicates my life more. More Dr's, more meds. And yet another thing that can kill me. :( Again, thank you for your thoughts and prayers in my absence.  ~Cate ps. Oh yea, they also determined that I have compression on the nerves in my spine at the T1/T3 vertebrae. So that's a problem all on its own. ~Cate.\"For our light and momentary troubles are achieving for us an eternal glory that far outweighs them all.\" ~(2 Corinthians 4:17) Hormonal Therapy 4/2/2012 Arimidex (anastrozole) Dx 5/2012, IDC, Stage IV, mets, ER+/PR-, HER2- Hormonal Therapy 5/24/2013 Aromasin (exemestane) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789291",
      "Title": "Update on ER visit Sonata meima-Bev"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jun 14, 2012 09:15PM Sonata wrote: Oh my goodness, that was certainly a morning! I hope the nurse notified your Dr. Thinking of you, may you feel better soon. ~Cate",
      "MessageIndex": 3,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789122",
      "Title": "Oh what a morning! dreamwriter sincitydealer"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jan 13, 2012 09:26PM Sonata wrote: I've noticed it too! I just figured it was from lack of \"insulation\". :)",
      "MessageIndex": 6,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/780979",
      "Title": "Weird sensation when drinking hot or cold beverages Cats134 OBXK"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Apr 24, 2013 08:47PM Sonata wrote: So lovely! Thank you, Ebru, for sharing. ~Cate",
      "MessageIndex": 11,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803749",
      "Title": "This one for Soleil, also a must-read for ALL ..trust me :) stagefree NickyJ"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "May 15, 2012 03:30PM Sonata wrote: How many of you have gotten the 'brush off' by your doctors? My own personal experience has been this: I had a bilateral mastectomy with axillary node dissection on both sides back in November 2011. I have not had one day without pain since! I've seen my BS, Onc, a Pain Management Dr....all of whom have seemingly brushed my concerns off. I think its because they just really don't know enough about it, although it seems to have been a 'side effect' of breast surgery for decades. I'm SO tired of being in pain on a daily basis. Because of being brushed off, I have inadequate pain management. To make matters worse, I also have cording and some minor lymphedema in my arms.",
      "MessageIndex": 911,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "May 15, 2012 04:40PM Sonata wrote: Double mx back in November 2011, no reconstruction here. I personally have loved being flat, not having to worry about a bra, that very free feeling. My husband, not so much. :( He is/was what some would consider a 'boob-man'. Prior to the BMX, we had a long discussion about how things would be different, and he swore he would love me just the same. I'm sorry to say that hasn't been the case. He doesn't look at me the same, doesn't touch me the same and I'd guess doesn't feel the same way about me. On the rare occasion we might make love, he insists on my leaving a shirt on. *tears* Sorry, first time I've admitted that aloud. Do you know what that feels like, says to me?? That my BOOBS had more worth than my life does!! Does that make me regret the choice of no reconst? Not at all. My breasts did not define me. I am still me with/without them. I choose to be without. ~Cate",
      "MessageIndex": 88,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/786580",
      "Title": "What does your husband/loved one think about your flatness? otter otter"
    },
    {
      "AuthorID": "Sonata",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112916/profile",
      "Content": "Jan 13, 2012 08:07AM Sonata wrote: Enjoy!! I know my first one was heavenly...and like you, I stayed in forever since I hadn't showered in 4 weeks! :)",
      "MessageIndex": 9,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780938",
      "Title": "Prepare for a water shortage.. Cats134 Cats134"
    }
  ]
}