{
  "AuthorID": "Sophrosyne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
  "Posts": [
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Nov 10, 2015 09:23PM Sophrosyne wrote: Hi everyone! I am 5 days in and really haven't had any adverse reactions. I do feel tired, but that's just part of life for me even without rads. I am just wondering when the itching and burning typically start. Should I be trying to get ahead of it with aloe and cream now or cross that boob when I come to it",
      "MessageIndex": 1471,
      "PostDate": "10/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 9, 2015 07:47PM Sophrosyne wrote: Congrats on finishing Jane! My RO told me today it should take 2 to 3 weeks for healing after treatments are complete. I found out today that I miscalculated and will finish next Thursday instead of Friday :-). Starting this Friday its just boosts. I'll take it! I have been going to the gym at 5 (most days), Radiation at 7:10 and work from 8 to 5pm through this, so I have been incredibly tired.....on top of that the hot flashes are killing me from the Zoladex, so I don't sleep well. Will be good to have a least the Rads done.",
      "MessageIndex": 1995,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 10, 2015 06:37AM Sophrosyne wrote: Hi Keepwalking, I am in the camp of \"if it ain't broke, don't fix it\". I didn't apply anything until a couple of weeks into treatment when the dry itchy skin issues started. I think it's a delicate balance between getting the most out of treatment, not taking a chance on having to postpone treatments due to skin breakdown or infection and not being miserable. I never used anything two hours before or after. I have two small areas threatening to be an issue , but only two regular and 5 boosts left, so I feel like I'll make it without any postponements. Listen to your body. Best of luck with your treatment and recovery",
      "MessageIndex": 1998,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 10, 2015 01:16PM Sophrosyne wrote: Funny! I watched that too. Anything Dr. Oz has on, flies off the shelves. Told my husband to buy their stock today",
      "MessageIndex": 2007,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Oct 11, 2015 09:03PM Sophrosyne wrote: Hello everyone. I love the picture Keys-Plez! I had a lumpectomy back on August 24th and due to waiting on test results for a treatment plan, I am just going to the first radiation consultation on the 19th of October. I am really kind of terrified and glad to find a group of awesome people going through this too. It gives me hope :-) ",
      "MessageIndex": 763,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Nov 4, 2015 07:42PM Sophrosyne wrote: Hello everyone. I hope it's ok to join the \"party\"......ok, not so much a party. I had the first radiation treatment of 30 today. Very few people in my life even know I am going through this, so helping others and having a place to vent would be awesome. Wishing everyone the best!",
      "MessageIndex": 1337,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 8, 2015 08:05PM Sophrosyne wrote: Hi everyone, I have not really been keeping up here very much, so I apologize. Between work, Radiation, College and trying to run things at the hacienda, I've really just been keeping on keeping on. I am 22 down w/8 to go. Decided to take the rest of this week and next week off, so if any of the horrible stuff happens, at least I'll be at home. I am pretty red and had some itching, but overall not bad. I am very very pale and had expected more discomfort. I hope it helps some of the new folks to hear that it isn't always really BAD :-). I still wonder if I made the right decision not to do chemo (oncotype 18), so at the follow up with the surgeon (checking for lymphedema) today, I was already asking when the next mammogram is. I feel like I am always going to be waiting for the next shoe to fall, but what's done is done, so hopefully they'll keep giving me Xanax to keep the anxiety at bay. I can't sleep at all without it because I am too much of a stress cadet. Congrats Molly!",
      "MessageIndex": 1970,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 9, 2015 06:33AM Sophrosyne wrote: Thanks QMC, Honestly, I was shocked to hold up this well, mainly because of a friend who also had BC and tried very hard to convince me to have a double mastectomy (the path she chose -no rads required for her) She had painted a bad picture of the amount of time, discomfort and disabling fatigue associated with rads and possibility of it coming back. I do know that she cares about me and only wishes the best for me, but due to some micro cancer in my lymph nodes, I would have had to do rads anyway. I still have 8 more, so it will probably get worse before better, so I'm ready. I guess the point Is that we are all different and every choice is our own. To anyone new, I would say to just take every story with a grain of salt. I was and still am terrified. I have anew sense of compassion for people with life threatening illnesses. I admire each and every one of you! Happy hump day!",
      "MessageIndex": 1981,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Nov 4, 2015 08:32PM Sophrosyne wrote: thank you so much queenmomcat for the welcome and no worries! I am just glad to have a place to be \"me\"...whatever that is right now.",
      "MessageIndex": 1339,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Dec 17, 2015 07:37PM Sophrosyne wrote: Hi ElishebaJoy, I finished today too......congrats!. I started the hormone blocking meds before radiation. I didn't chose Tamoxifen. I have a monthy shot of zoladex and another medication daily to re-inforce that shot. It really hasn't been bad. My Doctor told me this medication was going to affect mood (make me a bitch - exact words). I have been cranky, but I can't blame it all on medications because I have always had mood swings. Best of luck with your continued healing! ",
      "MessageIndex": 2082,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Sep 27, 2015 07:32PM Sophrosyne wrote: Thank you Crescent5 for your reply. I really appreciate it! I am really just beside myself and although my family is concerned, they can't understand my stress or emotional reaction to having to wait. I am trying not to be a glass half empty person, but I feel like they WERE there when I called on Friday and want to wait until I am in the office to give me results. My appt. is Wednesday, but I intend to call again on Monday. I want to know the score so I can be prepared and do the research. It seems like every thought that goes through my head these days is \"I just want to get this over with\". I have not told most of my co-workers because wanted to know the \"deal\" first and I think that's just adding to the stress.",
      "MessageIndex": 14,
      "PostDate": "27/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Sep 29, 2015 08:55PM Sophrosyne wrote: Hi BarredOwl Thank you so much for your reply! The Doctor did eventually call back Monday, but annoyingly would only say my results were on the high side of the low risk category, so I don't know the actual score. He wants to have me in the office and explain what the results mean and plan treatment. I read through this study and it is reporting over just about the exact condition I am dealing with, so I am praying for that low score too. I did see the report about this study on TV yesterday, but I didn't realize the importance of it until I read through the information, so again.....thank you :-).",
      "MessageIndex": 16,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    },
    {
      "AuthorID": "Sophrosyne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219688/profile",
      "Content": "Sep 25, 2015 09:25PM Sophrosyne wrote: I am SOOOOO frustrated right now. I had a lumpectomy August 24th. Oncologist decided OncotypeDX test needed because of Micrometastatic cancer found in 2 of 3 sentinel lymph nodes removed. Saw surgeon for follow up last Wed. I was told the results were not back yet. Today I sent a message to genomic (couldn't call because I only have a work phone). They replied back at 4:26pm that they had faxed results to Dr. on Sept. 21st! Call Oncologist at 4:45 to try to get results. They said office closed at 5 but all the people who could give results are gone for the day. Over the last two days the other \"tit\" (not the one with the lumpectomy) started to hurt....maybe all mental, maybe not....who knows, I also had BRCA1 and 2 tests a little over a week ago and was told that would take 4 weeks for results. I feel like I am on death's door.....I know that sounds melodramatic, but I am freaking out. My family just wants me to chill out and stop stressing over this because I am stressing them out......seriously. Have to find a way to pull myself together. My productivity at work is suffering.....hell, everything in my life is suffering. I have complete respect for folks fighting this battle. It's true you can never understand until you walk in someone else's shoes.",
      "MessageIndex": 12,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/835161",
      "Title": "Curious: Calling genomic health to get oncotyope results? capippy SueH58"
    }
  ]
}