{
  "AuthorID": "sophie34",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208514/profile",
  "Posts": [
    {
      "AuthorID": "sophie34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208514/profile",
      "Content": "Dec 16, 2014 10:18PM sophie34 wrote: I'm sorry you're dealing with this worry at such a young age. Here is my experience: I had my first fibroadenoma at about age 25, and ended up deciding not to remove it. I got opinions from two different surgeons, and felt confident that leaving it in was not dangerous. In retrospect, I really think I made the right decision(for me, at least). First, the tumor actually did seem to shrink on its own, to the point where the BS following me said she couldn't even feel it anymore. Second, I am now 54, and have had two more fibroadenomas diagnosed since that first one. The third one they said they had to remove because the core needle biopsy was indeterminate. So if I had had them removed every time, I would have had three surgeries by now. To me that's a lot of surgery and a lot of scar tissue to deal with. It turns out that I just have a lot of fibrous tissue in my breasts (what one sonogram tech referred to as \"busy breasts\"), so I've gotten used to having a lot going on in there, and just trying to be diligent about my cancer screenings. This may not be the right decision for you - we're all different. But in any case, I always recommend getting at least two opinions before making any significant medical decision (which includes any surgery, in my book). And definitely don't be afraid to raise your concerns, or worry about seeming pushy or paranoid! It's your body, and you have the right to have your doctors listen to your concerns and discuss the pros and cons with you. If they have a problem with that, you may want to find another doctor. Good luck to you!   ",
      "MessageIndex": 3,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/827021",
      "Title": "Fibroadenoma- stay or go? ehastings1 Lolis"
    },
    {
      "AuthorID": "sophie34",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208514/profile",
      "Content": "sophie34 wrote: Hi - I'm a newbie and not quite sure what forum I should be posting in, but decided to start here. I'm 54 and have had a lot of issues with fibrous, dense breasts and B9 masses over the years. I had an excisional biopsy about 2 1/2 weeks ago, and am very happy to say it turned out to be just a B9 fibroadenoma. While I'm obviously very relieved it was B9, I still want to connect with women who are healing from an excisional biopsy, and/or women who have had recurring B9 breast issues. This is my third fibroadenoma. The first was when I was in my 20s - it was small and they were confident it was B9, so we just left it there and eventually it seemed to go away. The second was in my 40s - a CNB showed that it was B9, so we left that one in too. For this third one, the CNB was inconclusive, so I had my first surgery. I've been healing well and have my post op visit tomorrow. But I'd love input from others who have been through the healing process. For example, how long did you wear a bra 24/7? Did you do any treatments to reduce scarring? When did you do your first follow up mammogram? What type of cosmetic changes did you end up with? Also, now that I'm over 50 with dense, lumpy breasts, I think I may end up with a lot more cancer scares (and therefore more procedures) in the future, even if I'm fortunate enough not to get cancer. I realize these are all good problems to have compared to dealing with cancer! But I'd still would like to hear from women dealing with some of the same issues. After all, there are a limited number of people you can discuss your breasts with. ;-) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/827043",
      "Title": "Recovering from Excisional Biopsy (B9) sophie34 sophie34"
    }
  ]
}