{
  "AuthorID": "sophbail",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86682/profile",
  "Posts": [
    {
      "AuthorID": "sophbail",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86682/profile",
      "Content": "sophbail wrote: I'm so sorry, I have posted before. Its my sister and she is waiting for Biopsy report Thurs.and goes for cat-scan tom. I am reading everthing I can get my hands on but  not really finding anything. She has open sores aound her entire breast (not the nipple area). Started with small pimple with excretion and they have multiplied. They are seeping pus and blood, with odor. I cannot find anything about this regarding the exterior breast. I was told it sounds like IBC but when I do research the symptoms are different. She is absolutely terrified and so am I. Please if any one knows what this sounds like, I love to hear from you.  Thank so very much. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737670",
      "Title": "Please help with answers!! sophbail sophbail"
    },
    {
      "AuthorID": "sophbail",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86682/profile",
      "Content": "Jul 21, 2009 10:56AM - edited Jul 21, 2009 10:58AM by sophbail Thank you both for your replies.  I don't want her to have MRSA but right now I pray that it is that or some type of an infection and not IBC. We will know this Thurs. She goes to the surgeon to get her biopsy and cat-scan results.  Please keep her in your prayers as I will you too.        Thank you, Sophbail",
      "MessageIndex": 4,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/737670",
      "Title": "Please help with answers!! sophbail sophbail"
    },
    {
      "AuthorID": "sophbail",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86682/profile",
      "Content": "Jan 11, 2010 09:18PM sophbail wrote: Hi KS1, Sorry to hear about your wounds.  My sister was diagnosed with IDC in July '09.  She has been on chemo since then and hopefully will have her surgery the last of this month followed up by rad. I'm letting you know this because her cancer invaded all her breast tissue and she has had open wounds since July.  All this time since july (receiving chemo too) we have been taking her to an infectious disease specialist who also deals in open wounds.  We went to him at first every week, now we are down to every 3 weeks.  He has been fabulous.  We clean, put medication and new bandages on daily since July. She has one small wound to heal.  Her breast was a mess to say the least.  Her oncologist said that he has worked a miracle on her.  They had to get her breast healed before surgery due to removal of breast. You might want to ask your doctor about a refferal to this type of doctor.  Hope this helps. Pam",
      "MessageIndex": 2,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746613",
      "Title": "help! open sores 5 months post-rads KS1 leslie43"
    }
  ]
}