{
  "AuthorID": "sophie14",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
  "Posts": [
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "sophie14 wrote: Hello ... new here ... I had a mammogram on Wednesday of this week. I had to go back the next day for more pictures and ultra sound. My BI-RADS was category 5. Friday I saw my family doctor, she said it didn't look good. I have to do a needle biospy on Wednesday and my doctor has contacted a surgeon for me to see him stat. I'm waiting for someone to wake me up and tell me this is a dream. I'm trying to stay positive, but you'll are right the waiting is hard. The mass that was found is the size of an Peanut M & M according to the nurse. I have suspicious microcalcifications too. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/825761",
      "Title": "Waiting to do biopsy on Wednesday sophie14 Linda-Ranching-in-the-mTns"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Oct 7, 2015 05:33PM sophie14 wrote: Hi Ladies ... New here ... 13 out of 33 radiation treatments done as of today. I see my RO on Fridays after treatment. She said I'm doing well, then offered me stronger pain medicine. I find that sort of strange sometimes , like it's her way of telling me the pain will get stronger... it's getting harder to use my arms ...I just had a lumpectomy on the right side in August. My esphogus burns after treatment , but she says it's not from radiation . But it gets better over the weekend. ...My chestbone hurts a lot too ... that does come from the treatments .I am also on Herceptin until next May and my body sure doesn't like it. I had 2 jaw teeth removed on Monday ... What a journey, the fatigue gets rough but better days are coming.",
      "MessageIndex": 683,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Dec 2, 2014 10:35PM sophie14 wrote: I will be thinking about you and praying everything goes well tomorrow. How many more treatments do you have to do nottoday ? I get a port next Monday ... still scared of all this, but what choice do we have. Hang on better days are coming !",
      "MessageIndex": 648,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Nov 21, 2014 04:17AM sophie14 wrote: Thanks for the advice Nomatterwhat. I think I will pack a few things in my bag for my husband too. Like your husband he is trying to learn how to help take care of me. For this I am greatly blessed. ",
      "MessageIndex": 600,
      "PostDate": "21/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Nov 23, 2014 12:24AM sophie14 wrote: Good evening ladies, I hope everyone is doing ok tonight. I'm glad I found this board. I admire each one of you and appreciate your help. I would like to know if anyone has been given Adriamycin and the side effects you had. I know we all react different to the medicines. A lady at a meeting the other day told me they gave her this and it was awful. My husband took me Wal-Mart today to pick up the medicines the oncologist prescribed for nausea and the steroids.The pharmacist told me the Zofran could give me a headache, and the Phenergan was going to make me sleepy. I sure hope I can sleep the headache....I guess it's the Decadron is the one that can keep us wired up ... The surgeon said I may have a lot of sleepless nights ahead. How encouraging ...One good thing at Wal-Mart, I found a cute hat. We had lunch at Wendy's while we out saw a few of the ladies that go to places my husband plays music ( he plays and sings bluegrass , country, gospel at different places). These ladies are usually so talkative, but today they said very little to me They knew already that I have breast cancer. I guess that's the way it's going to be sometimes. I told my husband to watch out , the older women know I'm sick and will start chasing after him. He just laughed ! ... I hope everyone has a good night. Take care ...",
      "MessageIndex": 615,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Nov 23, 2014 01:37AM - edited Nov 23, 2014 01:39AM by sophie14 Thanks Leto, Those are the 2 medicines that I will be given. Did you get them at the same time? The PA told me I would be getting Adriamycin every 21 days for four treatments and then Cytoxin once a week for 12 weeks. I haven't heard anything about the Neulasta shot yet. I have very sensitive teeth and can't eat cold stuff like ice or popsicles. Guess I am up the creek about the mouth troubles.",
      "MessageIndex": 617,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Feb 7, 2015 12:30AM sophie14 wrote: Hi everyone .. I hope everyone is doing ok ... How long do you feel the side effects of the neulasta shot ? ... It sure makes me feel weird. I got the shot Wednesday, bones hurt just a little, but hands tingle a lot, and some tingling in my feet. My heart wants to race at times too. I'm on digoxin for irregular and fast heartbeats I have had a long time. It usually keeps it under control. I guess all these drugs are really putting a strain on it. I have one more A/C treatment on the 24th if blood work allows. Then it's on to the next phase. I have lost 20+ pounds, but will probably get it back taking all those steriods with the taxol treatments. I did have my treatment on my 60th birthday ... it was a very emotional day.. I think all this just catches up with us some days and the tears pour. The PA said it was expected to happen, she prescribed some medicine for my nerves. My chemo nurse was on a cruise, so I had a sub nurse. She was wonderful and lives in my community. Four of the chemo nurses sang Happy Birthday, gave me an Angel pin and ballon too. Those girls can sing too ! ... Take care everyone ... Sending everyone ((( Hugs ))) and prayers.",
      "MessageIndex": 872,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Nov 22, 2014 03:51AM sophie14 wrote: Thanks everyone for the replies about what to put in a chemo trip bag. These melt downs have been rough the past few days. I guess it's just part of the journey. It is hard to understand how one boob can get you in so much trouble and change your life forever. I ask about having my breast removed and was told it would not change the treatment plan. The doctors tell me that the microcalcification around my mass are probably cancer too. It makes you feel like they are not telling you the whole story about the cancer. I guess they will know more when the surgeon checks the lymph nodes on December 8. The surgeon told us we are angry at the cancer, and he is right. Tomorrow is another day and I hope it's a good one for each one of you brave ladies. Take care.",
      "MessageIndex": 607,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Nov 20, 2014 09:23PM sophie14 wrote: Hi everyone ...Can I join this board ? I start chemo December 16. A Christmas to remember for sure. I was diagnosed with HER2/positive 3+ and will be receiving Adriamycin for four treatments 21 days apart. Then cyclophosphamide once a week for 12 weeks. I don't think I know the words to describe how I feel about all this. I will be getting my lymph nodes checked and a port put in December 6. Everyone says stay strong, but I wonder how right now. I too wondered what to take to chemo treatments besides my husband. He is scared to death too. I hurt for him to have to go through this also. Any advice or helpful ideas would be greatly appreciated.",
      "MessageIndex": 593,
      "PostDate": "20/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Dec 2, 2014 03:18AM sophie14 wrote: I hope you will feel better soon. I start treatment with the same chemo medicine you are taking now on December 16.. I am very scared of the side effects, but I know I have to do this. Take care ...",
      "MessageIndex": 644,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "sophie14",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206999/profile",
      "Content": "Jan 29, 2015 11:29PM sophie14 wrote: Hi ladies ... I hope everyone is doing ok and not having to much trouble with side effects from treatments. My second A/C treatment was rough and the fatigue was worse than the first treatment. ( I have them every 21 days ). I was suppose to have my third treatment this past Tuesday ( Jan. 27 ), but my chemo nurse called Monday afternoon and said my oncologist didn't like the results of my blood work so there would be no chemo on Tuesday . She scheduled my blood work for Monday, February 2 and chemo on Tuesday, February 3. Well guess who has her 60h birthday on the 3rd ? ... Never, ever did I think I would be bald and sitting in a chair having chemo treatments on my 60th birthday. I guess this will be a birthday to remember always, unless I get dementia or Alzheimer's. I am counting my blessings and thankful that the cancer I have ( HER2 positive 3+/clear lymph nodes) is treatable. I guess we will watch the Super Bowl, and celebrate my birthday early. Do you'll get to see your MO very often ? I always see his PA.This time I want a copy of my blood work. Take care everyone . ((( Hugs ))) and prayers for each one of you on this journey.",
      "MessageIndex": 847,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    }
  ]
}