{
  "AuthorID": "SophiaMarie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
  "Posts": [
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Jul 31, 2013 03:17PM SophiaMarie wrote: Thank you everyone - it's so helpful to read your posts!",
      "MessageIndex": 11,
      "PostDate": "31/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 4, 2013 08:27PM SophiaMarie wrote: I'm redoing my toenails now (blue), and trying to get myself to look at the anesthesiologist's form that I have to fill out for tomorrow. Yeah, I wish I could just fast forward to tomorrow night, but it will come. Can't think about the operating table - wish I was out first! I have told a bunch of friends, just not everyone. I'm actually kind of calm right now. Glad that this huge part will soon be over. Just hope it's not as bad as it could be....",
      "MessageIndex": 45,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 7, 2013 04:48PM SophiaMarie wrote: I did take a wonderful nap - but then I cleaned up the house! Probably shouldn't have done that. The pain has gone down so much today - it felt good to move a little more! Ok, not sure if I should ak his here.. Might alo go o lounge, but I am supposed to take off bandages today. The gauze is clean, but through the tape it looks kind of dark. I'm a little creeped out o see what it looks like! She just used glue as I react to steri strips. What should I expect so I don't pass out?",
      "MessageIndex": 64,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 8, 2013 10:57AM SophiaMarie wrote: It's so hard being the patient! I'd much rather care for someone else. Thank you all so much for supportive words. It helps so much. There I go crying again. Yeah, thy told me to gently wet the gauze and it should start to come off. It was just nice to find out that they use layers of glue - so the gauze should only be in top layer. I do have a sterile pad over it to protect it from my bra - and I noticed a spot of fresh blood. Had felt good that the glue sealed it all - but apparently not!",
      "MessageIndex": 70,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 8, 2013 04:35PM SophiaMarie wrote: I'm sorry - this just has me so emotional and crazy. And when I really think about it, so many of you have it so much worse than I do - then I almost feel guilty for getting so worked up! Every step of this journey is so unknown - until a dr dumps it in your lap, that is. I think I did overdo it yesterday since I felt so good. I am so wiped out today and just feel icky. And emotional. It makes it so much harder to cope. Thanks for sticking with me. I will definitely let you know what she says tomorrow.",
      "MessageIndex": 82,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 9, 2013 11:02AM SophiaMarie wrote: Ok, just talked to the surgeon. Originally she thought the tumor was 1.5 cm - now she said it was closer to 2. So that puts me at a high stage 1 or low stage 2. Worse than I was prepared to hear. She said about an 80% 5 year survival rate without further treatment - though I thought those statistics were with treatment... I'm having a really really hard time being positive!!!",
      "MessageIndex": 85,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 9, 2013 02:33PM SophiaMarie wrote: Seriously, how do I get a positive attitude? I'm hoping that this is just an exceptionally bad day... I mean how do you stay positive when someone tells you you have a 10 - 20% chance of dying in 5 years??",
      "MessageIndex": 87,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 10, 2013 05:18AM SophiaMarie wrote: jobi1konobi, I feel for you!! All I can think is what a nightmare this is for all of us!!! (((Hugs))) I have a question. Since before my dx, I've had a hard time eating. At first it was nerves - it felt like I had scratchy ropes tying up my stomach and intestines. I suppose nerves are still involved... But I have a green smoothie late morning, maybe a couple spoonfuls of leftover veggies at lunch ( only because I think I should try to eat something) and then I do eat something for supper, but not like normally. And that's it. I don't want more - my stomach feels tight and uncomfortable and food just doesn't seem very appealing. In the last month and a half I've lost about 16 lbs. the weight loss is a good thing, as I am overweight, but I am concerned that I don't want to eat... I know there is a little paranoid - no sugar, not too much fruit, no bad carbs, etc, but even foods that I'd consider healthy just aren't appealing. Is this nerves? It's not a sign of mets is it??? I haven't even started any treatments yet.",
      "MessageIndex": 95,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 13, 2013 10:58PM SophiaMarie wrote: It could way be different tomorrow, but after applying emu oil (ok, and YL sacred frankincense) all day, it feels much better! It is still swollen and there are sore spots but it's nothing like it was. By the way, I make natural soap using only essential oils, so I'm always looking for oils that can help with various things. Years ago I made up an oil containing lavender for a friend undergoing rads for esophageal cancer ( radiologist approved) and it worked great. However lavender is a phytoestrogen and I'm not keen on slathering it all over my breast that had an er+ tumor in it - so reading further I found some really interesting info on sacred frankincense. Apparently Oklahoma University had studied it and confirmed its anti cancer properties. They still need to isolate the components that are responsible so drug companies can use it, but it sounded pretty interesting. Smells good too.",
      "MessageIndex": 125,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 2, 2013 09:25PM SophiaMarie wrote: You are all amazing. I just wish I could stay feeling strong.... I swing back and forth. I was gone all day and came home to a phone msg from the hospital with instructions (to stop eating midnight before, go to ambulatory surgery, etc) and now the anxiety is back full force. I know life is full of time and unforeseen occurrence, but I'm not dealing well with mortality. I'm even getting shortness of breath.",
      "MessageIndex": 33,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 3, 2013 08:23PM SophiaMarie wrote: Doesn't it all seem surreal? I'm kind of numb again - that's good! My anxiety goes to my gut, so I feel a little better when I'm numb.",
      "MessageIndex": 38,
      "PostDate": "03/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 6, 2013 06:48PM SophiaMarie wrote: The initial testing on the sentinel node was clear!! And she's pretty sure she got clear margins too! It was 1.5 cm. you are right - it is a huge relief!! I find out more details next week, but so good to have positive news. I have to ask - I thought I have a pretty high pain tolerance - the papers from the hospital said that after a lumpectomy you would experience \"mild discomfort\"... Really? So am I a wimp because I think this is pretty uncomfortable and I'm using the generic vicodin painkillers? Btw - fire ants. That's what those 6 radioactive injections around my nipple felt like! They told me I did really well though - I didn't cry like a lot of other women. Funny. At least the sting only lasted a few seconds.",
      "MessageIndex": 55,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 8, 2013 05:56AM SophiaMarie wrote: I did get the bandages off - however a lot of the gauze is really stuck in the glue over the tumor incision. Now I'm wondering about getting the area wet - I don't want the gauze wicking bacteria to the incision. So I guess I will have to make a phone call. (I tried pulling gently but it doesn't budge, plus it's over the whole incision) Thankfully I'm not bruised as of yet, but it's still pretty icky looking! Three incisions - the tumor site, the sentinel node, and the biopsy entrance (she wanted to try to clear the path of the core needle) I find myself crying more now than I did before surgery... I'm not taking meds now, so can't be that. Could it be that the discomfort has made this even more real? I've been finding myself telling my friends that what I never realized about breast cancer (and I know that they don't know) is that even though the lymph was clear, margins clean, that doesn't mean you're \"done\". There's still rads, possibly chemo and hormone therapy - and always hanging over you is the threat of that one evasive cell setting up camp. And bad enough if he's found locally, but if he gets loose, you're done. And now I'm sobbing again. I'm telling my friends that its not that I want to be gloom and doom, it's just the reality. Odds are that this lump wasn't supposed to be breast cancer either, but it was. So how can I trust where I'll wind up with any other statistic? And now I'm also wondering... She just took the one sentinel node. It looks like most of you had more than one removed initially for testing. Should she have taken more??? How do I live with this??",
      "MessageIndex": 66,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 9, 2013 08:58PM SophiaMarie wrote: But Dogsandjogs - yours came back? That's what terrifies me!! What are they telling you now?",
      "MessageIndex": 90,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 13, 2013 01:48PM SophiaMarie wrote: Appt is tomorrow afternoon (Wed). I probably shouldn't have said massage - I was actually applying emu oil since it can help with inflammation - so a stroking might be more like it! And I don't go anywhere near the incisions! They're still covered with glue anyway, and they still kind of oook me out, so that will be a while before I get near them., But the lump over the nipple area is definitely on my question list! I'm wondering if it has anything to do with the dye... The poor nipple is so sore as well (remember the incisions were way over on the outside - no where near the nipple!. I had actually taken a pain pill on Sunday when the pain suddenly came on, but it only took the edge off. The pain seems to be changing a bit as the days go on - still soreness, some more sharp twinges, and now my nipple is more sensitive.",
      "MessageIndex": 117,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 13, 2013 04:20PM - edited Aug 13, 2013 04:48PM by SophiaMarie Wow - 8 hours of sleep would be so nice! I've been getting about 5! Not helping with emotions!",
      "MessageIndex": 123,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Jul 31, 2013 11:17AM SophiaMarie wrote: Aw - such words of wisdom - you're making my eyes well up! My mom is dead, but I do have a nice support group - just that most of them have never dealt with this, so it's awesome to be able to come here. My surgeon told me that they wait during surgery for pathology to do a quick check, and that's how they determine if they need to take more nodes. Path will then continue to check more thoroughly, but they will give my surgeon an 80% idea. And she said shed talk to me in recovery as soon as I was clear enough to understand. That's why I'm terrified. It's good I get some quick news as opposed to waiting days (which I still will for the full report) but I'm still worried. It's so helpful to hear all of your words! I know I'll get through it - just dreading it. As far as the dye, she said she's been bugging them to use lidocaine to help with the sting, so I'll have to make sure. I've only gotten nailed once by a wasp, and I certainly don't want that on my breast. I did childbirth without pain mess, but that was for a good purpose. .......although I do need to. Keep reminding myself that what they're doing is also for a good purpose - just not good that they have to. Thank you so much! I may have to come back here again for moral support as it gets closer!!",
      "MessageIndex": 7,
      "PostDate": "31/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 10, 2013 07:15AM SophiaMarie wrote: Dogsandjogs I'm so glad to hear its not a recurrence!! Nesw - (((hugs))) I cried reading your story. I never ever came close to realizing what a devastating disease this is. I just wish there was an easier way to get on top of it. A friend daughter had triple neg, and the prognosis wasn't good. I was afraid for but I didn't have a clue. I was always amazed to hear how she just tackled it, her mom forwarded an update email she wrote that was so fun and positive (I remember thinking that if I ever went through it I'd like to be like her!). Even when I saw her with her chemo cap on she was joking and positive. Then I got breast cancer. She contacted me. And I found out the real story. She sobbed all through her drs appts, researched EVERYTHING she could get her hands on, used accupuncture, a napropath, etc all in desperation. She even broke down while talking with me because it brought back all those terrifying feelings. Next month she finishes her reconstruction. It's always there. I wish we could all be in the same groom together! (((Hugs))) to all of you!",
      "MessageIndex": 98,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 12, 2013 06:37PM - edited Aug 12, 2013 06:47PM by SophiaMarie I'd like to change my subject line - the after surgery news was better than what I know now. I need to get prepared - I mean, I information wise . I've been reading about chemo and I am TOTALLY terrified of it. My grandmother died of congestive heart failure and I'm terrified of dying of the same thing - and now I read about chemo ruining your heart. My wbc is on the low end of normal - so will they want to use nulasta? That has horrible side effects!! And a port?? What - more surgery to put a plastic hole in me? And how do you sit there for hours knowing this poison is also killing the good part of you?? And what about your liver - how much can it handle?? How can anyone go through chemo with a positive attitude? And hair loss - please tell me that it isn't permanent! Even temporarily - how do you handle this without extreme depression? I don't know how I can go through this..... And I will need tamoxifen - that causes hair thinning too?? I already have thinning hair - I desperately don't want it to get worse! Help! Adding - and would I ever get taste back or is that permanently gone? And steroids?? Do I really have to have steroids?!",
      "MessageIndex": 105,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 13, 2013 08:43AM SophiaMarie wrote: I only was gently trying to encourage some flow of fluid build up - way too sore yet to do anything serious. It did actually help! I had ordered some emu oil in prep for rads and wanted to try it. (Not anywhere near incisions). I'm glad I see the surgeon tomorrow. Well, not glad exactly - seeing her means setting up appts for consultations with onc's and the roller coaster will be lurching forward again. Another question - I've read a couple of times now that node neg women still have 30% chance of cancer becoming metastatic - can someone clarify this?? Really? Even after treatments?",
      "MessageIndex": 110,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 15, 2013 06:29PM SophiaMarie wrote: Ok. I think I need another pep talk. I've been readingreadingreading to gather questions for the oncologist consultation tomorrow. The more I read, the more it seems impossible to totally beat this. A lot of my reading has been on here too. So chemo doesn't \"cure\", if stems cells aren't destroyed, it will return, cancer cells can stay dormant and revive later and mets, even those that have been really diligent and strict using complementary treatments have had recurrences - it is beginning to feel like no matter what I do, it will return to kill me!! Can you help me? Is it really possible to live out a long normal life without ever seeing cancer again?",
      "MessageIndex": 128,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 16, 2013 06:58AM SophiaMarie wrote: No cure. Yeah. You're right. Still biting off chunks and trying to digest. Ok, please help me out - I posted this in the advocacy forum and would appreciate your help! http://community.breastcancer.org/forum/110/topic/809401",
      "MessageIndex": 133,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 16, 2013 07:59AM SophiaMarie wrote: I am meeting with the pathologist at 2 and the oncologist afterwards. I felt strong last night, but now I'm writing this through tears. I'm so scared.",
      "MessageIndex": 135,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 21, 2013 03:30PM SophiaMarie wrote: It gets worse. Ok, my friend really wantd and needed support today - he can't drive because of having tumor related seizures and she was way too upset. She does better with people around her so it was a good thing. It was all going \"well\" - Genomic finally received the tissue sample, and the 2nd opinion place called and said he would see me the day after the results were due back, and said that if they didn't get back in time he would see me the following week. They've been great. Until they called back and said there was a problem with our insurance. They are within our network so that isn't the problem, it's that we are up for review very soon (we think was the problem) - I could make an essay trying to explain it all, but now we're waiting for a return call about the insurance. This is adding a huge stress. What do you do if you lose your insurance at a time like this?! As far as a 2nd opinion, my surgeon was very understanding about the possible need to get another oncologists opinion. Ours has a reputation.... And unfortunately, I know several people that have died under his care. Not that that couldn't happen regardless of how wonderful the dr is, but it's on my mind and doesn't inspire confidence. The dr I'm getting the 2nd opinion from has high credentials and has treated a friend with ( so far) good success. Mentally, especially after trying out the first oncologist, I feel the need to find someone I feel more confidence in. Right now I'm just worried that I'll be able to see ANYONE. I've lost 19 lbs since this all started - this isnt helping!",
      "MessageIndex": 148,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 21, 2013 06:52PM - edited Aug 21, 2013 06:54PM by SophiaMarie I do realize that, but imagine having an oncologist that you don't feel total confidence in to begin with, and then add in several friends who saw him and didn't make it. I totally understand what cancer does even with the best of care. But I need the emotional end of it too. Maybe you need to live in this town to understand what I mean about our oncologist. Even my surgeon knew and understood my concerns. And I do need to add that my calling Genomic was not to check up on anyone - they have customer service for patients and were very understanding when I explained why I was calling - that I needed to know when it was received so I'd have an idea when the results would be back - so the results would be available for this 2nd opinion (and who could likely wind up being my mo). The 2nd opinion clinic is interested in seeing the results as well as I was told they could move my appt out a few days if they weren't in yet.",
      "MessageIndex": 150,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 31, 2013 01:45PM SophiaMarie wrote: Just as I was beginning to feel like I had a grip on things...",
      "MessageIndex": 161,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Sep 2, 2013 05:56AM SophiaMarie wrote: Ok, the antibiotics are clearing up the swelling and is diminishing most of the redness. And what's now left is disgusting! The swollen shape of my breast was perfect - I was so pleased! Now it's drawn in here, puffed out there, pulls to the side and is full of hard areas. It just looks like an ugly shriveled mess. Can't wait to see what radiation does to it.",
      "MessageIndex": 162,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Sep 2, 2013 01:43PM - edited Sep 2, 2013 09:41PM by SophiaMarie Did you have that hard scar tissue? I think that's what's pulling it all out of shape. I know I should be glad she got it all out with clear margins - the tumor was at its widest 2 cm, and the path report said what she took out, at its widest was 10 cm! I know she was trying to get a lot of the duct, just in case. But that's probably why my nipple hurts and pulls in - there was a lot of cutting in there! And then she had to tell me that she also put her finger in there to make sure there were no jagged edges... Knowing that kind of ooks me out! I guess this just a self-pity day. I just took a look at my path report again - I'm not flat, but I'm not huge breasted either - 36C - and the tissue removed measured 10cm x 8 cm x 3.2 cm! No wonder it looks and feels awful!",
      "MessageIndex": 164,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 4, 2013 04:15PM SophiaMarie wrote: Is there a sense of relief once the surgery is over? The journey is only beginning though.... But maybe, especially if it seems all local, and the margins are clear... I'm just hoping to feel a little normal again. Or does that take years? I suppose it's hard to feel normal with gazillions of dr's apps and getting radiation and taking pills.",
      "MessageIndex": 41,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 1, 2013 02:31PM SophiaMarie wrote: I did get to talk to my surgeon last night - she's the one that's been insisting on the numbing first! She told me they'd be giving me a pill for nausea and then numbing cream, then the dye, then sit and wait hours for surgery. The waiting doesn't sound fun! Will be hard not to get anxious! And she did say she'd let me know in recovery what she knew - and of course the full report later. This is my first surgery so it's all new to me. Hopefully it will be my last.",
      "MessageIndex": 23,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 7, 2013 06:26AM - edited Aug 7, 2013 06:46AM by SophiaMarie Aw thanks! I'm not planning on taking another med today, unless it's too much. It's just irritating that it's so sore. I did just start another thread asking some questions, but I will stay here to post info. I spent yesterday at another hospital because a good friend was having serious surgery - I figured I'd be sitting around so it wouldn't be a big deal. The surgeon said that would be a bad day (and didn't think I'd feel like doing that) - I was ok initially but by mid afternoon I was done. (His tumor was benign!). So I figured I'd go a little easier today - but I will take a little walk outside!",
      "MessageIndex": 58,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 8, 2013 03:02PM - edited Aug 8, 2013 03:03PM by SophiaMarie Oh that sounds horrible! Makes me nauseas to think about it. It's not something I'd like to experience again. Ok, we got home from visiting a friend who just had surgery (am too wiped out - probably shouldn't have gone!). And see I missed a call from my surgeon. She said the pathology was \"fine\" but that she'd try to catch me tomorrow to go over it. Ok, what does that mean - I have an appt with her next Wed, so if \"fine\" meant all clear, then wouldn't she leave it at that and we'd talk the rest next week? Could there be something else she might say?? Like there was no cancer in the tissue because they missed it? Or it was \"fine\" except one area that needs to be redone? Why \"fine\" and not \"great\"?? Am I nuts?? Help me!! Oh - and she hesitated before she said \"fine\".",
      "MessageIndex": 76,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 8, 2013 03:36PM SophiaMarie wrote: The followup is next Wed, but she said she would try calling again tomorrow. This whole thing has me near insanity, if I'm not already there. And worry is, unfortunately, what I do best.",
      "MessageIndex": 78,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 9, 2013 09:07PM SophiaMarie wrote: Tonight a friend mentioned grieving and things started clicking - I wasn't expecting to hear I had cancer - the radiologist that did the biopsy said he thought it was fibrosis. So initially when i was diagnosed, I was in shock. I cried a little, but not much. After surgery, when the pain and discomfort hit - and the reality of what I am dealing with began to sink in, the overwhelming sadness and desperation began. I'm still feeling that, but also getting moments of anger - this is all part of the grieving process. My life as I knew it is gone - its forever changed - and I am in mourning. This realization has helped some - I'm hoping it means that at some point I will be able to pick myself up and begin fighting! I hope.",
      "MessageIndex": 91,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 10, 2013 11:17AM SophiaMarie wrote: Jobi1konobi, you have been through a lot! Just having the lumpectomy has been an overload on my system, but you have gone through so much more. I guess it's an extra challenge for those of us whose anxiety hits in their gut - nutrition is so important too. I'm really thinking that psychological care should be an automatic part of treatment. So many of us are really struggling. (((Hugs))) to you - don't give up! I will need to hear your success story!",
      "MessageIndex": 101,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 13, 2013 06:44AM SophiaMarie wrote: I am struggling to have a positive attitude. Your comments really do help keep me anchored - although there's always something else to cause me to fly off. That's why I really appreciate being able to come here! I so have another question - there's no way a 1/2 x 1\" tumor could grow in 2 weeks, is there? I was gently massaging my poor traumatized breast last night and found this firm area above the nipple in the numb area. All the work was done further towards my arm pit, except for the dyes... But would that do it? There was nothing else on that diagnostic mammogram... Please tell me it's not more cancer!",
      "MessageIndex": 108,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 12, 2013 07:23AM SophiaMarie wrote: Question - I only took pain meds the day after surgery - after that it was uncomfortable, but not unbearable - and definitely improved daily. That is until yesterday. (Today is one week from surgery). I actually took a pain pill yesterday because my breast ached and burned enough to make me constantly aware of it. It only took the edge off. I've been trying to search out info on it, but I'm not finding what I'm looking for... It's not really at the node incision - or really tumor incision either (although they are sore still). The tumor was on the outside of the breast near my armpit - not near the nipple at all. From there to the nipple, and a bit further, it's just really uncomfortable. It is swollen, but I would not say its excessive, so I wouldn't think there's anything that needs draining.... It's not really even bruised. The incisions dont appear to be infected. The area that is uncomfortable is also numb (if that makes sense) and very slightly (if you look carefully) has a more redder look. Whats going on? I see the surgeon for a follow up on Wed.",
      "MessageIndex": 103,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 16, 2013 06:37PM SophiaMarie wrote: I like that Dogsandjogs! Will have to do that. Well, met with the pathologist this afternoon - I could tell they weren't used to it, but he did relax after a bit - and did explain a lot more details. My cancer cells looked like tiny seeds compared to the other cells. It was a good thing. But then I forgot my purse there. Was nervous and had to run across the road from the hospital to the clinic for my first onc appt - so he called my onc to tell him he was sending a nurse over with it and said \"she came to meet with me!!\" So he learned what a nut I was before he met me. Ok. I feel a bit relieved, but I'm not sure totally why yet... He plugged in the statistics and it spit out that I have an 88% chance of living 10 years with radiation. Tamoxifen adds 2.5% and chemo adds about 3%. (Together they add 4% for some reason). The oncotype dx test was sent out, so I have to wait a week or so for those results. That will help determine chemo or not. And he knows and is ok with me going for a 2nd opinion, which I will schedule for when the oncotype results are in. Some confusing things though... He told us that diet and exercise could equal chemo. I need to have that clarified. Maybe I feel good because I got through today... And the onc was not as bad as I heard... That was a relief too. Probably in a couple of days the nerves will set back in when I start waiting for those test results. Oh I had also asked him about vit D and mets - so I did a blood test today too. So, my future with chemo or no chemo is still uncertain.",
      "MessageIndex": 138,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 18, 2013 07:32PM - edited Aug 18, 2013 07:33PM by SophiaMarie I will definitely let you know when the results come in! I met with the pathologist mainly because of a thread on here started by a pathologist! He had a patient ask to meet with him and see her slides etc, and said she really benefited from it. He said to just ask them to go over report with you. He had a lot more details for me than my surgeon did, and even told me that the only \"cure\" was surgery to get it out - our immune systems won't go after it since it is our own tissue ( tho wonky), and treatments don't necessarily kill it all. His wife was diagnosed 3 yrs ago, so he understood what I was going through. I was questioning my decision on the way to his office, but now I'm really glad I went. We also talked about the oncotype test and he must've assumed my onc was going to order it - cause he already had it prepared to go when he called it over! It was nice to see the hidden part of my team!",
      "MessageIndex": 140,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 28, 2013 09:01PM SophiaMarie wrote: Oncotype results came back! 15 and my onc said no chemo. I've read here and there that 15 is considered grey area... I'm not sure why - isn't 18 to 30 the grey area? Not that I want to do chemo.... You know what's still unnerving? Even so, the chance of mets in 10 yrs is still 10%! I know it could be worse, but it still seems higher than I'd like! Still waiting for insurance to be straightened out, and getting a little anxious - I still have to make that 2nd opinion appt. Another reason I'm looking forward to that is that my vit D did test low - and I asked my onc if he was going to prescribe it. He said he knows of all the studies but doesn't do that. Said I could just take 1000iu's of over the counter. Frustrating. I did see the radiology onc today - really like him. He answered my questions, is interested in reading about a university study I mentioned about frankincense - both nice and knowledgeable. And my friend with the brain tumor? Not good. An astrocytoma - even with treatments they say its probably 2 years tops (and that includes a 2nd surgery to remove it when it re grows). It's very difficult to think about. Horrifying actually. Kinda makes me feel guilty to worry about 10%. I do see my surgeon in the morning for another followup. The whole end of my breast is red now. The rad onc even called my surgeon to try to get me in (he must not have heard me say I had an appt in the morn). I have to admit that a part of me is afraid of ibc - it does have all the symptoms except inverted nipple - but then the symptoms are supposed to be basically the same for infection too.",
      "MessageIndex": 152,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Sep 3, 2013 09:45PM SophiaMarie wrote: Oh, I'm sorry! I didn't realize all that you've been through! I had my first therapy appt today. I guess there is still a lot of fluid in there... Have to work at lymph drainage now. She did say we could work some on the scarring. I'm wearing this lumpy pad thing in my bra that's supposed to help the hard areas - oh my does it look grotesque when I move it! Have 3 appts yet this week, and next week I have 3 so far but will probably become 4 as I need to get back with the radiology onc. And I'm self employed and homeschool - I suppose it means my schedule can be more flexible, but what a challenge. Ha - silly me, with rads coming up, it's nothing now!",
      "MessageIndex": 166,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 20, 2013 02:32PM - edited Aug 20, 2013 02:40PM by SophiaMarie Do you mind if I scream a bit? With tears mixed in? Ok, so I saw the mo on Friday, who personality wise wasn't as bad as I was fearing. But. My surgeon said he was \"by the book\" and that was very apparent. Filling my info in on the computer in front of me and it spit out my prognosis and plans for chemo. Maybe that's how they all do it? I don't have a clue since ive never done this before. Anyway, we did order the oncotype dx test. Both the mo and the pathologist said they'd have the results in a week. I called genome on Monday to make sure they received it and to see what date the results were expected to be at my mo's. I need to know this because I need to make an appt for a 2nd opinion (I heard of a dr about an hour from here who comes highly rated). But they hadn't received it yet. Told me to call my dr. They got back to me this morning saying it only went out on Monday, but next day. So I called Genome again and they still have not received it. And they told me it takes two weeks for results. So now I have to check again tomorrow. Really?! And why do my drs keeps saying one week? Don't they know how sick a patient would be to wait that extra week, wondering why?! So I meanwhile call for the 2nd opinion appt (with the possibility of switching to him as my mo) and thankfully they are wonderful! The girl also told me that sometimes the oncotype even takes longer if they want to check more. She's checking with the dr to see if he could get me in on what would be 15 days from when the oncotype was sent in - and should call me tomorrow. They are also requesting all of my info and also will be sending things to their pathologist. So this part sounds good. But meanwhile my surgery was on August 5th - and this 2nd opinion will be will be 4 and a half weeks from surgery - that makes me really nervous - it seems to be cutting it really close to when they want to get things rolling!! But I just can't do anything without this other opinion. I'm just afraid of getting pressured. I see the radiation oncologist next week for consultation. And this morning.... I find out that a good friend has a brain tumor. We will be with them all day tomorrow while he has specialized testing and has surgery next Tues. I'm telling nurses \"no, I can't come for an appt that day because...\" \"No, that's the day....\" And talking to his wife is bringing up all my terrifying emotions again - that initial time when you don't really know what you're dealing with, facing surgery, etc. I am so drained again.",
      "MessageIndex": 146,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Sep 11, 2013 11:33AM SophiaMarie wrote: I had at least 5 injections around the nipple - without the benefit of the lidocaine since the nurse put it on the wrong area. Like fire ant bites! After over a month, my nipple is still tender. At first they thought it might have something to do with the radioactive or blue dyes, but after finding out the size of the tissue she removed and learning that she tried to remove most of the duct, I understood why - there has been a lot of trauma right behind a super sensitive area. So maybe where the cavity is could have something to do with it?",
      "MessageIndex": 169,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: Last week I was dx with idc and will be having a lumpectomy his coming Monday the 5th. I'm not looking forward to surgery, especially he radioactive dye (surgeon said it really burns) - but I'm not afraid of all that. What terrifies me is when I wake up - and my surgeon walks in.... Then I get the verdict. In my lymph?? Larger than she thought? Sometimes I can handle it, and sometimes I'm drowning in this. I know it does no good to worry, but that happens to be what I'm best at. And even if she gets it all and my nodes are clear, for the rest of my life I will be paranoid about what I eat, that I exercise enough, and every little ache, dizziness, etc. Life is now changed forever. How do you cope with this?! Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 31, 2013 03:41AM SophiaMarie wrote: My concern at the moment is the redness on that breast. Especially a patch that is darker red and has enlarged pores - right below it is a little dimple spot that looks like a chicken pox scar (I'm sure it wasn't there before). The surgeon doesn't think it's IBC, but from what I've read, they usually don't think that's what it is. Anyway, I'm on antibiotics - would feel better if they'd start showing improvement!",
      "MessageIndex": 157,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Aug 31, 2013 12:32PM SophiaMarie wrote: I don't know - maybe how it's healing? But more things are happening... Now below the red area is a kind of dent. And my breast seems to be pulling to that side (headlights aren't aimed in the same direction now). And the red area seems slightly sunken now too. Overall it isn't anymore swollen than it was, but at least initially I was happy that the shape of my breast seemed perfect after the lumpectomy - now weird things are showing up. As long as its not IBC though, I can deal with it! My surgeon is not a breast specialist, and I've read how IBC is typically misdiagnosed as an infection. I very well could have some infection, and have been on cephalexin for over 24 hours so far... Redness around my nipple might be slightly better, but not this area. Hopefully I can get in for that 2nd appt pretty quickly - one of his specialties is bc and it's at a breast cancer center. I just need to know for sure. I don't want my 90% chance of survival suddenly dropping to 40%! And this seemed to come on pretty quickly. Last weekend actually.",
      "MessageIndex": 159,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808583",
      "Title": "I'm terrified of the recovery room! SophiaMarie barbe1958"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Sep 24, 2013 05:54AM SophiaMarie wrote: I'm so sorry to hear of all you've been through all ready! That would especially discouraging to already have problems from the rads. I don't start mine til next week, so I'm not speaking from experience, but the ro nurse had a spray she suggested I use a couple of hours before treatments that contained a silicone that she said would help protect the skin. Did they offer you anything like that? I wound up not taking it because it also contained lavender essential which is a strong phytoestrogen (I don't care who wants to give it to me, I can't get myself to put that right over an er+ tumor site!). But my occupational therapist showed me a skin repair gel that she got from a local acupuncturist that could be acceptable as well. The techs/ro should approve it first, but I would look into something that could help protect your poor skin! I'm anxious to hear how it works out for you - I wish you the best!",
      "MessageIndex": 1,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811535",
      "Title": "3 treatments & skin already acting up?!! KristinaA slv58"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Oct 4, 2013 07:33PM SophiaMarie wrote: I was just going to post when I saw this thread - I just had my 2nd treatment and I swear there's a pink blush already. That kind of freaked me out. I'd swear it feels slightly irritated too, but that could be psychological. I hope it's not the stuff I've been putting on it, although I've never been sensitive to anything before.",
      "MessageIndex": 8,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/811535",
      "Title": "3 treatments & skin already acting up?!! KristinaA slv58"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Nov 13, 2013 11:26AM SophiaMarie wrote: I've used aloe with essential oils for hydration, followed by either a calendula gel or hyaluronic acid cream, followed by an emu oil/Tamanu oil/vit E/calendula oil/essential oil blend. I put this on immediately following rads and then once or twice more before bed. In the morning before treatment (more than two hours before) I just used either calendula gel or a skin therapy gel from my acupuncturist. I also saw an acupuncturist once a week. It has helped so much with pain!",
      "MessageIndex": 5,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/812904",
      "Title": "Radiation Skincare Check List palmbreeze dlb823"
    },
    {
      "AuthorID": "SophiaMarie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "SophiaMarie wrote: The papers from the hospital said that you should feel \"mild discomfort\" after the lumpectomy. Mild - really? I didn't take any meds after I got home because I wanted to see how bad it was, if I really needed them ( I have a fairly high pain tolerance and don't like to take anything). When the pain woke me up at 3:30 am, I realized that I most certainly did need them! Spent the next day at another hospital because a friend was having serious surgery - thought that would be rest enough since I was just sitting there, but was pretty uncomfortable (with meds). Today (surgery was Monday, today is Wed) its much better, but still really sore. I just took one Vicodin so I can move easier. Is this normal? The tumor was 1.5 cm and she just took the sentinel node. Also, after 48 hours it says to remove the bandages. That kind of oooks me out - I'm afraid to look at it! She couldn't use steri strips on me, just glue. I'm nervous that my bra will rub on an incision - and I have to wear a bra - otherwise it pulls. So am I being a wimp? Also, I cried some before this - I'd swing from being strong to being emotional, but I feel like I'm sliding more into the emotional side and am crying more... Is it just the settling of the adrenaline and the discomfort making it more real? Or am I just a basket case? Dx 7/2013, IDC, ER+/PR+, HER2- Surgery 8/4/2013 Lumpectomy: Right; Lymph node removal: Right, Sentinel Dx IDC, 2cm, Stage IIA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/808981",
      "Title": "Questions after lumpectomy SophiaMarie christina0001"
    },
    {
      "AuthorID": "SophiaMarie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184439/profile",
      "Content": "Feb 26, 2014 06:37PM SophiaMarie wrote: happy for you!",
      "MessageIndex": 21,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/818246",
      "Title": "Guess I'm Back in Here ... Pokemom1959 SophiaMarie"
    }
  ]
}