{
  "AuthorID": "Sophiemara",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
  "Posts": [
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Mar 8, 2018 08:33PM - edited Mar 8, 2018 08:48PM by Sophiemara Hey, yeah hormone therapy is usually used after surgery to reduce the risk of recurrence for ER+ breast cancer. I'm not sure how old your wife is, but hormone therapy in terms of tamoxifen or ALs are used to prevent systemic estrogen from circulating in the body, if premenopausal then they usually add zoladex or similar to shut down the ovaries which release estrogen. Hormone therapy has shown to reduce recurrence significantly, it does of course come with side effects which vary from person to person. In my experience nothing that can't be managed though. I'm 37. ALs do have a habit of reducing bone density over time, but they also are shown to be most effective..it's really a case of weighing up the risk. To prevent bone density loss a lot of onco use bisphonates now as well. Complimentary ways of reducing estrogen include losing weight (the less body fat the less estrogen), maintaining weight, avoiding alcohol, exercising (proven to reduce estrogen) avoiding animal products that contain natural estrogens (dairy, red meat), plastics (mimic estrogens), just look up estrogen dominance for tips, but I would never do these things in place of hormone therapy but additional. Being dx early there is always the likelihood that she might not have to be on hormone therapy for more than a few years, although her onco will advise. The risk of not doing hormone therapy is that it could come back and not necessarily local in the breast. Double mastectomy prevents it recurring in the breasts but unfortunately not in the distant body. A hysterectomy is another option, but it won’t prevent menopause side effects and although it prevents estrogen from the ovaries etc, it doesn’t prevent systematic estrogen. So likelihood would still be to have hormone therapy I would have thought. The fact is estrogen has many benefits in a normal situation including protecting bone density but once you take it away, the body will be more susceptible to density loss",
      "MessageIndex": 11,
      "PostDate": "08/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863037",
      "Title": "Wife = Er+ Pr+ Her2- Options besides hormone therapy? jabberwocky57 Jons_girl"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Apr 19, 2018 12:51AM - edited Apr 19, 2018 12:53AM by Sophiemara Hey, yes I was dx at 34 with stage 3, ER+ bc 2.5 years ago now. It is tough initially especially as everyone seems older, but once you have a treatment plan in place you kind of go with it. I joined a young women's support group initially and although I don't go to it anymore, I made some great friends and found it really useful to talk about things such as fertility, chemical menopause etc older women don't necessarily have to go through. You're not alone, so definitely reach out. It also gets easier the further out you get.",
      "MessageIndex": 1,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/864070",
      "Title": "33 yo - DCIS Stage 2 yougogirls yougogirls"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "May 7, 2018 06:57AM Sophiemara wrote: Hey, I had a 8cm tumour, it was multi focal which consisted of one 5cm tumour and another satellite 3cm tumour. I remember being shocked and terrified of the size! It was also grade 3, but 2.5 years later I’m doing well. It definitely isn’t a death sentence, so don’t think it is. Things will get easier the further out you get and I do everything I can now (within my control) to reduce recurrence eg exercise and diet. You’re not alone!",
      "MessageIndex": 12,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/864397",
      "Title": "Found out primary tumor is 9 cm Magnolia-mom star2017"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Mar 1, 2018 07:13AM - edited Mar 1, 2018 07:15AM by Sophiemara congratulations pip and Nancy, that's amazing! Mpetago, that's fantastic too. Your stats are very similar to mine and I just wondered if you were on hormone therapy and how long and what you do to keep the beast at bay? I was also dx at 34 over 2.5 years ago, so you are a real inspiration to me Thanks and here's to many many more decades.",
      "MessageIndex": 382,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Mar 3, 2018 01:50PM Sophiemara wrote: Thank you so much mpetago! Glad to hear you are enjoying life and taking it in your stride. Definitely, thanks for being an inspiration, I only hope to be in a similar position down the line",
      "MessageIndex": 386,
      "PostDate": "03/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/815407",
      "Title": "Stage III Cancer Survivors .... 10+ Years and Out AlwaysHope karen1956"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Apr 17, 2018 10:42PM - edited Apr 18, 2018 08:42AM by Sophiemara I did dose dense AC and T. My onco advised it was the most effective regime for pre-menopausal, which tends to be aggressive, because 2 week infusions doesnt givecancer much of a chance to regrow before getting blasted again, whilst still enabling your immune system (red and white cells) to endure it. It is the most aggressive and superior treatment I suppose for young high risk cancer. https://www.sciencedaily.com/releases/2016/03/1603...  ",
      "MessageIndex": 21,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/863505",
      "Title": "Optimal Chemo choice for ER positive, premenopausal women Walden1 Sophiemara"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Apr 12, 2018 08:43AM - edited Apr 12, 2018 08:44AM by Sophiemara I also had multi focal tumours totalling 8cm, main one was 5cm and satellite was 3cm. I was super scared by the size, especially because I couldn't believe i didn't notice it growing, it a c cup it was the majority of it..but you do learn to deal with it over time. I think larger size is associated with multi-focal and ER+ Potentially. That's fab about clear nodes though. That's the main thing. There's many of us doing good double figure years out+. Check out the stage 3 boards. You're not alone.",
      "MessageIndex": 6,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/863882",
      "Title": "6.5cm Yikes!!!! CoComedy Joyseeker"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Nov 20, 2018 10:39PM - edited Nov 20, 2018 10:42PM by Sophiemara Hey, I was dx at 34 with ductal bc in sept 2015. I had surgery first, mainly because they thought it was smaller than it was. I had multi focal-so two tmours which totalled 8cm. Then I had chemo every two weeks (same as your friend) 4 x AC and then 4 x Taxol. I also radiation after that and been on arimidex, zoladex and zometa for the past 3 years..life is good now, it definitely gets easier the further out you get. I also had.recon on both sides and feel normal. I also went through IVF prior to chemo as a future fertility option, as I have no kids. Its a bit of whirlwind initially but tell your friend to hang in there.",
      "MessageIndex": 6,
      "PostDate": "20/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/868387",
      "Title": "Stage III Advice metsnj123 Each_day_2018"
    },
    {
      "AuthorID": "Sophiemara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/268903/profile",
      "Content": "Mar 2, 2018 04:08AM - edited Apr 5, 2018 05:35PM by Sophiemara I've been on zometa for two years now with no adverse side effects. My onco said it's to protect the bone density against arimidex, which reduces it significantly over time and also studies have shown it blocks any metastasis from spreading to the bone. Many people take zometa or bisphonates whether cancer or osteoporosis related. The jaw necrosis side effect is very rare. My onco said it tends to occur in people with poor dental hygiene and my dentist said he'd only seen one person with it over the years and again, it was due to poor hygiene. If you need significant dental work they advise you come off zometa and then go back on it when complete. I also had a good dental check prior to going on It to make sure my pearly whites were good. You usually take it alongside hormone therapy, so I guess for as long as you are on that.",
      "MessageIndex": 11,
      "PostDate": "02/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/862336",
      "Title": "Zometa pros and cons IAmElaine Lexica"
    }
  ]
}