{
  "AuthorID": "southernbel…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274815/profile",
  "Posts": [
    {
      "AuthorID": "southernbel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274815/profile",
      "Content": "Jun 25, 2018 11:28AM southernbelle77 wrote: I’m sorry KK2018. I had my surgical biopsy on the 14th (I started my period that morning!) & on Friday I found out I have IDC, Grade 2, currently stage I. I have to undergo a mastectomy & I’m choosing bilateral. Also have a 2 week family vacation coming up. I leave July 14th for it. I’m going to do everything I can to keep that vacation as planned. My last beach vacation with my own I boobs. Lol. Rest up & then get back & fight. I think the obsessing & the pity party are normal because I’m doing it too. I hadn’t my doctor prescribe me some anxiety medication to help with that.",
      "MessageIndex": 10,
      "PostDate": "25/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865363",
      "Title": "World Upside Down and looking for some hope KK2018 Canavaro"
    },
    {
      "AuthorID": "southernbel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274815/profile",
      "Content": "Jun 6, 2018 12:56PM southernbelle77 wrote: You’re welcome Daring. I know how stressful it can be when you have a lump that causes any tell-tell BC signs. If it helps any, back then mine was hard & round. Felt like a B.B. deep in my tissue. It was deep, 1mm from my muscle.  Now here we are 8 years later & I have another lump that is bi-rad 4 & I’m all like “I’m fine, I can move it!” The things we tell ourselves sometimes. I have an excisional biopsy for this one next Thursday.",
      "MessageIndex": 8,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865048",
      "Title": "Indent on left breast Nervouskay Rvreg"
    },
    {
      "AuthorID": "southernbel…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274815/profile",
      "Content": "Jun 6, 2018 12:32PM southernbelle77 wrote: When I was 32 I had a lump that’s had caused a indent in my breast. I had an excisional biopsy & it was just a complex fibroadenoma that had attached to my breast tissue. So it doesn’t always mean cancer",
      "MessageIndex": 6,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/865048",
      "Title": "Indent on left breast Nervouskay Rvreg"
    }
  ]
}