{
  "AuthorID": "southsider",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
  "Posts": [
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Jan 9, 2011 12:09PM southsider wrote: Love, strength and peace to you.",
      "MessageIndex": 40,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763127",
      "Title": "Seems as if time is running out... pee vision2020"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Jul 11, 2010 11:09PM southsider wrote: Fantastic news!  Thumbs up!",
      "MessageIndex": 14,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/755182",
      "Title": "Good news Diana63 clemson93"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Apr 19, 2011 03:51PM southsider wrote: Lynn maybe you are just having an adjustment to the femara?  I gained weight when I went on it initially, but this settled down and I went back to my original weight again.  Lucky you to have gotten five years out of it!",
      "MessageIndex": 6,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767602",
      "Title": "Question about Femara and weight gain Lynn1 southsider"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "May 5, 2011 05:49PM southsider wrote: Go NERDs!!!!  Congratulations!",
      "MessageIndex": 51,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/767548",
      "Title": "I am a NERD Mazy1959 Mazy1959"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "southsider wrote: Hi ladies!  I may be terribly naive about this, so I am asking you experienced ladies! My impression has always been that if you are offered a place on a clinical trial, you jump at the chance. After exactly one glorious year of absolutely normal life, Femara is no longer working for me so I am now moving on to chemotherapy. I have two options; taxotere on its own, or joining the clinical trial, taking taxotere and adding (if I am randomly selected) a clinical trial medication. The problem is that this is delivered through a big awkward and ungainly pump, worn one week out of every three.  The substance must not spill as it is acidic, so the line must not be pulled out of place. However, I have a very lively little two year old boy; I'm not sure if this pump would work very well with parenting a toddler. However, a poor outcome is not compatible with raising children either. Any thoughts? Hormonal Therapy 1/9/2010 Femara (letrozole) Dx 1/15/2010, 6cm+, Stage IV, mets, ER+, HER2- Surgery 1/19/2010 Prophylactic ovary removal Chemotherapy 2/9/2010 Taxol (paclitaxel) Chemotherapy 2/9/2011 Xeloda (capecitabine) Radiation Therapy 12/4/2012 Breast Hormonal Therapy 1/9/2013 Aromasin (exemestane) Targeted Therapy 1/28/2013 Afinitor (everolimus) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766047",
      "Title": "Is a clinical trial always the best option? southsider EnglishMajor"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Mar 13, 2011 02:57PM southsider wrote: Ladies, thank you so much for taking the time to reply.  Just reading your wonderfully informed responses now. Considering on your suggestions, I have decided to agree with joining the trial.  It is a phase II trial, and I may not be assigned to the pump.  I will check if I can quit the trial if is simply too much with my little boy. My onc plans to put me back on to hormonals after this phase of chemo. This is a difficult transition for me as on my previous meds (Femara + another clinical trial medication) I lived a relatively normal life, and I was absolutely horrified when I saw this contraption that I would be wearing around.  It is like being punished for having cancer.  Also, I don't get on particularly well with the nurse assigned to monitoring this trial.  I find her to be a poor communicator, whereas the last nurse assigned to me was the most upbeat, positive and healing person I have ever met. I will report back to you if I end up wearing the pump!  Seriously it is the most ridiculous thing you ever saw!",
      "MessageIndex": 11,
      "PostDate": "13/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766047",
      "Title": "Is a clinical trial always the best option? southsider EnglishMajor"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "southsider wrote: I used to have a little baby oncologist, say he was Philip Seymour Hoffman.  But everyone told me I had to have the Brad Pitt oncologist!  The baby one used to examine me every time I saw him; he knew my file very well and he knew me also.  Now I have moved on to Mr Bigshot celebrity guy.  He doesn't examine me.  When he does his rounds, he sends a nurse (a very attractive blonde nurse, always the same one) around (the chemo chairs) to check patients' names.  Today I asked him a question based on my history and he got very cross and defensive- he said \"didn't we go through that in my rooms already?\" he is too busy and important to read my file!  He sent the nurse off to read my file.  He checked a page and he gave an incorrect answer and I didn't want to quiz him any further.  While she was gone he massaged my shoulder (I felt like saying get your freakin' hands off me, if you want to examine me properly, go right ahead but stop that massaging stuff!).  Baby oncologist could have picked my breast out of a line up, but celebrity guy wouldn't recognise me unless blondie told him who I was. I want baby guy back!  Why did I leave him?  Because I heard that Brad Pitt would hook me up with great clinical trials.  I had to jump through hoops to hook Brad Pitt but our relationship is a joke. Next week I will have a showdown.  I want answers!  Correct ones!  I don't want a shoulder massage, I want a breast exam! Thanks for listening ladies. Hormonal Therapy 1/9/2010 Femara (letrozole) Dx 1/15/2010, 6cm+, Stage IV, mets, ER+, HER2- Surgery 1/19/2010 Prophylactic ovary removal Chemotherapy 2/9/2010 Taxol (paclitaxel) Chemotherapy 2/9/2011 Xeloda (capecitabine) Radiation Therapy 12/4/2012 Breast Hormonal Therapy 1/9/2013 Aromasin (exemestane) Targeted Therapy 1/28/2013 Afinitor (everolimus) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771032",
      "Title": "I don't heart my celebrity oncologist southsider imbell"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Sep 26, 2010 08:36PM southsider wrote: 43 on diagnosis, stage iv from the beginning.",
      "MessageIndex": 562,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "southsider wrote: I feel proud of myself this morning.  Last night my sister-in-law said something carelessly hurtful to me.  When I was recently diagnosed I tended to smile at people who said stupid and careless things, and brood about such statements, allowing them to hurt me for days.  Now I challenge people; I stand up to them.  As for my sister-in-law, I just didn't let her get away with it (she is exhausted because she has little kids and she said that she would like to swap with me as I get so much rest because I have advanced cancer). I stood up to her and instead of coming away with the sting and the hurt intact inside me, I just wouldn't back down.  She kept justifying herself \"I only meant for one day!\".  One thing she didn't do was hold up her hands and say \"I'm so sorry- what a tactless thing to say\". It is difficult enough to concentrate on getting better without being eaten up inside by other peoples insensitivity.  Not any more! I am not swallowing it. Has anyone else had to learn this?    Hormonal Therapy 1/9/2010 Femara (letrozole) Dx 1/15/2010, 6cm+, Stage IV, mets, ER+, HER2- Surgery 1/19/2010 Prophylactic ovary removal Chemotherapy 2/9/2010 Taxol (paclitaxel) Chemotherapy 2/9/2011 Xeloda (capecitabine) Radiation Therapy 12/4/2012 Breast Hormonal Therapy 1/9/2013 Aromasin (exemestane) Targeted Therapy 1/28/2013 Afinitor (everolimus) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752355",
      "Title": "Deflecting the sting of hurtful comments southsider raro"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Feb 14, 2011 09:55AM southsider wrote:",
      "MessageIndex": 49,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764684",
      "Title": "I am NED lorrhaw Lowrider54"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Oct 28, 2012 09:57AM southsider wrote: At the breast cancer conference talking to a \"survivor\". \"so where do you have cancer?\" (me) \"in my lungs. In my bones. In my liver\" She \"oh it went on quite a wander, didn't it! Hahahaha\" Me ( weakly) \"yes. Hahahaha\"",
      "MessageIndex": 342,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "May 2, 2010 04:23PM southsider wrote: I was diagnosed stage iv in January, one week after my initial cancer diagnosis. I still have my original tumour, and am on Femara and on a clinical trial for a new compound.  I dont like having the tumour in my breast; I have fantasies about hacking it out myself; if feels horrible in my breast.  I accepted what they told me, that they are keeping the tumour to monitor improvements in my condition.  Frankly I didn't realise that there are other approaches.",
      "MessageIndex": 13,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/751928",
      "Title": "No removal of breast tumor mohonda mohonda"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Feb 10, 2011 09:45AM southsider wrote: Wow I am amazed at the idea of thinking about the cost of treatment.  I live in Ireland and I don't pay a penny for my cancer care.  At the moment I am on a clinical trial which absorbs all the costs of my treatment, but even if I wasn't, there would be no medical bills as they would be covered by the state.  Can't believe that Zometa costs 1000 dollars a bag!  Incredible!",
      "MessageIndex": 14,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764584",
      "Title": "Do you ever think about the high cost of your treatment? MJLToday Alpal"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Dec 12, 2010 06:31PM southsider wrote: My attitude to money has definitely changed since diagnosis... Our biggest expenditure is our mortgage and it will be paid when either of us die.  I also have a couple of insurance policies.  So yes, I treat money differently now, and don't feel that our need to put money away is the same... So I share your feelings about enjoying money now.  Hope you are doing well Fitztwins though, and I hope that we will both be here to watch our kids graduate from college!",
      "MessageIndex": 13,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761856",
      "Title": "College funds for our children Fitztwins EnglishMajor"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Jun 30, 2011 04:26PM southsider wrote: Wow Fitztwins you have fabulous hair!!!!  You not doing chemo at the moment? Looking good!",
      "MessageIndex": 44,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771005",
      "Title": "Why I Keep Going Fitztwins Member_of_the_Club"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Feb 27, 2010 04:55AM southsider wrote: Am interested in this Zometa discussion thread. I got Zometa the first time four weeks ago when I was in hospital having my oophorectomy.  I didn't experience side effects, but I am thinking now that the pain medication from the op helped with the side effects so I didn't notice them. Had my second dose yesterday and by the afternoon it was a different story.  In the morning I had a girlfriend over and brought my baby to the park, but in the afternoon I had abdominal pain, back pain, terrible exhaustion.  I got my mother-in-law to take the kids and I went to bed for the rest of the day. I was diagnosed stage IV a week after my initial diagnosis on Jan 18, so this process has come on me all of a sudden.  Yesterday was the first time I felt really sick with the cancer- I felt terrible.  Interesting about drinking water and having the infusion slowly.  I didn't know about this, and had my infusion in 15 minutes. I will know the next time- this information is really useful!  Thanks ladies!",
      "MessageIndex": 22,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748090",
      "Title": "zemata patti4511 southsider"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "May 9, 2010 07:41PM southsider wrote: Wow I really enjoyed reading these replies.  Most of you share a similar philosophy to my own regarding surrounding yourself with great and positive people, and most of the time I do this.  I had such a great chat with my husband today about this experience- he helped me so much to sort it all out in my head.. I think one problem is that people have no idea how much strength it takes to put your worries aside and attend a family occasion, trying to act and look absolutely \"normal\".  People then assume that your life-threatening illness is somehow nothing and they can make light of it. I am learning all kinds of social skills that I never exactly set out to learn!  Anyway, I'm still here, still myself and still very well for the moment!  Thanks for the solidarity!",
      "MessageIndex": 13,
      "PostDate": "09/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752355",
      "Title": "Deflecting the sting of hurtful comments southsider raro"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "Jan 13, 2012 03:14AM southsider wrote: Guilt? Are you freakin' kidding' me? Congrats fitztwins; I hope we hear a lot more of these stories!!!!! Thrilled for you!",
      "MessageIndex": 82,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780879",
      "Title": "Survivor Guilt - I am a lucky girl Fitztwins nancyh"
    },
    {
      "AuthorID": "southsider",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/97942/profile",
      "Content": "southsider wrote: I posted a message before for those stage iv ladies who still have their original tumour, but I have scrolled down and can't seem to find it just at the moment. I have a scan this week (Thursday but I may have to wait up to a week for a result). For the first time, I am going into the scan quite nervous as I have had a lot of pain in the lump this time around.  I have had shooting pains, itching, heat coming off the breast... and some relatively bad pain.  Something is definitely happening in there, and I can feel that it is not reducing in size, so I'm kind of worried.  However, I feel so healthy!  I am playing tennis every day, suffering from no fatigue and feeling really really well. Anyone else have pain that did not have a sinister cause?  Here's hoping Hormonal Therapy 1/9/2010 Femara (letrozole) Dx 1/15/2010, 6cm+, Stage IV, mets, ER+, HER2- Surgery 1/19/2010 Prophylactic ovary removal Chemotherapy 2/9/2010 Taxol (paclitaxel) Chemotherapy 2/9/2011 Xeloda (capecitabine) Radiation Therapy 12/4/2012 Breast Hormonal Therapy 1/9/2013 Aromasin (exemestane) Targeted Therapy 1/28/2013 Afinitor (everolimus) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/765518",
      "Title": "Stage iv Ladies with lumps southsider southsider"
    }
  ]
}