{
  "AuthorID": "southrnldy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163108/profile",
  "Posts": [
    {
      "AuthorID": "southrnldy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163108/profile",
      "Content": "southrnldy wrote: I hope someone can give me some insight as to what I am experiencing. I do have an appointment for a mammogram but I am scared to death as I am sure most of you know how I am feeling.  I am 50 years old and female and my symptoms are all on my right side. The top of my breast feels like a hard mass or knot about the size of a half dollar coin and on the side of it (under my arm) if I press down it hurts real bad. Then towards my back under my arm pit about 2 inches from the first spot is another place that if I press down it also hurts real bad. This pain is now running up my shoulder blade and my neck. I just started noticing it a few weeks ago and the pain seems to be getting worse. Have any of you ever had any of these symptoms? What do you think? Thank you very much!!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795403",
      "Title": "I'm just not sure, what do you think? southrnldy kellybx3"
    },
    {
      "AuthorID": "southrnldy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163108/profile",
      "Content": "Oct 24, 2012 12:58AM southrnldy wrote: Hi thank you for responding. Yes I have swollen glands under my armpit that hurts and then there is the large hard mass about 2 inches above the nipple area that also hurts on the side of it. As bad as I hate to admit this, I don't really exercise and I haven't done anything unusual in the past few months.",
      "MessageIndex": 2,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795403",
      "Title": "I'm just not sure, what do you think? southrnldy kellybx3"
    }
  ]
}