{
  "AuthorID": "Soyaandpepper",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149718/profile",
  "Posts": [
    {
      "AuthorID": "Soyaandpepper",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149718/profile",
      "Content": "Soyaandpepper wrote: Hi ladies, I just had BMX with 1 step to implants 3 weeks ago and I have a tooth that needs extraction, I will put this off as long as possible during my healing process for at least 6 months if I can. I'm doing some research and I found that you need antibiotics for this. Anyone who had it done like that? My research  show a link to CC and dental work and some resulted in the removal of the implants due to infection. Maybe you ladies can share some light into this!  Dx 4/13/2012, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2+ Surgery 5/7/2012 Lymph node removal: Right, Sentinel; Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788251",
      "Title": "Antibiotics for teeth extraction after BMX with implants Soyaandpepper Blessings2011"
    },
    {
      "AuthorID": "Soyaandpepper",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/149718/profile",
      "Content": "Soyaandpepper wrote: Hey ladies,  I'm 3 weeks post BMX with SNB on the right side and was wondering how long I should wait to shave under my arms? My doc say still not to shave yet since I might cut myself and cause an infection. I have an incision about 2 inches long under my arms and its has healed about 90%, but my under hair is really getting long and just wondering when you ladies started to shave under your arms again. Thanks!  Dx 4/13/2012, IDC, 1cm, Stage I, Grade 2, 0/2 nodes, ER+/PR+, HER2+ Surgery 5/7/2012 Lymph node removal: Right, Sentinel; Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/788221",
      "Title": "How long to wait to shave underarms after a mastectomy and SNB? Soyaandpepper MFalabella"
    }
  ]
}