{
  "AuthorID": "SpeedyTeach…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
  "Posts": [
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Nov 10, 2017 10:43AM SpeedyTeach wrote: Lifechoices-My RO had me putting on their lotion right away. I got the lotion a week prior from them and started that week before starting treatment. I'm not sure if that's every RO's recommendation, but wouldn't hurt to ask yours. They also gave me a sheet with instructions on how to take care of my skin and what to do and not do. My RO also gave me samples of other oinments as needed.",
      "MessageIndex": 271,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Oct 9, 2017 06:39AM - edited Oct 9, 2017 06:43AM by SpeedyTeach Hi everyone I will be starting my radiation TX's today. My mapping session was on 9/28 with tattoos put on at that time. Honestly the tattoos, hardly felt it at all. Reminded me some of allergy testing on the skin. My dry run was Friday to make sure everything lined up properly-took about a half hour and rad onc said today should go faster. Originally it was planned to do 25 whole breast and 5 boost but my rad onc informed me at mapping session that the new recommendation was 16 whole breast and 5 boost in the prone (stomach) position. I go to a large breast center and have to drive 30 mins so the drive will be a bear and hope I can do it every day without someone needing to drive me. I'm also scared of skin side effects since I'm very fair and sensitive to everything. I have a rash on my face still from taxol that won't go away-ugh. They gave me a lotion spray to put on 4 times a day, so hopefully it works. Wishing everyone minimal SE as we go through this journey. ",
      "MessageIndex": 53,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Nov 14, 2017 12:57PM - edited Nov 14, 2017 12:58PM by SpeedyTeach Lifechoices-sorry just saw your post about the lotion. This is what they gave me plus samples of aquaphor ointment when things started to get red. I used this 3-4 times a day. Allantoin and aloe are main ingredients plus a bunch of other stuff-lol. ",
      "MessageIndex": 292,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Oct 23, 2017 02:42PM SpeedyTeach wrote: Caley-I felt sensations as well right away. Mine was like quick twinges of pain. My radiation techs said it could be my positioning or possibly initial radiation swelling that some people get. Mine haven't gotten to much worse, though now 11 treatments in do have a bit more of a soreness feeling along my left side with a small bit of swelling, but not bad at all. I_brain-congrats on being closer to being done and hopefully the SE continue to not be too bad. Today I had number 11 of my treatments. I have 5 more whole breast then 5 boost to go. I felt fairly good today. I did get one or two very teeny tiny bumps over the weekend (could hardly see or feel them) that itched really bad but by this morning they were gone. I do have a little redness but overall the skin looks pretty good. My biggest issue has been more of a soreness along the left side where treatment is being done. Hope everyone has a good week and to those already doing rads, very little side effects.",
      "MessageIndex": 132,
      "PostDate": "23/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Oct 31, 2017 02:33PM SpeedyTeach wrote: #17 today out of 21. 4 more to go!! My last whole breast rad was yesterday with todays and the rest being boost. I am started to feel the emotions kick in as I reach the end of my treatment. I've also come down with a bad head cold. No fun laying on your stomach with your head twisted when you can't breathe. I_brain-congrats on being done!! DogersGirl & gigilala-i have had dizziness too on and off throughout my treatment but the first week was the worst. Hope that gets better for you both.",
      "MessageIndex": 178,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Nov 10, 2017 10:06AM - edited Nov 10, 2017 10:07AM by SpeedyTeach Hi All LOJO and Others whom finished treatment-Yay Congrats!! UTJOY-I am so sorry for your loss. I will be keeping you in my thoughts and prayers, I cannot imagine going through this and losing a loved one so close. CATLADY-I am sorry for the loss of your mother and mother in law. What a horrible year for sure. My prayers go out to you and your family.",
      "MessageIndex": 268,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Jun 28, 2017 08:06AM SpeedyTeach wrote: Well Friday was round 2 of DD AC chemo. It went much smoother than last time. Even though they got me with one stick I've changed my mind and decided to have port put in which is scheduled for Monday. Just feel it will be one less thing to be anxious about. Side effects from Friday are finally wearing off. I too think most of my side effects are from anti-nausia meds and neulasta. I just feel so fuzzy headed and dizzy with them but they keep telling me its better than being sick so keep at it. I may ask them about spacing them out a little more too. Yesterday was a crap storm. My 13 year old daughter woke up with a stomach bug then my hair starting coming out in clumps. Between trying to be hypervigilent with washing hands and disinfecting everything, had to deal with shaving my head. My 8 year old son had to veg out on cartoons. Somehow we got through the day. My husband had to finish a job (we own our own business) so I tried not to call him. My daughter is feeling much better today and it seemed to be a one and done type of thing so really hoping no one else gets it. And oh Popsicles, I will have to grab some, thats a great idea! Remember reading that on another thread and totally forgot. The nasty dry mouth taste is horrible! I had been swishing with biotene which helped but still had that nasty taste.",
      "MessageIndex": 344,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Jun 16, 2017 02:35AM - edited Jun 16, 2017 02:42AM by SpeedyTeach smilingwife-I am so sorry you are having such a hard time. I too am doing the dose dense AC and the first three days were tough, especially 1 and three. It definitely is no joke. I had my first one last Friday and finally feeling a little more like \"normal\" but still have this weird cloudy head feeling. I was very active prior to being diagnosed and ran quite a bit, so the neulasta pain felt very similar to when I trained for a half marathon, so I pretended I was recovering from that-LOL I think we will be doing what we can to make it through these treatments. hap b-Im sorry some of your family are being jerks. I have had quite a few people wondering the same about my treatment. Seems like most people lump breast cancer into one category. Everyone kept asking why I couldn't just go somewhere that does the lumpectomy/radiation therapy all at once. I tried to explain why mine was different but well you know, people can be very opinionated.",
      "MessageIndex": 183,
      "PostDate": "16/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Jun 2, 2017 04:18AM SpeedyTeach wrote: I was able to get a dentist appointment in today to get my teeth cleaned and checked. They made sure there wasn't any infections. Since I had x-rays earlier this year, there was no need for those again. They also gave me samples of biotene as well as a pamphlet on how to care for my mouth during chemo. I am very thankful Rukoni's advise on getting a checkup done prior to starting chemo, it at least makes me feel like I have a little more to go in if sores in my mouth do develop. Upheld-Thanks again for all the info on what you have learned/experienced so far. hhuey, vivianlu8, fancynacy5-wishing you all the best as you start your treatments and that they go as smoothly as possible. Moodyblues-Glad to hear your first session went well and hopefully you can get some rest to get caught back up on sleep. MsLin-We have the same chemo regimen. Thank you for posting your experience so far. I will be starting mine next Friday and hoping it goes as smoothly as possible. I hope yours continues to be as SE free as possible.",
      "MessageIndex": 27,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Oct 16, 2017 01:22PM SpeedyTeach wrote: #6 whole breast rads done today. So far doing good, just a bit of a weird/tight feeling along left side where lumpectomy and drain tubes was. My tumor was so far back against my chest wall that I had the tightness and nerve issues post surgery so just feels a touch worse but overall not bad , hoping it stays that way. dogersgirl-congrats on the clear scan, I'm sure that was a big relief dmjmom-what a fun idea about the scratch off lotto tickets! I may have to try that too, who know maybe I'll run into a bit of good luck. Hmm, I may bring some in for my last treatment to celebrate too. Wishing all minimum side effects having radiation this week :)",
      "MessageIndex": 102,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859149",
      "Title": "Starting Radiation October 2017 DodgersGirl DodgersGirl"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "May 29, 2017 07:55PM SpeedyTeach wrote: Hi everyone This is my first post and have been lingering on site for a while reading others experiences while waiting on test results. There was a delay in oncotype results then an unexpected triple negative result with score of 58 once it came in. My pathology result was originally ER+, so the breast center retested my tumor and found it was in fact triple negative with a very small section of it having a weak positive component to it (just happens to be where original biopsy was taken from). Think the surgeon called it a heterogenous tumor. Anyways they will now be treating it as triple negative. I will be starting dose dense ACT on June 9th, with the AC being every two weeks for 4 then the T every two weeks for 4 at a total of 16 weeks. My heart scan will be on the 6th to make sure its good for the treatment. I am very scared, but ready to fight. I am 41 and very active with a 8 year old son and 13 year old daughter. My biggest fear is how this will effect my family. Upheld-thank you for starting the thread and the information. Definately will be researching power pudding. Rukoni-that's an awesome idea about dental cleaning-think I may check into doing that too. ",
      "MessageIndex": 17,
      "PostDate": "29/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Jun 11, 2017 10:17AM SpeedyTeach wrote: TexasJ-Praying for you! Sounds like you have some good Dr's on it. Friday was round 1 of DD AC for me. I would like to say I went in strong but honestly I was a nervous wreck. The idea of having these poisons put into my body freaked me out. During the actual treatment I broke down and cried, after I had a weird reaction to the steroids they was giving prior to starting chemo. The steroid made me suddenly dizzy and my face went partially numb. Thankfully it only lasted a min or two. The nurse is going to see if they can piggy back it to slow it down even more next time. Unfortunately the reaction freaked me out and I cried when she brought out the tubes of adriamycin. The nurse was awesome though and we talked through my panic attack. After that the rest of the infusion went well. The afternoon after chemo, I slept a lot. They gave me meds that made me groggy so could hardly keep my eyes open and slept the rest of the day. That evening I felt sick but starting taking the antinausia meds and was fine after that. Yesterday (day two) I felt great. I kept up with the antinausia meds and had plenty of energy. Around 5 my neulasta went off but overall a pretty energetic day. Today (day three) I feel more blah and tired but so far its not too bad. I dont have a port because my veins are pretty big but seriously thinking about getting one. Going to see how next infusion goes first.",
      "MessageIndex": 139,
      "PostDate": "11/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    },
    {
      "AuthorID": "SpeedyTeach…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251869/profile",
      "Content": "Jun 20, 2017 09:02PM SpeedyTeach wrote: susie 2017-I had my blood drawn about 1-1.5 hours before my infusion. As for the neulasta-i have the on pro version and the nurse put it on my arm during my infusion towards the end last time. It felt like someone flipping a rubber band hard on my skin but didnt hurt. When the neulasta went of 27 hours later I felt nothing but it sticks really good to the skin so taking it off pulled my skin like crazy. I have felt really good since day 5 after my last infusion. My worst symptoms so far has been constipation (for abt 4 days post chemo), sleepiness (days 1 & 3 post chemo) and acid feeling in bottom of my throat. I'm grabbing some zantac to help with the acid and taking a stool softener twice a day when needed for constipation. Friday is my next infusion and hoping it goes more smoothly. Last time they had a hard time getting a vein (am I the only one that opted for no port??). If they have a hard time again im going to be rethinking the port. Also had a weird reaction to steroid but they are going to try to piggy back it this time to see if that helps.",
      "MessageIndex": 241,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855286",
      "Title": "Starting Chemo June 2017 Upheld pink_is_my_colour"
    }
  ]
}