{
  "AuthorID": "spitnspunk",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
  "Posts": [
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "spitnspunk wrote: This Post was deleted by spitnspunk. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757983",
      "Title": "Lumpectomy and SNB after effect questions spitnspunk hmillar"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Sep 19, 2010 01:48PM - edited Nov 7, 2010 12:25AM by spitnspunk",
      "MessageIndex": 3,
      "PostDate": "19/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/757983",
      "Title": "Lumpectomy and SNB after effect questions spitnspunk hmillar"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "spitnspunk wrote: This Post was deleted by spitnspunk. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/757975",
      "Title": "Brachytherapy spitnspunk spitnspunk"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Oct 9, 2010 11:04PM spitnspunk wrote: A lot of insurance companies will not pay for a mastectomy if it's not a medical need, that is, if they deem that a lumpectomy would be the standard treatment option so unless cost is not a factor in your decision (and it will be costly!) be sure you will be covered before making any decision based on personal preferance; some surgeons won't do a mast either if they don't believe it's needed. Also, if you have a lumpectomy and the area they need to take out is small and uniform, you might qualify for APBI Brachytherapy instead of the traditional once a day X 5 week rads; APBI is twice a day rads for only a week...but not everyone meets the qualifications needed for it, and not all BS offer it. Ask your surgeon about it.",
      "MessageIndex": 3,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/759079",
      "Title": "Mastectomy versus Lumpectomy and Radiation Ruthlo JanetinVirginia"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Apr 13, 2012 11:33PM - edited Apr 13, 2012 11:43PM by spitnspunk",
      "MessageIndex": 14934,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Mar 27, 2011 01:22PM spitnspunk wrote: I'll be 7 weeks PFC in two days and looking at all your pics I can tell I'm nowhere near any of you. I've got a little fuzz on the sides and a few pieces poking off the very top but you'ld have to look very close to see them...basically, I still look very bald so I'm guess I'm just gonna be one of the slow growers. I just ordered another wig today in a similar style and color to the one I wear all the time as it looks lke I'll be going through the summer with them...and I've picked up a lot of cutsie newsboy type hats, for anyone that wants those for the summer months, look at your walmart, Target, Kmart type stores as they have them really cheap. I found Walmart carries them for between five and ten dollars, but you have to check everytime you go into the store as their selection changes constantly. I also found a cute one on clearance for only four dollars...it fits great...then on a later trip I realized it was a GIRLS hat and not a LADIES hat...wow, my hairless head actually fits in a kids hat - go figure (now if I could only fit into kids clothes)!!",
      "MessageIndex": 8334,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 2, 2011 11:12PM spitnspunk wrote: HI, I stopped wearing my wigs the Friday before Halloween; then Monday at the office Halloween gathering those that didn't see me Friday were doing a double take and someone said to me \"wow, how did you get all your hair under that\" - I guess they didn't know that THIS was me and THAT for the past eight months were wigs! HA, but I changed my wigs up all the time so either they were really dense or they thought I was some sort of style freak changing my hair so often. Haven't gone back to the wigs this entire month, hair is still real short - about an inch and half  to two inches..last hard chemo was early Feburary, last Herceptin was beginning of November, so I'm hoping NOW it starts to grow. Funny experience: on a road trip a few weeks ago, at a pit stop and I was washing my hands at the sink, employee walks in and screams and I just about jumped out of my skin as I whirl around...and she then says: OMG - I saw your short hair and thought you were a MAN in here! I just laughed, and said nooooo...the cancer took a lot but I'm still very much a LADY thank you very much and walked out - to everyone (and it was busy) staring at the bathroom wondering what the 'commotion' was - I just raised my hands and said \"Ladies and Gentleman, THIS is what a cancer patient looks like!\" She followed me up front and continued to tell me all about her uncles brothers wifes cousins sister (or whatever it was she was saying) who had cancer...she seemed way more embarrssed then I was..but then...I've been dealing with it for a year and after you show your chest to so many doctors, nurses, etc - even someone thinking you're a MAN doesn't cause much embarassment.  Yep, if there's a good side to having this cancer, it sure cures one of being self conscious!  But I bet she'll never comment on anyone's hair again!!",
      "MessageIndex": 12751,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Apr 13, 2012 11:31PM spitnspunk wrote: HI, I havent' been here in quite awhile - I did chemo and rads and finally finished Herceptin in Nov 2011, and I'm on Tamoxifen now. I take biotin twice a day and yet my hair is still really thin on top and very very dry and frizzy, thanks to the tamo I'm sure. I've gotten it trimmed a few times to try to get some shape in it and to try to get rid of the really dry ends. Well, I found this product a few weeks ago that seems to work wonders; I wanted to use it for a few weeks before mentioning it here, to see how well it really worked, and so far - so good. It's called Morocanoil - by my standards it's kind of expensive, but I went ahead and bought the shampoo, the conditioner, and the oil and it seems to be working to keep the dryness away. Anyhow, I just wanted to mention it, but like I said, it's kind of expensive. I'll have to see how long the bottles last to know if I really want to keep buying it.  Looking good is one thing, blowing money isn't an option these day.",
      "MessageIndex": 14933,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 3, 2011 05:17PM spitnspunk wrote: LuvRVing, cute about the 8 yr old..reminds me of last Christmas season when I was wearing scarfs, my dtr and two little grandchildren went to the store and no sooner had they walked in when the two of them screamed GRAMMA and took off running...now my dtr knew I couldn't be there cause I just had a trtmt and was home sick, plus, I wasn't going out in the Holiday crowds due to the infection risk as my counts were to low...so she chased after and caught up with them just as they landed at the feet of a scarf sister - she said the look on the ladies face was priceless (I figure she was thinking  \"get these germy kids away from me\", lol ), the kids were so confused, but my dtr proceeded to apologize and explain that their gramma, had cancer too. I was pretty impressed that they recognized my 'new look', even if it wasn't me. Then there was the time the 3rd yr old put on a bandana, and came running up to me and said, \"I look like you now\", but the best thing was just last week...she rubbed my head and said Gramma, your hair is growing back!. Oh how sweet those words sounded!! :)",
      "MessageIndex": 12762,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Jul 1, 2011 01:17PM - edited Jul 1, 2011 01:19PM by spitnspunk So my last chemo was early February and while the back of my head has some growth, the top is still pretty much not growing, at least not up the front sides. It's fuzzy fur like. I'm in Georgia, so it is hot here, but it doesn't really matter, call me crazy - I'm actually getting used to wigs and I really like 'em! I wear them to work or dressy things and I weat hats most other times. I do go out in my pool out back without a hat, but have to put sunscreen on up there, that's for sure!! It's great to not have to spend time fixing my hair, just throw on the wig...and the options are endless! I have several; I've traveled with them in the last few months and it's really great to be able to change things up. Today I wore a red one to work..it's my \"I'm in a fun mood' one!! So - being hairless isn't the end of the world and not the worst of things. Embrace it girls, have fun with it, enjoy it and remember, it won't last 4ever (but I may keep wearing wigs, it's kind of fun!)",
      "MessageIndex": 10163,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Jul 1, 2011 03:25PM spitnspunk wrote: I used to get so bored with a hairstyle but always had to wait for it to grow out to do something different, no more! It's also kind of fun to keep people guessing what my next look will be. I didn't ask for this ride but I got it so I figure I may as well have fun along the way. I may seem a little \"off\" but really, if I've learned anything from this cancer experience it's that nothing is guaranteed, so enjoy life every day, have a little fun, be a little crazy!! It works wonders on stress.:)",
      "MessageIndex": 10165,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 24, 2011 03:34PM spitnspunk wrote: I've always had dead straight hair, no wave, no curl, and not much body to it so now what has returned post Chemo, I was treating it as I always had done: brushing it, but I seeing a lot of frizz. Then yesterday, I was given the tip to NOT brush it at all but just run my fingers through it to smooth it down. So I did that after my shower today and OMG - today, beautiful waves and NO FRIZZ. Golly, I've never had wavy or curly hair so who knew how to handle it, I didn't that's for sure, this is all so new!! Anyhow, I thought that might help someone else.",
      "MessageIndex": 13133,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 30, 2011 09:35PM - edited Dec 31, 2011 05:14PM by spitnspunk",
      "MessageIndex": 13272,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Apr 13, 2012 11:43PM spitnspunk wrote: Sorry, that was a duplicate post...don't know what happened there.",
      "MessageIndex": 14935,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Oct 28, 2010 08:46PM spitnspunk wrote: I don't think CA is any different that some members on this board, that is, I've seen a lot of members posting things in varous forums as if they have a breast cancer PHD just because they now 'have it' and did some research to learn about it (and they know it all, never mind that the REAL doctors went through years and years and YEARS of schooling to get their knowledge). Everyone is entitled to 'THEIR OPINION\", it's when their opinion starts being dosed out as the God Given Truth that problems arise. Take CA for what she is, just another one of us trying to survive this ordeal, and yes, she may have influence because of her celebrity status, but in the end, she's just one of us!",
      "MessageIndex": 39,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Feb 11, 2013 09:10AM spitnspunk wrote: HI, If the margins show just small amount of DCIS I'm thinking your Dr's believe that the chemo and/or radiation will take care of those cells, that's what those treatments are for, that is, to track and kill out any cancerous cells that remain.",
      "MessageIndex": 1,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/799963",
      "Title": "positive margins cc2e spitnspunk"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 7, 2010 05:09PM - edited Dec 7, 2010 07:35PM by spitnspunk She is at peace now, flyin on home. I am so so so sad.",
      "MessageIndex": 71,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Dec 6, 2010 07:23PM spitnspunk wrote: This info went viral on all the news stations here in Georgia a few moments ago. My heart is breaking; I wish her nothing but peace in her last days. I hate this disease more every day.",
      "MessageIndex": 28,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761600",
      "Title": "Elizabeth Edwards jleigh Lowrider54"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Apr 22, 2012 06:17PM spitnspunk wrote: I'm thinking that we probably need to rethink what 'feeling good' means, as I don't think we'll ever 'feel good' like we did PBC (pre breast cancer). I just finished my chemo in November and I'm also on Tamox. I'm back to work but have to go to bed at 8 every night just to make it through the next day; by the time I get home from work that leaves me about two hours, so yeah, now I'm living for two hours a day and the weekends, oh, and one hour in the morning for excercising.  Sucks really. But I realize it's my 'new normal' for now, the alternative is death, and welll, an hour in the morning, two hours in the evening, and weekends still seem much better then that alternative.  I do hope though that as time goes on, and maybe once I get offf the tamox years down the road, things will get better, but heck, by then I'll be so used to this 'new normal' that I won't know what to do with more energy if it shows up! As for the hair thing, I hear you on that too as mine is still thin and grows so slow, first it was the herceptin, now it's the tamox slowing it down. But really, hair is SO overrated, after not having any it amazes me how much importance people put on it. I mean, aren't we really all the same on the inside, hair or no hair? Yeah, we are, so don't let it get your down. It will come back eventually!!   Hang in their gir!!",
      "MessageIndex": 2,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/786276",
      "Title": "10 months after chemo and feeling lousy elena1 elena1"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Oct 11, 2010 09:10PM spitnspunk wrote: I'm stage one, had lumpectomy, SNB, one week brachytherapy rads, had a port put in and I start Chemo this Wed. I was fine with everything up till now but the closer I get to Wed the more I feel like I'm losiing it..I've read the posts from those that have already started chemo this month and I know they say it hasn't been bad so far so I don't know why I'm feeling like I'm feeling...since some of you already went through/ are done with that, is it normal to feel like I just want to run away and hide my head in the sand somewhere and pretend this will all go away on it's own....I know of course I can't do that but sure wish I could. Sigh.",
      "MessageIndex": 3908,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Oct 12, 2010 12:33AM - edited Aug 20, 2013 05:55AM by spitnspunk Thanks everyone, sometimes knowledge is a scary thing so I think I've just got a case of nerves. @Seyla, I'm doing TCH every three weeks for 18 weeks (6 total) with H in the weeks inbetween and then H for a year after the 18 weeks and then another something for 5 years..I'm sure I've got it wrote down somewhere but I'm not even concentrating on that last part until it gets way closer...one thing at a time. Your Dx and mine look exactly alike, what did you go through back in 2005?",
      "MessageIndex": 3914,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Oct 10, 2010 12:49PM spitnspunk wrote:",
      "MessageIndex": 8,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759162",
      "Title": "10-10-10 ITS MY BIRTHDAY TODAY! Anne45 Anne45"
    },
    {
      "AuthorID": "spitnspunk",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/108618/profile",
      "Content": "Sep 13, 2010 10:28PM spitnspunk wrote: I'm a DES daughter, was just diagnosed in mid August though so I'm just starting this fight and thus can't answer your question on if it is going to change my treatment. I have a grown daughter too but I didn't realize that me being a DES daughter had any effect on her, what have you found to be YOUR risk with your mom being the DES daughter?",
      "MessageIndex": 1,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/757980",
      "Title": "DES daughters bludevil Huskapet"
    }
  ]
}