{
  "AuthorID": "spooky",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79605/profile",
  "Posts": [
    {
      "AuthorID": "spooky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79605/profile",
      "Content": "Jun 19, 2009 01:48AM spooky wrote: BevR---I had absolutely no remorse in removing both breasts.  16 years ago, I had breast cancer in the left one.  Oct.31st last year, again in same breast.  I had been through radiation 16 years ago.  The PS didn't know if mine could take reconstruction or not but I decided to try anyway.  I had a double mastectomy in Nov. with expanders.  My decision was based on the fact that I did NOT want to \"wait until the other shoe dropped\" on the right side.  Anyway, because of previous lumpectomy, I was lopsided anyway, so getting two new ones should even me up. ..at least that's what I aiming for.  I will have the final surgery in July.   Whatever you decide will be the best option for you, you'll see. J ",
      "MessageIndex": 2641,
      "PostDate": "19/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "spooky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79605/profile",
      "Content": "Feb 18, 2009 02:03AM spooky wrote: Hi All,  I just found this board and am I a happy camper!!  I was diagnosed on my BIRTHDAY this year at St. John's Hospital in Santa Monica because I was diagnosed 16 years ago with breast cancer at the same place.  I have sinced moved to Northern California but come down once a year for my exams.  Imagine my surprise after 16 years. I decided to find a surgeon in No. Cal. because of logistics.  I had a double mastectomy the day before Thanksgiving and started chemo on Jan. 16th.  I had my 2nd treatment today.  I was just fine for the first few days, but on day five....whoa Nellie, a Mac truck ran me over and left me with such a headache.  Called my oncologist right away and he had me come in for FLUIDS.  Who knew??????  They gave me saline and I believe a \"booster\" whatever that was, but after that, my husband and I went to dinner. I was feeling great and each day after that I felt better and better.   Now, that morning I barely got off the sofa!!! Also, I found out today, that this group recommends taking a Clairiton tablet with your Nulasta shot and those that follow this apparently don't get that back pain.  My pain came on day 5 so tomorrow when I get mine I am going to take the Clariton as well. These are just two suggestions I had and thought I would share.  I love my doctors in Santa Monica, but I also have found great ones here.   ",
      "MessageIndex": 1206,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "spooky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79605/profile",
      "Content": "Feb 23, 2009 11:51AM spooky wrote: Alo123 - you and I seem to be on similar schedules.  I had treatment #2 on the 17th, shot on 18th.  Friday night was the worst, Saturday was OK, Sunday I was back to normal.  Today I went for a short walk and feel fine.  Am losing hair and getting my wig trimmed today for the first time.  I was wearing hats, then figured they were giving me headaches, so I'm going without for a few days.  My hair is just really short, but doesn't really bother me.  My scalp is not as sore as it was either.  I wonder if all my hair will fall out or if this will be it?  I hope everyone is well today. J ",
      "MessageIndex": 1310,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "spooky",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79605/profile",
      "Content": "Feb 18, 2009 02:54PM spooky wrote: ddlatt:  how many years in between for yours? LisaLisa:  I lived at 761 35th street.  Love Manhattan Beach and hope to go back there someday.  Maybe when my daughter leaves for college.  She's in 8th right now. I bought the 24 hr. claritin, who knew there were tons of kinds these days, so I don't really know if to take it this morning before my shot this afternoon or right after the shot.  Since it's the no drowsy I'm thinking tomorrow morning may be better for me.  Thanks for the tip, I just heard about claritin yesterday.   ",
      "MessageIndex": 1218,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    }
  ]
}