{
  "AuthorID": "SQK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
  "Posts": [
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Jul 21, 2008 12:46PM SQK wrote: Otter, you and I finished our T/C at the same time.  And your descriptions sound exactly like what I'm seeing... or should I say... what I'm not seeing!    At 6 1/2 weeks since my last tx on June 5, the lashes and brows have continued to thin, but I still have enough lashes to very carefully apply mascara to make what's left look presentable.  And not that I care about this very much, but I found it odd to see hair in \"the private area\" leave so abruptly a few weeks after the 4th tx.  There's not much left down there at all now.  But my scalp is just how you describe yours.  I keep checking it, but all I see is a bunch of sparse stubble on top and some very light fuzz or fine hair on the rest of my head.  Unlike you, though, I did get a wig and I'm quite used to wearing it now.  I got one of those gel headbands from the TLC catalog which makes the wig much more comfortable.  Still, it will be SO NICE when I can finally put it in a box and throw it in the back of my closet.  I'm guessing I have about 3 more months of the wig.  Is that too optimistic? Sue K.",
      "MessageIndex": 163,
      "PostDate": "21/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Dec 30, 2008 12:47PM SQK wrote: Well...I did it.  I ditched the wig and came to work with my very short, punky-looking hair.  I had my last chemo on June 5, and now have about 1.5 - 2 inches of hair.  It's longer and a little curlier in the back, shorter and straighter on top, and still kind of thin/fine near the temples.  I tried to spike it on top and I'm doing the best I can with gel and mousse, but I'm really not very good at this.  My co-workers (the few who are in the office this holiday week) have been very kind, saying it looks nice.  Still, I'm not very comfortable with my hair this short.  However it is my own hair and I'm very happy to have it.  Sue K.",
      "MessageIndex": 983,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Sep 5, 2008 04:18PM SQK wrote: Otter and revkat, I finished chemo about the same time as both of you.  I also have about 1/2 inch of growth.  Thicker toward the back, a little thinner near the front sides.  So far, it's straight and fine...just like before chemo.  But I'm very glad to have it. ",
      "MessageIndex": 315,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Nov 4, 2008 06:28PM SQK wrote: Can anyone give me some tips on how you spike the hair?  What kind of gel do you use?  I think I might have just enough hair now to give that a try.  Finished my chemo in June.  But my hair is growing sooooooooo slowly.  It's only about an inch or so long.  And it's poker straight on the top, a little wavier in the back.  Thanks!  Sue K.",
      "MessageIndex": 560,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Aug 13, 2008 06:29PM SQK wrote: I had my first TC treatment on Apr 3 and had the last one on June 5.  My hair was gone about 2 weeks after the first Tx and is slowly coming back now.  I'd say I have about 1/4 to 1/2 inch of very fine dark hair over most of my scalp, with it being a little more sparse toward the front of my head.  My lashes thinned during treatments, but they really started to jump ship toward the end of June/beginning of July.  Same with the brows.  I painstakenly try to thicken the few lashes I have left with mascara.  It's kind of depressing when I'm doing it, but it does help perk up the eyes a little.  Using a brow pencil to fill in the brow bare spots; that works well.  I still don't have any underarm hair back yet (no complaints there), but the leg hair has returned and I am back to shaving there now.  I'm also trying Nioxin on the scalp; I don't know if it's helping or not.  And last week I started taking Biotin (5000mcg daily) which I read about on another thread.  It's supposed to help with hair regrowth and to make your hair thicker.  We'll see whether or not it turns out to be a waste of $25 at the GNC vitamin store. jdg1, I also read about Revitalash on another thread and checked into it.  www.revitalash.com is selling it for $150.  Definitely out of my price range.  Did you order it from that website or did you get it somewhere else?   Do you think it was worth the money? Sue K.",
      "MessageIndex": 255,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Sep 3, 2008 12:32PM SQK wrote: Lori, thanks for the encouragement.  Your hair looks great!  I had my last T/C tx on June 5.  I now have about 1/2 inch of straight, fine, salt&pepper hair which, BTW, I am thrilled to have.    It's not coming in even.  It's thicker in the back, more sparse toward the front.  But what I'm wondering is...  if it's going to get curly, would I be seeing that yet?  Or do the curls come in later, after it gets a little longer? Sue K.",
      "MessageIndex": 306,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Oct 1, 2008 12:46PM SQK wrote: I finished my last chemo (T/C) on June 5.  Maybe it's just a bad case of impatience, but my hair seems to be coming in so slow!  I have about 1 inch of straight, fine hair pretty much all over.  But it's thicker in the back, more sparse and fine toward the front/sides.  I took my son to the hair salon for a trim last night.  I've known the stylists there for years and they've been very compassionate throughout my whole BC ordeal.  Anyhow, I asked them to take a look at my sorry little head.  They said it looked pretty good.  I think they were probably just being nice, but I'll take what I can get.     When they first buzzed it off for me at the beginning of chemo, the stylist said that after the hair started coming back it's usually best to trim it off again (after it gets about and inch or 2 long) to get rid of the \"chemo hair\" that initially comes in.  But after looking at my head last night, she said we might not need to do that.  I mentioned that I was taking Biotin and she thought that may have helped reduce the \"chemo hair\" thing.   So I would say the Biotin doesn't seem to be making my hair grow any faster but it may be helping with the texture. I've also been using Nioxin shampoo and conditioner.  Not sure if that's doing anything either.  But I'll keep using it just in case.  My hair before chemo was fine and thin, with just a little bit of wave.  I'm hoping between the Biotin and the Nioxin that something might help my hair come in a little thicker.  Well...one can dream anyway.  But at this point, I'll just be happy to have anything that's presentable in public.  I like my wig ok, but it sure will be nice to put it away.  Sue K.",
      "MessageIndex": 366,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Mar 18, 2009 12:52PM SQK wrote: I was 47 when I got my first dx.  Tamoxifen didn't work for me.  At age 49, I was dx'ed with a new primary on the other side, and also a microscopic recurrence on the original breast.  Now after bilat mast, chemo, and more rads...I'm hoping Femara does a better job than the Tamox.",
      "MessageIndex": 194,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 1, 2008 08:12PM SQK wrote: Hi all...I'm also joining the April Chemo Club.  I start my first tx on Thursday Apr 3.  4 rounds of Cytoxan/Taxotere.  Had bilat mast on Feb 29, and had the port placed yesterday.  Like the rest of you, the anticipation is creating a ton of anxiety.  I just want to get this started so I can get it over with!  I'll be praying for everyone.  We can get through this. Sue K. ",
      "MessageIndex": 42,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 3, 2008 02:02PM SQK wrote: My first treatment went very well today!  The only thing I noticed was when the Cytoxan was almost done, my eyes started feeling a little itchy.  The nurse said that sinus issues are common with that drug.  She said if it bothers me to take a Sudafed.  I did that and it fixed me right up.  So now I'm just pounding down the water.   Tomorrow I get the neulasta shot.  We'll see how the weekend goes. My nurses were so nice and made me feel so at ease.  I also met a lovely lady who sat in the chair next to me.  She was getting her last treatment today, except for herceptin follow-ups.  We ended up chatting for most of the time I was there and that was great.  Kept me pleasantly distracted.  Otter -- I hope you had a good first day too.  Look forward to hearing from you. Kalyla and Cinlee -- Sending thoughts and prayers your way for tomorrow.  For me, the anticipation was far worse than the treatment itself today.  ",
      "MessageIndex": 59,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 22, 2008 02:16AM SQK wrote: Wow, Otter.  That's quite a list you compiled.  You can add me in.  I get TC tx#2 on Thursday.  I'm on day 19 since my first tx, and the shedding hair was really becoming a nuisance.  I wore the new wig to work today for the first time and boy, was my scalp sore under there!  So I stopped at the hair salon on my way home from work and got the head shaved.  The hair dresser gave me some special oil to rub on my scalp. It feels a little better now, but it's still a little red.  Seeing the bald head is difficult...but it's one more milestone accomplished.  And it means the chemo is doing what it's supposed to be doing.  My prayers and best wishes to everyone... Sue K.",
      "MessageIndex": 349,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 28, 2008 05:16PM SQK wrote: For those experiencing a metallic taste, I think I read on another thread that zinc supplements might help with that.  I'm not taking a zinc supplement specifically, but there is sufficient zinc in my multivitamin and I haven't had any of the metallic taste.  Anyhow, wanted to throw that out there in case it could help. Sue K.",
      "MessageIndex": 537,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 26, 2008 12:08AM SQK wrote: Hi all, Just checking in.  Had T/C tx#2 yesterday and it went very well.  Pretty much like tx#1.  I got itchy eyes during the cytoxan infusion again, but a couple of sudafeds fixes that up.  I've been able to keep working thru all this so far.  I'm in IT, so I sit at a desk most of the day, and can work from home if I need to.  So after my tx yesterday, I did work from home in the afternoon.  Went to work today with just a slightly queasy belly, but it wasn't bad at all.  Eating a little light today, but keeping up with the high fluid intake and the resulting multiple trips to the bathroom.  Got the neulasta shot this afternoon and took some tylenol to ward off the impending achiness. Angie -- I really hope you're feeling better soon.  Sounds like you're getting lots of good advice from everyone here. Happy birthday, Nancy! More hugs and prayers to everyone, Sue K. ",
      "MessageIndex": 497,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 28, 2008 05:33PM SQK wrote: Hmmm...that is weird.  Go figure! ",
      "MessageIndex": 540,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 2, 2008 06:30PM SQK wrote: Hi Kalyla, I got my port implanted on Monday and was also surprised by the level of discomfort.  When I had the bilat mast about a month ago, I had practically no pain at all.  They used something with me called an On-Q Painbuster which delivered continuous local anesthesia to the incision sites for 72 hours.  It worked great!  But for the port, all they gave me was some pills called Darvocet-N (I think it's a Tylenol derivative) which didn't do diddle-squat.  But the good news is that the port site is feeling much better today. The bump under the skin still feels a little weird, but the pain isn't nearly as bad. I hope I can get some sleep tonight.   My onc instructed me to take Decadron the day before my chemo tx days, and since tx #1 is tomorrow I took the doses today.  It seems to have me a little wired.  Add in the anxiety and I may be catching Jay Leno, Conan O'Brien, and maybe even the guy that's on after that! Promise to keep the prayers coming for everyone.  Sue K. ",
      "MessageIndex": 50,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 18, 2008 04:58PM SQK wrote: Hi all, I had tx #1 of Taxotere/Cytoxan on Apr 3, so I'm on day 16 today.  I've been feeling very well, so I've kind of been in denial about the hair loss.  But I started noticing the hair strands starting to come out on day 14...right on schedule.  I wanted to mention a website for those who might be interested for hair to wear under a hat.  Go to www.HatsWithHair.com and click on the Products link.  My dear sister donated her own hair to have some \"underhair\" made for me.  It arrived on Wednesday and it's GREAT!!  I just love it, and I think it will be much more comfortable than the wig I got. So I'm ready with my backup hair, but I still don't know if I'm ready emotionally.  I think the hair loss is gonna be hard because I'm finally going to look like a cancer patient.  Up till now, that's been pretty easy to hide.  But having said that, I am very determined to stay positive and keep my sense of humor in tact.  Laughing at myself when I can, and drawing near to God.  That's how I've always been able to deal with whatever life throws at me.  Sue K. ",
      "MessageIndex": 294,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "SQK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/24259/profile",
      "Content": "Apr 23, 2008 07:56PM - edited Apr 23, 2008 07:59PM by SQK Hi all, I get T/C tx#2 tomorrow.  Tx #1 went very well...so I'm hoping for a repeat performance. RNKaren -- I started loosing the hair on day 14.  By day 19, it was getting all over the place and so I got the big shave.  I wasn't sure if I was going to laugh or cry.  Ended up doing a little of both.  But I'm glad I did it.  It feels much better now.  So far, I haven't noticed any eyelash or eyebrow loss.  So that's good!  Hopefully they'll keep hanging in there.   Sandy -- I was also in need of a cut/color right before I started the treatments.  I didn't bother with it...figured I'd save the money, and also it was easier to let the hair go since it wasn't looking very good anyhow!   Maybe this has already been mentioned, but for those starting this week, I strongly recommend keeping a daily journal of your side effects.  It's a great way to keep track of how you're feeling, and helps you plan for future treatments. Hugs and prayers, Sue K. P.S.  Thanks again to Otter for compiling the list of those getting treatments this week.  It was a great way to make sure everyone was included in my prayers!",
      "MessageIndex": 435,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    }
  ]
}