{
  "AuthorID": "squidgee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94284/profile",
  "Posts": [
    {
      "AuthorID": "squidgee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94284/profile",
      "Content": "squidgee wrote: The last few months have had me in a tizzy - wondering what's going on with my body, how much waiting a person can actually do before they start to lose their mind, and adding on the genetic discussions at the local familial oncology program.  I talked with the director of the program yesterday - an oncologist who has turned from TREATING cancer patients to working with families to prevent cancer. My biological family history is riddled with young cases of breast cancer - including my birth mom who had bilateral breast cancer at 42 and died from cancer reappearing in the liver by 50.   My birth mom had the gene testing in 2005 and it came back \"inconclusive\" which leaves me and my 2 half-sisters at a semi-loss. Talking to the genetics team, it sounds like we are at a fairly high risk of it appearing in our lifetimes - something like 3in10 instead of the 1in9 the average person gets. They've recommended we get my birth mom's DNA retested for the gene. They highly highly recommend it. But.... a big part of me is wondering. Ok - so let's say they DO come back with positive results. What does that mean for me? Do I WANT to get tested? Do I WANT to know that kind of information? I just don't know - and I struggle. The idea of taking \"proactive\" actions like masectomies or ovary removal... just seems so... unreal to me. Is it better just to live my life and what happens happens?  I'm not sure. But today, I'm struggling with it. I picked up a book at the library called \"Pretty Is What Changes\" by Jessica Queller.  It follows the story of a woman my age (early-mid 30s), as she struggles with this topic after she discovers she has the gene mutation. It's got me really thinking. And I'm not even sure this is a topic I WANT to think about.  Anyway, just rambling a little because I'm not sure my DH can fully understand or appreciate the mental state I'm in about breast cancer, genetics and all the stress I'm trying to avoid while waiting for the results of my biopsy. Thanks for listening.   Lisa Marie (almost 33yrs old, mother of 3 little boys, who thinks too much)  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/748163",
      "Title": "To Test or Not To Test.... squidgee mawhinney"
    },
    {
      "AuthorID": "squidgee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/94284/profile",
      "Content": "Feb 11, 2010 10:16AM squidgee wrote: I'm in Canada. I can't even get the test done unless my birth mom's test is positive or I have breast cancer. That's what I've been told by 2 different hospital genetics programs. They said it's like finding a needle in a haystack without knowing exactly what they are looking for from my birth mom's DNA.  Irregardless, I'm 99% sure I won't get testing. I don't want to spend my life in fear of getting cancer. I have no plans to get my ovaries out or a preventative masectomy. I've already been told that I would be able to get annual MRI screening tests done. I think that's enough for me.  I figure that I'd rather live my life and I'll deal with what happens. I just feel so overwhelmed these days.  ",
      "MessageIndex": 9,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/748163",
      "Title": "To Test or Not To Test.... squidgee mawhinney"
    }
  ]
}