{
  "AuthorID": "ss145",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206786/profile",
  "Posts": [
    {
      "AuthorID": "ss145",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206786/profile",
      "Content": "ss145 wrote: I have fibrocystic breasts that are rated as \"extremely dense\". Had a recent Mammo and US that showed a 1cm abnormality that was avascular and mostly cystic. Had core needle biopsy on 10/15 and was told that I should have results yesterday. I called today and was told that report is not in due to lab needing to do \"special staining.\" Is this bad news??? Surgeon who did US guided biopsy considered not even doing it because he felt that is was just a cyst. I had him do it anyway to avoid going through the stress of another abnormal test next year. I don't understand the \"special staining.\" Anyone???? Thanks in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825633",
      "Title": "Results delayed due to \"special staining\"??? ss145 LCH033"
    },
    {
      "AuthorID": "ss145",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206786/profile",
      "Content": "Oct 21, 2014 08:22PM ss145 wrote: Thanks MODS! That helps give me a little relief! Great site full of information and wonderful, supportive people! Keep it up, as there are so many who need it! Even without a diagnosis and during the wait, we all need someone besides our families and friends to turn to for advice. It is a huge help to get information from those who have \" been there.\" :",
      "MessageIndex": 4,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825633",
      "Title": "Results delayed due to \"special staining\"??? ss145 LCH033"
    },
    {
      "AuthorID": "ss145",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206786/profile",
      "Content": "Oct 22, 2014 09:27PM ss145 wrote: Surgeon called this morning and said that I do not have cancer, but that I do have to have an open biopsy to remove more of the area. He said it is atypical ductal hyperplasia. That surgery is scheduled for 3 weeks from now. Thanks to all who help to ease my mind. LCH033, I had my core needle biopsy on 10/15 and just got the results today. The waiting is terrible and stressful, but it seems like this taking longer than they initially tell you to expect does happen for a variety of reasons Best of luck to you and everyone else.",
      "MessageIndex": 10,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825633",
      "Title": "Results delayed due to \"special staining\"??? ss145 LCH033"
    },
    {
      "AuthorID": "ss145",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206786/profile",
      "Content": "Oct 21, 2014 08:14PM ss145 wrote: Even if it doesn't directly apply to my situation, I still appreciate the response! It has me concerned because everything I look up about special staining brings up them testing for certain types of cancer and what treatments to use......I know, the internet is a blessing and a curse! Glad to hear you had compete response to your chemo. Thank you for responding; I really appreciate any support.",
      "MessageIndex": 3,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825633",
      "Title": "Results delayed due to \"special staining\"??? ss145 LCH033"
    }
  ]
}