{
  "AuthorID": "Stacylee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131547/profile",
  "Posts": [
    {
      "AuthorID": "Stacylee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131547/profile",
      "Content": "Sep 26, 2011 09:42PM Stacylee wrote: 37 initially Mets found at 43",
      "MessageIndex": 695,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Stacylee",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131547/profile",
      "Content": "Jun 29, 2011 08:52AM Stacylee wrote: Hi. I am new to the site, just signed up this morning though have been checking you all out for a while. I guess that's called cyber-stalking? :0). Anyhow, I was dx'd with bone mets in my pelvis and all vertebrae except for two in 2008. Had no pain and certainly was not expecting the metastatic Bc diagnosis. I have felt fantastic for a while now but was dx'd with liver mets this past December. Just had a bone marrow biopsy yesterday because my blood counts are low and the doctor doesn't think I've been on enough chemo in the last six months to cause it. Have had increased pain in the last month or so but am hoping it's all a result of being too busy - working full time, daughter's wedding last weekend, family in from out of state ... Has anyone else been diagnosed with spread to the marrow specifically? I guess I'm rambling, first time and all. Do want to say that you ladies have brought me up at times when I was very low and no one else seemed to understand.",
      "MessageIndex": 40,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770837",
      "Title": "How long have you had bone mets? Foxlairfrm cmhartley"
    }
  ]
}