{
  "AuthorID": "StacieRae",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
  "Posts": [
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Jun 26, 2013 04:35PM StacieRae wrote: Thank you for starting this thread. I don't know how recent your diagnosis needs to be to qualify for \"newbie\" status, but I consider myself one. I found a lump (more like a small egg) under my right arm in early January and was diagnosed officially in early February. I started neoadjuvant chemo in mid-March, and by that point I had grown a large and ugly tumour in my right breast and had a palpable node under my left arm, of the exact same kind of bc, which the oncologist considers a metastases. I've done four rounds of A/C and one round of Taxotere (3 to go), and it still feels surreal to me that I have cancer. Early in the Fall I will have a double mastectomy along with dissections of both axillary areas. Then 5 weeks of radiation. I have a son who is almost ten years old, and an amazing husband, and I am so afraid of losing the future with them. I have been reading posts on this website for many months. I have so many incredible friends and close family who are supporting me through every minute of treatment, which I am so grateful for, but I yearn to connect with other women who understand what it's like to have a diagnosis this serious. It helps to know that others have come through this gruelling treatment, and all the dark thoughts, and are doing well.  Wishing you all the best.",
      "MessageIndex": 47,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Aug 26, 2013 01:37AM StacieRae wrote: Thanks for starting this thread. I just finished 8 rounds of chemotherapy and am scheduled for a BMX with axillary dissection on both sides in mid-September. The exact date is not confirmed because they want to be sure I have bounced back well enough from the chemotherapy to avoid complications after surgery. I am starting to think about the surgery quite a bit and I'm trying to process what is going to happen, and what my body will be like afterwards, and sometimest the anxiety can feel overwhelming. I'm 42, with a fantastic husband and incredibly loving 10-year-old son. It's good to remember that many other women are going through the same thing, or have come through and are doing well. ",
      "MessageIndex": 10,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 14, 2013 06:53PM StacieRae wrote: SchoolCounselor: My BMX with axillary dissections is estimated to take between 3 and 4 hours. From what I understand, I will be \"awake, but sedated\"...and will likely remember very little because they give you drugs (like Versed) that give you amnesia about the procedure. (I will likely have vague memories that add up to a few minutes of the 4 hours).  It's a bit more scary to contemplate being \"awake\" - but I weigh that against the potential of reducing recurrence (even if my odds only improve just a little) and the anesthetist telling me they use thoracic epidural for all sorts of surgeries with good results and better pain and nausea control. I am full of nerves now, not sleeping well, poor appetite from stress, and still feeling awful with taxotere side effects of muscle pain, extreme leg weakness and now some neuropathy in my hands. I would just like the surgery to be behind me, as hard as it is going to be to lose my breasts.",
      "MessageIndex": 164,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 21, 2013 10:58PM StacieRae wrote: Hi everyone, I've been catching up on this thread and was heartened to read about those who have come through surgery and others who have had good results and news to report. I am thinking of all those about to head into surgery. I got home from the hospital yesterday after two nights. My double mastectomy with axillary dissection on both sides went as planned on the 18th. I had to report to the hospital at 6 am, which meant getting up at 5, but I wasn't sleeping well anyway...and better than having to wait and worry and feel hungry all day! I've had a number of surgeries in my life, but this one had some \"firsts\"...first time I've had an IV in my foot, first time I've had a significant operation with an epidural (and just a bit of anesthetic to keep me from being too aware) and the first time I've had blood pressure monitored from my leg. I won't get the pathology results for a few weeks, but my surgery went as planned, with no surprises. I had a thoracic epidural and it worked like a charm. I don't remember anything of the surgery itself. When I woke in the recovery room, I had no pain and no nausea and was talking to my husband on the phone half an hour later. (Thank you Fentanyl via epidural!) My room wasn't ready, so I wound up waiting in the recovery room for 8 hours and chatted with the kind nurses almost the whole time. In that sense, maybe the epidural was \"too good\"...because I did not feel like resting. The nurses in recovery and on my floor said they had never seen a patient look so \"well\" after a double mastectomy, and they hoped epidural would be an option for more patients. I had very little pain until I started weaning from the epidural yesterday and was released on Percocet. Today is 'Day three\" and I feel a bit like I've been hit by a bus, with pain and nausea and aching everywhere, but it is manageable with Percocet and I have a lot of helpers and love and know that the worst will be over within a week. The drains (4 of them) are uncomfortable, and one of them is leaking fluid (yuck), but they will be pulled on Sunday.  I just wanted to check in to let everyone know I am doing well, and to thank you for the support of this thread. I wish everyone a good weekend, and healing thoughts, quick recovery and good path results!",
      "MessageIndex": 237,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 22, 2013 05:34PM StacieRae wrote: sandra4611: I'm sorry you weren't able to have the epidural for your procedure. I have to say I was nervous about it too, but when they were putting it in on the operating table, I was leaning over on a nurse who was distracting me very well from what was happening. We were chatting about our kids' basketball league (and they must have given me medicine to relax me through the IV) because it seemed like it was over in just a few minutes and it did not hurt. I'm pretty sure, though, that the thoracic epidural is just one puncture in the spine. It's high up, between T3 and T4 I think, and covers a wide area (which it needed to because I was having both breasts and both armpits done.) They also gave me some propofol and some versed, for sedation and so I wouldn't remember much. I am thankful that it went so smoothly, because from what I understand the \"coverage\" the epidural achieves can vary from person to person and other factors. If you had more than one prick in your spine, it is likely they were trying a \"para-vertebral block\" - which is more commonly used for breast surgery. It wasn't an option for me because I needed both sides to be done, and that would have required 8 pricks (4 for each side), each with a risk of lung puncture. They use thoracic epidural quite commonly for other surgeries, and since I was scheduled to stay at least a night in hospital anyway, they offered it to me. It was only after I had it done that I realized how uncommon it is to use this method for bmx. It really did work incredibly well though, so perhaps it's something that will become more routine.",
      "MessageIndex": 245,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 2, 2013 05:27PM StacieRae wrote: Mammasixtaz: My surgery is scheduled now for Sept 18th, provided I'm in good enough shape. I bounced back well from the first 6 rounds of chemo, but these last two have been tough and I'm still on painkillers for bone pain and my legs are so weak I have trouble climbing stairs. But I feel the turnaround coming soon. I'm determined to be ready for the 18th! I have a very aggressive cancer that was found first as a large lump in my right armpit, then spread to my right breast and then \"traveled around my body\" (very rare - according to my oncologist) to form a large lump in my left armpit, all within a month or so last winter. So while I will be sad to see them go, I would like everything that has cancer in it to be gone as soon as possible! Just a clarification: I am having a bilateral mastectomy with both axillary nodes dissected, but I am not having reconstruction.",
      "MessageIndex": 51,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 13, 2013 05:39PM StacieRae wrote: I'm less than a week away from surgery today, and trying to keep my mind in a good place. I've had some tests lately, for persistent symptoms, and really need them to come back clear! On the 18th I'm scheduled for a BMX (for many reasons I'm not opting for reconstruction so I will not get TE's). I will also be getting axillary dissections on both sides because I had matted lymph nodes under both armpits by the time I saw an oncologist. They consider that a \"metastastis\" because the cancer traveled around my body from the right side to the left, but I cling to the words of my oncologist that \"we are still going for a cure.\" My question to those of you who have had surgery is, did any of you get a thoracic epidural instead of general anesthesia? That is the plan for me. Avoiding general anesthesia can decrease the risk of a recurrence (because some cancer cells can be shed in taking out the primary tumour(s) and the immune system gets very depressed with general anesthesia). The anesthetist also said I would have better pain control and less nausea. I'm a bit nervous about the epidural, but think it's the best choice for me. It's not the same as a para-vertebral nerve bock, which can be used for smaller surgeries.",
      "MessageIndex": 157,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    },
    {
      "AuthorID": "StacieRae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177157/profile",
      "Content": "Sep 28, 2013 10:56AM StacieRae wrote: Thinking of all the \"colleagues\" on this thread, and celebrating with you as drains get removed. I had four in place and thought I was going to go insane, but they were taken out after 5 days, which is my surgeon's policy. (I'm not having reconstruction though, so maybe it makes it easier?) I was thrilled when they were gone, and to have a shower finally, so I am in awe of those of you who are coping with drains for a much longer period. I hope that just means when you finally get them out that the relief will be that much sweeter. I am ten days out from my bmx and axillary dissections and feeling pretty crummy physically. The good pain control I had in the hospital with the epidural gave me the false impression I hadn't had major surgery. I'm managing with Percocet, but it doesnt' really take care of the pain as well as I'd hoped, and my body finally stopped producing adrenaline I think, so I have \"let down\" and am very very tired and sore. I know I just need to take it easy for a few weeks and give my body the time to heal. So I will try. Patience is not my best quality. The steri-strips are still on my incisions, and I'm supposed to remove them today. I'm a little unsure how things are going to look. I had small breastst to begin with, but there is so much fluid under my breast incisions that they look almost \"normal\" to me...if I ignore the fact that they slosh around when I move:) Once I see they truly have no nipples, I know I will feel differently. It's a big adjustment. All of it is made so much easier, though, because I got my path results unexpectedly when I went in for my pre-Herceptin routine check-up a few days ago. I was supposed to get the pathology results from my surgeon next week, but the oncologist covering for mine came in and said \"I don't normally give pathology results, especially to patients I dont know. But yours just came in the system 8 minutes ago, and I thought you would want to hear them.\" She went on to say there were no active IDC cells found in either my breast tissue or in my lymph nodes. There was a small patch of DCIS, but it didn't affect the margins. So they consider it a complete pathologic response to the chemo! I could not believe what we were hearing. When the doctor left, my husband and I hugged and cried tears of joy. For 8 months I have been hoping for that result, but did not think it would happen. Feeling so thankful, and wishing the best for all of the women on this thread, and every family that is facing breast cancer. CPR is not a guarantee, but it improves my outlook for sure...which makes things easier to bear. Keep the faith.",
      "MessageIndex": 313,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/809930",
      "Title": "September 2013 surgery hobbesla4 Katlebbie"
    }
  ]
}