{
  "AuthorID": "stac17",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247372/profile",
  "Posts": [
    {
      "AuthorID": "stac17",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247372/profile",
      "Content": "Feb 19, 2017 10:17PM stac17 wrote: Hi, I am going through the same thing as you. I went for a second mammogram last Thursday and they found a small area of calcification (clustered). They scheduled a stereo tactic core needle biopsy for me this Tuesday. I know it's very scary, and like you it's easier emotionally for me during the daytime and at night my mind is all over the place replaying what the radiologist told me after the mammogram. The tech and radiologist were very serious/somber so that doesn't help. :-/ They didn't give me a report. Did you have to ask them for it? I'm trying to be positive, watched a 50 min. positive affirmation video today. :-) Sending good thoughts and hoping for good news. Please keep us posted on what you find out!",
      "MessageIndex": 2,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852889",
      "Title": "Suspicious mammogram, waiting for biopsy, very scared TartletMom cattledoglv"
    },
    {
      "AuthorID": "stac17",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247372/profile",
      "Content": "Feb 25, 2017 09:57PM stac17 wrote: Hi TartletMom, Just wanted to give a quick update! I was supposed to have my biopsy last Tuesday but my Dr.'s office hadn't sent a request yet to my insurance (the place I'm having it done is out of network) I had chosen to keep that appt. hoping it would've been approved by then. So it's rescheduled for March 8th.They said they will try and get me in sooner if there's a cancellation. And I requested a copy of the Radiologist's report of my mammogram (I didn't know I could get one until I read that you had yours, thank you!). It says BI-RADS 4. I have microcalcifications in my right breast. I'm having a biopsy this Tuesday for irregularities in my uterus (most likely scar tissue from c-section 13 yrs. ago) I was having irregular bleeding and cramping, that's why I went to the Dr's. in the first place. I'm just trying to relax and not worry, though it's hard not to sometimes! Take care and keep us updated!",
      "MessageIndex": 20,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/852889",
      "Title": "Suspicious mammogram, waiting for biopsy, very scared TartletMom cattledoglv"
    }
  ]
}