{
  "AuthorID": "Staceynan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156756/profile",
  "Posts": [
    {
      "AuthorID": "Staceynan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156756/profile",
      "Content": "Jul 20, 2012 06:32AM Staceynan wrote: Hi Shabby, I am having expanders as well. Is that what everyone refers to as TE's? Because of the need of radiation (lymph node involvement), my PS dosent like to do reconstruction until a later date. They sound horrible. Not sure what scares me most. I am an active person. I bike around 75 miles a week. I also make quilts, so I use my hands and arms to manuver fabric and cutting tools. Anxious about how long it takes before you can function again. Raise arms above head, put weight on pectoral muscles, sleep on stomach. Not sure the reality of having cancer has really set in yet. Still feel like it is happening to someone else. Cant even contemplate not beating this disease. Wonder if I let them remove a healthy breast is that letting the cancer beat me? Recovering from unilateral sounds hard enough is it twice as hard with a bilateral? ",
      "MessageIndex": 125,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    },
    {
      "AuthorID": "Staceynan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156756/profile",
      "Content": "Jul 19, 2012 04:59PM Staceynan wrote: New to the site. Just got my Surgery date of August 8th. Scared silly. Need mascetomy of the right breast  and lymph node dissection. PET and bone scan were clear, waiting for results of hereditary testing. Thinking of removing what turns out to be a healthy left breast. I have heard all the statistics concerning reoccurance, was wondering if there is anyone out there willing to talk about how they made the decision and what it was actually like. ",
      "MessageIndex": 110,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789851",
      "Title": "Any August 2012 girls? shabby6485 Beckers"
    }
  ]
}