{
  "AuthorID": "stage4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
  "Posts": [
    {
      "AuthorID": "stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
      "Content": "Sep 19, 2007 09:15PM stage4 wrote: Hopefully your blood tests are wrong. My doctor never ever uses them on me. I had a blood test done after I was dx with mets and before starting chemo it came back totally normal, which proved blood tests were not accurate for me. I've always had scans either pet or ct. Anything can mess up lab work... keep a positive thought that it is working for you. You dont want to have to go through chemos that fast trust me... you end up like me, too many chemos to be eligible for clinical trials and now I'm on the only chemo combo approved thats left for me. Scans in 3 weeks hopefully its still working.",
      "MessageIndex": 3,
      "PostDate": "19/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692417",
      "Title": "Xeloda might not work for me shend katie11"
    },
    {
      "AuthorID": "muthom-stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179946/profile",
      "Content": "muthom-stage4 wrote: First, I agree with everyone that PINK is not perfect and needs changes. (From the greedy merchandising to the unbalanced donations to the lack of support for MBC). That being said, if all the PINK makes one more woman get a mamo or do self exams, then it's worth it. I know that mamograms are not perfect (especially for people like me with \"very dense\" breasts) and don't catch all, but it does catch a lot. And a lot of these women do become \"survivors\" - as oposed to us - Stage IV \"Fighters\". So if it will save one of my friends from having to go through Stage IV, then \"yeah for pink\". As with others, I have am turning awareness to advocacy by posting a MBC fact of the day on my Facebook page. Hormonal Therapy 5/23/2012 Fareston (toremifene) Dx 5/23/2013, IDC, 3cm, Stage IV, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812385",
      "Title": "Yes, PINK needs changes - However.... muthom-stage4 Iwillwinthisbattle"
    },
    {
      "AuthorID": "stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
      "Content": "Jun 15, 2007 04:39PM stage4 wrote: wow Missouri.. thats one of the places I plan on going (my dad lives there) and I also am trying to plan a trip to Hawaii!!! Never been there and hoping I can figure everything out (hotel, air fare etc) I would love just once to fly first class and stay at a first class hotel...have someone wait on you and get spoiled.... (ah dreams are so nice) it'd be nice to see how the other half lives. I actually have traveled first class once to California (I LOVED IT) even if it was only a 1:45 minute flight, it only cost 50 bucks extra so I said what the heck. Speederpuppy: xeloda made me tried but worked very well. My doctor told me my body is so worn out with over 2 1/2 years of chemo I will pbly never have engery, even during this break I've been on I still cant make it all day without a long nap.",
      "MessageIndex": 3,
      "PostDate": "15/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/633329",
      "Title": "AVASTIN QUESTION stage4 DARLENEDENISE"
    },
    {
      "AuthorID": "stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
      "Content": "stage4 wrote: I'm starting my last chemo option (sorry sad but extremely true unless something new comes up for triple neg) avastin and gemzar on June 27th. I have a question for anyone who can answer these.. first should there be any tests done before starting avastin? I hear alot of concerns of blood clotting and bleeding out so thats alittle scary. Also, I'm hoping to take a couple of trips while I still can and I imagine riding in a car for long distances could be bad but what about air travel? Anyone I mean anyone have any ideas? thanks As long as I have the energy I WILL continue to fight Dx 9/22/2003, IDC, 3cm, Stage IV, Grade 3, 7/36 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/633329",
      "Title": "AVASTIN QUESTION stage4 DARLENEDENISE"
    },
    {
      "AuthorID": "stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
      "Content": "Oct 8, 2007 04:03AM - edited Oct 8, 2007 04:03AM by stage4 Oz, My onc never relies on tumor marker tests they never been accurate for me. Everyone one is different. It always good to get a second or even a 3rd opinion. as far as the anti-depression meds I'm with Traci see if you can try Xanax it works great for those \"bad\" days and the one time the doctor suggested it, after reading the side effects and most of them you have to take them for a couple of weeks to get the full effect and your not supposed to just stop taking them if you decide you dont like the way they make you feel. So I elected to go with xanax,  and for me it was the right choice",
      "MessageIndex": 11,
      "PostDate": "08/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692581",
      "Title": "How Do You Know... ozzie2 stage4"
    },
    {
      "AuthorID": "stage4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/13625/profile",
      "Content": "Sep 21, 2007 12:19AM stage4 wrote: I am so sorry to see this news she proved so much help to all of us here and I know from above she will look apon us and help each of us in many ways. God bless her family keep them forever safe and in her arms. amen",
      "MessageIndex": 102,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692418",
      "Title": "Shelli is an angel geeta75 Sige"
    }
  ]
}