{
  "AuthorID": "StageIVbone…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161932/profile",
  "Posts": [
    {
      "AuthorID": "StageIVbone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161932/profile",
      "Content": "Oct 6, 2012 02:37PM StageIVbonemetsDaughter wrote: QUESTION re: Mother's Stage IV Bone Metastases - broken ribs, crushed sternum Hello. I am writing for my mom, who is 76, and has been in the hospital now for about three weeks. Bone test showed cancer in her spine, she went in for pain and had surgery to put balloon in her spine, that went good but then she also had five broken ribs and now she has a crushed sternum! They haven't done radiation for the pain yet because the hospital has been poorly organized, poor care too. But good grief, will her bones heal? She's on Faslodex, only had one shot. She can't get relief from morphine pump, having trouble breathing due to ribs, sternum, morphine. How much can a body take? She hasn't had bone scan because she can't lie down, so not known how much cancer has spread through bones. Thank you for any info. Can get any from her doctors and they're all so unavailable too.",
      "MessageIndex": 822,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "StageIVbone…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161932/profile",
      "Content": "Oct 6, 2012 07:15PM StageIVbonemetsDaughter wrote: Thank you for your reply, Chrissie. We are in Maryland & the next nearest hospital is not an option as she has had bad experiences there. She lives in an urban area but this is the best there is there, she's not a politician, just plain folk so as good as it gets. They are going to try the radiation for her on Monday offsite. I have been trying to find out who is in charge of pain but every time I call the hospital, everyone has a foreign accent from all over the place and I can't even understand them. I will find out who is in charge of pain for her but with the weekend, that just means chaos. I just hope she doesn't get another hospital bug. Medicare won't cover her to change hospitals anyway. She's been told her bones would never heal repeatedly and that they will heal as many times. She has been a bit of a difficult patient too giving them the idea she doesn't want treatment but that's just because she's in so much pain & can't think. She doesn't know that any treatment exists and hasn't been told in good enough English to understand. So do you think her bones might be able to heal? At least she's had one dose of Faslodex so that's getting things under way to go in remission, as she has been told. Thank you again for your reply. I really appreciate it. D.",
      "MessageIndex": 824,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}