{
  "AuthorID": "Star111",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281643/profile",
  "Posts": [
    {
      "AuthorID": "Star111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281643/profile",
      "Content": "Star111 wrote: Hi I am recently diagnosed with breast cancer and can use a friend. Diagnosed a week an half ago. Had surgery a few days ago. Realized something was up last summer when I began having electricity sensations in my breast. It started out of nowhere. I reached up to touch it as it occurred as it hurt quite a bit. That’s when I felt a lump for the first time. I waited a month or so to see my doctor because I had always was told that breast cancer doesn’t hurt. I figured it was maybe a cyst or something. My doctor appointment was in October. He felt three lumps and sent me for a diagnostic mammogram which was set for late November. After that I had a diagnostic ultrasound. I got a call from a breast surgeon in December saying I needed an mri because I had dense breasts and it created hard to see anything on the mammogram films. As for the ultrasound it showed nothing. My breast mri was late February. A few days later I got a call from the surgeon explaining that an enhancement was found on that mri. That I needed a biopsy and and ultrasound. My ultrasound was early April. It showed i needed a biopsy that should be Mri guided because it was a most accurate choice. The biopsy was in May. Then I received the news a week and a half ago that I have breast cancer and I had surgery two days ago. My diagnosis took nine months. If any lurkers are here, know that breast cancer can hurt. Not just cysts Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871847",
      "Title": "Just recently diagnosed. Could use a friend. Star111 dtad"
    },
    {
      "AuthorID": "Star111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281643/profile",
      "Content": "Jun 1, 2019 12:00PM Star111 wrote: Hi Wised on your kind words. I’m sorry to see that you are struggling with this too. I will for sure let everyone know my report when it comes in. Sincerely Sta",
      "MessageIndex": 6,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871847",
      "Title": "Just recently diagnosed. Could use a friend. Star111 dtad"
    },
    {
      "AuthorID": "Star111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281643/profile",
      "Content": "Jun 2, 2019 03:34PM Star111 wrote: ☹️ My emotions are all over the place.🙈",
      "MessageIndex": 7,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871847",
      "Title": "Just recently diagnosed. Could use a friend. Star111 dtad"
    },
    {
      "AuthorID": "Star111",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281643/profile",
      "Content": "Jun 1, 2019 09:50AM Star111 wrote: thank you Meow, Edj and Mountain. I’m still recovering from surgery and I’m totally doped up on pain meds while reading this. You ladies are comforting and helpful. Thank you My diagnosis is idc size 2.7 cm with two random dcis focal tumours nearby surrounding it. My surgery was a lumpectomy with wide margins and sentinel node dissection and biopsy. I won’t know more on the histology until those results are back in 2-3 weeks. Here where I live the healthcare is a slow process although any important results came quickly. I am thinking positive that the nodes and margins are good. The surgeon told me that he removed a large plum size out of my breast to make sure he got it all. As a small breasted lady to begin with it seems like a lot. He said it’s high grade three so he acted fast. I guess the difference between the February mri and the May mri were substantial. Anyways I’m just glad they got it out. I know I need intense radiation for sure as he told me. I won’t know about other additional treatments until the pathology results are back. Look forward to hearing from you ladies and thank you for your replies. Sincerely Star",
      "MessageIndex": 4,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/871847",
      "Title": "Just recently diagnosed. Could use a friend. Star111 dtad"
    }
  ]
}