{
  "AuthorID": "starbrightl…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
  "Posts": [
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 13, 2015 05:00AM starbrightlyshines wrote: Thank you for your response on my post. I will be sending you an email to request a copy of your document, I will feel better having something in hand to give my onc when I talk to him about Faslodex :)  ",
      "MessageIndex": 24,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828391",
      "Title": "My Completely Updated MBC Document Bestbird JFL"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 31, 2014 04:22PM starbrightlyshines wrote: Sending you good thoughts and hugs. I hope you are comfy at home.",
      "MessageIndex": 87,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819674",
      "Title": "Hospice for me. Chickadee Jac53"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 2, 2015 01:10PM starbrightlyshines wrote: I am so sorry you are having to go through all this. I do read your blog and wondrered how hou were doing since your post in Nov. I have children too, and your Halloween post really hit home and stuck with me. What we have to go through ourselves is one thing, but seeing how it efects those we love can be heartbreaking.. I think Mrs M always has a compassionate voice full of wisdom here. She made several really good points. Transitions are always hard and I think you will feel better once you have a plan in place. You need to take care of you. And your children need you in whatever capacity you can be there for them. Your husband has a job, and while it sucks that they are changing things on him, at least it will pay the bills for now......and hopefully  he can still seek out an option closer to home for the future. Dont give upin yourself. Despair is a trap that is easy to fall into but so hard to get put of once you fall over that edge. I know because I was teetering on that  very same edge a few days ago. And there was no one offering me a lifeline, I had to talk myself away from it. Praying helps, I know from your blog you beliece that as well. About three weeks ago the message at church really hit me. It was from 2 Samuel 7, God's promise to King David. King David wanted to build a temple, but God's plan was so much more....the royal line of David. So whatever plans we have, God has so much more in store for us. It might me that we have to give up a plan, or a deam, but in the end it might be more than we could have imagined. Breast cancer has changed us. Maybe some of the things that I so much wanted so much, that I thought were good things, maybe I wont be able to have. But I have faith that God's plan can be better than my own. It might be different than my plan, but it could also be so much greater. I know not everyone thinks this way, and I only posted this thought because I know you have a deep faith and maybe you too can get some hope from this. Think about all the things that you can control, focus on what you have that is good in your life. And try to make peace with the future by taking one day at a time. Becuase today is what we have right in front of us. ",
      "MessageIndex": 12,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827303",
      "Title": "What Are We To DO? Freedomchild82 redwolf8812"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 13, 2015 09:12AM starbrightlyshines wrote: Garlikbread-My onc used to ask me at every apt about depression and offer me something. At first I felt more anxiety than anything so I took Ativan as needed. It lasts longer than Xanax and I feel more \"normal\" when I take it, Xanax tends to act quickly and I feel the effects more noticeably. So maybe Ativan might works better. I also think my pain meds helped me not feel depressed because I felt my emotions more at a distance, they weren't so painful and raw. Now that I have cut back on pain meds I have considered asking for an antidepressant but I don't think I really need one yet. I won't hesitate to ask for one if I feel like I need it, and I encourage you to talk to your Dr about it. The social worker at the hospital was surprised to hear I was not on one, I think it is very common for Stage IV women, especially those with family at home we are caring for, to feel overwhelmed and depressed. Please consider it, if it can help you live your life with more joy I would think that would really be helpful.  ",
      "MessageIndex": 2,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831420",
      "Title": "Depressed Mom Garlikbread LindaE54"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 18, 2015 05:28PM starbrightlyshines wrote: Thank you glennie for the insider info, it is something that I think we all worry about. I had abdominal mets at diagnoisis and I know how painful they are. Heat from a heating pad really helped me, in conjunction with pain meds. I didn't try Fentanyl patches but my Dr did say they were available if the oral pain meds didn't help. Hang in there, Romansma had some great ideas about letting everyone take care of you and just hang out with your kids. Really, our presence is the most important thing to them, even if we are feeling like we aren't doing much. Hugs, talk to your Dr and let him know how bad it is.",
      "MessageIndex": 16,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830526",
      "Title": "Pain med advice please Tina72 sas-schatzi"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 12, 2013 12:51PM starbrightlyshines wrote: I was diagnosed stage IV with mets to ribs and GI tract, no primary tumor in breast was ever found. Is it tue that survivalnstats are better? I hadnt heard that.",
      "MessageIndex": 6,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815364",
      "Title": "sternal metastasis (de novo) mahorgo Leah_S"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 12, 2013 05:26PM starbrightlyshines wrote: I dont think we were comparing rates, I was just surprised to hear that as I had never read it before. Sorry if I offended you, it wasn't intentional.",
      "MessageIndex": 9,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815364",
      "Title": "sternal metastasis (de novo) mahorgo Leah_S"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 13, 2015 09:03AM starbrightlyshines wrote: Sending you hugs, prayers and wishes for peace. Hold onto hope and the love of family, friends, and all of us here to help you get through this.",
      "MessageIndex": 11,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831418",
      "Title": "Please, Lord redwolf8812 GrammyR"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 3, 2015 09:07AM starbrightlyshines wrote: Glad to hear about the bilirubin. I am praying for you and your family. I believe in the power of prayer, and I know you do as well :)  ",
      "MessageIndex": 212,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831418",
      "Title": "Please, Lord redwolf8812 GrammyR"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 16, 2015 05:29PM starbrightlyshines wrote: Thank you ladies for sharing your experiences. It is so scary going through something like this, and it seems like there are so many different opinions on treatments that it is difficult to decide. Politics and egos aside, they need to put the patient first! Whildchild-I know of people who have had to take breaks from Ibrance or lower the doseage. Maybe one of these might be an option for you. It makes me upset to hear the way the visiting nurse is talking to you about what the cost is. When I am the patient I never want to make waves and I seem to think that the medical personnel know best. But when it is someone else it's easier for me to speak up. If you want to try something else, chemo or otherwise, then that is your decision and I would hope your Dr would respect you for it. Take support where you can find it, whether it is here or your local cancer center. There should be a social worker there who can help you, or who can point you to someone who can.",
      "MessageIndex": 9,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/838547",
      "Title": "Plurex drain ascites......feel alone here in uk Torridon Longtermsurvivor"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 3, 2015 03:39PM starbrightlyshines wrote: One of the hard things is that she doesn't have a real sense of what she wants to study. And this is seems like a change in plan. She got into a really good school and she can make it work because of her grades. Her friend didn't apply and probably would not have gotten the financial package that she got. So this school in Arizona is one where they were both accepted. I think it sounds like an adventure to them, heck it sounds like an adventure to me! Maybe I am letting cancer cloud my judgment more than I realize. But I have a close friend who children are going to college out of state, and I know how hard it is for her every time they call being sick or needing help. I am not saying much, I realize it is her life and I do want what is best for her. Breast cancer just adds another layer onto whatever it is that we are experiencing. I don't look at statistics so I don't talk with my children about them. I don't talk to them about the list I have in my head of future treatments. I don't want their lives consumed by a parent with cancer. It's not a secret in my house, but I don't think it is on their minds everyday like it is mine. Thanks exbmxgrl, it is just nice to be able to voice my concerns and not just have them floating around in my head :)",
      "MessageIndex": 2,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829074",
      "Title": "Children heading off to college starbrightlyshines 3-16-2011"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 9, 2015 11:14AM starbrightlyshines wrote: Sorry to have been out of the loop. I have been having really bad anxiety, not all caused by the this particular situation but this hasn't helped. ibcmets-2 hours sounds like a great distance! Sounds like you are going through a similar situation. Sending you peaceful thoughts, transitions are so hard. 3-16-2011-you are in Spokane! How I wish she would have considered some of the colleges around there, it would have made it so much easier on me. But it's not all about me, lol! I have to keep telling myself that :) And you are correct, every decision I make as a parent somehow has cancer factored in it, directly or indirectly. Rosevalley-I echo your thoughts. My health could change at any minute, it already did. I went from being healthy (or so I thought) so stage IV MBC within a few days. I don't feel well a lot of the time. And her younger siblings are going to miss her tremendously. Anywhere she ends up going will still be hard. Almasi-The school in Arizona is a bit less, but even so with airfare and travel time she will only be able to come home 2 or 3 times a year. And those times it will be battling holiday travel with the airline schedules. I think its one of those things you don't think will be a big deal as an 18 year old, but as an adult having done so, it sometimes makes it impossible to make a reservation or finding you are caught in flight delays. If there were a program she was interested in, or some reason she wanted to be far away I could understand a little better. But I am not getting much......just that it would be a fun place for she and her friend to go together. We are not in a financial position to fly her home, it will be school loans and campus jobs that will helping her pay expenses. DivineMrsM-In hindsight, I wish we would have talked about distance before. I did talk to her last week and asked her is she would go if her friend did not. She said no. She also said she wouldn't go to a college just because her friend did. So this college in Arizona just happens to be one they found appealing (sunshine mostly I am guessing). She said she didn't want to go that far away unless she had a friend go with her. I am kind of guessing that is one reason she is not as excited about the other school...she would be going alone. Kojnes-yes, it is a tough decision. The distance just seems so hard for me. I used to be able to jump in a car and drive across the state. I don't have the energy or stamina to do that anymore. So what was once possible, and the life I imagined when the children left home, is not a reality anymore. It is very sad. I am very depressed. And I am wrangling with a new insurance company who is restricting my meds so I am in pain and just an emotional mess. I had a busy weekend but now I am on hold with the insurance company and feel like crying. Benjnate-if she were definite about some concrete reason I could be so much more supportive. I think she wants to go to college, I think she is ready for that next step but I don't think she is ready to do it on her own, without a friend for back up. I think this is why we see her digging her heels in so much. Bon-I didn't get to read either post so no worries. I am sure there are many opinions out there. I am feeling so physically and emotionally vulnerable right now, I know that doesn't help any rational thought.",
      "MessageIndex": 14,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829074",
      "Title": "Children heading off to college starbrightlyshines 3-16-2011"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 3, 2015 03:57PM starbrightlyshines wrote: Almasi, you would most welcome to join in!  ",
      "MessageIndex": 4,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829074",
      "Title": "Children heading off to college starbrightlyshines 3-16-2011"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 19, 2013 11:46AM starbrightlyshines wrote: I am still in bed at 11:30.....drinking tea, checking my email and bco.. we went to a family reunion last week so I am trying to regain some energy here. I have the usual mountain of laundry but I am soooo emotionally drained. It was a reunion with the inlaw side of the family. I had high hopes of us enjoying each other, having fun withbour kids and just making a good connection. The kids were great, I had so much fun with my neices and nephews. But the adults came and went on their own schedule, and its apparent to me that not everyone feels how precious time together is. I may not be there next year, or someone else may dealing with a hardship. We were all threr in one place......why cant we enjoy it for a few hours? Its just disappointing, if we dont have a close relationship now I dont see it happening. We even live in the same town. Aargh! I have to let it go......someone tell me how to let it go please!",
      "MessageIndex": 20,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809079",
      "Title": "Fatigue or laziness? starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 19, 2013 04:18PM starbrightlyshines wrote: Bayoubabe- I wish we could find the secret for not dwelling on the negativevaspects of some relationships. I amtrying to learn some meditation in hoping I can calm my mind and find some peace. Tina-I can relate to finding it hard to get a spark going. I usedvto oive to read, now I find it hard to get a bookstarted. I have bought yarn for some cute scarves, but I have one almost done and I cant get up the interest to finish it. Several months ago I went to a bead shownand bought some gorgeuous beads. But the y are still sitting there waiting for inspiration! But to my chagrin, the worst is my pile of photos I started organizing last spring for my daughters graduation. I needed some for decorations and I actually got excited about having in albums. Hee hee, there they still sit! But I found a desk and moved it into a spare room and I am feeeling a \"spark\" of interest in getting a little craft area together......a place that is all mine, even tho its still the kids toy room I am going to make my corner cute and infuse it with a sense of peace and hope it will promote some creativity. I miss that little \"spark\" of interest to keep me going and I feel like I neeed to nuture it. Are you ladies taking anything for depression? Im not, I may have a touch of depression but I dont think I am at the point of needing meds for it. I took zoloft once for ppd and I really lost all enjoyment in reading and hobbies so I would be reluctant fo try it again. Linda-I had my feelingsbhurt recently with family members too. We had a family reunion and they came for a couple of days (we were therenfor a week) and they made plans to go off and do their own thing. So instead of a nice big family dinner the last night, it was a rushed mess trying to work around their schedule (which only a couple of people even knew about) . So they acted put out, my mil and fil were totally confused as to why some people were eating early and some werent and sufffice to say I just coukdnt take the stress and back handed comments. I quietly went into the bedroom and cried becuase who knows how my health will be next year. I had hoped to really make a strong family connection all together this year and it didnt happen. I know everyone thinks \"oh well, maybe next year we will all enjoy being toghether\"........but for me it' s uncertain. Thank goodness my husband gets it, he totally understands even tho it is his family. And it hurts that after 3 days I spent less than 5 minutes all together with a couple of people. The saving grace is how much I enjoyed all my neices and nepews, and my children too. And truthfully most everyone else. I shouldnt let a couple of people ruin the experience for me, but when you are tired, and emotional and your health is up in the air, it can be hard to keep it together. I wish more people could recognize that. Of course we try to look good and put on a good front, that doesnt mean underneath we arent struggling and sometimes a kind word and a hug can really go a long way. A few minutes of genuine conversation helps too.much better than feeling like you are so far off someones radar they dont really acknowledge you. ARGH! Here I go again.......I need the grace to let this go, it is over and done with :)",
      "MessageIndex": 24,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809079",
      "Title": "Fatigue or laziness? starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Nov 2, 2013 02:47AM starbrightlyshines wrote: Yes, you have been through so much it just isnt't fair. Just try to give yourself a break, you are in a vulnerable and senstitive state and sometimes I find when I label my feeeling as such, it helps me mentally. I understand how hard it's on our families, we turn to them for supoort and Im sure it must be overwhelming for them. I know my husband is the first person I turn to and its probably not fair to expect him to handle everything, but I kind of do. I dont have any friends that I can talk to about this, and my mom has her own problems so that leaves DH. There is a support group for stage IV patients at my cancer center and I have started attending. It is too early to really make a connection with anyone yet, but I am hopeful it will happen. So I come here, and find I'm not alone. It helps :) I'm sorry you are going through this, I'm sorry any of us are. I hope tomorrow is a better day.",
      "MessageIndex": 13,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813875",
      "Title": "Feeling so defeated by all the bad stuff going on cmhartley vickib"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 10, 2013 02:00PM starbrightlyshines wrote: Shannon, I am the same way. At home I dont want to do much at all. I cant even muster up the motivation for a hobby anymore. Even reading, I used to be a voracious reader and I haven't read a book for fun in months. I am attempting to read a little about meditation hoping it will help with anxiety but I haven't made much progress. But thankfully when I do get out of the house I feel good, I just feel some guilt about not keeping up the house and making meals like I used to. Tarhee, I am a slooooow mover in the morning. I would be happy if nothing started before 10 AM! I am abit worried how we are going to manage once school starts here! And I worry about what peopke will remember, especially my children. Its really hard to think about.",
      "MessageIndex": 8,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809079",
      "Title": "Fatigue or laziness? starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 22, 2015 11:55AM starbrightlyshines wrote: Dear Lord, you know what is in my heart and what I need. You know the hurts and upsets and unknowns which my family faces. Please be with us and guide us, help us to remember to seek you in the midst of the storm and remember \"that we walk by faith, not by sight\". We pray for rain for our sate, and safety for our firefighters. we Pray for peace for the loved ones of those that have lost their lives fighting these fires. Help me to seek you first and not speak out in anger or emotion. Please keep the bonds of my family together. And I pray for all of us here, for all our individual needs. In Jesus name, Amen",
      "MessageIndex": 308,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 16, 2015 10:34AM starbrightlyshines wrote: Dear Lord, please give my peace of mind in the treatments that I have chosen. Help my family grow in love for you and for each other. Grant us peace in the midst of the chaos of daily life and help me give the strength to carry out the tasks you have appointed me and blessed me with. Thank you for the beauty of summer and the love which surrounds us. Please help all of us here as we struggle with our daily needs. In Jesus name, Amen.",
      "MessageIndex": 171,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 2, 2015 05:23PM starbrightlyshines wrote: Welcome Spiritblessing, I am waving from the other side of the state. Have you found any live support groups in the Seattle area? Adding my New Year wishes to all of you for a wonderful, pain free and year full of treatments that will keep us healthy. ",
      "MessageIndex": 10,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827305",
      "Title": "Happy New Year Mompsych skylotus"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 6, 2015 11:38AM starbrightlyshines wrote: So I have been thinking a lot since my appt. yesterday. My MO didn't think Falsodex or Arimedex would be good option if I wanted to change meds because in his opinion if we think Femara has failed, those 2 are too similar Femara and the cancer has probably already figured out how to work around it. But going to A/A combo scares me because of the SE and because I feel like I am using up my options too quickly. I don't want to cancer to spread to any other organs, but I also don't want to give up Femara too soon. My MO feels like since the spot has been there for 7 months and is slightly increased with this last PET that radiation is an acceptable treatment. We meet with a RO next week so hopefully that will clear up the questions about radiation. As of right now I am leaning towards radiation, and holding off on switching from Femara to A/A. I have a daughter graduating from High school in June and we jhad planned a big party here for her and my nephew. My children are 20,18,15,12 and 7. I am not sure that the beginning of summer is the best time to change treatment, I think I would rather enjoy the summer unless something changes like a huge jump in tumor markers or more pain somewhere else. I wish it were more clear cut. Yesterday my gut told me to give up on the Femara, today it is telling me something different, lol! Bestbird-you mentioned Faslodex which my MO seemed to think was not a good option for the reason I stated above. Do you have any additional thoughts? Since my cancer was diagnosed when I had mets to the GI tract anything GI related scares me because I was so sick from the mets. This is part of my hesitation with the A/A combo. dbl-good advice to proceed with caution. I am feeling pretty good right now, the pain is manageable but the fact that I have pain is worrisome. And I have some pain in my ribs and lower abdomen, all areas where I had previous mets. So whether the pain is just healing/old or new cancer is impossible to tell. Nothing other than the one area on my spine lit up. BUT just to confuse the issue, last fall I had several areas in the spine that barely lit up (suv of 1) on that scan. That was 7 months ago. Now only the one area appears active, so my MO had no answer for that. I have been on Femara for almost 2 years. I think it just shows how much I is really unknown and how even PET scans can be difficult to interpret. Patty-Thanks telling me radiation worked for you. It's always good to hear someone else's experience. And I totally agree about not wanting to blow through all options too quickly. So I am just as confused as ever! I am learning so much and enjoying knowing I am not alone. Thank you to all of you.    ",
      "MessageIndex": 13,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Nov 24, 2013 12:54PM starbrightlyshines wrote: I did once a month infusions for the first year and now I am going in e ery three months. My Dr said some some Drs think there is a cancer fighting benefit, whether or not this has been proven I dont know.",
      "MessageIndex": 10,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/814948",
      "Title": "Zometa Frequency Questions DivineMrsM sandybiest"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 5, 2015 09:29AM starbrightlyshines wrote: Thank you to all of you for the advice. My gut feeling is turning more toward changing treatment, even if it means taking some time to figure out the best next step. I think I tend to downplay pain and those weird feelings we get, but I have had in increase in rib pain and some pain/discomfort in my lower abdominal area. Based on the scan and tumor markers I think it is slow growing, maybe not even apparent on the scan. I will find out more today. But I am the one who brought up radiation to my onc before the scan. He tends to be open minded to my suggestions, so often I feel like need to \"direct\" the conversation because really, no one really knows how we are going to respond to a treatment and there are so many \"theories\" out there it makes it hard when we are told we need to decide. I wish it were more of a \"do X and then move onto Y etc\". But my back is bothering me today, I think it is a sign I need to move onto the next step even if my onc isn't too concerned.  My DH asked for the apt today, my onc was happy to wait until my next apt in 3 weeks which makes me think he must not be too concerned. I will find out today.",
      "MessageIndex": 5,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 11, 2015 11:42AM starbrightlyshines wrote: HLB-I just asked in another thread what you were taking, we are in a similar situation. For some reason my onc says my next step is A/A. I brought up Faslodex and he shook his head, he said is was in the same mode of action as Femara so I would need to do the A/A combo since the cancer has already figured out how to get around an aromatase inhibitor on its own. I don't know, I thought you could just switch to another AI until they didn't work anymore....which he says they won't once they have failed. Hmmm....more questions I don't know the answers to.  ",
      "MessageIndex": 16,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 12, 2015 04:48PM starbrightlyshines wrote: I had a 1 1/2 hour meeting with a RO today. At first he kind of said there was no real reason to treat with radiation right away. But after talking and reviewing the PET scan the area effects T9 vertebrae and even though the suv is low (change of 2.6 to 3.8) the area is about 1/3 of the vertebrae. So there is a possible risk of compression fracture on the anterior (inside facing toward organs) side. But he still felt like the risk at this point was not critical so we could monitor it in 2 weeks with a CT (so PET/CT) would be 30 days apart. Or we could treat it with SRT to prevent future growth and hope to reduce pain. He really didn't seem to lean toward one approach or another. I just wonder how many \"smoldering\" cancer sites there could be in my body. At diagnosis I had extensive mets, now there is only this one appearing active. I have unexplained abdominal pain in addition to back pain so there is a chance the cancer is just lurking. So if that's the case I don't know if it would be worth it to radiate now and then find out soon that Femara failed and I have other active spots so I would have to change meds anyway. Do I want to put myself through the whole radiation experience knowing the next med could just wipe out the met in the spine? Truthfully, I dread the radiation.....MRI, body casting, possible side effects. I am so claustrophobic, I know it's dumb and I would get through it if I had to. I just don't know if it's the best thing.",
      "MessageIndex": 21,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 29, 2015 08:30AM starbrightlyshines wrote: Stefanie-you have gotten great advice above.  For me, when I was diagnosed I was so sick from mets to GI tract that I pretty much didn't leave my house fro several months, other than for Dr appts. Friends organized meals, rides for my kids etc. I am not sure what they were told, probably that I had breast cancer and it was bad. Several months later when I felt better I got a lot of strange looks from people, like they were surprised I was doing better. Now I think I look back to normal and I am not sure how many people know, or even what they know. When I do share with people, I just tell them that I have breast cancer and I will always be on some kind of treatment. I don't use Stage IV, that is too scary (even for me) but I have said MBC. It's hard to know who to tell, my family all knows but rarely brings it up. I haven't found a good place (other than here) to talk about it. Sometimes I just need to get it all out.",
      "MessageIndex": 14,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832116",
      "Title": "Telling (or not telling) friends and family ABeautifulSunset steelrose"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Feb 15, 2015 04:14PM starbrightlyshines wrote: Thank you for sharing and hugs to Kelly. I also had mets to the GI tract as well as bone. Sometime cancer doesn't stick the normal course most oncs see. It is so valuable to share our stories here. I also was unable to absorb food and asked about TPN. It was not offered to me, but thankfully I asked and it probably made the difference between life and death. It gave my body time to the treatment start to work and kill the cancer cells. Tamoxiifen and gemzar, the tamox probably was the changing force due to what the tumor markers indicated. We really do have to advocate for ourselves. Drs say one thing, and often something else later. Who knows, it can be an error in what we originally understood, or perhaps the Dr was thinking of something or someone else. It is always important to ask a lot of questions because it is our life on the line!  ",
      "MessageIndex": 2,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828516",
      "Title": "Shaysmom (Kelly) redwolf8812 RonnieKay"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 4, 2015 05:27PM starbrightlyshines wrote: Thank you Sue. It is interesting that you have to change meds every 2 years, that kind of sounds like what might be the case with me. This area is one that we have been following for a while. But I am wondering if maybe I just need to switch meds. As luck would have it, today my back is hurting again. Of course that is after yoga, and a bit of yardwork :) I am just trying really hard not to let it get me down. It's a marathon, not a sprint. Someone told me that a while ago and that helps.  ",
      "MessageIndex": 2,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 11, 2015 03:45PM starbrightlyshines wrote: HLB-I am so glad to hear you are thinking the same thing that I have been. I was under the impression also that there were several other options to try once Femara failed. I was so surprised to heer my onc recommend A/A because I thought that it would be further down the line, not right *now*. I did call a breast cancer specialist I saw once in Seattle after I was diagnosed. She said to call her at the point we were thinking of changing treatment. Well I called and she is booked several months out! And they don't do email consultations. But her nurse coordinator did say if I sent her my latest PET scan and Dr's notes she could weigh in on whether or not it would be advisable to stay on the Femara. I was disappointed, I was hoping to get  2nd opinion or at least some info on another AI as a possibility. I mean I'm glad that I don't have to make a decision right away, but if I did I would be really upset that I would have to wait a few months to get in as an existing patient. Maybe that's to be expected, but I had hoped for a shorter time span than that. Since my onc treats all kind of cancer, I think he is probably keeping up with what's new and maybe that is why A/A is his response.",
      "MessageIndex": 20,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 13, 2015 09:25AM starbrightlyshines wrote: Sandilee-I think I misinterpreted my onc, he never said Faslodex was an AI, I inferred that when he discounted Arimedex as a treatment option. I do agree that a 2nd opinion from a breast specialist is a good idea. I have one in Seattle (5hours away) that I could see in late July. Her nurse is going to gather my PET, lab results and Dr's chart notes to run by her to see what she thinks. I am crossing my fingers that she will be thorough and really look into it, since I am not there to ask her questions in person it makes me a bit nervous. But she is a leader in breast cancer research (which is why it is hard to get into her office, she travels a lot) so I am hopeful. Heidihill- The RO I met with has a long history with radiation, he specialized in SRT which is a one shot treatment of radiation rather than the several doses over a long period of time. He moved here to our cancer center to start up the SRT program. He has no problem with me seeking another opinion. He spent over 1 1/2 hours just on a consultation with us. That is why he does the MRI and casting, to be sure he is getting the direct spot. The other kinds of radiation will radiate over more space in the body so placement isn't quite as critical (again, this is my interpretation of what he said, I may be misquoting). He could do both but feels the SRT is a better option for me. Thank you both for responding. It just makes me feel so much better to talk it out with people who understand.  My DH really just want me to do the radiation therapy. He is a chiropractor and sees people living with compression fractures all the time and he doesn't want that to happen me. While repsects whatever I decide I do feel like his experience weighs in on my decision. And claustrophobia shouldn't rationally be a deciding factor......ha ha because that is where my mind automatically goes! And the pain.....that alone tells me something needs to be done.  ",
      "MessageIndex": 24,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 14, 2015 02:02PM starbrightlyshines wrote: The breast cancer specialist reviewed my charts and through her nurse responded that a \"medication change would be reasonable as my Onc here suggested\". Which means A/A. She didn't have anything to say about radiation. Maybe if I made an apt and went to see her I could get more info but that would be at least July before I could get in. I am not really sure that helped much. Meanwhile my DH really wants me to get the radiation done. I don't feel good about any of it.",
      "MessageIndex": 25,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 5, 2015 03:14PM starbrightlyshines wrote: Ok so I have a few options 1. Radiation to the area, stay on Femara and moniter tumor makers and repeat PET in a few months since this is the only area showing activity. 2. Radiation to the area, switch to A/A combo since it could be a sign that Femara is failing, or soon will. 3. Switch to A/A and not do radiation. That way we can moniter the area on the spine to be sure the A/A is working. Dr says the spot on my spine is \"miniscule\" and some may say not worth treating. But I do have pain so that factors in the decision. Any thoughts? I think Onc leans toward #2 but I have another specialist in Seattle so I am going to try to consult with her before I go in for my radiation  consultation next week.  ",
      "MessageIndex": 9,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831024",
      "Title": "Slight progression-add rads only? Please help starbrightlyshines Romansma"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Feb 16, 2015 01:44PM starbrightlyshines wrote: TPN is total parential (?) nutrition. something like that :) Basically you have a PICC line put in your arm and then you get IV nutrition daily through it. It give you all your protein, fat, vitamins etc. that you need. Since it goes directly into the bloodstream it bygass your GI system which can give you time for chemo to work. I was on it for about 5 months and it probably saved my life. My GI tract is working much better now, my tumor markers are gone and my PET scans show improvement.",
      "MessageIndex": 5,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828516",
      "Title": "Shaysmom (Kelly) redwolf8812 RonnieKay"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 20, 2015 01:47PM starbrightlyshines wrote: Way too much crap!!! Sending you hugs and good thoughts that it will all turn out to be something simple and not bad. Lovely photo, thanks for sharing!!! ",
      "MessageIndex": 29,
      "PostDate": "20/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833509",
      "Title": "More crap.. Yay?! stagefree fujiimama"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 3, 2015 02:44PM starbrightlyshines wrote: Pregnancies at 29,31,33,36 and 42 years. I breastfed all of them anywhere from 1 1/2 years to almost 3 years. I should have had a lot of protection from bc according to the breastfeeding benefits I read about, lol! I was told I had dense breasts. I had a benign lump removed probably about 8 years ago. It makes me wonder if they missed something. The surgeon told me my breast were a mass of fatty ? tissue, and that I had fibrocystic disease. All my mamos were negative. I wish I would have pushed for a breast MRI but at the time I was told I was not a candidate, despite the fact I was told I had dense breasts and it was hard to read a mamo. Also was told I had several spots of calcium deposits in my breast, they said they didn't indicate anything abnormal though. I wish I had asked more questions and pushed for further tests. But at the time I was just relieved so I dropped it. I try not to think about it, but anything I make sure I tell people my story when I hear people tell me they have dense breast or fibrocystic disease.",
      "MessageIndex": 25,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830713",
      "Title": "BC, PREGNANCY AGE, and BREASTFEEDING Resarch POLL Teakie88 ShazzaKelly"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 29, 2013 06:23PM starbrightlyshines wrote: I don't know what number I am but I finally got the courage to join all of you. I have been a lurker, too afraid that it might somehow make it more \"real\" if I signed up. Just who I thought I was kiddding I don't know because it doesnt get more real than this......and I am scared. I was diagnosed stage IV from the start in October 2012. They have never found a primary tumor but I have mets to thr GI tract and bone. My GI tract is doing much better and I am trying very hard to remain positive. I have 5 children at home and my heart aches daily for them. I hope it gets easier, right now I find it very difficult to cope with the uncertainty of living with this.",
      "MessageIndex": 396,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 2, 2014 09:45PM starbrightlyshines wrote: Thank you Dita for telling me shin mets are unusual. I totally have myself in a high anxiety mode. My dog is sick, my oldest daughter is leaving this weekend to go back to school,......life stuff etc. I am so emotional. Everything just seems to hurt more right now, even places that didnt hurt before. And I am taking my pain meds so I dont know what us up. My markers were good at my last visit, and I had a good PET in July. I just need to get a hold of this anxiety.",
      "MessageIndex": 3,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816427",
      "Title": "How can you tell if pain is caused by your AI starbrightlyshines raro"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 10, 2013 02:04PM starbrightlyshines wrote: Well for starters I would love to know how I could have normal mammograms and a year and a half later be diagnosed stage IV. A primary tumor was never detected, just mets to bone and gi tract.",
      "MessageIndex": 1,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809101",
      "Title": "Dr. Susan Love incorporating Metastatic patients in HOW Study vacationbound gonegirl"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 9, 2015 09:19AM starbrightlyshines wrote: http://www.precisionnutrition.com/rr-green-tea-hazards Kat-I have also seen this. There is so much conflicting information on things. It makes me wonder though because I have life long allergies and cancer, and I am taking cucurmin and green tea supplements. I just started drinking matcha, before then it was just an edible type of green tea. So who knows, I maybe doing more harm than good. ",
      "MessageIndex": 12,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833249",
      "Title": "TURKEY TAIL MUSHROOM Extract TOPIC (Use This Topic for Posting) Teakie88 leggo"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 9, 2015 03:25PM starbrightlyshines wrote: Kat-I will be curious to see if there is a test for Th1 and Th2 because if there is one it is something that I would like to have done as well.",
      "MessageIndex": 19,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833249",
      "Title": "TURKEY TAIL MUSHROOM Extract TOPIC (Use This Topic for Posting) Teakie88 leggo"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 16, 2015 03:25PM starbrightlyshines wrote: Ok, first post............can anyone tell me if I can directly download or send photos from my cell phone to post here? (Kind of like I can with facebook). I have a iPhone but I hate downloading to the computer and then trying to find the darn thing. I usually get lost at this point and just give up!",
      "MessageIndex": 1,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 5, 2013 03:38PM starbrightlyshines wrote: I am so sorry, I have times when I can't stop crying too. The social worker at the cancer center labeled it well when she said I was grieving. And that is so accurate. Talking about it helps, and medication can be helpful. You have been through a lot in the past year, and Im sure you had hoped to be done with treatment and now this isnt what you wanted to hear. The good news is that many women live many years through treatment so we do have hope. I know a woman who has had it for 19 years. So I look to her and other similar stories when I get really down. Sending you hugs. ",
      "MessageIndex": 1,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815405",
      "Title": "I'm crying all the time Roxie43 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 5, 2013 04:12PM starbrightlyshines wrote: It is such a rollercoaster of emotions. I can be fine one minute and dissolve into tears the next minute. You arent alone and its nice to have people who understand here. ",
      "MessageIndex": 3,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815405",
      "Title": "I'm crying all the time Roxie43 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 16, 2015 03:59PM starbrightlyshines wrote: Wow! That certainly counts as an adventure to me! I imagine it will be wonderful to travel with someone who knows the language and how to get around. And it will make it even more special since you will be visiting family there. Hopefully you can take something to help you \"sleep\" away the effects of chemo on the plane. Have a wonderful time!",
      "MessageIndex": 3,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 17, 2015 02:14PM starbrightlyshines wrote: So sorry to be such a tech illiterate person (or what ever you would call it) but I cannot figure out how to get the photo from my phone to insert into here. I found the icon that says insert image but what do I do then? I can browse files on my computer but that doesn't help. I tired to airdrop but that didn't work either. I see all of you are doing it so there must be some step I am missing. Do I have to connect my phone to the computer? Carla-Enjoy the trip! It sounds wonderful. Caryn-I always love to see photos of people's dogs! Intothewoods-We will be going right by Mt Hood at the end of July. I have never hiked around there but my husband has and loves it. Julie-What an amazing place! I love anything tropical, I lived in Hawaii for 2 years and try to go back as much as possible. Which isn't often but we did take all the kids this last spring break and spent two weeks on Maui. Heaven!!! I think the sea air and sun are the best therapy, oh and the beach and water too. I would love to go to the Carribean Islands but it would be a long trip from Washington state. Thanks for sharing your photos. Shutterbug-I would also love to see Michigan. We had a dog that came from Traverse City :) He was a Portugese Water Dog and he hated the water! I still keep in contact with the breeder but sadly he passed away last year. Hope-My husband fished in Alaska in the summers to help pay for college. We have always talked about going someday. He keeps trying to get a reunion of his fishing buddies to do fishing trip.....I think that is more of a \"guys\" weekend trip though! A cruise is more my idea! Charlotte-I am in envy of all the places you have available to see there. I would love to see a museum that is something other than the Oregon Trail, or Native American. They are great, don't get me wrong but that is all that we have available here. We live miles from the Whitman Mission and that is always a 5th grade field trip I love to go on with the kids. Ok, well I was going to post some photos from a week on the lake but I have no idea what is wrong. Keep posting ladies!",
      "MessageIndex": 17,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833462",
      "Title": "Travel! Please post your plans, photos and details here. starbrightlyshines Karz72"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 19, 2015 02:13PM starbrightlyshines wrote: Hi mtmom, I'm so sorry you are going through all this. I was diagnosed Stage IV from the start. They have never found a primary tumor, but I was experiencing severe stomach pain. I ended up diagnosed breast cancer (always had normal mammograms so what the heck) with mets to bones and GI tract. I was very, very sick. But 2 1/2 years later I am much better. Yes, this is a bumpy road and there will be smooth times and rocky times. But thankfully we live in an age where there are many treatment options. I have been pretty stable on Femara now but I will have another PET scan in Feb to see how it is working. Good luck and hugs!  ",
      "MessageIndex": 1,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827699",
      "Title": "Feels like it is all happening sooo fast! Know what I mean? mtmom Bestbird"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Feb 8, 2015 04:03PM starbrightlyshines wrote: Annie-sending you hugs and prayers for peaceful pain free days ahead. I know of a woman who was in hospice for over a year, she thought the support they gave her family was so helpful. I hope this will be your experience as well. I also have a 12 year old, so I know how painful the emotional aspects are. I was diagnosed over 2 years ago so I just think how grateful I am that I have been able to make so many memories over that time. I hope you can focus on that and have some happy moments reliving them. ((((((((hugs)))))))))))",
      "MessageIndex": 60,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828155",
      "Title": "Hospice for me Annie62 RonnieKay"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 25, 2013 08:54PM starbrightlyshines wrote: One thing that helped me was when I read on this forum that someones dr told then \" you will die with cancer but that doesnt mean you are going to die FROM cancer\". I also go back to my dr telling me it is \"highly treatable\" and that there are many options for treatment available. It is shocking, and sometimes I get so taken aback that this is my life that I literally feel like someone ounched me in the stomach. But we find ways to get through somehow.....support here, doing things at home that make me happy, gettting out as much as possible, reading. I am reading The Last Best Cure (my quest to awaken the healing parts of my brain and get back my body, my joy, and my life) right now. It is about a woman with an autoimmnue disease and her hunt to find some relief in meditiation, yoga etc. She talks about adverse childhood experiences and how they can weaken the body, I am not quite sure I agree with this part but it is food for thought and only a small part of the book from what I can see. I actually got inspired and took my first gentle yoga class yesterday!",
      "MessageIndex": 13,
      "PostDate": "25/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806589",
      "Title": "Need help! Diagnosed mets in 5 organs at one time?? Roberta2 Andirod"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 8, 2014 05:42PM starbrightlyshines wrote: I am sorry you are having a rough time. It is so hard each time a treatment fails. I feel like we just get used to a new \"normal\" and then the world shifts on us and we have to try something  new again, and find new side effects to deal with. I haven't tried an antidepressant yet, so far I get along well with Ativan which I use on most days. I just haven't wanted to add a new med into the mix, but I wouldn't hesitate if the Ativan didn't work or I thought it could help. Our families do need us, and as Ebru mentioned the housework and cleaning really aren't important. It's just us, being present to them. Listening to them about their day. Smiling at a new discovery or joke they are trying to make you cheer up. Just being in the room, even if you are napping. As long as we are here, it is a gift to them. I have to remind myself of this, and some days it is the thing that gets me out of bed. I hope you are having a better week.",
      "MessageIndex": 22,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822385",
      "Title": "Feeling sad Tina72 starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 30, 2015 03:18PM starbrightlyshines wrote: I think it is not unusual for something to not work at first and to try different options. Our bodies are all different, and we are lucky that we are living at a time when there is a lot of medical options available. It is so hard to wait though, and we all understand it because we all go through it too. Sending you hugs and wished for peace.",
      "MessageIndex": 9,
      "PostDate": "30/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832161",
      "Title": "Looking for some encouragement..chemo not working Sugarbaby5 starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 6, 2015 02:30PM starbrightlyshines wrote: Chemo didn't really work for me either, but I was also put on Tamoxifen and it kicked in at about 8 weeks and that worked for me for about 7 months. Then I had about 2 years on Femara which really helped until recently when I had progression on an area on my spine. Has your Dr talked about changing to one of the Aromatase Inhibitors? I always thought chemo was the best or most effective thing, but with ER+ cancer I think attacking it from that angle might be most effective. As for the emotional part, I thought I was \"the worst nightmare\" scenario also. I went from being an active, healthy mom of 5 one week to a stage IV with extensive mets the next week. I lost 25 lbs and my GI tract wouldn't digest food due to GI mets. But I am so much better now, 2 1/2 years later that most people who don't know me have no idea I have cancer. So it is possible to find a treatment  that works even when one fails.  Hugs to you, this is such a difficult thing to deal with but please keep in mind there are many of us here going through the same thing.    ",
      "MessageIndex": 13,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832161",
      "Title": "Looking for some encouragement..chemo not working Sugarbaby5 starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Feb 12, 2015 08:16PM starbrightlyshines wrote: Thank you for the update. Two things come to mind, I understand ths panic feeling one gets while being confined to a hospital bed. How about one of those medical recliner chairs that will lift and lower? I would imagine she woukd be abke to sleep in it, and insurance may help with the cost. And I love Bon's idea about the tiny white lights, I think they make a room so much cozier, and it is so nice to have them one especially this time of year when it gets dark so early. I always get anxious this time of year, even befire cancer. And having the tv on with Hgtv or something simmilar would really help me as well. Sometimes the quiet is unbearable when you are anxious. I would really talk to hospice about her anxiety.....I have given my husband good instruction to not let me get overtaken by anxiety.  Ativan is fine, but there are other options available such as Xanax and klonopin. You mentioned notb wanting to overuse them, but I would ask you to not under use them as well. Hospice should be able to help with the correct dosage and timing so your mom doesnt have to suffer with anxiety. That is what I would want for myself. ((((((Hugs)))))))))) to you and your family.",
      "MessageIndex": 55,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828336",
      "Title": "Update on Raro raro"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 21, 2014 05:44PM starbrightlyshines wrote: I think the holidays will always be different for us. Like a couple of you noted, I find myself wanting to make my family really appreciate that this might be the last holiday that we are all together......they just dont feel the passage of time like I do, and I want life to be normal for them.......but I also want them to really appreciate it too.  I have been fighting a stomach flu thing this last weekend. My college girl was home, and my 6 and 11 yo still wanted to dye eggs. I was just so frustrated to not be feeling well. Now when we have all our kids together I always feel extra pressure to make it special. And since I had mets to my GI tract, I always feel kind of panicky when my stomach hurts.  So today I am tired and feeling out of sorts. Dh and I arent seejng eye to eye on some things and I cant handle any extra stress. Hugs to all mamas :)",
      "MessageIndex": 64,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 4, 2014 07:39PM starbrightlyshines wrote: kjones-I don't think you are being selfish, I think it is more of a self survival mode. You have your own family to deal with and they are your priority. I know it gets hard when our extended family comes into the picture, we love them and want to be there for them. But you are right when you say your grandparents have lived their lives. Yes we need to make sure they are loved and cared for, but beyond that there is only so much you as one person can do. And your immediate family is your focus. 6 people with medical problems in one family is a lot! I often find myself getting frustrated with people because I am overwhelmed with my own situation, and while I want to be compassionate I am having a hard time just dealing with my own reality! Take it easy on yourself, it is so easy to get spread too thin. And while summer is fun, it can be exhausting too.",
      "MessageIndex": 221,
      "PostDate": "04/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 5, 2014 08:31PM starbrightlyshines wrote: Stella-yes, it is so unfair to our children and all those who have lost parents. It is heartbreaking and I don't have anything to say other than I feel the same way. All I can do is try to live each day in the moment as much as possible and not look too far ahead. But I do think having a support network of family helps, I try as often as possible to remind my children how many people they have in their lives who love them. It's all just so sad, and I don't have anything to help any of us feel better.",
      "MessageIndex": 264,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 29, 2015 08:15PM starbrightlyshines wrote: Well I have the \"worst\" mom of the year award. I forgot to pick my my dd 12 at bb practice tonight. To be fair to me, I had assigned this responsibility to my oldest dd. Well oldest dd has been late twice, which made dd 12 mad. And oldest daughter just got a job so I didn't even think about her not being able to pick up dd 12 anymore. Sigh, and it is only the 2nd week of bb! So lots of tears, stomping feet and yes, she has a reason to be mad but not disrespectful. Unfortunately she is one who does not get over things quickly, and can hold a \"mad\" for a long time. (Gee, I wonder where she gets that) lol!",
      "MessageIndex": 379,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 3, 2015 06:06PM starbrightlyshines wrote: Hi there mamas. I just made a new post about children heading off to college so if any of you have some advice or sympathy or whoops of cheer (lol not me) to add I would love to hear it! We are deep in the middle of the school crud. Everyone has been sick except dh, which is a blessing because otherwise I don't think we would have survived. My ds 15yo has been on three rounds of antibiotics and is finally well. Being a teenage boy, not much slowed him down. On the other hand, dd 12yo doesn't really like school and has missed 2 weeks due to a viral cough/cold (probably the same) and just went back to school yesterday. Last night she started vomiting and is now home sick again. My ds 7 yo is still home sick with the cough/cold. Thank goodness it is a small school, and we are up to date on homework. The school said many kids are sick, I am not really worried about the school part, I just feel like we are never going to get well. I finally made an apt with my dentist last week for a tooth that has been bothering me off and on for a long time. It was never really bad so as you all know, it's easy to put off something like that when we all have monthly onc visits, scans etc. Well I ended up needing a root canal, and while I was there they redid an old one that bothered me. This was all last week. I thought I was doing pretty good but it really knocked me on my butt for the next few days. My emotions are so up and down. I haven't been able to go to yoga since the kids have been sick, so my back has really been bothering me. Of course there is an area in my back that my onc is watching for whenever my back hurts my mind goes into worry mode. It is a subconscious thing, sometimes I don't even realize it until I notice how anxious I am. I did get to go for a massage which helped tremendously. And he thought it was a muscle thing not coming from my spine. We can hope. So I am spilling it all to you wonderful ladies, because while I do have friends in real life, I don't have anyone to talk to like this that would really get it. A few weeks ago, I pulled out all my pictures to organize since my dd 18yo is graduating this year. And then I got sick. So there is a huge mess in our downstairs family room that confronts me each time I walk into it. I am tempted to shove it all back into boxes. I literally cannot make myself sit down and do it. I hope you are all well surviving winter. It is sunny here today so I keep reminding myself we will get through this and hopefully have better days ahead.",
      "MessageIndex": 383,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 8, 2015 12:03PM starbrightlyshines wrote: Just popping in to say Happy Mother's Day weekend to all of you! What do you have planned? It is a beautiful spring day here. I was supposed to have my parents, bother and his family, sister and her family all come for the weekend.  It is kind of a tradition for them all to come here. But one by one things have come up (prom, school functions, the flu) and now I am not sure if any of them are coming. It is sad, but in a way maybe it is better. I still battle with my energy levels everyday, especially if I take any pain pills because they suck any and all motivation out of me. I am just into peace and quiet lately :) but I don't want to isolate myself so I try to fake feeling good and just hope it all works out. And it usually does. What is the saying \"fake it till you make it\". That seems to fit me right now. I am still undecided about what to do with med change and radiation. I think my pain has increased, but that might just be me acknowledging it instead of trying to pretend there was nothing there. The mind is a powerful force! (so is denial, lol!) I hope you all have fun plans in the making!    ",
      "MessageIndex": 471,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 16, 2015 12:58PM starbrightlyshines wrote: I agree with you all, talking about it from the beginning and just field the questions as they come. I think when my son was 5 he asked about dying, and I just told him we were all going to die someday and so we talked about it more from a point of life fro everyone than from my illness. I have found with time that each child kind of deals with it in their own way and it is important to be open and receptive when they ask a question or voice a concern, or even just when I notice a change in behavior. I automatically think that the cancer is at the center of whatever it is, but often when I ask questions and talk to them I find out it is completely something different....a problem in school, mad about something etc. And that is such a relief!",
      "MessageIndex": 521,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 22, 2015 01:48PM starbrightlyshines wrote: Hi mamas, We started school here yesterday. I have a son in 2nd grade, a daughter in 7th grade, a Son who is a Sophomore, and 2 college age daughters who have not gone to school yet (that will be next week, sob). The day started out so great until I read on FB that my daughter in 7th grade's best friend was going to a different school. This is a small class of girls, she was my daughters one and only girl friend. We have gotten together over the summer and she was just at her friends house two days ago. The mom and I are friends. So my daughter is devastated and I am so hurt that they couldn't even send out a \"heads up text\" beforehand because it is pretty crappy to show up on the first day of school and find out your bf isn't there. I sent the mom and text and asked her to call me. They did this 2 years ago. I had just been diagnosed with bc and was so sick and my dd was struggling at school. One day she went to school and her bf (same girl) wasn't there. No warning or explanation given. Later I told the mom how hurt we were, she said she didn't want to bother us because she knew how sick I was. I thought we had a good talk and she understood why we were hurt. The next year the bf came back to school and things picked up with the girls where they left off and all was well. Until yesterday. I think I am as hurt as my dd, I thought the mom and I were friends and for her to not realize a decision like this would really effect my family floors me. I asked her to call me and that I had no idea they were considering this and she just sent a quick text back saying she would call later. She didn't call. And I had even seen the mom and her younger daughter at school and she didn't say anything about the 7th grader not coming back. It was just a big reality check. Obviously we are not on their radar enough for them to even think how this would effect us and at least let us know!. Our daughters were together many times this summer. Us moms have relied on each other for sleep overs on weekends when one of us was busy with older childrens activities. I am just so hurt and upset. I don't know how people can be so inconsiderate? To see it on fb and not even have a text or call to let us know? Truthfully this is just #4 of a series of events that is pushing all my emotional buttons right now. There are wildfires all over the state, our cabin and my brother's cabin are both being threatned. My father needs either 24 hour home care or a nursing home, I took him to the hospital and he is not doing well. My dd is leaving for college next week and our home is going to have an empty hole where her joyful spirit lifts us up. She has been a huge help with the younger kids and grocery shopping etc. It is going to be hard. And my tumor markers are continuing to rise on A/A combo and I have a full body rash. Hopefully it is too soon to tell if the A/A is working, it is just worrisome. So to find out I don't have the support of a friend that I thought I had, it just put me over the edge yesterday. Today I am moving on :) Have a great weekend ladies. And if you live Washington state my prayers are for safety for us all. And for anyone else who is so inclined, please pray for RAIN for our poor state :( And I apologize for being so self absorbed that I have not commented to anyone directly.",
      "MessageIndex": 538,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 12, 2015 08:53PM starbrightlyshines wrote: Me too. I thought I was healthy, but I had stomach problems. I thought it was IBS until it got so bad one weekend I went to the ER for stomach cramps, was admitted and came out a few days later with a stage IV breast cancer diagnosis! They did a bone marrow biopsy and found breast cancer cells, that is how they knew it was breast cancer. They never did find a primary tumor. I had mets to my GI tract, spine, ribs, bones. I did feel worse for several months but gradually the chemo and tamoxifen reduced the cancer and I began to feel somewhat better. DId you have a biopsy done?",
      "MessageIndex": 3,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831395",
      "Title": "Totally Confused! Allyme LindaE54"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 14, 2015 02:17PM starbrightlyshines wrote: I am about ready to ask for something else also. I take Xanax at night, but I think my body is getting too used to it. It used to work quickly, now I can lay there for an hour or two before I fall asleep. Once I am asleep I sleep well, but I hate lying there wide awake. And I don't get how I can be so tired but then once I am in bed I am wide awake! ",
      "MessageIndex": 2,
      "PostDate": "14/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833374",
      "Title": "To Ambien or not? Ohmydarlin intothewoods"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 12, 2015 07:26PM starbrightlyshines wrote: Sandilee-I am glad to hear your 3 1/2 years on Faslodex! Wow Bestbird, thank you for the condensed and easy to understand sequencing you outlined :) To be fair, I don't think my onc put Faslodex in the category of an AI. I think that was my misunderstanding due to the way he dismissed it when I brought it up. I will have to ask him why he dismissed it, my impression was that the A/A combo was the next best thing in line. Here is my progression....diagnosed Stage IV, 2 round of chemo plus Tamoxifen (so I think this would be considered first line), Tamox failed after 1 year so on to Femara (second line) which now may be failing after 2 years. Last PET indicated an area of low uptake (grew from 2.6 to 3.8 SUV) in my spine. It looks like it covers about 1/3 of T9 vertebrae. I met with the RO today. At first he kind of scratched his head and said no immediate reason to treat unless there was significant pain. But after the end of a 1 1/2 hour visit he did say that I could be at risk of a compression fracture so he would have no problem treating it with SRT if I decided to do it. Or we could just monitor it and see if increases by doing a CT scan in about 2 weeks (30 day span from PET/CT). My dilemma is (and please chime in with any opinions) 1. Do I take this as an indication that Femara is failing and switch to another med, and not radiate? 2. Do I just radiate this one area and monitor markers and scan and stay on the Femara, hoping that this one spot is all that is active? 3. Do I change meds and also radiate hoping to reduce the chance of fracture, and decrease pain? It seems like both my onc and RO and not favoring one clear path over the other. Keep in mind I had many mets at diagnosis in the bone, ribs, spine, GI tract. So the chance that there are other \"smoldering\" areas out there that just aren't lighting up on the PET scan yet. And I do have unexplained abdominal pain in addition to the back pain. My 2nd opinion specialist can't see me until July, but her nurse said she could run my chart by her. She specializes in breast cancer, whereas my onc (and all those here) are all general oncs that treat all kinds of cancer. I just feel frozen because I don't want to make the next move until I am sure it's the right one, and nothing is really standing out as the best alternative. Help!",
      "MessageIndex": 13,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831311",
      "Title": "AI-If one fails does it mean others won't work on their own starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 27, 2014 05:05PM starbrightlyshines wrote: Thank you for sharing, it is so hard to know what to do. I have sensitivity to gluten, and dairy. My favorite protein bar has peanuts as its main ingredient, along with dates and sea salt. I eat one daily but I would rather be on the safe side and now I'll look for another kind at least alternate with.",
      "MessageIndex": 35,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827123",
      "Title": "Peanuts linked to cancer spread? Shutterbug73 Beachbum1023"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 11, 2013 08:40PM starbrightlyshines wrote: Moondancer, how many avacados do you eat a day? I love tomato based dishes, but I have read to avoid canned tomatoes beacuase of the plastic lining in the can, the acid of the tomatoes causes chemicals to leach into the tomatoes apparently.",
      "MessageIndex": 11,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805909",
      "Title": "Anyone out there with stage four treatment with femora only Donna7 curveball"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 17, 2014 08:49AM starbrightlyshines wrote: Sending you prayers for healing and peace Chris. Tilda had a really good point. I used to work in a microbiology lab and it is totally reasonable for you to ask to have a culture done from your wound so that they know exactly what it is the best thing to treat it with. I hope your day is better today.",
      "MessageIndex": 49,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824461",
      "Title": "another mri so scared chris1959 208sandy"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 13, 2015 12:32PM starbrightlyshines wrote: JFL- I think you are probably right on, I think perhaps he is looking at the standard of care. He is always so willing to talk about every option, but in the end leaves it up to me. I ususally have to say \"well what would you think is the best option\" and that how our last conversation ended. I also know he is aware that we consult with a Dr in Seattle who specializes in breast cancer research so he has said in the past that \"X\" ( and I I don't remember what because it was a long time ago) would be something that would leave my specialist thinking our local cancer center was really in the backwoods if he were to do it, so I think that is always in the back of his mind. But different Drs think differently, just as patients respond differently. I am finding out that treatment options can be widely variable.",
      "MessageIndex": 19,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831311",
      "Title": "AI-If one fails does it mean others won't work on their own starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 17, 2015 01:44AM starbrightlyshines wrote: I felt this way on Femara. Lyrica has worked wonders for me, maybe it would also work for Faslodex.",
      "MessageIndex": 18,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780878",
      "Title": "Faslodex, Fatigue & Feeling Like Crap lukejessesmom susan_02143"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 13, 2014 08:16AM - edited Jan 13, 2014 08:17AM by starbrightlyshines In the fall of 2013 I went to the ER with severe stomach cramping that turned out to be metaststic BC. After CT scans, MRI and PER scans no primary tumor was ever detected. The mets had spread to my bones and GI  tract. The cancer was diagnosed by a bone marrow biopsy. Since it was er+ I was out on tamoxifen, and I did 2 rounds of chemo. I found out later that perhaps the chemo may gave been unnecessary,  that giving the tamoxifen time to work might have been sufficient.  But I was so sick from the GI mets that I lost 25 lbs and did IV nutrition because I couldnt digest food. I am 48 and have had 5 children at home so I wanted to do anything and everything available to me. The good news is that I am much better, my last scan in July showed marked improvement, and although tamoxifen failed after 7 months I am doing well on the next AI, Letrozole (Femara). Although a Stage IV cancer diagnosis is a huge shock, having only one tumor in a limited area, I think you are in a really good place. There are a lot of treatment options available to you and I know one friend who has had this for 19 (good) years. If it can happen to her, it can happen for us also. Hugs, I know thisis a really hard time now but it can and will get better.",
      "MessageIndex": 3,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816771",
      "Title": "Just diagnosed with \"occult\" BC from colon tumor critterzmom starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 11, 2013 08:33PM - edited Jun 11, 2013 08:42PM by starbrightlyshines Hi Donna, my situation sounds similar. I was diagnosed stage iv from the start with no primary tumor found. I am er/pr + her -. I had mets to bone (rib pain) and mets to the GI tract. I was put on Tamoxifen and did two cycles of Gemzar. I think they did the chemo because I was soooo sick and the tamox takes weeks to work. My tumor markers rose at first and then gradually came down so we arent sure how much the Gemzar helped if at all. I had an oophrectomy in April and a few weeks ago my tumor markers started to rise so my Dr switched me over to Letrozole last week. So right now I am just on Letrozole and Zometa. I am hoping it works, I had sure hoped to get more than 7 months out of tamoxifen before it failed. A couple of people mentioned chaning their diet. Can anyone share what they have done? I find it so ovefwhelming when I begin to read about different things I wonder where to start!",
      "MessageIndex": 10,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805909",
      "Title": "Anyone out there with stage four treatment with femora only Donna7 curveball"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 3, 2014 12:50AM starbrightlyshines wrote: What a bummer. I am sorry you had to go through this but I agree, cancer is crappy and so unfair. Here's to wishing you a better, wonderful New Year!",
      "MessageIndex": 16,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816396",
      "Title": "Feeling robbed Fluffernutter pearlady"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 17, 2015 08:56PM starbrightlyshines wrote: Sending you good vibes. Anxiety is awful. And once your body is used to something like Xanax it can take some time to wean off of it. Can't you take the antidepressant and still use Xanax while you taper down? When I was on an antidepressant years ago I took Xanax for breakthrough panic attacks. But ask your Dr. first, all meds are different. And Her+ is a good thing, it opens up more opportunities for treatment as I am sure you know. But still, any change in treatment is scary.  ",
      "MessageIndex": 3,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/829616",
      "Title": "Feel like I am really loosing control patti4511 stagefree"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 20, 2015 06:49PM starbrightlyshines wrote: I shy away from statistics and didn't read this thread for awhile, but I feel like many of you that say to live day by day. I read somewhere (not meaning to ) that survival rate was 2 to 5 years. That scared the crap out of me. I have never asked my dr about \"time\" but in one conversation he did say the stats are so outdated, and new treatments come up all the time. Look at Ibrance. So that is how I choose to look at it. I don't want someone guessing because really no one knows.  ",
      "MessageIndex": 33,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830282",
      "Title": "15 -20% 5 year survival rate..huh? LeeLee38 JeninMichigan"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 1, 2017 11:25PM starbrightlyshines wrote: Thank you Ebru!!!",
      "MessageIndex": 55,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794046",
      "Title": "My Cancer Diet stagefree ShetlandPony"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 15, 2015 08:11PM starbrightlyshines wrote: I will be curious to follow this thread. I am in a similar situation. I have progression on my spine, it is the only active area on my last PET scan. My Onc recommended a switch to A/A and possible radiation to the area. My tumor markers have only slightly risen over the last several months, so I hate to give up onrFemara (Letrozole) until we absolutely have to. I asked about Faslodex and he said no, A/A would be better next. My 2nd opinion specialist agreed, but did not mention radiation at all.",
      "MessageIndex": 1,
      "PostDate": "15/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831505",
      "Title": "faslodex v arimidex/aromasin doc changd mind mid appt. intothewoods HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 26, 2014 11:03PM starbrightlyshines wrote: I am so sorry, it is such a shock to find out we have stage IV cancer. I went from being a healthy, active mom of 5 children one week and the next week I was in the hospital with stomach cramps that turned out to be breast cancer which had metastatized to my stomach and bones. No warning, all my mamos had been negative, and they never found a primary tumor. But 18 months later I am still here, riding the wave as my doctor calls it, on my current dose of Letrozole.  My tumor markers are down, and I hope to be here for many more years. I hope Gemzar works for you, and if not be assured there are many other treatments available.  Sending you hugs. ",
      "MessageIndex": 1,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819561",
      "Title": "So I have breast cancer...who knew?! raro bhd1"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 3, 2015 02:30PM starbrightlyshines wrote: I am doing the radiation. I had an MRI last week which showed where the lesion was (T8 or T9 I forget which) and that is localized. Tomorrow I go in for \"casting\" (sounds more like a play than radiation) to make a cast so you don't move during radiation. Then I guess we will schedule the next step. I emailed my Dr to see if we could do a bone marrow biopsy before rads to get some tissue/cells to keep for future testing (maybe immunotherapy?) but unfortunately due to it's location it would be a neurosurgical procedure so it won't work out to do a biopsy/ Oh well, I am just trying to keep one step ahead. On the other hand though, I feel like I can never fully relax, like I need to be pursuing something else. I would imagine this is something that we all have in common,.",
      "MessageIndex": 30,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831505",
      "Title": "faslodex v arimidex/aromasin doc changd mind mid appt. intothewoods HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 22, 2015 02:38PM starbrightlyshines wrote: Oh and if he says \"it's not proven\" I would respond with well then it's not proven that is doesn't work so why not try it.",
      "MessageIndex": 21,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831826",
      "Title": "Am I unreasonable? HLB HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 17, 2014 04:10PM starbrightlyshines wrote: Can you ask for an MRI? With you family history and your fibroadenoma a breast MRI is totally reasonable,  especially if youve been told you have dense breast tissue. If you have to be your own advocate, do it, and fight for it. An MRI is the only way you will know for sure. I was told 5 years ago I didnt meet the criteria for one. I had afibroadenoma which was removed,  I was told I had dense breasts with calcifications, but no family history and every mamogram was normal. I dont want to scare you but in the fall of 2012 I was diagnosed with stage IV breast cancer, no primary tumor was ever detected. It had moved to my GI tract and ribs.I have been told this is very rare. But I sure wish I had pressed for that MRI back then. Dont be scared from my story :), just be your own advocate. We have been trained not question our doctors and those who in authority. But if you dont stand up for yourself no one else will.",
      "MessageIndex": 2,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/816985",
      "Title": "Multiple fibroadenomas in both breasts Julie2039 cp418"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 22, 2015 02:35PM starbrightlyshines wrote: I haven't read all the posts but I wanted to chime in because we are in similar situations. My MO has suggested switiching from Femeara to A/A due to progession on an area in my spine. He shot done Faslodex or Arimidex. He did give me a referral to a RO to talk about radiation to the spine. I did that last week. He does a single targeted dose which sounds live Vero or is similar. We talked for 1 1/2 hours so my eye began to glaze over with all the details. But he did say I would need an MRI before he did anything to make sure I was a candidate. I asked who needed to order the MRI and he said he could or my MO. So I would think the place in Florida could order an MRI anywhere and have the results sent to them. I get frustrated too, because I have a specialist in Seattle who reviewed my chart to see if she had any recommendations. I want to stay on Femara as long as possible and then maybe do Faslodex. She just went along with my Dr. Had I actually met face to face maybe I could have felt better that she really knows whats best for me. But I think she just thought A/A is the next step and that's that. My MO actually listens, and who knows if I put my foot down and said I want Faslodex maybe he would say OK. But I feel like they are the experts, so I feel like I should go with what they say. But I am struggling with day to day life right now, if I had any of the bad side effects from A/A things would be at a standstill at my house, I have 5 children and I can't take any unneeded risks. It is so hard, but we really need to be a strong advocate for ourselves because no one else can do that. We know what is best for us, and we need to feel confident that we are doing all things possible. I am just not getting that feeling at this moment for myself, so I know I still haven't reached the right decision.",
      "MessageIndex": 20,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831826",
      "Title": "Am I unreasonable? HLB HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 25, 2014 08:01PM starbrightlyshines wrote: leftfoot-I totally understand. Even though we know that it is important to use our energy to focus on what is important to our kids and family it is hard to come home from a day of driving them to games or activities and then come home and be faced with a messy house and hungry kids. We have had several fun trips this summer, but then the post vacation let down is hard to deal with emotionally as well as the extra laundry piled up on the floor. Oh well! I struggle to stay \"in the moment\" and contstantly remind myself that being a mother is the most important thing to me......and the weeds in the yard or cleaning the house isn't as much as a priority as spending time with my kids. And it doesn't seem fair that we can't do both, but I for one, do not have the energy to live the life that I used to. Or the one I still hope to have. I do see an increase in energy and I think it is a positive sign that my tumor markers are stable or slightly decreasing. Whatever it is, I will take it! Stella-I don't know what meds you are on, but maybe there is something that can help. I take Lyrica to help with the joint/muscle pain from the Letrzole(Femara). And because I often have a hard time sleeping, not to mention waking up with anxiety and hot flashes, I often take a Xanax before bed. Getting a good nights sleep is so important. I can't function without sleeping well. Also because I expressed concern with my Dr while describing being sleepy while driving long distances,he prescribed some form of Ritalin. I don't really like it, for me it just gives me instant anxiety, but I have used it a couple of times and it worked. So don't be afraid to ask your Dr for other meds. I often research to see it something might be useful and then I present it to my Dr. He has been very receptive so far.",
      "MessageIndex": 229,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 27, 2014 03:24PM starbrightlyshines wrote: Susan-I do help out at school, not on a regular basis. I find it is so much better when I get out of the house, but I don't want to commit to something on a regular basis. I guess I am wary of over extending myself (I used to do this a lot) and right now I just really want to put my family first. Kjones-I have a wonderful husband. But he works a lot, and since I have been a stay at home mom for years I really feel like I am the one in charge of everything at home. But things have shifted a bit, and my older kids do help out a lot. I just want them to have a \"normal\" childhood, so I do find myself over compensating, or being more lenient on things than I probably would have been a few years ago. I think more about how they are going to remember me. Are they going to remember me as the mom who yelled about the towels on the floor, or as  the mom who takes them out for slurpees because it is Friday? I think living with cancer makes us much more conscious about what we do and how others perceive us. At least it has for me. I just wrote a post on another thread about a lunch I had with friends yesterday. It was just uncomfortable. They talked about cooking and going out with friends, and things that just are kind of beyond me right now. I am happy when I am able to get the kids up, dressed, lunches made, and off to school on time. Groceries in the house and dinner makes me happy. I want so hard for my children to not have to think about cancer, or think about me being sick. I do take time out though, yesterday I kind of retreated to my room and took a nap and watched Netflix. I told the kids I had a headache....which was more of a mental headache than a physical one :) I just get worn out sometimes and need a break. And my husband (I think) has kind of learned this pattern from me. I get overwhelmed, I retreat, and the next day I can ususally look at things in a different perspective and tackle what needs to be done. Or not. But at least I feel better. It is hard knowing that while I feel good right now......that can change at any moment. And my friends and even family don't even think about it. And that is a great divide between me and them. I look OK so to them I am OK. But my priorities have shifted and I think I just can't relate to them in the same way, I think that's why the lunch left me in such a funk. Oh well, today is a new day and I really don't want to go down that road again. I hope you have a nice day :) Diane-The area I live in is too small, there isn't much help available unless I can pay. There is help for the elderly or disabled, or maybe someone in an acute crisis but I am not really eligible here. I have a great social worker at the cancer center who I rely on when I really need someone to talk to. Kite-My tumor markers started to rise in June, so we did an PET in July. It was good, and then my markers have started to fall again. So I know what you mean about being in a funk. It is hard to relax and not think about it. That's why I take it one day a time, or if that's too much, just moment by moment. I think it is so important to support each other, otherwise there really isn't a place where I feel like people understand me. Hugs to you!",
      "MessageIndex": 238,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 3, 2014 03:02PM starbrightlyshines wrote: Well mammas, we are into our second week of school and the house seems awfully quiet. I am not used to it, and I am not as productive as when everyone is home. Even my fun projects that sounded so appealing when I bought things and planned them aren't capturing my attention. The internet is sucking up too much of my time, or the TV, or.....I seem to find many excuses. Susan, I have been a believer in just answering their questions honestly. But my children for the most part don't talk about it (except in the two instances above, lol!) So for now that is what I am going with.  ",
      "MessageIndex": 254,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 3, 2014 03:15PM starbrightlyshines wrote: V-worrying about our children is the one of the hardest things about this. What I have found in the almost 2 years of living with this is that kids are incredibly resilient. Once they kind of figure out what is going on, how you are doing, and how it will effect them, things can kind of run along even if you are still a jumble of emotions. It is so incredibly sad, so much so that I have a really hard time when I start thinking about it too much. The Social worker at the hospital just gave me a book about journaling with stage IV cancer. I have only begun to read it, but I think the premise is that it can be incredibly therapeutic and healing. I don't think it is for the kind of journaling one might do to leave memories behind for loved ones. So I may give it a try. I can't seem to open the journals I have bought to write in for my children, but since I can think of this as a therapeutic tool it might help. Especially since I don't really have anyone I can really pour out my feelings too. Looking at my friendships while I have a lot of friends, I don't really have one I feel like I can sit down over coffee and really have a heart to heart talk. And it would be too taxing to do with family memebers, I don't want to put that on them. So maybe my thoughts and emotions on a blank page that I can destroy later might be a good thing. Food for thought anyway.",
      "MessageIndex": 255,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 16, 2014 07:12PM starbrightlyshines wrote: Hi Kebab-thank you for the reply! I was feeling so alone this afternoon. After I posted on here I went to fb and it was big reality check. Two families, one that I know and one in our community had tragic things happen over the last few days. It was a reminder that we all suffer, life is full of suffering and it is just a part of being human. I may not like the suffering which has befallen me, but if it weren't cancer it could just as easily be something like that which effected those two families. (I could provide details but I think you have enough on your plate) and their lives were changed in an instant. What we deal with is longer lasting, and having children provides us with so much joy......and so much worry. So for me, that fb visit reminded me to find joy in the daily things, a cuddle from my son, laughter from my children, enjoying the sunlight on these beautiful Fall days. Living in the moment and leaving tomorrow to take care of itself. A daily struggle to live in the moment, it doesn't come natural for me! I am much more of a planner. While most people would see me as a laid back, relaxed person, I have a side of myself which is constantly planning and looking ahead. I have had to redirect it to learn to appreciate the moment instead of planning the next step.  Last school year I did a lot of sleeping during the day also. This year I have more energy, maybe from the Femara, who knows but I will take it. I agree with trying so hard to be \"on\" all the time. I try so hard to pretend things are as normal as possible for my children's sakes. If I nap I usually tell them I have a headache. Or I will give myself a needed break and watch Netfilx in my room afterschool while they are watching TV or doing homework. I find the weekends easier since my husband is home. But I try to maintain the normal level of activity.....which means going to kids soccer games, football games, etc. And I also end up exhausted on Mondays. Are you still doing chemo? Because the fatigue from that is so awful. Has your Dr mentioned Affinator/Aromison combo? I think my MO said that would be my next step. I have a PET scan repeat on Thursday so we will see what comes of that. I am happy on Femara, I have figured out the side effects and I really don't want to have to switch treatments. Thanks for talking to me, I needed it today :)",
      "MessageIndex": 275,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 4, 2015 05:15PM starbrightlyshines wrote: Welcome Cjanet- your kids are so cute! And you too :) Patty-do I need to download pics from my phone to my computer? Sorry to sound crazy, but I don't even know where to start.",
      "MessageIndex": 463,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 15, 2015 04:59PM starbrightlyshines wrote: Hi ladies! Fujimama-i haven't had a conversation like that with my children yet. I guess I kind of feel like whenever I feel like that is needed I will know. So far I keep trying to keep a normal life, but have told them all that I am changing medications and I'm not feeling so great. I think they are kind of used to that :) And I am having radiation done to a lesion on my spine in the near future, so we have talked about that. It is sad to me that these kinds of things (medications, scans, radiation) is all becoming \"normal\" to them. Cafelovr-one of my dd was 8 when I was diagnosed, she is is now 12. She was really like that for a while, and even slept on our floor off and on for months. The social worker at the cancer center kept telling me that wasn't good and I was worried so we made an apt with a counselor. DD was not receptive to the idea and refused to speak to any of us during the apt. So I just went with my intuition and gave her lots of hugs and let her spend time with me. She got over it and now spends time alone in her room with the door closed :) So I think different kids process things in different ways and just being open to them is the most important thing. We are having a great summer here. I recently changed from Femara (it was failing, my tumor markers were rising and I had a spot on my PET scan show up on my spine). So I started Aromisin/Afinitor last week and I am even more fatigued than usual. But I am determined to enjoy the summer. I guess I will try to fit in time for some radiation, but I am just waiting for the RO to call me. I don't have 2 weeks in a row that I was planning on being here in town, we have a couple of vacations coming up and I really don't want cancer to interfere with my vacations anymore than it is already. Barb-I try never to look at statistics. There is no reason to think we can't be the ones who have successful treatments ahead of us, and I remind myself that medicine is coming up with things quickly. it is so important for me not to sink into depression or anxiety. I hope you are feeling better.",
      "MessageIndex": 517,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 25, 2015 12:59PM starbrightlyshines wrote: Great photos Kjones-thank you for sharing! I have an iPhone and a pc. So I'm not sure how to post pics yet but someday I hope to figure it out! We are deep in the school routine now. Dd 12 that started new school (see my last post for tmi) seems to be doing really well. I was worried because it threw a new school schedule and trying to meet new parents into the mix and that is always hard. But so far so good. Ds 16 broke his collarbone playing football the weekend we moved my daughter to college. So we were out of town but luckily my father in law was around to take him to to the ER. He is out for the season, which may not be a bad thing :) I hope everyone is doing well. I am on the A/A combo and will have a PET scan at the end of OCT to see if it is working. I guess in some ways I am learning to live with the constant unknown. I will have my 3 year cancerversary in Oct. So many mixed feelings but I need to focus on the gratitude and get rid of the negative. SO much easier said than done!",
      "MessageIndex": 550,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jan 12, 2016 06:53PM starbrightlyshines wrote: Oh, I am feeling the same way. Today I lost a good friend to gallbladder cancer. She was doing well and then all of a sudden was not doing well. She was my age and we have daughters who were friends in school. I am just so sad. My 16 yo old son asked me if my cancer could turn the way hers seemed to turn so quickly. It made me realize that my children really don't know MBC the way we do, which I guess is a good thing. I would hate for them to have to think about it daily.",
      "MessageIndex": 18,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839832",
      "Title": "I always get a spike in my cancer anxiety Fitztwins EnglishMajor"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 11, 2015 06:54PM starbrightlyshines wrote: His reasoning is that once the cancer has found away around an aromatase inhibitor, trying another AI wouldn't be beneficial since the cancer knows what to do to get around it. So if you add Affinator (or Ibrance but he hasn't suggested it) it resensitizes the cancer so that the AI can work again. This is my take on our conversation, those were not his exact words but I am condensing what I got out of it. But I see other women here who have gone from one AI to another AI and seem to have gotten months or years out of the next one. I'm not sure how to say \"well on this internet site.....\" And I am trying to get a second opinion, but even though I am an established patient it would be at least July before I could get in.",
      "MessageIndex": 3,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831311",
      "Title": "AI-If one fails does it mean others won't work on their own starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 12, 2015 07:52PM starbrightlyshines wrote: Good point sandilee, I hadn't thought about that. I guess I was thinking of Ibrance as the last step, since it is the newest thing out. But maybe that would be better than A/A. Thank you!  ",
      "MessageIndex": 15,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831311",
      "Title": "AI-If one fails does it mean others won't work on their own starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 18, 2014 09:42PM starbrightlyshines wrote: Well I am back. I kind of took a little break from the boards, too many things in real life were worrying me as it was and I felt worse when I logged on here. I have 5 children 19,17,14,11,and 6. I am trying so hard to give them a normal childhood, not filled with worry about cancer and losing a mom. I have done really well over the last year on Femara and I almost feel like things have kind of gotten back to normal. My energy has been better, I am able to cook dinner on a more regular basis, keep up with the house and the kid's activities and just feel better. So it's so ironic that at my regular appointment I tell my onc that I am feeling good, energy is even increasing. And then he tells me my tumor markers have risen :( So I am scheduled for a PET scan next month but he is talking about switching to Avastin/Affinator next month if the markers are still up. I just feel like I had gotten used to Femara and it's side effects and now I am back on the roller coaster. I am less than 2 years into this diagnosis and I have already used up Tamoxifen and Femara. I feel like this doesn't bode well for the future, and I am trying hard not to lose my optimisim. And what really, really sucks is that summer has just started. My oldest daughter is home from college. I had really looked to relaxing and enjoying this summer, last summer I was still sick from my GI mets and worrying about tamox failing and starting up Femara. So here I am again. Almost in the same spot as last summer, feeling like I am burning up my options. I could use some help, experience, inspiration,.....anything you have to offer.",
      "MessageIndex": 180,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 20, 2014 06:57PM starbrightlyshines wrote: Many, many thanks Virginia for those words I needed to hear. As you said, I have been here before and I found a way to go on, and I will continue to find that way. I know you understand, that's why I came here for support. I have tried to find support in different ways, but mbc patients differ from other advanced cancer patients because often we have many treatments available to us. So we are looking at running a marathon, not a sprint. That has been hard for me. Other cancer patients have the hope that their treatment will end, we know we will always be on some type of med. The rollercoaster never stops. The anxiety might lie sleeping for a while, but every test and Dr visit or just a random thought can wake it up again. I just haven't been able to find anyone who can really relate to what it is like to have mbc and be a parent. The other mbc patients I know in real life have older children, out of the home. They can't remember the days when everyone still relied on mom to make sure dinner was on the table, or at least food in the refrig. Or try to keep track of everyone's summer activities and jobs. I want my kids to remember having a mom who was there for them, so I try to make life as normal as possible. In a way that is good, it helps keep me present in the moment. And I love that I can come here and have instant understanding. I will reread your post Virginia, thank you for your words. I feel like they came straight from your heart :)",
      "MessageIndex": 189,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 23, 2014 03:32PM starbrightlyshines wrote: Patty-my 14 yo ds left yesterday for church camp. He has never gone before and I was worried about him too. He has never been gone longer than an overnight trip, and this camp is several hours away. But he is going with 2 friends, and he was excited to go. I haven't discussed my recent issue with Femara which may be failing. All he know is that I take meds, and I go to the Dr once a month. And he doesn't ask questions so I leave it at that. It is hard to let them go, but I think the experience is so good for them provided they are ready for it (or think they are).But just not having his presence in the house is noticeable, I miss him already. I think it's hard for most parents to let go, and since we have cancer that is always another layer of emotion we have to deal with. I hope our son's are both having a great week, and I hope you will feel better about it as time goes on.",
      "MessageIndex": 192,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 25, 2014 08:07PM starbrightlyshines wrote: I am wondering how everyone is doing getting back into the school routine. Today was our first full day of school. My 1st grader had himself up and dressed and was watching tv and 6:30 this morning! My 6th grader got up in a good mood today, she is my sleepy one and I just hope it is a good sign for the rest of the year. My two high schoolers, freshman and senior are on their own schedule since they drive. That is nice I have to admit! And my college girl is home for 3 more weeks. I am trying to enjoy every last minute of having her home. She goes to school 4 1/2 hours away and I miss her terribly when she is gone. Good luck everyone!",
      "MessageIndex": 230,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 28, 2014 01:11PM starbrightlyshines wrote: Kite-I am so glad Kadcyla is working. Yay! I tell myself to celebrate EVERY good news. If my monthly tumor markers are good I feel like I hit the lottery and give a huge sigh of relief and make myself really appreciate it :) Sports can be so good for all of us. It gives the kids an outlet and an activity that focuses on themselves. And it give us a reason to get out of the house and celebrate our children. But it can be tiring too, so I try to plan ahead with crockpot dinners, pizza or tacos on the way home, or just something so I am not overwhelmed at the last minute with hungry children and husband :) That way I can also enjoy the game too. I try to make it to as many games as possible...just because. Although there are times where my inlaws will step in and take them. I have just promised myself to try to never miss any possible moment. So even those icky things that I could avoid (fall sport meeting...not my favorite) I go with a smile on my face and feel a huge sense of accomplishment because I did it ! I was there! Kind of silly, but my mind works in that direction these days. And I am with you there about picking your kids up from school and all regrouping on your bed. I have done this many times! Now that I am feeling better it's not so much. I am more likely to be downstairs so the kids are in the kitchen or family room. But last year, we spent a lot of time on my bed! I am sorry that your husband is working in a different state. That must be so hard. I hope you are able to arrange to be back together again soon. Like you said, one minute at a time! I am trying to rally for our last summer trip. It is with my family and it will be a lot of fun. But we need to pack food so I have to decide what to get and go grocery shopping and pack the coolers. The county fair is also here, so my kids are all wanting to go tonight, plus soccer and football practice.........meaning I will be doing most of the packing :) Oh well, it is always fun when we get there. And I try to let my energy level dictate how much gets done. It might be just the basics this year. But last year at this time I so unsure of the future it hurt to even think about this year. And here we are, and I feel better than I did. Another reason to celebrate!",
      "MessageIndex": 240,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 2, 2014 02:37PM starbrightlyshines wrote: Hi Liz, I hope you had a good weekend and are feeling ok. Wow. My 6 year old said something that took my breath away this morning. We were cuddling on the chair before school and he started talking about how glad he was that I didn't have cancer anymore and I could go skiing again, etc. I try so hard to make life seem as normal as possible that in one way it is good that he thinks I don't have cancer. But I also talk about taking my medication, and going to the dr. I don't want them to constantly be worried about me and thinking about cancer. But at the came time I thought that by knowing I still have cancer it wouldn't be as much as a shock to them when I have to switch treatments and deal with new side effects. So I had to take a moment, take a deep breath and explain to him that I still have cancer, I still take meds, but right now I am feeling really good.He looked a little confused and then said \"well but you don't have those hoses in your arm anymore so that is good\". He was talking about several months ago when I was so sick with GI mets that I had to do IV nutrition. So I get where he was coming from. But it's still painful. Speaking of painful, my teenage daughter brought up how awful a particular holiday was right after I was diagnosed. I made the observation that I don't really remember much of that time and that it is really hard for me to talk about that time. She said \"well how do you think it was for us\". We were having a really nice lunch out with my mom, sister, sis in law, and my other teen daughter. I just said, \"this is going to make me cry right now, I can't talk about it. You can talk to each of these people at this table about it later, but I can't talk about it right now\". She understood, she wasn't trying to be mean, she was just being a teenager and remembering for her how awful it was to have a mother who was so ill. That was a very touch and go time, I had lost 25 lbs and I couldn't keep anything down. Of course we were all scared. And I think we did a good job of supporting each other at that time. But I think my husband and mom kind of insulated me from having to deal with the children's fears, because I really could not have dealt with one more thing. I gave them lots of hugs and cuddles, but I put on a brave face for everyone, including myself. So I understand now that thoughts and emotions from that time will come up. What surprises me is that I really still can't deal with thinking of that time and talking about it. I hear of others who can face the emotions, who don't want to take meds to soften feelings. But I am the opposite. What my daughter didn't realize, and what I want to tell her later, is that the thought of having to leave my family is more than I can bear. I deal with the thought of my death. But to think about leaving them, and the pain it will cause.......I hear about people who lost a parent and it became a turning point in the wrong direction. How do we help our kids so that doesn't happen? Can we do anything at all? Perhaps when my health is really failing it would be the time to say something, but even then what would I say? I hate this. That's why I have bought journals with the thought of writing to them. But I can't get myself to even get them started. Has anyone started journals or leaving some sort thing behind? Today the social worker is trying to restart a Stage IV support group. We had one going but we lost several member to lung, pancreatic cancers, and the group just kind of lost its direction. It is hard because stage IV breast cancer has many more treatment options than other stage IV cancers. And we are all so different. I know it bothered some women that I have small children at home, it was painful for them to see my struggle. And for those who are doing well, it can be hard to see someone whose treatment is failing and vice versa. I wish I could find a group that was just for stage IV breast cancer. It would be outside my town but I think I could really benefit. I still feel like an oddball.......I don't feel like I fit in with my old friends and the moms on the go at school, and yet my treatment is going well (at least it was at my last visit, LOL, we all know that can change in a heartbeat). So I haven't really found anywhere other than my family, that I feel like I really fit in. Hugs to all you mamas. I am hoping for a stress free back to school week for some, as well as those of us who are still trying to get back in the groove!",
      "MessageIndex": 245,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 10, 2014 09:03PM starbrightlyshines wrote: I had a reply started and I don't know what happened but it vanished :( I'll be back to redo. For some reason my family thinks they are hungry, lol! My Dr visit was a mix. Good tumor markers, but my last PET in July has \"some areas of concern\" and he want to schedule another one asap. Of course he tells me not to worry! But I am feeling good, no GI problems which is where my cancer left me in such bad shape when it was diagnosed. So I won't worry.....not much as I can control anyway!",
      "MessageIndex": 271,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 16, 2015 07:24PM starbrightlyshines wrote: lbgal-fatigue is probably one of my biggest problem as well. I just don't have the energy to keep up with things. I have a 7 yo son, he was 4 when I was diagnosed. He has learned that I just can't do things with him anymore, like skiing or even jumping on his new trampoline. It makes me nervous because I had so many bone mets that I am careful about what I do. He doesn't ask me to play much anymore, but like you, he comes up to my room and hangs out playing or watching Netflix on my tablet. He probably watches way too much TV, but having older siblings and not having other kids around to play with there isn't much to do. He has gotten used to having days where I am up and around, and days when I am in bed. It isn't the way I would like it to be, but I guess we just make the best of what we are given. The important thing is that we are here, we are involved in their lives, and they know they are loved. I remind myself of this all the time and that is how I get through it. Kjones-I have tried Ritalin. I asked for it because I had a couple of times driving long distances where I was so tired I thought I wouldn't make it home. But for me it produces instant anxiety so I haven't used it much because I battle anxiety anyway. But I did take a half a pill last weekend and tolerated it ok so I might try it again sometime. I agree with what you said about playing with our children, looking back my parents never played with us either so that does make me feel better! I do think there is so much pressure on parents, so many of my children's friends are involved in activity after activity. I have already had to say no to my 7 yo on a few things because I have to pace myself. And having older siblings, we are busy enough with their sports. But he did soccer and bb this year, so it's not really like he is missing out. I love our cuddle time, whether it is on the couch or in my bed. I just love the fact that he is happy with life, and doesn't think about cancer or worry about it as much as my older children do. Good luck with the surprise party, what a great idea! Fujimama-I also try to schedule around my energy, or rather try to schedule my energy around their activities, lol! So morning I try to rest because once school is out it's dinner, homework, etc. Even so, evenings are hard, even when I haven't done much during the day. My goal is to make life as normal as possible, for as long as possible. But like my daughter's  teacher told me \"there is no such thing as a normal family\", so I try to not feel guilty. I try to volunteer at school and drive on field trips. I used to be the parent that was always there. Now I just do it as much as possible and tell myself they will just remember that I was there, not how often. Katz-I can tell how much your daughter means to you, it's more important that we are there than it is what we do. This winter has been hard on us. The kids have been sick and we seem to just be passing things back and forth between us so someone is always sick. There has been a lot of tension in the house, my oldest daughter is home from college with mono/lyme disease and is taking some time off. We keep getting passed off from dr to dr and no real answers. My 18 yo is looking at colleges, and none are close to home. I keep getting colds and they knock me out, the stress doesn't help and I know it's not good for my body to be so stressed. I haven't been able to go to yoga like usual, so my joints seem to ache more than usual which just puts my mind into the \"it must be cancer\" mode. Its just been harder than usual, and I am feeling trapped. I've tried to reach out to a couple of people that know what my family is going through but they don't really get it I guess because I am not getting much response. Being told I am \"inspirational\" isn't going to help me when I feel like I can't handle anything else. But asking me out for coffee or even a follow up call or text would really help. I think we just live in a world where most people are so busy that they can't see much outside of their own lives.",
      "MessageIndex": 400,
      "PostDate": "16/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 15, 2015 09:06PM starbrightlyshines wrote: Hi Mamas, I just got back from a great spring break trip with my family. My kids are 10,18,15,11, and 7. It was a nice time for all of us to be together. My 20 yo is currently at home from college recovering from mono and possibly Lyme disease....almost a year later we have no official diagnosis other than the mono. She has terrible fatigue and pain, she sleeps most of the day. Even on Vacation she slept most of the time and wasn't able to hike or swim much with the rest of us. It is so sad, and stressful to deal with this and my own cancer. We are currently waiting on a new neuro consult for her. Anyway it is always hard to come back from vacation and the weather is so cold here, my DH is working twice as hard to catch up and the teens are glad to be back with their friends. I did really well on while we were away, my energy came back and I cut way back on my pain meds. But I can feel the old stress creeping back in. I think a lot of this battle with cancer is mental and if effects me physically. Maybe I do need meds for depression..........I just feel like I don't need then everyday. Ativan does help with the anxiety and I don't hesitate to take it. Patty-I love the ice cream photos! Ice cream will always bring a smile to a kids face! Nights are always hard for me. If I don't take a Xanax I can't sleep, and as moms we cant afford to not sleep. So I take Xanax when needed :) I love the riding photots! I love animals but I am allergic to horses, so even though my inlaws live next door and have 2 horses I haven't ridden for years. My children used to ride, but they lost interest and I think it stresses my FIL too much to have the horses around the kids. Kjones-i know you were having a really hard time a few weeks ago. I meant to reply but got busy with our vacation. Sometimes even coming to this site is hard for me, even though I want to be here to be supportive, because I think no one else really understands us. Lbgal-i used to hate that phrase \"it takes a village\" but it is so true. I think now especiall,y I hope that I can look outside of myself to help my children have a healthy network of support. And welcome to the new mom with the 3 mo. It doesn't seem fair to have young children and have cancer. My youngest was 4 when I was diagnosed and it broke my heart. He didnt understand anything other than I was really sick (I was diagnosed with GI and bone mets from the start), but he was used to sleeping with us and all of a sudden he couldn't anymore. And the other children were all so scared, it is really painful to remember that time. But now 2 1/2 years later things are much more normal than they were back then. Hopefully they don't even think of cancer much anymore, although they know I go to the Dr monthly and take meds. I just want them to have as normal a life as possible.  ",
      "MessageIndex": 440,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 20, 2015 02:19PM starbrightlyshines wrote: JFL-What a little cutie! I'll bet he brings you so much joy everyday! I really think my children are what keeps me going, my youngest son is still at the age where mom is really cool and I love his little hugs. And I love the UW onsie :) My oldest daughter went there last year. She is at home this year taking a year off because she has been sick. Although I love to have her here, it has been stressful trying to get her diagnosed and treated. But that's off track......your little man is darling! Tarhee-Your son looks so darling in his tux! I agree, it is so nice to think at each milestone how fortunate we are to be here. It helps when I get sentimental about them growing up just to realize how grateful I am to be here to see it. And the school stuff.....it's always a work in progress to get them to think about their grades at any age! Well ladies, I am enjoying the sunshine today, and my mood seems to be on the upswing. I made it to yoga :) I am still on the fence about the antidepressant. I hear some take Lexapro or Celexa. Or maybe it's just more of an anxiety thing and I should just ask to try Buspar. I just hate adding one more med into the mix, plus I don't want to have to deal with any more crappy side effects!  ",
      "MessageIndex": 449,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 6, 2015 02:50PM starbrightlyshines wrote: Thank you for asking how my appt. went. I am basically undecided, I updated my post with all the details. I have an appt with a RO to discuss radiation to the one area in the spine next week. I will ask if he feels if it something that needs to be treated or if it will help with the pain. MY MO felt we should think about switching to A/A combo since it is possible Femara is failing since the spot on my spine has been there for 7 months and is slightly larger (SUV change from2 to 3). There are no other visiable mets on the PET, but I do have pain in my spine, ribs, and lower abdomen. All places where I originally had mets so I find pain is unreliable to use as a marker for whether or not there is progression. But I have a busy month ahead with one daughter graduating from high school, we had planned a big party and I have a lot of cleaning and yardwork to do. So we put off a decision about the med change until the end of the month. Now I am thinking I would like to enjoy the summer without worrying about new SE from a new treatment. So unless my tumor markers jump dramatically or I have a huge change in pain/symptoms, I may wait until the ends of summer before I decide on a change. The only drawback is the thought that I could be giving the cancer a chance to spread to other organs so that is still something I have to consider. In the meantime, it is a beautiful day. I have family coming from out of town this weekend so I need to get myself organized. I also need to do some serious grocery shopping because I have really slacked off in the cooking dept the last few months. So I am going to get up and try not to think about cancer!  ",
      "MessageIndex": 470,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Oct 31, 2015 07:37PM starbrightlyshines wrote: Happy Halloween Mamas! Life is busy, I will try to check in later. JFL-He is so sweet!",
      "MessageIndex": 564,
      "PostDate": "31/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 28, 2017 11:32PM starbrightlyshines wrote: Thank you for sharing Babs. I am at the point where my Dr says is the best time to be looking for trials, So I have been since spring but nothing has come up that I have been qualified for.  I am on month two of Kisquli, but even though its too early to see if its working, my tumor markers keep rising and I have had every side effect possible. (Ibrance was a dream, my Dr says this is similar but my body doesn't think so!) I'll see if I have this mutation, I know my Foundation One report didn't come back with much that was \"helpful\" but I will have to investigate further. Hugs",
      "MessageIndex": 4,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/857416",
      "Title": "Study on GDC0077 babs6287 zarovka"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 3, 2015 11:59AM starbrightlyshines wrote: Good luck, I hope it all subsides once your body gets used to it. I am the same way, I struggle with asking too many questions or reading about the side effects because it always makes me not want to do something. I figure it was such a crazy way that my cancer was diagnosed (stage IV because I went to the ER with stomach cramps and came home from the hospital with a MBC diagnosis) so heck, anything can happen now, lol! I feel like I am, \"that\" person who it would happen to! And I have always been one who read up on everything (before diagnosis) because I like to be \"prepared\".",
      "MessageIndex": 27,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831505",
      "Title": "faslodex v arimidex/aromasin doc changd mind mid appt. intothewoods HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 16, 2015 05:58PM starbrightlyshines wrote: Heidi I have been on vacation so I am sorry I didn't see this until now. I had radiation done to T8 and T9. I could not get my insurance to approve the SRBT even though my RO said I would be candidate for it. Instead I did a 5 day treatment. I got severe stomach cramps on day 2-5, the tech said it could be from the rads. I also got that lump in my throat but it wasn't too bad. But about a week after the last rads I got esophagitis and that was not fun. I felt like someone was punching me in the mid back and was at random times. And after I ate. It was so bad that I started taking more pain pills because I was miserable. Luckily my RO had explained that this could happen, so I knew what it was. It lasted for about a week and then was gone. Right now I am not feeling any effects, it has been about 4 weeks now I think. I hope you are managing the discomfort and nausea. Cancer is not fun, that's for sure.",
      "MessageIndex": 29,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/834008",
      "Title": "Problems after rads (sbrt) to spine HLB HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 19, 2014 03:28PM starbrightlyshines wrote: Kjones- thank you for your reply. My markers have been a good indicator so far, my mets were so widespread that I can't really use physical symptoms as an indicator because I never know what is a side effect. But the markers were down, I think the cancer was \"stable\" and I was feeling better so this kind of hit me kind of hard. I know some people can get years on Femara, and I hoped to be one. But as my Dr  has pointed out, there are several new drugs on the horizon that are promising for breast cancer. I just need to get back on track with appreciating each day and not looking too far into the future. But, as we all know, that is so much easier said than done! What plans do you have for the summer? Suzy-it will get easier. Like Kjones said, once you get a treatment plan in place you will feel better. My children have done really well, they know I take meds and they know I have Dr appts. and if they have questions I answer them truthfully, but in a positive manner. They don't ask much anymore. I hope I can keep it that way for a long time!",
      "MessageIndex": 183,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 8, 2014 04:29PM starbrightlyshines wrote: Kjones-I hope you are having a great time on your vacations! There is nothing like the ocean, sand and sun to make us live in the moment! I hope your MRI went well also It is really hard to from test result to test result. The waiting can be so wearing on us, I still don't know how one lives like this, but I guess we just get by moment to moment. leftfoot-my markers were up at my last visit so I have a PET scan scheduled for later this week. I have been feeling well on Femara so I am going to be really upset if I have to change meds. I think my Dr mentioned the A/A combo and even though I haven't looked up the side effects, I know from what some people have posted and a friend has mentioned, that the side effects are much more debilitating than what I have. Once I found Lyrica helped with the joint pain, I have been doing really well for the past few months. Unfortunately, this cancer is in my GI tract and bones, so it could be flaring up again and I may not feel it yet. I have a new computer and I have no idea why it changed fonts. I feel so old when I can't keep track of new technology! Tara-I think it just changes as they get older. They kind of flow in and out of the house like the tide! And somehow if you are available to listen when they actually feel like talking, it is possible to still have a close relationship! I am trying to be calm about the PET scan, but I feel like am quickly running out of treatment options. I could use some good thoughts and prayers sent my way,",
      "MessageIndex": 207,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 26, 2014 02:31PM starbrightlyshines wrote: Kjones-It has been really bittersweet for me too. The summer went by way to quickly. We did some fun trips, and it was great. But then the let down from coming home and seeing how fast the days fly by is hard for me. Last school year was hard for me, I had several mornings especially last fall, when it was all I could do to get up and get them dressed and out the door. I would put on my comfy clothes, brush my teeth and comb my hair and try to pretend everything was normal for them. I would drive them to school, and then often times cry my way home and go back to bed. It was a difficult year and I honestly had hope it would get better, but I didn't know. The fatigue can be so overwhelming. I watched a lot of TV because I it was so hard to do anything. And yet I need to do the grocery shopping, cook dinner, help with homework, clean the house, do the laundry etc. Everything still needs to get done and while the kids can help, it's not the same. And I felt so isolated. People are busy, they work and get on with their lives and it's hard for them to understand while I might look OK from the outside, I am no where like I used to be. I still don't know how to live with this diagnosis. I feel like some people have distanced themselves from me, and I don't have the energy to maintain many friendships. There is a stage IV support group in our cancer center, but it is for all kinds of cancer. I was the only one with children still at home. And we have lost several people to lung, pancreatic, etc cancers. I don't really know if it helps me to go or not because I often leave feeling worse than when I went. I did make a connection with another breast cancer stage IV woman. She is on her 19th year with it, and she leads a busy active life. She has been an inspiration to me. There is hope, and I make it through by concentrating on my children, trying to make their lives as normal as possible, and trying to live in the moment. I try to take it day by day and that is the only way I can do it without getting overwhelmed. And thankfully, I do feel better this school year. I have a little more energy than I did last year. There is always hope!",
      "MessageIndex": 233,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 8, 2014 05:08PM starbrightlyshines wrote: Good afternoon mamas, I hope you are all having a nice Fall day. I thought I had a busy day ahead, DS had a JV football game I was excited to go to. So I went to the grocery store, put a dinner in the crock pot and planned on picking up little DS and heading out to the game. Well I got an email saying the game was cancelled! Oh well, at least we have dinner out of the way. My middle school daughter is home with the first cold of the year. And of course MSNBC has an article about a bad respitory virus going around..........I don't need anything else to fuel the anxiety fire if you know what I mean! I am just checking in, you all are such a good support for me. I have stopped reading most posts here or other fourms because I get too depressed. But I have children, and I don't want to let this crappy disease keep me from making the most of my time with them. That is what keeps me going. Whatever it takes! Hugs to all of you.",
      "MessageIndex": 265,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 10, 2014 09:09PM starbrightlyshines wrote: Susan-I thought about writing letters for every birthday to come, or even for big events like graduations etc. I never thought about them dreading to open them, but now that you say that, I could see how that could really be the case. I love the idea of the cookbook because it would contain happy memories. And food can convey warm, happy feelings so recipes and photos would be great. I think concentrating on the living now and making memories is so important, and it lets me off the hook when the guilt of too many photos on the computer, and baby books unfinished, seems to taunt me! Even doing an electronic book for a school year, vacations, or holidays would be great. And I get so stuck in \"it has to be perfect\" or done for every year. Nonsense! They will be happy with whatever we do, or the memories they have. Annie-How old is your daughter? I have a 6th grader, and it is a hard time for kids. But friends can be so important and I think it is great that you are talking about friendship with her now. Our school is small, and her class has a very small number of girls so a lot of the difficulty is due to that aspect. And one of her best friends at school is a boy also! I know a woman who has had stage IV for 19 years now, and they have been good, busy years. I almost think part of what keeps her going is her zest for travel, learning, volunteering, and friends. She has been an inspiration to me, and I think if it can happen for her it can happen for us to have many good years ahead!",
      "MessageIndex": 272,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 16, 2014 04:26PM starbrightlyshines wrote: I'm still here ladies, just checking in. I went to a support group at the cancer center, I almost think it makes me feel worse though and now I am in kind of a funk. But then it doesn't take much these days, I am so up and down. What does make you feel good? I like having my family all home in the afternoon and weekends, but then I am in often stressed and trying to keep up. But when I'm home alone I get anxious and my mind starts going over various health related scenarios so I don't really find it peaceful to be home alone. This thread has become so quiet, I could really use some company so please feel free to chime in at any time. I just found some chocolate covered espresso beans, I think that might be a worthy distraction :)",
      "MessageIndex": 273,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 9, 2015 02:33PM starbrightlyshines wrote: Fujimama-Are you talking about Merchants? I am trying to think of which bakery it could be. Oh, it must be Walla Walla bread Co. They are good. We used to love to go to Merchants but they closed several years ago. Its nice to know you are four years out. I am a little over 2 but I still feel like most days are a struggle. And any extra little thing depletes my energy and pushes me over the edge emotionally. I am not dealing well with this winter, colds, flu, children graduating from college....:) I do hope they learn extra coping skills like you mentioned. Most of the time I feel like they are getting ripped off. Karz-the diary is a beautiful idea. I have bought several journals, but I never managed to get them started. It is so nice your mother was able to move in with you. My mother stayed with us for several months when I was first diagnosed and really helped all of us. I think it gave the kids a sense of consistency. Hoping you all have a day full of sunshine like we have here.",
      "MessageIndex": 388,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 5, 2015 12:37PM starbrightlyshines wrote: Thanks Patty, I think I get it now  :) I think I need to have my photos on the \"cloud\" or skydrive but I can figure that out, or find some on my computer. Hopefully I will post soon. Also, I have a thread on progression and rads, do you have any experience with radiation for progression? I have a apt in about 4 hours to discuss with my onc. My gut feeling has changed from rads only (which was my idea) to switching meds. So I am interested in hearing what he has to say.  ",
      "MessageIndex": 466,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 12, 2015 08:55PM starbrightlyshines wrote: Iamstronger-I have bought several journals but never started them. I just can't make myself do it. Same thing with organizing old photos or finally putting together the baby and school albums. I hope to get to a point where it isn't quite so emotionally painful, and then I will be able to do it. But not right now.",
      "MessageIndex": 479,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 24, 2016 06:26PM starbrightlyshines wrote: we tried counseling when dd 13 was 10. It was a disaster. My dd refused to speak at all to the counselor and turned her back toward her. The counselor then proceeded to talk to us as if I were about ready to die........I had to break in and repeat that my treatment was working, we just wanted a place to talk about things as a family. It was a total failure on all accounts and I am sure my dd will be reluctant to talk to another one in the future. I am sure there are good ones out there, I considered talking to the school counselor since dd changed schools and now none of the staff know about my diagnosis. But for now while things are ok I think we are just not bringing it up. If the kids have questions I will answer them, and they know I take meds and go to the dr every month. And I am no where as active as I used to be, but that has kind of become normal. It's a hard road anyway, but I worry so much about my children.",
      "MessageIndex": 600,
      "PostDate": "24/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Feb 8, 2015 04:15PM starbrightlyshines wrote: Patti-I also suffer with anxiety. It's not a new thing, I think I have had it all my life but I didn't know that it was a problem until I had a problem with panic attacks several years back. I also find Xanax helpful, but mostly for panic attacks because it is quick acting but also doesn't last as long as some other meds. Once I was diagnosed with cancer my onc put me on Ativan which has a long lasting effect. I still take Xanax on occasion, but usually rely more on the Ativan for the daily anxiety. Our bodies build up a tolerance to these meds over time so it can be helpful to change them once they aren't as effective as they once were. Other than meds, I find distraction helpful. But when I am in a big anxiety/panic cycle this can be really hard to find something. Exercise is good, I find yoga is so helpful, the benefits linger long after the work out. It's a gentle yoga class but I still find it so relaxing afterward. I also have a little humidifier that I put scented oils in and that can really lift my mood...peppermint, lavender, whatever appeals to you. Right now my family is all fighting colds/congestion and I am using eucalyptus oil. Sending you peaceful thoughts, this isn't an easy path we are on.",
      "MessageIndex": 10,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/828265",
      "Title": "anxiety patti4511 DivineMrsM"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 22, 2015 07:36PM starbrightlyshines wrote: HLB-I talked to my RO today. What he does is the same as Vero, it is just a different \"linear accelerator\".  I have a difficult time understanding all the radiology lingo, I was a medical technologist so I understand a lot, but this is a whole new area! I go in for my MRI next week to make sure I am a candidate for it.",
      "MessageIndex": 26,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831826",
      "Title": "Am I unreasonable? HLB HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 27, 2014 04:28PM starbrightlyshines wrote: I too was having problems with joint pain. Every morning when I got up I felt like the bones in my feet were shattering to pieces when I got out of bed. It would get better as the day progressed but it was hard to stay active when in so much pain. I have found Lyrica really helps with the pain. It isn't gone completely, but I don't get that extreme pain in the morning and I am more able to keep up an active lifestyle with yoga and normal things. Now it seems like pain at night is more of a problem. When I am busy all day my legs and hips seems to ache at night and it is hard to sleep. Ibuprofen and heat help, and I just recently was reminded about taking magnesium. I am going to see if that helps. But for me Lyrica really made a difference.  ",
      "MessageIndex": 8,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827182",
      "Title": "Hit by a Train AmyQ AmyQ"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 31, 2014 11:34PM starbrightlyshines wrote: Thank you DivineMrsM -as so often happens,  I come back after posting wondreing how I came across. I did read your post and appreciated how honest and forthcoming you were. I coulld easily imagine the situations you spoke of. That is what I need, the feeling of sitting down and discussing over coffee how we are all coping. As women I feelnlike we carry such a huge responsibilitity to set the tone of family life. I want to do that in a positive way. But what I want......and where I am at are not the same. But my pjs are cute :) Its just the guilt I deal with more than anyting. And handin hand with the guilt is resentment. Not something I would think of myself. I dont like it.",
      "MessageIndex": 2,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827287",
      "Title": "No counseling available at the cancer center this week? Crazy?! starbrightlyshines starbrightlyshines"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Aug 24, 2013 01:42AM starbrightlyshines wrote: I have bone mets as well as mets to GI tract. After several months of treatment the pain is slight and able to be well managed with meds. Sending good thoughts your way.",
      "MessageIndex": 4,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809811",
      "Title": "More cancer found. tasha_111 Padiddle"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 8, 2014 03:15PM starbrightlyshines wrote: Thank you Kjones for starting this thread, it has beeen something I had been thinking about doing for months. I am good at procrastination :) Itis spring break week here so I am busy trying to entertain my 6, 11, and 14 yo. My 17 yo is off with her friend's family on a sunny vacation trip. I have to confess it seems like so many people are on vacation trips I am feeling kind of depressed. I am dealing with fatigue and foggy thinking so it is hard to be the mom I want to be. I am trying to figure out which med is making me feel so crappy. I am hoping it is a med and not a new sign of cancer spreading somewhere. Will we ever get to a point where that's not constantly on our minds?  So a big hello to everyone here. I haven't read all your posts, it is noon and I am still in my pj's so I need to get up and get the day started,  Lol! ",
      "MessageIndex": 29,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 13, 2014 11:12PM - edited Apr 21, 2014 05:45PM by starbrightlyshines",
      "MessageIndex": 46,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Sep 9, 2014 01:57PM starbrightlyshines wrote: Wow Raro, that is so true! And it does take the pressure off. I often feel like since I have this \"time\" living with this illness that I need to have all the things done that you mentioned....letters written, papers, passwords etc. But my sentimental side takes over and I become an emotional mess. It is important just to be present daily, and be there for them. What gets done, gets done, and hopefully the memories made will be prominent in their minds. Tilda-I love the cookbook idea. Even just writing down my simple recipes (like my chicken soup) might be really cool. I am the person with one million fun projects to do.........it's just the actual \"doing\" that I find hard to do! Well this afternoon I have my regular monthy Dr. appt.  I wonder if I will ever get to a place where I don't dread this monthly visit? It's like I wait in fear to hear what my tumor markers are, and then hopefully breathe a sigh of relief only to repeat the process a month later.",
      "MessageIndex": 268,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Mar 24, 2015 08:18PM starbrightlyshines wrote: kjones-Thank you for the pictures of your children, they are adorable! I often feel the way you describe, I feel like my 7 year old son and all my children, are the reasons why I am still on earth. I am sorry about the loss of your friend. Sometimes the sadness is just seems unbearable, but somehow we manage to muddle through. Sorry ladies, I will post more later. I think of all of you often, it is hard to come here sometimes. I just had a minute before dinner is done so I wanted to check in. I didn't want to read your posts without responding.",
      "MessageIndex": 410,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Apr 17, 2015 05:22PM starbrightlyshines wrote: Hi all, it is a sunny day here, makes me think I should do some yard work but I am sitting inside with laundry still from our vacation. Why is that vacations can be so much fun but life seems twice as busy once you return? I seriously thought I had readjusted my attitude a bit over the break. I thought I could just take life more simply and not stress about things as much...........it sounded good while I was sitting on the beach, but once I am home I become quickly overwhelmed. Am I the only one who struggles with this? I feel like my house is too much, my yard is too much, friendships are too much, I feel like I need a break which is laughable since I just had a great getaway with my family. I guess I still kind of feel like I am on the fringes of a normal life. Half in, half out. It's not a good place to be. I think I just haven't found the right kind of support yet. Maybe it's the feeling of living from month to month of Dr's visits. I don't know, I wish someone could tell me. Anyway I hope you all have a good weekend ahead! I'll be headed out the door to pick up my kids from school and I think that should help improve my mood. I am debating on asking for an antidepressant. I have been resistant to the idea because I didn't feel like I really needed it, and I hate to add one more med to the mix. I am so indecisive!",
      "MessageIndex": 442,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 3, 2015 06:09PM starbrightlyshines wrote: Susan- I love the pictures too! It is so nice to put faces all of you here and see photos of your family. I would post a pic but I don't know how. Too bad I can't to it directly from my iPhone because that is about all I can do. I hear you on the teenage boy. My son is almost 16 and has his first girlfriend and is all of a sudden pushing all the boundaries and seems mad at me all the time. It is really hard to be a strong parent when you don't feel strong, and because of this disease I am so find myself giving in more than I would normally do. And I know in the long run that is not doing anyone any favors. I am glad to see you were diagnosed several years ago, that gives us all hope! I am 2 1/2 years in.......hoping for many more! Kahlua-the beginning diagnosis is such a shock. I think I cried almost daily for the first year or so. I don't want to say it gets better with time, but in a way it does. Once you get started on a treatment plan and see all the women here who have been here for years, it really helps. I didn't realize a Stage IV diagnosis meant treating it like a marathon, not a sprint. Once I understood that analogy, and that it can be treated like a chronic condition, that helped change my perspective a bit. My youngest son was just 4 when I was diagnosed, he had just started preschool, and my oldest daughter was a senior in high school (plus 3 others in between :) ). I could not believe it was happening to me. I was diagnosed because of severe stomach pains that sent me to the ER, several days later I came home diagnosed with MBC. I thought I was healthy until then! But almost overnight I couldn't keep any food down and quickly lost 25 lbs. It was really scary. But after chemo and tamoxifen the mets shrunk and I improved. So there is hope, a lot of of it. You can PM me anytime to talk, sometimes it is just a matter of putting one foot in front of the other and just moving forward. Distraction helps, and so do anti-anxiety meds. MamaRay-sending you hugs. The emotional aspects are so hard. I am 2 1/2 years in and so grateful for each milestone with my family. My daughter just had her senior prom and we are deep in the middle of high school graduation plans. Everytime I get sentimental about her graduating, I just remember how I felt when I was diagnosed and it just makes me happy to be here to see it. My youngest son was 4 when I was diagnosed, he just turned 7. When I get overwhelmed by things I tell myself to just concentrate on this day. I can handle this day. I find I can handle today, and I'll worry about tomorrow, tomorrow. I also put things off if I get overwhelmed.  Sometimes just giving myself a pass on returning a phone call or scheduling something until the next day really helps. And when I have a really bad day I will just give myself some quiet time in my room to watch Netfix (just a distraction I know, but sometimes I just have to give my mind a break). My children have kind of learned a new kind of normal at home, and although I wouldn't wish for it, it works somehow. At least for today. This is a crazy month so I am not looking too far in the future. Sending hugs to all of you mamas!  ",
      "MessageIndex": 458,
      "PostDate": "03/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 22, 2015 01:33PM starbrightlyshines wrote: Sending warm wished and hugs to all you mamas! I just typed out a post and tried to go back a page to make sure I didn't miss anyone and the darn thing got deleted! So I just wanted to tell you all I know this is a sucky thing to have cancer around the holidays. I try so hard to live in the moment and just immerse myself in the \"warm fuzzy\" holidays, even if I don't feel that way. I am just doing all I can to keep my mood up. Friday I walked around Walmart humming Christmas carols because I was so cranky and I was not in the Christmas spirit at all! And it helped a bit! I wish I could respond to all of you but my computer time is up. Wishing you all a great day :) ",
      "MessageIndex": 583,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Dec 20, 2013 04:26PM starbrightlyshines wrote: I take Ativan on an as needed basis. It usually seems like I take it most days, but then I will have several days in a row when I dont. It works well when I can feel the anxiety building, or when I get overwhemed emotionally, or even if I just cant sleep. It doesnt make me sleepy like Xanax does, and I cant really feel it taking effect. It just kind of evens everything out and makes me feel like I can cope. Sometimes I can find it hard to go out to normal things, like my sons basketball games, and it really helps me feel like I am normal again.",
      "MessageIndex": 10,
      "PostDate": "20/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/815970",
      "Title": "\"as-needed\" happy pill? kebab Loveforlife"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 3, 2015 12:05PM starbrightlyshines wrote: Oh, and at the risk of repeating myself, I am in a similar situation. I have a lesion on my spine (progression) that we are going to radiate. Then MO said I could stay on Femara and moniter Tumor markers and PET scan to see how the Femara is doing. He said the lesion on the spine is evidence Femara was failing, but he wasn't in a big hurry to change meds because I am doing so well on it. He did say some doc would change right away. I think he could go either way if I felt strongly. I am wavering. I would like to have a great summer with my kids feeling good. But I also don't want to give the cancer time to advance to another organ or flare up. So how do you weigh those 2 options? I feel like no one knows. And the next step he says is A/A, not Flasodex which I was trying to bring up. And my specialist in Seattle also says A/A. So I guess maybe we can hold Faslodex in reserve for when we need it, and think of it that way?",
      "MessageIndex": 28,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831505",
      "Title": "faslodex v arimidex/aromasin doc changd mind mid appt. intothewoods HLB"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 22, 2013 01:43PM starbrightlyshines wrote: I love, love , love the attitude here ladies! It is so much easier to cope with this crap when I can see what good company I am in!",
      "MessageIndex": 27,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806510",
      "Title": "Bucked Off Already? dbla"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 30, 2013 01:42PM starbrightlyshines wrote: Latte-I want to do something similar but I haven't gotten started yet. I have 5 children ages 18, 16, 14, 10 and 5. My plan was to each of them a box. I wanted to put in their baby blanket, a childhood outfit, etc. Things from their past with hopefully alittle note attached. But then I wanted to add thing for the future. We gave my oldest dd a birthstone ring for her 18th birthday. So my plan is to get a ring for my other two daughters, wrap them up and put it into the box with a note for their 18th birthdays. For my daughter who isnow 10 I would like to get her something special for her 13th birthday, I just haven't come up with what exactly yet.I also want to put in letters for graduations, special occasions etc. I'd like a mix of tangible items they can touch as well as letters. I am having a harder time thinking of gifts for my sons (ages 5 and 14) than the girls, so I woukd welcome suggestions! I also bought a book called Memories from my mother, or something like that. I actually have 2 different ones. They ask questions about my childhood, meeting my husband, my parents lives etc.I thought it was important to have all those things written down because I have forgotten many things my grandmother told me about herself even though we were close and had many conversations. This is something you could even do with a friend helping you if the writing were difficult. I dont have my photos in up to date andin order and that is something that really bothers me. Baby books and school books are the same way. My plan is to really get going on them once school starts......I am far too busy living in the moment, enjoying every last bit of summer that I can to do them now. But it will be a huge relief to have them done and I think that sense of accomplishment is something I can look forward to motivate me. I tend to be a procrastinator, partly because I am always afraid I wont be happy with the end result. But my new motto is \"Done is better than perfect\" and I am making a conscious effort to live this. Maybe we could make a new thread for exchanging ideas and motivating each other? I would think there are others who are in the same situation. This is such a difficult time. I saw a social worker at my cancer center who strongly encouraged this when I brought it up. But I do better with things when I can talk them through and sharer the accomplishment of getting a step done here and there. And I really dont have anyone in real life who gets why its important to do this.......they look at me with a pained expression and tell me I dont need to worry about it right, that I should be thinking positive. But I know myself and doing these things for my children is positive and will make me feel better knowing I have left them good memories. Please forgive the typos....I still have a hard time typing frommy tablet!",
      "MessageIndex": 16,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808524",
      "Title": "Memory box - what to put in it? Latte DivineMrsM"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jun 12, 2013 04:55PM starbrightlyshines wrote: Sending you hugs Marsha. I pray for a treatment your Dr has overlooked. God bless you, I feel like we are all in this together.",
      "MessageIndex": 11,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/806021",
      "Title": "out of options onedayatatime NickyJ"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Nov 30, 2015 06:28PM starbrightlyshines wrote: Torridon-Three years ago I was diagnosed with mets to my GI tract and bones. I went to the ER one night for stomach cramps, was admitted, and came home several days later with a Stage IV diagnosis. I was so sick. I know very well how miserable it is. My youngest son was only 4 at the time, I had 5 children at home. My oldest was a senior in high school. Right away I asked for something to help me with the anxiety because as a mom with children, out thoughts are always on them and it was heartbreaking. So please, ask for some Ativan or something, not only is it physically hard to be so sick but emotionally it is so stressful and you need to be able to rest as much as possible while you are trying to get well. At this point my body couldn't digest food and I lost a lot of weight. I had a PICC line put in and did TPN, it is like getting IV nutrition but gives your digestive tract a break. I was doing chemo and taking Tamoxifen so the TPN kept me alive while the chemo and tamox went to work killing off the cancer cells. It was right after Thanksgiving and I was in the hospital for several days. It was such a low point, please listen to me and know that I was right where you are. I was so scared and didn't know one single person who had Stage IV cancer, I had no idea what was going to happen or that people could live years with this condition. Here I am three years later and so much better than I was back then. My youngest son is now 7. Hugs and more hugs to you. Keep us updated. I hope you are feeling better as I am typing this.",
      "MessageIndex": 8,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/837147",
      "Title": "sub acute bowel obstruction- please help Torridon Bestbird"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 26, 2015 10:44AM starbrightlyshines wrote: I was so sick at diagnosis that I was home bound for about 6 months, so most people at my children's school knew about it. They organized meals for several months and lot of people sent me cards just letting my know they were thinking of me. Fast forward to present day, two years later. I am not sure who knows and who doesn't know in my son's first grade class. I don't look like I have cancer, but I struggle with energy everyday. I don't keep cancer a secret but I don't bring it up either. Well, usually. Last week I had a converstion with a new friend who has MS. So I brought up my situation. There was only one other person present, but now I am regretting it. I am an open, friendly person and I think that I just need to live my life as me, not letting cancer define me. But I am afraid of people looking at me and seeing \"cancer\". It is a hard line to define.",
      "MessageIndex": 34,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 22, 2015 05:39PM starbrightlyshines wrote: Lynn-I totally wish we had a stage IV group here, or at least somewhere close. I tried an \"advanced Cancer\" group but it spanned all kinds of cancer (breast, lung, pancreatic) and many members never had the kind of treatment options we have so the group kind of dissipated.",
      "MessageIndex": 12,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "May 22, 2015 12:55PM starbrightlyshines wrote: I am always so glad to hear others going through the same things that I do. I honestly feel like an outcast at times. I am not really comfortable around my old \"groups\" even though everyone seems to be understanding I get so frustrated because their daily lives are so different from mine. I hate the way some things have gotten to be routine around my house. I used to be a good cook, now I rarely cook dinner and meal times are a very stressful time of day for me. The kids have gotten used to doing their own laundry, but other things just slide by.....vacuuming, dusting, ha ha.  I am embarrassed by it. I do find myself withdrawing, and I don't think that is really the healthy response. Like other, I find it easier to deal with people on a one to one basis, rather than large groups. I don't know, I had a long post written in my head and now I am kind of emotionally drained. It has been a crazy week at my house, the end of the school is in 2 weeks and one of my daughters will be graduating. We are hosting a party, I told myself I was not going to stress out about it, but I already am! I feel like I am going to by on display, as well as my home.",
      "MessageIndex": 8,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831603",
      "Title": "Anyone else need to vent? Rseman NYCchutzpah"
    },
    {
      "AuthorID": "starbrightl…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180162/profile",
      "Content": "Jul 17, 2015 05:16PM starbrightlyshines wrote: Bump, I am trying 3:00 today.",
      "MessageIndex": 1,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/833460",
      "Title": "Afinitor-what time of day do/did you take it? starbrightlyshines starbrightlyshines"
    }
  ]
}