{
  "AuthorID": "Starlen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236625/profile",
  "Posts": [{
    "AuthorID": "Starlen",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/236625/profile",
    "Content": "Starlen wrote: Hi ladies. I guess I am just looking for like minded people, possibly going through similar experiences. I had my annual GYN appointment a couple of weeks ago, and she felt a lump in my left breast that concerned her enough to order a sonogram and a mammogram. I cried and worried my way through two days waiting for those. They opted to do the sonogram first, because of my age, and then the mammogram if they found something concerning. They didn't. But the problem is, they didn't find anything at all. So I have a lump we can feel, but couldn't visualize. I left not feeling any better. I finally caught up with my doctor after a week or so of waiting for the report to come in and playing phone tag. She wasn't happy that I didn't get the mammogram, and wants to send me for a second opinion. So now I am waiting to et in and see a breast surgeon. I currently have a mammogram scheduled on the 19th and an appointment scheduled on the 24th. Emotionally, I feel like I can't function right now. All I can think about is the worst case scenario. I just had a baby in December. I keep reading that postpartum breast cancer is usually aggressive. All I can think about is that I don't want my baby to have to grow up without her mommy. I am also getting married in October. I feel like my life was just starting to fall into place, and now there is a chance it will be falling apart too. I am 33 years old. I know that \"80% of lumps are benign\", but I just had a sister (not biological), who passed away in April after a 2 year battle with breast cancer. I have seen that other 20%. Everybody tells me not to worry, but it's it's so much easier said than done. :( Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "26/07/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/846342",
    "Title": "GYN found a lump. Can't control anxiety. :( Starlen Moderators"
  }]
}