{
  "AuthorID": "stavmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
  "Posts": [
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Jan 18, 2009 10:01PM stavmom wrote: For the breast MRI, your head really isn't that deep into the tube.  But here's my trick for handling MRI's, and I've had a LOT:  Always keep your eyes closed, starting before they start rolling you in.  Under NO circumstances do you EVER open your eyes!  That, and a Xanax always helps.  Good luck!",
      "MessageIndex": 2,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/726771",
      "Title": "Open MRI Brenda79 samiam40A"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Sep 16, 2008 07:27PM stavmom wrote: Well, you probably don't want to hear from me, but I will be honest. I had the bolus every day of my 6-week treatment, and after about 4 or so weeks into it, I started to burn.  By the time I was done, I had open, bleeding wounds over about 75% of the treated area.  I used the silver cream & aquaphor several times a day.  I am 3 1/2 weeks out and still scabbing - but healing finally. I am fair skinned.  The pain was bad, but meds helped.  The fatigue is bad too, but every day is different. I'm glad other people have better experiences with rads.  I didn't know the bolus made it worse. They kept telling me whatever I go through is what I have to do to save my life. ",
      "MessageIndex": 8,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720961",
      "Title": "Anyone use BOLUS embmom EmilyJane"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Apr 13, 2008 11:30PM stavmom wrote: I do not want to scare anyone, but do want to say what happened to me so you can be prepared for the possibility...after my unlitateral DIEP I was on a breathing tube for 24 hours in the ICU.  This was NOT FUN!  Luckily I have done quite a bit of scuba diving, and I used that mental breathing tool to cope.  I was sedated most of the time, but while awake, I consciously worked hard at breathing calmly thru the tube.  Sometimes the tube got clogged with mucus and I had to write on a notepad asking them to suction me.  It was scary, but I did get through it. I feel so thankful my mom was there to watch out for me. After the tube came out, I did have problems with nausea, but each time they immediately injected my IV before I could vomit (a big fear for me because of the type of surgery), and it never happened.  ",
      "MessageIndex": 36,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Apr 12, 2008 11:18AM stavmom wrote: Hello, have to add my tale of DCIS woe... I was originally dx'd with a benign cyst that ended up having an unclean margin of high-grade comedo DCIS when they finally took it out.  After 2 mammos (one mag-view) & MRI at a cancer center, they told me it involved 1/3 of my breast, which automatically made it a gonner.  Because of my low back problems, I chose DIEP reconstruction and hoped that would be the end of my BC story.   Not so though, because it turned out after mastectomy & SNL biopsy that DCIS was in 3/4 of breast and had turned into 2 invasive areas, 1 that traveled to a node.  NONE OF THIS WAS LARGE ENOUGH TO FEEL, nor was any of it visible on their high-tech imaging.  They couldn't even tell it was there during the surgical pathology.  Unfortunately, the DCIS was too close to my skin so that even after my mastectomy and chemo, I will need 6 wks of radiation.  I won't get my nipple for another year, probably, and nobody knows how my shape will change from radiation.  I can answer any questions about the DIEP surgery so far, though it's only been 2 months.  Although my girls aren't twins anymore, I do feel very blessed I got at least semi-reconstructed.     ",
      "MessageIndex": 25,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703581",
      "Title": "MASTECTOMY FOR DCIS thetrumumshow Noni"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Nov 12, 2012 02:01PM stavmom wrote: \"You look great!  I hate when you see cancer patients and they're all shriveled up and dying.\" No joke.",
      "MessageIndex": 404,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Apr 5, 2008 07:40PM - edited Apr 6, 2008 10:33AM by stavmom Hello. This is my first post. I'm starting chemo April 9th.  I just turned 40 in February. I had a cyst for years that they finally started aspirating last year (2 u/s's in previous years showed no evidence of CA). Cyst kept coming back, they assured me it was \"normal\" but I could get it removed if I wanted.  Since I had to have my last leg screw removed from a severe knee ski injury last Jan., I decided to have it done at the same time.  Turned out \"innocent cyst\" had DCIS with positive margins. DCIS turned out to be too extensive to save the breast. Mastectomy & DIEP were done in Feb, 9 nodes removed. 1 wk at hospital, 4 days in ICU.  At hospital I was told all was great, no invasive areas. 2 weeks later, pathology confirmed DIEP was in 3/4 of breast, not 1/3, 1 area of microinvasive, 1 area of complete invasive, too close to skin so I will need 6 weeks of rads, but chemo 1st because it's in a node too.  It's been one surprise after another. At first I was told I'd have 6 sessions of TAC, then tamoxifen, then the onco called later that day and said he wanted an Oncotype DX 1st, and if it was low he would \"support me\" if I'd skip chemo. That was scary, putting that option on my shoulders! I ended up telling him no, I have 2 young kids, and even if chemo helps 1%, I want to be in that 1%.  That was on a strong day.  Turned out Oncotype was 20, so it's out of my hands. Even so, he changed my treatment to just 4 sessions of Taxotere & Cytoxan, then tamoxifen (checking out that thread too). Neulasta shots to follow 24 hrs after each treatment, so I will be spending those nights near the hospital.  I also have scrips for decadron, compazine, & zofran ready to go. I also had a port put in yesterday.  Sometimes I feel strong, and other times I feel exactly the opposite.  But I just thought I'd join you ladies to get some support from people going through chemo at the same time.  All along this has been by far the best website out there for information, and a great support group.  ",
      "MessageIndex": 96,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "stavmom wrote: So I have to have surgery on the elbow of my good arm, and in discussing the procedure, the surgeon said the IV & BP would go on my mastecomy side.  He told me that it is NOT TRUE that procedures like IV & blood draws will cause lymphedema, that studies have shown it to be unrelated.  I don't want to question his knowledge to his face, but really??  I have had lymphedema before in that arm and it totally sux.  Would one little IV really do it?  One little blood draw?  I guess I don't really understand. DX: 12/11/07; DCIS 4cm, mast & DIEP recon; then found LCIS & IDC .8 cm in path, Node 1/9 ER+ PR- HER2-; TC & rads, Oncotype 20, total hyster 2009. Back on tamox after trying the 3 A/I's. May 2012 - retroactively dx Stage IV bone mets since '06. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/769738",
      "Title": "My arm surgeon stavmom stavmom"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Jun 2, 2011 11:04AM stavmom wrote: Wow ladies....thank you SO much for taking the time to respond.  Such great info, and thank you especially for the links, Kira & Sisterinspirit.  I will check it out.  I had to have an IV in my foot last year, and boy did that hurt.  Not looking forward to this at all! ",
      "MessageIndex": 7,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/769738",
      "Title": "My arm surgeon stavmom stavmom"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "stavmom wrote: So I have had a terrible pain in my hip for months.  I finally had an Xray, and it showed a 6mm radiolucent lesion on my femoral head.  Radiologist suggested a lytic met.  To follow up I had a bone scan, which was clear! (yay!)  But since the pain is so bad and getting worse (feels like a broken bone), I am now set to get an MRI in a few days.  But I'm curious.  I have read articles where mets show up on bone scan but not Xray, but is it common the other way around?  What else could this thing be? DX: 12/11/07; DCIS 4cm, mast & DIEP recon; then found LCIS & IDC .8 cm in path, Node 1/9 ER+ PR- HER2-; TC & rads, Oncotype 20, total hyster 2009. Back on tamox after trying the 3 A/I's. May 2012 - retroactively dx Stage IV bone mets since '06. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/759841",
      "Title": "Lytic lesion on Xray, but not bone scan stavmom GoldenGirls"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Apr 12, 2008 03:42AM stavmom wrote: Noelle, good luck with your hair too.  I've been thinking about you.  The little one who gets your gorgeous curly locks will be one lucky recipient.  And I'm sorry, but dang it if I can't get that song out of my head every time I read your posts.  It always makes me cry. I love it tho!   :-)",
      "MessageIndex": 199,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Jun 5, 2011 02:25PM stavmom wrote: Thank you so much for everyone's support and ideas!  Asking for lidocaine hadn't even occured to me, nor a peds IV.  I'm not so sure I want to use this surgeon anymore.  Last week the lab had to poke me 7 times over 2 days just to draw a tube of blood (my blood is \"thick\" - ???) and my veins are so scarred and squirrely now. They were about to call for an arterial stick (anyone had one? is it truly awful?), and I was practically begging them just to try my LE arm instead, but they insisted they can't do that.  Thanks to everyone here, I feel SO MUCH more informed, with the courage to stand up for my needs.  You ladies rock.",
      "MessageIndex": 16,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/769738",
      "Title": "My arm surgeon stavmom stavmom"
    },
    {
      "AuthorID": "stavmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65269/profile",
      "Content": "Apr 6, 2008 10:31AM - edited Apr 6, 2008 10:33AM by stavmom Cinlee, please tell me your coffee was wonderful.  That's another thing I've been wondering about!",
      "MessageIndex": 103,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    }
  ]
}