{
  "AuthorID": "steeleamelia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115553/profile",
  "Posts": [
    {
      "AuthorID": "steeleamelia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115553/profile",
      "Content": "steeleamelia wrote: When I was first diagnosed it was such a whirlwind with a lot of twist and turns: -felt lump -had biopsy- path said not cancer -3 days later radiologist did not agree w/ path sent me for 2nd opinion -2nd opinion and 2nd opinion came up positive -after, MRI, CT and PET scan was thought had spread to lungs - had R middle lobecotomy-lung surgery- pathology came back negative to EVERYONE's surprise -bilateral mastectomy, hysterectomy 6 rounds of chemo -then had repeat chest CT- should more lesions and positive PET scan -Oncologist not worried, Pulmonary doc not to concerned by original path report but I just cannot shake the feeling that this may be metastatic cancer! What to do? Am I crazy or just obsessing? Kelly Dx 12/3/2010, IDC, 2cm, Stage II, Grade 2, 0/0 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/778065",
      "Title": "Unable to get it out of my head!! steeleamelia chrissyb"
    },
    {
      "AuthorID": "steeleamelia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/115553/profile",
      "Content": "steeleamelia wrote: Hello All- I have recently been dx with stage 1 invasive ductal carcinoma- last week! So thankful for those private moments- to check the girls I was very confident with my decision to have the mastectomy but for some reason the last 2 days I have been second guessing myself. I am 40 y/o a wonderful husband, 2 amazing kids, I am very active with work, kids, fundraisers and you name it. I meet with the plastic surgeon next week and I have a list of questions. I know myself well enough to know that I do not want to go through this or put my family thru this again but my husband is very concerned how I would truly handle the mastectomy vs. Lumpectomy. I am very strong and know I can handle this journey but I just dont know what to do!!! He loves me so much and says the decision is mine all he wants is his wife healthy and to around for many years (he is a sweetie) Any insight would be greatly appreciated!   It is truly amazing also that how once you get the dx you immediately start with BA memory loss Kelly Dx 12/3/2010, IDC, 2cm, Stage II, Grade 2, 0/0 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/761891",
      "Title": "New DX- Trying to decide- Please help! steeleamelia momand2kids"
    }
  ]
}