{
  "AuthorID": "steffief",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
  "Posts": [
    {
      "AuthorID": "steffief",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
      "Content": "Sep 5, 2011 06:06PM steffief wrote: I don't post a lot but this topic causes most of my stress. My family especially my mother does not understand. We had a nice lunch out today, I ate unhealthy food so I mentioned to my mother how I needed to stop eating. She then says that for exercise I can go down to my pool and move around. I then said I did not need to be in the sun. So she said I could put on sunscreen. Like I want to be in front of people in a bathing suit! Like I can put sunscreen on myself! I live in Houston where it has been over 100 degrees for over a month and I live in long sleeves or 3/4 sleeves with my hand in pocket to hide it. My left hand is so fibrotic (I think this is correct term) that it is hard to do a bunch of things. I have to wear ugly clothes and I am ashamed every day. I work in a professional environment and have to type one handed and don't want anybody to see me. I can deal with the cancer (NED for 3 1/2 years since diagnosis) but the LE gets the best of me. Thanks for letting me vent. My mother actually made me cry and she does not even know it. In her defense, she has been the best mom ever taking care of me through chemo and many surgeries. I could not have done it without her. I know I should be grateful to be alive and I am. I guess what makes me angry was that about three weeks after my mastectomy I was mowing the lawn and I believe that is what started it all! Best wishes to you all.",
      "MessageIndex": 2,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/774250",
      "Title": "huband let me know what it's like to be the LE spouse cookiegal inspiewriter"
    },
    {
      "AuthorID": "steffief",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
      "Content": "Jan 29, 2012 07:54PM steffief wrote: Congrats! Yesterday was my four year anniversary since mastectomy and today is my 16 year work anniversary. I have been using these excuses all weekend to eat bad and have a drink. I hope you have many more years to come.",
      "MessageIndex": 9,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781814",
      "Title": "2 Year Cancerversary! jdootoo Gitane"
    },
    {
      "AuthorID": "steffief",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
      "Content": "Jan 22, 2010 01:56AM steffief wrote: I have been on monthly Zometa for 14 months.  I just had my checkup with my oncologist on Jan 4th at MDA.  I asked him about doing it less often and he agreed to go to every 3 months so I am happy.  I only had a single met to my sternum when diagnosed with BC and I had a sternum resection.  To my knowledge I have no cancer anywhere.",
      "MessageIndex": 6,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747095",
      "Title": "Zometa/question of my own Marybe Irina"
    },
    {
      "AuthorID": "steffief",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
      "Content": "Aug 13, 2009 10:00PM steffief wrote: Binney, I was so excited to see a reply to my posting.  I am doing fine, thanks.  Last year was treatment all yehar long and this year no treatment just monthly Zometa infusions.   I am being treated at MD Anderson in Houston where I live and I love my doctor.  For some reason I am more depressed now than I was when I was first diagnosed.  I am 45 years old.  I have been addicted to this site for the past week and spend every night on it.  It is comforting to see that I am not alone.  I think my mother is in denial about my cancer and I cannot talk to her easily.  She is great though, she went to every chemo session and any doctor appts I want her to come with me. The hardest part for me is wearing my compression glove every day and basically feeling like a freak.  I get very anxious being in public and have limited the things I do.  I have neuropathy in my feet and hot flashes from the Tamoxifen but I can't really complain.  Thanks for the links, I have already found some useful information. ",
      "MessageIndex": 10,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700318",
      "Title": "sternum removal due to recurrence POOVEY MapleTree"
    },
    {
      "AuthorID": "steffief",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87686/profile",
      "Content": "Aug 12, 2009 12:54PM steffief wrote: I had a sternum resection last September and still have an uncomfortable feeling in my chest. I also had radiation to the left breast area and chest wall so this may be part of the uncomfortable feeling too. I was diagnosed in Jan 08 with BC in left breast and the spot on my sternum showed up then. I had 12 weekly Taxols, 3 rounds of FAC. I then had the sternum surgery and a month after that I had 6 weeks of radiation. I have lymphedema in my left arm and my left hand is pretty non-functional. This is my first time replying to a post so forgive me if I have not done it properly.",
      "MessageIndex": 8,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700318",
      "Title": "sternum removal due to recurrence POOVEY MapleTree"
    }
  ]
}