{
  "AuthorID": "StellaBella…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
  "Posts": [
    {
      "AuthorID": "StellaBella…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
      "Content": "May 12, 2011 12:33AM StellaBella wrote: Thanks DivaMimi. I'm sure your husband understands that you're stressed out about next week. I'll be thinking of you and will post later to let you all know how I got on. Good luck!",
      "MessageIndex": 9,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768828",
      "Title": "Ultrasound and mammogram tomorrow StellaBella Bluebell70"
    },
    {
      "AuthorID": "StellaBella…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
      "Content": "May 11, 2011 02:23PM StellaBella wrote:",
      "MessageIndex": 3,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768828",
      "Title": "Ultrasound and mammogram tomorrow StellaBella Bluebell70"
    },
    {
      "AuthorID": "StellaBella…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
      "Content": "May 11, 2011 03:20PM StellaBella wrote: Hi Bluebell70, It's nice to hear from someone in the same situation (although wouldn't wish it on you)- we know the odds are on our side but that little voice of doom still manages to sneak in! I'm sorry this is putting a damper on the excitement of your upcoming wedding- hopefully tomorrow you will have your mind put at rest and then what a celebration it will be! I watched a movie too, just to have something else to focus on, and took the dog for a walk which helped. Tomorrow night there will be wine and cake regardless of whether results are in....just for getting the appointments over with! I'll be thinking of you tomorrow and really hope your focus will be fully back on the wedding by Friday- Sending positive vibes your way!",
      "MessageIndex": 6,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768828",
      "Title": "Ultrasound and mammogram tomorrow StellaBella Bluebell70"
    },
    {
      "AuthorID": "StellaBella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
      "Content": "StellaBella wrote: I felt a small lump in my breast a while ago- ironically enough breast cancer is my field of work (not a doctor), so I knew enough to wait through a menstrual cycles to see if it disappeared or was just related to my cycle....I'm a bit lumpy and bumpy anyway! I mentioned it to my GP on Friday ...almost in passing really....and after examining me she said to be on the safe side she would refer me on. Then I got a call on Monday when they got the letter (that was fast!) to schedule an appointment for Thursday. Then another call later in the day to say I would go for an ultrasound AND mammogram first, then see the doc. I know how lucky I am to get these appointments so quickly so am definitely not complaining, but I'm a bit freaked out now. I know if it's anything at all it's likely a fibroadenoma. I know all the stats and I'm still suddenly really worried. I'm 35, have no primary family history (i.e. Mom/sisters), but three of my cousins had premenopausal breast cancer....and one passed away from the disease. I haven't told anoyone at all about this for that reason- have a very close family and we've lost a lot of loved ones to cancer in the past couple of years so there's no point in them worrying about something that will probaby be nothing. I just have to keep my head on straight for one day and know I'm overthinking it. I have small breasts so don't even know how they'll manage to do a mammogram, and even though my GP felt the lump I'm afraid the doc will say there's nothing there and think I'm a time waster- these are the crazy things I'm thining about! I feel better just for writing it all down though so thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768828",
      "Title": "Ultrasound and mammogram tomorrow StellaBella Bluebell70"
    },
    {
      "AuthorID": "StellaBella…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/129039/profile",
      "Content": "May 12, 2011 08:01AM StellaBella wrote:",
      "MessageIndex": 10,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/768828",
      "Title": "Ultrasound and mammogram tomorrow StellaBella Bluebell70"
    }
  ]
}