{
  "AuthorID": "Stephanie44…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228158/profile",
  "Posts": [
    {
      "AuthorID": "Stephanie44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228158/profile",
      "Content": "Feb 9, 2016 05:25AM Stephanie44 wrote: Wow!! Thank you all that respond to my message, I really appreciate all you guys words. She's actually really calm but I'm the one that is all sad and looking for solutions and answers. She's actually getting her biopsy tomorrow Tuesday. I will keep you all posted on the results. I still have hope that is not Stage IV... Warm Regards, Stephanie",
      "MessageIndex": 3367,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Stephanie44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228158/profile",
      "Content": "Feb 3, 2016 04:45AM Stephanie44 wrote: Hi Everyone, I have been reading a lots of information about this on the internet and I don't find an answer for this. I guess I just want to have some hope! My aunt went to the doctor yesterday to do a mammogram because she was having pain in her breast for a long time ago. She is the type of person that will not go the doctors unless she feel like she need to. After the visit we found out that she have breast cancer stage IV. How can she know and be diagnosed with breast cancer stage IV without a biopsy? If this can be possible? Please Im so confuse and at the same time so sad and depress couldnt sleep last night thinking on this. My aunt is like my second mother this is very hard!! Any information that you can provide will be greatly appreciate! Sincerely, Stephanie",
      "MessageIndex": 3362,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Stephanie44…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/228158/profile",
      "Content": "Feb 9, 2016 08:13AM Stephanie44 wrote: Hi Mamiya, They did a Mammogram and sonomammogram the lymph nodes were enlarge and it looks like it spreading on the left side breast. ",
      "MessageIndex": 3369,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}