{
  "AuthorID": "stevemorse",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
  "Posts": [
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 12, 2008 04:50AM stevemorse wrote: this came out wrong, last few sentences I meant I hope after the MRI, they dont make me go again for the biopsy.  I just feel like I am not getting any answers and I am so scared.  I am more afraid of the biospy for some strange reason.  This really rots, I wish I was like everyone else see you next year but my first one turns into this 3 time worry trip!!!",
      "MessageIndex": 1,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "stevemorse wrote: Hi, I am new here and somehow I guess am so nervous I can't get rid of this crazy type.  Well I am 41, and just had my first Mammo last week.  They took only 4 pictures, then of course told me I probably would be coming back for more pictures.  Now this is the first thing that pissed me off, why don't you just do them there and now!!   So I go back today, they take alot more pictures and find in my right breast something so they give me an ultrasound.  The tech then says to me let me get the Doctor to do the Ultrasound too and take a look.  Now I am panicing and kinda pissed off, like this is my first mammo can someone tell me what the hell they see!!!!  So radiologist comes in takes a look at the right breast and does the ultrasound.  She says that she sees a dense space,  now what the hell does that mean??  She says no reason for a biopsy because there is nothing to biopsy.  She also says this may be your normal breast but lets go for an MRI.  Now I am really kinda upset I mean this is my third time, what the hell.  I am so confused?  I am angry and I am not too happy with the way they conducted all this.   I will go for the mri, but I hope after all this , they say go for a biopsy.   I mean why could we not get this at first, and what the hell is a dense space???? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 12, 2008 04:51AM stevemorse wrote: this came out wrong, last few sentences I meant I hope after the MRI, they dont make me go again for the biopsy.  I just feel like I am not getting any answers and I am so scared.  I am more afraid of the biospy for some strange reason.  This really rots, I wish I was like everyone else see you next year but my first one turns into this 3 time worry trip!!!",
      "MessageIndex": 2,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 12, 2008 05:36AM stevemorse wrote: thanks both of you.  I am just wondering why the MRI ?  I am a bad patient , and I am an avoider!!!! Thanks and Leaf what a good explaination!!!!!  Thanks both Marilyn",
      "MessageIndex": 5,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 12, 2008 09:35AM stevemorse wrote: Beesie thanks yes I am kinda figuring this all out.  I guess to tell you the truth I am scared, I am so scared especially of a biopsy.  I have this equation in my head biopsy = cancer.  God only knows why but that part really scares me the most out of ANYTHING!!!  I pray that after the MRI this is the end, and no further tests or needles.  This really sucks I for the first Mammo!!!  I am blow away by all this.  I just kinda thought I would take a few pictures and be out, see ya next year and just keep getting more worried everytime they order a new test.  Holy shit, I would have been more prepared if I had a few of these but god, I just was very unprepared for the 1st time.  I really am floored by all the people who have problems?  I am so sad for all women!!!  I just can believe we all have to go thru this.  Why is this happened to so many women?  I am reading the DCIS and cant believe how many people!!!  I need to get a grip and stop this, I am going to take a few xanax and sleep good tonight.  Thanks again and I will fill you all in after I get the MRI, you bet if I need a biospy, I will be back getting ready to panic even more!!!  Thanks Marilyn",
      "MessageIndex": 7,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 12, 2008 07:53PM stevemorse wrote: you all have made me cry with your kindness!  Bessie thank god your at 83 percent!  Well tommorrow I go and get the damn prescription from the primary care, so all this is covered by my health insurance and she is basically clueless, a little chinese women who is sweet but never the bearer of any news so its a waste to try to talk to her.  Then I am running home and getting that MRI as quick as possible.  I will fill you all in.  Thanks and boy those xanax really made me sleep like a baby, so I feel alittle more clear headed today.",
      "MessageIndex": 11,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 13, 2008 08:15AM stevemorse wrote: ohh great, thanks for all the replies but now I am panicing that dense space may mean ILC!!  Great so glad I know also that dense breast have more chance of cancer.  Oh well just include me in the club, because thats probably why all these workers and experts are acting so funny.  Great more xanax tonight. Marilyn  Ohh god this really sucks, and I just feel like I am screwed.  I know you are trying to help I was under the impression that when see the dr said she has nothing to biopsy I was in the clear, but now I know different. I will fill you in , its not your fault your just giving me the info.  I really feel like taking the gun and getting it over with.  I know sounds so dramatic but I am just so mad!!!",
      "MessageIndex": 16,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707140",
      "Title": "Hi, new and mad!!!! stevemorse SLH"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 15, 2008 04:01PM stevemorse wrote: this is terrible, I am almost in tears reading this, I am so angry at God for this, it appears to me you are a good person wanting a child so bad and adopted why did God do this???  I am mad, not at you, at God.  This sucks its not fair and if he does this to good people we may as well all be rotten people!!!!!  I am sorry that you have to go thru this again.   I really by reading all these stories and people here seem so good lost all my faith!!!!  ",
      "MessageIndex": 9,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/706982",
      "Title": "Ready To Hear PET results LongHornSurvivor crazydaisy"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 14, 2008 06:57AM stevemorse wrote: tell me what did you do after your dx?  I am curious, you seem so level headed.  I have read your posts and think that you really ought to go into counseling.  You found your career in life.  You are one smart women.  There is something very interesting about you.  Do tell me alittle about your past and what happened in the end?  Thanks yes I think things should change 6 months is crazy!!!  I wonder if this were men would it be different???  I am not worried after reading the us, but this could have been alittle bit avoided if they just informed me alittle better.  Thanks again, i will fill you in on the mri.  Believe me I am going to speak up for all women!!!!!",
      "MessageIndex": 4,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707304",
      "Title": "saw primary care doctor for report stevemorse leaf"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "stevemorse wrote: Now to add to the story, I went and saw primary care doctor for prescription for MRI (so insurance covers), well let me just say I asked for a copy of my recent US report because the radiologist scared the crap out of me and so did the tech's.  They gave me no signs just kinda let me to believe to worry thats how I felt.  Everything was so hush hush and thats what pissed me off.  Funny they the radiologists send you a letter but its not the report its a letter to tell you to come back for more test.  This is crap, lets just get more worried!! To me this system sucks.  Ok now thank god for a good primary care doctor she gave me a copy and listen to this ... US of right breast (left was fine)  NO prior exams were available for comparison ;Transverse and sagittal of right breast was performed by tech. and myself (that the radiologist) A 3mm cyst is present at 12)) not corresponding to the mammo findings.  No additional cystic or solid lesion is iddntified.  Sonography cannot entirely exclude a solid mass. Impression Benign BI-Rads 2 benign  follow up MRI Now they told me a dense space.  So what went from a major panic to actually reading the report is different.  This to me does not sound that bad.  Am I crazy????  Yes I will go to the nasty techs and get the damn MRI but lets just say I am not too happy the way this was handled.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707304",
      "Title": "saw primary care doctor for report stevemorse leaf"
    },
    {
      "AuthorID": "stevemorse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/68047/profile",
      "Content": "Jun 14, 2008 06:00AM - edited Jun 14, 2008 06:03AM by stevemorse thanks, your real smart, how about a career in this Leaf???  Well the point I am making is this report reads much better than the impression I was getting.   I am one of the people who is going to stick around here, I really feel that I am not going to disappear after I get the clear that everything is OK. I have learned the horrors of this whole system and I still think it sucks.  The way you keep going back and back and noone says nothing for weeks.  Now my report to me reads much better than implied.  Thanks again your great!! Look maybe its me, maybe i take things or read things wrong, I just do not like the hush hush attitude.  It leaves too much space and time for useless but cant help worry.  If they just could handle this process alittle different I would think most women would be HAPPY!!!  I can see why people do not want to go, they system for all this really is bad.  Too much waiting time. I understand the reasons but they should understand people's emotions run wild.  The system has got to change!!!!!",
      "MessageIndex": 2,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707304",
      "Title": "saw primary care doctor for report stevemorse leaf"
    }
  ]
}