{
  "AuthorID": "steviesmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155380/profile",
  "Posts": [
    {
      "AuthorID": "steviesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155380/profile",
      "Content": "Jul 11, 2012 10:11AM steviesmom wrote: Thank you for your encouraging words. I will be having a lumpectomy with sentinel node on the 17th. So I guess I'll know more then. I'm thankful for a place to come to talk to those who truly understand what we are going through. Hugs to you all!!!",
      "MessageIndex": 3,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790344",
      "Title": "waiting on staging tests and scared steviesmom kltb04"
    },
    {
      "AuthorID": "steviesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155380/profile",
      "Content": "Jul 14, 2012 12:54PM steviesmom wrote: Thank you all for your support and info.  Just to update I decided to go to a University Breast Center for a second opinion and wow what a difference. I was there all day and had mri, blood tests, MO consult, as well as surgeon consult. I have decided to go there for my treatment. Not looking forward to the chemo but I feel better about my decision. Btw it is the same hospital where my daughter was treated. Oh, just my luck as we were making the 2 hour drive back home after 8 hours at the docs someone slammed into the side of our truck. Thankfully no one was hurt and not too much damage. God was watching over us that day.",
      "MessageIndex": 7,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790344",
      "Title": "waiting on staging tests and scared steviesmom kltb04"
    },
    {
      "AuthorID": "steviesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155380/profile",
      "Content": "steviesmom wrote: I was just diagnosed with IDC grade 3. This is so scary. I'm waiting on an appointment for a second opinion before my scheduled lumpectomy. The thing is that I have pain in my bones and tightness in my right side so I'm terrified that the cancer is already in these areas. I know I shouldn't freak out so soon but I can't help it. My daughter had leukemia 2 years ago and had a bone marrow transplant. She is now doing great. We were just starting to get life back to as near normal as we could and now this. I believe in God and know He is the only reason my daughter is alive today. She was only given a 20% chance to survive because her leukemia was so rare. I know He can do the same for me too, but I'm still scared. Anyone that can tell me how to cope with this news? Also has anyone ever had bone and joint pain before diagnosis that wasn't mets? I have arthritis and fibromyalgia but this pain is different. I guess I just need to talk to someone besides my family because I don't want to worry them. Thanks for letting me vent.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790344",
      "Title": "waiting on staging tests and scared steviesmom kltb04"
    }
  ]
}