{
  "AuthorID": "steve-billi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154839/profile",
  "Posts": [
    {
      "AuthorID": "steve-billi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154839/profile",
      "Content": "Jul 1, 2012 11:16PM steve-billiemae wrote: Gemmie: GET YOUR GI JANE ON GIRL!!! SPORT IT WELL!!! I couldn't take the fallout either. The only se so far is a sweatty head...no itching!!! Go Girl, Billiemae ",
      "MessageIndex": 16250,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "steve-billi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154839/profile",
      "Content": "Jul 1, 2012 11:11PM steve-billiemae wrote: Hi Everyone,  I'm not sure why, but when we were in the hospital  and the hairloss became quite obvious and clearly unavoidable; I went to the nursing station and requested a pair of scizzors to cut Billiemaes hair. What a joke...one would think on the cancer floor you would be able to produce something a little larger then the pair they found me in a stitches kit, but I worked with what they gave me! Man they were small!!! We agreed it only made sence that so long as you can pull it out in clumps, then it needs to be cut! To me it was an honor and a privlage to be trusted to cut her hair for her, and eventually shave her head for her! I'm not sure, but maybe it was her ability to take care of me hand and foot; threw not one but two broken arms the last time requiring surgery that made it such a no brainer! I mean really, she had to do EVERYTHING FOR ME; even yes...wipe me! Seems like being supportive in her time of need is pale in comparison!!! And now I'd be lying if I didn't say that SHE IS EVERY BIT AS BEAUTIFUL TODAY WITHOUT HAIR AS SHE EVER WAS WITH HAIR!!!  She is a warrior and a hero, all she had to do was refuse treatment and let it take it's course, leaving me to pick up the pieces! But instead she is fighting this with everything shes got! The way I see it...I'M THE LUCKIEST MAN IN THE WORLD!!! I LOVE YOU BILLIEMAE!!! :-) So I ask ALL of the other heros here to keep fighting, don't let yourself get discouraged by the hairloss! Your beauty has never been defined by the hair on your head, your eye lashes, eyebrows or boobs! It's so much more then that... and of course they will grow back or can be replaced!!! As a contractor, when I look to buy or work on a house; not once have I ever said \" I'd really like it but it has no shutters!\" A solid foundation has always been more important to me!!!   And oh my...this is sizing up to be the bumpiest rollercoaster ride on the planet. As a child I used to wish that the ride would never end...but if memory serves they always did!!! And this to shall pass, we will only be stronger when it's only a memory (Billiemae)!  Stay Strong and Please Stay In Touch, Steve & Billiemae ",
      "MessageIndex": 16249,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}