{
  "AuthorID": "StickiVicki…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
  "Posts": [
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Oct 6, 2013 10:55PM StickiVicki wrote: Rant for the Cure - perfect!",
      "MessageIndex": 4,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/812371",
      "Title": "Rant - Run for the Cure listee stagefree"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 13, 2013 09:54AM StickiVicki wrote: I was dx as Stage IV 18 Jan 2008 and had to have a total hip replacement 22 Jan 2008 as a result.  Initially dx in Aug/Sep 2007 as Stage II, which would have been Stage IV if the doctors had listened to me. Vicki xxx",
      "MessageIndex": 458,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 16, 2013 11:45AM StickiVicki wrote: Iwill, I have tried clicking on your link in your last post but it goes to a 'page not found' message.  Maybe you could copy and paste the message, because what you have shared the link to might be a private message from BCO to you.",
      "MessageIndex": 24,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810889",
      "Title": "Anyone have a good anti-Komen op ed letter? Iwillwinthisbattle chanah"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 13, 2013 12:59PM StickiVicki wrote: Iwillwinthisbattle could you provide a link to the Komen request for MBCers to contact their local Media?  I actually live in the UK so I don't have the same exposure to all things Pink and Komen as the US does. Don't know if the above would help, and the Maths would need to be checked.  I am rubbish at Maths and can't find a calculator to help.  There may were be one on the computer but I can't be bothered ... Vicki xxx",
      "MessageIndex": 2,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810889",
      "Title": "Anyone have a good anti-Komen op ed letter? Iwillwinthisbattle chanah"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 14, 2013 02:42PM - edited Sep 14, 2013 02:44PM by StickiVicki What is it about 'there is not enough Metastatic Breast Cancer research funding' that the likes of Komen just don't seem to understand?  How can an organisation with huge resources, set up in memory of someone who died of MBC, sit in its Pink boardroom and ignore 400,000 deaths world wide every year and tell us there is not enough pink in the world (see Pink Ribbons Inc)?  How could they pay their ex-CEO over $600k?  What is the new CEO making?  How much has to be raised just to cover the salaries of those who lead a non-profit?  Whose profit?  Andrea says she is not lurking but she must be spying on those who mention Komen on the internet or how would this thread have ended up in her 'Google alerts'?  Actually this is the worst form of tracking what is being said about Komen and is an invasion of a forum which explicitly tells those who even look at the title of the forum that it IS INTENDED FOR THE USE OF THOSE WHO ARE STAGE IV AND METASTATIC BREAST CANCER ONLY.  Did Andrea really join this community just to answer this thread? How come someone needs to raise $2300 just to take part in the 3 Day Walk, even though they already seem to have to pay a registration fee?  Not everyone makes over $600K a year and have friends with deep pockets, some are having to choose between their health and the day to day necessities of staying alive.  Surely the cost of registration should cover the event expenses and since when is $1 raised not enough of a contribution?  Of course this means that 3000 odd people would have to take part in one of those walks just to pay Nancy Brinker's salary. Vicki xxx http://youtu.be/SILOv8_YJdQ",
      "MessageIndex": 18,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810889",
      "Title": "Anyone have a good anti-Komen op ed letter? Iwillwinthisbattle chanah"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 13, 2013 05:37AM StickiVicki wrote: If you are covering the bases incase of cancellation (which may have nothing to do with your mets) then why not. Personally I don't look that far ahead, not because I don't think I will be around, but because I prefer to live in this immediate moment.  I went to the Three Choirs Festival which was in Gloucester this year, in Worcester next and Hereford the year after (hence the Three Choirs).  I am planning on attending them all, but it is in the mists of the future and I will deal with it when it is time to deal with it.  Until then ... I just take it one day at a time; which reminds me I have to get my bloods done today ready for the next treatment ... Vicki xxx",
      "MessageIndex": 20,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810824",
      "Title": "Anyone else feeling positive - making longer range plans? chanah Iwillwinthisbattle"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 13, 2013 12:55PM - edited Sep 14, 2013 02:47PM by StickiVicki Susan G. Komen For The Cure has suggested that those of us with Metastatic Breast Cancer (aka Stage IV, Advanced or Secondary Breast Cancer) contact our local newspapers and media outlets to get you to feature awareness of Metastatic Breast Cancer.  So here are a few facts that you might like to highlight. Sadly these levels of funding for Metastatic Breast Cancer research, which is the only Stage of the disease which actually kills, are universally low.  There are about 162,000 http://mbcn.org/education/category/prevalence/ people (men get breast cancer too) living with Metastatic Breast Cancer in the US alone.  We are dying because of the lack of research funding and also because too many researchers are clinging to a paradigm that is not producing results.  If you feature Metastatic Breast Cancer, especially in October during Breast Cancer Awareness Month (of which we have one day of awareness, the 13th) we may be able to change the funding of research to a more realistic level, and help change the paradigm that is holding back truly innovative research.",
      "MessageIndex": 1,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810889",
      "Title": "Anyone have a good anti-Komen op ed letter? Iwillwinthisbattle chanah"
    },
    {
      "AuthorID": "StickiVicki…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168428/profile",
      "Content": "Sep 17, 2013 03:41AM StickiVicki wrote: Barsco1963 if you have children at the fundraiser maybe you could have a little prize or rosette for the best drawing of an elephant!  Or pin the tail on the elephant (or the trunk). How about a quiz sheet to get folks to find answers to the questions.  The answers being written on the elephants? Or just have a party! Vicki xxx",
      "MessageIndex": 69,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810696",
      "Title": "\"Awareness\" rant! kayrnic AmyJM"
    }
  ]
}