{
  "AuthorID": "StillKicking",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53854/profile",
  "Posts": [
    {
      "AuthorID": "StillKicking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53854/profile",
      "Content": "StillKicking wrote: I thought I had educated myself on the side effects of chemo. But what do you know, i've got another one.   I waited 7 months after chemo to get my eyes checked as I had been having problems.  Got the new glasses, couldn't see a thing.  Called the eye doctor regarding the prescription.  Their response was to give it a few days for my eyes to adjust.  Well, after several days, problems had increased.  Couldn't even drive anymore.  Major headaches, nausea, dizziness, major thirst, hunger and general bad feelings.   Finally, I go back to the eye doctor and he says there is so much difference since he performed the exam that there must be a major medical occurrence.  He says to get to the doctor as soon as possible.   Both my onc and primary care docs are out for the holidays.  Finally, my bother suggested that I test my blood sugar.  Sister is diabetic and we test using her equipment.  The numbers came out to 599!  Normal is 100.  Called Ask a Nurse.  She says call 911.    One of the first questions the ER doctor asked was did I have steriods during chemo.  Who knew that steriods caused an increase in blood sugar?   Long story short - now chemo induced diabetes.  After a few days in the hospital, I now have to give myself 5-7 shots of insulin daily.  To me this is scarier than the diagnosis of breast cancer.  I am an avid reader (3-5 books per week at a minimum!) and the loss of my eyesight would do me in.      Could I have prevented this by making changes in diet and exercise as soon as I got the breast cancer diagnosis?   I have all the risk factors:   overweight, smoker, family diabetes.  I think this might be the one to finally force me to make changes in my life.  I've managed to stay on a very low-carb diet (ok it has just been 1 week) and have got my numbers down to almost normal.  The next step is to implement an exercise program.  I've lost approximately 8 lbs in 1 week.   Let this be a warning to all those sisters with risk factors.  Watch your diet and exercise. Has anybody else had this problem?  What about other unusual side effects that we need to be watching out for? Diagnosed Smoldering Multiple Myeloma (Blood Cancer) 07/2015 Surgery 8/8/2007 Mastectomy: Left, Right Dx DCIS/IDC, Right, 1cm, Stage IA, ER+, HER2+ (FISH) Chemotherapy TAC Hormonal Therapy Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708971",
      "Title": "Another Chemo Side Effect Warning StillKicking StillKicking"
    },
    {
      "AuthorID": "StillKicking",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53854/profile",
      "Content": "StillKicking wrote: Two weeks after 1st treatment of TC and Herceptin and still have a horrible taste in mouth.  How long does this bad taste (metal) in the mouth last?  Is it from the chemo or the Herceptin?  Please tell me that between each treatment you get at least a few days of tasting food and water again! I thought I had dealt with the diagnosis of cancer, loss of both breasts (now look more like a Budda than a woman), and 6 years of treatment.   But to no longer taste my food!  That seems so unfair.  Cruel, cruel cancer. Diagnosed Smoldering Multiple Myeloma (Blood Cancer) 07/2015 Surgery 8/8/2007 Mastectomy: Left, Right Dx DCIS/IDC, Right, 1cm, Stage IA, ER+, HER2+ (FISH) Chemotherapy TAC Hormonal Therapy Arimidex (anastrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692931",
      "Title": "I want my taste back! Help! StillKicking Sofie"
    }
  ]
}