{
  "AuthorID": "Stopcrying",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174230/profile",
  "Posts": [
    {
      "AuthorID": "Stopcrying",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174230/profile",
      "Content": "Jun 29, 2013 04:46AM Stopcrying wrote: The best advice that I can give is to just try to go with the flow. One thing I've discovered is that when I think I've gotten cancer and chemo figured out, they prove me wrong. One cycle I'm in the hospital because I haven't pooped in a week and can barely function, the next time I've got diarrhea constantly. I can't chew gum without running to the bathroom. My bones hurt from the neulasta injections but that does go away and rubbing her legs will help a lot. The week after chemo it's really hard to eat or drink anything because it all just tastes like poison. Apparently that nasty chemo kills off your taste buds as well. Smoothies work well for that. When she can't sleep, Benadryl is the easiest thing that doesn't interfere with any meds. The one thing my husband majorly screwed up on..... Tell her how you feel and if you're scared tell her. She's still the same person you married and always acting like everything is fine could make her feel like you don't care.",
      "MessageIndex": 19,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806560",
      "Title": "Advice for my wife who just started chemo? GainesvilleSpouse Stopcrying"
    },
    {
      "AuthorID": "Stopcrying",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/174230/profile",
      "Content": "Jun 29, 2013 04:51AM Stopcrying wrote: And as for the hats.... I was nuts about buying hats and wigs before I lost my hair. But a week before I started chemo, I shaved my head. I figured the cancer had gotten my boobs, it wasn't deciding when to get my hair. My daughters had me go to the mall with them that day, to get it over with. The funny thing was... No one stared. I've never worn a hat or wig and feel fine with it. You get smiles from people. They know why your bald and give you thumbs up on your progress. Do get a cotton sleep hat, her head will get cold at night.",
      "MessageIndex": 20,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806560",
      "Title": "Advice for my wife who just started chemo? GainesvilleSpouse Stopcrying"
    }
  ]
}