{
  "AuthorID": "Streetglide…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251022/profile",
  "Posts": [{
    "AuthorID": "Streetglide…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251022/profile",
    "Content": "Nov 14, 2017 09:23AM Streetglide2014 wrote: Hi I am new here and want to tell my story. My mother was diagnosed with BC at age 67 and is a survivor. In Feb of 2017 I went for my yearly mammogram and was called back for another screening. They explained to me that they have been watching a spot in my right breast for the last 3 years and the calcification were starting to cluster more and they thought it warranted a biopsy. Had a mammogram guided biopsy where I was diagnosed with ADH and my breast surgeon wanted to do an outpatient lumpectomy. I was schedule for that April 12, 2017. My follow up appointment we discussed my treatment. She wanted to do more frequent screenings. (MRI in 6 months then mammogram in another 6 months) We discussed Tamoxifen and the side effects vs the benefits. My BS was not completely convinced that I needed to start Tamoxifen. So I decided not to start taking it and just do more frequent screenings. On Oct 13th went for my MRI and my dr called with the results and I was clearly thrown off guard. My right breast MRI was clear BUT they found a 9mm mass on my left breast. So they wanted me back to do an ultrasound. The ultrasound and Mammogram showed NO mass. However, they wanted me to have a MRI guided biopsy but they were convinced it would be benign. The results showed that I now have ADH in my left breast and I am scheduled for another lumpectomy on Nov 22nd. My dr wants me to start Tamoxifen. I am scared of the side effects. I do not want to lose my quality of life if they are as bad as I have read on some of the blogs. Are any of you currently taking Tamoxifen? If so, are you having any severe side effects? I also am concerned with the effects of mammograms and Ultrasound. Both of those showed no mass but the MRI found it. Had I not had an MRI would this mass of turned into cancer. I am consumed by the thoughts that every 6 months I am going to have to go through tests, biopsies and lumpectomies. Am I better off to get a mastectomy? or will that even be an option? Sorry for so many questions.",
    "MessageIndex": 870,
    "PostDate": "14/11/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
    "Title": "ADH Club Chickenpants SarBar22"
  }]
}