{
  "AuthorID": "strngwmn39",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
  "Posts": [
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 7, 2009 02:01PM strngwmn39 wrote: Vickie,  I have TNBC with 1 positive node and multifocal invasive breast cancer that was (if you add it together) 6 cm, but taken separately each was 1 cm or less in diameter each. I was diagnosed at 39. I go to an academic medical center that believes there is a protocol that benefits younger women with fewer than 4 nodes. There are other rad oncs that look at the data differently. I agree with blue dasher, there are risks, which I had to weigh carefully, and you will too. But there is no harm in getting other opinions.  Michelle  ",
      "MessageIndex": 12,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/741638",
      "Title": "In a borderline case, shouldn't the choice be mine? yogamommy unklezwifeonty"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Aug 4, 2009 04:24AM strngwmn39 wrote: Thank you all so much. I had a feeling that this would be manageable, but I wanted to make sure. I'm having bilateral mastectomies with immediate reconstruction (tissue expanders) on August 12. Wasn't prepared for this added surgery, but I'm up for it (BSO).  Thanks for the feedback! michelle ",
      "MessageIndex": 5,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738163",
      "Title": "Breast and Ovary Surgery at the Same Time strngwmn39 Silverpullet"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "strngwmn39 wrote: I'd love to hear from anyone who has had breast surgery and a salpingo-oopherectomy (ovaries and fallopian tubes removed) at the same time. I have BRCA 2 and I'm scheduled to have bilateral mastecomies for breast cancer (I have bilateral disease) and the ovarian surgery at the same time on August 12.  What is the recovery like?  I know the ovarian surgery is laproscopic, which is easier to recover from, but I'm concerned about having both my upper body and my lower body recovering from surgery at the same time. How hard is it? Thanks so much! Michelle, age 40  Dx 2/27/2009, IDC, Stage IIB, Grade 3, 1/18 nodes, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738163",
      "Title": "Breast and Ovary Surgery at the Same Time strngwmn39 Silverpullet"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "May 26, 2009 08:47PM strngwmn39 wrote: Hi,  I have multifocal disease as well (bilateral disease also) and I had the gene test - guess what? I'm BRCA2 positive. I'm also node positive, which made the chemo decision easy, but that additional piece of information was helpful. Sounds like more information (oncotype test) would be helpful and if you are getting the vibe that a new oncologist is needed, do it now. Not feeling good about your doctor in the middle of treatment is NOT a good place to be. Michelle ",
      "MessageIndex": 2,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734805",
      "Title": "Multifocal IDC and chemo achen2iron BrandonMom"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Sep 20, 2009 12:01AM strngwmn39 wrote: Hello Everyone, May I join? I have my SIMS appointment on Tuesday. I had my bilateral mastectomies with tissue expanders on August 12, and I will be having radiation on the left side (breast and axilla area) where I had invasive cancer. Right side was just DCIS. Thanks. Michelle, age 40",
      "MessageIndex": 30,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 5, 2009 01:48PM strngwmn39 wrote: Swampy,  Was it multifocal? (throughout the breast, or close to the chest wall?) That may be a reason your med onc knew to see the rad onc regardless of pathology. It will be interesting to see what the radiation oncologist says. The reason that radiation is an effective treatment is that it provides local control for the disease in a mode that is different than Herceptin and chemo. Michelle",
      "MessageIndex": 129,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Sep 25, 2009 12:16PM strngwmn39 wrote: Hello Everyone,  I had my sims appointment last week and my first radiation appointment is scheduled for 9-30-09. I'm wondering how many people on this list are having radiation after mastectomy (like I am) versus radiation after lumpectomy? I believe the side effects from treatment will be a bit different for us, as I learned my treatment field will be a bit larger. I had the tattoos - and I found them to be very tiny, and the pain was less than a bee sting. I have four of them. The difficulty I am having is that I cannot get my arms all the way above my head so the position I am in is very awkward and painful. Physical therapy is difficult and I am hoping I can get over this hurdle quickly. Michelle, age 40 ",
      "MessageIndex": 48,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 5, 2009 01:53PM strngwmn39 wrote: Dragonfly 1976 - you and I are also in the same boat! Have you started radiation?  I have had 2 treatments so far, and while my post-surgical swelling has gone down with PT and a lymphedema sleeve, my arm feels heavy after treatment.  I definitely feel the twinges that elimar mentions - all the time, even after just 2 treatments! I'm concern because I have expanders - after treatment my skin feels tight for several hours, then it relaxes. I'm hoping it doesn't get alot worse. I also feel warm.  My rad onc staff has told me that it is not possible to pre-treat the skin for radiation reactions...so I have a cream that they have given me ( prescription that I use as directed) but I'm not sure about taking all sorts of other steps to put stuff on my skin - has anyone else been told this? I want to avoid radiation burns, and I believe the staff at this center is very good and that they would tell me what I needed to do to accomplish that. Its so hard to sort through all this info! Michelle ",
      "MessageIndex": 130,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 5, 2009 07:07PM strngwmn39 wrote: pauldingmom, swampy: redsox is right - you can only be radiated to a given area once - that's it. Michelle",
      "MessageIndex": 134,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 8, 2009 11:41AM strngwmn39 wrote: linn56,  I'm also going to RT alone, so I know how you feel (I'm 40, diagnosed at 39). First - my radiation techs give me treatment through a warm blanket - you do not have to be uncovered to receive treatment. Second, they have a CD player in the room and I bring whatever kickass music I like to listen to, and it makes the time go by fast (no iPod, sorry). Be sure to ask them to help you feel comfortable. It helps alot. Michelle    ",
      "MessageIndex": 165,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Sep 22, 2009 12:29PM strngwmn39 wrote: PauldingMom,  Sorry, once you have cancer, you can no longer donate blood or organs, since they have the potential of developing cancer (and therefore giving cancer to another person). A CT scan is no big deal - you may have an IV so they can inject a tracer dye at the end for the last few pictures, and you are in a machine that is a donut like scanner that whirrs around and takes pictures. The deal is this, they don't order the scan unless they know the information from it will positively impact your treatment (in other words, if they wouldn't do anything different with additional information, then subjecting you to the scan isn't appropriate).  Michelle ",
      "MessageIndex": 36,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "strngwmn39",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83268/profile",
      "Content": "Oct 5, 2009 01:37PM strngwmn39 wrote: swampy,  How old are you? Premenopausal or postmenopausal breast cancer? I'd love to take a guess as to why your oncologist suggested a consultation with the radiation oncologist (and that's what it is, a consultation, not treatment) but you've not listed enough info, so I will tell you why it was suggested that I have radiation and maybe that will help.  Why not talk to the radiation oncologist to get an opinion? You may find that the rad onc doesn't feel you need radiation either. I went to the first appointment (consultation) with an open mind, knowing that I could decide not to do it. In my  case, I was diagnosed at 39, BRCA2+, bilateral cancer, (invasive on one side) with 1+ node. Radiation is not a clear cut recommendation for women in my situation, but some studies indicate a reduction in recurrence and an improvement in overall survival (this is clear for women with 4+ nodes). My radiation oncologist felt that I would receive benefit, given my age and my BRCA status, with the protocol they use at the treatment center where I am now receiving treatment. I also thought as you do - why use radiation now, when I could need it later? The answer in my mind is that a chest wall recurrence is much harder to treat - and I would rather try to prevent it if I can. That's my reasoning.  Hope this is helpful.  Michelle  Michelle ",
      "MessageIndex": 127,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    }
  ]
}