{
  "AuthorID": "strongasmym…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80213/profile",
  "Posts": [
    {
      "AuthorID": "strongasmym…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80213/profile",
      "Content": "Mar 2, 2009 06:40PM strongasmymom wrote: I'm speechless, thank you all so much for your kind words and wisdom.  My brother is going to hook up a dog run for the four crazy's as I affectionately call them, but more importantly I am going to ask my company tomorrow to allow me to use a loaner laptop so that I can work from home for a few weeks.  That way I can take care of her and help her with appointments, visitors, cooking, laundry all that fun stuff. I'm thinking funny movies are out since part of her surgery is as I understand it going to pull abdominal muscle or tissue up into the chest area (I'm not very good with the specifics of the type of surgery,  I wish I lived closer so I could have gone on the appointments with her) I can't bear the thought of her trying to do that all by herself and unfortunately she doesn't have that many people she can rely on.  She has a couple of friends who they themselves are BC survivors so that is comforting for me to know maybe they can help her after I leave in a few weeks.  Hey besides online where can I buy some camisoles with the pockets in them (do they sell them anyplace like target or JC Penney or are they sold strictly at medical equipment stores).  The surgeon or nurse will teach me how to do the drain and keep track of the fluid level right?  I don't mind it at all, I'm actually going to go back to school for my nursing degree eventually. I again can't thank you all enough, this is such a warm, supportive and helpful forum -  I'm so glad I looked at this website!!!  ",
      "MessageIndex": 7,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729990",
      "Title": "My mom's surgery 3/10/09 strongasmymom strongasmymom"
    },
    {
      "AuthorID": "strongasmym…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80213/profile",
      "Content": "Mar 11, 2009 05:10PM strongasmymom wrote: Hi everyone! Thanks again for all of your support and kind words, my mom had her surgery yesterday and it went through perfectly.  She had the reconstruction the same day and the plastic surgeon was able to fill the space maintainers with 100CC's of fluid to start.  We brought her home from the hospital today and she's of course in a lot of pain but managing and moving around pretty good. They were going to do a tram flap for the recon. but decided not to a week before surgery.  I'll post this in the March surgery too but I wanted to give you all an update because you are all so sweet to have helped me out with my questions the last few weeks!  Thank you!",
      "MessageIndex": 12,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729990",
      "Title": "My mom's surgery 3/10/09 strongasmymom strongasmymom"
    },
    {
      "AuthorID": "strongasmym…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80213/profile",
      "Content": "Mar 2, 2009 07:16PM strongasmymom wrote: Thank you DLB823 your a lifesaver!!! I ironed cleaned and cooked everything in my house yesterday and decided I was channeling my nerves the wrong way so now I'm all about organizing.  I'll join the March group on my mom's behalf and start reading through Feb postings.  I feel so much more prepared reading everything I have already!",
      "MessageIndex": 9,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/729990",
      "Title": "My mom's surgery 3/10/09 strongasmymom strongasmymom"
    }
  ]
}