{
  "AuthorID": "subinthapa",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74624/profile",
  "Posts": [
    {
      "AuthorID": "subinthapa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74624/profile",
      "Content": "subinthapa wrote: Hi,  My wife's aunt was just admitted to the hospital again last night for shortness of breath.  Her prognosis is grim.  For months, we have been contacting local places for a second opinion, but none of them could set up appointments in a reasonable time.  She won't be leaving the hospital for the foreseeable future, so we're trying to find places that will review her treatment history and offer advice in a matter of hours or days, not weeks. Can anyone recommend a hospital or support group that has a hotline to get past the regular scheduling process and put us directly in touch with good oncologists? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724049",
      "Title": "Immediate 2nd opinions for nonresponsive metastatic disease? subinthapa Hopeful101"
    },
    {
      "AuthorID": "subinthapa",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74624/profile",
      "Content": "Nov 17, 2008 04:10PM subinthapa wrote: Thank you for the suggestions, I will follow up with them.  We live in Southern California, and UCLA was the hospital we were having trouble contacting.  We met with the department head last Monday, and he had little encouragement for us.  I guess we're on our own to search for promising trials.  My aunt's oncologist discouraged us from contacting City of Hope, but they seem to have many trials that might be relevant.  Does anyone have experience with City of Hope?",
      "MessageIndex": 4,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724049",
      "Title": "Immediate 2nd opinions for nonresponsive metastatic disease? subinthapa Hopeful101"
    }
  ]
}