{
  "AuthorID": "Sublimis",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131788/profile",
  "Posts": [
    {
      "AuthorID": "Sublimis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131788/profile",
      "Content": "Jul 12, 2011 06:29PM Sublimis wrote:",
      "MessageIndex": 1,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771537",
      "Title": "B9 for me apaige lisa645"
    },
    {
      "AuthorID": "Sublimis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131788/profile",
      "Content": "Sublimis wrote: I had my first mammogram appt. today after finding a lump in my right breast.  The lump didn't show up in the x-ray so the radiologist took me in for an ultrasound.  She found quite a few cysts in both breasts, but the lump I was concerned about didn't show in either test.  The radiologist can feel the lump and thinks that it maybe inbetween cysts and that is why it isn't showing.  She recommended keeping my appt. with the Breast Care Center next friday and that I go for yearly mammos, that I should have started with the mammos 2 years ago.  I am 34 years old and breast and ovarian cancer run in the family.  I am supposed to get the paperwork to do the gentic testing when I go to the BCC.  I was hoping to have some answers today as to what the heck is going on, but instead found things I didn't even know were there with no answers on what I did know.  It is all so frustrating.  I am thinking the BBC will do a biopsy on the one lump the tests do not show.  Is that right?  What about the cysts?  Do they need to biopsy those too?  Are so many cysts a precancerous sign?  I guess it is somewhat normal to not be able to see a lump on a mammo or u/s if a person has dense breasts.  I don't want to have to wait around for another month or so to get an MRI.  I am taking it all in stride, not too freaked out.  I just want to know what it is and how concerned I should be that it isn't showing up.  I do feel that time is of the essence.  Does anyone know what the next steps are?  Any thoughts on what I should ask the BCC?  Thanks in advance! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771569",
      "Title": "Tom Petty is right... Sublimis Sublimis"
    },
    {
      "AuthorID": "Sublimis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131788/profile",
      "Content": "Jul 13, 2011 11:48PM Sublimis wrote: Thank you ladies!  I appreciate your support. It helps so much to be able to share. lisa, I am hoping all goes well for you tomorrow.  How long before you get the results?  The waiting is maddening.  I wish I was more educated so I could offer more support.  I am avoiding looking things up on here before I know anything.  It is all so scary and sometimes missleading.  It is easier said than done, but try not to worry about the things you can't control.  Right now it is out of our hands.  We just have to keep pushing through one minute at a time.  I will keep you in my thoughts tomorrow.  Let me know how it goes.  I am pretty sure they are going to biopsy me next friday.  I don't know what my birads number is with just having the testing yesterday.  I almost don't even want to know.  It would just be something else to worry about.  I am so tired of worrying without being able to take action on any of it.  Anyway, good luck tomorrow.  Stay positive!",
      "MessageIndex": 3,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771569",
      "Title": "Tom Petty is right... Sublimis Sublimis"
    },
    {
      "AuthorID": "Sublimis",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/131788/profile",
      "Content": "Jul 20, 2011 08:32AM Sublimis wrote: Hi Jess - I hope you are feeling at least a little better this morning.  My situation is simular to yours.  Found a lump, also some discharge in my right breast.  They couldn't find the palpable lump on the mammo or u/s just a bunch of other cysts, so I go to the Breast Care Center on Friday.  I will get the papers for genetic testing then (strong family history of breast and ovarian cancer), but other than that I have no idea what to expect.  Biopsy I am guessing.  I am 34 years old and my husband is in the military also, though my boys are older than your little one.  Try not to worry too much.  The doctors are very cautious when dealing with situations like this.  Like more safe than sorry type thing.  If you call the nurse at your PCM, he/she should be able to get you a RX for a mild anti-anxiety if you explain your situation.  And please don't be afraid to ask for help if you need it.  The military has some great programs out there to help families in times of need.  There is no shame in doing what is best for your family.  That is what they are there for.  Hang in there!  I know you are strong, we military wives have to be. Sub",
      "MessageIndex": 5,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/771884",
      "Title": "So nervous I can't sleep! jess15rae justjudie"
    }
  ]
}