{
  "AuthorID": "Sue2009",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
  "Posts": [
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 6, 2017 10:18PM Sue2009 wrote: hi Kandy & other BC sisters, I am starting Halaven tomorrow, but will ask my dr about abraxane. Halaven sounds similar to abraxane. Nan your hair loss experience would have made me cry too, & later I usually laugh at myself for getting so upset over things I have no control over. Kandy, like you, in 09 I went bald overnight. When I came out of my bedroom for breakfast and the shocked look on my 5 sons' faces were priceless, I had to laugh, which seemed to make them feel better. There is something about a bald head to make your dx real. I too hate wigs & am way more anxious this time thinking about it. I wore a pink, Uni of Florida ball cap mostly, I don't remember who gave it to me, but it turned out to be my favorite. I elected to wear it over a wig to my 20 yr HS reunion. My poor oncologist is probably going to drop me as a patient as I question her every move. ",
      "MessageIndex": 22,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851871",
      "Title": "Abraxane Kandy illimae"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 18, 2017 01:35PM Sue2009 wrote: I went to MDA after I was told I had bone mets. They r very organized. I saw Dr in charge of Breast Cancer team, dr Wedy Mould. They did a complete evaluation of DNA as part of a study, looking for mutations. That was no cost to me. They biopsied my bone mets to make sure there was no change. They also looked at my original slides & it was determined that I had lobular along with IDC. I left there wishing I had gone there initially. If you have no where to stay, check out air B&B. I had a cousin in Houston I stayed with for 3 weeks. Good luck",
      "MessageIndex": 7,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852581",
      "Title": "MD Anderson Rseman illimae"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 29, 2014 06:32PM Sue2009 wrote: N&V is the worse. The amend, not sure of spelling, was life saver. Have u tried Ativan? That helps relax u & may put u to sleep. The hardest thing is not wanting to get out of bed, but u have to try to walk some, keep up what strength u can. I am having a hard time w/ clinical trial drug & I know that feeling of wanting to quit. I am sure u have family who wants u to hold on. Hope u give good report tomorrow.Sue",
      "MessageIndex": 3,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824966",
      "Title": "So depressed, ready to quit! reader123 blondiex46"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Dec 29, 2015 04:01PM Sue2009 wrote: I am just finding this thread , I will be trying to pray at 10pm, I pray every day, start my day thanking God for giving me a body that wants to be healthy, at night I pray for us all, give us peace Lord as we go through our treatments, wait for results, etc. After going out to dinner during X-mas break I requested prayer for myself. My precious family obliged me. As we held hands my oldest son prayed a beautiful prayer, that made me cry. God is so good when we r faithful to Him",
      "MessageIndex": 495,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 15, 2016 10:30PM Sue2009 wrote: I am praying for peace as I wait for results to upcoming PET scan. I have been told I am terminal, no cure, so at the risk of sounding like I am still in denial I will pray for a cure everyday, untl I die. My God is still in that business.Ame",
      "MessageIndex": 514,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 18, 2016 10:36PM Sue2009 wrote: amen 50sgirl. Thank u Music Lover, I am at peace tonight, turned my worries over to God, trusting in him",
      "MessageIndex": 519,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jun 14, 2014 07:10PM Sue2009 wrote: glad I read this thread, I thought I was the only one who hated Pink, & being a survivor, I am not, my family will be the survivors after I am gone. I have resented Komen a long time, refuse to walk & wish those who did in my name would just donate to MD Anderson or another top research facility.",
      "MessageIndex": 16,
      "PostDate": "14/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821772",
      "Title": "I can't believe This Is Komen! Bestbird LibrarianB"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 23, 2016 03:05PM Sue2009 wrote: what is Finesse trial?",
      "MessageIndex": 1,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840653",
      "Title": "Anyone on the Finesse Trial? Peach935 Sue2009"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jun 13, 2014 07:30PM Sue2009 wrote: definitely call, also if you have rad onc, get results to him too. My rad onc has helped me more than my med onc, esp with pain control. I had left hip radiated last year & latest scan show no disease in hip. ",
      "MessageIndex": 6,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821935",
      "Title": "Calling oncologist and making appointment to ask questions. nanbvns car2tenn"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Apr 23, 2017 08:15AM Sue2009 wrote: great share Blainejennifer. I too was misdx, which lead to at least a 6 month delay in treatment & bone mets when finally diagnosed. I also had an experience years ago where I met a family friend at her radiation treatment. She was having a difficult time breathing. I asked for the nurse to check her O2 sat, that was the nurse in me, & it was in the 80's, I told her daughter she needed oxygen, & needed to call her MO. It took days to get her home oxygen, I could not believe her daughter wasn't more aggressive.",
      "MessageIndex": 16,
      "PostDate": "23/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852811",
      "Title": "The Lesson I Learned blainejennifer Sue2009"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 26, 2018 03:35AM Sue2009 wrote: Thanks Southernsurvivor for your thoughts. I am excited to report my TM dropped from 427 to 146 after 2 cycles. Missed my treatment this week due to cold or flu, was very ache in arms, legs & hip joints. My falls were all my fault. Was walking briskly thru kitchen & slipped in puddle of water created by dogs. Recently I went to get in bed, thought I was grabbing bedsheet, but had pillow instead , as I tried to pull self into bed I lost my balance & went straight down on my coccyx. Fractured my right hip & gave myself compression fractures.Rashes on face & palms have disappeared. Have lost a lot of hair, not bald though. I read tonight of Kandi’s passing, my heart is saddened, on top of that my best friend since college has now been Dx with BC. Looking ahead to better days . Sue.",
      "MessageIndex": 1843,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 12, 2018 12:41AM Sue2009 wrote: I had 4th Halaven infusion yesterday. My hair started falling out after cycle 2, 1st infusion. I cut hair short in back, asked sons to shave it short. But they all refused . Glad I am not bald, but hate seeing scalp so easily. I prefer hats Over wigs, wore pink gator ball cap to its death back in 2009. How often is cancer antigens checked? My dr checks once a month, but when they could not get blood return last month from port. Infusion nurse took blood from arm & said labs on her screen did not include antigens. I did not care since I had only 1 cycle done , would rather wait until after 2nd cycle complete. So far I have found Halaven tolerable. I had fall the night I had 2 nd infusion which left me in great pain in my right hip & lower back. My 3rd fall in the last 6 months, fractured left pelvis in 2 different places , lots of bed rest & wheel chair rides. I am wondering about hand/foot syndrome. Today I have rash on face & palms of hand. Some shooting pain in left foot. On top of all this my saline breast implant is losing saline, it has gone to half the size it was. I think my son's very large dog jumped on me. My counts are so low I doubt my dr would want to do anything about it. I have made this too long, thanks for sharing your thoughts. Sue",
      "MessageIndex": 1838,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Mar 20, 2018 09:56PM Sue2009 wrote: Hi all, thought I posted on this site, but I guess I just trolled. I changed MO last summer, my last one retired. I only had bone mets since last summer. At the time my MO was quitting I started growing a tumor behind my left eye ball. Initially it was thought to be leptomeningeal, but turned out it wasn’t, but it was growing off my skull, but not in my brain. After radiation MO suggested Doxil. It did nothing for me, & my TM went up into the 300’s In Dec I started Halaven. 75% of my hair has fallen out & strangely enough, the area that was radiated started to grow back much darker than it had been & hasn’t fallen out w/Halaven. My TM has dropped significantly, into the 50’s. I have wigs, but my pink ball cap is my favorite. I do get stomach pains a few days after treatment, but it is tolerable. Sue",
      "MessageIndex": 1879,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 16, 2013 01:38AM Sue2009 wrote: Still counting ? New to site, wish I wasn't on this list, but I am # 30",
      "MessageIndex": 459,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Dec 15, 2018 11:17PM Sue2009 wrote: Quadramet helped me a lot. Was already thirsty all the time, that had been for years now. I also have done Quadramet 2 times, about a year apart. Sue.",
      "MessageIndex": 1,
      "PostDate": "15/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/868569",
      "Title": "Quadramet, Samarium Davenport1 Sue2009"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 19, 2016 12:39PM Sue2009 wrote: I worked surgical unit over 15 yrs. Laparoscopic surgery always much easier, less down time. I did complete abdominal hysterectomy , I went home after 2 days. Only problem was constipation from pain meds, once past that I was fine",
      "MessageIndex": 7,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/841344",
      "Title": "Meeting with the Gynecologist next Tuesday phrogger78 phrogger78"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "May 27, 2018 04:11PM Sue2009 wrote: Shetland , I am glad to read this post as I was told yesterday it looks like I have liver mets. I am in the hospital for sepsis. I have had a rough year, after Kandy passed, I avoided this web site. Our paths were too similar. So I had to come back to hear what is being said about liver mets & possible treatments. I am 10 years MBC w/bone mets Dx at get go. Appreciate encouragement like everyone else, I will be celebrating your 5 years with you. 💕 Sue.",
      "MessageIndex": 19,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/864202",
      "Title": "Anyone 5+ years with liver mets and ER+ Her2-? ShetlandPony PaulaAmy"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Aug 12, 2018 10:33PM Sue2009 wrote: Max Otto - very funny 😼 Question about pain... my liver feels like I am being stabbed w/a knife when I take deep breaths, my sternum hurts a lot too. If I am laying still , I have no pain. Is this the type of pain any one else has had? Thanks, Sue.",
      "MessageIndex": 9430,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jun 24, 2015 04:40AM Sue2009 wrote: I have been on Palbociclib 75mg w/ monthly faslodex injections for 1yr now, part of clinical trial. I have had some progression of bone mets. Low white counts & fatigue have been very bothersome, which affects your immune system. I had c-diff, listeria infections. My dr thinks my quality of life hasn't been that great, but I don't complain, I am still here & I love reading in bed.i could share more, but too tired. Hope u have good response",
      "MessageIndex": 7,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832384",
      "Title": "Faslodex with Ibrance now intothewoods SonyaS"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 27, 2016 09:03PM Sue2009 wrote: 2Athena2--thank u for your honesty. I read somewhere that Afinitor was rough, & shouldn't be on market. U have sufficiently scared me 😁 how's Xeloda, I have heard it can make hands & feet very painful. I am trying lowest dose right now, blood sugars already running higher. Getting labs checked tomorrow. Sattipearl--love your idea of living memorial. I have 6 kids, ages 19-30, no grands yet. Anyway I asked for one thing for Christmas. Letters from my kids, I told them I thought this might be my last X-mas. We had a wonderful holiday celebration over a week, but I did not get one letter, brats 😜 I feel that time w/family is important now. I haven't been to church much last couple of yrs, get too weepy, but now that I am still here, I want to get back into it. I miss it so much. 2athena2--I do not get why stop med that was working.also, let me understand what u r saying, Afinitor is no good.",
      "MessageIndex": 42,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jul 30, 2017 02:40AM Sue2009 wrote: congrats on 37 yrs, may god bless you will many more",
      "MessageIndex": 508,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Aug 18, 2018 10:40PM Sue2009 wrote: Liver pain is much better since steroids. My CEA since Aug 1st has doubled. Going to rescan liver this week to see what is going on. On Abemaciclib, 2 months now. Dr thinks lining of liver was inflamed, like a pleurisy.",
      "MessageIndex": 9488,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 5, 2017 10:17AM Sue2009 wrote: hi ladies, I am glad I came across this thread. Kandy, I was reading your last month thread about your progression. Your story sounds too much like my own. I did radiation last Oct thru Early Dec for bone mets to left hip & lower back. During treatment I had an episode of left femur pain that was over a 10. I was crying, took pain meds starting at 3 am, every hr with no relief. My mom was taking me to radiation, when I got to facility we got a W/c. RO thought I was having a flair. He put me on steroids, which helped. Fast forward to this past 2 weeks. My left femur & hip are giving me great pain again. I was sent to orthopedic oncologist cause MO said my last pet scan looked like I could fx my left leg just walking around. The ortho dr did plain x-rays & thought I was ok, pin not needed. Now leg pain is progressively gotten worse since I saw him. I have also been very depressed w/my progression. Had port put back in last week so can start new chemo treatment, Halaven, starting this week. Because of my pain & depression, I have spent too much time in bed. Now when I try to get up I become very short of breath, very quickly. I am so tired of all this, it has me wondering if it is time to call it quits. My initial goal when 1st dx'ed was live to see youngest son graduate HS. That happened last May. New goal is get to see grandchildren, which is not happening very soon. Lordy, I wrote more than I intended. Thanks Kandy for sharing your fx experience. I have felt certain something is being missed, I think I need to request an MRI. Su",
      "MessageIndex": 8,
      "PostDate": "05/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852327",
      "Title": "Unexplained Leg Pain kayrnic kayrnic"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 24, 2018 11:08AM - edited Sep 24, 2018 11:08AM by Sue2009 ahh, this thread has struck a major cord for me.Dr Philly, u do look beautiful. My MO also has cancer & told me from day one. We actually met when I was in HS & volunteering in an ER he was doing part of his residency. Then we ran into each other when I was in college & he in private practice. 30 years later, he is my 4th MO. I was working as an RN in hospital, so no keeping secrets from colleagues when initially Dx. Hated when I walked in lounge & conversations abruptly stopped. I hit it head on back then. 4 yrs later I went on disability & no longer shared info. People thought I was cured. Amazing how little people understand about MBC. I know we bring it on ourselves as we try to be strong, esp'ly for our children, mine were 13, 14, 17, 19, 21 & 24 at time of Dx. Now they are 21-33 yrs. I am so glad I have been around for their major accomplishments so far. Most do not want to talk about my illness, my 30 y/o son, now an MD is very supportive of any of my choices. Liver mets since June is dragging me down . Not sure how long ago, but my DH finally gets how bad I feel & treats me like a queen. Still going to keep info to myself, but my closed friends & family get it & I appreciate their calls & concern. Sue.",
      "MessageIndex": 26,
      "PostDate": "24/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/867178",
      "Title": "Vent about long term treatment Larkin Crazeejane"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 6, 2017 04:05PM Sue2009 wrote: Cliff, I went from Zometta to X-geva, for convenience , quick shot verses once waiting 2 hrs for zometta infusion. Back to zometta because it was better tolerated. Deanna, your experience sounds like mine , but I refused to go to the ER. When I text my family that I was having a hard time & was in great pain, my husband text me back saying I was a rock, & out of 6 grown children only 1 responded, my austistic son , w/\"I love you mom\" I called my husband after that, crying & yelling very loudly, \"I am not a rock!!!\" I laugh at it now, but my poor husband didn't know what to say. He finally asked if my son was there yet to pick me up, & I said yes, he just got here, but instead of coming in to get me, my 24 yr old son went across the street to play basketball. I had to hobble to the door to yell at him. One of the downfalls of having 5 sons, 1 daughter & a husband who don't like to talk about my cancer. Thank you BCO for giving me a place to vent & learn from others goingthru similar experience of Stage 4 BC.",
      "MessageIndex": 15,
      "PostDate": "06/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852327",
      "Title": "Unexplained Leg Pain kayrnic kayrnic"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Aug 18, 2018 09:55PM Sue2009 wrote: my dear sister, I wish I knew your name. I know your pain too well. I was Dx at age 47. After the grueling year of chemo, bilateral mastectomy, followed by radiation, I was told I had one spot of mets in my right intermammary lymph node , original Ca in left breast only. My mom told most of my relatives I was dying. I have now battled w/bone mets since 2013, fractured pelvis 3 times last year in 3 different spots, more radiation. Last summer a tumor was growing behind my eyeball, more radiation. This past June I was told I have liver mets. My husband & I decided to only tell a few very close friends & a couple of my children. My mom must suspect , but hasn’t said anything. Everyone deserves time to grieve , I call it my pity party. I have only gotten worse, but I am trying to stay positive. I had severe liver pain 2 weeks ago, but it is now minimal. I screen my calls, do not answer anyone who may bring me down or who I am not in the mood to talk to. Those who can’t handle your Dx should be brought in to talk to family. 10 years, I have been fighting, I refuse to give up yet. Reading these boards helps a lot. Stay positive & remind loved ones how important it is for them to do the same. Parents, children & spouses are tough, sometimes u have to just cry w/them. 😪 Sue",
      "MessageIndex": 1,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866685",
      "Title": "Dealing with Upset Family after Diagnosis Chevy226 mara51506"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Oct 10, 2015 10:11PM Sue2009 wrote: I recentl had sciatic pain, medrol dose pack helped & radiation.",
      "MessageIndex": 6,
      "PostDate": "10/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/835610",
      "Title": "Any Medication Recommendations for Sciatica Pain GoldenGirls GoldenGirls"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 24, 2016 09:09AM Sue2009 wrote: this thread is blessing many, I don't know how to post picts, but I love the ones you all are sharing, u guys have lifted my spirits & I am sure many others.",
      "MessageIndex": 151,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839278",
      "Title": "Rosevalley - this is for you! Zillsnot4me Kandy"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 29, 2014 09:36PM Sue2009 wrote: I agree w/ Diane. I have been dealing w/ chronic pain for over a year & just started a clinical trial in June that is working for me. I too do not tell extended family what's going on. My husband & 6 children know where I stand, but I do not wish to cause undue anxiety to my elderly parents or my siblings. We don't talk about my cancer at home, cause I just think we should be as positive as we can be & I have told my parents I will let them know when it is time to worry. My mom told my cousin last year I was dying. I took her to dr appt & had my oncologist tell her I could be here another 10 yrs. That's when I decided not to share so much w/ her, she was more depressed than I was. Prayers for your sis, my sister has always been my best friend, I am guessing you r too. Hope to hear positive news. Sue",
      "MessageIndex": 9,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824953",
      "Title": "Please...could you give me advice? mollyart DivineMrsM"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Aug 9, 2018 05:32PM Sue2009 wrote: hi ladies, last time I read thru this thread I wasn't impressed w/what I was reading. So, today out of frustration with no one to talk to about this liver mets I came back here. Raven, your messsage on Aug 7th is so much the same of what I am going thru. I was Dx w/liver mets end of May after getting septic & had to have port pulled. I had been having a good run w/Halaven up to then. My liver mets since then seems to be moving fast, my markers went from 60 to over a thousand last week. My dr started me on Abemaciclib. After 4 weeks I have woken up today with the most liver pain with referred pain to my right shoulder. A lot of the responses have been very encouraging. My MO has not mentioned Y 90. Does anyone know if you can do Y 90 or SRBT while on oral chemo drugs? JFL & others have been so encouraging as I am still in my pity party stage over this. Thanks, Sue.",
      "MessageIndex": 9427,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Aug 15, 2018 04:24AM Sue2009 wrote: Raven, white counts do come back on their own or Dr may prescribe med given by injection to help your body out. Also, your white count may have a new lower count, which is considered your new lower acceptable for you. My WBC never goes above 4, unless I have an infection. I rarely do not go shopping any more & avoid crowds. One more time, some one please tell me if you have ever had liver pain, that hurts most when I take deep breaths, cough or burp.it is so sharp & definitely a 10 on the pain scale. Started on prednisone 2 days ago, which has taken the edge off. Just told I had liver mets end of May. Thanks all, keep hanging tough, Sue.",
      "MessageIndex": 9449,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Feb 22, 2017 02:14AM Sue2009 wrote: Effexor, not only helps w/hot flashes, help w/depression. Changed my life too Linda",
      "MessageIndex": 13,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/852913",
      "Title": "HOT FLASHES - Please help!! Cosmogirl Cosmogirl"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 20, 2016 10:45PM Sue2009 wrote: u r not alone in your grief, these above ladies know what they r taking about . I felt same way 2 1/2 yrs ago, still fighting the good fight",
      "MessageIndex": 6,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840510",
      "Title": "How do I accept my stage 4 prognosis? lisajo6 Iwillwinthisbattle"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 15, 2013 09:03PM Sue2009 wrote: Chanah, u have no worries, u will love time w/family. I was dx w/bone mets last Feb. I was so beside myself. I requested call from survivor thru MD Anderson & wonderful woman told me how dr told her to get affairs in order cancer had mets to spine & lungs. She went for 2nd opinion at MD Anderson got treatment & that was 10 years ago!!! I am looking forward to 2 weddings, 3 sons graduating (HS, Bach. & Med school ) next spring & plan to see grands in the future.",
      "MessageIndex": 28,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810824",
      "Title": "Anyone else feeling positive - making longer range plans? chanah Iwillwinthisbattle"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Mar 3, 2015 03:39AM Sue2009 wrote: I am in 3rd stage of Palbo clinical trial. I have been disappointed w/ the drug. I have had to go down to lowest dose, 75mg & I only get to take it for 2 weeks on 2 weeks off. Bone scan today showed progression of bone mets. My family has been dealing w/ the loss of my 20 yr old niece. She committed suicide over a broken relationship w/ young man she dated 2 yrs. I am hoping my mets is due to the grief I have been experiencing. Anyone else every see progression after traumatic event? ",
      "MessageIndex": 94,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827475",
      "Title": "Palbociclib (Ibrance): Who would get this? RosesToeses Moderators"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 22, 2016 07:22PM Sue2009 wrote: had PET last Monday, I always take 1 mg Ativan & close my eyes & try to relax. The frustrating part was keeping arms above head, afterwsrd tech says I could rest arms against wall, wish he said that at start.",
      "MessageIndex": 14,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/840180",
      "Title": "Scheduled for a PET scan and worried about clastrophobia Firstmate52 VivianS"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 20, 2018 06:59PM Sue2009 wrote: Tristaan , like everyone else, I am truly saddened to hear of your loss. I appreciate your words regarding this not being good-bye, but see you on the other side , I constantly need reminding of that. Tennille- I am new to liver mets as of beginning of June. Chemo failed me & today I finished twice a day radiation to my liver & right shoulder. I had tumor markers checked a month ago & then 2 days ago. I was so sad & quite weepy to have my CEA triple in number. My RO has been trying to reassure me that this is due to the dead cancer cells in my liver. Next week I will get a dose of imprexa, May be spelling that wrong. I feel like I am holding on by a thread right now. Any thoughts or ideas from anyone having received imprexa will be welcomed. Some asked about Xeloda. It was definitely rough on the hands & feet, was working for me until I got septic from diarrhea. 4 different bacteria in my blood stream, 104 temp, thought that was the end of my story. That was 3 summers ago. I got back from a weeks vacation in NYC last Sunday, happy to still be here. I refuse to give up easy, but I can see it in my dr’s eyes that things are not going too well right now. Love to all my met sisters, Sue.",
      "MessageIndex": 9774,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Jan 22, 2016 07:16PM Sue2009 wrote: Sattipearl, I was about to look for a more up to date A/A thread. I am on day 3, took it w/dinner, but going to try at bed time due to nausea, some GI cramping. I started it in dec, but after 2 weeks on lowest dose stopped due to neutropenia. Feel so weak too. Very frustrating, was looking to see if it gets better. Was on Palbociclib & I got better after I went on lowest dose.",
      "MessageIndex": 37,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Mar 11, 2016 11:35PM Sue2009 wrote: Sattipearl, how amazing, must of been very emotional. Anyone else struggling w/affinitor? Tried to bump me up to 5mg, made me tired, sore throat & cough. Dr worried about pnuemonitis says may also put us at risk for mets to lungs. They have started me on singulair & stop affinitor until cough goes away. very frustrating.",
      "MessageIndex": 47,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794038",
      "Title": "Starting Afinitor and Aromasin, what to expect? hope10 Rseman"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Oct 13, 2017 12:32AM Sue2009 wrote: Hi Kandy, have been following you from a distance since last Jan when u reported things were going down hill. I am glad u r still here. As I am too. I have been through so much in the last year. My 4th MO retired as of Sepf 1st. In July I spent a week-end in the hospital ruling out leptomeningeal brain tumor. I have had radiation to my left eye & skull. My new MO who I had high hopes for informs me he is being treated for prostate cancer. During treatment to tumor which was actually growing off my skull behind my left eye ball, I slipped on wet tile, fractured my pelvis & caused a compression fracture, making it impossible to be on my feet more that 10 min. So new MO has started me on doxorubicin, says it is not same adriamycin I had in 2009. After one dose my ribs hurt worse for a week or so. Now 2 weeks later, I actually feel better. Very confusing , but thrilled pain is better. You remain in my prayers, may God hear our pleas. Sue.",
      "MessageIndex": 805,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "May 8, 2016 10:21PM - edited May 9, 2016 05:21PM by Sue2009",
      "MessageIndex": 46,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/843900",
      "Title": "Completely Scary Topic: How Do We Die? blainejennifer magdalene51"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "May 8, 2016 09:34PM Sue2009 wrote: I love to read, usually 2-3 books a week. For mother's day I got a book called March by Geraldine Brooks, she got a Pulitzer Prize for it. I read The Secret Chord by her last year & loved it. Let me know next book, I usually read 2-3 books at a time. I tell my dr this is one of the best of things about stage 4. No one bothers me if I am reading",
      "MessageIndex": 8,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/844061",
      "Title": "Book Club: A Man Called Ove, response questions Fitztwins Fitztwins"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Mar 3, 2015 08:56PM Sue2009 wrote: Thanks for response SryMom. I am going to try to stress less. Unfortunately palbociclib side affects were too hard on me. Was always tired, esp. when ANC dropped to 1000. Right now my mind is in shock, just don't know what to think.",
      "MessageIndex": 96,
      "PostDate": "03/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/827475",
      "Title": "Palbociclib (Ibrance): Who would get this? RosesToeses Moderators"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Sep 9, 2014 03:31AM Sue2009 wrote: prior to having BC I hated celebrating my birthday. My husband threw me a surprise 50th party & I loved it!! I recently drove from Florida to Mich. to celebrate a dear cousins 50th, another wonderful family get together I won't forget. Having BC has definitely made me appreciate life much more.",
      "MessageIndex": 18,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/824331",
      "Title": "Celebrating Life....now.. Fitztwins Sue2009"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Dec 8, 2017 08:22AM Sue2009 wrote: Still praying for you too. This downhill slide sucks. I had a tumor growing behind my left eye that has been radiated. I asked for follow up scans today cause I have been very dizzy at night. My pain has stayed pretty much under control thanks to fentyal patchs. I drink boost everyday. I have lost 10 pounds since July & spend the majority of my days in bed. My 6 kids came for thanksgiving, I thought 2 christmases ago was going to be my last, but I am still here. You can request home health for IV fluids. Hang tough, 💕 Su",
      "MessageIndex": 950,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851792",
      "Title": "Unfortunately things are going downhill Kandy Beatmon"
    },
    {
      "AuthorID": "Sue2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186037/profile",
      "Content": "Oct 4, 2014 01:49PM Sue2009 wrote: another Sue here who has grown to love my comfy bed. I have become very well read, started keeping track of books I have read, & new words I am learning, love that u can type word on note pad of cell phone & get it defined immediately. I have been learning Spanish on my I-pad, highly recommend Duolingo. Of course there r also some great new shows on TV these days. So when I am down I still feel very productive. That is not to say I don't end up sleeping thru some shows cause I do.",
      "MessageIndex": 9,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/825100",
      "Title": "To those who are stuck on the couch sueopp PattyPeppermint"
    }
  ]
}