{
  "AuthorID": "sue50",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78857/profile",
  "Posts": [
    {
      "AuthorID": "sue50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78857/profile",
      "Content": "Nov 14, 2009 10:01AM sue50 wrote: My real boobs have been gone since 02, and I had saline foobs until fall of 08.  Count me in for extremely low libido, sex is on the chore list, but I have a wonderful DH. I think I have drawn into myself for strength too much lately; must Stop That and Dwell outside the shell (that was good advice, Pamelajo) Issues are not over by any means but we did have a couple interesting moments I will share: 2002: the day I came home from my first bilat: we snuck in the bathroom (how romantic!) while our 5 year old was downstairs watching a video. I had on wound dressing, drains and all. Probably standing up was good since it avoided pressure on the site, but we weren't thinking about that!! LOL! It was good to be home!! Afterward, we laughed, and said, well so much for worrying about sex after mastectomy!  In hindsight, it was probably easier since I had not yet seen my scars.  He never did know what to do with those implants. Very little touching, since he knew I couldn't feel it. I did look terrific in a swimsuit, better than my real ones, but in the bedroom, they were just kind of there. Like the lamp and the alarm clock. Fast forward to Jan 09: my second bilat, this time with no recon, and now dealing with chemopause/Tamoxifen with dryness etc.  My low libido thing is very tough but we occasionally manage to have a tryst, when I feel like I can manage it, poor DH! maybe once every 1-2 months, yikes, that's not very often. One time I just took his hand and placed it on my scar, I dunno why, I just wanted to give him permission. It was kind of a special moment, kind of odd, I know, but, maybe some of you gals might consider something like that. I think it may have helped. I recently started Replens also, thanks to the many comments about it. I had been sore following a yeast infection and healed up nicely after the Replens. Hang in there Ladies!",
      "MessageIndex": 74,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740559",
      "Title": "I need help in the bedroom - any advice? Asterix1234 TaminMo"
    },
    {
      "AuthorID": "sue50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78857/profile",
      "Content": "Jan 1, 2011 11:13AM sue50 wrote: Hey Maria, Here's bits of my story, maybe it will help you in your decisions:   My mom had her mx while she was still teaching Jr High back in the 80's. Her students asked the substitute teacher, \"what's wrong with Mrs P?\" The sub said \"she had a tumor removed\". The kids said \"where was the tumor?\" and the sub said \"on her body.\" and they were satisfied with that.  I had my first mastectomies when my son was 4 and we did not tell him much... All he knew was that mommy had to visit the hospital for a few days...but then Nana was coming to visit!!! (I kept the focus on the positive aspects) Nana drove us to his kindergarten screening because I still had the lovely DRAINS under my shirt and wasn't allowed to drive yet.... 6 months later I had my implant surgery and my son exhibited some anxiety (didn't want to go to school) but quickly recovered. Maybe I should have had Nana come back as a distraction....! When I had my recurrence( and chemo), he was 11 so we explained everything. I asked him to cut my hair off when it was falling out; that was fun! He also made jello for me when I was sick, and we went to a cancer walk and I think he enjoyed being seen as a caregiver. He saw a few minutes of a couple of the chemo infusions (then Dad would take him to the science museum) but I don't think I would have let him come to the chemo clinic as a 4 year old. I think if I had to do chemo with a young child at home, I would explain it as funny medicine that will make your hair fall out....but mommy has to take it for a short time because the doctor said so. Just like sometimes kids have to have shots that might hurt for a short time. I wouldn't try to paint the big cancer picture for a 4 year old. If you are a praying family, I would ask the young child to remember to pray for you, just like you pray for him when he's sick.  Regarding chemo for Stage I, maybe some stage I gals will weigh with their experience. I would do the chemo if it's recommended by an onc. that you trust. If you don't trust your onc, find another one.  When I first was dx, I was only stage 0 and had no chemo or rads. 6 years later it came back in a worse form. Now I travel 3 hours to go to my new onc, but to me, she's worth it! Hang in there, hope this helps in a small way.  Hugs to the little one from me!! Sue ",
      "MessageIndex": 4,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    }
  ]
}