{
  "AuthorID": "sue_from_wi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
  "Posts": [
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 29, 2011 08:21PM sue_from_wi wrote: Welcome, Susan. By my count, we have 13 in our group now. Just a quick update for those of you starting tomorrow: Chemo #1 is history for me and went well overall. During the treatment itself, I felt perfectly fine, though VERY sleepy from the Benadryl and of course you can't get any sleep when your vitals are being checked every half hour. I'm about 6 hours post treatment now and have minor naseau and a strong buzz for the steroid dose. I had mild tingling in my legs for a very short time.  I have drunk and drunk and drunk water today and am now sipping Yogi brand Ginger tea which I have loved for years and which seems to be helping with the nausea. I am so happy to have this first treatment behind me. I know some SE's could raise their ugly little heads tomorrow, but I'm going with: so far, so good.",
      "MessageIndex": 65,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 3, 2011 09:12AM sue_from_wi wrote: cfdr - Thanks for all the information and the update. You have been through some tough times already. I'm hoping, with you, that the Lexapro will keep the headaches away plus help with anxiety and depesssion.  I'm really looking forward to the LGFB workshop - I'm going Nov 1. Hard to say what shape I'll be in then - my chemo nurse said I may not lose much hair at all. But, like you say, there are other good reasons for taking the class, like good hygiene. Plus you get free stuff. Yesterday, I had terrrible heartburn so I am REALLY watching what I eat today. Just trying things on mentally first to forsee if it will sit well or not. Also I was drinking lots of club soda but that strikes a wrong note today so I'm done with that.  Had lots of bone pain last night. The clinic I go to does not routinely give the Neulasta shot with my treatment regimen - they test first, then give it (warning that by doing it this way, I may have to delay a treatment). But I figure even without the shot, the pain bone may have the same cause - my marrow working overtime to produce white blood cells. Does this seem reasonable? I took a Claritin since I know I tolerate it well and it does seem to have helped some. Deciding I just couldn't go into work today so I'm working 1/2 day from home. I have the sort of job where that is accepted and common and doable - very thankful for that. And for a supportive boss.",
      "MessageIndex": 100,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 9, 2011 04:08PM sue_from_wi wrote: Dear Oct 2011 chemo sisters, I'm sorry I have been scarce here. Nausea hit hard Wednesday night and I have been battling it since. The Compazine seemed to make it worse (terrible cramping along with more nausea and I could not keep my eyes open). So I'm off that and just dealing with the now manageable nausea with Sea Bands and very small very bland meals. At least I am able to be awake for hours at a stretch. I won't go into how hard the last several days have been. The first MO I saw (not the one I ended up with) warned that symptoms could get worse 8-10 days out because (as someone mentioned in an earlier post) of the drop in WBC. I tucked this in the back of my mind, but didn't hear it from anyone else, so I hoped she was wrong. Turns out she wasn't. One thing that has made me angry/sad is how several of my 'alpha female' friends have pretty much denied that this is all a result of chemo: 1) there must be something else going on, 2) most people get over it in two or three days and 3) you really have to get in and be seen. I have really regretted having any sort of interaction with them. I know they mean well but what I wish I had had the strength to say is 1) I didn't know you were an expert on chemo 2) I've very happy for them but that's not been my experience and 3) don't you think I know that and don't you know I am doing EVERYTHING I can to feel better? Take care all.",
      "MessageIndex": 166,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 16, 2011 03:48PM sue_from_wi wrote: Hi, all, I've been following along with all the posts, laughing and crying and praying as I go. This is a fine group of very funny very upbeat very courageous women. I got my hair cut VERY SHORT on Friday. The buzz will be next. I wore my hair short (not this short, tho) for years before growing it long over the past 2 years, so it's not that much of an adjustment and people have been very complimentary. But what really warmed my heart is when I saw my 17 YO DS that night. We both had caps on. I took mine off to reveal my shorn head. He took his off to reveal a very close buzz. He said he did it to show solidarity with me. So sweet. He doesn't say much but I know he is feeling this. I had 4 good days last week free of nausea. Yesterday it came back but today I am feeling all right. I'm hoping for 3 good days before my next treatment on Thursday, but I'm learning to very much take it one day at a time and not be discouraged. Thankfully my work place is very supportive.  Love and hugs to all -",
      "MessageIndex": 266,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 20, 2011 05:22AM sue_from_wi wrote: Lori - my latest blog post shows one chemo cap option you may want to consider for days like these - it's called 'Paper Bag Over the Head'. Just for laughs, of course, but I think we all feel like that sometimes during our normal lives and I'm feeling it ever more now during my chemo phase when there is just so much going on with my face and hair. Sorry to say I don't have a more serious tip for you. I used Zegerid (now OTC) for heartburn and had good results (for those who may not like Zantac). The Pepto Bismol I usually use didn't touch the chemo hearburn. Anyway the Zegerid came packaged in 14 day doses but I stopped after 4 or 5 days. I would have started again if I needed to but I trying to keep the between chemo drugs to a minimum.",
      "MessageIndex": 333,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 23, 2011 03:18PM sue_from_wi wrote: perts1 - ouch - sounds bad! I haven't had nearly the same extent of issues but have noticed some tenderness and have been using Preparation H to keep things in check. I recall someone use recommended Desitin or some other diaper rash type ointment. I also had bad cramps when I was on Compazine, but none since I stopped taking it.",
      "MessageIndex": 380,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Nov 4, 2011 06:44AM sue_from_wi wrote: Terry71 - LOL! chemo brain for sure! Quick recommendation about heartburn - I found Zegerid OTC to work very well. I just take one per day as needed, though it came packaged in sets for 14 day doses. ",
      "MessageIndex": 583,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 28, 2011 02:31PM - edited Sep 28, 2011 02:34PM by sue_from_wi Thanks for the welcomes! My DH is pretty wonderful, too. Maybe we should have a contest",
      "MessageIndex": 47,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 30, 2011 03:51PM sue_from_wi wrote: Carla - so glad to hear you are tolerating your first treatment well. I'm not over 24 hours post Tx #1 and feeling well, too, even with the dental work this morning to replace a crown. Funny how things can kind of pile up like that. I agree with you about the nausea - it's really hard to deal with. I've been wearing the SeaBands they gave me at the last surgery - don't know if they help but I figure they can't hurt. Best wishes to all the other newbies.",
      "MessageIndex": 76,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 30, 2011 04:43PM sue_from_wi wrote: Sherrybaby - welcome! You are our 14th member. Let us know when your dates get set so we can think of you and pray for you then. Surreygirl - glad it's going well for you so far. I hope they gave you something good to stay on top of the nausea. Thanks for your good wishes for me - it's been a day largely free of SEs. Normandy18 - my son and his teacher and her son and I spent several days in Honfleur last summer. We totally fell in love with France but feel we got the merest taste of it in the 10 days we were there. My dad was one of the Army Rangers that landed on D-Day, so we visited those sites and tried to understand what it was like for him. He was so very young then. Where in Normandy do you live?",
      "MessageIndex": 79,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 11, 2011 08:29PM sue_from_wi wrote: WIMusicMaker - Praying for you and quick return home.I am going to talk with my center on the 18th about an after hours contact number. They need to have one. Period. I, too, haven't had any scans and no talk of scans except the MRI on both breasts and an echo for my heart (because of the Herceptin). cfdr - thank you for understanding Your response really lifted my spirits and I think you have exactly the right perspective. Thanks for putting it so well.",
      "MessageIndex": 198,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 20, 2011 04:36AM - edited Oct 20, 2011 04:36AM by sue_from_wi Maya - so very sorry to here about your port issues. Praying that the anitbiotics clear up the infection. There is an article on Wikipedia and other sites about picc lines. My port has been trouble free so far, I'm thankful to say. Dia123 - poor night of sleeping for me too. I'm glad you made it to class. I didn't drive until Saturday after my Tx on Thursday - just felt too disconnected and unfocused. Thankfully, my DH was available to drive me that time and my sisters are here this time. Gearing up for Tx #2 at 1:30 today. Curious to see how it goes. I had lunch with a work friend on Monday. She went through this 10 years ago and said she thought the first Tx was the hardest as far as side effects go. She felt her body handled the subsequent treatments better, because it knew what was coming and how to adjust. I can see how this might be the case and am hoping it applies to me and to all of you as well! ",
      "MessageIndex": 329,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Dec 5, 2011 02:25PM sue_from_wi wrote: Hurray for Auntienance and for Kathy! And for me - my last TCH is tomorrow. Will continue on H for a year. And will start radiation in January. I had BC radiation in 2007. It was a drag and a grind but a piece of cake compared to chemo.",
      "MessageIndex": 980,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 2, 2011 06:01AM sue_from_wi wrote: WIMusicMaker - I see you are a music teacher somewhere in WI - where? I live in Baldwin - about 40 miles east of St Paul. My chemo nurse warned me I might crash yesterday and I did. Felt very brittle and shaky and had a low grade fever. This was toward evening, after I got the house cleaned and did some organizing. Wildrumara, you summed it up pretty well: loopy, flushed & fatigued. I'm going to lay low today, but will be thinking of you and praying for you all.",
      "MessageIndex": 96,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 3, 2011 12:49PM sue_from_wi wrote: TAPPY - I have to have a cavity repaired - pulled out an old filling while test driving a ginger chew that was supposed to help with nausea - ironic! Anyway, I felt I couldn't go through chemo with things in this state and my dental office got me in for the temporary seating the day after my first treatment. Not ideal timing and the temporary work makes everything taste bad on top of everything else, but, I did enjoy the nitrous oxide ride :) I go back in for the final crown next on the 14th.",
      "MessageIndex": 104,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 3, 2011 01:04PM sue_from_wi wrote: WIMusicMaker - great idea about the pictures and remembering why we are doing this. I just looked up Grafton - don't get over to that side of the state much except to go to the Jesuit Retreat House in OshKosh around advent time. I'm also not a big sports fan, but it IS cool that our Wisconsin teams are doing so well. Hoping for the best for you today.",
      "MessageIndex": 105,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 10, 2011 11:25AM sue_from_wi wrote: WIMusicMaker - sounds like an ordeal! I almost went to the ER on Sat night - spiked a fever of 101.5. Took a Tylenol and called our insurance company's nurse line. By the time I got on line with the excellent nurse there, my temp had already dropped to 100.5. She asked a bunch of questions to rule out the more serious possibilities so I felt more comfortable taking a wait and see approach. Fever climbed pretty high Sunday morning but has been under control since then. I DID find out that there is no good way to get ahold of my MO on the weekend or after hours. Did your center give you an after hours contact number to call?",
      "MessageIndex": 181,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 11, 2011 08:36PM sue_from_wi wrote: dia123 - My first treatment lasted (TCH) 3 1/2 hours. You will most likely feel fine the first night. You could be worn out from the experience and you may be sleepy from Benadryl but maybe there will be enough time for a nap in between. What time of day is the treatment and what time is the class?  You and I are practically BC-Twins - looks like your tumor was larger than mine but otherwise we're a pretty close match. Welcome to the group! There's a Triple Positive group that is very active and posts a lot of good information that you might want to check out, too.",
      "MessageIndex": 199,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 18, 2011 06:43PM - edited Oct 18, 2011 06:59PM by sue_from_wi",
      "MessageIndex": 313,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 29, 2011 05:42AM sue_from_wi wrote: Hi, all, I'd like to hear your thoughts on: Wig or No Wig? I'm leaning to the No Wig side. Also has anyone taken the Look Good...Feel Good class offered by the American Cancer Society? Again your thoughts on whether it would be better to take this before hair loss or after.",
      "MessageIndex": 52,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 25, 2011 06:11PM sue_from_wi wrote: WIMusicMaker - feeling for you and your frustration. I am so sorry you're having to go through this.",
      "MessageIndex": 411,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 10, 2011 05:27AM sue_from_wi wrote: Pippen - I hope you are feeling better and stronger today. Did you get to eat your soup at home? Carla - I'm going to ask about Ativan. Thanks for the suggestion. I am also using a homeopathic nausea treament (antimonium crudum) which seems helpful. Lori - ditto what you said. Even on the days when I'm not up to posting, I get a lot of support just from reading what the rest of you are writing. How is everyone's hair doing? Mine is definitely starting to trickle out. I wasn't expecting to have this happen until after the second Tx - I suppose the rate will really pick up then.",
      "MessageIndex": 174,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 23, 2011 12:41PM sue_from_wi wrote: cfdr - I had my hair buzzed on Thursday and noticed the same thing - my scalp no longer hurts. And I don't look all that bad as a baldie! AND people seem to recognize me as a 'chemo lady' and are unsually kind. It reminds me of the nice vibes people would send my way when I was waddling around very pregnant. Kind of heartwarming.",
      "MessageIndex": 378,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 24, 2011 04:51PM sue_from_wi wrote: Yeah, those steroids are crazy - my knitting speed doubles when I'm on them. And talk talk talk a mile a minute. It's sweet to read all the posts and share what we're going through and feel the support. It's Day 5 Chemo #2 and my temp is starting to climb so I'm going to take an ibuprofen and see if that knocks it down.  Cheers to the awesome October 2011 chemo ladies!",
      "MessageIndex": 396,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Nov 16, 2011 02:25PM - edited Nov 16, 2011 02:48PM by sue_from_wi I've been lurking, following all the posts and checking out the pictures. I changed mine to a recent one of my son and me - he showed his solidarity by getting his head shaved. That really warmed my heart. I'm on Day 7 after Chemo (TCH) #3. Neuropathy and bone aches hit hard Sunday and Monday but I've felt good after a great night's sleep Monday night. I'm anticipating trouble on Days 8, 9, 10 since that was the pattern the first two times, but maybe that won't happen this time. Juls - your 'boomy cottony' description really sums it up. Eyes are funky too at times. I'm very thankful for a generous leave policy at work so I can stay home, work as many hours as I feel up to and nap freely. This really eases my stress.",
      "MessageIndex": 813,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Nov 9, 2011 06:00PM sue_from_wi wrote: I've been reading along but not posting much. You all are an inspiring, funny and warm group of women. Perts1 - I'm trying your lemon-ginger recipe. Ramping up the fluid consumption for Tx #3 tomorrow and I'm already sick of water. Anyone else using acupuncture to help get through this? My acupuncturist put ear seeds in last time for nausea and gave me some magnets which I applied when the symptoms started to build. I didn't have to use Zofran at all after Tx #2 so I believe it was beneficial. I'm all for using meds if needed but I like to try other things first.   ",
      "MessageIndex": 685,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 27, 2011 05:50PM sue_from_wi wrote: Sign me up, too, for this club that no one wants to be a member of. I start chemo (TCH 4x and then H continuing for a year) on Thursday. Best news this week so far, is that I'll only have 4 treatments and I was expected 6. Worst news is that I pulled a filling out of my tooth while taking a ginger chew (to combat nausea) for a test drive. So I'll be going in on Friday to get that fixed. One more in a long list of appointments. I'm going to read back through all these posts and try to get to know you all a little. I'm really glad to have a group of virtual friends to stay in touch with through this.",
      "MessageIndex": 40,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Sep 28, 2011 07:37PM sue_from_wi wrote: @Tappy - I'm holding onto the same hand you're holding on to, PTL! My MO used the Adjuvantonline.com site to show me the numbers - explaining why chemo was advised despite negative nodes - namely because it was medium sized and had several markers for being fast growing. I found that really helpful. @Carla -  You've been through a lot more than me already, but I share, in some ways the unreal sense. I'm planning to be back on work on Monday after my first treatment tomorrow. May we all be among those who breeze through! ",
      "MessageIndex": 50,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Oct 24, 2011 01:18PM sue_from_wi wrote: Any one else dealing with a very husky voice? Certainly not a serious side effect, but it makes it hard to talk.",
      "MessageIndex": 393,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "sue_from_wi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133903/profile",
      "Content": "Nov 9, 2011 08:23PM sue_from_wi wrote: Thanks, TallM. Actually, I've been a member practically since Day 1 but infrequent poster. Let me say a warm welcome to you, too Sounds like you have a hard road ahead of you and the lion's heart to win the battle. I've never had reflexology but anything that helps you feel better and relax has got to be good. A good practitioner of any kind with a healing touch is a gift from God. Perts1 - love the lemon ginger water. However, DS likes it too so I might have to fight him for it! WIMusicMaker - tough times and tough wait and tough decision for you. Extra prayers for you tonight.",
      "MessageIndex": 687,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    }
  ]
}