{
  "AuthorID": "sueelizabet…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
  "Posts": [
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Feb 26, 2009 10:43AM sueelizabeth676 wrote: Again, thank you for your responses everyone.  I have my surgery consult today so I'll let you know how that goes. :-) ",
      "MessageIndex": 8,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729500",
      "Title": "new here - worried, please read sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Feb 21, 2009 09:55PM sueelizabeth676 wrote: Thank you to all those that have responded - I've been slowly, gradually become nervous over the last day and your responses were much appreciated.  I'm not surprised that my personal doctor sent me to U/S so fast - she tried to convince me to get a colonoscopy at 20 for some intestinal problems and I had a head CT last year after having headaches and memory loss.  My mom always rolls her eyes at the tests my doctor tries to order, but she really is just trying to be thorough. I've never been to someone that listens so intently, and for however long you need them to, like she does.  Because of that, her quick referral to U/S did not surprise me - it was the reactions and quick referral to consult that got me a little freaked.  But I guess I would much rather have them be quick and thorough than ignore me because of my age.   Second question: If I do chose to do the excision... I'm really worried about the scarring/disfigurement.  Whatever it is, it is deep (down to my ribcage) and large - at least 1 inch long, although they were having difficulties getting good pictures of it.  Normally I would not even think about being vain in the face of possible illness, but I have finally started to really recover from severe body image issues that, over the course of 11 years, left me hospitalized more than twice.  I'm healthy now, but I'm worried that this will start those issues all over again.  Does removal often leave a significant and permanent indentation? ",
      "MessageIndex": 5,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729500",
      "Title": "new here - worried, please read sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Mar 5, 2009 07:37PM sueelizabeth676 wrote: Well I just thought I'd give an update - surgery is scheduled for tomorrow afternoon (friday).  They're doing an excision/lumpectomy through the nipple (ouch!) on a BI-RADS 4 probable fibroadenoma.  The past two weeks have been up and down, but I am ready for this.  Still scared of the surgery itself, the anesthesia and all that, but I'm not worrying about post-op.  I feel like I went behind my doctor's back - I got a printed report from the radiologist and a copy of my images.  I got the U/S images for my own curiosity (I'm very interested in medicine), but I got the report because my doctor seemed like he was avoiding my questions at the consult, did not have a copy of my U/S to show me, and did not tell me what the U/S findings were.  I am so glad I did - I was surprised my \"probable fibroadenoma\" was given a rating of 4, but it made more sense to why they are being so quick about all of this.  Plus, a benefit of the report is that my parents called my uncle who is a radiologist at the University hospital and read him the report to see if there was something hidden within it, and he said that they are acting so quick because of it's size and how quickly it grew.  For some reason, all of this made me feel much better (at least I know my doctor is not just scalpel crazy!).   Thank you to everyone who supported me from the beginning.  I had no idea what I was doing when I presented my lump to my doctor.  These past 2 weeks have been emotionally up and down, but everyone on this board have continuously supported me.  Thank you! ",
      "MessageIndex": 11,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729500",
      "Title": "new here - worried, please read sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Mar 12, 2009 11:57AM sueelizabeth676 wrote: First I want to thank everyone for responding.  Even the ones who thought that the surgeon probably had a reason to take that much and felt bad for \"downplaying\" my upsetness.  You did not, and in fact, gave me hope to talk to my doctor because you guys were right, there was probably a good reason.  So I went to my appointment today, and this is what happened: Got to the office and it was PACKED.  At 9 am!  Was told that everything was on time, but after waiting 20 minutes I was taken back and then waited another 20 minutes for my surgeon to come in.  In the mean time, I heard his nurse bringing back 3 other patients, so right away I got the feeling that my consult was going to be rushed. When the surgeon finally came in, he looked at it, saying that the bruising was looking okay.  I want to input right here that over night, my burgundy, blood colored bruising had went down, but the C-shaped burgundy indent was still under the nipple (and away from where the lump was taken out).  I asked him about it, and he switched subjects. He told me that the pain was normal (even though it had gone away and come back three days later worse than it was the first few days).  I asked if I could have popped the internal stitch where the lump was taken out, and he started talking about how bruises can cause pain a few days after surgery.  But this pain is different - it's a shooting, almost contraction like pain, right where the lump was taken out.  I cannot even lightly touch where the pain is at, or it gets worse, and sleeping is almost impossible because I cannot lay my arm down; he told me to take motrin.  Eh, oh well. Anyways, moving on... He told me to use heat to reduce bruising, but ice not recommended (which is what I have been using) even though that it what they told me to do immediately post-op.  He told me to take the steri-strips off myself when they start to curl up and look real ugly, and to also put lotion on my nipple to reduce the risk of my nipple drying out.   By this time, I was getting a little impatient.  I had went in very calm, with the understanding that he took out so much for my best interest.  I was a good little patient.  I decided that would be the time to ask him some questions and have him help me understand the path report.  It was harder to ask these questions than I thought it would be, because although he tends to have a very friendly demeanor, he makes you feel like a child for asking any questions.  He did that in my surgical consult, which led me to get this excision even though I wanted to biopsy it first.  His thinking seems backwards - he had told me that years ago, they would wait on a lump and then if it kept growing they would take it out, but now he just removes all of them to be safe (isn't that opposite to how most doctors act?). First, I asked him if he took out two large samples or one large sample.  Immediately, he said just one, but would not tell me why he took out so much.  I told him that the path report said there were two, both of different sizes, and he said he did not have a copy of my report with him.  Good thing I brought mine!  I showed him the report and he looked amused, chuckled a little, and then got real serious, looked at me, and said the specimen must have fallen apart before they got to the path lab.  That is entirely possible, but the two masses/specimens are two completely different sizes.  I tried to get him to tell me exactly how much tissue he took out, but even though he held my file in front of him, he told me he did not know. It became entirely apparent that he had not even read the path report - because would he not have seen that already?  He probably just read the diagnosis.  Just like my U/S - when I asked to see my U/S and have him explain it to me, he said that he did not have a copy, but drew me a picture of what it probably looked like (he was wrong).   So now he's holding my path report and I ask him to explain some of the findings on there.  He says he does not know what they mean.  I told him I was taking Anatomy/Physiology and some of the findings seemed more like the phyllodes than the fibroadenoma, but it was hard to tell because my path report is so very un-detailed.  So much so, that for the second specimen, all it says is \"a small area with similar features\" but does not say much more besides that there was dense connective tissue in it.   I asked if it was possible to just get a second opinion, because only one person had looked at my report the first time.  I did not demand it and I was not being confrontational, just wondering.  He got very somber and sarcastic and told me that my education was a detriment to me, and that honestly, the pathologist at the hospital was going to be a heck of a lot better at diagnosing than I ever would be.  If I want a second opinion, I have to get it myself, but he will not sign off on it.  I understand that I am an amateur compared to the trained pathologist, but I was just curious and figured since they had taken so much yet said so little that it would not hurt.  Especially since some of the findings were more phyllodes-like than Fibroadenoma.  At that point, I was getting upset and trying not to tear up - I was not questioning that they were not capable of doing their job, but even though my surgeon had no idea how to read the path report, he took it very personal that I was questioning his ability (something I am beginning to think I should have done from the start).   Immediately after that, he wished me good luck in the future and walked out of the room.  I calmed down and left too, and now I am here.  I am planning on going to pick up a copy of the surgical report this afternoon, but part of me worries that he will try to alter it, since I obviously picked up on the two specimen thing.  I know that he should not be able to, but after the way I was treated, I would not be surprised.  I'll let you guys know how everything goes from here.  Hopefully better than now, because I am more confused and frustrated than I was before I ever got a copy of my report.  Thanks everyone! ",
      "MessageIndex": 8,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730559",
      "Title": "Did my doctor butcher me/screw up? FREAKING OUT! sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Mar 12, 2009 12:03PM sueelizabeth676 wrote: Oh, I forgot to point out - on the path report, it said \"two yellow-white rubbery specimens of tissue with tissue measuring from 4.2 x 2.8 x 1.7 cm to 5.1 x 2.7 x 1.3 cm\" and that the tumor was only in the 4.2 cm specimen measuring 1.7 x 1.6 x 1.3 cm - if the two specimens really did \"break apart\" after surgery, why was the tumor only in one and fatty tissue in the other?  Plus, if they were two parts of one tissue sample, how much did he take out total?  Would it be 5.1 x 2.8 x 1.7 cm or do you combine them and maybe he took 5.1 x 2.8 x 3 cm (if it broke in half) or even 9.3 x 5.5 x 3 cm if they really were two different masses?  I'm confused. Oh yea - one last question - how exactly do you read those dimensions?  Are they L x W x H, like a rectangle, or is one of them volume or what?  I read these numbers all over the place but no site actually explains the numbers.  How do I figure out the total volume/area of the specimen(s) he took out?  The path report says nothing about volume or weight - maybe it will be on the surgical report?  Thanks again! ",
      "MessageIndex": 9,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730559",
      "Title": "Did my doctor butcher me/screw up? FREAKING OUT! sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "sueelizabet…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79827/profile",
      "Content": "Mar 13, 2009 03:47PM sueelizabeth676 wrote: Well, I went to go get my surgery report yesterday and they told me it could take over a week - it was not in my file yet and they were not sure if it was even typed up.   Today, after all of this, I feel better.  Angry still, yes.  But better. At this point, I cannot do anything else but wait for the surgery report to see if he lied to me or screwed up somewhere (although I doubt he will admit that in writing).  I may never know why he claims that he took out one sample but the path report says there were two samples, both large and different sizes. My family/friends do not understand why I am so upset over this - everyone says that I should just be happy that it was benign.  I am.  I am ecstatic and thankful.  But the point was, I never thought it was anything non-benign.  From the beginning, the U/S tech said Fibroadenoma, recommending core needle biopsy.  The surgeon they put me with said probable fibroadenoma, small chance of phyllodes tumor (and although considered cancer, it is called benign because it rarely metastasizes, it just grows real big).  I wanted to wait to see if mine continued to grow, but the surgeon was adamant about getting it out immediately, no biopsy just removal.  (I was correct in my assumption - two weeks after I found the lump and it was U/S, it decreased from 2.7 cm to 1.7 cm).   No, my bigger issue is that I felt and do feel totally out of control in this situation.  I was really not given any choice in all of this.  At the first consult, after feeling my lump and reading the U/S report (but not looking at it), he immediately said he wanted it out.  The appointment lasted all of 5 minutes. I did address my concerns about the cosmetics.  If everyone was so sure it was benign (even the surgeon), I was more worried about the after effects.  He promised me the scar would go away and there would not be much of an indent, if any at all.  I was okay with that, because he was only going to be taking a little out - up to 2.7 cm tumor and a small margin.  After the surgery, I find out he took at least 4.7 cm that he admits, and then there is that other sample that is 5 cm.  He refused to tell me how much he actually took out, so it is anywhere from between 5 cm to, heavens forbid, almost 10 cm.  For a lump he was very sure was benign.  Oh well, like I said before, I cannot worry myself over it until I get the surgeon's report and the swelling goes down.   To karen - I am not going to be looking for a new doctor at the moment.  Even though the \"findings\" of the path report were suspicious to me and also to what I found on-line, at this point I am not going to stress about it anymore.  The only other thing it could really be is the phyllodes, and I'm going to assume whatever it was is out and both (FA and PT) are benign, so there is no where to go from there anyways.  If there is serious damage from the amount he took out, I will seek out a plastic surgeon, and I know I will never see my surgeon again.  My family doctor is a woman, and AMAZING and nice and super understanding, but she likes to defer anything on to specialists, and really there are no specialists around here (IA).   And yes, my surgeon was a jerk (after the fact).  I should have realized it when I looked up his court records (most states post them on-line for free) and the only thing on there was a lawsuit against the entire practice by a former female doctor stating MANY instances of sexual harassment and also \"abuse\" (not physical, but emotional).  I should have run then.  Or at least asked for the breast specialist at the center (it's the only place in our city that does out-patient surgery - even our hospitals send people there).  I never knew I had that option.  After my U/S the receptionist made the appointment and did not give me a choice.   Looking back, I wish I would have been more pro-active and slowed down.  The moment the surgeon started telling me that he \"takes out all lumps, even the ones they know are benign\" and refusing to do any biopsies besides full excisional, I should have questioned his expertise - he did everything and believed everything backwards to what recent studies and hospitals have shown.  Really, there is little to nothing I can do at this point.  All I can hope is that I can remind other young women going through this to slow down and ask questions.  I do not regret the surgery - it is the only way to know for sure.  What I regret is not following my gut and asking more questions (even though no one really answered the ones I did ask) and demanding answers, and demanding that my opinion be taken into consideration. Thank you to all who have responded.  It has helped a lot.  My boyfriend does not want to hear me upset over all this - he does not see the big deal because he \"will be there for me, deformed breast or not\" (not the point at all - he may be okay with a deformed breast, but I am not).  My parents will not let me talk about it at all - they have been incredibly supportive through the entire thing, but they always believe the doctor is 100% right and does not screw up so don't question him.  They want me to move on and stop thinking about it.  Which is what I will do for the time being, until I get some more answers or proof something went afoot.   ",
      "MessageIndex": 16,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730559",
      "Title": "Did my doctor butcher me/screw up? FREAKING OUT! sueelizabeth676 sueelizabeth676"
    }
  ]
}