{
  "AuthorID": "suesue3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273907/profile",
  "Posts": [
    {
      "AuthorID": "suesue3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273907/profile",
      "Content": "May 25, 2018 04:54PM suesue3 wrote: I am about one month post BMX. I had 2 lymph nodes removed (one on each side). I have noticed that I am sweating more than ever before. anyone else noticing this? Before surgery, I could run a mile and barely break a sweat (not because of the shape I am in but rather because I didn't sweat!). Now I find myself sweating for no reason at all! In the grand scheme of things, I am not letting this bother me. I am just curious if anyone else is experiencing this.",
      "MessageIndex": 221,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "suesue3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273907/profile",
      "Content": "May 25, 2018 04:42PM suesue3 wrote: I am one month and one day post BMX!! I wanted to post yesterday but had 8th grade graduation stuff all day! How are you feeling? I got on here to check on someone and started reading others' stories. It is so inspiring to see the support. I cannot get over how much better I felt week by week. Week one post surgery was so hard. I highly recommend finding a friend to take you somewhere to get your hair washed and dried. It felt so awesome!!! I hit a big time low on the one week mark. I was waiting on pathology and feeling horrible and hurting. Week 2 was so much better. By the end of week 2 I was so tired of the drains, but overall I felt great. Week 3, once drains were out, I felt like a million bucks! Week 4--still a little wincing pain here and there, but there have been times I have actually forgotten that these are not my \"real\" breasts. :-) Hang in there! ",
      "MessageIndex": 219,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    }
  ]
}