{
  "AuthorID": "Suesinstitches",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200842/profile",
  "Posts": [{
    "AuthorID": "Suesinstitches",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200842/profile",
    "Content": "Suesinstitches wrote: I've been reading this site for the last few weeks as I've undergone all sorts of tests.   I'm a 59 year old with no unusual risk factors for BC. It started with a mass found by my gynecologist.  Went for a diagnostic mammo and US a week and a half later.  Radiologist thought the lump might be a fibroadenoma.  She also found another area which her report labeled an architectural distortion.  She was more concerned with this area and wanted me to have an mri to check it out.  Had that a week later and she said it enhanced along with several other areas.  And there was another mass lighting up in my right breast which previously had been clear.  Scheduled another week later for two US guided core biopsies and the next day two mri guided vacuum biopsies.  Then wait for results.  My gyn called first about the US biopsies which were fibroadenomas.  The next day, last Friday, the gyn called about the final two mri biopsies and said one was a fibroadenoma and the other where the distortion was was fibrocystic tissue or something like that.  All benign.   Later that day, the gyn called back to say the radiologist wasn't sure about the distortion report and now wants a breast surgeon to look at the films and see if a surgical biopsy should be done. Here's a portion of what's in the mri report: \"There is an irregular rapidly enhancing mass within the upper inner breast, 7.6 cm from the nipple with a mixed kinetic pattern measuring 1.4 x 0.9 x 1.9 cm (axial image 80/160, sagittal image 130/176). This corresponds to the area of architectural distortion noted on the tomosynthesis data set. This is suspicious and MR guided biopsy should be performed.  .....  Enlarged left axillary lymph nodes are present measuring 1.2 x 0.6 x 1.4 cm and 1 x 0.6 x 1.7 cm. IMPRESSION: Bilateral masses as well as enlarged left axillary lymph nodes as described.\" My BIRADS is listed at 4.  I would just assume another benign lesion if it didn't have that part about the lymph nodes in there.  Any thoughts on enlarged lymph nodes? I'm not sure what to think anymore.   I've spent soooo much time with dr google.  This group offers the best balanced advice.  I have mad respect for all of you that've made it through all this worry.  Just needed to get it all out I think.  Most days I can convince myself it's probably nothing.  Other days the crazies take over.   Dx 7/2014, LCIS, Left Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "25/05/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/821398",
    "Title": "Just when I think I'm good to go.... Suesinstitches Suesinstitches"
  }]
}