{
  "AuthorID": "summersoff",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
  "Posts": [
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 15, 2008 04:46AM summersoff wrote: Thanks to texasmom and Sheila for quick replies!  Sheila, they didn't give me any meds. but I happen to have very low dose ativan that was prescribed for my daughter who suffers from depression.  She took it a couple times this past winter to help with taking the edge off so she could sleep.  I don't think I'll take it though (knowing it wasnt' prescribed for me).  Maybe a little wine with dinner will do the trick! Texasmom, thanks for your input.  I do agree that I need to slow it down and take this one problem at a time.  Right now, I know I need to just see what I'm dealing with.  That being said though, I'm prepared to suggest double mastectomy if necessary.  For me, getting rid of the problems (the right one and left one) will help get rid of the fears.  I hope it's not the \"wimpy\" way out, but the thought of radiation, chemo, meds, frequent mammos etc just seems so worrisome. ",
      "MessageIndex": 61,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/526145",
      "Title": "Breast Calcifications azcamm Makratz"
    },
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 14, 2008 03:21PM summersoff wrote: A quick question: I notice at the bottom of some of your profiles you ladies have listed your diagoses and some secret codes!  What do \"ER/PR\" (positive and negative) and \"HER2+\" mean?  I know \"stage\" but also, what is \"grade\"?  I'm sure I could find it all out via internet, but I thought you ladies would explain it better.",
      "MessageIndex": 63,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/526145",
      "Title": "Breast Calcifications azcamm Makratz"
    },
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 14, 2008 04:07PM summersoff wrote: Sheila, Since Jack is a boy, he'd be very upset if I let the groomer paint his nails any color!!   Thanks so much for your replies and advice.  I'll log back on later this week to let you know how the biopsy went and hopefully with good news as well.    My husband teases me because I have summers off (hence my username) but I'm sure he won't want me doing anything after the biopsy either!  Good thoughts and prayers to everyone out there going through this at every stage of it.  Stay strong!",
      "MessageIndex": 68,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/526145",
      "Title": "Breast Calcifications azcamm Makratz"
    },
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 15, 2008 04:08AM summersoff wrote: I go tomorrow for stereotactic biopsy.  Scared, but reading these posts has been a comfort.  Lost my mom at age 54 (her age) to ovarian cancer and lost dad to prostate cancer (he was 58).  I'm only 42 and have been having mammos. since age 30.  We now have digital mammog. and at this year's screening, they found microcalcifications.  The doctor showed me the view and they looked linear.  Is that good or bad?  This has all happened quickly (over the past 2 weeks) so I'm thankful and lucky to not have to wait as long as some of you seem to have had to do.  I should get results 48 hours after biopsy.  I've had 2 needle biopsies that came back b9 in the past, but this one seems to be a bigger deal.  I'm aware of the 80% chance blah blah blah, but I also have very dense breasts.  I'm preparing my mind for the worst and hoping for the best.  I am of the opinion that if anything comes back \"sketchy\" I will want to skip all the wait and see crap and radiation and go straight for mastectomy.  Is that too radical?  Too much scary stuff and too close to home having lost both parents to cancer.   I'd love to hear comments.   ",
      "MessageIndex": 58,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/526145",
      "Title": "Breast Calcifications azcamm Makratz"
    },
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 14, 2008 03:43PM summersoff wrote: lvtwoqlt, by the way, your dog is adorable!  Almost as cute as mine! As for the bra thing, I did think of wearing a sportsbra tomorrow, but then I thought putting my arms over my head to put it on might hurt so I thought of just wearing a normal bra.  Any suggestions are greatly welcomed!  Thanks for the dis-color warning.  I freak out at everything, so knowing what to expect in advance is a big help.  Do you think I'll be able to play soccer by Thurs. evening?  That's my weekly godsend for exercise and sanity (plus a couple drinks with the girls after the game).  Am I just wishful thinking that I might be able to play? ",
      "MessageIndex": 65,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/526145",
      "Title": "Breast Calcifications azcamm Makratz"
    },
    {
      "AuthorID": "summersoff",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69459/profile",
      "Content": "Jul 17, 2008 12:03PM summersoff wrote: This site is so good for me.  CAZ, you always have insightful information and a calming demeanor.  Thank you!  Carolyn223, I'm in a similar situation.  Today I await the phone call that will tell me if my biopsy (steroetactic) is benign or not.  I'm remaining hopeful.  God forbid it isn't, I'm prepared for the option of mastectomy as well.   It does seem radical, but each individual needs to do what is best for them.  For now I'll wait anxiously and hope for the best.  Decisions don't need to be made yet. Thanks to all of you who provide knowledge and comfort!  Your words of encouragement, whether they're to me or others going through this, have been very very helpful. ",
      "MessageIndex": 12,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/709144",
      "Title": "Biopsy question... Journey Journey"
    }
  ]
}