{
  "AuthorID": "sunandsnow",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208345/profile",
  "Posts": [
    {
      "AuthorID": "sunandsnow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208345/profile",
      "Content": "Nov 27, 2014 03:54PM sunandsnow wrote: Can you share the name of the app? This would be helpful for me. Had mastectomy 11/4 and am in expander yuckiness. Thx!! ",
      "MessageIndex": 63,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "sunandsnow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208345/profile",
      "Content": "Nov 27, 2014 04:16PM sunandsnow wrote: i am not an old pro but i can give you a few tips. Just had a double mastectomy nipple sparring on 11/4 with sentinel node biopsy. I had never been under or had surgery before so was a nervous wreck. That was the easy part so justbrelax. Some info that helped me. 1)First ever favorite thing was a c shaped neck pillow that a girl friend brought over for my neck. Works great under your armpit! I told her she wont want it back because i have been using it as an armpit rest. Lol! I think she got it at Walgreens she said and it is inflatable which is great because i adjusted it to the size i need. 2) i went to Kohls and spent $50 on a special memory foam thick pillow. Bring a coupon if you can but its been the best thing ever for sleeping on my back and propped up. Im normally a stomach sleeper and haven't missed that much at all. 3) a cute basket for your bedside table to hold all your drugs, lip balm, pens etc. also a notebook to record when you took what drug. 4) For drains again i went to Kohls. The camis ones they fitted me for at the cancer center hurt horribly. Kohls had some camis that do not have a bra support and are made of a silky kind of slip like material. They can be bought in black, white or , tan and you can wear them front wards or backwards to v-neck or regular. I just pinned my drains to the inside. I liked the black the best and i think I will actually wear these afterwards. I overbought. I bought 4 but i think you could get by with two. I also bought two XL comfy flannel shirts there to wear around the house. 5) Pajamas. I made the mistake of thinking i needed clothing to go out and wear that would hide drains. I didn't leave the house except to go to Kohls to get the camis or to go to the doctor. However i have an amazing husband that did all the errands and kid shuffling and i know not everyone has that. But stock up on PJs. It made me feel better knowing I had some cute pajamas to put on each day. For PJs i recommend flannel pants and tops. The old school kind your grandpa used to wear I love the VS flannel PJs and live in them but they are pricey. I bought a few extra pair on EBAY brand new to save $$ but you can get flannel pajamas anywhere. Target had some darling ones for under $20. I hope i help someone. Im now in expanders and am enjoying the advice people are giving me with that. These feel like croquet balls have been taped to my chest. Hate em! Best of luck ladies!!  ",
      "MessageIndex": 64,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "sunandsnow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208345/profile",
      "Content": "Dec 1, 2014 06:11AM sunandsnow wrote: 42",
      "MessageIndex": 351,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "sunandsnow",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/208345/profile",
      "Content": "Dec 1, 2014 04:37AM sunandsnow wrote: I swear i had two \"professional\" camis wiht built in drain pockets and was very freaked out about the thought of having drains but i swear the saftey pins in the camisole works the easiest. At least for me. You can put it as high or low as you want it, towards the front, the back, whatever. I never thought before hand o would of said that but really was the easiest. I onky has one drain in each breast though.",
      "MessageIndex": 77,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    }
  ]
}