{
  "AuthorID": "sunandsandg…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80118/profile",
  "Posts": [
    {
      "AuthorID": "sunandsandg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80118/profile",
      "Content": "Mar 17, 2009 08:14PM sunandsandgirl wrote: Junebug40, I, too, had DCIS and IDC, and I had to have a bilateral mastectomy. I am so thankful that I did. When they completed the final pathology report following the mastectomy, they found more DCIS and IDC that were not even seen on the Mammogram or MRI.   I highly recommend immediate reconstruction.  I am 47,  and I love summer, swimming, and the beach. I had a bilateral mastectomy followed by an SGAP 7 weeks ago.  You may also want to investigate the DIEP.  My results are amazing   There are so many options for reconstruction.   My only advice is to find out what works best for you.  Take the time to research every available option for reconstruction.  My local doctors had never even heard of the reconstruction I chose.  This forum is filled with wonderful information on all types of reconstruction. I wish you the best with your research Sunandsandgirl ",
      "MessageIndex": 5,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/730835",
      "Title": "Newly diagnosed IDC.............looking at bilat mast. Junebug40 PT63"
    },
    {
      "AuthorID": "sunandsandg…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80118/profile",
      "Content": "Mar 19, 2009 04:06AM sunandsandgirl wrote: Junebug40, I kept asking everyone if I could have a lumpectomy,  but they all said no.  My breast tissue was so dense it made reading the mammograms and MRI very difficult. They had also seen calcifications in multiple areas.   The radiologist (who is a friend of mine) said that since I had DCIS and IDC in the right breast and ADH and ALH in the opposite breast it would just be better to have a bilateral instead of waiting for the other breast to have cancer. This may make my case different from yours.   As it turns out, the pathology confirmed their recommendations.  My tumors were 5mm and 4mm.  I still cannot believe something that small could have caused all of this trouble.",
      "MessageIndex": 9,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/730835",
      "Title": "Newly diagnosed IDC.............looking at bilat mast. Junebug40 PT63"
    }
  ]
}