{
  "AuthorID": "sundance279…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187179/profile",
  "Posts": [
    {
      "AuthorID": "sundance279",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187179/profile",
      "Content": "sundance279 wrote: So grateful to have this website. You all give me so much hope. I'm now about 6 weeks into my hormone therapy ( Tomox and chemical menopause ) and have noticed that my anxiety is getting worse and my moods swing from incredibly depressed and not able to function ( 3-4 days a week) to high as a kite 1-2 days per week. The rest of the week I feel meh. I do yoga 2-3 times per week and acupuncture once a week. My diet is vegan/no coffee no alcohol/ no sugar. I've had mild hot flashes and some bone pain but can cope with these SE's Did any of you experience these mood swings? What else helps? The depression is making it very difficult to function. I'm looking forward to the day I can change my Facebook status to \"in a long term relationship with NED\" Until then I hope to find a better way to cope with these SE's Thank you all in advance beautiful,positive woman. I love reading your posts. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811412",
      "Title": "Depression,anxiety,mood swings. Advice Please sundance279 DivineMrsM"
    },
    {
      "AuthorID": "sundance279…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187179/profile",
      "Content": "Sep 22, 2013 08:47AM sundance279 wrote: Thanks for your replies. I'm seeing my doc on Weds and will ask him about antidepressants. I know I need to be careful to avoid ones that interfere with Tomoxifen but I'm sure there will be something I can try. It's impossible to function like this. Be nice to get out of this black hole and start living again!",
      "MessageIndex": 5,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811412",
      "Title": "Depression,anxiety,mood swings. Advice Please sundance279 DivineMrsM"
    }
  ]
}