{
  "AuthorID": "sundermom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
  "Posts": [
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 30, 2012 03:46PM sundermom wrote: I was awake for the biopsy. They numbed up the area (just a little bee sting) and made a teeny, tiny incision. It was more like a hole. Through that they inserted the tool that they used to nip off tiny pieces of the mass. The whole process was guided by ultrasound. It was really simple, so try not to lose sleep about it :)",
      "MessageIndex": 2,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791337",
      "Title": "44 and Scared 44andscared Kareywith3littlekittens"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 21, 2012 02:45AM sundermom wrote: Rohm, My mother has been dealing with recurrent brain mets (from lung cancer) for over 18 months now. She has had 3 Gamma Knife procedures which have all been deemed successful. Is this an option for you?",
      "MessageIndex": 7,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782964",
      "Title": "Ugh! Brain Mets are Back! Rohm dellmonica"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 22, 2011 12:07PM sundermom wrote: Breast cancer doesn't care how old or young we are! I would insist on seeing a breast specialist. Too many times young women a blown off by their GPs or OBGYNs.",
      "MessageIndex": 3,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/775301",
      "Title": "Anyone told they're too young? jamjam29 kennessee"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 3, 2011 02:42PM sundermom wrote: I got 4 tattoos.  It was my choice to get them.  My treatment has lasted almost 8 weeks, between holidays and machine issues.  I can not imagine living with the LARGE black marks and stickers all over my chest for that long.  It is pool season after all!!!  Mine are slightly larger than a pin head, but I can pick them out plain as day.  The only one really bothers me is right at the top of my reconstructed breast and is visible depending on the shirt I wear.  I use a dot of DermaBlend if I'm going out and don't want it to show.  I've just added it to my makeup routine.  The little dots are nothing compared to the BMX scars, but it will all be worth if I'm here 50 years from now :) Tammy",
      "MessageIndex": 34,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/669809",
      "Title": "Radiation & Tattoos JFfromTN yizbieta"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 20, 2012 05:40PM sundermom wrote: I took Ativan and Ambien all during treatment and for probably about 6 months afterwards. I still take an occasional Ativan (before scans and appointments) but was able to DC the Ambien. My MO said it was very important that I got quality sleep, because that is when the body heals itself. I slept great with that combination!!!",
      "MessageIndex": 7,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797818",
      "Title": "To tranquilise or not to tranquilise jebdra Momine"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 26, 2011 03:31PM sundermom wrote: I just finished 28 regular tx and 8 boosts on July 14th.  I was able to work full-time as an elementary principal and be a Mommy to my five little ones.  I made sure to apply 100% aloe vera 4-5 times a day and thankfully, I never had anything more than some mild redness.  While I know everyone responds to every tx differently, I think it was a piece of cake.  I had a 3:15PM appointment each day and I was always in bed by 10PM, but I've never been much of a night owl :) Tammy",
      "MessageIndex": 4,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772181",
      "Title": "RO Consultation--Questions for those who have had Radiation. pam53 stage1"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 31, 2011 06:23PM sundermom wrote: I think (not for sure) that the doses are smaller when they are given altogether, and unless your onc mentioned the words \"dose dense\" I believe you would get treatment every three weeks. I was lucky enough to get to go every 14 days :( I think having an extra week off would have made things much, much easier. Like I mentioned though, I had lots more good days than bad.",
      "MessageIndex": 3,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777341",
      "Title": "Red devil or not? Teakay sarasowise"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 31, 2011 05:52PM sundermom wrote: I did dose dense AC followed by T, so mine was a little different. There's no doubt that the red devil is a butt-kicker, but my nausea meds worked great and I was able to continue to work full-time. The fatigue is what I found the hardest to deal with. All I wanted to do on Days 3 and 4 after infusions was sleep in my recliner, but the vast majority of the days I just felt a little run down. I think AC is a front line teatment for those with node involvement, and hopefully some other ladies that share your diagnosis and have experience with TAC will be along soon.",
      "MessageIndex": 1,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777341",
      "Title": "Red devil or not? Teakay sarasowise"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Aug 28, 2011 04:57PM sundermom wrote: Joyce, I am so sorry that your DD is fighting this battle. My mother has been battling Stage IV lung cancer for almost 3 years now and then I was dx with BC last November. My mom had Gamma Knife for 7 brain mets in May and has been on decadron for well over a year. She, too, was having blurry vision and I encouraged her to go and see an eye doctor. She was diagnosed with cataracts in both eyes as a result of the high doses of steroids. She will be having cataract surgery this fall. We were also told the steroids can cause a loss of muscle mass and her MO prescribed something to help with blood flow, though I can't remember the name of it right now. I wish you and your DD the best. Tammy",
      "MessageIndex": 1,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773852",
      "Title": "brain mets & decadron side effects Joyce4123 Joyce4123"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Aug 24, 2013 08:03PM sundermom wrote: I, too, experienced extreme tightness post radiation. My PS went in and released a \"severe\" capsular contracture because it was so painful and causing problems with the use of my dominant arm. Six weeks later my incision from that procedure opened overnight and I woke up to a gaping hole in my chest that I could see straight through to the implant. To make it ten times worse I was in DisneyWorld with my kids when this went down. Long story, short - I had to totally re-do reconstruction and we used fat grafting the second go around. The difference was amazing! My poor, radiated skin looks totally normal now. I highly recommend fat grafting!",
      "MessageIndex": 6,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/809888",
      "Title": "FAT GRAFTING post mastectomy radiation for scar tissue tightness dpms mgdsmc"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 13, 2012 07:28PM sundermom wrote: Hope you don't mind if I post here. I feel like there is not a good place for us Stage 2Bs :) This post is full of inspiration and I needed some of that today. It was one of the days where all I did was think about recurrence. Thank you:)",
      "MessageIndex": 27,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/787510",
      "Title": "Does the looming dread of recurrence ever go away? lanagraves fondak"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 18, 2011 06:26PM sundermom wrote: I had DD Taxol. I thought it was pretty easy compared to AC. I had some slight tingling in the infusion hand after the 3rd tx that stuck with me for several weeks PFC, but that has since resolved. The idea of being done with chemo faster really appealed to me and it is considered a more aggressive treatment which I needed thanks to those two pesky + nodes :(",
      "MessageIndex": 3,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/779654",
      "Title": "4 DD taxol vs 12 weekly taxol TectonicShift LuvRVing"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 22, 2011 05:47PM sundermom wrote: I did dose dense AC/T, so chemo every other week.  I worked full-time as an elementary principal.  I took off infusion days (Thursdays) and the next day (Fridays) on treatment weeks, but was able to recoup over the weekend and return to work on Monday.  I needed to work through this!  Thankfully, I have the kind of job where there is not a lot of down time so during the school day I didn't have time to think/worry about having BC.  It really was a blessing :) Tammy",
      "MessageIndex": 26,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771494",
      "Title": "Poll: How many ladies worked through Chemo? Chrys23 Chrys23"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 28, 2012 02:33PM sundermom wrote: Dayton area here - a little south of Dayton, actually. I'm done with all treatments now (except antihormonals) and though there still isn't a day I don't think about the r-word it is getting easier.",
      "MessageIndex": 21,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781652",
      "Title": "Ohio Chemo Sisters Kelloggs Kelloggs"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 13, 2011 03:26PM sundermom wrote: I had the first treatment today - ddAC.  That red liquid definitely looks wicked going in!!!  I go back tomorrow for a Neulasta shot and then head to the plastic surgeon my second tissue expansion.  It is VERY encouraging to read the posts from those actually feeling good.  I've got the nausea meds all lined up for bedtime and I plan to mix up a batch of the mouth wash.  The nurse was admanant that I eat ice chips while she was infusing the Adriamyacin.  She said it helps prevent mouth tenderness.  Just an FYI.  My kids (10, 9, 7, 5 and 3) expected my hair to be gone when they got home today.  LOL  I know it's coming, but they keep trying to rush this process along.  Take Care Tammy",
      "MessageIndex": 250,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 17, 2011 06:26PM sundermom wrote: Finally after 6 weeks of dreading going to the PS office for weekly expansions for reconstruction I found have a drug that alleviates the pain.  Unbelievable!  I feel like I am kicking some cancer a** today!!!  I took an Aleve about 30 minutes before the appointment and have completely avoided the pain muscle spasms and tightening that have accompanied every other expansion.  Maybe this wonder drug will work on the bone pain from the Neulasta??? That just about crippled me that round :(  Any suggestions?  I am trying to avoid Vicodin/Percocet because it just complicates the bowel issues of the chemo for me.  Tammy",
      "MessageIndex": 828,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 21, 2011 04:53PM sundermom wrote: christine47 - Holy crap!  75cc at one time!!!  I can only imagine how tight and stiff you feel :(  I started at 60, then 50, then 40 and now 30 each week.  With 30cc I find that I can still function.  I was getting filled on Thursday and then Neulasta on Friday.  It just about crippled me for several days.  I recently started using Aleve and it is like the miracle drug for expansion pain.  My PS assured me that there is no reason to hurry the expansion process since we can't do the exchange surgery until a month after the last chemo.  So . . . slow and steady we go.  I'm at 420cc right now.  I think I'll call is quits after two more expansions.  Tammy ",
      "MessageIndex": 877,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 1, 2011 03:55PM sundermom wrote: Well . . . I think I'm starting to get a my first cold of the season.  My nose is stuffy, my throat is scratchy and my ears hurt.  It's just my luck that after the treatment that I had the seemingly easiest time handling I'll end up getting sick.  I guess I should consider myself lucky.  Since I'm an elementary principal every sick kid comes in close proximity to my office.  I guess it was just a matter of time.  I want to just curl up in bed and sleep, sleep, sleep.  I really hope this doesn't end up cutting into my \"good' days.  It was sunny and mild in Ohio today.  The sun is rising noticeably earlier.  Spring is definitely on the way.  It's amazing how just seeing a bit of sunshine perks up your spirits!  25 days until Spring Break :) Tammy",
      "MessageIndex": 956,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 20, 2011 08:21PM sundermom wrote: Warrior Princess - I'm 37 and had the same chemo as you.  I have been in chemopause for 6 months now.  My ONC told me that it's about a 50-50 chance that my cycles will resume. My DH had a vasectomy 2 years ago, after the birth of our 5th child, so BC is not something we've had to worry about!  The plan is for me to start Tamox in August, though I will question whether an ooph may be a more appropriate tx given my age at my next appt.  Tammy",
      "MessageIndex": 1541,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 28, 2010 07:07PM sundermom wrote: Hello All!  I'm just transitioning from the December Mastectomy board to over here.  I'll start 4 rounds of DD AC on Jan. 13th followed by 4 rounds of DD Taxol.  I'm more nervous about the chemo than the BMX I had on December 15th for sure!  I'm a mom of five (10, 8, 7, 5, and 3) and an elementary prinicipal.  I've scheduled my infusions for Thursdays with the goal of returning to work on Mondays.  Am I being completely unrealistic? Thanks! Tammy",
      "MessageIndex": 42,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 18, 2011 03:33PM sundermom wrote: I'm on Day 6 after DD AC and feel great!  Saturday and Sunday were a bit rough, but after upping the antinausea meds to every 3 hours per my onc, things perked up right away.  I, too, feel like my mouth is constantly dry and am very thirsty.  My hair is still hanging in there, but I'm ready with several cute hats for when the time comes.  For whatever reason today was probably one of the days I felt the best since being diagnosed.  It was like for just a minute, everything was back to \"normal\".  I can say that I feel more empowered having now completed the first chemotherapy treatment.  I knew I could do this, but now I actually doing it!!!  My kids (10, 9 , 7, 5 and 3) and my husband are such a source of strength for me.  I know I still have 7 treatments left, but today I feel like I can do anything :) Take Care Tammy",
      "MessageIndex": 364,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 3, 2011 03:01PM sundermom wrote: DD AC x 4 (all done!) then DD T x 4 starting on March 10th then Tamox for 5 years I scheduled my exchange surgery this afternoon!!!  I only need one more expansion and then on Monday, May 23rd (almost a month to the day I finish chemo) I'll swap out these incredibly annoying tissue expanders for nice, soft, perky silicone implants.  Just like my oncologist said at my first appointment, \"It will be a rocky 6 months and then you'll go on to live the rest of your very long lifetime.\"  Is anyone else starting to think about life after BC???  It makes me happy, happy, happy!!!  Tammy",
      "MessageIndex": 963,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 8, 2011 02:11PM sundermom wrote: I am still battling the sinus/respiratory infection of the decade!  I've had no fever so the onc hasn't wanted bloodwork or talked about kicking back my upcoming treatment on Thursday.  I think I would completely freak at this point if something threw us off schedule!!!  I'll get Taxol #1 on Thursday.  I'll be glad when this first one is out of the way so I'll have a better idea of what to expect.  My eyelashes are falling out in giant clumps now.  Thankfully, I had super thick lashes before so it's not that noticeable, but at some point I may explore some falsies. I need to go and start hydrating.  I want my three visible veins (I swear they are disappearing!) to be nice and plump.  Fingers crossed for the minimum two sticks this time around :)  Tammy",
      "MessageIndex": 999,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 23, 2011 07:47PM sundermom wrote: I didn't ask my doctor because I'm pretty sure they all give us the same spiel about tanning beds being bad for us :)  I have been careful to protect the MX scars with an itty bitty strapless top; however, I guess that doesn't really matter since the PS is going to slice right through them again in May to put in the perm implants. I know AC,T and Decadron all have \"increased sun sensitivity\" as a possible SE.  I started off slowly to see if this was going to be a problem for me.  I'm a brunette (well, not at the moment LOL), with freckles and pretty fair skin.  I will say I seemed to tan quicker and with less visits, but I never once got burned.  I also always wore a scarf, except for like the last 2 minutes.  My bald head is whiter and than white I knew it would get burned quickly.  Like I said, a guilty pleasure . . . I plan on consuming copious amounts of alcohol while in Jamaica and I'm pretty sure that is discouraged, too.  Tammy",
      "MessageIndex": 1079,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 25, 2011 03:11PM - edited Mar 25, 2011 03:13PM by sundermom Day #2 of DD Taxol #2 So far Taxol #2 has been much kinder to my tummy.  That could have to do with the fact I'm now on Prilosec daily and Caraphate before each meal.  I got my Neulasta shot at 9AM this morning, so I'm bracing for the inevitable bone pains.  So far, so good though - usually the pains start about 6hrs. after the shot and I'm at 9 hours now and pain-free!  My boys are scheduled to play in a baseball tournament this weekend and it's supposed to be freezing here in Ohio.  The thought of bone pain coupled with sitting in the freezing cold don't really appeal to me, but I try to never miss a game.  I got to watch one of my DSs play a lead in his school musical last night.  He's nine and memorized countless lines and dance steps.  I was amazed and so proud to watch him perform.  One of my DDs will celebrate her 6th birthday this weekend, so I had fun shopping for her birthday persents this afternoon. We're officially on Spring Break!  On Monday DH and I will drive all five kids to Michigan to stay at \"Camp Gramma & Papa\" and then we'll fly out Tuesday morning for our trip to Jamaica.  I found out yesterday that I'll have an appointment with a RO sometime between April 7th and April 21st.  There is new research suggesting that radiation after BMX can benefit women with the following characteristics: under 40, intermediate/high grade, LVI, T1 or T2 and estrogen negative.  I have 4 out of the 5 criteria so I may very well be looking a radiation now.  In the study, which was small (only 500 women) there was a 30% reduction in a recurrence and a 50% decrease in mortality.  It may be something to ask about. I also found out that I will be taking Tamoxifin even though my cycles have stopped.  I will take it for two years and then we'll re-evaluate to see if this is real menopause or chemical menopause.  Thanks Proud_Mom for commenting when I brought this up in an earlier post. Tammy",
      "MessageIndex": 1084,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 3, 2011 05:20PM - edited Apr 3, 2011 05:22PM by sundermom I'm back!!! Jamaica was wonderful - 85 and sunny every day we were there.  I felt great the whole time (even the TEs weren't as annoying as usual) and food tasted good again.  I drank enough alcohol to make up for the fact I hadn't had a drop since New Year's Eve.  We got a couples massage, spent LOTS of time on the beach and took \"naps\" every afternoon.  I feel like I got my batteries re-charged and I am ready take on the last two Taxols head-on and knock this chemo crap out. I have tx#7 on Thursday.  It will be the next to last one :) Mary Meg - Thanks for the shout out.  I'm no superwoman.  I do a lot of praying for strength, courage and wisdom.  I have an amazing husband and he definitely carries the brunt of the load on the homefront. Melissa - My appetite on AC was horrible.  I lived on mashed potatoes, bananas and orange Gatorade.  I would also take a tentative first bite and then let my stomach decide if it was something I was going to be able to tolerate.  I took a ton of nausea meds on Days 2-4.  I use both Ativan and Ambien for sleep.  I fall asleep in about 20 minutes and I sleep like a baby, which has never been the case for me before taking medication.  ProudMom_Wife - I, too, am feeling encouraged as I approach the finish line.  My last tx will be on April 21st.  JulieH - I'm with you on the sweets and diet soda.  I'm trying to view it as a blessing in that I probably ate/drank too much of this stuff to begin with.  christine47 - I have experienced some wicked hot flashes.  They seem to come more frequently after a treatment.  They are definitely worse at night; however, they are brief so I'm not ready to ask for meds yet.  Taxol #2 before my trip went as predicted.  No nausea.  Bone pain on Days 2-5 - ugh!  The bone pain did seem milder this round, but it was still there.  My IV infiltrated and I got a nasty red, swollen rash on my hand, but it seems to be on the mend now.  It's back to school for us tomorrow :( Tammy",
      "MessageIndex": 1134,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 25, 2011 03:06PM sundermom wrote: Wow!  There's been a lot of action in the past few days.  I'm still dealing with the annoying bone pain this round which should subside tomorrow. My hands and feet started to feel tingly this round, so I'm very thankful it was my last treatment.   Melissa - I still get completely nauseous when I see red liquid (Gatorade, Koolaide, etc.) and I'm 8 weeks out from my last AC.  My poor kids can have NOTHING red to drink :)  LOL  Also, ice makes me sick to my stomach because I had to chew so much of it during AC.  My DH was chomping down on some ice the other day and I had to leave the room.   Bdavis & Christine - I, too, have found myself thinking about recurrence and mets.  My RO assured me that chemo, Tamoxifen (I was 98%+ estrogen receptive) and rads in combination with the BMX put me in the less than 10% relapse rate and I was staged (IIB) higher than both of you :)  So . . . my thoughts . . . 90% chance this will NEVER happen again.  There aren't too many things in life with odds like that.  My grandmother is a 25 year BC survivor and she didn't have the benefit of all the research and treatments we have now.  Stay positive, ladies! I'm counting the days until my exchange surgery (15 to go!) and trying to read all I can about rads.  I'm almost more nervous about this than chemo.  Everybody knows you're supposed to feel sick with chemo, but everyone's experience with rads seems so different - some get horrible skin issues while others have none. Tammy",
      "MessageIndex": 1268,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 20, 2011 08:28PM sundermom wrote: bdavis - Good Luck with your surgery.  I had a BMX in December and it was way easier that I anticipated.  The drains were the worst part, but I got really good at finding creative places to stick them when I went out in public :) Tammy",
      "MessageIndex": 1543,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 1, 2011 08:16AM sundermom wrote: I have my PFC follow up appointment with my MO one week from today. I'll be 10 weeks PFC and I'm still enduring rads, but only have 9 more tx left. I know I'll get a script for Tami and we've already discussed CT scans every 6 months for the next 5 years. What else do I need to be asking about??? This will likely be the last time I see the MO for 6 months. It feels strange. Looking forward to the point that I can make it through an entire day without thinking about BC. Tammy",
      "MessageIndex": 1574,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 3, 2011 02:27PM sundermom wrote: ProudMom_Wife - Thanks for the suggestions on follow-up questions.  I will add them to my list. I try to chew two Viactiv everyday, but I know if I'm Vitamin D deficient that's not nearly enough.  I've officially been in chemo-pause for almost 7 months now so I know checking the hormone levels will be in my future.  The hot flashes have subsided dramatically though, so I'm just hoping that AC has completely shut down the ovaries for good.  We have five kids (and no plans for more) so I'd be just fine with that :) The eyelashes and eyebrows are all completely back now and I think I may reach my goal of going \"topless\" by August 15th (first day of school).  My hair is growing way faster than I thought it would.  My hope is just to be able to have to cut into a style and not look like a cancer patient that was bald and is now growing their hair back.  Walnuts and hard-boiled eggs - that's what I'm telling myself is helping it grow!!!  Enjoy the holiday!  We have 90s and full sun here in Ohio - the kind of weather I LOVE!!! Tammy",
      "MessageIndex": 1578,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 14, 2011 03:30PM sundermom wrote: DD ACx4 followed by Tx4  Cycle 3 Day 5 Well . . . I can certainly relate with dreading going in for treatment.I had myself really worked up about AC#3, but I popped a couple of Xanax before heading in for treatment and that helped me hold it together.  My veins didn't cooperate though and ending up getting stuck a total of 4 times.  I was told I was dehydrated, so I need to remember to drink, drink, drink before the next treatment because that sucked! sherryhuttRS - I thought round 3 was tough, too.  It seems like I didn't quite bouce back as fast.  Thankfully, there is only one more treatment with the red devil!!! moe0279 - I hope you aren't feeling quite as low today.  I do think that it gets harder to keep yourself from staying in the valleys the farther we get into this journey.  I look at my five kiddos and find myself getting mad that I've lost so much time with them - being sick, being sore, being tired.  I actually have a countdown of days in my office.  It has helped me to focus on the end result - 64 days :) Jcoutee & slcst12 - Going through this with little ones is tough.  I have five under the age of 11 and DH has to basically be a single parent on treatment weekends.  I find myself feeling guilty, mad and sad all at the same time.  It does give us motivation though.  I refuse to accept letting BC take me away from my family.  Is anyone else undergoing reconstruction with chemo?  This has almost become too much for me!!!  I'm ready to quit. Happy Valentine's Day to all.",
      "MessageIndex": 794,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 21, 2011 04:16PM sundermom wrote: I'm gearing up for AC#4 on Thursday.  My eyelashes have started to thin, though the eyebrows seem to be hanging on.  The 5% of hair left on my head continues to grow.  What kind of sick joke is that???  Although the low point during round 3 seemed lower, the high point has seemed higher.  I've been able to resume exercising and actually pitched in with household chores this week - for which my DH was eternally grateful.  I'm on the Jamaica countdown - 36 days!!! My DH and I typically take a couples trip during Spring Break.  My DH's parents watch our five kids, which is like the best gift in the whole world.  This year we postponed our trip because of chemo.  Well, we were talking with my onc at my last appointment and he encouraged us to go on our trip.  He was adamant that Taxol is MUCH easier than AC.  So ladies . . . there are better days ahead.  Tammy",
      "MessageIndex": 870,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 21, 2011 06:30PM sundermom wrote: I was reading on the Stage IV board - which I know I shouldn't be doing right now- but one of the ladies posted \"There is no cure - regardless of the stage\".  Does anyone know the difference between remission and cure?  My grandma is a 20+ year breast cancer survivor.  I'm pretty sure she views herself as being cured.  I expect that to be the path of my journey as well.  Am I delusional???  Tammy",
      "MessageIndex": 879,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 25, 2011 02:37PM sundermom wrote: 4 DD-AC followed by 4 DD-T  Cycle 4 Day #2 I've made it to the other side of AC!!!  My oncologist told me to consider this a HUGE victory and again emphasized that Taxol will be a \"walk in the park\" after AC.  I got the Neulasta shot this afternoon.  I tried taking an Aleve this time around and I also skipped my tissue expansion this week.  I'd really love to avoid the bone pain I've experienced the first three rounds.  If the SE pattern holds true then tomorrow will be my rough day, so I'll plan to hibernate for most of the day in my room watching DVDs and napping. I'll emerge sometime Sunday before noon to rejoin the real world and will myself back to work on Monday :)  I think just knowing that this was my last dance with the \"red devil\" will make the 4th and final treatment easier to get through.  I ordered lots of pretty tropical colored scarves to match by bikini tops for Jamaica and they arrived today.  Thankfully, the breast tissue expanders don't look too freaky these days and I actually have enough cleavage to wear my same bikini top from last year.  32 days and counting!!! Tammy",
      "MessageIndex": 927,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 4, 2011 02:51PM sundermom wrote: I still don't know if I'm having rads or not.  I probably wouldn't start until May though since my last chemo will be April 21st.  My oncologist said I fall in the \"gray area\" since I had less than 4 positive nodes and opted for the BMX and ended up getting a AND to boot :)  I guess we need to talk about that at my next appointment.  The PS has scheduled the exchange under the assumption that I wouldn't be having rads.  ProudMom-Wife - Your experience with the switch to Taxol is very encouraging.  You'll have to let us know about the first signs of hair regrowth :) AimeeMac- It sounds like you have a very exciting job!  I can see where having to slow down when you're used to a schedule like that would be tough. Speaking of the ornaments . . . Is anyone else planning on going all the way with their reconstruction?   (i.e. nipple recon).  I'm not sold on this.  It means two additional procedures and I'm pretty sick of doctors' offices at this point.  The \"girls\" will never be the same and honestly I like the idea of going braless - which having nipples would eliminate, well, at least for me :)   My DH said he doesn't really have a preference, so I leaning towards NO. Tammy",
      "MessageIndex": 971,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 27, 2011 09:05AM sundermom wrote: It's too cold for baseball!!!  I sat for 7 hours in 35 degree weather yesterday.  Again, I say, it's too cold for baseball.  It was nice to watch my boys play, but every muscle in my body ached after we got home last night.  I'm feeling better today and packing is lifting my spirits. christine47 - Women that are in menopause are usually prescribed something called an AI, as opposed to Tamox.  My grandmother (25+ year BC survivior) took Tamox even though she was menopausal because that was the only medication available at that time. ScienceGirl - Rads will be much easier than chemo.  My mother has done rads twice (not for BC) and hasn't miss a beat.  In fact, she has been living with Stage IV lung cancer for almost two years.  She's undergone surgery to removal a lobe of her lung, wicked chemo (it made mine look like a vacation), rads and whole brain radiation.  She still works full time and we talk everyday.  I would say your mindset changes quite a bit when living through this dx as opposed to thinking about how you would live through it.  Stay positive! bdavis - Thanks!  I can't wait to get out of this cold weather.  Good Luck with #4.  Tammy",
      "MessageIndex": 1090,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 27, 2011 09:48AM sundermom wrote: christine47 - My onc said he always uses the status of your cycles prior to chemo to determine whether it will be Tamox or AI.  Chemo can screw up your cycles (to the point you don't have them at all - like me), but you're not actually in menopause, so taking an AI wouldn't work correctly.  He says we will reassess the Tamox vs. AI dicussion in two years with bloodwork to test my follicle stimulating hormone (FSH) level, but he thinks my cycles will resume since I'm only 37.  For those of us that are ER+ it's important we get the right drug since it's our most powerful protection against a recurrence. ",
      "MessageIndex": 1092,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 8, 2011 04:10PM sundermom wrote: DD Taxol #3 Day #2 Yesterday, my next to last chemo, went fine.  I finally got bossy and asked that a nurse start the IV first and draw the necessary labs off of that instead of getting stuck twice.  Why is this not standard of care for those of us without ports?   The body aches are already starting and the taste buds that were so alive on vacation are now dull again.  I know this will only last until Monday, but it sucks everytime nonetheless.   I have an appointment for a radiation consult on Thursday.  It will be interesting to see what the RO says since I've had a BMX and an AND on the affected side.  I'm not sure what there is left to radiate, but like all of you I am willing to do anything to avoid going down this road again. If I do end up qualifying for rads then my exchange surgery will happen ASAP.  Goodbye TEs!!!!   13 days until last chemo!!!! Tammy ",
      "MessageIndex": 1165,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 20, 2011 04:07PM sundermom wrote: This time tomorrow I will be D-O-N-E with chemo!!!  I ordered some chocolate covered strawberries for my ONC and the nurses in the infusion room.  I made a card with pictures of my five little ones.  They save a lot of people's lives in that center each day, but being a mother of young children (10, 9, 7, 6 and 3) I want them to know just how special that truly is for me. There was a time when I was first dx that I let my mind go to bad places (not seeing kids' birthdays, graduations, wedding or grandchildren) and the staff there is so positive your mind just can't stay there for long.     My BFF, DH and around 30 other friends are joining us at a local Mexican restaurant tomorrow night for BAMs (big a** margaritas) and spicy food.  I can't believe I've made it - 16 weeks, 8 DD treatments, including the red devil.  I missed 8 days of work (infusion days) and not a single athletic event for one of my kiddos.  I am blessed - truly blessed. I'm expecting the exchange surgery (May 10th) and radiation to be a walk in the park :) Tammy ",
      "MessageIndex": 1213,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 27, 2011 02:30PM sundermom wrote: Hi All!  I think I'm finally recovered from the last Taxol.  Food tasted good today and the bone pain is just in the ankles, so it's on its way out too.  I'm not sleeping though.  Even with Ambien and Ativan I still lay there wide awake and then the hot flashes start.  This has gone on for almost a week now, so I think it may be time to call the doc.  A girl has to sleep!  For those of you that have had your exchange surgery - What is easier than the BMX? How is your pain?  How is your mobility?  I'm supposed to have my planning scan for rads 2 days post surgery and the though of lifting my arm over my head is terrifying me.  Tammy",
      "MessageIndex": 1288,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 27, 2011 04:21PM sundermom wrote: ProudMom_Wife  - I also found round 4 of AC to be easier than round 3.  I had horrible dizziness with round 3 that seemed to last for days.  I had minimal SEs with #4.  Makes me think there's something to the whole mind over matter mantra!!!  Keep us posted on the switch to Taxol. On switching from AC to T - I know I will be taking a couple of doses of steriods prior to the treatment day which is new.  I was also told that I'll be getting Benadryl as a premed.  I will still be receiving the Neulasta shot as well.  I cry at some point almost every day.  Sometimes about BC, but most of the time it's about stupid stuff.  I attribute these mini-breakdowns to hormones.  I haven't had a period since staring chemo so who knows what my hormones are doing these days.  We're doing it ladies - baby steps - but we're doing it!!! Tammy",
      "MessageIndex": 941,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 12, 2011 12:35PM sundermom wrote: Sherry - My HgB levels were getting lower each time, too. Then before treatment #4 I starting each a ton of baby spinach.  My HgB levels soared up to pre-chemo levels.  ProudMom-Wife - Taxol is a cake walk compared to AC.  I woke up this morning (Day #3) expecting the worst and there was nothing!  I'm a little stiff, but I always get that way the morning after the Neulasta shot. Let's hope the next three follow the same pattern for both of us! JulieH - My taste buds have been shot since AC#1.  I've been steadily losing weight this whole time.  Nothing tastes that way it should and I'm never hungry.  Thankfully, my five little ones are always hungry so it's a nice reminder to stuff something in my mouth. baf4292/AimeeMac - Congratulations on crossing the chemo finish line!!!  I can't wait to be done, but with 3 more treatments left, I still have a ways to go.  Tammy ",
      "MessageIndex": 1019,
      "PostDate": "12/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 19, 2011 09:20AM sundermom wrote: Sherry - My PS was adamant about having the reconstruction prior to the radiation.  He said the tissue doesn't stretch as well after its been treated with radiation.  I don't know what kind of recon you are contemplating, but I had a BMX with TEs and it took about 12 weeks to get to the size I wanted, but I went VERY slowly with the fills during expansion - only 30cc per side per week.  bdavis - I am a scarf gal all of the time, so that's my plan for Jamaica.  We are hoping to do some water activities so I'm a little worried about my scarf blowing off, but at least I'll be surrounded by strangers!   Taxol #1 has been kind to me!  The \"good\" days have been great and the \"bad\" days were nothing compared to before. I go for #2 on Thursday, so hopefully it's just as easy.  I'll also get the final decision about rads at my appt.   I just finished making our family vacation reservations for Dinsey World in October 2011.  For a split second I asked myself, \"Should I make these reservations?\"  As I inch closer the finish treatment finish line (not counting 60 bottles of Tamox) I find myself thinking more about the future. I've decided I can't let my fear of recurrence affect what I hope are the next 50+ years (I'm 37) of my life.  My grandmother assures me that the farther out you get from this experience the less you think/worry about it.  She's 85 years old and a 25+ year BC survivor.   I'm headed out to watch my little guys play some baseball today.  The season has started so that means I'll be go, go, go until July 4th.  Fingers crossed I don't lose the scarf with a big gust of wind!  I can just see my son's face out at shortstop if his mom's scarf blows across the field.  LOL Tammy ",
      "MessageIndex": 1057,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 14, 2011 04:27PM sundermom wrote: Day 2 of dd AC and the lesson learned today was don't skip the nausea meds!  I was napped right through my 3PM dose of Zofran and by 4PM I was a mess.  Luckly, it must kick in pretty quickly because I was feeling better by 5:30PM.  I'll NEVER let that happen again.  I got the Neulasta shot today and my second expansion.  I am sore and stiff.  This reminds me of the few first days after my BMS.  Sleeping has been an issue for me too the past couple of days.  I already take an Ativan, and Ambien and a Vocidan at bedtime LOL so hopefully as some point my body will just let sleep happen.  I, too, am concerned about mouth sores.  I sucked on ice chips during treatment yesterday and have been using the baking soda, salt, water mixture that my oncologist suggested.  Take Care Tammy",
      "MessageIndex": 272,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 6, 2011 05:15PM sundermom wrote: So . . .many of us are approaching the chemo finish line and some lucky ladies the end of treatment line (excluding Tamox), too!  I don't think anything any of us did anything to cause BC, but it is certainly a life-changing experience.  I'm curious if anyone has adopted any lifestyle changes as result of the dx.  I've read several good books since being dx, including: AntiCancer: A New Way of Life, The Breast Cancer Warrior and Love, Medicine and Miracles.  As a result I've been trying to do the following each day: drink 4-5 cups of green tea get 5-7 servings of fruits and veggies, including 1 cup of cruciferous veggies (i.e. broccoli,cauliflower) 30 minutes of exercise (this is the toughest for me - not enough hours in the day) take Vitamin D supplements ( I chew one Vitactiv with lunch and one with dinner) be more aware of consuming nutrient-empty sugar (I would describe myself as a candy-addict before chemo.  Now it tastes like crap!) no red meat (This isn't a huge issue for me, because I only ate it like twice a year before) I don't know if it's the chemo, the lifestyle changes or a combination of both, but I've lost 20 pounds and I look and feel better (most days) than I have since HS.  How about you ladies? Tammy",
      "MessageIndex": 1155,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 20, 2011 04:51PM - edited Apr 20, 2011 04:52PM by sundermom I take both Ambien and Ativan every night.  I fall asleep within 30 minutes and stay asleep all night aside from the occasional hot flash.  I have Xanax that I carry in my purse for those teary times that can hit at the most inconvenient times.  I don't like to take meds either, but sleep is when we heal.  In fact one of the many books I've read touted the benefits of taking 4mg of supplemental Melatonin (a natural sleep aide) for BC survivors.  I think the further out we get from this experience, the better we'll sleep. Until then, thanks goodness for drugs!  I have 17 pills bottles, my kindergarten daughter counted and sorted them (some have pink lids and some have white lids) a few weeks ago.  Thankfully, most of them as \"as needed\". LOL Tammy",
      "MessageIndex": 1215,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 20, 2011 05:02PM sundermom wrote: What's Biotin?  I'd be willing to try just about anything to encourage a little hair growth right now. I have no hair on my body (armpits, legs, eyelashes).  I'm pretty close to the Brazilian wax at this point, too - which DH loves.  LOL  My eye brows are barely hanging on - ugh! Tammy",
      "MessageIndex": 1217,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 25, 2011 06:38PM sundermom wrote: bdavis - I asked about getting an ooph and my MO poo-pooed me.  He said the negatives of losing almost all of my estrogen at a young age (37) would cause additional health issues and that I should put my faith in Tamoxifen. He also suggested that I be vigilant about maintaining an ideal body weight.  I was already at a good weight, but I've been trying to lose the fat and add muscle because apparently body fat stores/produces excess estrogen.  I definitely feel like I'm learning a lot about how my body works and am taking better care of myself these days! Tammy",
      "MessageIndex": 1270,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 25, 2011 06:54PM sundermom wrote: bdavis - The hot flashes are definitely getting worse for me.  I may need to ask for some meds soon.  I didn't sleep at all last night because my body temperature kept swinging between freezing cold and inferno.  I guess I've been getting so hot that in my sleep I'm tossing off my \"sleep hat\".  My DH has woken up a couple of mornings just giggling and saying things, \"Good Morning, Lex, Telly, etc.\"  My 3 year old cracks up whenever she finds me bald.  \"Mommy I can see you bald head! Put your savannah back on!!\" She can't say bandana for the life of her!  I was just telling my BFF about the crap that is chemopause.  All I've got to say is that Mother Nature better stay away for good because I'm not not to be happy dealing with these lovely changes twice :) Tammy",
      "MessageIndex": 1273,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 2, 2011 06:33PM sundermom wrote: The hair on my legs has started to grow again (great- just in time for summer), BUT my eyebrows continue to fall out.  The rest of my eyelashes also bit the dust :)  I bought a great eyebrow kit to fill in the bare spots, but as they continue to fall out it's flat out depressing.  I think the last few hairs on my head also fell out after my last Taxol (12 days ago).  I was really hoping to start the new school year (August 2011) without donning a scarf, but I'm seeing now that probably isn't going to be possible.  I'm so over being bald!!! Completely unrelated . .  my friend has me started on this extreme couponing thing.  Having never used a coupon before in my life I have to say I'm totally pumped about going into Walgreens tomorrow to get a razor, 2 toothbrushes and some dish soap for 49 cents!    Then I'm headed across the street to CVS to get ALL laundry detergent for $1 a bottle.  She saved almost $200 in coupons last week at Kroger.  I'm all about learning to save that kind of money!!! Here a great wesbite site she directed me to.  www.couponsandthingsbydede.com Tammy",
      "MessageIndex": 1315,
      "PostDate": "02/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 25, 2011 08:11PM sundermom wrote: Melissa - I had a BMX in December before chemo.  I think you'll find the surgery much easier than the chemo.  I, too, found the drains to be the most annoying part of the whole process.  I got the first two out 7 days after surgery and the other two out 2 weeks post-op.  I got very creative in finding places to stick my drain bulbs when I went out in public :)  I lived in sweatpants, a loose cami and a zip-up sweatshirt for about 3 weeks.  I also slept in a recliner for about a month, but I had the TE placed at the time of the initial surgery so you'll probably recoup faster. I've started rads now which is so much different than chemo.  I find myself getting more annoyed by it actually because it's every stinking day.  I know it's been less than 7 months since my dx and I just have 30 days of treatment left, but I'm so ready to be done with this crap!  Tammy",
      "MessageIndex": 1455,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 6, 2011 09:43AM sundermom wrote: I haven't had the chance to post in a while, but I've been reading and following your posts everyday.  What a strong group of women we have!!! I have #3 of 4 DD AC this upcoming Thursday.  The first two have been tolerable for me, so I'm hoping for a similar SE pattern with #3.  I've been hairless for about a week now and am slowly adjusting to my new look.  I've opted to scarves and find them quite comfortable.  I love to shop and  I find myself thinking I need just a few more scarves in a few more colors!  LOL  I've been able to work pretty regularly, though I'm pretty sure the teachers aren't sending me as many behavior problems.  The principal's office has been kind of quiet the past several weeks!  My wonderful husband and five amazing children continue to support me each day.  Knowing that all of you laides are out here fighting the same battle is also a great source of comfort.  I've learned so much from reading your posts (Claritin, Biotene mouthwash, etc.).  My thoughts and prayers are with each one of you each and every day. Tammy",
      "MessageIndex": 680,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 16, 2011 06:29PM sundermom wrote: The January board was been quiet!  I'm plugging along through radiation and just finished #17 of 33 today.  I find radiation to be more annoying than anything else and that's mostly due to the fact it is daily.  I have found the fatigue to be manageable.  If anything, it has improved my sleep because I'm zonked at bedtime :)  I'm 7 weeks PFC and the brows and lashes are 75% back.  My hair is about one-half an inch long.  I'm so hoping to go scarf-free to start next school year ( about 8 weeks), but I just don't think I'm going to feel comfortable.  My hair has always been to my shoulders so I've got some adapting to do because it's going to be a LONG (lol) time before I see that length again.  UTMom - If you've worked through chemo, then you be able to work through rads.  They are a piece of cake!!! Just remember to take the time to give your skin some TLC.  100% aloe vera gel has worked wonders for me and I have very little effect to the skin at this point.  Tammy",
      "MessageIndex": 1529,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 29, 2010 04:10PM sundermom wrote: Julie, I will be getting the infusions on Thursdays and the the Neulasta shot on Fridays.  I really want to keep working.  I feel like the more time I have to sit around, the more \"down\" I get about this whole mess.  I went to look at wigs today and just about burst into tears.  I just don't know that I'm going to feel comfortable wearing a wig, but then again I don't want to look sick. I feel completely conflicted!  Getting ready for the surgery was SO much easier.  Tammy",
      "MessageIndex": 47,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 15, 2011 03:21PM sundermom wrote: Hi All!  I just wanted to chime in on the switch from AC to Taxol.  I would definitely says that Taxol treated my differently.  No nausea. No dizziness.  No extreme fatigue.  No eye issues.  I did experience a fair amount of joint pain that seemed to last longer than when I got the Neulasta shot alone.  Nothing over the top, but it made me feel stiff and sore for Days 2-4.  I also experienced some GI issues (a gnawing pain right near the belly button and what can only be described as a spastic colon) this round.  My onc attributes this to the nice, big doses of decadron.  He's calling in some meds right now, actually :)  bdavis - I hope you have a wonderful trip.  I leave for Jamaica in 14 days and am so excited!  I, too, am nervous about feeling well enough to travel.  I tried to plan around what are typically \"good\" days for me, but the switch to Taxol has thrown a wrench into that!  On Tamoxifin . . . I think I've shared before that my periods have completely stopped.  We're going on 3 months now.  My onc mentioned that I have to have my levels tested because I may be in permanent menopuase and have to take an AI instead.  I'm 37.  I know Tamox has been the gold standard and it makes me nervous to think I won't be able to take it.  Anyone else in this boat??? Tammy",
      "MessageIndex": 1034,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 16, 2011 05:43PM sundermom wrote: Melissa - Don't be scared of AC :)  It just different.  The nausea was more of a factor for me, but I started alternating Zofran and Phenergen every 3 hours around the clock on Days 2 and 3 and that kept things manageable.  Since those meds cause constipation I also took 1 Senokot at bedtime each night.   I did feel like my whole body was dehydrated.  The treatments I did a better job of staying hydrated and eating then the easier the SEs were. I stocked up on mashed potatoes and Ramen noodles - bland, bland, bland!!!  As far as work (I think I mentioned that I'm an elementary principal) my treatments were on Thursdays and I was always able to go back to work on Monday.  Just let yourself sleep.   You'll make it through!!!! Tammy",
      "MessageIndex": 1043,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 21, 2011 02:40PM sundermom wrote: bdavis - I'm SO on the countdown to sun and sand! I've got to make it through Taxol #2 first on Thursday and then we fly out early next Tuesday.  The weather in Jamaica has been 85 and partly cloudy,  I can't wait!!! christine47 - I know you're so right.  This is just all so fresh right now it's hard to imagine not thinking about BC everyday.  I think my hair growing back will make this a lot better.  Right now the mirror is a constant reminder.  I'm hoping to be hat/scarf free for Disney, though this might be ambitious! So ladies I have been indulging in my one guilty pleasure of going to the tanning bed to get ready for our trip.  There is something so relaxing about laying in that hot tube!!!  I have to say the bald head looks a little better when it's not stark white :) I don't know how many of you are having to deal with this but my eyelashes (which were long, thick and curly) and eyebrows are starting to thin.  I was losing patches of eyebrows and finally had to do something.  Anyways, I went to a local cosmetics store (Ulta) and they directed me towards an eyebrow kit.  It's made by Anastasia and SO easy to use.  I am challenged in the makeup department, but this is a powder and it looks very natural.  I was impressed and thought I'd pass it on.  Tammy",
      "MessageIndex": 1066,
      "PostDate": "21/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 6, 2011 05:03PM sundermom wrote: Lumpectomy vs. Mastectomy is a very personal decision.  People tend to feel very strongly one way or the other.  I am 37.  I have 5 great kids and had the chance to breastfeed and we don't want any more, so I opted for the BMX even though initial scans showed only a primary tumor on the right.  However, the final pathology from the surgery showed a small satellite mass in the same best, so I was very happy with my decision.  I had very large breasts (DD) and a very small frame (4 feet 11 inches 120 pounds), so I also looked forward to the opportunity to downsize.  Finally, I choose the BMX for cosmetic reasons.  I wanted as much symmetry as possible and the PS assured me that I would get better symmetry if he reconstructed both sides as opposed to trying to to match a recon to an existing breast.  I also had the AND and don't have any numbness,  I did right after surgery, but all feeling has returned to my underarm area.  I can also say that I am regaining sensation in some portions of both breasts.  The TEs are annoying, but you get used to them.  I think Melissa is absolutely right.  You have to listen to that little voice inside.  I believe strongly in the mind-body connection and something told me in the beginning that the BMX was the way to go for me.  Tammy",
      "MessageIndex": 1154,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 14, 2011 06:38PM sundermom wrote: It looks like I'll be joining the May rads group.  I just found out this morning that I'll be doing 33 sessions of daily rads starting mid-May.  The positive side is that my exchange surgery had to be pushed up so I'll be getting the implants on May 10th.  Yippee!  Only 25 more days with these pesky tissue expanders!!! For those of you slotted to take Tamox and doing rads - When will you start the Tamox?  I'm all for starting it the day I finish chemo :)  I don't want any \"untreated\" time to pass before starting rads.  Tammy",
      "MessageIndex": 1184,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 4, 2011 04:39PM sundermom wrote: Melissa - Hang in there!  The third AC was the absolute worst.  However, #4 was by far the easiest for me. I take an Ambien and an Ativan every night and I sleep like a baby (well, except when I had to take the steroids before the Taxol tx)!  ProudMom - Tomorrow I will be 2 weeks out from my last Taxol and my exchange is next Tuesday and then rads start the following week.  I feel like I'm running a race. The last Taxol kicked my butt.  I felt like crap for almost a week.  That was the longest I've ever felt bad with any tx, even the dreaded red devil.  The bone pain was completely exhausting! Carla - I have to admit that my eye makeup skills have greatly improved. It does seem to be getting a bit harder with the fewer and fewer eyebrow hairs that are left though.  The kit I use came with a stencil so that has been nice. Melanie-Ann - I'm not nearly as good as the extreme couponing folks, but I was impressed with my recent shopping trip.  After all the deals and coupons I ended up spending $6 at Walgreens and walking out with $6 in register rewards - so eveything I got was basically free.    Christine - I'm so tired of being bald.  It's not even a self-conscious thing at this point, but more of I'm sick and tired of wearing something on my head all of the time. I can rock the scarf, but I don't ever see myself being able to go out \"topless\".  LOL Funny story . . . My BFF went with me to every single chemo treatment.  In fact, I lovingly referred to her as my chemo hooker.  Well, she and I are going to see Bret Michaels (Poison lead singer) this summer.  He is notorious for wearing a bandana and cowboy hat.  Anyways . . . she says to me \"We're going to have to buy doo-rags for the show\".  I looked at her and what's left of my sad little eyebrows raised and I said, \"In case you haven't noticed I wear a 'doo-rag' every day\".  The two of us laughed until we cried.  It just goes to show you that the people that really care about us look past all of our physical qualities and love us for who we are. Tammy",
      "MessageIndex": 1326,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 10, 2011 05:16PM sundermom wrote: Betsy - I'm so happy for you!  I hope your trip goes well. UTMom - I hear you on the Nuepogen shots!  I got a Nuelasta shot (The extended release version of the same med) after each dose dense treatment.  I swear that was one of the things that me the feel the worst.  You can sleep through nausea, but you can't sleep through bone pain!  Mimidi - There are days I see the light at the end of the tunnel and days that I don't.  There were many tears shed on post-chemo days for me as those were the hardest.  I already didn't feel great so it wasn't a huge stretch to let that get in my head. I can say now (almost 3 weeks out of chemo) that my mental outlook is completely different.  One day at a time . . .   I had my exchange surgery this morning and am so happy to finally rid of those blasted cereal bowls that have been sitting in my chest for 5 months.  I'm wearing and industrial strength \"push down\" bra and about 5 feet of Ace wrap.  The Ace wrap can come off tomorrow so I can get a peek at the new girls.  I can tell you that they 100% better than the TE expanders.  I didn't realize how much those were pressing on my ribs!  I go on Friday for my rads sim and it seems like I'll be able to put my arms above my head with no problems.  I bought some Aquaphor and aloe vera gel in an effort to avoid skin problems. No signs of hair in fact I think I now have less than a dozen eyebrown hairs on each side now.  Ugh!  Talk about adding insult to injury . . . Tammy ",
      "MessageIndex": 1372,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Aug 28, 2011 05:05PM sundermom wrote: I found radiation to be by far the most annoying, but easiest, part of my treatment. My poor techs probably though I was the biggest b&$@! in the whole world. Not everyone has the horrible skin reactions that you read about. In fact, I had nothing ....zip...nada...other than a light \"tan\" which is now gone at less than 6 weeks out. I had EVERYTHING possible ( whole breast, clavicle, axilla and boosts) radiated so plz try not to worry about SEs. You'll sail through and it's OK to be grumpy about it!!!",
      "MessageIndex": 21,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/773522",
      "Title": "I don't want to go to my planning rads tomorrow bedo Lissa123"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 3, 2011 08:21PM sundermom wrote: I got a Nike compression sports bra upon the recommendation of my LE therapist. It seems to keep the truncal swelling in check for me. The only thing I don't like about it is that you can't wear it under a V-neck dress shirt - which I wear to work several days a week. I also found a bra at Target called Simply Bare. It has a support of the underwire without the irritating wire.",
      "MessageIndex": 4,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/775873",
      "Title": "to wear a bra or not? AnnetteS KS1"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Aug 13, 2011 01:09PM - edited Aug 13, 2011 01:11PM by sundermom OK ladies I went for my first PFC hair cut today at 15 weeks out. The back and around my ears was getting crazy. So... I'm sitting there waiting for my stylist and another women comes up and comments how adorable my hair is. This is before hair cut mind you! I thanked her and explained that it was not a hair style of my choosing but that I was a breast cancer survivor. She looked shocked! This was exactly what I needed today. :) I'm an elementary principal and kids head back to school this week and I have been doubting my decision to ditch the scarves. I'll get a pic up soon. bdavis - I'm glad you are doing well. We were diagnosed around the same time so I've been trying to keep up with your journey. I'm done with treatment now and it feels amazing!!! My first scans will be in October.",
      "MessageIndex": 10833,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 28, 2012 05:38PM sundermom wrote: I'm 9 months PFC and my hair actually has a style now. Just wondering . . . I had super long hair before BC, but I find myself really liking my pixie cut. Anyone else made the decision to stay short?",
      "MessageIndex": 13715,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 10, 2011 08:46PM sundermom wrote: I will be 3 weeks PFC on Thursday and I am SO ready to see some hair.  I'm like a hairless mole rat right now.  No leg hair, no armpit hair, no down under hair, no eyelashes and the brows are just about all gone now too.  It's so depressing!!!  I think I need to order some new scarves for summer to brighten my mood.  A little retail therapy . . . . Tammy",
      "MessageIndex": 9213,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 22, 2011 10:53PM - edited May 22, 2011 10:56PM by sundermom 32 days PFC and what started as fuzz last week is actually now visible strands of hair about 1/8 of an inch long.  My hair was well below my shoulders before BC so I've got quite a ways to go.  My eyelashes have also sprouted, though the eyebrows continue to fall out :(  If I lose anymore eyebrows I'm just going to stop trying to fill them in because it's going to be more powder than hair.  LOL  I start radiation tomorrow - oh joy!  33 days of praying the beautiful work of my PS doesn't get wrecked!  We had our 2nd 80+ degree day here and wearing a hat/scarf is so annoying when it's that hot.  I can't wait to be rid of these!!! Tammy",
      "MessageIndex": 9410,
      "PostDate": "22/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 7, 2011 10:04PM sundermom wrote: I'm 6 weeks PFC and have a nice full covering of dark hair now. It is so soft!!! I've worn a scarf this whole time, but it's been oppresively hot here. I don''t quite have the courage to go topless yet, but am hoping to do so when the students return in August. The eyebrows are coming back (slowly) and I can actually put mascara on my stubby new eyelashes. I love seeing all of your pics. You are all absolutely lovely :) Tammy",
      "MessageIndex": 9724,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 20, 2011 06:49PM sundermom wrote: I bought some amazing brow powder at Ulta.  I think it was called Anastasia.  My brows almost completely fell out and I always got comments about how people were surprised I hadn't lost my eyebrows!!! :)  Chemo wiped out my eyelashes too, but nothing a thick coat of eyeliner didn't fix.  12 weeks PFC and both my brows and lashes are completely back - not looking forward to them thinning again though.  Yuck! Tammy",
      "MessageIndex": 10440,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 20, 2012 08:49PM sundermom wrote: I've had my hair back for over a year now, but all of the sudden I am noticing that it seems thinner.  I took prenatal vitamins to try to jump start my hair growth after chemo and I thought they worked wonders, so I might try those again.  Has anyone else experienced hair thinning after being 1 year+ PFC?  I'm only 39, so I'd like to find a product or supplement to combat this issue. ",
      "MessageIndex": 17885,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 5, 2012 09:18PM sundermom wrote: Dry Mouth Formula. Biotene also makes a toothpaste. I used the mouthwash and the toothpaste twice a day. I definitely had some mouth sensitivity, but no actual ulcers. I also chewed on ice chips before, during and after my AC infusion.",
      "MessageIndex": 5,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780552",
      "Title": "biotene rinse? Lumpynme Lumpynme"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 30, 2011 05:25PM sundermom wrote: I did a different set of drugs than you, but I lost my hair on Day 17 like clockwork. I went into to treatment #2 with a full head of hair and three days later it was gone. It was completely depressing but I felt much better after we clipped it to less than half an inch and I started wearing scarves. I probably could have prolonged it by a week or so, but I felt better to take charge of the situation.",
      "MessageIndex": 2,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775771",
      "Title": "Million Dollar Question on Hair Loss! Rockym nicholewilliams"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 15, 2011 05:27PM - edited May 15, 2011 05:27PM by sundermom I'm 25 days PFC and we have peach fuzz!  I was going \"topless\" around the house yesterday and saw the little fuzz as I was cleaning a mirror.  Grow, baby, grow!  Tammy",
      "MessageIndex": 9272,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 23, 2011 09:50PM sundermom wrote: I think I've reached a milestone...I no longer have to paint on my eyebrows!!! If only the hair on my head would return so quickly. I have been going topless around the house, but I still can't bring myself to do so out in public. I'm 8 weeks PFC and it looks like it did when I asked hubby to buzz it off, which is a major improvement from the cue ball I was sporting 2 months ago, but oh how much I miss my hair :( Tammy",
      "MessageIndex": 10017,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 12, 2011 05:12PM sundermom wrote: I am almost 11 weeks PFC and a pulled the trigger on some home hair color yesterday, It looks so much better! My hair is coming in nicely, but it was almost colorless. I'm toying with the idea of going topless, but am just anxious about doing it. The first time I donned a scarf in public everyone felt the need to comment. I'm just not ready to go through that again. Tammy",
      "MessageIndex": 10302,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 20, 2011 06:45PM sundermom wrote: Almost 12 weeks PFC and I'm getting crazy thoughts of going topless, partly because it's so flipping hot here.  I mean a scarf makes it pretty damn obvious that I've done chemo so why am I so nervous about losing the scarf in favor of my short hair???  My DH actually LOVES my short hair, but having never worn my hair any shorter than my shoulders this is a definite adjustment for me!  I need to just get over it or I'll be wearing a scarf until Christmas at this rate.  At what point did all of you make the leap to go topless in public?  Do you have any witty responses for people who feel the need to tell you, \"Your short hair is so cute\" or make dumb comparisons to celebraties (i.e. Halle Berry, Annie Lennox, Billy Idol,etc.)? marjie - My hair looks a lot like yours in your pic :)  It actually pokes out beneath my scarf and people have been asking about it.  Tammy",
      "MessageIndex": 10438,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 24, 2013 02:54PM sundermom wrote: I took a squishy stress-type ball on the plane and squeezed it every 15 minutes or so to keep the lymph fluid moving. I did also have a sleeve, but it took me a week or so to get it.",
      "MessageIndex": 2,
      "PostDate": "24/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/806652",
      "Title": "Need advice ASAP for flight tomorrow exbrnxgrl hugz4u"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 23, 2011 11:11PM sundermom wrote: Lumpectomy vs. MX is a very personal decision.  I can tell you I never considered a lumpectomy and opted for the BMX with immediate recon with TEs.  I agree with mgd that the final path report after surgery can throw a wrench in everything.  They found areas of DCIS and another tiny mass, suspected to be malignant, on the affected, that never showed up on pre-surgery imaging tests.  Had I not opted for the BMX I would have been a ticking time bomb for a recurrence.  Get your path reports, talk to the BS and listen to that little voice inside. Tammy",
      "MessageIndex": 4,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/766527",
      "Title": "going crazy waiting debbsie Shirlann"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 22, 2011 08:13PM sundermom wrote: For me any increased benefit was worth the tolerating the possible SEs from chemo.  I did dose dense AC/T and I had exactly 2 kind of crappy days each round - Day 3 and Day 4.  As you can see from my signature line I had a pretty nasty BC and I couldn't imagine NOT doing chemo.  I'm 12 weeks PFC and 1 week out of rads and just took my first Tammi pill.  I am thankful for all the tx that are available to us and would willingly undergo any tx offered to me if there is a potential benefit/protection against recurrence. Tammy",
      "MessageIndex": 14,
      "PostDate": "22/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/771992",
      "Title": "Chemo vs. No Chemo edoyrest B123"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 22, 2012 01:38PM sundermom wrote: I just posted about this on the Moving Beyond Cancer thread! I recently allowed a blood draw out of the LE arm. I had a BMX, but 32 nodes removed on the right side. However, the veins on the left side have been completely wiped out by chemo. The only time they can find a good vein is when they use local anesthesic and good to town digging around with a pediatric needle. Since the typical lab doesn't offer this service, blood draws have become a source of great anxiety for me. So, when my OBGYN mentioned that he wanted to check hormone levels I just about cried. At that point I decided to let them use the LE side. It was wonderful ...one barely perceptible needle stick. That was a week ago and I havent had a flare up yet. I won't use this side for IVs but I will be using it for all future blood draws.",
      "MessageIndex": 9,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/797901",
      "Title": "IVs and other sticks manatee64 Binney4"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 10, 2010 01:26AM sundermom wrote: This is a great discussion.  I am an elementary principal and a mother of five little ones under the age of 11.  I'm around germs 24-7!!!  My BMX is scheduled for next Wednesday and the need for chemotherapy has not yet been determined.  Since I am only 37 I'm thinking this is very likely, but we'll see what story the SNB and Oncoype testing tells.  I plan on working as much as possible.  I love my job and working has been a nice distraction from this mess.  If I do end up needing chemotherapy, then my plan is to get the infusions on Wednesdays or Thursdays and then have a long weekend to recover.   I think there is some value to keeping things as \"normal\" as possible. Tammy   ",
      "MessageIndex": 24,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/759148",
      "Title": "newly diagnosed looking for elementary teachers AnnetteS Claire82"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 22, 2011 01:16PM sundermom wrote: I'm new to the whole LE thing, but I am amazed how much relief I get from having massage. I have a handout, but I'm much more of a visual person. I think I have it down when I'm working with the therapist and then I can't get the same relief when I do it myself at home. Thanks for sharing!",
      "MessageIndex": 2,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/775303",
      "Title": "Self Lymph Drainage Video hotandcold sheri56"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 5, 2014 06:44PM sundermom wrote: I had a bilateral MX with TE placement and 32 nodes removed. Just stay ahead of any potential discomfort by taking your pain meds routinely until the drains are removed. It wasn't nearly as painful as I imagined it would be. In fact I went back to work (elementary school principal) in about 2 weeks.  I hope you have a speedy uneventful recovery :)",
      "MessageIndex": 3,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826046",
      "Title": "Good stories Luckydog42 alizbeth"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 25, 2012 10:17PM sundermom wrote: Are you having expanders placed during the BMX? I did and I was able to move pretty well after the first couple of days. I never needed any help going to the bathroom, brushing my hair, etc. I did have trouble with putting on a shirt and it was a couple of weeks before I could get my arms over my heads without discomfort.",
      "MessageIndex": 6,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/789659",
      "Title": "BMX ladies !!! cailindearg coraleliz"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 1, 2011 10:03AM sundermom wrote: Being staged at IIb myself I find your post particularly encouraging! I have my first round of survellience scans in a few weeks and I'm a mess. I have no reason to think anything is awry, but I didn't have any reason to think I'd get BC in the first place. Thanks again - just what I needed today:)",
      "MessageIndex": 8,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775747",
      "Title": "Seven years ago today Member_of_the_Club Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 31, 2011 09:25PM sundermom wrote: I will call tomorrow. Today I have to say that I experienced the most pain-free day I've had since my BMX. I do think that implant was evil. It caused problems right from the beginning and I think my body is happy to have it out :)",
      "MessageIndex": 1540,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 29, 2011 05:49PM sundermom wrote: My PS was adamant about having the exchange surgery before rads started. He said the tissue won't stretch as well after rads and he could tweak things the rads affected with a revision. So, I did the fills and chemo at the same time. It was rough, but worth it IMO. Tammy",
      "MessageIndex": 1094,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 22, 2011 01:11PM sundermom wrote: Today is a good day ladies! I had surgery to correct a capsular contracture of one of my implants on Tuesday and I can already see the results. Radiation was the gift that just kept on giving and was causing my right implant to migrate out of the pocket and sit very high on my chest. Now...thanks to my wonderfully talented PS...I have nice level breasts! He also did the nip reconstruction while I was out and I am amazed at how real they look. I'll go back for tattoos in a few weeks. Finally, I'm getting back on the road to normal.",
      "MessageIndex": 1420,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 23, 2011 12:52PM sundermom wrote: Proud_Mom, I will say the revision surgery has caused more discomfort that the original exchange surgery. I've missed 4 days of work and I didn't miss that much through all of chemo! Possible complications for me were infection and development of another capsular contracture. Like I said in an earlier post the results for me were immediate and I'm so happy. The radiated side now matches the other side in size, position and feel. I would totally do a revision again. My self esteem got a huge boost from starting the nip reconstruction as well. Of course, they more like teets at this point, but I'm told that they shrink down with time. LOL",
      "MessageIndex": 1429,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 28, 2011 08:11PM - edited Sep 28, 2011 08:12PM by sundermom SStayton, Unfortunately, we share a diagnosis. I had a PET scan before my BMX and SNB and the scan showed no node involvement, and then...two positive nodes were found during surgery. Needless to say, I'm not a huge believer in the almighty PET scan :) My biopsy pathology was originally Grade 2, but that was upgraded to Grade 3 (8 out of 9 on Nottingham scale) after surgery. I did 4 rounds of dose dense AC followed by 4 rounds of dose dense Taxol. I also did rads - 33 treatments and just finished my third bottle of Tamoxifen. My onc told me that chemo typically works really well on Grade 3 cancers, so I hope that gives you some reassurance. Do you know what areas you are having radiated? I'm happy to support you in any way I can. Take care :)",
      "MessageIndex": 1464,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 27, 2011 05:52PM sundermom wrote: I agree with all that has been said so far and will add that you don't want to let yourself get behind on your pain meds.  Set an alarm clock or have your DH wake you up through the night. I am 37 and had a BMX in December.  I have five children (10, 9, 7, 6 and 3) and I work as an elementary princnipal.  I was back to work in about 2 weeks.  The first week was the toughest and I spent most of my time in a dozing in a recliner.  As far as the tissue expanders go, I would say that make sure you dictate the amount that gets filled each time not your PS.  I think most PSs like to put 60cc in a each and that was way more than I could tolerate!  For me there was no hurry to get fully expanded because I was doing chemo, so slow and steady was key to making that process more manageable. Tammy",
      "MessageIndex": 23,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/768151",
      "Title": "I'm 39 with breast cancer, need advice mommyrnx2 waltersmith"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 14, 2012 11:13AM sundermom wrote: I buy mine from Earth Fare which is like Whole Foods.",
      "MessageIndex": 1,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781027",
      "Title": "Which Whey Protein is Best? theBCavenger newfmama"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 21, 2013 09:36PM sundermom wrote: My husband and I took an all inclusive Carribean vacation during chemo. I had finished AC and was about half way through Taxol when we were there. I drank quite a bit during that trip and didn't have any problems. I would concur with others that have posted about the taste of wine -it seemed very bitter, so I stuck to mixed drinks and fruity cocktails :) Enjoy your trip!",
      "MessageIndex": 5,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/811409",
      "Title": "Alcohol use during treatment Jolene1957 Jolene1957"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Feb 21, 2011 07:01PM sundermom wrote: I've been on this site since October 2010 and this is the first time I've seen this thread.  I was diagnosed in November of 2010.  I had an MRI and PET scan prior to my BMX in December 2010. Both scans showed cleans nodes.  I remember feeling so relieved.  Then . . . I woke from my BMX and I was told the SNB had come back positive.  One macro-met in node #1 and one micro-met in node #2.  My BS performed an AND and the remaining 30 nodes were clear.  I, too, have obsessed everyday after those stupid nodes!!!  I can say that as un-fun as DD AC-T chemo has been I wake up each day knowing that I have opted for the most aggressive treatment available.  I've done everything to give myself the best possible chance of beating BC.  kriskat - Will the result of the PET scan change your treatment?  If not, I'd wait for any scans until after your chemo is complete.  These scans aren't fullproof, as much as we'd like them to be. bdavis - I also had discrepency between the original ultrasound and the actual pathology from the surgery.  My onologist reassured me not to obsess about a couple of millimeters.  Smile_On - My tumor size seemed to fluctuate around my monthly cycles.  I thought it got noticeably larger right before my period.  My BS attributed this to the fact that the tumor was so strongly estrogen-receptive (>98%).  Tammy   ",
      "MessageIndex": 941,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 4, 2011 06:24PM sundermom wrote: KG1234- I am also 37.  I had a BMX on 12/15/2010.  My tumor size was 2.2cm and the SNB revealed a macromet in the SN (5mm) and a micromet in the 2nd node.  Thirty additional nodes were removed, but were all negative for BC.  The Onco-type test did not apply in my case because I was told it was developed for node-negative patients.  Due to being node positive and my age I am being treated with dose dense AC-T.  I will also take Tamox for 5 years, probably followed by 5 yrs of AI.  Chemo is manageable.  I have five kids under the age of 11 and have continued to work full time as an elementary principal. ",
      "MessageIndex": 999,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 9, 2011 09:11PM sundermom wrote: KG1234 - I had four drains to start and I think that last one came out at 2 weeks. The drains are definitely one of the more annoying parts in this process!  I had all of the nodes removed under my right arm so I had numbness (exactly like you described in the under arm area) and some weakness on that side for several weeks.  I'm now almost 12 weeks out have my complete range of motion back and no numbness.  I was vigilant about stretching that exercising both arms, even if it meant just pumping my arms while walking on the treadmill or crawling up the shower wall into a full stretch.  As far as a port goes my onc said he is not a big fan.  Knowing that I was only going to receive 8 treatments he recommended no port.  He had the infusion nurse come in and check out my good arm and she said I would be fine.  I had no problems with AC damaging the surrounding tissue.  Now, that being said, it does seem to be harder and harder to get blood drawn.  My veins just don't want to give it up!  We'll see how tomorrow goes.  If I have to get stuck 5 times like has happened in the past then I will be asking for a port - even if it's only for the last 3 treatments.  I have read something about asking for a \"power port\" so that can be used for MRIs, too.  Tammy",
      "MessageIndex": 1008,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 27, 2011 06:16PM sundermom wrote: My onc believes in regular scans and I will have a PET or a CT periodically for the next 5 years. In fact, I just had my first PET scan post treatment and am happy to report that there was no evidence of disease. My tumor markers were also checked and within normal limits. I may feel differently about the scans when I'm a little farther down the road, but I liked hearing the reassurance that today I am BC- free.",
      "MessageIndex": 1522,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 31, 2011 09:00PM sundermom wrote: I had Taxol, which is a cousin of Taxotere, it can also cause nail issues. I also used the Sally Hansen nail hardener and never experienced one issue. It works!",
      "MessageIndex": 1535,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 5, 2011 07:24PM sundermom wrote: Rose, Our signature lines are similar so I thought I'd share what my onc told me. With a BMX, chemo, rads, 5 years of Tamoxifen and then 5 years of AI he put my recurrence risk at right around 10%. I, too, had two separate tumors in the same breast. There's a much greater chance that we will NEVER have to deal with this again than having it recur.",
      "MessageIndex": 1618,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 14, 2011 04:10PM sundermom wrote: I received 4 dose dense treatments of Taxol and found it to be uneventful. I started with AC, so I thought Taxol was a walk in the park. I never took one pill for nausea. I had a few aches and pains, but I attribute that to the Neulasta shot because I had those same aches and pains all the way through chemo. The steroids before Taxol gave me a nice buzz for a couple of days, but i looked forward to having the extra energy :)",
      "MessageIndex": 1,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/774870",
      "Title": "Taxol Concerns khertenst Babs37"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 22, 2011 07:02PM sundermom wrote: I would make an appointment.  If you're worrying about it, then it's worth your time (and your doctor's) to follow-up in your concern.  I, too, am 37 and I'm glad I listened to that little voice inside that told me something wasn't right.  Remember 80% or all lumps are B9!!! Tammy",
      "MessageIndex": 4,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/766475",
      "Title": "I'm sorry to bother you all, but this has been worrying me! Napaoctober irish22"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 25, 2010 09:36AM - edited Aug 20, 2013 04:15AM by sundermom Happy Thanksgiving!  I got a call yesterday for which I am very thankful.  My genetic testing came back and I am not a carrier of BRCA (sp?) I or II.  It doesn't change my decision about having the surgery, but it does give me a sense of relief for what the future might hold.  I'm still waiting on the MRI results and I have a PET scan on Tuesday.  Hopefully, this will give us some indication as to what might be happening in the nodes before the SNB on surgery day.  Annie - Thanks for your reply.  I called te BS's office and they clarified that I will indeed be asleep for the injection of the dye/radioactive tracer.  However, the nurse shared with me that my BS (who happens to be a woman) is the only one in this particular practice that does that way.  All of the other poor women are awake!  Unbelievable!!! Last night was pretty bad for me.  We were all watching a movie together and I was snuggling with my babies and then all of the sudden I just started to lose it.  So, I went into my bathroom and just burst into tears.  I'm finding that I just have days like that . . . where I just fall apart for a couple of minutes and then I'm OK.  We'll have 14 people over for dinner today, so that should keep me plenty busy! I hope each and every one of you have a wonderful day, today! Tammy",
      "MessageIndex": 84,
      "PostDate": "25/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 30, 2010 04:27PM sundermom wrote: citykitty - The PET scan was pretty painless.  One little IV and then a lot of quiet time before they took me in for the actual images.  I should get the results by the end of the week.  I am having the SNB during the surgery, so I won't know until I wake up if the BS decides to remove additional nodes.  The SNB procedure makes complete sense to me.  I'm not sure why the oncologist wanted and MRI and a PET scan.  Luckily, I have very good health insurance :)  I got my MRI results this afternoon.  No suspicious areas were found in the anxillary lymph nodes or other breast.  I'm still forging ahead with the BMX even though only the right side is affected.  I want to be DONE with this for the rest of my life!!! I'm praying for each and every one of you!  We will beat this and come out stronger on the other side!!! Tammy",
      "MessageIndex": 134,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 16, 2010 11:01PM sundermom wrote: Hi ladies! I made it to the other side.  I had my BMX with TEs on December 15th.  I was home today (December 16) by 2:00PM.  Had it not been for a screw up by my nurse last night, then I would be pretty much pain free.  She forgot to give me the pain pills the doctor had perscribed, so I went most of the night without anything!!!  I broke down into tears when the BS checked on me this morning and she get everything straightened out right away.  Otherwise, I feel really good.  The drains are annoying, but not painful.  The pain pump is awkward, but also not painful. The SNB injection was a non-event.  I had myself so completely worked up over nothing!  I had the first two nodes come back positive, so I had to get a complete axillary dissection on the right side.  This area is definitely the most sensitive right now.  SO. . . . chemo is on the way for me very soon.  Any one headed down the chemo road in a few weeks?",
      "MessageIndex": 287,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 29, 2010 04:50PM sundermom wrote: Summer, I am the principal of  K-5 building with approximately 470 students.  I love my job and I can't imagine not going to working, so even though I might be pushing myself, I will return to school on Monday.  There's nothing better than seeing those smiling faces in the morning. Tammy",
      "MessageIndex": 424,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 21, 2010 09:47AM sundermom wrote: Laurie, So much of what you wrote struck a chord with me and I thank you for posting such a thought-provoking message. My youngest daughter's 3rd birthday was yesterday and for just a brief moment I forgot about the whole BC thing and just let myself completely focus on on the happiness that was in the room.  Just that small period of time affected the rest of my day for the better.   There's never been a doubt in my mind that physically I would get through this whole ordeal, but I completely underestimated the toll this journey takes on one emotionally.  We're decorating the Christmas tree today and that's always fun with the five little ones. The kids are getting taller so maybe DH and I won't have to move so many of the ornaments up to higher branches after they go to bed tonight! Tammy ",
      "MessageIndex": 48,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Aug 24, 2013 06:53PM sundermom wrote: If you feel up to it, then you should absolutely go! My husband and I traveled to Jamaica while I was doing chemo (dose dense ACx4 followed by Tx4). I was a little tired, but how much energy to do you need to sit in the sun and drink Rum Runners all day? LOL Enjoy the concert!",
      "MessageIndex": 7,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/809763",
      "Title": "Concert during chemo? Cougarlicious sundermom"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Mar 15, 2011 06:30PM sundermom wrote: ck_moma - Great article!  I may print and frame it!!!  It's nice to read something encouraging for us node-positive ladies.  My onc has always told me not to get freaked about the 2 micro-mets, but everything you read (except this article) says otherwise! ",
      "MessageIndex": 1018,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 29, 2011 05:47PM sundermom wrote: Just wanted to chime in on MX and rads discussion....my RO told me that the new study shows great benefit for BMX patients with ANY positive nodes. It's just another tool in our arsenal! I had a BMX in December with 32 nodes removed, DD ACx4 followed by DD Tx4, 28 regular rads ( whole breast, axillary and supraclav) and 8 boosts (mx scar) and I'll take Tami for 5 years possibly followed by an AI. Overkill??? Possibly. I've had a pretty easy time of it though and I'm pretty much have myself convinced I won't be dealing with this again :) Tammy",
      "MessageIndex": 1093,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 31, 2011 09:11PM sundermom wrote: They didn't call. I've submitted two online requests for information over the past week and no one has called or emailed. I'm wondering if maybe it's a sign that NOLA wasn't meant to me for me??? My BFF is all lined up to go with me though if that's what I decide.",
      "MessageIndex": 1537,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 12, 2012 05:31PM - edited Jan 12, 2012 05:32PM by sundermom One year ago today ladies I was in the infusion room for my first dance with the red devil. Makes me shiver just thinking about it! I wonder at what point I will stop thinking about BC on a daily basis?",
      "MessageIndex": 1714,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 28, 2011 08:21PM sundermom wrote: DebRox, I am 37.  Similar to you my tumor was upgraded from Grade 2 to Grade 3 after surgical pathology from BMX.  I also had LVI.  However, I did have micromets in 2 nodes.  I would have had chemo regardless of the node status according to my MO.  Grade 3 and LVI both put us at a high risk for recurrence, and the young age (<50) is just another risk factor.  I did DD AC x4 and DD T x4.  I survived chemo and have now moved on to rads.  I'll take Tamoxifen for 5 years and then likely switch to an AI for another 5 years.  I have five kids under the age of 11 and I welcome any treatment options that better my odds of staying BC free for many, many more years.  Tammy",
      "MessageIndex": 11,
      "PostDate": "28/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769540",
      "Title": "Stopping Chemo? Late Oncotype Score Dilemma DebRox Rennasus"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 5, 2012 09:21PM sundermom wrote: I had an appt. scheduled with the surgeon that ordered the biopsy. I had the biopsy on Thursday and a results appointment the following Monday so it was going to be face-to-face either way.",
      "MessageIndex": 41,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 26, 2012 11:36AM sundermom wrote: Thanks for the info. I have one UA black long sleeve compression that I use at the gym and I love it. The only time I can bring myself to wear the sleeve out of the house is when I'm driving, which seems to be a huge trigger for me.",
      "MessageIndex": 1,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789667",
      "Title": "Under Armour on Sale kcshreve Tina337"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 6, 2012 02:48PM sundermom wrote: I took a yoga class at the local YMCA. I really think this helped with my recovery on so many levels. I worked my way up to a Pilates class about 12 weeks PFC and just this past week (finally after 8 months PFC) I was able to complete s boot camp-style class with spinning and weights.",
      "MessageIndex": 3,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780592",
      "Title": "Exercising During Chemo jenlee Claire_in_Seattle"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 12, 2012 04:19PM sundermom wrote: I liked the standard-sized bandana from headcovers.com. It comes in tons of colors and patterns and is cheap - like $4.00. I didn't feel guilty buying one for every different outfit :)",
      "MessageIndex": 46,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/748636",
      "Title": "What was your favorite head covering through chemo? BooBee Brendatrue"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 9, 2012 06:11AM sundermom wrote: Getting that last drain out will go a long way towards getting back to normal. I had that crappy feeling for about 6 weeks. I still have the underarm sensation you describe every once in a while, but I think I've figured out that it's related to the type of bra I wear. Yoga classes also helped loosen things up a bit.",
      "MessageIndex": 1,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/780685",
      "Title": "When do you start feeling normal? Cats134 Hindsfeet"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 26, 2011 08:57PM sundermom wrote: Kim, The SEs from AC always seemed to hit me on Days 3 and 4, but before and after that time I felt just fine. I remember reading somewhere that the nadir (where your counts hit rock bottom) happens around day 7 though I don't ever remember feeling any different on a Day 7. My onc told me that the SE pattern you experience with your first treatment will be a pretty good indicator of what to expect for subseqent infusions. That seemed to hold true for me and I got so good at preparing for the SEs that treatment number 4 was the easiest. For whatever reason, I thought that the third infusion was the hardest and have read similar accounts on these boards.",
      "MessageIndex": 1,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775560",
      "Title": "Symptom Free? Thepeddlerswife Jan244"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "sundermom wrote: I was officially diagnosed with IDC Stage I Grade 2 ER+/PrG+ a week ago from today.  I saw the surgeon last week and have opted for a bilateral mastectomy with immediate reconstruction.  I see the oncologist on Thursday as we are still awaiting HER2 results.  However, I don't see the plastic surgeon until the 29th!  That means the surgery won't be until December or possibly early January. I found this lump on October 23rd and from my perspective things seem to be moving so slowly.  How long did you wait from diagnosis to surgery? I just keep thinking about this stuff growing inside of me and it's making me crazy!  I want it out NOW!!! Being 37, I'm pre-menopausal, so there has been some discussion of the need to control my hormones.  I've read about Tamoxifin, but also having your ovaries removed.  Any experience with either of these???  Thanks!t Dx 11/8/2010, IDC, 2cm, Stage IIB, 2/32 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/760790",
      "Title": "How long is too long to wait? sundermom citykitty"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 30, 2010 09:03AM sundermom wrote: I had my consultation with the PS yesterday.  He said it would take about 3 months for the whole tissue expansion process.  He will bring me in for weekly \"fills\" as I can tolerate them.  Does that sound like what you all are hearing, too?  He also explained how my nipples would be reconstructed and tatooed.  I had no idea!!!  I guess the implant exchange surgery date will be dependent on whether or not I have to have chemotherapy.  The PS seemed surprised that my oncologist had not already made that decision being that I'm only 37.  However, the oncologist wants to see the results of the SNB and Oncotype testing, if applicable, before making that decision.  I had a PET scan this morning.  I prayed the entire time that the tracer wouldn't flag any other parts of my body.  I still feel like I don't know exactly what I'm up against.  Everyone is calling it Stage I right now, but I know that could change dramatically with any given test.  It's nerve-wracking!!! DH and I finished most of our Christmas shopping last weekend for our five kiddies (10, 8, 7, 5, and 3)!  It was nice to be out and about enjoying the holiday lights and decorations.  I find myself starting to lose sleep again, almost like in the beginning of this whole process, as I get closer to the surgery date.  I've had several surgery dreams and none of them were pleasant :( Good Luck to the December 1st ladies tomorrow.  All of this anxiety and waiting will soon be over for us all! Tammy ",
      "MessageIndex": 127,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 2, 2010 08:32PM sundermom wrote: Hello All! I got my PET scan results and it said \"no abnormalities detected with the exception of the known tumors.\"  The nurse said that's the best possible report so I was happy.  Then . . . I started searching on the Internet.  I found a study that cited that PET scans are less than 70% reliable in detecting lymph node involvement.  Ugh!!!  Why can't I stay off of the Internet???  I'm getting far too skilled at searching. LOL This week seemed to fly by.  It's hard for me to believe that I'm less than 2 weeks away at this point.  We just made arrangements for my MIL to stay with our kids overnight on surgery day so that my husband can stay with me.  At first I didn't think I'd want him there with me overnight, but as it gets closer I'm starting to think I will need his support emotionally, or at least his comic relief.  He was a hoot at the PS consult!!! Take Care December Sisters {{HUGS}} ",
      "MessageIndex": 157,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 14, 2010 06:21AM sundermom wrote: About 24 hours away from surgery for me.  I had to force myself out of bed because I felt like getting up and starting my day set into a motion a set of events that I'm not I'm quite ready for. I've had a good cry already this morning, so I know it's getting close.  It's is SO helpful reading the posts of the December ladies that are recovering.  Tammy ",
      "MessageIndex": 246,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 21, 2010 12:00PM sundermom wrote: 6 days out now and today I feel the best I've ever felt!  The amount in all of the drains is down by over 50% - about 10cc every 12 hours.  I have an appointment on Thursday to get the stitches removed so hopefully I'll lose a couple of drains at the same time.  I, too, received my pathology report back.  The BS had to perform a complete AND because to first two sentinal nodes came back positive.  Well . . . it turns out that only 2 of the 32 lymph nodes she removed were affected - the first two.  I find this very reassuring.  I feel like we have stopped BC from moving forward in this body!  I'll still have to have chemotherapy, but I had already prepared myself for that.  In fact, my kids keep asking, \"Is your hair going to fall out today, Mommy?\"  There is a great list of head covering options on the Chemotherapy Board.  I've ordered several things already - just another excuse to shop, right?  Today, for the first day since all of this started, I feel like I'm starting to heal, not just physically, but emotionally.  I (we) can do this!  I (we) are all doing this!!!",
      "MessageIndex": 342,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 19, 2010 05:26PM sundermom wrote: Please add me to the list.  I'm scheduled for a bi-lateral mastectomy with SNB on right side and reconstruction on December 15th.  As the mother of 5 children all under the age of 10 Christmas shopping is going to be a challenge this year.  Thankfully, my husband and I are both in the education field (He teaches kindergarten and I'm an elementary principal.) so we are surrounded by lots of people willing to watch our kids while we sneak away for some Christmas shopping.  After reading many of the posts here we bought a recliner last week and it sits in the corner of our bedroom.  I still need to go and buy some zip up sweatshirts for post surgery, but other than that I think we're ready with the little things.  Being ready mentally is a completely different story.  Some days I feel worry free and other days I look at my kids and want to cry.  Yesterday, I tried to imagine what it would be like to look at my chest for the first time.  Scary thought!     Wishing all of you peaceful sleep and comfortable recoveries!",
      "MessageIndex": 41,
      "PostDate": "19/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 6, 2010 05:13PM sundermom wrote: It's so good to start hearing from December ladies that have made it to the other side.  The fact that you felt good enough to post was very encouraging to me.  Thank You! I hit Target today for the pre-surgery shopping trip tonight after work.  Geez - that was weird. I bought some Palmer's Cocoa Butter Lotion in an effort to hopefully avoid stretch marks as I'm \"growing\" my new boobs.  I also bought some Mederma gel.  My Mom used this after her lung surgery and now you can hardly see her scars at all.  Tina- Thank you so much for mentioning the Colgate WISP.  I had never heard of those before and I was a little leary of taking my toothbrush to the hospital.  I think someone else mentioned this, but I also experienced the first feelings of \"mourning\" over the loss of my breasts as I was putting away my bras this weekend.  My husband always buys me cute matching sets at Victoria's Secret, so I have lots :)  Anyways, I couldn't help but to think I won't even get to wear some of them again.  Then . . . I started to get teary!  I know I HAVE to do this.  My kids and my husband need me to do this, but some days that doesn't make it any easier.  Tammy ",
      "MessageIndex": 178,
      "PostDate": "06/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 28, 2010 07:25PM sundermom wrote: I had two doctor's appointments today.  The  first apointment with the breast surgeon was pretty noneventful.  She said things are healing beautifully and that I should have a wonderful reconstruction outcome.   The oncologist appointment was a little more to process. I definitely have to have chemotherapy for several reasons - 1.  I'm only 37  2. There were two tumors in the same breast.  3.  Two lymph nodes came back positive.  So . . . I got the chemo talk today.  Honestly, this process terrifies me more than the surgery.  I will have 4 rounds of something called dose dense AC and then another 4 rounds of dose denseTaxol.  Chemo starts on January 13th - Yikes!  I'd love to hear any experiences about chemo from anyone willing to share. I bought some sports bras today because I plan to head back to work next week and I'm just not comfortable going braless as a principal!  LOL  I have super long hair which I plan to cut into a short bob before we return to school on Janurary 3rd.  I'm still not sure whether I'm going to wear a wig, hats or scarves, but I guess I need to get this all figured out pretty quickly.  Also, I am not getting a port put in for chemo.  This makes me a little nervous, but the oncologist had the nurse come in and look at my veins and she said I be fine.  OK  I thought I'd heard stories about chemo destroying people's veins, but maybe those were myths \")  Glad to hear the rest of you are getting along a little better each day.  Today is the first day I've woken up before 10AM and not required a nap, so I know I must be getting better :) Take Care, Tammy ",
      "MessageIndex": 409,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jan 14, 2011 05:59PM sundermom wrote: Hello All!  Just checking back in to see how everyone is doing.  I'm 29 days after my BMX and feeling pretty good.  I've been back to work since Jan. 3rd. - which in hindsight was probably a bit too soon :)  I have two expansions and one chemo treatment under my belt.  The jury is still out on chemo since it's only been two days since my first treatment.  Fingers crossed for manageable SEs!!!  Each expansion leaves things feeling stiff and tight for a couple of days.  I was a 34DD before and I'm thinking I'll be quite happy with a full B or a small C at this point.  I should be done with chemo in mid-April and then hopefully all ready for my exchange in late May early June.  This board has really helped me get through whole experience.  Take Care Tammy",
      "MessageIndex": 500,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 29, 2011 06:20PM sundermom wrote: Connie, I completed 4 rounds of dose dense AC (adriamycin and cytoxan) followed by 4 rounds of dose dense Taxol earlier this year. I think doxorubicin and A are the same thing. Chemo was much easier than I ever thought it would be. There are medicines to combat almost every possible side effect. I missed very little work and the Neulasta shot kept my counts within normal levels during all of the treatments. I just finished radiation this past July and I thought that was even easier than chemo. It made me very grumpy to having to go for an appointment everyday and my skin got a little pink, but overall I found radiation to be a non-event. The unknown is scary, but please take some comfort in the fact that many women on this board will tell you that treatment is very \"manageable\".",
      "MessageIndex": 3,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777222",
      "Title": "help! Chemo or not? boxcars072000 boxcars072000"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 14, 2011 09:44PM sundermom wrote: I just found out this morning that I, too, will be doing rads.  I had a BMX in December with immediate TE placement.  I'm finishing up chemo next week, will have my exchange surgery on May 10th, rads simulation on May 12th and start the following week,  I will be having 28 regs and 5 boosts.  Tammy",
      "MessageIndex": 1,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 20, 2011 07:14PM sundermom wrote: I have to admit I'm getting a little nervous about rads.  I've been lurking on the March board and so many of them reference skin problems.  My mom had radiation for lung cancer 2 years ago (Yes- still she here with us- yippee) and she didn't have the first problem with her skin.  We are quickly approaching summer and I LOVE being in the sun.  My two boys will play in a combined 100 baseball games, so staying out of the sun isn't really possible for me.  I will just listen to my body as I've done through chemo, knowing that each person's experience with each treatment is different.  I hate needles so the thought of tatoos is terrifying to me!!! Tammy",
      "MessageIndex": 9,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 25, 2011 06:17PM sundermom wrote: My RO said no deodorant for the entire 7 weeks and no lotions/creams for 4 hours before therapy each day. I'm telling you all right now that I'm wearing deodorant!!!  I did find some that was organic and made for radiation patients, so I figure that's a good compromise.  My treatment will be going well into the summer and lack of deodorant just isn't an option.   I find myself getting nervous about starting rads so soon after my exchange surgery.  I have surgery May 10th and the rads simulation on the 12th.  I'm a pretty tough cookie, but if the exchange surgery is anything like the BMX lifting my arm over my head won't be physically possible in 48 hours.   Supposedly, my docs have all consulted and come up with the timeline.  I hope they are right! Tammy Tammy",
      "MessageIndex": 22,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 4, 2011 08:08PM sundermom wrote: My onc told me that \"standard of care\" for early stagers ( I noticed we're the same dx.) was not do scans until we develop symptoms.  I looked at him and said. \"That's not going to work for me.\"  He laughed and said, \"It doesn't work for me either.  I do more scans than any other dr. in this place.\"  I'm going to look at it as my little piece of reassurance every 6 months for the next 10 years. Tammy ",
      "MessageIndex": 78,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 22, 2011 11:04PM sundermom wrote: TonLee - It was beautiful in Ohio yesterday and today, right?  I was out in the full sun both days watching my kids play baseball.  I wore T-shirts (normally I would wear sleeveless or spaghetti straps) mainly to cover the marker marks.  It was so hot!!!  Ugh - I'm going to have to cave and get the additional tats.  I'll never make it until midJuly wearing all of these clothes :) spartina and juilet - Tomorrow will be Day #1 for me too.  I think I'm more nervous than when I started chemo.  I'm going at 3:15 everyday, so if I'm wiped out I can go home and crash . . . well, until it's time to take the kids to swimming, baseball or something else. I've got my aloe and Aquaphor all ready for #1 tomorrow.  Now all I need is a little courage.  The unknown is so unsettling and let's face it, this journey has been full of unknowns! Tammy",
      "MessageIndex": 370,
      "PostDate": "22/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 1, 2011 05:50PM sundermom wrote: gmafoley - I experienced a sensation of tightness right after the first treatment and my RO told me it WASN'T my imagination.  I also turned pink that night and have every night thereafter.  Somehow my body recovers overnight and I wake up the next morning with normal sensations and skin tone.   ",
      "MessageIndex": 580,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 27, 2011 08:14PM sundermom wrote: Tinaj - Congratulations on being done! We're getting there ladies- one day at a time has been my motto through this whole mess. I had 24/28 reg today. I'll start the boosts next week. I've been told by the RO the the boosts will target \"a completely different\" aka the scar line. This makes no sense to me!!! At this point my whole right side is red so I don't possibly see how the boost will target a different area. I wore a bra the other night. Big mistake!!! We were going out (and I'm still not completely satisfied with the drop and fluffing of the implants) so I pulled out one of my lightly padded VS bras to help shape things a little. Ouch! About 3 hours into the evening I found myself having thoughts of throwing the bra away in the bathroom. 7 months of no bra has ruined me. LOL Tammy",
      "MessageIndex": 1002,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 13, 2011 10:36PM sundermom wrote: 15 hours and counting until the last one!!!  When I went for my last chemo I had my kids make a card and I took in a huge platter of chocolate covered strawberries.  Well . . . I've got NOTHING planned for tomorrow.  It's not that everyone hasn't been great, but I just don't have it in me.  I don't want to ring the bell.  I don't want to sign the board.  I don't want the water bottle or the tote.  Just let me get back to living my normal pre-BC life.  I get a whopping 8 days off before I start Tami.  Can you tell I'm grumpy about having BC today???  LOL Tammy",
      "MessageIndex": 1119,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 7, 2011 04:34PM sundermom wrote: Kasi, The information you get over the next few weeks will determine your tx. Like you, I am a \"worst case scenario\" -type thinker. I wouldn't describe myself as negative ...I just like to prepare for the worst and hope for the best. I was dx in Nov 2010. It has been a crazy 7 months, but I'm almost to the end of tx. I've worked full time all the way through (BMX Dec 2010, chemo Jan through April, exchange surgery May 2010 and now rads until July) and kept up with being a mom to my 5 little ones. I'm no super-woman, so please understand this is doable. One test, one tx, and one day at a time. I took a trip to Jamaica smack dab in the middle of chemo :) Tammy",
      "MessageIndex": 55,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 22, 2011 04:25PM sundermom wrote: Kasi, Good Luck with the BMX on Monday.  I also opted for a BMX in December even though the BC was only in the right.  I don't regret my decision on bit!  I think everyone has a slightly different experience with this surgery.  I had 32 nodes removed as well and I don't have any lingering numbness and had my full range of motion back about 8 weeks after surgery.  While the implants are not the same as my old breasts they look FANTASTIC compared to what I thought was possible.  I'll never have to wear a bra again and my boobs will always look like a 20 yo. :) I did AC followed by T for 8 dose dense cycles.  AC was the roughest part, but staying on top of the SEs with other medications is key.  T was a breeze!  I also got a Neulasta shot 24 hrs. after each treatment.  Now those made me feel like an old woman, but it only lasted for a day or two.  Just take one day at a time . . . Tammy ",
      "MessageIndex": 116,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769853",
      "Title": "Not Diagnosed Yet But Radiologist Not Optimistic Kasi redroks2"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Apr 28, 2011 08:18PM sundermom wrote: Hi ladies!  I'm a member of the January 2011 chemo group and decided to pop over and wish you all the very best as your start your treatments.  Many of us in the Jan group are finishing up now and I know I had a hard time envisioning myself crossing the finish line during those first few weeks.  There are medications to manage almost any SE that you might experience, so don't be afraid to ask your MO!  Chemo shouldn't have to be a completely miserable experience.  One day at a time . . . Tammy",
      "MessageIndex": 35,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Sep 29, 2011 06:32PM sundermom wrote: I have experienced several of the same symptoms that you mention in your post.  I also had BC on my right, dominant side.  I had a BMX with TEs and swapped out for silicone implants in May. Radation totally wrecked the placement of the implant on the right side and caused scar tissue to go crazy.  I recently had a revision surgery for capsular contracture and was amazed at how the shoulder, rib and back pain dramatically improved after the PS loosened things up a bit in there.  I have yet to find a pain medication that truly makes me feel pain-free, but my onc recently prescribed Tramadol and that's the best one yet.  I'm only a week post revision surgery and am hoping relief is in sight.",
      "MessageIndex": 1,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/775720",
      "Title": "Post Mastectomy Pain Syndrome after BMX and PT misswim cider8"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Nov 22, 2010 07:30PM sundermom wrote: The recliner question is a great question.  I see myself hailing one of our kids to help me with the lever!  Is anyone else having a SNB at the same as the surgery?  I made the mistake (or not) of reading some posts on this website about this procedure.  Some women make it sound down right brutal!!!  I remember my surgeon saying something about two injections at my consultation, but I was so overwhelmed with information that day I can't remember exactly what she said.  Luckily, the hospital I'm going to has nurses called BC Navigators.  I have an e-mail into one of these ladies to see if she can tell me more about how my BS likes to do the SNB procedure.  Also, I just got an appt. card from the BS showing that my original follow-up appt. for 6 days after surgery has been changed to 13 days after the surgery.  That means I'll have to live with those drains for almost two weeks! ",
      "MessageIndex": 64,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Dec 19, 2010 04:59PM sundermom wrote: What a difference each and every day makes in this recovery process!  I'm 5 days out now and am starting to feel more normal.  I still feel very tight in my chest, but I think that's where the expanders were placed under the muscles.  I still have all 4 drains in and don't foresee losing them tomorrow when I go to the PS to get the pain pump tubing removed.  Each drain is putting out between 30 to 50cc twice a day.  Yuck!  The hospital did not give my any information on arm exercises.  I had an AND on my right side, so I know I need to start working those muscles.  Does anyone have a good resource out there for conditioning exercises after BMX?  Also, are any of you walking for exercise yet?  I don't want to rush my recovery, but I know the stronger I get now the stronger I'll be starting chemo in a few weeks. Praying for all of the ladies that go in this week.  You'll feel so much better once it's done and over with! Tammy ",
      "MessageIndex": 303,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 19, 2011 03:22PM sundermom wrote: I did indeed finish!!!  With the time constraints of radiation treatment behind me now I am finally starting to enjoy my summer vacation.  Of course, I have two weeks before I head back to school, but it feels good nonetheless.  Thank you to everyone who posted on the May 2011 Radiation board.  It was nice to know that I wasn't going through this process alone :) Tammy",
      "MessageIndex": 1133,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 25, 2011 10:52PM sundermom wrote: #3/33 today and it feels like I'm not getting very far very fast :)  I've been using the aloe vera gel several times a day.  I can definitely tell something is being done to that side because it feels tighter and I started getting some zips and zings like after my BMX.  My RO said this is where the nerves are being aggravated by the radiation.  I ended up with 4 tattoos only one of which really bothers me because it's right at high noon.  I did find some coverup makeup that does a beautiful job of completely making it disappear when I wear a low cut shirt - which I plan to do a lot now with the new girls!  I've experienced the tornado sirens twice in 3 days.  Today golf ball sized hail pelted my house.  It's creepy!  We're under a tornado watch until 5AM tomorrow so I don't think I'm going to keep much in the way of sleep tonight. Tammy",
      "MessageIndex": 448,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 28, 2011 08:03PM sundermom wrote: I enjoyed a beautiful day watching one of my little guys play in a soccer tournament.  He won both games and is possibly headed to the finals, so that's always fun. My DH is with my other DS in a different city for a baseball tournament.  I sported a nice little spaghetti strap cami (braless) and  felt like I looked pretty darn good.  I have to say I'm loving my implants and this braless thing -ONE perk of BC, finally!  I sunscreened up the radiation side and used tanning lotion everywhere else.  LOL  I'll admit it.  I'm a sun worshiper and I dream of retiring to a place where the sun shines everyday.  Of course, I'm still 20 years from retirement, but I can dream, right?  Enjoy the holiday weekend! Tammy",
      "MessageIndex": 512,
      "PostDate": "28/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 29, 2011 05:10PM sundermom wrote: I got more lovely lines drawn on and stickers today to prepare for the boosts that start next week. Thankfully, these are all not visible in my swimsuit because we finally have some pool-worthy weather in Ohio. #26/28 regs done today so I'm approaching a milestone in my mind :) Today is my DH's birthday and tomorrow is my DS's birthday. I always get sentimental on birthdays, but I can't help but to think about the fact that this time last year none of my family knew what was coming. At 37, I was completely blind-sided by a BC dx. These boards have been a huge part of keeping me focused and positive. I've made it my goal to post at least one encouraging message a day forever so that I can attempt to return the kindness and compassion that has been shown to me here. Tammy",
      "MessageIndex": 1029,
      "PostDate": "29/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 4, 2011 08:01PM sundermom wrote: I'm on the countdown to my exchange surgery next Tuesday and then the sim next Thursday.  I think I've said this before but the rads make me more nervous than the chemo.  I just generally expected to feel like crap with chemo, but the rads seems like one big wild card.  I'm hoping my genetics will pull me through without any issues since my mom has done it twice and found it to be pretty uneventful.  Silly question . . . do you lay on your stomach or on your back for the tx? Tammy",
      "MessageIndex": 76,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 4, 2011 08:17PM sundermom wrote: I had a mammo, u/s, MRI and PET all before treatment started.  My understanding is that after rads I will be having a CT scan every 6 months and then a PET only if the CT were to show any masses. Tammy",
      "MessageIndex": 80,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 10, 2011 08:33PM sundermom wrote: Hello All!  I'm a few weeks behind all of you.  I had my implant exchange surgery this morning and go for my rads simulation on Friday.  I bought some Aquaphor and Aloe Vera gel, but I want to look at the bottle of the gel.. I don't think it's 100%.  We don't have a Whole Foods or Trader Joes around us.  Do you think a holistic health foods store might carry the 100% gel?  My MO mentioned nothing about skin care.  He said he didn't think I would have any problems because I don't sunburn easily and because there is no skin-to-skin contact between my new perky breasts and my chest.  I'm still planning on lubing up every day - better safe than sorry :)  Anyone else planning on hitting the pool this summer?  School lets out in about 3 weeks and we usually go to the pool everyday.  I'm thinkning maybe a sleeveless coverup????  That would let me get some sun on my arms and legs, but protect my chest. Tammy",
      "MessageIndex": 134,
      "PostDate": "10/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 13, 2011 02:44PM sundermom wrote: Well this process is finally getting started . . .  I went in today for the CT scan and am covered with lovely black and red marker lines.  I go back next Friday for the simulation and then start treatment the Tuesday after Memorial Day.  They told me the tatoos were \"optional\".  However, I'm thinking if I want to be seen outside at all this summer without looking like a freak then I need to opt for them.  For those of you with tats, how big are they???  I'm a freckled person naturally so I'm just wondering if I should stop wasting my time obsessing about these. Tammy ",
      "MessageIndex": 187,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 16, 2011 11:47PM sundermom wrote: It looks like I'm going to be one of the last to start in our group.  I go for the sim on Friday and tx start on Monday.  I have my follow-up appt. with the PS tomorrow.  I'll be one week out from the TE/implant exchange and am SO hoping to ditch the harness of a bra I've had to wear 24-7.  I think \"the girls\" look great considering everything we've been through in the last 6 months, but I am ready to be done with doctors, tests and treatments.  The thought of 33 daily treatments makes me grumpy :( Tammy",
      "MessageIndex": 228,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 16, 2011 09:15PM sundermom wrote: Congratulations to all you May gals out there that are finished or finishing up this week.  I'm so jealous!  I completed #17 of 33 today.  I'm holding up pretty well.  My armpit feels it the worst, but I don't have any visible skin issues.  The muscles on that side feel tight and spasm frequently.  It's almost the exact same sensations I had after the BMX in December.  I met a gentleman in the elevator on the way to tx yesterday.  He is also battling BC :(  I can only hope has a good support system like BCO. My summer vacation officially starts on Monday!!!  Working extra days in the summer is the part I like least about being a principal.  I can't wait to spend the days with my kiddos!  Tammy",
      "MessageIndex": 862,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 20, 2011 10:51PM sundermom wrote: chardon - I had a BMX in December and and SNB that turned up two + nodes.  I did 8 rounds of dose dense chemo AC followed by Taxol and am now in the midst of radiation.  I will be completing 28 regular treatments (whole breast, supraclavicle and axillary nodes) and then 8 boosts to the MX scar line.  I am 19 treatments in and I have to say I doing pretty well.  I apply 100% aloe vera gel several times a day.  I am slightly tender in the arm pit area, but no blisters, peeling or skin discoloration. I think every women's body responds to each tx differently.  There was a new study released last week about the benefits of node radiation that may help you in making your decision.  Tammy ",
      "MessageIndex": 928,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 1, 2011 05:31PM sundermom wrote: The whole radiation thing is turning me into a complete b@#&!.  Yesterday, I left work early (as always, which is a pain in the butt when you're the principal) only to arrive at the RO's office and be told that one of  the machines was broken.  OK.  I asked how long it might be and I was told that there was no way to know.  There are two machines where I go for treatment and I just assumed that they would rotate us all into the working machine.  Well . . . after waiting for almost 90 minutes I was then told that I should go home because I can only be treated on Machine #2 (the broken one).  I later come to find out that the machine had been broken since 2PM, at least an hour before my appointment time.  Could they not have called me and told me to not to come in?  I mean I've filled out piles of paperwork with my home number, work number, cell number - it's not like they don't know how to get a hold of me!  I find this frustrating.  I'm trying to go about living my life and it seems as if my time is of no concern to anyone at this office.  So now one more stinking day gets tacked on to the end, putting my final day of tx on Friday July 8th.  I swear if I have to go another week into July I'm going to scream at someone!!! #6/33 today with no ill effects so far Tammy",
      "MessageIndex": 578,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 7, 2011 09:31PM sundermom wrote: I am definitely the youngest person everyday in the waiting room. I'm 37. About half of the patients are in wheelchairs. As much as I dislike going to tx each day it is a nice reminder to be thankful for how good I feel. I got #10 of 33 today. The RO said that my skin shows no effects from the tx, which is funny because I can definitely feel it. I spread on the Aquaphor last night because the skin felt so irritated. Praying I make it 23 more days .... Congratulations to those hitting milestones this week - 100%, 50%, 33% - whatever it takes to stay focused on the goal!!! Tammy",
      "MessageIndex": 678,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 9, 2011 08:45PM sundermom wrote: Holy cow I feel like a radiation overachiever! My tx consists of 5 different machine positions, but I'm getting the whole breast, supra clavicle and axilla treated. I think I get zapped about 12 times with the longest being about 20 seconds. I had #12 today and it feels like I have razor burn, but no redness, peeling or swelling. I've been putting the aloe in the refrigerator and then putting it on. Oh my ...it feels so good :) I was very happy to read the information about the new Canadian study for those of us in the \"gray\" area for rads. My MO said MD Anderson has also recently published a paper regarding rads after BMX with patients having 1-3 positive nodes. Same conclusion ....lots fewer recurrences! Tammy",
      "MessageIndex": 739,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 23, 2011 10:00PM sundermom wrote: Completed #22 /28 regs today. Woo-wee my skin knows something is up now! My entire armpit is a lovely shade of fresh sunburn and feels like I've been using sand paper instead of aloe. 6 more regular treatments and then on to the 8 boosts which I'm told will target a completely different area. I'd love an extra day this weekend to recover. I'm a tad fearful of what tomorrow might bring at this point :) I'm also noticing that my back directly behind the treatment area is peeling. Anyone else experiencing this? Tammy",
      "MessageIndex": 967,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 12, 2011 04:48PM sundermom wrote: I think I may be our last member to finish. I'll be done on Thursday. I got boost #6 today. These are easy compared to the first 28 tx IMO. My implant on the radiated side is now considerably higher where the tissue has contracted. I have to make an appointment with the PS :( Tammy",
      "MessageIndex": 1111,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Oct 26, 2011 01:49PM sundermom wrote: I had exactly the same thing.  I had prescription eye drops.  I believe they were a steroid and they knocked it out the problem within the first two doses.  Chemo can make your eyes very dry which then causes them to produce tears constantly.  It's a vicious cycle!!!",
      "MessageIndex": 7,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777082",
      "Title": "Super teary eyes vtellen grayfran"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 15, 2011 05:36PM sundermom wrote: I went Friday for the planning CT scan and got all marked up with Sharpie.  They put these little round stickers on top of the marks and told me to be careful and that they would see me in one week for the simulation.  Well . . . here we are less than 48 hours later and 3 of the stickers (and the marks) are gone.  I didn't even take a real shower!  Two fell off while I was cleaning the house.  I was working hard, sweating and having a hot flash :)  Then, another one came off last night while I was sleeping.  I guess I'm going to have to call the RO tomorrow and see if I need to go back in and get re-marked before Friday's sim.  Anyone else had this happen??? Tammy",
      "MessageIndex": 197,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 17, 2011 07:19PM sundermom wrote: TonLee - I agree with you.  I am finding rads to be the most annoying part of this whole process and I haven't even started yet.  LOL  I'm also terrified that the tx will jack up the beautiful work my PS did on the reconstruction.  Julie H - If I understand the process correctly the radiation travels in beams.  It will enter your body at one point and exit it another.  At least, I think that's the way the RO explained it to me. ProudMom - I had my first follow-up appt. with the PS today and he didn't mention massaging the implants.  He told me to continue to wear the push-down harness for the next week, but then to ditch it once rads start because it would irritate the skin too much.  I go back to see him in 4 weeks to see how the recon is holding up. Tammy",
      "MessageIndex": 251,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 20, 2011 04:45PM sundermom wrote: I survived the simulation and I got one tattoo today on the most important marker.  It wasn't near as big of a deal as I thought it was going to be.  I told them I wanted to see exactly what it looked like before agreeing to get 5 more!!!!  Did any of you have that many?  It seemed a bit excessive to me, but I'm getting pretty much everything radiated so who knows.  Monday at 3:15PM is treatment #1 of 33.  Start the countdown . . . Tammy",
      "MessageIndex": 327,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "May 20, 2011 09:45PM sundermom wrote: OK so I lifted to sticker to peek at the tattoo.  I HATE it.  It's quite a bit bigger than the pinpoint it was described.  Why is this pissing me off so much???  I have giant scars and silcone implants where I used to have breasts.  I have no hair, no eyebrows and no eyelashes.  However, these marks on my body are just about to put me over the edge!!! I've sailed through two surgeries and dose dense chemotherapy, including the red devil in the last 6 months.  Why am I finding the whole radiation thing so difficult?  Maybe I'm just getting worn down.  IDK, but I need to kick the Xanax back up a few notches because today I've fluctuated between wanting to snap another human in two to fighting back tears.   TonLee- I am getting rads at Kettering Medical Center.  My doctor is Dr. Keiller.  Tammy",
      "MessageIndex": 336,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 22, 2011 05:28PM sundermom wrote: My PS told me to massage my implants at my exchange follow-up appt.  He said it would break down the scar tissue and help things to \"drop and fluff\".  Tammy ",
      "MessageIndex": 946,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jun 27, 2011 08:28PM sundermom wrote: I have taken an Ativan and an Ambien every night since my BMX in December. I would really love to get off these medications; however, every time I try to skip them I end up laying in bed wide awake. Anybody had any luck or a similar experience??? Tammy",
      "MessageIndex": 1004,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 1, 2011 10:56AM sundermom wrote: Heading off for #28 this afternoon - the last of the regular tx. I spent 4 hours at the pool yesterday and I'm definitely feeling the effects of the sun on that area. Ouch! It's my own fault, but I refuse to be shade bound in the summer. LOL TonLee - Congratulations on finishing treatment. It seems as if we've been at this forever!!! All other May Gals - Enjoy the long weekend. We're getting there ... I am interested to know how long it takes before the rads tan starts to fade. I burned through to my back and it looks really ridiculous. Tammy",
      "MessageIndex": 1060,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    },
    {
      "AuthorID": "sundermom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/112657/profile",
      "Content": "Jul 13, 2011 08:28PM sundermom wrote: I, too, am sorry about your diagnosis but you have found a truly great place here.  The women on these boards have an abundance of knowledge and experience.  For me the waiting after the initial diagnosis was the hardest part.  Once treatment gets started you can focus your energy on that, but in the beginning I found my mind running wild, especially at night.  Don't be afraid to ask for a little something (i.e. Ambien or Ativan) to help you get some real rest.  Tammy",
      "MessageIndex": 14,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}