{
  "AuthorID": "Sunflower",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
  "Posts": [
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 22, 2007 04:45AM Sunflower wrote: Happy Sunday girls - Kristina, sounds like it will be a beautiful drive.  Enjoy; It will probably also boost your spirits!  Evy, good luck to you - it's nice that you have such a supportive, loving family.  I hope the hair issue gets better. Now, I'm in a quandary.  My DH woke up this morning with ringworm of all things!  We puppy sat a new dog last weekend; not sure if that was the source or if it's from our cat.  I guess a vet visit is on the agenda now for next week. Anyway, my question is - I start tx next Thursday.  Any ideas if I should be worried about this ringworm thing? Love and *hugs* to all! Angie",
      "MessageIndex": 204,
      "PostDate": "22/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 25, 2007 09:41PM Sunflower wrote: My first treatment this morning went really well.  I absolutely fell in love with the sweet and friendly chemo nurse.  She was just so relaxing and confidant plus she gave me lots of tips and pointers (all of which I've already picked up here!)  I am mixing my ativan and comp meds around, taking 1 every 3 hours....but I don't know.  I don't feel nauseous and the ativan makes me *loopey*  I might need to find a different approach tomorrow - I don't want to just stay drugged out!!!  I also worry that I am over hydrating myself LOL.  Do you think that's even possible?  I seem to be using the restroom every 10 - 15 minutes!  My water bill will be atrocious <gg> Karyll - what an enlightening post, thank you!  The gummy eyes is good information but I really liked your closing line \"... woman who had a disease. The disease you see.. does not have ME!!!!!!\"  Kudos to you! Eva - You can't leave us hanging, what's your news?  How is the baby, how are your se's going?  If you're comfortable please share with us; I'm worried about you.  We've been thinking and praying for you. Ebbie - Sorry I missed your first post - we must have both been adding lastnight at the same time.  Good luck to you.  22 years ago they didn't have the her2/neu testing nor the herceptin.  I'm sorry you've had a recurrence but with newly found drugs you are getting the best care.  Hang in there!  When is your port placement and first tx scheduled? Penny - sorry about the neulasta effects.  :-(  I still don't know if I'm sad or glad that I will not be getting that shot!!!  Glad you found this board too, hopefully tomorrow you will be feeling less achy. Oh and Karyll, I giggled over your co-worker comment.  Prior to my diagnosis and treatment I wouldn't have discussed breasts, bras or the like with my male or female co-workers.  But now, wow it's just \"whatever\".  Whatever they want to know I'll tell them - and hehehe who knows, maybe I've told them stuff they didn't wanna know! Lisa - sorry you've been delayed again.  Weren't you having issues with your drains earlier that caused a delay too?  Is that what has caused this latest delay or is it related to the fires?  I hope you're located well inside the evacuation areas; my heart goes out to all the families affected so far. Kristina - please post soon. Love and Hugs to all you wonderful October Gals! Angie",
      "MessageIndex": 256,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 27, 2007 12:00AM Sunflower wrote: Karen R, oh my goodness, your lung.  I am so sorry :(:(  My surgeon discussed this likelyhood with me before my port placement and in fact I had an x-ray while I was still in the recovery room just to ensure she had not accidentally knicked it while looking for my vein.  Isn't it amazing/sad that medical care is different all over the country?  (And you're NOT that far from me!) I can't believe how well I've done since tx #1 on Thursday *knocks on wood* I'm tired but drinking, drinking, drinking and taking my Ativan and Compazinne around the clock.  I guess it really helps although I feel more like a zombie. Has anyone heard anything from Kristina?  (On other boards or via PM's?)  I'm worried about her and Lisa too.  :(  Too much real life stuff getting in the way of our updates! I hope all is well with everyone.  Karen keep us posted on your lung. Take care ladies, <hugs> Angie",
      "MessageIndex": 265,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 29, 2007 01:36AM Sunflower wrote: Kristina, It is so good to hear from you!  Has your fluid issue resolved itself or do you still need to keep an eye on it?  But you were able to stick with your 2nd tx - thank goodness.  What is your tx cocktail?  I'm just glad to hear that you're able to post again - and I will be praying that you will be able to eat better soon.  (I love pizza and LOL ate it last night feeling guilty as heck; but it's the first other than soup I've had since my first tx.) Is there a possibility you can take a few more days off work? Get lots of healing, rejuvenating rest.  Take care of yourself and know that we are all thinking of you!  You've been through a lot but you still keep such a great attitude (even when you call yourself Debbie Downer there's still a bit of humor there).  I admire that!  Hang in there, <hugs> Angie",
      "MessageIndex": 282,
      "PostDate": "29/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Nov 1, 2007 09:13AM Sunflower wrote: Oops Karyll - we must have been posting at the same time.  Of course, long winded me I have to comment on your tale :) As always, your stories make me giggle especially about all the poking.  LOL  But on the back pain - I wonder.  When I had my port put in they put me on really light anesthetic, which allowed me to be awake when they were getting me situated on the OP table.  They put this huge round THING under my back I think they said it was a grounding pad, but it felt more like a rock!  I think the boulder under the back helps to force the chest parts upwards if you know what I mean?  I'm sure they used something similar during my mastectomy.  Anyway, on my port - they let me wake up while I was still on the table (this was all preplanned by my surgeon and wonderful anesthesiologist so I could get home sooner) and the first thing I felt was that darned ball in my back.  I bet your ER doctor was onto something.  Sorry that you had so much difficulty but thank goodness it wasn't anything so severe.  And phooey on them - man, when you learn you have cancer I think every event IS  a cancer event!  We're entitled! Thanks for sharing your story! Angie",
      "MessageIndex": 352,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 25, 2007 03:51AM Sunflower wrote: Morning ladies, I'm off for my port placement today.  My surgery time got bumped back to 3:00 pm.   but at least it wasn't cancelled completely.  I'm really ready to get this train moving - first tx is tomorrow at 9:15.  Thank goodness it's a morning appt!  Alishar sorry for all your difficulties with your schedule but thank goodness you stuck to your guns and pushed them to give you the tx!  Good for you! Good luck to everyone I will check back later tonight and try to get caught up on all the posts. Love and Hugs, Angie",
      "MessageIndex": 235,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 25, 2007 12:58PM Sunflower wrote: Kristina - any news on whether you can have treatment tomorrow?  I will be thinking of you!  Good luck, it certainly seems that you've had more than your share of issues.  Praying that the rest of your tx's go well.  Let us know what happens tomorrow. Verjim - nice to meet someone who's also a late Oct starter.  My first tx will be tomorrow morning.  I'm apprehensive but also, strangely enough, I'm looking forward to it.  After all the weeks of dreading it I'm just really ready to get things going. I had my hair cut really, really short yesterday.  When I came home my dog didn't even recognize me.  LOL I thought he was going to tear my leg off until he heard my voice! My port placement went really well.  This was my 2nd surgery and both times I have been so blessed to have *amazing* doctors/nurses around me. Love and Hugs to you all.  Take care, Angie",
      "MessageIndex": 245,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 31, 2007 06:19AM Sunflower wrote: Lisa, it was good to hear from you.  I was wondering how your fluid was coming along - so glad that your date has finally been set and doesn't appear to be moving!  Good luck on Thursday. Angie",
      "MessageIndex": 320,
      "PostDate": "31/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 21, 2007 01:21AM Sunflower wrote: Hello October Gals! Oh my goodness, never again will I take 3 days off from this board.  LOL trying to catch up is a challenge but I do believe I'm starting to get the names/dx/tx straight and feel as if I know several of you already!  Since I'm prone to overly long posts I will refrain from giving individual greetings except for two - Kristina, your pox...I'm so sorry.  But your mittens comment cracked me up.  You have such a bright attitude!  Hang in there.  Ulla, as others have said, you are definitely in our thoughts and prayers.  I find myself thinking of you often actually.  God bless you. I am getting my hair cut short on Tuesday, port placement on Wednesday and have TX #1 on Thursday.  I also decided to take a week off from work; I will have from Wednesday thru Nov. 1st to Rest, Recoup, Regroup and Reflect!  My four R's of solace I guess!  I also started a blog - it's such a great way to keep friends and family up to date and it has become remarkable therapy for me. Alright ladies, another week of treatments are over - and the weekend is upon us - time to rest and gear up for next week.  I hope all of you have symptom free (or as close to \"free\" as can be), restful days and enjoy lots of quality time with your families and friends. Love, hugs and support to you all! Angie",
      "MessageIndex": 197,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 30, 2007 12:46PM Sunflower wrote: Oops, ended my earlier post before I was ready!  I'm 4 days from tx #1 (you all are so far ahead of me) but I certainly appreciate hearing how you all are doing.  Each of you are like my road map of days to come - and so many of you are SO funny!  I admire the strong spirits. My daughter is a senior in high school this year and is very active on the dance team.  Dance team takes a lot of parental involvement.  So far this year, I have done nothing.  :(  Tonight I will be attending one of the meetings for the first time this year and I am SO nervous!!  Even though they know what's been going on I still feel guilty.  Anyway, being post tx by 4 days I've been worried that my tummy wouldn't behave tonight.  So, what do I do???  For whatever reason, tonight of all nights, I decided to have a HUGE appetite.  Maybe it's the nerves.  LOL Karen R, I totally get the \"piggy\" comment. I ate so much I'm sure I will explode while the coaches are talking.  This is my first debut in my short, short hair too.  Maybe I should take an ativan for strength.  (teasing). Take care ladies, I'll check in tomorrow and let you know if my body decided to play fair with me.  Sleep well and have a great day tomorrow! Angie - the long winded one!  :)",
      "MessageIndex": 306,
      "PostDate": "30/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 31, 2007 06:18AM Sunflower wrote: Cheryl, Congrats on your port!  You must be a tough cookie - mine hurt like crazy!  In fact today, nearly a week after it was inserted it is still troublesome - mostly it just itches like crazy!!!  Your Tylenol comment is hilarious; I agree - if your Dr had a port inserted would just Tylenol suffice? I'm with the other gals, please be careful around your granddaughter.  Glad to hear she is doing so well though. Good luck on Thursday; we'll be thinking of you! Angie",
      "MessageIndex": 319,
      "PostDate": "31/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Nov 1, 2007 05:29AM Sunflower wrote: Okay, well I'm just all goofed up - Lisa and Cheryl good luck *tomorrow*!  LOL at least you know you'll be well thought of - - on multiple days even. Is this where I pull the \"chemo brain\" card?  <gg> Actually, ladies, what do you all think?  Is chemo brain real or.... Did anyone have tx today?  Seems I remember someone saying, \"just what I want to do on Halloween...\"  Maybe it was a chemo-dream.  (I've had really strange dreams post tx!) Take care all, Angie",
      "MessageIndex": 340,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 13, 2007 12:10PM - edited Oct 13, 2007 12:10PM by Sunflower Good morning ladies, It seems I'm joining this post a little late but I saw my onc yesterday and learned I will begin treatments on Oct. 25th with or without my port.  I'll call my surgeon Monday morning to see when I can get that scheduled.  But, I can't believe it, as of this moment, aside from weekly physical therapy I have NO doctor appointments next week!!  What will I do with all the down time?  I think this is my first doctor free week since mid August!  Yippee!  I was dx on 8/10, had a right mast on 8/29.  Now I'm working on gearing up for my treatments - 4 AC, followed by 4 Taxol, followed by 12 Herceptin.  I can not believe all of the good tips, advice and peace of mind I've received from this site. Thank you to everyone for sharing! I haven't heard anyone else talk much about physical therapy following surgery - have any of you done it? I'm looking forward to getting to know each of you October girls!  Have a wonderful weekend, Angie",
      "MessageIndex": 107,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 14, 2007 09:11PM Sunflower wrote: Lisa, welcome to the group.  I think you're right about the popsicles - I've heard those and ice chips during infusion are supposed to help with the mouth sores.  But, who am I to talk?  I haven't been there yet!  My start date is 10/25 - I'm sure one of the other gals will pop in with a better response to you. Ulla, I am so very sorry to hear about your baby.  This disease is so awful and stories such as yours just really bring to point how horrible this all really is.  My heart goes out to you and your family.  That being said, I'm so glad that you have joined this thread - we will keep you in our thoughts and prayers and will accompany you on your journey through these trying days.  Angie",
      "MessageIndex": 116,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 6, 2007 01:08PM - edited Oct 6, 2007 01:08PM by Sunflower Oh my goodness, thank you all for the wonderful, warm and positive responses.  Today I'm feeling so much better; and am realizing (from reading other posts) that this is just the start of an ongoing battle with good day/bad day scenarios.  I KNOW I will have more good days than bad days!  Thanks for the reminder of the Her2 information that is contained on this site - I have read so much information in the past month it's easy to overlook or forget where to go!  In retrospect, I *am* very fortunate to have the Her2 & ER/PR positive results as that does allow me to have a more targeted treatment approach. Terry, thank you for the oncotype suggestion - I hadn't considered that and will definitely discuss it with my doctor next week. Thank you all so much for allowing me to whine and for helping me to feel better!!  This little rollercoaster ride looks so much less daunting now - I'm off to find the chocolate - YUMM.  Bless all of you!",
      "MessageIndex": 9,
      "PostDate": "06/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/693343",
      "Title": "I feel like I'm being a Wimp :( Sunflower Harley44"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Sunflower wrote: Hello, I'm 42, Dx 8/10/2007, IDC, Stage I, Grade 3, 0/2 nodes, ER+/PR+, HER2+.  I sailed through the biopsy, my diagnosis and my surgery.  But now, having met my onc for the first time and hearing my recommended treatment plan, I am terrified!!  (Really, it was the Her2+ diagnosis that put me over the edge.  I still am not sure what Her2 really means!) I believe the BC diagnosis was perhaps easy for me to deal with because my mother is a 25+ year BC survivor!  (She's *awesome*)  Therefore, I knew what to expect in terms of the diagnostic procedures and the mastectomy.  But, since Mom didn't go through chemo treatments I do not have anything to guide me.  I suppose it's the fear of the unknown that worries me.  ???? I read the posts here and it seems that my dx is so much less significant than others - and I'm just really feeling down on myself for not being stronger.  Isn't it the \"C\" word that is supposed to put us into terrified fits???  Yet for me, with a beautiful prognosis, the mere idea of chemo is TERRIFYING.  I feel like a wimp. Any suggestions on how, or what I can do to \"buck up\" and take this one day at a time?  I don't know what the Her2 really means, nor can I seem to find a concise answer elsewhere - plus I don't know what 6 months chemo & 12 months herceptin will be like!  And if I admit it, a BIG part of me wonders, \"do I really need to subject my body to this?\" For the first time since this rollercoaster ride began in August, I feel weak and indecisive.  My hope is that I am not alone - that some of you strong major surviors can set me straight???   Thank you in advance Dx 8/10/2007, IDC, 1cm, Stage I, Grade 3, 0/2 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/693343",
      "Title": "I feel like I'm being a Wimp :( Sunflower Harley44"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 23, 2007 03:10PM Sunflower wrote: Kristina - oh my goodness, you *crack* me up between the pox stories (how are they coming by the way??) and the blonde wig...oh my goodness; you have such a great outlook.  Thanks for the giggles time and again! Karen R - I sure hope that you're feeling better soon! Debbie - I took 6 weeks off of work for my mastectomy - I was SO dreading going back to work - I couldn't find a comfortable bra and I had a \"loaner\" proth!  I felt like everyone was going to be staring at my chest, \"Which one is real and which one is \"memorex\" - but it really was inspiring to be back in the grind again.  I learned a lot about my co-workers (I didn't know I had so many compassionate friends) and the only person who stared at my bust line was a gal in her late-60's  LOL The one I least expected it from; dunno what she was looking at!  But your days will get better!  Just go in tomorrow with your head held high and make them marvel at your strength!  You are a survivor!  Sending you big <<hugs>>!  Hang in there - and I hope once you get to work you feel better. Alishar, thanks for the comment - I will speak to my onc.  But for now, I've told DH that he's not banned from the house....just yet!  LOL  We have a whole game plan to put in play in case anyone gets sick while I'm in treatment but Yikes!  I'm not prepared to play that card yet!!  (btw, he is *horrified* that I even posted \"ringworm\" here!!  But really, what are the odds that we would have to deal with this now?????) Hoping that tomorrow will always look better for us ALL! Love and hugs to all of the Oct Gals! Angie",
      "MessageIndex": 219,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 27, 2007 12:06AM Sunflower wrote: Cheryl - sorry I kept forgetting to mention - CONGRATS on your great margins.  What a relief that surgery is all in the past.  You're a herceptin girl just like me then; we will still be moaning about our injections long after some of the others have moved on to the pills. hehe!  One thing about it though, it sure seems that the chemo group gals stay together long after the chemo ends so I'm sure we will still have plenty of company. Hope everyone gets a good nights sleep! Angie ",
      "MessageIndex": 266,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 29, 2007 01:42AM Sunflower wrote: Evy, Thanks for the update.  We will be praying for you and your baby.  Your medical team sounds wonderful; that's such a relief.  If possible please see if your DH can give us an update on how you and baby are doing.  But do know that you will be in all of our thoughts and prayers!  We will be waiting to hear happy news from you. Love and Hugs, Angie",
      "MessageIndex": 283,
      "PostDate": "29/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 13, 2007 03:21PM Sunflower wrote: Hi Debbie - welcome!  I'm glad you found this board too - I've already received so much benefit from hearing how everyone's doing.  I think both you and Karyll were really smart to take the week following treatment off - I may consider doing the same.  I suppose it depends on when I get my port placed as I know I will need time off following that.  (And Karen R, yes I am definitely getting a port but depending on my surgeon's schedule I may just risk taking the first AC w/o it.  I too just really want to get this show on the road!) Also, I've decided to keep an \"Oct Girls\" calendar and it looks like many of you have a very busy week coming up!  I'll be thinking of each of you as your different procedures come around. Regarding physical therapy - it's a Specialty Rehab - Women's Health thing that I am so grateful my surgeon referred me to (and my ins. approved!)  Following my mast I really was afraid to move much thinking that anything that hurt was bad.  I also started having really bad shoulder/neck pains that kept me up at night.  As it turns out - it was all due to poor posture.  Since I could not wear a bra of any sort I unconsciously began pulling my mast side shoulder forward to hide the bralessness and I suppose the flatness.  Once my PT pointed that out to me I've struggled to keep my shoulders aligned and was amazed how much better my sleep habits became.  At my first appt I had 40% one direction and 20% another less arm movement in my surgery side than my left side.  After one week of exercises I'm back to 100% in all directions (yea!).  She also does some scar management massages which should help in the long run. I really liked the blog tip that Jenny popped in to offer up - I think I will do that.  Writing is therapy and it can become so taxing updating everyone on the phone. I'm off to go shopping w/ my 18 year old daughter.  We're in search of scarves, head gear and a cute chemo bag!  Sorry for the long post girls I get too chatty at times J - take care and feel great this weekend! Angie",
      "MessageIndex": 110,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 14, 2007 09:20PM Sunflower wrote: Hello ladies, Just wanted to pop in and wish Karen R good luck tomorrow with the port.  I'll be anxious to hear how this goes as I will soon be following suit.  I'll be thinking of you and will look forward to hearing from you as soon as you feel up to it. Karen (ktbt) you have your first round of chemo tomorrow don't you?  Is your chemo bag all packed and ready to go?  I pray that you get good relaxing rest tonight.  Take care of yourself and know we'll be thinking of you as well.  Don't forget to eat a good meal beforehand, right?  My daughter and I went shopping yesterday - what a wonderful outing it was!  I was very disappointed that we couldn't find any scarves that would work as head wraps but I did find 3 knit hats and a BUNCH of bandanas.  They have them in every color imaginable.  My best find though is a cute, cute, cute light pink and gray bag that I will use for my chemo pack.  I also found a scrumptiously soft and cuddly blanket to tuck into it.  It was a really enjoyable day and so fun to spend time with my gorgeous gal. Karyll, thanks for sharing your new photo with us!  You look smashing in your pink cap.  Good for you. Be well all, Angie",
      "MessageIndex": 117,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 17, 2007 05:24PM Sunflower wrote: Urbie  - thank goodness that the Emend favors are shinning on you!!  I am so glad that you've been approved, but really, I just do not understand why those drug companies have to charge so much :-(  TxKaren & KarenR I'm concerned that we haven't heard from either of you today....I hope that you're both doing well.  Karen R good luck with your chemo - and TexasKaren I hope that you found the path to good sleep :(  Karyll - I'm sorry.  I know it's common to have good days and bad days; certainly   I  had a mixed message day myself...but do hang in there.  You've seemed to do so well thus far, and heck girl, you look great in your cap!  I hope that the blood test is good and that you are able to get on with your treatment....#2!  You are moving forward!!!  God bless you! Kelolo I hope you are doing well tonight. To ALL of the October gals, good luck and *hugs* to all! Angie",
      "MessageIndex": 143,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 25, 2007 01:01PM Sunflower wrote: Oh, and I forgot to mention - my DH went to the doctor today.  Turns out he doesn't have ringworm (thank goodness!) It's \"nonspecific dermatitis\" and best of all, it's not contagious!  Hallelujah. Rest well October gals, Angie",
      "MessageIndex": 246,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 30, 2007 12:38PM Sunflower wrote: Oh my goodness, what a hilarious group you all are.  I loved the multiple wig stories!  For myself I plan on totally being bald at home and going w/ scarves when out in public.  I just have a feeling I will hate the feel of a wig on my head!  Ulla I am sorry things are going so rough for you - hang in there.  Maybe you can try calling your onc again if things don't clear up? Karen R - no news is good news I guess.  I'm glad that you are no longer having chest pains though! Hang in there ladies - another week has begun.  You all have such great attitudes; I appreciate your openness and honesty in sharing - gives me a better idea of what to expect!  Love and Hugs! Angie",
      "MessageIndex": 305,
      "PostDate": "30/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 31, 2007 06:25AM - edited Oct 31, 2007 06:26AM by Sunflower Hello ladies, The event with the danceteam went very well!  A few people thought I was a \"new mom\" with my short hair do but all in all, it was great.  And thank goodness, my overfull tummy behaved too! My daughter and I had a nice bonding moment following her practice.  We went to the grocery and came home and chatted.  We talked about my decision to wear scarves when the time comes and I even tried one on for her.  She looked at me and said, \"Oh Mom, I can't wait for you to start wearing your scarves.  They look great.  I am so lucky to have such a pretty mom.\"  What a sweet bit of encouragement from an 18 year old!  I'm proud of how well she's handling all this and love her to pieces for giving me strength when I need it. Today, I feel like someone stole all the stuffing out of me.  I'm just exhausted!  I've had a mild headache on and off since tx last Thursday - it goes away w/ tylenol but worries me that it keeps coming back.  Have any of you experienced the same? Take care wonderful October Ladies! Love and hugs, Angie",
      "MessageIndex": 321,
      "PostDate": "31/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Nov 1, 2007 03:06AM Sunflower wrote: LOL TxKaren re: the grey hair! I don't think I can take the handfuls of hair falling out so I'm planning a \"bald is beautiful\" party for Sunday which will be 10 days post tx for me.  It's turning into quite the production and I'm really looking forward to it. I'm hoping I don't shed a single hair between now and then!  As many have said it's all about the control - I plan to control my hair loss. Kristina, re: eyelashes  - when I went for my tx I met the most amazing woman - she was on a similar tx plan as I am (4 a/c then 4 taxol) but she was on her LAST one.  (congrats to her!) anyway, the point is, she looked LOVELY and still had eyelashes and eyebrows.  She said they were quite thin but I was just *thrilled* to see that she had any at all.  And truly, she looked beautiful for being 6 months into chemo.  Let's hope that all of us will still have a few lashes when this whirlwind passes us. Lori, welcome to the Oct group!  I'll be thinking of you on Friday.  Good luck. Penny, I was dx on 8/10, R mast on 8/29, port inserted 10/24 and 1st chemo on 10/25.  To me, there seemed to be a huge delay between the surgery and the start of chemo - but all those tests and appointments.  Yikes, it was like everyone wanted to touch, prod and poke me! Happy Halloween everyone -if you're going to be passing out treats this evening to the little goblins please keep some hand sanitizer close at hand just in case one of those hobgoblins has a touch of a cold.  I worry about all of us! Lisa, I hope your tx went well today. Love and hugs! Angie",
      "MessageIndex": 336,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Nov 1, 2007 09:05AM Sunflower wrote: Penny - your story gave me goosebumps - one, because you're so young and two because of your chemo start date!  Getting chemo really is a new lease on life; what a better day to start than on your birthday!!!  Karen R - sorry about the scalp pain.  :(  When are you planning to get a wig?  Re: tests, yes I also had a boatload of them.  I had a breast MRI, bone density, bone scan and chest x-ray.  All of these were ordered by my breast surgeon and performed before my surgery.  Hate to be the barer of additional news you may not have thought of, but, bc can also spread via the bloodstream.  For me, I'm doing the chemo to fight a future recurrence and to kill any rogue cells that may have crept out in my bloodstream.  Maybe you could ask your surgeon or GP??  Good luck. Darn Cheryl - here I was hoping you were going to be my chemo twin.  But I'm glad they changed your cocktail to be better tailored for you.  What is the TCH exactly?  I assume the H is herceptin?  And yes, that was nice of them to leave the needle in your port!  Did you get the emla cream?  And if so, did it work for today's poke? Ulla, ginger ale is a type of soda - I don't think you can make it?  :(  Neulasta is a shot that helps boost your white cell count following tx.  Re: the port - mine itches like crazy and is still a bit tender.  My biggest complaint though is HOW MUCH IT ITCHES - yikes!  I'll let the other ladies ring in on reconstruction advice. Lori, Adriamycin and Herceptin both can have negative affects on the heart.  Since I will be taking both of them (like Cheryl I will do 12 months of Herceptin) I will have a number of Muga scans.  Not sure when my 2nd will be, I assume it will be before my Herceptin cycles start.  I think my onc said I would be tested every 3 months or so. Enjoy your evenings gals! Love and Hugs, Angie",
      "MessageIndex": 351,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Nov 2, 2007 12:22AM Sunflower wrote: Hi ladies, I returned to work today - oh my goodness.  I really didn't know what exhaustion was all about until today.  And my taste buds have gone whacko!  We had take out Chinese food tonight for dinner and I actually wanted to add salt to it!  LOL restaurant Chinese food is already way too high in sodium as it is!  DH said I must just be having a salt craving or something? I need help!  What the heck do you do for dry nostrils?  I keep getting nosebleeds and it's driving me nuts.  LOL dry nose and salt cravings - yikes.  Gotta love chemo! Hopefully I can get caught up with all the posts tomorrow!  In the meantime I hope everyone is doing well - Cheryl, I did read your post - it sounds like first tx went well!  Yea! Hope everyone else is doing well!  Take care, Hugs, Angie",
      "MessageIndex": 374,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 16, 2007 12:27PM Sunflower wrote: Hello October Ladies - Karen R - I need more details on your port please :-) You can PM me if you wish - I haven't had a confirmation yet but I will be scheduled for port placement on 10/24 or 11/7 (day before my 1st tx or one week before my 2nd tx).  Are you very sore tonight?  I'm glad that things went well - and chin up - you will do great with chemo on Wednesday.  You seem to be such a strong, positive person.  BTW, your hair is just lovely!  Thanks for sharing your photo with us. Lisa, good for you for having a mini-family holiday - that sounds SO wonderful!  What a terrific reprieve for all of you - kudos girl!  :-)  I will be praying that you have good news on Friday.  If you stick to your 10/25 schedule we will definitely be chemo sisters as that is my scheduled date as well.  And, you have already had more than your fair share of reschedules already.  I will pray that you heal/dry up and Friday's \"date\" with your surgeon will be a non-event.  Hang in there. Kelolo - You have tx #2 tomorrow don't you?  Rest well and know that you are in our thoughts.  Ulla - it's a different situation but my mother had BC at age 42 and delivered a healthy beautiful (now 21 y/o boy) when she was 44.  Back then they did not routinely offer chemo and hormone therapy to all BC patients.  But, I do believe you will be able to have a child in due course.  Discuss this desire with your oncologist and physician.  I truly believe your day of motherhood will come, but for now you need to concentrate on healing yourself.  Hang in there - my thoughts are with you. On a completely different note - I have found the best website for scarf tying tips.  Not sure how many of you are going to pursue the scarf avenue but here it is if you're interested.  http://craftersjourney.com/how-to-tie-a-head-scarf/ I ordered so many scarves last night - LOL I may need to sell my car to pay for all these gadgets I'm getting - let's just hope I actually WEAR them.  <gg> Following the advice from this website, I decided I just couldn't hack a week-w/no-doctor appts and have scheduled all of my routine checkups this week - teeth tomorrow and \"the non-bc part of my anatomy\" on Thursday.  Honestly, I should just take a leave of absence from work - I seem to be out more than I am in.  :-(  One of my co-workers asked today, \"So, are you just working part time?\"  LOL I can see how he would think that as I seem to leave the office at 2 pm daily headed to some odd appt or test! Urbie - good luck with the emend - what all is involved in that battle?  I just don't understand why some of the really great medication is so prohibitive in price.  :-(  Were you able to take emend w/ your first tx?  Let us know how your battle goes. You girls are wonderful - take care and be well!. *hugs* Angie",
      "MessageIndex": 137,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/692197",
      "Title": "October 2007 Chemo Girls 3boys4me saucybee"
    },
    {
      "AuthorID": "Sunflower",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57218/profile",
      "Content": "Oct 17, 2007 03:22AM Sunflower wrote: Of course there's the bc.org referral site of:  www.headcovers.com But (IMO) they do not have many scarves but do have a GREAT selection of hats/caps/turbans.  I ordered my \"fake\" bangs and sleeping cap from them.  Their prices are a bit steep but when trying to beautify ourselves, what is cost?  LOL The best scarf place (style/price) I've found thus far is www.tznius.com  The only problem there is that their inventory seems to be LOW.  You can click on a desired item and get a \"Sorry all sold out\" or a mere single color choice that's in stock.  However, the benefit - their scarves are HUGE and I think they only charge $1.90 flat rate shipping.  After meticulously poking away, I did find a handful of things to order from tznius.  I'm hoping to receive my order this week.  And between the Headcovers vs. tznius I am most looking forward to the later. Good luck to you!",
      "MessageIndex": 2,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/693910",
      "Title": "Wigs and scarves Bonnielv TerryNY"
    }
  ]
}