{
  "AuthorID": "Sunkat1080",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
  "Posts": [
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Sunkat1080 wrote: Like many others, I am scheduled for an excisional biopsy on monday for ADH and Radial Scar diagnosis to rule out anything else that may be lurking.  I went for an MRI this past monday as the surgeon wanted one done due to dense breast tissue, and low and behold I get a call today that the MRI picked up a cyst and a hemangioma on my liver!  Just what I need to hear at this point.  Not expecting the MRI to even be looking at my liver.  Has this ever happened to anyone else where the breast MRI picks up something on the liver?  The doctors office told me not to worry, but now I am going in for an ultrasound tomorrow on my liver to further evaluate this fun new fact.  Needless to say, I was pretty calm about the procedure being done on monday, but this just ramps up the anxiety all over again. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 24, 2014 04:05PM - edited Oct 24, 2014 04:08PM by Sunkat1080 Thanks everyone for the responses!  The woman doing my ultrasound told me that they have to follow-up everything that shows up on an MRI because \"today's healthcare is driven by hospitals and doctors who don't want to be sued\".  I was just glad they told me the cysts weren't on my liver!   Somehow that seems scarier to me than having anything on one of my kidneys.  Anywho, the doctors office told me no follow up is needed for any of these things, so I am happy about that.  I'm sure I have a lot more \"incidental stuff\" hanging out inside my body too, but frankly, I just don't want to know about it right now!  Melissa - my freezer is still stocked with those blue freezer ice packs since they really helped after my steriotactic, I had no bruising and very little swelling.  I plan on coming home monday after the excisional and retreating to my bed with one of those and then having my husband wait on me for the next couple of days.",
      "MessageIndex": 11,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 23, 2014 03:26PM Sunkat1080 wrote: Thank you Melissa and Anne!  I feel somewhat better after having read your responses.  Unfortunately, I had already consulted Dr. Google, (I know, not a good idea), and the info there is not very reassuring.  I will post again after I get the results from the ultrasound of my liver and also after my breast biopsy on monday. Hopefully, both will end up being nothing to worry about and that will be the end of this.  ",
      "MessageIndex": 3,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 24, 2014 08:59AM Sunkat1080 wrote: Thanks Melissa.  You made me laugh out loud at the comical aspect of all of this.  I'm sure the excisional will be a piece of cake too.  Not too worried about that now because of all the encouraging things I have read on this site.  I just got back from the ultrasound of my liver. Surprise, surprise....no cyst found on liver, but two cysts found on kidney!  They did however confirm the hemangioma on my liver.  Said that was no big deal.  I was watching the monitor during the ultrasound and the two cysts she found look a lot like the cysts they have found over the years in my breasts...round dark circles with nothing in them.  So at this point, not too concerned about this new bit of information either.  Just want monday to come so I can be done with this!",
      "MessageIndex": 7,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 25, 2014 06:16AM Sunkat1080 wrote: They did give me a small heart shaped ice pad to use after the steriotactic.  I did use ice packs up until I went to bed that night, but off and on.  I think if you leave them on continuously, that's where you run into trouble.  Anyway, one more question...the only thing I am concerned about now is the needle localization! And only because I am a fainter and a wimp when it comes to pain.  I asked the phys.asst. if its done laying down or sitting up and she said they do it however best they can visualize the area, so I'm still not sure.  I do have that titanium clip in there, so I was wondering if that can be seen on ultrasound.  I don't want to be sitting up and then faint on them all the while being stuck in the mammo machine.  My steriotactic was done laying down on the table with boob holes.  No problem.  The other thing that I was wondering about....how in the heck are they even going to get to this area since its practically in my arm pit?  When I lay down on my back, you know how boobs fall to the side?  They are not that perky anymore, unfortunately!  I think they may have to roll me on my right side to even see the area!  Oh, well, I'll be out, so I guess I won't really care.",
      "MessageIndex": 17,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 23, 2014 05:27PM Sunkat1080 wrote: Melissa...of course! You are absolutely right.  Wish I knew why we all tend to focus on the bad stuff rather than the good.  Maybe because we are all trying to prepare for the worst while at the same time hoping for the best?  Anyway, I'm done consulting Dr. Google because I've come to the conclusion that my doctor knows more about my particular situation than he does.",
      "MessageIndex": 5,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825687",
      "Title": "MRI for pre-excisional biopsy on monday finds liver cyst! Sunkat1080 ye74"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 18, 2014 06:10AM Sunkat1080 wrote: Hi ye74!  I am so, so relieved for you and happy that everything went smoothly!  It sounds like it really was no big deal at all, the procedures I mean, not the fact that you and the rest of us have to go through all of this.  And thank you for the details of how it all went too, it  helps knowing that someone else had an easier time with this.  I hope your recovery continues along the same path and that you get a good pathology report too.  I have a feeling you will.  Keep us all posted as to how it turns out.  I will be thinking of you and hope to be able to post about my good experience as well!  Hugs from me to you!",
      "MessageIndex": 13,
      "PostDate": "18/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 16, 2014 02:24PM - edited Oct 16, 2014 02:25PM by Sunkat1080 ye74 - good luck tomorrow, Praying everything will be ok.  Please let me know how you do.   I called the doctor's office yesterday and they called today with a date for my surgery.  It will be done on the 27th.  Of course, this all depends on the MRI results too.  That is being done on monday.  ",
      "MessageIndex": 11,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Sunkat1080 wrote: Hello, I am new here and pretty scared.  I went for my annual mammo and got the dreaded call back. There were calcifications found in left breast.  Had the stereotactic biopsy 10 days ago, results came back ADH and radial sclerosing lesion.  BS says now I need to have an excisional biopsy in a couple of weeks.  I am first going to have an MRI next monday.  Unfortunately, my insurance company would not pay for the MRI until after I had the steriotactic biopsy.  Darn insurance company!  When I sat down with the BS the other day and she was explaining all of this to me, she drew a picture of the problem area out on a piece of paper so I could visualize it, and then at the bottom of the paper she wrote \"4-6% chance of upgrade to a pre-cancer.  Everything I have researched online says the upgrade rate is much higher than that regarding ADH, something like 10-20%.  I should also mention the fact that I have a sister 2 years older than me who is currently battling stage 3 ovarian cancer and is doing salvage chemo and a brother who had prostrate cancer at age 45 and is considered cured.   I have no other family history.  How does she know the 4-6% is accurate?  Is is because she said I only had a very small area of ADH?  Or is it because they removed most of the calcifications?  Any information anyone could share with me is greatly appreciated, thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 14, 2014 04:48PM Sunkat1080 wrote: MemereL, thanks for responding.  You are right, I do not want it, but I guess it is what it is.  Anything I know about cancer, I know about ovarian cancer because of my sisters situation.  Everything I know about breast cancer I learned in the last 2 weeks.  I am very anxious over the upcoming excisional biopsy because I have seen first hand what she went through and is still going through.  I have read a lot of posts here and gotten some really helpful information, and just want to say thanks to all the wonderful and brave woman who are so willing to share their journey with all of us.",
      "MessageIndex": 4,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 15, 2014 10:43AM Sunkat1080 wrote: Hi ye74:  I don't have a date scheduled for surgery yet.  My BS said she wants to see what the MRI shows first, if anything, and that will be done on monday.  She said she likes to schedule 2 weeks out, so Im thinking the surgery will be done end of October or early November.  I may call her office today and see if I can get a date.  Anyhow....I'm so sorry your first biopsy was so painful!  I truthfully did not feel a thing with mine, and believe me, I would have been screaming if I had.  I took some ativan too.  And thankfully I was laying down for it too, or else I probably would have been faint.  I too have very dense breast tissue which I have always been told and mammos are really hard for anyone to read.  Lots of cysts too.  I hope you don't feel anything with this next one.  I am going to ask for sedation and as well as a local.  Propofol if its possible as I don't want to be awake for any of it.  Not looking forward to the aftermath either.  I still have soreness and its been almost 2 weeks since the steriotactic was done.  But you are right, we need to get this out, whatever it is and get on with our lives!  I still have a sister that needs taking care of, and I can't focus on her with this hanging over my head right now.  I will be looking forward to hearing good news from you come friday or thereabouts!",
      "MessageIndex": 9,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 14, 2014 04:38PM Sunkat1080 wrote: thank you!  I appreciate it.",
      "MessageIndex": 3,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 15, 2014 05:03AM Sunkat1080 wrote: Thanks ye4!  I will be thinking of you this friday when you have your surgery and am praying for a good outcome for you as well.  I had never heard of this complex sclerosing lesion before and was really thrown for a loop when I was told that one was found on my steriotactic biopsy.  I found one study that said it has a 9% chance of upgrade.  Do you also have ADH?  I am supposed to be heading south for the winter in early november and the thought of this upcoming surgery has me really concerned that I will be stuck up north dealing with this!  Also I am pretty scared since I am a \"fainter\" and any kind of needle makes me queasy and unsteady on my feet.  I dread the needle localization the most, although most woman on here have said it was not that bad, but still......Please let me know how you make out on friday, and I will keep you in my thoughts and prayers that everything is benign.",
      "MessageIndex": 7,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825416",
      "Title": "New here and scared Sunkat1080 Sunkat1080"
    },
    {
      "AuthorID": "Sunkat1080",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206458/profile",
      "Content": "Oct 21, 2014 12:53PM Sunkat1080 wrote: FeDragonfly:  I know exactly where you are coming from.  I too was diagnosed with microcalcs.  The radiologist wanted me to come back in 6 months for a recheck.  But, he said make an appointment with the breast surgeon on your way out the door, which I did.  At the time, I didn't know why I had to make that appointment, because he told me my microcalcs were probably benign.  So I go and see the breast surgeon a week later to discuss coming back in 6 months per radiologists recommendation.  And guess what?  She says oh no, we need to do a biopsy!  When she looked at the films, she said she disagreed with the radiologist.  So I get the stereotactic biopsy done a week later, which by the way DID NOT HURT ONE BIT. Don't be scared if you have to have one.  Results came back ADH and radial scar.  Now I am having surgery next monday to find out exactly what is going on.  Am I scared?  Kind of, but Im glad that I went and followed up with the breast surgeon.  Had I not done that, and waited the 6 months and just gotten another mammo, I probably would be in exactly the same spot, just 6 months later!  The point I'm trying to make is that you need to follow up with the surgeon.  She may just tell you it's nothing to worry about.  On the other hand wouldn't you want to get this taken care asap if it did turn out to be something more worrisome?  And like everyone else says here, the waiting does suck big time, along with the anticipation of procedures, but so far, nothing I have had done has hurt one bit and I don't expect the surgery on monday to be horrible either.  Stay calm.  I also have a sister battling stage 3 ovarian cancer, so I know how you feel in regards to your mom.  That's why these boards are so helpful because we can't dump all this on them, so we can come here for our support.",
      "MessageIndex": 10,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/825593",
      "Title": "I don't feel sick... FeDragonfly FeDragonfly"
    }
  ]
}