{
  "AuthorID": "sunny8",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
  "Posts": [
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 16, 2014 10:24PM sunny8 wrote: It took one week to schedule my surgery. They were very accommodating but my cancer was grade 3 so it was a priority. However, the second side I did was not cancerous and so it took two weeks. If I were you, I definitely would put it off until after the holidays. If they are pre-occupied and busy with other stuff, you will not get the attention that you need during and after. Even if the surgeons are great, the nurses and other staff might be pre-occupied and it will not be as easy for you. Especially you are already in the lower priority list.",
      "MessageIndex": 14,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826015",
      "Title": "How long did it take to schedule your surgery? cinvee Unbreakable01"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 30, 2014 02:01AM - edited Nov 30, 2014 12:04PM by sunny8",
      "MessageIndex": 1017,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Apr 30, 2017 01:13AM - edited Apr 30, 2017 01:14AM by sunny8 4",
      "MessageIndex": 722,
      "PostDate": "30/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "May 2, 2017 01:37AM sunny8 wrote: Dear Peacockgirl  Could you PM with contact information for your trial that you are doing? I am looking for one for my mother. Thank you Sunny8",
      "MessageIndex": 2091,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799766",
      "Title": "Triple Negative Stage IV Renae64 thrivingmama"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Dec 7, 2014 11:49AM sunny8 wrote: Not sure if you can drive to Baltimore MD, but Johns Hopkins is amazing. They can get you in within a week after you meet with the surgeon. They are really accomodating to out of state and they are TOP NOTCH! Highly recommend.",
      "MessageIndex": 8,
      "PostDate": "07/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826802",
      "Title": "age 45, just diagnosed, Philadelphia jarpsyd Jenmarie9"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "sunny8 wrote: I was recently diagnosed with IDC. No family history no genetic link. I'm sure most people newly diagnosed like me are trying to search for What particular food did we eat or thing we did or substance we got exposed to that triggered the cancer. I've been searching the internet for articles but there really isn't much. Surprising since so much money has been poured into breast cancer awareness. I've been racking my mind trying to find out what common denominators we have. Also, if certain foods or things cause different types of breast cancer. So, for the items that you list that you think might have contributed to your cancer, can you also list your type? For example: I love chocolate and sweets. I was eating quite a bit of milk chocolate EVERY DAY. I am also lactose intolerant but I continued to eat dairy with my Lactaid pill. I'm wondering if this caused me to have cancer as research has linked lactose to cancer. Also, since I am allergic to lactose, I am wondering by forcing my body to eat the dairy my body reacted by inflammation which ultimately caused the cancer? Or was it just the sugar? Or was it that I was taking multivitamins PLUS taking IRON pills plus taking a packet of Emergen C Daily? Did this cause or just make my tumor grow faster? I had a 2.6 tumor that basically grew overnight. So tell me what routine did you do or what food did you eat regularly when you were diagnosed? And what type of diagnosis? Mine: ER+ 90% PR+90% her2- Ki67 25% Grade 3 I think this forum has provided me much more information than any outside research has given me so far. Dx 8/2014, IDC, 2cm, Stage IIA, Grade 3, ER+/PR+, HER2- Surgery Mastectomy: Right; Prophylactic mastectomy: Left Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Dec 25, 2014 06:23PM sunny8 wrote: I agree with you wrenn, searching for a cause has been really therapuetic in helping me cope with the diagnosis. It gave me a mission (impossible) but a mission and left no room for emotions and self pity to distract me. I learned a lot about the disease, about myself and it really helped. I know some people say that I shouldn't bother to search. But as I said before, if someone breaks into your house or tries to kill you. Wouldn't you want to find out who or why?",
      "MessageIndex": 65,
      "PostDate": "25/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "sunny8 wrote: I was recently diagnosed with IDC. No family history no genetic link. I'm sure most people newly diagnosed like me are trying to search for What particular food did we eat or thing we did or substance we got exposed to that triggered the cancer. I've been searching the internet for articles but there really isn't much. Surprising since so much money has been poured into breast cancer awareness. I've been racking my mind trying to find out what common denominators we have. Also, if certain foods or things cause different types of breast cancer. So, for the items that you list that you think might have contributed to your cancer, can you also list your type? For example: I love chocolate and sweets. I was eating quite a bit of milk chocolate EVERY DAY. I am also lactose intolerant but I continued to eat dairy with my Lactaid pill. I'm wondering if this caused me to have cancer as research has linked lactose to cancer. Also, since I am allergic to lactose, I am wondering by forcing my body to eat the dairy my body reacted by inflammation which ultimately caused the cancer? Or was it just the sugar? Or was it that I was taking multivitamins PLUS taking IRON pills plus taking a packet of Emergen C Daily? Did this cause or just make my tumor grow faster? I had a 2.6 tumor that basically grew overnight. So tell me what routine did you do or what food did you eat regularly when you were diagnosed? And what type of diagnosis? Mine: ER+ 90% PR+90% her2- Ki67 25% Grade 3 I think this forum has provided me much more information than any outside research has given me so far. Dx 8/2014, IDC, 2cm, Stage IIA, Grade 3, ER+/PR+, HER2- Surgery Mastectomy: Right; Prophylactic mastectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 8, 2014 09:36AM sunny8 wrote: Yes, I appreciate that but what better way to deal with it then to focus on it in a realistic way? There has got to be a better way. Of course I have done the surgery. Most likely will do the hormone therapy. I read here of entire families getting breast cancer with no genetic mutation. Maybe they are all eating the same thing? Wouldn't you want to know so as not to serve that to your children and have an entire new generation get the same diagnosis? Asians have a 50% less chance of getting breast cancer but when they move to a western country the rates are the same as the western country. That means it is either environmental or diet. Not genetics that prevents Asians from getting breast cancer. This is a study of Japanese so it's a first world country. I would discount the rates of third world countries as they probably do not keep track or diagnose the disease properly.",
      "MessageIndex": 18,
      "PostDate": "08/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 10, 2014 09:01PM - edited Nov 10, 2014 09:08PM by sunny8 MDG, and Brookside, Thank you for the links/ suggestions on reading. I will definitely look into them. Also, MDG I think you are on to something about Inflammatory foods. There is a lot of research on that right now around the world and they are discovering that it is a root cause for many diseases. In looking into my eating habits and researching I've also realized that perhaps we are eating foods that we don't realize we are allergic to and thereby causing the body to have constant inflammation. Maybe that is why all the research is leading to so many different conclusions because people are allergic to different things. Also, now with globalization of foods, we are eating foods that we would not naturally eat for our race and genetic makeup. For instance, as I mentioned I am lactose intolerant. So for me to consume lactose based food i.e. most dairy it will cause my body to react in an inflammatory way and make me sick over time. However, for someone who is NOT allergic to lactose, consuming dairy will bring them lots of health benefits and be a protective barrier for disease. Thereby the conflicting statistics. They even researched soy and realized that a certain ingredient that helps prevent cancer is not processed properly by 60% Caucasians. So, even if they consume it for it's health benefits, they get none. But Asians are better at processing this. Also, with Alcohol most asians are missing the enzyme/ gene to process it and therefore have a 3-4 fold chance of developing cancer by consuming it in small amounts. ( probably because it causes inflammation)But that is not the case for people who have the gene to process alcohol. Same goes with nuts. Many asian/ Japanese especially are allergic to Walnuts. yet, Walnuts are recommended for their anti-inflammatory omega 3 content. For some, this would be a health food but for people who are allergic. It would be a highly inflammatory food and cause a host of problems. And when I say allergic, I'm not saying that you have to have a severe allergy that would cause you severe reactions instantly. I think there are many foods that don't cause immediate reaction but we are technically allergic to them or unable to process them properly. I think if the researchers went this route it might bring more accurate results as to which foods to eat for different people. Kind of like genetic testing for the breast cancer gene. We all have a genetic makeup for the types of foods we can eat and process. I think it's part of evolution for our specific race. But when we eat other ethnic foods by immigrating or traveling, we don't realize we are consuming foods that are not meant for us. I think it would be a good idea for us to get a food allergy test done so we know which foods we might have hidden allergies to and avoid them because they are guaranteed to cause inflammation. I know I should probably post this theory in the alternative board but I I couldn't help but theorize it here. ",
      "MessageIndex": 27,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Dec 4, 2014 09:50AM sunny8 wrote: I read the Emperor of all Maladies. Thank you for recommending it. This must have been the best book I have ever read! Especially for people with Breast Cancer! I'm hopeful that finally the scientists are on the right path to find a cure for cancer... which is to take many paths.",
      "MessageIndex": 45,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "sunny8 wrote: I was recently diagnosed with IDC. No family history no genetic link. I'm sure most people newly diagnosed like me are trying to search for What particular food did we eat or thing we did or substance we got exposed to that triggered the cancer. I've been searching the internet for articles but there really isn't much. Surprising since so much money has been poured into breast cancer awareness. I've been racking my mind trying to find out what common denominators we have. Also, if certain foods or things cause different types of breast cancer. So, for the items that you list that you think might have contributed to your cancer, can you also list your type? For example: I love chocolate and sweets. I was eating quite a bit of milk chocolate EVERY DAY. I am also lactose intolerant but I continued to eat dairy with my Lactaid pill. I'm wondering if this caused me to have cancer as research has linked lactose to cancer. Also, since I am allergic to lactose, I am wondering by forcing my body to eat the dairy my body reacted by inflammation which ultimately caused the cancer? Or was it just the sugar? Or was it that I was taking multivitamins PLUS taking IRON pills plus taking a packet of Emergen C Daily? Did this cause or just make my tumor grow faster? I had a 2.6 tumor that basically grew overnight. So tell me what routine did you do or what food did you eat regularly when you were diagnosed? And what type of diagnosis? Mine: ER+ 90% PR+90% her2- Ki67 25% Grade 3 I think this forum has provided me much more information than any outside research has given me so far. Dx 8/2014, IDC, 2cm, Stage IIA, Grade 3, ER+/PR+, HER2- Surgery Mastectomy: Right; Prophylactic mastectomy: Left Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 13, 2014 12:26PM - edited Nov 14, 2014 09:18AM by sunny8 Dear Akitagirl,  Thank you so much for your post. What you say is so profound. \"how should I respond\" and How can I make a difference not in my own life but in other's lives as well. In a way I wanted to reach out to everyone hoping to spark a thought process. This discussion board is so powerful because it gathers us all together from all walks of lives and around the world with the same disease. If by pouring our hearts out here in a frank manner will trigger scientists and researchers to think outside the box then perhaps one day there will be a cure. We can't just say oh! it's been researched for years and therefore there is no solution. In going through this process, I have an immense appreciation for the medical field and all that they have provided us so far. There were so many diseases in the past that were thought to be incurable but one day, some scientist or team of scientist will bring about change. I realize the problem is that Breast cancer and many cancers in general pose a problem because there are so many aspects and so the researchers are going in multiple directions to find a solution. It's like going through a maze with a million doors and they keep opening but it leads to another door endlessly. But... I am hopeful that if we all pitch together and voice our opinions, it will be heard one day. If not this generation then perhaps in the generation of our children. Look at how far we have come within the last decade? Of course there is no cure but I am so thankful some doctor out there was able to come up with a way to save the skin and offer nipple sparing mastectomy. Then for HER2 + the new drugs are truly life savers. I just hope that the scientist are looking at every possible angle . Sometimes, they are told to focus on a certain thesis and prove that specific theory but maybe we can bring up new ideas for them to examine. After all, we are the ones living with the disease.",
      "MessageIndex": 37,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 7, 2014 08:46PM - edited Nov 7, 2014 08:56PM by sunny8 You are right not to fixate on things but for me at this point, I would like to find a common denominator other than being a woman so at least I can delete it from my routine so I do not get a recurrence or at least lessen my chance of recurrence.",
      "MessageIndex": 2,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 8, 2014 09:18AM - edited Nov 8, 2014 09:21AM by sunny8 Everyone's replies are nice and heartwarming. But we have cancer. The research is all directed toward medicine but nothing is preventative. We are offered several choices in our care which is Surgery, Chemo and Hormone therapy. What about how we should care for ourselves and lessen our chances of recurrence or for the sake of our children and future generations? Breast cancer of course has been around for centuries but perhaps those were the genetic ones. The cases of breast cancer have increased dramatically over the years even with all the research and development. Also, more and more are getting it at increasingly younger ages. My doctors office said they are seeing girls as young as15. Everyone is telling me to focus on healing and not dwell on it. That's exactly what I'm doing. I am trying to find a common link. If you read this board, you find certain common links. For instance, I noticed that it is common for Her2+ to spread even after NED or treatments. It is just the nature of the cancer. Also, triple negatives are highly susceptible to spread and recur as well. I hear so many stories of people doing everything possible to 'prevent' recurrence by way of CHEMO, Hormone therapy yet they also have recurrence. Perhaps if they did all the treatments and also cut out some outside elements in their diet or environment it would not have recurred? How would we know if we do not conduct our own survey? The drug companies do not want to do this type of research because it is no benefit to them. We have nothing to lose by doing this. So why not try? Why is everyone so willing to just say, Oh! Focus on the treatment. Of course! I am doing everything possible to rid myself of the cancer but as we all know, it is never truly gone. That is why we need to share information that only we would know. Which is what we eat. How we live. So, what's your favorite food?",
      "MessageIndex": 15,
      "PostDate": "08/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "Nov 9, 2014 10:31AM sunny8 wrote: I know I won't be solving one of the world's great mysteries but it is an adventure in itself. I had no idea about the risks of breast cancer when I was diagnosed. I had a .06 percent chance of getting it from the supposed 'risk calculator' But here I am. I've never smoked, don't drink, eat well.... but that is what I've been doing for the past 20 years. Some say it's what you were exposed to during puberty when your breasts were developing. My diet during puberty was a completely different story. Junk food, canned food, soft drinks, fast food, alcohol... and all that Halloween candy:) Perhaps it's some people are able to process the defected cells better than others. It's like developing immunity to certain viruses. Maybe sometimes babying it makes it more susceptible? I know my husband is a hypochondriac and is super clean conscious but the moment he is exposed to a crowd, he catches a cold. So many theories. ",
      "MessageIndex": 25,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "sunny8 wrote: I was recently diagnosed with IDC. No family history no genetic link. I'm sure most people newly diagnosed like me are trying to search for What particular food did we eat or thing we did or substance we got exposed to that triggered the cancer. I've been searching the internet for articles but there really isn't much. Surprising since so much money has been poured into breast cancer awareness. I've been racking my mind trying to find out what common denominators we have. Also, if certain foods or things cause different types of breast cancer. So, for the items that you list that you think might have contributed to your cancer, can you also list your type? For example: I love chocolate and sweets. I was eating quite a bit of milk chocolate EVERY DAY. I am also lactose intolerant but I continued to eat dairy with my Lactaid pill. I'm wondering if this caused me to have cancer as research has linked lactose to cancer. Also, since I am allergic to lactose, I am wondering by forcing my body to eat the dairy my body reacted by inflammation which ultimately caused the cancer? Or was it just the sugar? Or was it that I was taking multivitamins PLUS taking IRON pills plus taking a packet of Emergen C Daily? Did this cause or just make my tumor grow faster? I had a 2.6 tumor that basically grew overnight. So tell me what routine did you do or what food did you eat regularly when you were diagnosed? And what type of diagnosis? Mine: ER+ 90% PR+90% her2- Ki67 25% Grade 3 I think this forum has provided me much more information than any outside research has given me so far. Dx 8/2014, IDC, 2cm, Stage IIA, Grade 3, ER+/PR+, HER2- Surgery Mastectomy: Right; Prophylactic mastectomy: Left Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    },
    {
      "AuthorID": "sunny8",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206402/profile",
      "Content": "May 12, 2015 12:54AM sunny8 wrote: Many people have been posting and saying that they take Iron supplements. I am also anemic because of fibroids and heavy monthly bleeding but I have read numerous articles saying that Iron is actually the cause of many organ failures and can cause cancer. Be very careful with the supplements as I read that Iron really fuels BreastCancer. It is better to get iron from food and not supplements. I used to take supplements and I am absolutely sure that it really put my tumor in overdrive. Thank you everyone for your input. ",
      "MessageIndex": 95,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/826095",
      "Title": "Trying to find a common cause. Please help! sunny8 msphil"
    }
  ]
}