{
  "AuthorID": "sunnyinutah",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
  "Posts": [
    {
      "AuthorID": "sunnyinutah…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "Apr 19, 2013 11:49AM sunnyinutah wrote: Smiilsbc, good for you! and I did not know that but I should mention that proceedure to my surgeon. I am more content with 0% then even 2% or 5%. I have been that way my whole life. I have never told a client \"maybe\" or \"I think so\" if I am not 100% sure I find out the answer and make sure I am 100% sure. I expect the same with anyone that I deal with. Glad that you inquired, when will you find out? or did you already?",
      "MessageIndex": 12,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    },
    {
      "AuthorID": "sunnyinutah…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "Apr 19, 2013 11:34AM sunnyinutah wrote: I have my consult with a surgeon on wednesday, who knows maybe that will scare the cyst and it will just go away!!! I can hope for that right?!",
      "MessageIndex": 10,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    },
    {
      "AuthorID": "sunnyinutah…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "Apr 19, 2013 11:45AM sunnyinutah wrote: April, that stinks! how are you now? I am sorry that had to happen to you. How has the radiation gone? I hope that you find your tests to be clear and on your way back to your post-lump life!",
      "MessageIndex": 11,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    },
    {
      "AuthorID": "sunnyinutah",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "sunnyinutah wrote: Maybe it is because of the field I am in but regardless I have asked my doctor to send in the order for a biopsy of my complex cyst to clear any notion of it being malignant. I hear stories on a daily basis of women that have cancer and wish they would have caught it sooner but instead played the watch and wait game. I will be paying for it, so why cant I ask for it? that is what my husband asked so I called the doctor office and asked to have it scheduled. My guess is that it is benign and that is great, but when a radiologist used the term \"probably\" on my report it does not give me the warm and fuzzys. I am responsible for my body and my destiny therefore I am taking control and ordering what would normally have to take me 5 months. I can for once put this out of my head and move on with my life. I probably wouldnt care if I did not have a history of tumors in the family. My father died a few years ago at age 53 and my mom had a tumor (benign) in her late 30's. Time to take control! has anyone else demanded this without waiting the 6 months? Love to hear your story, so I am not alone. Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    },
    {
      "AuthorID": "sunnyinutah…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "Apr 21, 2013 07:15PM sunnyinutah wrote: I thank you Bessie and I am glad that you understand my stresses. Better to be safe then sorry right? I imagine that my results will come back that everything is clear and fine and I will just have to go back in 6 months to a year. That is my wish for anyone but also know that if that were always the case none of us would need this board because we would all be a picture of health. It is so sad that we have to go through health scares and situations that lead us to ask why? Its also so consuming when you just dont know. I have been through A lot in my short life, more then I can mention here. This will just be one less thing that I will have to worry about after Wednesday! Any positive vibes you can send to me are greatly appreciated!!!! Thanks again for your understanding and concern.",
      "MessageIndex": 14,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    },
    {
      "AuthorID": "sunnyinutah…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/176506/profile",
      "Content": "Apr 19, 2013 11:32AM sunnyinutah wrote: Thank you for your stories I was not sure if I was justified in my thinking or not. I respect the radiologist and their education. I unfortunately do not just what is told to me without asking further questions. They indicated to me that they could not tell me that it was benign and that I would have to have a biopsy for that. My doctor called me yesterday after finally looking at the report and indicated that she would feel better if I went in for a biopsy because as a women herself she would want to also know and can understand the anxiety. I am not trying to worry others on this board that are watching and waiting because that is up to them. I have a history in my family of illness and early deaths and so this is what is right for me. All I wanted was to hear others stories so that I could find out if I was alone in this thinking or if others felt the way I did. No need to lecture me please I am an adult and I have a family to think about not just myself. IMO it is probably nothing at all, just fluid and will go away at least that is my wish! If not then at least I can say that I exhausted all possibilities and I know 100% what is going on in my body. I know the statistic. I also know that women still get breast cancer and that is what I am trying to rule out. Good luck to all.",
      "MessageIndex": 9,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/803479",
      "Title": "Wont Play the Wait and Watch sunnyinutah Jenny2578"
    }
  ]
}