{
  "AuthorID": "sunshinyday…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
  "Posts": [
    {
      "AuthorID": "sunshinyday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
      "Content": "May 20, 2011 06:31AM sunshinyday wrote: LEG PAIN? Well, it's been 72 hours since my first treatment.  I was feeling so happy that I had escaped any bad side effects. I have felt pretty good actually!  Then last night came this leg pain from nowhere.  Bone pain!  muscle pain! Like needles in addition to overall achiness.  I got up and took a Vicodin left over from my surgery. I think I got a little sleep.  I am just achy this morning.  It's just my legs from hips to feet!  I wonder why just my legs?  Anyone else with this side efeect? Also, I went back to work yesterday and felt a little overwhelmed by the chaos.  I had difficulty focusing on more than one task at a time.  It was especially hard when people were talking to me as I worked.  I've always been a good multi-tasker but now I need to just focus extra hard.  My heart goes out to 38 Years Old. I am sending you my love and prayers. Cyborg, Ruthii and MamaV I love your wisdom.  Keep it coming! ",
      "MessageIndex": 470,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "sunshinyday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
      "Content": "May 17, 2011 09:32PM sunshinyday wrote: Ruthii, Hope your first day goes as well as mine!  Still feeling good nearly 12 hours later.  I admit I am curious why your medical oncologist wants to go with 6 treatments of TC instead of 4.  Debrox, my oncologist will not put me on Neulasta unless I really want her to.  She said that the side effects of the Neulasta shots are worse than the chemotherapy with painful bone and joint pain.  So if I can naturally keep my WBC counts above 1500 I chose to go without it.   I guess the dexamethasone is responsible for making me so hungry?  Day, thanks for stopping in with the good advice and hope for hair growth when this thing is over!",
      "MessageIndex": 402,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "sunshinyday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
      "Content": "May 23, 2011 10:38AM sunshinyday wrote: RANDOM THOUGHTS ONE WEEK AFTER FIRST CHEMO: 1.  I feel like an alien.  Things feel strange.  2.  I plan on working for the first month of this regimen and then I am going to take a leave of absence.   But I realize it is going to be essential that I have a task.  Work is one way to take my mind off of this, but I think I deserve to do something more enjoyable.  I am going to break out my paintbrushes and produce at leat three masterpieces this summer! 3.  This is my last week with hair. ",
      "MessageIndex": 554,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "sunshinyday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
      "Content": "May 16, 2011 08:23PM sunshinyday wrote: I would like to walk with you all through my chemo.  Tomorrow, May 17 is my first day.  T/C (Taxotere/Cytoxan) every 3 weeks x 4 for me.  Checklist:  Lots of water: check! Dexamethasone: check! Plenty of medications available for various side effects: check!  Am I ready?  Maybe.  Am I scared?  yes!",
      "MessageIndex": 377,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    },
    {
      "AuthorID": "sunshinyday…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128314/profile",
      "Content": "May 17, 2011 03:37PM sunshinyday wrote: Thank you for the welcomes.  Just got back from my first chemo and I don't understand why I feel so good!  Just waiting for the part where you feel bad.  I know it is coming...  The experience at the cancer center was great...  Compassionate nurses, hubby by my side and fresh baked cookies from the volunteer!  Came home to a yard planted with flowers, mulched and mowed by dear friends. We ate some soup then I took my beagle for a long walk.  I tried the ice thing on my nails and toenails to see if that will prevent the nail problems.  The nurses knew nothing about this so I felt kind of freaky.  I'm thinking of taking it easy with a good book and naps today,so as not to overdo it. What books are you all reading?",
      "MessageIndex": 391,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768029",
      "Title": "Chemo May 2011 Cyborg"
    }
  ]
}