{
  "AuthorID": "Sunshine197…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278245/profile",
  "Posts": [
    {
      "AuthorID": "Sunshine197…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278245/profile",
      "Content": "Aug 11, 2018 03:11AM Sunshine1970 wrote: I had a core biopsy and was told by my ob/gyn and the breast center that it is DCIS, I was referred to the cancer center,they said it's not dcis and need to have a lumpectomy to remove the microcalcifications, then they will decide after that pathology comes back. The 1st one came back atypical ductal hyperplasia with microcalcifications tested positive for E-cadherin and strongly positive for estrogen receptor. So confused about it all because why would one say one thi g and someone else say something else. It was birads 4 when I had mammograms. Had a previous ductal lumpectomy 9 years ago on same breast for body nipple discharge, but it was all b9 then. I'm so worried because I am not sure what to think.",
      "MessageIndex": 2,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866026",
      "Title": "Micro calcifications with no mass? Kerri-on-cloud9 Sunshine1970"
    },
    {
      "AuthorID": "Sunshine197…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278245/profile",
      "Content": "Aug 12, 2018 05:06PM Sunshine1970 wrote: thank you so much for this information! I appreciate it very much.",
      "MessageIndex": 6,
      "PostDate": "12/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866026",
      "Title": "Micro calcifications with no mass? Kerri-on-cloud9 Sunshine1970"
    },
    {
      "AuthorID": "Sunshine197…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278245/profile",
      "Content": "Aug 17, 2018 11:54PM Sunshine1970 wrote: I had my biopsy and was told high risk atypical ductal hyperplasia, well I was referred to the oncologist because I have so many groups of clusters of microcalcifications, I went to see her and was scheduled for a lumpectomy because it was such a high Adh,with estrogen positive, well my surgery is scheduled for Monday morning, she called me today and said her and the team of drs reviewed the previous pathology and said I have very high risk adh and some cells showing dcis but in the biopsy the dcis is only measuring 1 mm. She said I have 8 cm of microcalcifications and is concerned that it will show more dcis. She asked if I considered a mastectomy if these results from mondays surgery comes back malignant, I said yes. What do you think my chances are? And can it come back even after mastectomy with reconstruction? I said I would only do mastectomy and want no reconstructive surgery.",
      "MessageIndex": 16,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/865624",
      "Title": "Confused and Anxious Ken1018 Ken1018"
    }
  ]
}