{
  "AuthorID": "Sunshine99",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
  "Posts": [
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Sep 14, 2008 02:07AM Sunshine99 wrote: A couple of questions: Nash:  Which book did you find your information.  I hear such conflicting information, like walking is good, walking is useless, etc., and would love to read what you did.  I wear a pedometer daily to track my walking. Sheila:  I like the idea of \"walking music\".  Did you make your own playlist or was this something you bought pre-made? I've been struggling with my weight since I finished chemo in April 08 - it fluctuates 4-6 pounds, but I don't want 4 pounds to turn into 8 into 16, etc. I'm not big to start with, so every pound counts.  I think about my weight every day and kind of stress about it. Maybe I should stop reading stuff on the internet!  You know what I mean - one site tells you that all you have to do is walk.  The next site tells you that all you have to do is lift weights.  The next one tells you that you just have to stand on your head each day and get 8.25 hours of sleep at night (just kidding about the last one!!). Thanks for starting this tread.",
      "MessageIndex": 15,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720921",
      "Title": "Healthy weight to lower risk alohamomof3 NancyD"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Sunshine99 wrote: Hi ladies: To those of you who shaved your heads, how did you do it?  I did have my hair buzz cut on around day 11 of my TC treatment.  I probably have about 1/3 of it left, but it gets on everything and I'm thinking of asking my husband to shave it for me. Did you use your husband's electric shaver?  A blue bic?  Waxing? (just kidding!)  Did you shave it all the way down to the skin? I'm just tired of the mess... Sunshine Dx 11/2/2007, IDC, 3cm, Stage IIA, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701253",
      "Title": "A head shaving question Sunshine99 sahalie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 3, 2007 06:03PM Sunshine99 wrote: Ladies, I thank you.  Your support is amazing.  Am I allowed to share something that I think is funny?  When I had my first mamogram, they \"found something\" so sent me back for a recheck (apparently they saw some microcalcifications).  So just before the mamo, the tech looks at the previous x-ray and says \"Oh, they're so tiny!\"  We both started laughing, because my breasts are rather small!  (She apologized - I said \"No offense taken\".) Then this morning, I was taking a shower and looked down and my right breast is swollen (from the biopsy).  It must be up to a size B.  Got a laugh out of that, too.  It's the little things that make us laugh, right?  (Actually I meant humor, not my breasts.) Anyway, I can't thank you all enough for your support.  I'm still undecided when to tell my family.  So far, just my husband, our pastor and his wife know.  We're very close to them and they're what we call prayer warriors. Can anyone tell me what to expect when I see the surgeon on Thursday?  I'm reading the booklets and forums and will make a list of questions to ask. Hugs",
      "MessageIndex": 11,
      "PostDate": "03/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 23, 2007 09:50PM Sunshine99 wrote: Hi everyone: My husband has been so supportive through all of this.  I have an appointment with the plastic surgeon next week to discuss surgical options and he's going to go with me.  I've had several friends tell me that if I feel like I'm coming unglued, to just let him make the phone calls for me.  He's told me he would, so I just need to let him. Joel, you sound like a rock!  What a blessing you must be to your wife.  Thanks for your posts - they really help. ",
      "MessageIndex": 21,
      "PostDate": "23/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 2, 2007 05:33PM Sunshine99 wrote: Thank you everyone!  I called him and let him know.  I am blessed to have a wonderful, supportive husband.  I'm so thankful this forum is here - its a huge help to know how my \"sisters\" have dealt with this issue.  I think, in one sense, that this is going to be easier on me than it will on my family.  We don't have children, but I have two sisters and my parents are still living (I am 49 years old).  How am I supposed to tell my family this?  I was thinking of waiting until after I see the surgeon next Thursday.  There's a chance we may get together for Thanksgiving...   Part of me doesn't want people making a fuss but part of me wants support.  (sigh) Anyway, thank you again and a big group hug to you all!",
      "MessageIndex": 6,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 3, 2007 07:17PM - edited Nov 3, 2007 07:18PM by Sunshine99 Thank you, Sue.   Did you schedule your surgery right then?  This is all happening so fast!",
      "MessageIndex": 13,
      "PostDate": "03/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Sunshine99 wrote: I just got the call.  Doctor said its a \"small cancer\".  The next call will come from the surgeon.  I don't know when to tell my husband.  Should I call him at work?  Wait til he gets home?  Tomorrow is his birthday and he's supposed to leave tonight to go camping with a buddy of his.  Staying home with me won't do either of us any good.  I'm afraid and could use a cyber hug right now. Thank you! Dx 11/2/2007, IDC, 3cm, Stage IIA, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 5, 2007 12:01PM - edited Nov 5, 2007 12:02PM by Sunshine99 Sorry if I'm saying \"thank you\" too much, but you have no idea (or maybe you do!) of the strength you ladies are giving me!  I called both of my sisters and my parents and now they all know.  I was dreading having to tell them.  I'm glad that's over.  There's something about having people you love knowing what you're going through.  They can't fix it or change it, but it still helps. I was all over my sisters about doing breast self exams (they admitted they hadn't been doing them).  I didn't talk to my mom, but I did talk to my dad and he assured me that my mom does self exams.  Probably because she had a sister, aunt and grandmother die of cancer.  It's funny how our breasts are so private until we get breast cancer.  Now it's going to be my campaign to all my lady friends to do self exams in addition to mamograms (mine was 5 months ago and didn't show anything). BTW, my two favorite songs on my ipod are \"He Knows My Name\" by Paul Baloche and \"How Can I Keep from Singing\" by Chris Tomlin. I get alot of strength from those!",
      "MessageIndex": 17,
      "PostDate": "05/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694831",
      "Title": "When do I tell my husband Sunshine99 Sunshine99"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 5, 2007 02:16PM Sunshine99 wrote: Barbara & gb, I don't know the details yet.  I suppose the visit with the surgeon on Thursday will take care of that.  My dog, Theo, is sticking pretty close these past few days.  Its amazing how they know... I'm sending you cyber hugs!",
      "MessageIndex": 52,
      "PostDate": "05/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694106",
      "Title": "Why am I not upset? Barbara1 Mary-Lou"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 18, 2009 07:48PM Sunshine99 wrote: Amy, when I had my US, the radiologist wanted me back that same day for a core needle biopsy.  Did the radiologist say anything to you?  The waiting is truly one of the hardest things you'll do.  Praying for benign results.",
      "MessageIndex": 2,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736125",
      "Title": "So scared AmyC just_mary"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Nov 2, 2007 11:45PM - edited Nov 2, 2007 11:45PM by Sunshine99 Hi Barbara, I just got my diagnosis today - biopsy 2 days ago.  Yesterday, I was looking at my \"fur child\" - a 12 year old Airedale Terrier, and wondering, \"How will he survive without me???\" I totally understood your comment and it made me smile.  God bless you!",
      "MessageIndex": 49,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/694106",
      "Title": "Why am I not upset? Barbara1 Mary-Lou"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 3, 2008 07:52PM Sunshine99 wrote: I went to Victoria's Secret today (I really HATE sales when stores are super crowded!!!) and found the cami.  My receipt says \"BBV CAMIS\".  They only had black but I bought two, since the second one was half price. I went on line to see if they had more colors.  I found what I think is the same, but no discount.  The on-line is called \"IPEX WIRELESS CAMI\".  The price is the same as the in-store regular price, but you have to pay shipping.  Oh well. I'm wearing it now and I think it will work.  I can \"add\" a little filler to the mast side.  It's pretty comfortable. Good luck! Sunshine",
      "MessageIndex": 2,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/697810",
      "Title": "comfortable camisole shrink shrink"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 5, 2008 07:43PM Sunshine99 wrote: I wore mine today. I took the fiberfill insert that came with my Amoena cami, removed some of the filling and put it in the mast side of the bra.  Had to remove a bit more of the fiberfill before I felt like I \"matched\", but I think it works.  Yesterday, when I was just hanging around the house, I left the mast side empty.  It still gave me a bit of form there (I'm a large A/small B). The \"prosthesis\" shifted a bit, so I'll have to figure out how to keep it in place.",
      "MessageIndex": 6,
      "PostDate": "05/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/697810",
      "Title": "comfortable camisole shrink shrink"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Dec 28, 2007 06:15PM Sunshine99 wrote: Hi Kellie, I also had a lump I could feel.  I had an ultrasound during which the tech asked the radiologist to come in and look at it.  The radiologist asked if I could come back that same day and she did an ultrasound guided core needle biopsy.  Maybe you could ask the same radiologist who is seeing the lump or mass on ultrasound to also do the core needle (or whatever type they do) biopsy.  It sounds like it would save you some of the stress of being sent to person to person with each new person telling you something different. We'll all be thinking good thoughts for you and wishing you the best.  Be sure to let us know how things work out for you.  This is a wonderful place to be for support from those of us who have \"been there\". Sunshine",
      "MessageIndex": 2,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/697549",
      "Title": "Not sure what my next step is Kellie Kellie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Mar 8, 2008 07:25AM Sunshine99 wrote: I'm also on 4 sessions of TC.  My onc and the clinical trial nurse both agreed that I have \"great veins\".  My infusion nurse does warm up my hand and arm with a heating pad before each treatment.  Two chemo sessions down and two to go with no problems with my veins.",
      "MessageIndex": 24,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701477",
      "Title": "Using your veins instead of a port for chemo infusions otter joteach"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Apr 4, 2008 06:55PM Sunshine99 wrote: I think the drug that comes after tamoxifen is the aromatase (sp?) inhibitor.  Taxol is a chemo drug, right? Sunshine",
      "MessageIndex": 2264,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Dec 14, 2007 09:08PM Sunshine99 wrote: I love the SIS (Sister in Survival).  That's too cool! And I love the part about not picking up dog poop.  Does anybody know why?  Maybe I should just not ask and just \"milk\" that one.  My husband and I have a routine when we walk the dog together at night.  He picks up the poop and then I carry the bag to the next available trash can.  I always thank him for handing me a bag of poop. A quick funny for all of you.  A friend left a message on our answering machine wanting to know how I was after my surgery and wanting us to keep them ABREAST of my condition.  ha ha - It just struck me as funny. Sunshine",
      "MessageIndex": 47,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 28, 2008 04:39PM Sunshine99 wrote: Ladies, I start chemo in two days, and I'm a nervous wreck - more so than before my mast.  I feel like crying - I know it will be fine, but I'm just anxious.  My house isn't clean enough yet, I still have papers to file, I don't know what food to have in the house, and on and on it goes.  This feels like it's all happening too fast.  I may end up taking an Ativan (which I have never taken in my life).  I know I'll survive this as so many of you have, but I don't like feeling this way. I'm not normally an anxious person...  Anyone got a spare hug for a \"sissy\" sister??? Thanks so much! Sunshine",
      "MessageIndex": 919,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 31, 2008 03:04PM - edited Jan 31, 2008 03:14PM by Sunshine99 Hi Jewels! I made it through my first infusion yesterday.  I'm getting taxotere and cytoxin, 4 sessions, three weeks apart.  So, one down, three to go!  It actually went very well.  Gave 3 vials of blood for the TAILORx study, then got the chemo stuff. Didn't sleep last night, but maybe that's from the dexomethasone???  I got some tea tree oil for my nails today.  Here's hoping for no or few side effects.  Have a feeling I'm going to get constipated, but I have stuff ready for that.  QUESTION:  Should I take the compazine (sp?) before I need it or wait until (if) I feel nauseated?  I don't know when it will hit or how hard, etc.  I'm drinking lots of liquids. Any other suggestions? Sunshine",
      "MessageIndex": 996,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Feb 6, 2008 02:27PM Sunshine99 wrote: Hey D1, Thanks for keeping up with all of our treatments. I don't know how you do it.  I haven't felt like logging on for the past few days.  We decided to move my future treatments to Thursdays rather than Wednesdays.  My onc will be gone one Wed, and her replacement is available on Thursday and then we'll be coming back from a trip on a Wednesday so we decided to just move them all forward by a day: 2/21, 3/13, and 4/3 will be the days. Wishing all my sisters a SE free day! Sunshine",
      "MessageIndex": 1111,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 10, 2008 12:55AM Sunshine99 wrote: CTG, May you feel the warm presence of God as he holds you in His arms.  May your room be filled with His angels to comfort you and those who love you. You are loved.... Sunshine",
      "MessageIndex": 68,
      "PostDate": "10/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/697728",
      "Title": "CTG needs our prayers LuAnnH LuAnnH"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jan 25, 2008 04:39PM - edited Jan 25, 2008 04:40PM by Sunshine99 I get Biotene at the grocery store.  I also have a haircut scheduled for 1/29/08, chemo starts on 1/30/08.  I'm thinking I'll have my \"hair guy\" cut me short or buzz me when it starts falling out on or around day 14.  Or maybe I'll have him just cut it short on the 29th.  I can't decide, but I don't think I'm quite ready for losing it on the 29th.... I wonder if I can get my dentist to write a prescription for the Biotene - so that I can pay for it with our Healthcare Spending Account (or whatever it's called). Sunshine",
      "MessageIndex": 827,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Apr 4, 2008 06:45PM Sunshine99 wrote: Hi Jewels: I did it!  Finished my last session of TC yesterday.  Will go back and see the onc. in one month and then she'll start me on the Tamoxifen.  I forget what comes after that.  I want to say Taxol, but I can't remember if that's a chemo IV drug or not.  Stomach feels a little icky today, but I took some Pepcid, so maybe that will help. It's kind of weird being \"done\" with chemo.  It's like, OK, what now?  I know they'll follow me closely, especially since I'm part of the TAILORx trial, but I'm wondering if everyone will expect me to me \"over it\" now.  Does that make sense to anyone? I'm feeling a little loopy today - feel like I need a nap, but can't sleep.  One more dose of the Dexamethasone tonight and then I'll be done with that. Thanks to everyone  for all the good wishes.  I can't believe how thorough some of you are at responding to all of us!  Makes me feel like a lazy bum!  I'll stick to this conversation for a while just to keep up with the latest.  Wishing all of you SE free days and nights. Sunshine",
      "MessageIndex": 2262,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Mar 31, 2008 08:12PM Sunshine99 wrote: Hey golfer779, I met someone in the desert this past week.  I think she said she was form Poulsbo, WA.  My sis is from Seattle, so they had fun talking.  She mentioned a really good bakery there?  Do you know what she's talking about?  My sis didn't, but would like to know about it. Isn't Poulsbo on its own island in the Sound?  It sounds really nice! Sunshine",
      "MessageIndex": 2204,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Feb 1, 2008 11:33AM Sunshine99 wrote: PAlady - how pretty you look!  I'm getting my buzz cut on day 12.  I'm hoping I look that good! I do have my wigs, and will go get the actual fitting that same day. Sunshine",
      "MessageIndex": 1011,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 10, 2010 04:05PM Sunshine99 wrote: Hey Coonie, I looked on the Target website.  The item number didn't come up with anything, but I searched Gilligan & O'Malley and saw a bunch of items.  Is this cami in the maternity section?  Is it the crossover cami?  I really want to try this. I've been wearing my Victoria's Secret cami but I need something in white and I would love something with a pocket. Thanks so much!",
      "MessageIndex": 41,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753209",
      "Title": "Excited to find cheap Camisoles at Target coonie coonie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 19, 2010 09:16PM Sunshine99 wrote: Hi LindaLou and everyone, I did get the micro-beads at JoAnn Fabrics.  They are really, really tiny.  I also got some soft stretchy fabric to try to make the form.  Haven't done it yet, but here is what I tried: I took a pair of panty hose and cut off about a foot (no pun intended) - 12 inches - off the bottom.  Then I took the big bag of micro beads on my big smooth kitchen island and using a wide funnel (like for canning) poured about a cup of micro-beads into the stocking (I'm small busted).  It's kind of messy, but then I tied off the end of the stocking and squished the beads around and then put it in my  bra.  It felt super comfortable.  I just need to work on getting the right amount in there, and then I'll make some kind of cover. Don't know what I'll do with all the extra micro-beads unless I start selling breast forms on the corner :) Anyone else tried to make their own form yet?",
      "MessageIndex": 73,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753209",
      "Title": "Excited to find cheap Camisoles at Target coonie coonie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Feb 3, 2008 09:39AM Sunshine99 wrote: This is day 5 for me.  Started hurting yesterday - feels like that ole Mack truck took a detour for me!  No nausea, thankfully, but no real appetite to speak of.  We're supposed to go to a Super Bowl party this afternoon.  I actually look forward to seeing these people and don't want to miss out.  My husband said we can just go for an hour or whatever I feel like.  He's so kind! Can't figure out the bowel thing.  I've been taking generic senokat with a colace on the side.  I may switch to Miralax if things don't get miving consistently.  I have a weird bruise-like thing on my leg.  No idea where it came from.  I'm not taking any aspirin, etc., just Tylonal for pain. Wishing you all a SE free day! Sunshine",
      "MessageIndex": 1041,
      "PostDate": "03/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Feb 8, 2008 10:14AM Sunshine99 wrote: 1lovewolf, I think I posted somewhere yesterday or the day before about the sore butt thing.  Maybe it is the chemicals.  Someone recommended using Tucks medicated wipes.  I looked for them at Walgreens but couldn't find them.  Will try another store today.  Let us know what works for you.  I would imagine that drinking lots of water or liquid will help so I continue to do that.  Sunshine",
      "MessageIndex": 1157,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Mar 31, 2008 08:07PM - edited Mar 31, 2008 08:08PM by Sunshine99 Hi everyone: I've been sort of away for a while.  Had a quick business trip with my hubby and then we went to the desert for a week of relaxation with my family.  I may live in Southern California, but it was still nice to get someplace really warm! Yep, my fourth and hopefully last session of chemo will be on Thursday.  Can't wait.  I have some numbness in my fingers and a couple of my fingernails have what look like little blood blisters on them.  I'm using the tea tree oil when I think of it, but I can't stand the smell of it. Got my first bill for the chemo treatments!!!!!  Holy cow!  What do people do without insurance?  I'm \"only\" on TC and \"only\" four sessions.  My white cell counts are high, so I don't have to do the neulasta shots, but it still runs $6320 for ONE session.  Of course that includes the pre-chemo blood work and the visit with the onc., but yikes! My share of that is relatively small, but I'm still glad that we set aside the max amount in a medical savings account through my husband's employer. My scalp is a little more sore these past few days... almost feels raw in a few places.  Anyone else experience that?  I'm not sure if my hair is growing back yet.  My head is just kind of \"fuzzy\".  I never went completely shiney head bald.  Will I lose any more hair on tamox? It's always great to read all the posts and hear how everyone is doing.  Wishing you all SE free (or minimal) days! Sunshine",
      "MessageIndex": 2203,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 11, 2010 02:44PM Sunshine99 wrote: Thanks for the replies, everyone.  I think I'm going to make a Target run this afternoon!",
      "MessageIndex": 47,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753209",
      "Title": "Excited to find cheap Camisoles at Target coonie coonie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 11, 2010 07:19PM Sunshine99 wrote: Yippeeee!  Found them.  I'm going to try inserting the \"cups\" I brought at JoAnn Fabrics!",
      "MessageIndex": 48,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753209",
      "Title": "Excited to find cheap Camisoles at Target coonie coonie"
    },
    {
      "AuthorID": "Sunshine99",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/58675/profile",
      "Content": "Jun 13, 2010 08:36PM Sunshine99 wrote: Coonie, THANK YOU for the pictues.  I decided I am going to try to make a foob.  I bought the micro beads and some fabric similar to the cover for one of the others I have.  We'll see.  I'll let you know how it goes :)",
      "MessageIndex": 65,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753209",
      "Title": "Excited to find cheap Camisoles at Target coonie coonie"
    }
  ]
}