{
  "AuthorID": "Sunshine195…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86389/profile",
  "Posts": [
    {
      "AuthorID": "Sunshine195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86389/profile",
      "Content": "Nov 8, 2009 09:39PM Sunshine1958 wrote:  Hi Mary, My doctor's office told me to use code 174.9 when submitting my claim form for my \"cranial prosthesis\".  I did a search and found several sites that also say to use diagnosis code 174.9 for \"malignant neoplasm (abnormal growth) of female breast\", so that does appear to be the correct code. I hope that helps! Sunshine",
      "MessageIndex": 4,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/743427",
      "Title": "Got my Rx for wig, but diagnostic code is missing MaryNY MaryNY"
    },
    {
      "AuthorID": "Sunshine195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86389/profile",
      "Content": "Aug 30, 2009 06:30PM Sunshine1958 wrote: Kayleigh, I don't know very much about all of these things, but it seems to me that that the prospect of doing chemotherapy is a bit extreme if the finding was only .7mm in one of the sentinal nodes (mine is .5mm).   I have never heard of the Oncotype report before now, so what does a score of 16 mean?  What criteria is considered?  I may just be misunderstanding your situation and that chemo is required due to your original tumor, so I could be totally off base here. I would just hate to see you have to undergo such a harsh treatment that you don't really need to have.  Also--and this is just my personal opinion--I would rather deal with having no lymph nodes on that side rather than go through chemo. Thanks for your input, and I hope this all works out for you! God bless, Sunshine",
      "MessageIndex": 5,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739666",
      "Title": "Separate surgery--nodes removed Sunshine1958 Kayleigh3483"
    },
    {
      "AuthorID": "Sunshine195…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86389/profile",
      "Content": "Nov 3, 2009 03:16PM Sunshine1958 wrote: I had a port put in last Monday (Oct 26th) to begin chemo the same day, and from the time it was put in, I cannot breathe well and my heart beats REALLY fast if I try to lie on either side or lay flat on my back.  Has anyone else ever experienced this??  I finally called my surgeon about it on Friday morning, told him what was happening, and he told me to call the oncologist (which surprised me because I figured since HE had put it in, he would have some answers for me). Since my oncologist was out of town, I got the \"relief' oncologist who was an absolute a**!!!  He strongly insinuated that I was just being \"over anxious\" and causing it myself.  Then he told me \"shortness of breath\" is one of the side effects of Neulasta (the shot I get the day after chemo).  I tried to explain to him that this is not what I'm saying...I am NOT \"short of breath\" just sitting there...it only happens when I lay on my side or back.  Anyway, he at least sent me for a chest X-ray and my lungs were clear which was good to know.  But I still don't have an answer as to what is causing this. Anyone?? Sunshine",
      "MessageIndex": 56,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694114",
      "Title": "Port-a Cath pain? TinaLee Kicks"
    }
  ]
}