{
  "AuthorID": "Surfergirl55",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202044/profile",
  "Posts": [{
    "AuthorID": "Surfergirl55",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/202044/profile",
    "Content": "Surfergirl55 wrote: Before I was diagnosed I was concerned about certain risk factors that I had, and wondering if they would contribute to breast cancer one day. I had been very healthy all of my life, ate healthy, didn't smoke, didn't drink, exercised every day(was an avid surfer and amateur natural body builder) had low stress, took vitamins, great sleep, I think I did everything I could to be super healthy. My only bad thing was when I was younger I did spend allot of time in the sun. Then in my 50's(I am 61 now) started menopause and all the daily side effects and then when I was 53 I started HRT for 5 years. I also had an aunt on my fathers side who had breast cancer later in life, I developed dense breasts while on HRT, and never had children. Then in 2014 was diagnosed with breast cancer. So...I am wondering if everything I did when I was young to be healthy was all worth it in the end? Is there really anything you can do to prevent breast cancer? Or if it is in your DNA no matter what you do you cannot prevent it? As I look back now, being 2 years cancer free after a double mastectomy and on Anastrazole(I caught it very early, it did not go to the lymph nodes and I didn't need chemo or rads and had a low OncoTypeDX score) I am feeling like the HRT was the culprit since my cancer was estrogen fueled. So my question is, out of all you gals out there who developed breast cancer, how many of you used HRT before you were diagnosed? It is such a difficult thing to live with, even though I am cancer free, there isn't ONE DAY that goes by where I don't think about everything I went thru a dozen times a day. Guess it will never leave me in peace. Thank you all and God Bless all you brave sisters!!! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "27/05/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/844640",
    "Title": "Risk factors Surfergirl55"
  }]
}