{
  "AuthorID": "Survive",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
  "Posts": [
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Dec 16, 2008 08:33AM Survive wrote: Lynn My mother is on Taxotere.  She does 3 weeks on 1 week off.  She is on her 4th treatment and is just now starting to lose her hair.  She has not gotten sick but has felt very tired and and her body aches due to the once a month treatment of Zometa (bone drug).  The side effects she has noticed are achey body, fatigue, watery eyes and an occasional headache for a couple of days after treatments.  The fatigue and watery eyes have stayed but she is able to so the exact same things she always has with a few breaks for naps in between.  As someone mentioned earlier, if you are not on anti-depressants, you should consider talking with your Dr. about maybe getting a prescription for them.  My mom is on them and it really does help.  From what you have said about your husband, you are truly loved.  Now is the time to for you to get mad, and decide that you are not going to take this laying down and you will fight and live for many years.  You have so much to live for and with the drugs available today you have that opportunity to live a happy life with your husband.  I believe in you and your ability to get through this.  Start painting again and doing the things you love.  You deserve to be happy! As for making arrangements at the funeral home.  That is a personal choice that only you can make.  I can understand that you don't want to burden your husband with those plans but, you you never know, you could live 12 + years and by then have changed your mind on what you would like.  Just a little food for thought!  Stacey",
      "MessageIndex": 5,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725950",
      "Title": "Taxotere, word of the day LynnW Reneepals"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Dec 23, 2009 04:16PM Survive wrote: andyr1 I am so sorry that your mother has had to battle this horrible disease.  My mother passed away on July 12th of this year from Triple Neg breast cancer.  I can honestly say this whole process has been a never ending nightmare!  I applaud you for enrolling in nursing school and that you are considering oncology.  It takes a special person to work in oncology and from what I have read on your post, you sound like you would be one of those special people who is compationate enough to be able to relate to the far too many people inflicted with cancer.  I will pray for your mom with the hopes that the end of her journey is a peacefull one and that you  are able to spead quality time with her and share with her all of the wonderful things you love about her.  My family and I were able to do this with my mom and I forever cherish those conversations we shared. Keeping you in my thoughts and prayers! Stacey",
      "MessageIndex": 9,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745759",
      "Title": "my mother andyr1 Survive"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Jan 16, 2009 11:31AM Survive wrote: Stacie That is such wonderful news!  I am soooo happy for you.  I love reading posts like yours.  This is a time for celebration so I am doing a little jig in my chair for you!  Stacey ",
      "MessageIndex": 1,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727453",
      "Title": "Good Scan Results camdenandmo lovinmomma"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Survive wrote: I have not posted for some time now and when I did post it was very rare.  I logged onto the site daily and read so many posts that discussed Stage IV and Triple Negative BC as that was what my mother was diagnosed with in 2006 and had a reoccurrence in November of 2008.  Sadly, my mother Debbie passed away after a courageous 8 month battle with BC on July 12th, 2009.  She was the love of my Fathers life, best Mother ever, best Grandmother, best Friend and a wonderful person all wrapped into one.  She was surrounded by her family when she took her last breath.  All I can say is that it was a devastating time in all of our lives.  I know that some people say that being with their loved ones at the time of death can be liberating, magical, and spiritual but for me all I felt was great sadness and loss.  I felt that I needed to be with her at the time of death but the selfish part of me just wanted to beg her to hang on just for a while longer even though I knew it was time for her to go.  With that said, I want to thank all of you for all of the posts as they saddened me at times, made me laugh out loud at times but most of all made me feel like I was not alone.  I will be forever grateful for the love and support that I came away with from all of you.  God Bless and may the handy work of researchers and doctors find a cure for cancer.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737856",
      "Title": "Loss of my Mother Survive meima-Bev"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Jul 24, 2009 04:14AM Survive wrote: Thank all of you for your kind words and prayers.  I know I along with my family will have a long road ahead of us in dealing with the loss of my Mother.  I pray that all of you contine the fight and beat the cancer.  Sending warm hugs, lots of sunshine, and many prayers to you all. Stacey ",
      "MessageIndex": 5,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737856",
      "Title": "Loss of my Mother Survive meima-Bev"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Dec 10, 2008 08:08AM Survive wrote: Lisa I am sorry you did not receive the news you had hoped for.  My friends mother has brain mets and had WBR and is doing very well.  She has a zest for life which I really do think helps her battle this monster.  You can overcome this hurdle!  Have Faith!",
      "MessageIndex": 118,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724122",
      "Title": "Me, too LisaSDCA EGAL"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Survive wrote: My mother is dealing with severe depression and anxiety.  Her Onc has switched her anti-depressant and has prescribed some anit-anxiety meds.  Although as a family we know that the depression has gotten worse since being re-diagnosed with mets, we try to encourage her to get up and shower and just move around a bit.  She tends to just sit in her chair or lay in bed for days on end.  Her friends call and extend invites to go to dinner, lunch etc and for the most part she declines.  My father and I had a heart to heart with her and we were very frank to say the least.  We both told her that she expressed that she did not want to die and that she wanted to see her grandchildren grow up.  So, we told her that the point of taking the chemo treatments was to extend her life so she could enjoy the things she wanted.  But, at this point she has not enjoyed anything and is not living her life at all.  This was also the first year she ever missed one of the grandkids B-days.  Not that she was unable to due to being sick, but just because she didn't want to leave her house.  She has since felt guilty because of her decision.  I do realize that she is going through something that I can only imagine.  Nothing tastes good, her eyes water all of the time, she has no hair, she is tired, and she worries about what people think of her when she goes out in public.  She has alwasy been one to see the glass as half empty and dealing with this cancer has really taken it's toll on her.  Any ideas on how our family can give her the support and encouragement she needs in order to get her up and living life again? Stacey  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731364",
      "Title": "Anxiety and Depression Survive YHong"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Jan 16, 2009 11:12AM Survive wrote: Many hugs and prayers to Angela!",
      "MessageIndex": 15,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727439",
      "Title": "Prayers for Angela (Blessed4) Bany GracieM2007"
    },
    {
      "AuthorID": "Survive",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74693/profile",
      "Content": "Mar 30, 2009 11:53AM Survive wrote: Thanks to all of you who responded.  I suggested counseling to my father and he thinks it is a good idea as well.  Mom was admitted to the hospital on Friday due to fluid in her chest cavity and low oxygen levels.  Once we get her back and feeling better we will talk to her about seeing the counselor again.  I do think it will help.  I am hoping that now the fluid has been drained off she will have a bit more energy to get out and live a little. Thanks again!  All suggestions are appreciated. Stacey ",
      "MessageIndex": 7,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731364",
      "Title": "Anxiety and Depression Survive YHong"
    }
  ]
}