{
  "AuthorID": "Susan57Cana…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91243/profile",
  "Posts": [
    {
      "AuthorID": "Susan57Cana…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91243/profile",
      "Content": "Oct 21, 2009 08:54PM Susan57Canada wrote: Hi digid!  Good to see a Canadian on board!  I am a Canadian and live in a small town called Ancaster, located between Hamilton and Brantford.  I was diagnosed with breast cancer last year (September) and had a mastectomy a little less than 2 weeks later.  My breast cancer was determined as being Stage IIIC with a Grade of 1.  I'm quite surprised that your breast cancer has already been 'staged and graded' as usually these things aren't known until after your surgery and the tissue is sent off to the pathologist for testing and results.  Anyway, beside the point right now!  I've had my surgery, went through a little over 6 months of chemo, am now in my 5th month of Herceptin treatments (I'm \"HER2\" type as well!) with another 7 months to go!  I'm doing really great...have tons of energy so am spending much of my time in my garden getting it ready for winter....augh!!!  I've been to Hell and back but let me tell you...I am doing great!  So will you...you'll get through everything and come back as a stronger and more optimistic person and will enjoy everything that life has to offer!  Keep your spirits up...don't worry about the double \"M\"...they are only breasts and I for one thought that losing them was the worst that could happen!  Guess what...NOT having them removed is the worst that could happen.  So 'hang in there' digid...good luck and let me know how you are doing, once you're back from hospital and 'on the mend'.  Again, good luck...know that there are many of us who are thinking of you and wishing you great things in the future!  Bye for now",
      "MessageIndex": 14,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742507",
      "Title": "Send me your strength for Thursday, October 22 digid digid"
    },
    {
      "AuthorID": "Susan57Cana…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91243/profile",
      "Content": "Oct 21, 2009 09:04PM Susan57Canada wrote: Hi digid:  Me again...sorry but I made a typo regarding my \"grade\"...I'm Grade \"3\" but typed Grade 1..but hey, what's a few 'grades' between Canadian, huh...or as everyone (who isn't Canadian) says...eh!  Good luck, my prayers are with you and please know that the Dble \"M\" isn't half as bad as what I thought it was going to be...in fact, at the end of the day....it really was a pretty simple procedure and since I couldn't have reconstruction surgery at the same time (as was the case with another friend of mine) as my Dr. told me I had to wait 2 years due to the extent of my breast cancer, etc... I thought it was going to be the 'end of the world'.  but guess what...I'm so used to no having them that I very much doubt I'll ever have the reconstruction done, now!  See...amazing what a year will do!  Enough of my rambling...good luck tomorrow...take good care of yourself and keep in touch...let us know how you're doing!",
      "MessageIndex": 15,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742507",
      "Title": "Send me your strength for Thursday, October 22 digid digid"
    }
  ]
}