{
  "AuthorID": "SusanaQ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
  "Posts": [
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Oct 12, 2016 09:03PM SusanaQ wrote: today was my supposed fourth and final chemo. MO surprised me saying she thinks I can do two more. Meltdown, recovery, accepting.i asked if I could see how I feel after 5 and she said sure. This delays the plan by six weeks. So radiation now won't start till January. And we marchon.",
      "MessageIndex": 1050,
      "PostDate": "12/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Sep 26, 2016 02:58PM SusanaQ wrote: Hi All, First post here. Started CT 8/10/16; had 3rd infusion last Wednesday 9/21-our 26th wedding anniversary :( Am definitely struggling more this round, orifice sores, bone pain comes in jolts, intense heartburn, and fatigue. Have one more infusion to go on 10/12/16. I'm discouraged today. Unable to get out for walk. Am hopeful for tomorrow but just want for today to be over already. Feeling left out by friends which I understand as who wants to invite and be around a sick person to go out for couples Sunday lunch? I know this too shall pass but not progressing past today's pity party. Whaaaaahh",
      "MessageIndex": 908,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Sep 18, 2017 07:00PM - edited Sep 18, 2017 07:02PM by SusanaQ I'm to share my experience and perspective and want to be clear that I get how personal this decision is and my heart goes out to you as you grapple with your diagnosis and circumstances. I was diagnosed with DCIS in May of 2002 and after 2 lumpectomies failed to get clear margins and the doc suggested a third lumpectomy, I said \"F**k it, I want a mastectomy and while your at it, make it a double\". They refused the double but I did get the a left mastectomy. Part of my decision was wanting to be done with it all and I was told if I had a mastectomy i could forego the radiation. I was a young 38 year old working mom and I wanted to get back to my life and be done with it. I was pleased with my decision. Fast forward to summer of 2016 when I was diagnosed with a new cancer in my right breast, this time Stage 2 with lymph node involvement....surgery, chemo, radiation, Tamoxifen. My only regret is not getting a bilateral mastectomy in 2002. And I'm just plain lucky it wasn't Stage 3/4.",
      "MessageIndex": 15,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858554",
      "Title": "Radiation vs Mastectomy cece424 pollicakes"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Nov 30, 2017 08:03AM - edited Nov 30, 2017 08:07AM by SusanaQ",
      "MessageIndex": 5,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/859622",
      "Title": "Only 3 nodes removed in auxiliary dissection GPH Legomaster225"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Nov 30, 2017 08:04AM SusanaQ wrote: I had similar situation after mastectomy....surgeon removed only sentinel node and it had a macromet (>2mm) and two nodes in the breast were negative so I was staged 1/3. However, I was upset she didn't take a few more nodes to determine reach of the spread, etc. They assured me this wouldn't change my treatment or outcome, and the risk of impairment of my arm from lymphadema would be greatly reduced. I still wonder if my Stage was worse than my actual diagnosis, what if it had spread to or 5+ nodes? I'll never know, I just have to trust my docs and the data. There is a study that is used for this treatment decision and the study is called The AMAROS trial.",
      "MessageIndex": 6,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/859622",
      "Title": "Only 3 nodes removed in auxiliary dissection GPH Legomaster225"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Jul 21, 2017 07:53PM SusanaQ wrote: Today I am a mess. I decided to go to my internist yesterday because of stomach pain likely caused by taking too much Advil. While there I mentioned a dry cough which doc said is likely allergies and she listened to my lungs and ordered a chest X-ray. She called last evening to say I have pneumonia. WTF?? I have no cough, no sputum, my lungs are clear, I have no fever, chills or elevated WBC's. I'm tired but I've been tired since I started the chemo last August. Of course it's now Friday nobody is returning my calls and I'm a basket case. Does this sound like unfolding of lung involvement?",
      "MessageIndex": 4143,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Jul 22, 2017 01:27AM SusanaQ wrote: Dear Chrissy, ❤️❤️❤️ Just what I needed to read on this Friday eve. Thanks. Susan",
      "MessageIndex": 4145,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "SusanaQ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238606/profile",
      "Content": "Feb 2, 2017 09:37PM SusanaQ wrote: hi shanna, I'm in the same boat regarding not sure whether to have just an oophrectomy or hysterectomy also. Consulting with surgeon next week.",
      "MessageIndex": 18,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/852058",
      "Title": "starting rads feb 2017 annoyingboob misslil"
    }
  ]
}