{
  "AuthorID": "SusanFL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82969/profile",
  "Posts": [
    {
      "AuthorID": "SusanFL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82969/profile",
      "Content": "Aug 26, 2009 10:28AM SusanFL wrote: PauldingMom - That is so cool that you will be speaking at your daughter's college.  Speaking in front of a large audience, along with skydiving, are on my bucket list....LOL!  I don't know why, I'm really not a shy person, but I have always been easily intimidated by authority figures and large groups focused directly on me.  Anyway, like you, cancer has given me a different outlook on life, and I'm a lot braver.  Self-examination and prevention are great topics.  I had a normal mammogram eight months before I felt a lump in my left breast, so self-examination is very, very important!  I would advise anyone with a family history of breast cancer not to rely solely on a mammogram.  Perhaps a yearly ultrasound or MRI in addition to a mammogram. Good luck, and take care!",
      "MessageIndex": 1135,
      "PostDate": "26/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "SusanFL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82969/profile",
      "Content": "Aug 26, 2009 11:00AM SusanFL wrote: Dazed and Confused It's great to see you here!  And Kudos to all those husbands out there who are so involved in the care and treatment of their women.  I don't know what I would do without my husband.  He has been so supportive and helpful in every way.  He even takes me for my chemo and sits around and joins in the conversations until I make him leave...LOL!  Of course, that's the way it should be but some men just can't handle it, and that is a real shame. I still have my hair, but I have tiny sores on my head.  My husband gets them, too, and says it's from sweating.  I will try the antibacterial soap.  I don't know why I didn't think of it before because I have been using Dial antibacterial soap for bathing.  You're right, it's probably  because your wife wears wigs for too many hours at a time?  Make sure the wig allows for circulation, and try wearing a cotton cap or liner that breathes.  Good luck, and take care!",
      "MessageIndex": 1136,
      "PostDate": "26/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735959",
      "Title": "Starting Chemo in July 2009 PauldingMom jacee"
    },
    {
      "AuthorID": "SusanFL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/82969/profile",
      "Content": "Aug 1, 2009 04:52PM SusanFL wrote: Ang, I felt so bad when I read your post.  It is so important to have caring and skillful medical providers.  I was lucky that I already had a wonderful primary physician who referred me to a great surgeon and oncologist, who were all in the same complex that was associated with the hospital district that I was in.  My sister works for the hospital district and said that all of my doctors came highly recommended.  First of all, annual mammo never detected my tumor, I felt it myself 8 months after mammo.  I then had a second mammo and ultrasound, followed by ultrasound-guided biopsy.  It was at this point that I was referred to a surgeon. My surgeon ordered a breast MRI.  He took the opposite approach as yours.  He was a bit matter-of-fact, but he was always optimistic.  At first, we were hoping for a small non-invasive tumor, which would have meant lumpectomy with SNB, followed by mammosite rads, and no chemo.  Unfortunately, SNB revealed positive node, so mammosite was out of the question.  Surgeon performed lumpectomy and removed 14 nodes.  I was then referred to the oncologist. My onc ordered PET scan, which was negative.  Then onc ordered Oncotype, with the hopes that I would be a low risk and not require chemo.   I am receiving chemo now. The point is, all of my doctors were positive and optimistic, and very much aware of how difficult the whole process is.  Even though they were always positive, I was well informed and knew there was a possibility that the course of treatment could change, depending on the test results.  They have all tried so hard to help me get through it.  I can't imagine having doctors as callous and uncaring as yours.  As far as your treatment, from what I hear it is more difficult for a woman with small breasts.  I have small breasts and one concern the surgeon had was that the tumor might be too close to the surface to get clear margins.  I only had one small tumor (1.6cm).  A good friend of mine just happened to go through all this just before me.  In fact, after I heard that she felt a small lump, I found mine.  She was diagnosed with stage 0 DCIS, but they were also in three places.  She also had small breasts.  She had a bilateral mx with expanders.  So, even though it seems extreme for such a low stage cancer, that is not the only criteria in determining whether mx is needed.  The good thing about her is she won't need chemo or radiation.  She will have recon later. I wish you well, and I hope you find the right doctors and treatment for you. ",
      "MessageIndex": 14,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/738000",
      "Title": "Feel like I am being jerked around... Ang7 SJW1"
    }
  ]
}