{
  "AuthorID": "Susanna6539",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279205/profile",
  "Posts": [
    {
      "AuthorID": "Susanna6539",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279205/profile",
      "Content": "Susanna6539 wrote: Hi, I'm 26 year old with two boys aged 5 and 4. A year ago my lymph nodes started to swell around my groin I was admitted to hospital but sent home with no explanation. I lost a lot of weight I am 5ft6 and dropped to 7stone8. I put things to the back of my mind and put weight-loss down to being a working mum to two crazies haha. Anyway four weeks ago I got a lump on my breast I went to the doctor who said it could be a cyst but not sure so gave me an antibiotic and an appointment to come back last week. At the appointment she said she felt the lump had grew and she wanted to send me for a screening and I would get a letter for an appointment. Also said she was sending me to hemotology for a biopsy/scan as the nodes have got bigger and more from last year. That's one week today.. I feel the lump is bigger I thought I was imagining it or being paranoid but my husband also thinks it's grew. How long should I wait for the letter or what's the procedure? Feel like I'm being passed pillar to post. Just looking for some advice as I'm very worried . Thanks Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866922",
      "Title": "Waiting on biopsy and breast screening. Susanna6539 Susanna6539"
    },
    {
      "AuthorID": "Susanna6539…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/279205/profile",
      "Content": "Aug 31, 2018 01:27AM Susanna6539 wrote: hey hun thank you for replying. I really hope everything comes back clear for you fingers and toes crossed. I'm sure it must be awful knowing you have to wait another two weeks. I think it'S worse the not knowing and waiting. It's nice to be able to talk to someone with the same circumstances, my husband is sick listening to me lol. Do you mind me asking what your lump is like? I feel like mine is getting longer but scared to phone my doctor back incase I'm just being paranoid, hopefully IL get the appointment through soon X ",
      "MessageIndex": 2,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866922",
      "Title": "Waiting on biopsy and breast screening. Susanna6539 Susanna6539"
    }
  ]
}