{
  "AuthorID": "susant",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78678/profile",
  "Posts": [
    {
      "AuthorID": "susant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78678/profile",
      "Content": "Jan 31, 2009 12:03PM susant wrote: Thank you all soooo much!!!   I am so happy I found this site.  Sometimes you just need to talk to someone who has been throught it. Thank you again :)",
      "MessageIndex": 5,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/728268",
      "Title": "Going for a biopsy susant dlb823"
    },
    {
      "AuthorID": "susant",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/78678/profile",
      "Content": "susant wrote: Hi, I'm new here.  I just wanted to find someone to talk to regarding microcalcifications.   I was just diagnosed with them in my right breast and was told to get a needle biopsy.  I'm really scared because I just have a feeling that I'm going to get bad news.    Everything that I''ve read points to these things being cancerous.  I'm also very mad at myself for not taking action sooner.  Six months ago I had a mammogram and was told that I would need another one in six months to keep an eye on some these \"calcifications\".  Now that I've returned in January it seems they are more prominent and should be further evaluated with a biopsy.  Maybe I should have questioned the \"waiting period\".   Also, ever since I've had this last mammo my right breast feels very sore.  Has anyone else ever had this feeling? I've scheduled my biopsy and am really scared.  I'm scared of the biopsy and I'm also scared of the results.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/728268",
      "Title": "Going for a biopsy susant dlb823"
    }
  ]
}