{
  "AuthorID": "Susannina",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192759/profile",
  "Posts": [
    {
      "AuthorID": "Susannina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192759/profile",
      "Content": "Susannina wrote: I had an allergic reaction to Emend during my first infusion (felt hot, flushed, and tight in the chest), so they gave me only the other one (Aloxy or Zofran), plus Compazine to bring home. I had one bout of vomiting that time, but it passed quickly and the rest wasn't too bad. I just had my second infusion and assumed that adjustments would be made. They gave me the option of Emend in pill form (though there was still the chance of a reaction) and suggested that I take an Ativan before going to sleep. I followed these instructions (skipping the Emend) and had an even worse time of it: 3 bouts of vomiting, and a slightly longer recovery. Has anyone else had this problem with Emend? I can't bear the thought that the nausea will get worse with each go (only two left, thank goodness). I'm also thinking of trying acupuncture. Thanks for any insight you can give! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815307",
      "Title": "Nausea Susannina Susannina"
    },
    {
      "AuthorID": "Susannina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192759/profile",
      "Content": "Dec 5, 2013 12:45PM Susannina wrote: That's so great to think that they could make a change and help the nausea. I was feeling destined to be the chemo patient who throws up a lot. Maybe the problem is that my oncologist was not there during my second infusion (I spoke with a nurse instead) because it was the day after Thanksgiving. Communication has not been great. Thanks for your reply.",
      "MessageIndex": 4,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815307",
      "Title": "Nausea Susannina Susannina"
    },
    {
      "AuthorID": "Susannina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192759/profile",
      "Content": "Dec 5, 2013 12:43PM Susannina wrote: Actually, I had a yogurt drink and another snack an hour or so before getting the anti-nausea med through the IV. It's so hard to know whether to eat or not, how much, etc. The nurse during the infusion told me to keep eating all day, not to skip meals. I had skipped dinner the day of the first infusion (vomited once), so I ate dinner (some chicken with rice soup) this time, and it was worse. I'm confused.",
      "MessageIndex": 3,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815307",
      "Title": "Nausea Susannina Susannina"
    }
  ]
}