{
  "AuthorID": "susangerman…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
  "Posts": [
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Jan 19, 2012 03:46AM susangermany wrote: I am so envy to hear everyone who responds well to neoadjuvant. I finished 3 of 6 TAC for neoadjuvant. The ultrasound control found the tumor size increased from 2.2 to 2.8cm. I can't tell any change by touching it. The doctor wasn't sure and I had MRI done and waiting for the results to come tomorrow. I am very scared now. I am facing the decision if the tumor is still growing under chemo. The doctor mentioned changing chemo regimens.  Please give me some suggestion.",
      "MessageIndex": 43,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769047",
      "Title": "neoadjuvant chemotherapy and staging ReadingMama Shari0707"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Jan 20, 2012 07:32AM susangermany wrote:",
      "MessageIndex": 45,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/769047",
      "Title": "neoadjuvant chemotherapy and staging ReadingMama Shari0707"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Mar 21, 2012 05:24PM susangermany wrote: I also did 6 x TAC and finished the final round on March 7th. The operation will be likely next week. I will talk with the doctor next Monday for the surgery plan.  But since I didn't have node biopsy before chemo, she thinks the SNB during surgery is not sufficient indication for the other nodes' involvement. They will have to remove all the level 1 and level 2 lymph nodes. I am really shocked by that. Can I say that my doctor made a mistake by doing chemo without SNB? Did everyone here all have done SNB before chemo starting?",
      "MessageIndex": 34,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/781526",
      "Title": "Anyone else doing TAC neoadjuvant chemotherapy lisa224 GeorgiaRai"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Dec 10, 2011 01:53AM susangermany wrote: Hi Naan, I have my first TAC chemo on 11.23 and my hair is starting to fall yesterday. I am a person who never care too much about hair. But when I saw my hair falling crazy in the shower, I was very sad and almost crying. I don't want to shave them. But no idea how long it will take to finish. It is also very messy in my house and my hair is everywhere. Is there any advise to avoid the mess or an easy way to clean up the mess?",
      "MessageIndex": 327,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Dec 10, 2011 08:12AM susangermany wrote: Julie, thank you for your advise and encouragement. I believe you are right about it. I will have to shave it. Now I know how much my hair means to me, until I lose it. ",
      "MessageIndex": 329,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Dec 2, 2011 01:35AM - edited Dec 2, 2011 01:39AM by susangermany Thank you, Tammy, for your advice about not overdone exercise. 9 days after the first TAC chemo, I feel better and better. Had my first blood control on 7th day and got call from doctor yesterday and told me the white blood cell was very low. They'd like to test again. The second test result has a big jump from 1.75/nl to 6.92/nl, which is even higher than my white blood cell level before chemo. I couldn't understand, only one day how it can change this rapidly and dramatically. I had Neulasta shot 24h after chemo. I wonder if the Neulasta takes effect only after 5 days? Well, the bone and joint pain also disappeared after 5 days. I think exercise helps.  I had my port installed on Nov. 18th. Now I can move my arm freely, but still feels a little uncomfortable. The cut is recovering well, but feels still a little pain or itch from time to time. I guess it takes time. I have been feeling hungry all the time. But I tried not eat too much at once. After 9 days of the first chemo, I feel more hopeful and less scared and I believe everyone here can get it done and well done. Thank you everyone for the company in this difficult time! ",
      "MessageIndex": 148,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "susangerman…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140398/profile",
      "Content": "Nov 30, 2011 02:21PM susangermany wrote: Hello everyone, I am new here. I live in Germany without speaking German. I really look forward to having some company here. I don't have surgery yet and had my first of the 6 TAC secions (3 weeks between each section) 1 week ago (Nov. 23rd). During the first 3 days, I felt really weak and tired. But didn't have nausea, vomiting or mouth sore. I don't sleep very well and wake up every a few hours. In general, it is better than I expected. Today, I had nose bleeding twice. But it stopped within 10 minutes. I tried to walk 1 hour per day when there is the sun or do a little streching at home. I am curious when my hair is going to fall.      ",
      "MessageIndex": 119,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    }
  ]
}