{
  "AuthorID": "susand",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
  "Posts": [
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Feb 9, 2011 05:13AM susand wrote: I am confused about the Green Tea issue that InTwoPlaces spoke of?  My oncologist highly recommends green tea and even wants me to use supplements of it at well.  I have never heard of it being bad for cancer before.",
      "MessageIndex": 14,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764523",
      "Title": "grapefruit nikola shooshoo23"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Feb 9, 2011 01:27PM susand wrote: Thanks for clearing up the green tea issue!  I did stop drinking it completely while I was receiveing chemo.  As soon as I was finished I was told I could drink it again.  I am ER+and PR+ but my oncologist does encourage me to drink it.  No grapefruit for me anymore though.",
      "MessageIndex": 20,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/764523",
      "Title": "grapefruit nikola shooshoo23"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 5, 2010 05:52PM - edited Nov 6, 2010 06:31AM by susand Hi Sandy,  You are right not to be concerned about the surgery.  Compared to everything else we go through a laproscopic oophorectomy is relatively easy.  I was diagnosed at 42.  After sugery and Chemo I started on Tamox.  I have 2 different oncologist.  One local and one that I visit for consultations in New York City. Both thought it would be good for me to shut down my ovaries either with a Lupron shot or with an ooph.  The onc that recommended the shot said that it was reversable and if I couldnt stand the quality of life issues I could just stop taking them.  The other onc said that if you were going to shut down the ovaries why not just remove them.  She felt that you went throught abrupt menopause either way but with the ooph you did not have to take extra medication and you didnt have to worry about ovarian cancer (which she said is hard to detect).  I followed her advice and had the ooph thinking \"what is quality of life if you dont have it\".  It has just been  a year and I have to say that the side effects have been much more than I bargained for.  I did a lot of research before I chose the ooph and it seemed like the right choice for me.  I do want to also say that although sometimes I regret my decision and wish I could reverse it...  deep down I know it was my best option.  Instant menopause was more difficult for me than I imagined. I thought it would be similar to the \"chemopause\" I had experienced but it has been more extreme.  I do think a lot of it is also the Arimidex I was switched to after the proceedure.  The night sweats were much more intense but have dropped off significantly (thank goodness!)  There were side effects that no one really explained to me though.  The first and most upsetting is vaginal atrophy.  Without estrogen some women really loose a lot of their moisture and ph balance down there.  My sex life went from GREAT to painful very quickly.  This in turn led to frequent bladder infections.  I really didnt anticipate this...at least so soon.  Prior to surgery I thought \"whats a bladder infection every once and a while\", but as I back away from my children to try and get to the bathroom I realize how much it sucks!  I also get earaches.  Never once did any liturature mention that was somthing that could happen due to estrogen deprivation.  Okay...with all that said (didnt want to be a downer I just wish someone would have been really frank with me), If I could go back I think I still would have done things the same way.  I will do whatever it takes to stay with my children and husband.  Yes, some of the side effects stink but at least I have them and I am still here.  Also, many other women with oophs have had A LOT LESS problems than me.  I went to a Sexual Health Specialist for Cancer patients who provided me great information on how to get back my sex life.  Things are getting much better and I am working on the lack of labido.  I am doing everything naturally since none of my doctors (except my gyn) thinks a  low dose vaginal estrogen cream is a good idea for me.  I manage the UTI's with lots of different methods and they too are less frequent. It has just been a year now.  the first 4 months after my ooph were great.  Then in an instant side effects poped up (when I was switched from tamox to arimidex),  but I finally feel like I am getting a new baseline of normal and managing things well. There is so much to think about with this disease.  I hate that I just turned 44 and feel like I have aged a decade since my diagnosis, but I am going to push through this and do whatever is in my power and whatever it takes to try and see my chilren grow up.  In the meantime I realize it will be hard work to maintain my quaility of life (exerciese, diet, better sleep, bone health, using 'moisturizer' in places I never imagined!)... but it is do-able and it is worth it.  Take your time with your decision. Best of luck with it.",
      "MessageIndex": 3,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760231",
      "Title": "Instant Surgical Menopause SandyAust susand"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 16, 2010 07:07AM susand wrote: Hi Girls, I feel silly that I dont know anything about Zometa.  I always ask my Oncologist if there is anything new out there for me.  I actually start my 3 mo's appt by asking my oncologist \"Is there a cure yet?\"  she has responded \"You might be cured...as far as we know\". Not a good enough answer for me. Anyway, she has never mentioned Zometa.  I have also had consultations at Memorial Slone Kettering and it hasnt been mentioned.  I know that I have osteopenia from my bone scan and that I am only 44.  My questions for you girls getting it are: Do you know if it is still effective if you are 2 years out from chemo? and Do you know if it is effective in postmenopausal women?  I was premenomausal until I opted on an oophorectomy last year.  If you know any answers I would love to hear.  Meanwhile I am gathering up info on Zometa to bring to my next oncology appt in a few week.  Thanks!  Susan",
      "MessageIndex": 24,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759924",
      "Title": "Early stage BC and Zometa kathylev weety"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 16, 2010 07:36AM susand wrote:",
      "MessageIndex": 26,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759924",
      "Title": "Early stage BC and Zometa kathylev weety"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 17, 2010 07:35PM susand wrote: Kathy, thanks for the information.  I am going to ask my oncologist.  I am just curious why it was never brought up to me.  I hope you are feeling better today.  Susan",
      "MessageIndex": 33,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759924",
      "Title": "Early stage BC and Zometa kathylev weety"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 15, 2010 08:33PM susand wrote: SAMayoFl, you will get through it.  BC sucks and it can take so much away from us if we let it,  especially when you are going through chemo. But it really does get better.  As far as intimacy goes...who cares if you are loosing hair in patches down there, thats all the rage now anyway!  Seriously, there is a book called \"Intimacy After Cancer\" .  I think is great.  It was also really helpful for me to see the Sexual Health Doctor because It made me realize how many other women were going through similar issues.  I have also felt very alone when it comes to BC.  I have wonderful friends but they really dont understand what I am going through.  I am very thankful for this board.  Things really do get better...much better!",
      "MessageIndex": 80,
      "PostDate": "15/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759583",
      "Title": "Chemo Brain Ok, but chemo vagina? Help!!!! Shanagirl BlondiShanagirl"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Jan 20, 2011 08:05PM susand wrote: carrolmcc: Please check out the tread that shannagirl suggested called \"chemo brain ok, but chemo vagina help!!!\" it is in the stage 3 forum.  Also check out the \"Mojo\" Thread on the Moving beyond cancer forum.  They have a lot of suggestions.  dont give up.  My gyn suggested estriol cream to me...when I asked my Oncologist and Primary they both said \"Absolutely NOT\"! So I am doing the best I can with exercises (kegels, dialator) and moisturizers.  Things have gotten much better.  Please check out the other threads they have a lot of information.  With a little work it gets a lot better!",
      "MessageIndex": 5,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761444",
      "Title": "Sex After BC??? pixelpup lago"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 11, 2010 12:06PM susand wrote: Shannagirl: Yes I am going through the same thing.  Instant menapause has really rocked my sex life (It used to be amazing).  Sex was painful and desire was gone. Plus I was getting UTI's after sex.  My Gyn told me I needed to use an estriol cream.  As he so nicely put it \"You have vaginal atrophy, so although when I look at you i see a 43 year old woman...your insides are one of a 65 year old\". My eyes welled up with tears right there and then.  So I filled the prescribtion but never used it.  My Oncologist and primary's reaction was that I should absolutely not use the cream (I am very ER/PR +)...so back to square one.  I found a sexual health doctors for cancer patients in NYC and took a long train ride down.  It was great.  She told me that yes, I was going to have to find a new baseline normal but when I did it would be a good one.  She said that it might never be what it was but would be good and satisfying.  She said that most womens body's get to this point but it happens so gradually they dont realize it as much. The positive thing was that since we cx patients get here so instantly we notice how great the change is and take steps to correct it.  So she gave me a whole program on how to stop vaginal atrophy from getting worse and improve it, and how to make sex enjoyable.  I did get a no to testosterone and progesterone creams.  She said that testosterone can convert to estrogen and cause liver problems and there was no magic cream...just hard work.  she covered self image, excercises to do with your partner (senual but not sex) to find new area's of sensation, sleep, diet, exercise and nutrition.  She thought the fact that I took a prophylactic dose of macrobid after sex was a good idea for preventing UTI's. And yes she addressed the atrophy.  She suggested daily vaginal moisturizer (replens, vit E or KY Liquidbeads) for moisture purposes only, Water based lubricants for sex, and using a vaginal dialator or smooth plastic vibrator at least every other day.  One of the most important things she emphesized was Kegels.  Regular ones for overall pelvic health and special ones geared specifically towards sexual health.  Apparently doing kegals to exhastion of the muscle BEFORE sex relaxes the muscles and opens the vagina to help stop pain. There were also specific kegals to do with the vibrator/dialator that help you relax and then insert it further (to stretch the tissue, restore elasticity, and bring blood supply).  I hope this information is not too graphic or too long.  It has really been helping.  The most incouraging thing was that she was very optomistic that I could achieve everything without estrogen creams and said that for those who really put the effort into thier sexual health they actually can have better sex lives than the general population and that when pain starts getting replaced with pleasure you get some libido back. Also, I found a website called \"A Womans Touch\".  It has a 'vaginal renewal' program similar and lots of information for sexual health for women that have been effected by cancer/early menapause.  Thank you to all you ladies who have posted.  I was so happy to find this thread and love reading everyones suggestion.",
      "MessageIndex": 75,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759583",
      "Title": "Chemo Brain Ok, but chemo vagina? Help!!!! Shanagirl BlondiShanagirl"
    },
    {
      "AuthorID": "susand",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84129/profile",
      "Content": "Nov 10, 2010 10:19AM susand wrote: Hey there, I never found this other mojo thread before.  I wish I had time to check it out.  Deenah, you can buy vit E suppositories.  I order them from amazon.  They are called Carlson's Key E suppositories.  They are not expensive and work well.  I went to a Sexual Health Doctor at MSKCC and she said you can also insert the vitiamin E gelcaps just make sure to prick a small hole in it with a pin first so that it can absorb.",
      "MessageIndex": 71,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/759583",
      "Title": "Chemo Brain Ok, but chemo vagina? Help!!!! Shanagirl BlondiShanagirl"
    }
  ]
}