{
  "AuthorID": "susanella",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
  "Posts": [
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Sep 27, 2011 02:23PM susanella wrote: Hi,  I was just diagnosed with invasive ductile carcinoma in the right breast.  I'm still in shock.  I live on Long Island and would welcome recommendations for a top surgeon in NYC or Long Island.  I'm really scared.  I have no family history so I have no one to get advice from. Thanks.",
      "MessageIndex": 686,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Sep 27, 2011 06:24PM susanella wrote: Hi Rockym or whoever else is out there,  Thanks for your support.  I am so confused and scared.  The reading is overwhelming.  I got copies of my mammo and ultrasound films and reports and will be picking up the core biopsy path report and slides later this week.  The RO told me that a surgeon will probably want an MRI first.  I called 2 surgoens and made appointments for a first and second opinion within the next 2 weeks.  Question:  Pardon my ignorance, when is it determined if and how many lymph nodes may be involved?  Is this in the core biopsy path report or only after MRI or only after surgery?  Thanks.",
      "MessageIndex": 688,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Jun 15, 2017 05:40PM susanella wrote: Hi, ' m a 5 year survivor of triple negative BC. I had dose dense ACT chemo followed by rads. I had acute vertigo 2 years post treatment that landed me in the ICU for 3 days. Then 3 years later, this past April, I had another acute vertigo attack with 4 days of hospitalization. Both times all brain CT and MRIs were negative. After the second attack, it took me about 6 weeks to walk without a walker. I still don't feel totally normal. Dx was acute vestibular neuritis. I never had inner ear problems or vertigo before BC treatment. Since I was never on carboplatin or tamoxifen, etc., I suspect the ACT chemo permanently compromised my immune system and or damaged the nerves in my inner ear, making me prone to acute vertigo. I found a 2005 NIH study that mentioned that BC patients report what appears to be a higher incidence of vertigo. Vertigo may be a latent effect of chemo that has to be studied more. I've seen my MO, neurologists, and ENT doctors. The problem I've encountered is that all of the doctors are so specialized that it's hard to find someone who knows if treatment in one area (MO chemo for BC) resulted in an acute problem in another area (ENT vertigo). If anyone knows of any other studies linking BC treatment to acute vertigo (vestibular disorders), please post the information. Thanks. Susanella, NY 2011 -- DX TNBC; rt lumpectomy 1.9cm; micromets; grade 3; 1 SN, 1 IM gland, Stage IIA; re-excision - clear margins; ACT chemo; 30 rads; 2012 - UC: total hysterectomy, 0 lymphs; 2014 - acute vertigo; 2015 -- DX LCIS left; BDMX; Bilateral DIEP flat reconstruction; 2017 - acute vertigo - brain CT & MRI neg., bone scan neg.",
      "MessageIndex": 8,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/855950",
      "Title": "Carboplatin /Taxol and Vertigo Sam0623 susanella"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Oct 6, 2011 04:13AM susanella wrote: Hi Ladies, I was just dxed with IDC last Tuesday and am scheduled for my surgery on 10/13, next Wed.  It was supposed to be a rt lumpectomy but the MRI showed other suspicious areas in rt breast and in left.  I decided I was a bmx.  I am 57 and still have extremely dense breast tissue and fibrosystic disease. The drs. could hardly see anything on my mammo films. I was told I need chemo for 4 months because the tumor is almost 2 cm and I'm ER-/PR-, HER2 equivocal (sent for FISH).  I am terrified. I would like reconstruction and am open to suggestions.  I am very new at this.  I had prior back surgery so they can't use my stomach or back muscles.  Any info and support would be appreciated. Susanella -- Long Island, NY",
      "MessageIndex": 522,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/774273",
      "Title": "Any October 2011 Surgeries out there want to wait together? gamergirl GrandmaV"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Nov 28, 2011 02:31PM susanella wrote: Hi, I am joining the Dec. 2011 group.  I was dxed with IDC and DCIS on 9/26, had a right lumpectomy on 10/12, and a re-excision with clear margins on 10/28.  I am Stage IIa with 1/3 nodes with 1mm microscopic.  I will be getting dose dense ACT.  I heard a lot of you plan on continuing to work.  I also plan to work.  I work from home but have very deadline intensive work.  I am trying to cut back.  Is it realistic to think that we can work?  Does someone have a master list of OTC meds and aids to help us through this?  Susanella",
      "MessageIndex": 91,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Oct 4, 2011 08:30PM susanella wrote:",
      "MessageIndex": 1,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775856",
      "Title": "October 2011 Chemo Group Seabrook Timbuktu"
    },
    {
      "AuthorID": "susanella",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/136843/profile",
      "Content": "Nov 28, 2011 02:32PM susanella wrote: As a follow up, I am starting chemo this Wednesday, Nov. 30.  I am terrified. Susanella",
      "MessageIndex": 92,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    }
  ]
}