{
  "AuthorID": "SusieQue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
  "Posts": [
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 25, 2009 11:07AM SusieQue wrote: Oh Kimberly, my prayers are with you.  Only us know how you must feel.  God says, does worrying ever add another hour to your life?  Please tell your husband.  i decided when i was diagnosed, i would not cry in front of my kids, (they are grown, but still), but let everything out with my husband.  it made mine really strong, and i think he has grown from this.  something to think about, hang in there.",
      "MessageIndex": 3,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731313",
      "Title": "I just found another lump in my breast. lovinmomma Makratz"
    },
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 21, 2009 11:15AM SusieQue wrote: i had a bilateral mastectomy jan 7 2009.  i wear a sports bra which helps tremendously because it is made of soft material, get one with a wide width.  they kind of hold you in, what's left, and i wear them because i am still filling with fluid.  i even wear one to bed sometimes.  i also did pt and i find if you don't stretch yourself out daily, you will get stiff.  i am lucky because i see my surgeon every week to be drained and i can address any concerns with him.  but i have no hard places or nothing weird underneath my incisions, but i do still have numbness and am swollen under my armpit that did have nodes removed.  ps i still keep vicoden around for the pain at times.",
      "MessageIndex": 7,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730685",
      "Title": "I need a Bilateral Mastectomy mentor JL2Knit Red91RU"
    },
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 26, 2009 07:56PM SusieQue wrote: i have numbing on my right leg and tingling, that is the side of the node removal.  How about that chemo brain?  going into a room and cant remember why you are there?!!  Also, constant runny nose.",
      "MessageIndex": 3,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731431",
      "Title": "What's your wierdest side effect ann-idiot ann-idiot"
    },
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 22, 2009 04:09PM SusieQue wrote: Does anyone have burning eyes?  It has just hit me a couple days ago.  any remedies?",
      "MessageIndex": 1624,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 26, 2009 11:55AM SusieQue wrote: I was in for 2 days, and so ready to go home.  i was really lucky because my two daughters age 29 and 30 came home for 10 days to take care of mommy.  i needed help for a good 3-4 days and then after that felt better.  i think it depends on how much node damage they find as far as the pain.  don't be afaid to stretch your arms a bit, your PT will help with that.  i took 6 weeks off work for healing physically and emotionally.  i say emphatically for the year after bc its all about you!  you must put your body and mind first, or you will be no help to anyone else.  don't you guys agree?",
      "MessageIndex": 11,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731379",
      "Title": "How long was your Hosp stay for BLMas LynnVA NancyD"
    },
    {
      "AuthorID": "SusieQue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80974/profile",
      "Content": "Mar 30, 2009 10:26PM SusieQue wrote: TCGgal -  I took pictures of mine the day before surgery!!  i was kinda proud of them, had liked them all my life, hubby too.  after surgery, when i went into the bathroom to shower, i thought to myself, i need to see myself as God sees me.  i looked in the mirror, and thought i looked beautiful!  Hope this helps!!  We are all with you.",
      "MessageIndex": 19,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731566",
      "Title": "OMG-it hit me today-HARD! TCGGal faithandprayers"
    }
  ]
}