{
  "AuthorID": "susicaldy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241866/profile",
  "Posts": [
    {
      "AuthorID": "susicaldy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241866/profile",
      "Content": "Nov 2, 2016 05:59AM susicaldy wrote: Hello, I started Chemo 3 weeks ago. I go in every 2 weeks for 2 months and then every week after that thru April. Surgery was suggested last due to fear of lymphedema. I really wanted to continue working but that did not happen since I work at a grocery store. Who was I kidding right?! I cut my hair this past Sunday because it made me cry every time my long hair fell off. I feel sick most days and start to feel much better closer to the next treatment and the cycle begins!! I try to stay positive since I have an 11 year old daughter and you know, life goes on right?",
      "MessageIndex": 78,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    },
    {
      "AuthorID": "susicaldy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/241866/profile",
      "Content": "Nov 7, 2016 06:04AM susicaldy wrote: Hello Nfullblume, Thank you guys for the welcome! Currently I am on the medications I took before chemo. I was diagnose with fibromyalgia about 8 months ago but now I am wondering if it was symptoms of cancer. I will go see the rheumatologist later on this month and will have some serious questions for her. I take cymbalta and lyrica along with thyroid and blood pressure meds. I started to really loose my hair after the 2nd treatment so that Sunday I went to the salon and had it cut off. A week after I asked my husband to shave it off so now I completely bald!The hair all over my house, bed and clothes was driving me bananas! I am not bothered by it anymore. I have come to accept it. The woman at the salon said she has cancer survivors who's hair grew back totally different than what they had before. I'm hoping my grows back sandy gray! LOL I know I'm young but I love gray hair. Chemo has not made me too sick. Only nausea and sooo much weakness a few days after treatment. My aunt says I am strong and this is why but I think is just different for everyone. I crave so many foods. I cooked something that I really crave but then it doesn't taste good when I eat. Smells drive me crazy! Javamama, stay positive! It is super scary at 1st with so much info. I remember I was OK with all the info I was getting until I went to see the breast surgeon and her nurse handed me a binder. I had this overwhelming feeling and started to tear up. It gets better Javamama. I promise! Stay positive and like it was mentioned, take up a hobby. Keep you mind occupied with other things. Life goes on right!!!",
      "MessageIndex": 169,
      "PostDate": "07/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/849215",
      "Title": "Starting Chemo in Nov 2016 Sorella aterry"
    }
  ]
}