{
  "AuthorID": "Susug",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
  "Posts": [
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 21, 2015 03:02PM Susug wrote: Jules, You have every right to feel sad and concerned. Everyone that first hears the C word has these feelings don't let anyone minimize how you feel. Everyone handles this differently. You will be in my thoughts. Please take care. Susu",
      "MessageIndex": 4,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832792",
      "Title": "just diagnosed - sad, concerned, emotional rollercoaster jules72 Susug"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 23, 2014 09:15AM Susug wrote: Had lump removed this past fri. Getting results as soon as today. The Dr. Said he thinks it's going to be fine. He said he sees these all day and he would be surprised if it came back bad. I did have it out in the hospital. Everything went good. I really like my Dr. He says any lump you can feel needs to come out. It's the only way to know for certain what it is.",
      "MessageIndex": 17,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 30, 2014 03:15AM Susug wrote: well I had my lump removed last week it came back positive. My Dr. Was surprised he said the limp tested neg. but they found a very very small ( about the size of the end of a ball point pen) in the soft tissue close to the lump. I had an MRI on fri and having a sentinel biopsey tomorrow ..my question is are lymp nodes surgery painful? We live on a lake and are having friends in on the 4 of July to watch the fire works ( we will be in the boat watching ) am I going to feel like having friends in town 3 days after surgery. My lumpectomy went find and I felt ok after about 3 days. Also will I get results the day of surgery.  ",
      "MessageIndex": 20,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 18, 2014 05:39AM Susug wrote: Hi Im new on here I found a lump in my left breast beside my nipple (inside nipple not the surface) It doesn't show up on mamo or u/s. My identical twin sister had breast cancer 13 years ago.she passed away a yr ago not from breast cancer ( devastating ) I was told that I wasn't at a higher risk being a twin. I have been on the computer a lot these last 2 weeks WOW!! I am at a higher risk. I have an appointment with a surgeon tomorrow . What are the chances I will have something   done in the office or at least know something. The wheels of medicine move slow. The wait is the hardest. Oh and the lump is in the exact spot as my sisters. I just joined this forum everyone is so nice.",
      "MessageIndex": 11,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 19, 2014 02:46PM Susug wrote: sammyjokk Thank you for responding. Saw my surgeon today having lump removed tomorrow morning.i feel so much better seeing him today. Dr says he believes it will be ok but it needs to come out. He says he confident that it will be benign. ",
      "MessageIndex": 13,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821870",
      "Title": "Lump not showing up on mammogram or ultrasound DeAnaR Nemmett44"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Feb 13, 2015 03:30PM Susug wrote: my typing slows down the longer I type don't know what's the problem. My sentinal node did fine",
      "MessageIndex": 5,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/828449",
      "Title": "Post-Lumpectomy Massive Fluid Leakage and Infection! Daisey4522 Daisey4522"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Feb 13, 2015 03:28PM Susug wrote: Hey Daisey,I had the same thing happen to me not nearly as bad as yours but all the same symptoms ..I felt like what I had was an infection and needed antibiotic. My bs told me it wasn't infected. .???? It. Took amounth to clear up. I peeled the glue of with the permission of my bs..BIG MISTAKE. A week later I had sentinal nodes surgery a it it did did fine.I left the",
      "MessageIndex": 4,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/828449",
      "Title": "Post-Lumpectomy Massive Fluid Leakage and Infection! Daisey4522 Daisey4522"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Feb 13, 2015 03:41PM Susug wrote: I only can type a few sentences at a time my bs told me they are not sure why some have drainage and some don't. It just takes time",
      "MessageIndex": 6,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/828449",
      "Title": "Post-Lumpectomy Massive Fluid Leakage and Infection! Daisey4522 Daisey4522"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 10, 2014 09:05AM Susug wrote: Hi clowery, in June I felt a lump in my breast my Med doc sent me in for diagnostic testing mamo and ultrasound. Nothing showed up on imaging so he sent me to a surgeon ( which kind of surprised me because nothing was there). My surgeon said he believes if you can feel it but can't see it you will not know what it is unless take it out. That doesn't mean it's bad. It's better to be know now it will give you pease of mind. My Dr said he didn't think mine was malignant but when they sent it to the lab they found a very small (3mm) tumor in the tissue. I am just about to finish my radiation that's all i had to have. The waiting is the hardest most lumps are benign. I'll have you on my mind. You came to the right plase for support there are a lot to people on this site that will help you through the waiting Hug!! Sus",
      "MessageIndex": 1,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/826128",
      "Title": "thick lump clowery2000 clowery2000"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 16, 2014 09:42AM Susug wrote: Hey girls,           I have a HUGE question. Let me recap what's going on. I was Dx in June (4mm stage 1 grade 1 zero nodes.) The plan was to have radiation. While I was waiting on healing my oncologist did A  genetic test. The genetics councilor ask that I not start radiation until results came back because it could  change treatment. Looking back i really wish I had not agreed on this 25 panel test.BUT I DID ,WAS TOLD I WOULD HAVE RESULTS IN 2 weeks. It's been 7 weeks and I still don't have results. Trying to get info has been like pulling teeth. I have waited all this time freting over this test. I get a call from radiologist they want to get started this week on radiation ???? Have waited this long on that damn test now they want to start treatment.  The reason for waiting is to preserve the breast tissue if I need mx. This cancer is so small and slow growing it was a miracle    that they even found it. My question is with this small of cancer Do I even need even radiation? The only history I have is twin sister had BC and my mother had pancreatic cancer. I'm so frustrated with everyone I could screen. I have read all about the chance of BC coming back but all the tumars  are in cm not mm.  I'm not sure what I want to do. Any feed back will help. Thanks girls your all great on the forum. Susu    ",
      "MessageIndex": 15246,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 21, 2014 03:58PM Susug wrote: I would ask for one sooner. I thought they always want you to have them every 6 mons for a while.",
      "MessageIndex": 15299,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 26, 2017 01:26AM Susug wrote: ChiSandy ....... you ask me about chemo on a earlier post. The reason I have never neede chemo is. In 2014 my IDC cancer was ER -my second cancer opposite breast was DCIS they only require you to do radiation.",
      "MessageIndex": 15411,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 28, 2017 04:27PM Susug wrote: Lucy, they called today I have both on Monday. Just need to get them both and move to the next phase what ever that is. ???",
      "MessageIndex": 15418,
      "PostDate": "28/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 29, 2014 11:55AM Susug wrote: Hello All, I have posted on several forums wasn't sure where I was going to land in the way of treatment.well I start radiation today. I have done my simulation and today is the real deal. I'm nerves but ready to get this going. I was diagnosed in late June have been waiting on gene results that took 6 weeks. It was neg. I have been following summer rads so glad I found this fall forum still keeping up summer rads I have a lot of support from familyand friends but no one really knows how it feels until you have been there. My twin had BC 13 yrs ago. I was with her through it all but I didn't walk in her shoes i walked beside her( big difference )  so I guess it's going to be a long fall Lol!!! But I feel good to have all of you for support. I do have one question..my RO wants me to boil green tea everyday put it in a spray bottle and sprits my breast then use some cream he called in. I have to do this 2 hours before each app. Really??? I do have to work some of the time. I work for myself and am flexible but that sure seems like a pain to do everyday. I have read post on here that say there are several good creams to use. Is this green tea normal? Glad I found y'all, Susu",
      "MessageIndex": 357,
      "PostDate": "29/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 03:16AM Susug wrote: Hi Peggy, thank you for your info. I updated my profile. My cancer is 4mm very small. But still cancer i see from your diag you caught yours early also. My twin sister had BC 13 yrs ago she had a double mastectomy  it was more advanced.  ",
      "MessageIndex": 376,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 07:24PM Susug wrote: Jeanelle, I hear you girl. Puffin, they didn't do tats on me. They use blue and purple sharpies. I tell my friends it looks like I got in a fight with a blue and purple sharpie and they won lol! Gotta laugh. I'm going to my high school reunion this weekend so this morning they removed the BIG! X in the middle of my chest that shows no matter what I'm wearing. They put a permanent dot in its place. I do permanent cosmetics for a living so when I'm finished I can flesh it out. I'm having 33 treatments I think that's standard treatment for many. ",
      "MessageIndex": 385,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 09:39PM Susug wrote: y'all are right about how small they are I have moles larger than that Lol!!!",
      "MessageIndex": 390,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 6, 2014 06:13PM Susug wrote: jhodro that's great I know yourrelieved. I have had 5 treatments so far. Feel fine but know I have a ways to go. I want to put a picture an here I'm not good at that kind of thing can I take a Facebook pic and apply it on this forum",
      "MessageIndex": 421,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 19, 2014 05:33PM Susug wrote: Peggy,yea that's what I have heard from many who have been through this everyone reacts different ",
      "MessageIndex": 605,
      "PostDate": "19/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 1, 2014 05:36PM Susug wrote: Thanks Peggy, yes I can't wait to put the pic of me ringing the bell. I have a few friends that are going to be there my last day then we are going to lunch and have and have margaritas ",
      "MessageIndex": 781,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 11, 2014 12:04AM Susug wrote: Hey Giles, that is what my doc prescribe for me it's works good They had me start using it before I needed it .I also use the aqufor also. I'm having some reaction to my skin now. Well I spoke to soon last week when we were talking about machines that have broken down.i was bragging because my clinic hasn't had that problem. I new that was going to come back and bite in the but when I said that Lol!!They called me this morning and and cancelled my appt for today because machine down. Only 3 left so I'm having 2 tomorrow and I will be finished wed. YEA!!!!",
      "MessageIndex": 869,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 12, 2014 01:06PM Susug wrote: Puffin- thank you for responding . I woke up this morning thinking about my twin sister I miss dearly. She had breast cancer 13 yrs ago. She went trough so much more than me.Dm and chemo. I wish she was here.( she passed away 2 yrs ago. Not from cancer. she was my beast friend ) I went through everything with her when she had this. I walked beside her not in her shoes theres a big differnce. Now I know how she felt. Hugs Sus",
      "MessageIndex": 881,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 18, 2014 11:57PM Susug wrote: Hey Blownaway, that does seem like a lot of radiation. It looks like we have the same diagnosis. I had 33 treatments the last 5 of the 33 were boost.",
      "MessageIndex": 951,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 19, 2014 11:03AM Susug wrote: Jeannell, Yes it does seem like all I do is see my Drs. When I had my last treatment ( last wed)I was so looking forward to not having to go to BC center BUT then my husband said Susan you have appt with BS.. I must have lost my ever loving mind to make appt the day after rads.Then I get a call from my MD the next day for my regular 6 month check up. REALLY! I told the recptionist pleasedon't make me come to that apt all I've done is see docs. I take meds so I HAD TO GO. I'm sure any day the heart doc will call and say it's time to see him. You know one day your just enjoying life and WAM! The rug gets pulled out from under your feet. I know there a many women on this site that have gone through and are going through so much more the me. My point is life can take turn in a instant. I can say the one positve thing that has come out of this is all the wonderful women I have meet and feel like I know on this site tall have been great. I have a great husband and wonderful friends BUT they really cant relate to what we are going through. Not like y'all. Big Hugs to all Sus",
      "MessageIndex": 957,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 26, 2014 02:17PM Susug wrote: jannelle my boost was in one position machine was on for 30 sec. It's amasing how many differnt ways they treat at different centers. Hope everyone has a wonderful Thankgiving 😊 Blownaway. Congrats on finishing rads today.",
      "MessageIndex": 1038,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 22, 2014 07:16PM Susug wrote: Jeanelle so sorry you are sick ugh !!! I hear the flu is really bad this year they say the flu shot is not working very good this year. I have a fear of getting it this year. Not sure how this old body would handle it.",
      "MessageIndex": 1180,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 25, 2014 06:54PM Susug wrote: Hey  Gilsemt ,  Im 20/33 my skin is doing well like you ,I do have some itching that stared this week. Dr is pleased with my skin. I do have some fatigue but it's strange it comes in waves  one min I feel great then an hour later I need to take a nap  not complaining  from what I have read on here it could be a lot worse. Oh I have a few small little bumps that have appeared  they itch. Use Cardozone cream works great.",
      "MessageIndex": 674,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 26, 2014 09:28AM Susug wrote: puffin, that is the exact same scenery picture that's on the ceiling in my treatment center. ",
      "MessageIndex": 683,
      "PostDate": "26/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 1, 2014 05:05PM Susug wrote: Hey Peggy my son helped with my pic. hope everyone has a wonderful weekend, its a beautiful crisp day in Tex.Susu",
      "MessageIndex": 779,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 3, 2014 08:29PM Susug wrote: Jeanelle- I have that rash also it started about 3 1/2 weeks in  my RO gave me a script the first day I saw him it has cortisone cream in it. It works great for the itch.. It's called Tramcinolone Acetonide substitute for",
      "MessageIndex": 801,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 18, 2014 07:58PM Susug wrote: Jeanelle, so glad to hear you are getting brakes in betweenthat should help you a lot . I'm finished so far I'm doing good it keeps getting darker and a little tender with a few shooting pains. I'm finished but still like keeping up with everyone. Does anyone know how long I will still be having affects from the treatments it's gotten very dark since I finshed last week?",
      "MessageIndex": 946,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 26, 2014 04:07PM Susug wrote: willowreed ,So happy for you what a great Thankgiving for you",
      "MessageIndex": 1041,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 30, 2014 10:59AM Susug wrote: I got my first treatment yesterday. All went well was in and out fast. I noticed last night my left breast felt warmer tan the right. ncollett - I know just how you feel. It's a little scary but I'm ready to get this over  sounds like we are going to be on same schedule or very close.  Mommq - the tea is suppose to help with burning good idea to make it up . I was told I could spay any time of day just stop 2 hrs before  I quess every clinic had there own thing    ",
      "MessageIndex": 363,
      "PostDate": "30/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 21, 2014 03:55PM Susug wrote: Hey ladies I hope everyone is doing well. I I wanted to ask if anyone has had scar tissue around where you had your lumpectomy. My tumor was close to my nipple. The scar tissue ( if this is what it is ) is inside the areole it feels like a lump but I think it might be scar tissue. .?",
      "MessageIndex": 1170,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 10, 2014 02:35PM Susug wrote: That's great Jen . I have had 10 treatments so far I'm doing ok. I'm wondering if there is anyone on here that have implants ( before cancer) if so how did your implants do through radiation and did you have any shrinkage. As of now I don't have any symptoms maybe a little sensitivity. If I'm going to have any about how many treatments in will it be? Wow! Peggy your almost done that's great.",
      "MessageIndex": 488,
      "PostDate": "10/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 12, 2014 08:27PM Susug wrote: Hey Girls, I have had 10 rads. I'm not red I'm doing really good nipple a little red that's it. I have fair skin thought I would have reaction by now.  I still have a ways to go so better not get to comfy. My RO gave me a script ofTriamcinolone CR 1%. A tub of this should last six weeks use twice a day. He also has me boiling green tea. I put it in a spray bottle and spray twice a day. Don't know if this is why I'm doing good or it's just my skin but I thought I would give the name of this if anyone is interested. Gilesmt sounds like we are on the same schedule. We can compair notes Lol!!!  Hope everyone has a good week. ",
      "MessageIndex": 513,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 21, 2014 05:36PM Susug wrote: Skbrown  I'm from Longview tx. MD Anderson is  a very good  treatment center.  Had my 16 treatment today my Dr said he is very impressed with my skin. I'm not even pink but I do have fatigue. This is doing so much better than I thought it would. Hope everyone is doing well. Susu ",
      "MessageIndex": 635,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 3, 2014 08:34PM Susug wrote: Jeanelle Sorry I accidently hit submit to soon    It's a substitute for Aristocort  after today I have 7 more treatments left  these singers are very painful hope the go away soon have had them all day  ",
      "MessageIndex": 802,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 25, 2014 12:43PM Susug wrote: StongEnough- my skin looked like that in the beginning it felt like a rash and itched but it was only in the places that I have sunned for yrs. it was a little strangeit started out itching for about a week then the itching went away but the rash remained and didn't bother me as much. I'm red around my nipple area where they did the boost the rest looks like a tan. I'm 2 weeks out and still getting some reaction in the boost area My nipple is very tender and dark. I also used Tramcinolone it was great .Thinking of all who are going through this. Hugs Susu",
      "MessageIndex": 1025,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 2, 2014 07:15PM Susug wrote: Hey Ladies, I'm sure the last thing y'all want to talk about is another hormone drug BUT!!! I'm not sure how old everyone is on here I'm 59 I had a hysterectomy when I was fifty. Had all the horrible hot flashes,night sweats,crankiness ect. I Got on hormone pellets about 4 yrs ago ( they are called Bio T you can google them) ALL MY SYMPTONS WENT AWAY. WHEN I FOUND OUT I HAD. BC I FRECKED OUT. I ASKED OC IF I HAD TO STOP. SHE SAID I COULD NOT HAVE ESTROGEN but I can still take testtostrone which takes care of 90% of all our SYMPTONS words can't decribe how much better I feel. Instead of being hot all the time I get cold easily",
      "MessageIndex": 1074,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 17, 2014 03:42PM Susug wrote: Yikes, after you find what's most comfortable maybe u can figure out a way to make a sling to hold it up. Something that will go around your neck. Not sure how it will look but if it helps who cares.you just need to feel comfortable good luck.Susu",
      "MessageIndex": 1163,
      "PostDate": "17/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 22, 2014 09:32AM Susug wrote: Thanks everyone now I will not worry about it. It really does feel like scar tissue. Jaenelle, how are you feeling since you finished rads. I had a couple of weeks of fatigue after I finished its going away now. I want to wish everyone Happy Holidays.",
      "MessageIndex": 1177,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Aug 27, 2017 07:50PM Susug wrote: Teacher- My heart aches for you. You daughter is so blessed to have you. My mother and twin sister are deceased.so it was tough without them. Please continue to post and let us know how she is doing. It doesn't matter what forum you post on. Hugs Susu",
      "MessageIndex": 20,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858123",
      "Title": "Daughter, 55, biopsy results cancer-architectural distortion Teacher18 Concerned2018"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jul 29, 2014 11:58PM Susug wrote: RentingSpaceFor Free, I found a lump the size of a small pea. Went to MD he sent me to a surgeon he could feel it also. He said he didn't think it felt like cancer feels.but said he always takes out a lump the is felt that's the only way you know for sure ( oh forgot to say it dint show up on mamo or US). After surgery he still said he thought it looked ok but he needed to send it to the lab to make sure. 3 days later got the news it is cancer. The dr was right the lump I found was not cancer. they found a 3mm spot in the tissue below the lump I found. The dr told me self breast exam was the best thing I could have done. He also said he always removes something you can feel but not see love my dr. It's you body insists they do more for you or go to a different dr. It's your body don't get intimidated  I found this early (grade 1 Stage 1 no lymph node were cancer saved me from having many surgeries  My twin sister had breast cancer 12 yrs ago double mx.   I have to have radiation for 6 weeks also no hormone receptors. All this will start next week. I will be thinking about you please let us know if you want. These women on this site that I'm new to are very nice and very informative. ",
      "MessageIndex": 15,
      "PostDate": "29/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/821320",
      "Title": "Can Surgeon tell by touch? RentingSpaceForFree barbe1958"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 1, 2017 05:15AM Susug wrote: Hi WeatherHeather....... I have cosmetic breast implants. I have had cancer in both breast 2 yrs apart with radiation. I was told initially that radiation would not damage my implants. I had a small cancer that didn't need chemo so I had a lumpectomy and rads. 2 yrs later DCIS in other breast also did rads. I'm having cramps in my pectoral muscles. Only way to describe them is it feels like a Charlie horse cramp like we get in our calfs mucles. They take your breath away. They don't last long but my breast is sore afterwards. I have been told NOW! That my implants are hardening the pec muscle doesn't like them. They told me they will continue to harden. I initially considered a double mastectomy with recon was talk out of both from my doctors. Make sure you talk to a plastic surgeon if your considering keeping them. Your nonevil breat should be fine as long as they are not radiated. Your right that I don't think many women here have cosmetic breast. I have ask questions but don't get much response,but not everyone may want to talk about that or it's personal. Pleas keep us informed you will find this a comforting place. Hug. Susu",
      "MessageIndex": 19,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/829917",
      "Title": "Lumpectomy with Existing Implants??? SugarCakes Sandiegohoneybee"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 19, 2014 04:35PM Susug wrote: davida58, if you will go to fall radiation everyone on there is going through radiation.i really can't answer your questions on some of your other medical issues but I'm sure there is someone on there that can help you. Come on over to this site and meet everyone. I'm on my 15 treatments and doing good. susu",
      "MessageIndex": 2,
      "PostDate": "19/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/825554",
      "Title": "Recently dx'd - sigh davida58 davida58"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 03:21AM Susug wrote: Peggy, so sorry you are going through a lot with your DH I beat you are exhausted. Hope all is well soon for both of you. ",
      "MessageIndex": 377,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 2, 2014 09:38PM Susug wrote: Good afternoon to all, About an hour a go I started having shooting pains in my left breast that's getting radiated. Wow!! Those little suckers hurt. Has anyone eles had this issue.I have had 25 trearments",
      "MessageIndex": 784,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 3, 2014 12:14AM Susug wrote: Blownaway- I'm from Longview ",
      "MessageIndex": 790,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 7, 2014 12:58AM Susug wrote: Had my first boost today 4 more and I'm done  will i i notice a differnce in these boost?",
      "MessageIndex": 853,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 12, 2014 03:13AM Susug wrote: Jeanelle, I'm so sorry you having discomfort. Hope you better soon. Blownaway I use auquphor and cordizone cream together and it seems to help. Ok everyone tomorrow is my LAST!!! Radiation treatment. all of you will probably hear me ring the bell I will be ringing it loud.Then my lunch with several friends and margaritas. Whoo Hoo!",
      "MessageIndex": 878,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 12, 2014 01:22PM Susug wrote: Thank you Peggy I truly believe she is",
      "MessageIndex": 883,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 13, 2014 04:18PM Susug wrote: Lilyrose CONGRATS!!!!!!!",
      "MessageIndex": 900,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 14, 2014 05:44PM Susug wrote: I am ER - I was told I didn't have to take hormone dru",
      "MessageIndex": 917,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 2, 2014 10:27AM Susug wrote: Jeanelle, Whoowho!!!😊😊😊 so happy for you. You have really been tough through all this. My skin didn't react as much as yours. It's soooo nice not to have to be somewhere evey day..have a wonderful day. Sus  ",
      "MessageIndex": 1066,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 3, 2014 02:58PM Susug wrote: Hi Jedimom, I didnt blister just got red itchy rash some areas were more red than others I finished 3 weeks ago. It still reacts up to a couple of weeks after at least mine did. It's more tan looking now and thats even fading. I'm still red around my boost area and a little sore. I was more fatigued than anything I'm still get really tired easily. But over all I was please",
      "MessageIndex": 1080,
      "PostDate": "03/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 11, 2014 08:23AM Susug wrote: Jeanell, I order medline from the Internet. Which cream did you RO suggest?",
      "MessageIndex": 1143,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jul 22, 2015 01:15AM Susug wrote: Blownaway- My EF around 40. In 2010 when I first found out I had a heart problem my EF was 32. They put me on meds and it got a little better. They think a virus attracted my heart. Then 2014 I was diognosed with breast cancer. I had radiation only. So far my heart Dr says everything is ok. I do get dizzie several times a day. 40 is below norma. Did you have heart issues before your cance?",
      "MessageIndex": 11,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 27, 2015 07:32PM Susug wrote: her2 neg",
      "MessageIndex": 11,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832831",
      "Title": "Newly diagnosed Stage IV malignant pleural effusion hopeful34 paulatkc"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 17, 2014 08:09PM Susug wrote: Hey Girls, Keepthefaith, thank you for your input. I think RO said they block the heart or go in at a different angle to protect it.??? I'm going in for my set up tomorrow not sure what it's all about yet. I'm sure I will know way more then I want soon Lol!! BosumBlues, you are right I need to go with my gut and it tells me go for radiation. I'm sorry if I sounded insensitive. Thank you for your comment. My twin had dx 12yrs.ago she didn't have a choice either. Well the way it looks is I will start in about a week or so I will be finished right before thanksgiving.   ",
      "MessageIndex": 15253,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 25, 2017 11:55PM Susug wrote: Sheila.... no I have never had chemo I have had cancer in both breast... 2 years apart. Lumpectomy and rads on both. 2014 then 2016. I have heart disease this caused my kidney problems from what my MD said today. Having a ultra sound to see how much damage.i really hope this next Mano is ok. But this ruff, scaly, itchy rashy nipple is bothering me. Thank you for hugs.",
      "MessageIndex": 15410,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 26, 2017 07:07PM Susug wrote: Lucy.... You are so right but with me it's not one thing, it's 3!!!!!!things. I went back to look at the years all the health isssues started. In 2010 I'm just clicking a long having fun in a healthy life. Then one day I was dizzy BAM! Found out a virus attracted my heart. My EF was 30. They almost put a pacemaker in. Put me on meds and I got better. Not great but felt better. EF now is 35 to 40. So I got use to dragging around it just became what you call TIRED!! The 2012 my twin passed away I'm still not over that. Then in 2014 cancer left breast lumpectomy and rads. Two yrs later 2016 DCIS right breast with rads.so far no chemo. Don't think heart could take it. NOW! Kidney disease. I was so pissed when I left drs. office. Three diseases and none have a cure ugg!!!! This is strange but with cancer at least they can take it out and treat it with this kindney no meds nothing. If you passed me on the street you wouldn't know there was anything wrong with me. On the outside,the inside is fallin apart. Sorry about the rant I'm still in a fog over all of this Thank for this place it feels safe.",
      "MessageIndex": 15413,
      "PostDate": "26/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 27, 2015 07:31PM Susug wrote: Hello Hopeful I am so sorry it is back. I would like to ask you some questions if it's ok with you. We're you getting mammograms every year. We're you having regular MRI. I was told I would have Mamos every 6 mons but now they tell me once a year ??? They also said I would get yearly MRIs. I know most of the time we have to throw a fit to get insurance to pay for them. I will have you in my thoughts Hopeful.  For all who is reading this. I have been on this site for a year now so far I haven't seen anyone that is estrogen -progesterone +.(I'm sure there are some just haven't seen anyone) most are estrogen +. I have read about triple negative that's not me. I'm wondering how many are estrogen - and what does this mean. I'm her2",
      "MessageIndex": 10,
      "PostDate": "27/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832831",
      "Title": "Newly diagnosed Stage IV malignant pleural effusion hopeful34 paulatkc"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Susug wrote: I had a lumpectomy 2 weeks ago it was doing fine the 1st week but now it oozing yellowish fluid the doctor said lumpectomy are notorious   for that he put a couple of stitches in but after a few days it's oozing again I don't believe it is infected there is no pus or fever.has anyone ever had this happen to them after lumpectomy? Would appreciate any input. I can't start radiation until this heals. Thanks for any input you ca give me. Susu Surgery 6/18/2014 Lumpectomy: Left Surgery 6/30/2014 Lymph node removal: Left, Sentinel Radiation Therapy 9/28/2014 Breast Dx 5/10/2016, DCIS, Right, 1cm, Stage 0, Grade 3, 0/0 nodes, ER+/PR+, HER2- Surgery Lumpectomy Radiation Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/822682",
      "Title": "Problem Healing after lumpectomy Susug snorkeler"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jul 11, 2014 12:31AM Susug wrote: Hello I'm new to the stage 1 BC  sisters . I have posted to other areas but just found this one .Heres my story. I found a lump in my left breast didn't show up on mamo or sonogram . Went to see a surgeon he removed it said He believed it would be begine. Wrong! path found a 4mm tumor . Then did a centinal node surgery negative then MRI negative. Now doc is sending me to radiologist tomorrow morning.says I only need radiation.i had an identical twin sister that had BC she passed away a year ago (not form breast cancer.) she never had mammograms so hers was more advanced than mine she went through double mastectomy and chemo . I miss her it feels like a part of me is missing. I was with her through all her cancer treatment . I have a question maybe someone on this site maybe can answer or let me know of a forum that will help me. In 2010 I was diagnosed with cardiomyopathy. Can I have radiation with this heart condition.and if so is it going to be effect  my heart. Appreciate any input from someone that has gone through radiation with heart daises.i don't think it has really set in that I have cancer because all the drs say it's the best case senecio if you have to have it.i have read a lot of post on here it's amassing all the different typs of treatment with stage i I am surprised at all the mastectomies there are with stage 1. I may have to rethink this. I will know more tomorrow .thanks for listening .    Thanks Susu",
      "MessageIndex": 15095,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Aug 25, 2017 10:43PM Susug wrote: Hi Shella, my cancer was slow growing and only 4mm my oncologist said I didn't need chemo but I did need radiation. This was in the left breast two years later DCIS in my right breast was told radiation. It took me several weeks and second option to make the decision not to have a double with reconstruction. My doctors told me I could do big surgery if I find myself worrying all the time. So far I'm fine. I do think about my BC more the second time around. I have breast implant from an augmentation from 12 yrs ago. I seem to get cramps in the pec muscle. Kind of feels like a Charlie horse. I was told my implants are causing them because they are stiff due to radiation. I was stage 1 grade 1. I don't think they do chemo with that stage. I'm on the boards a lot reading about the diep. I have a feeling I may have to go",
      "MessageIndex": 15375,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 27, 2017 04:30PM Susug wrote: yes I have my diognostc mamo oct.13th. I also have a ultra sound of my kidneys Mon. Oct 3 rd. Called today to see if I could do them both mon 3. They are working on it. Yesterday I went through my patient portal to look at my blood work. I went all the way back to 2013. My kidney levels were low then. I'm very upset with this that I wasn't told. I think they didn't even look at it these last few years because they have been low several years now.",
      "MessageIndex": 15415,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 27, 2017 04:36PM Susug wrote: awe! I bet your 5 year old twins are fun. Me my sister were like two peas in a pod. There is a closeness that's hard to explain. I feel like part of me is missing. We we're so close and our husbands were best friends. Life can change in a minute. Hugs Sus",
      "MessageIndex": 15416,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 1, 2017 08:29PM Susug wrote: sounds like fun I hope you enjoy your holiday. I go in at 8am in the morning. They will do my kidney sonogram theenat 10 my mammogram. Nervous but ready to get them done.",
      "MessageIndex": 15421,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 02:32AM Susug wrote: Hi Everyone Hello to all the new women I'm also new just finished my 4 th treatment today. For some of you that have been having treatment for several week how long does it take to notice any side effects? Does it cause much fatigue ? Hope all goes well with all ",
      "MessageIndex": 374,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 3, 2014 09:49PM Susug wrote: mine are very large X in between my breast one on my nipple. One on rt, side breast(so they can line it up wth the one on left sie of breast. They a blues xes and puple",
      "MessageIndex": 392,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 15, 2014 09:49AM Susug wrote: so I have 12 rads under my belt my breast is doing fine but yesterday morning when I woke up I felt like I hit a brick wall. I was told probably not rads ??? Just barely got out of bed this morning. I never sleep late now Im not wanting to get up. They say it should be a couple more weeks before I start having symptoms. It's like they are saying its in my head. I just don't have much modevatio.Has anyone else had fatigue after 12 treatments?  On my way now to # 13.  ",
      "MessageIndex": 550,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 17, 2014 02:31PM Susug wrote: Peggy ,So happy for you. Did you get to ring the bell?  I will have my 15 treatment today. Not red just a little tired. I think there are a couple of you on my same schedule. If so how are you doing after 15 treatments?",
      "MessageIndex": 583,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 19, 2014 04:24PM Susug wrote: Hey Lolis, I'm on 15 I'm not red YET..I am tired its strange how the fatigue hits you one min I'm fine and the next I can hardly put one foot in front of the other. My rads tec warned me that by the middle of this next next week  I will start to have some symptoms. I'm hoping I don't blister but she told me most do. Skbrown, so sorry your having a bad year. You will find there are some wonderful women on this forum everyone understands the feeling of getting dx. These women on here are great. They will help you along the way and answer all your questions. Susu ",
      "MessageIndex": 603,
      "PostDate": "19/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Oct 31, 2014 10:36PM Susug wrote: Hey everyone , had # 25 today all most finished. I am pink in 2 areas but it's doesn't feel like a burn it feels like a rash it itches  some fatigue  congrats Puffin I'm so happy for you..go have yourself a big fat drink  if you don't drink I'll have one for you Lol!!!! I want to put a picture on here but I can't figure out hoe to do it  I love seeing who I'm talking to  y'all are all great  big hugs Susu",
      "MessageIndex": 765,
      "PostDate": "31/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 4, 2014 12:31AM Susug wrote: Lolis,congrats! so happy for ",
      "MessageIndex": 804,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 5, 2014 02:21PM Susug wrote: Coyote, Lol!!! What a fun story.  Wow! I only have 6 treatments left never have had or even heard my clinic having problems with machines breaking down. Just as I say this something will happen. I hope not several of my friends are coming to my bell ringing. After there are about 12 others meeting us for lunch and drink!!! my RO said my skin is doing so good. I'm really surprised it is I have fair skin but so far only itchy rash  the rash is still there but stopped itching  it's only in 2 areas. Hope this doesn't change I start my boost tomorrow. They are doing 5 boost  Hugs to everyone!!!",
      "MessageIndex": 834,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 13, 2014 04:11PM Susug wrote: IM DONE!!!!!!!!😊😊😊😊😊😊 Happy! Happy! Happy",
      "MessageIndex": 898,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 14, 2014 05:37PM Susug wrote: I don't recall if they ever did an onco score on me. Would that have been done with my initial blood work when I fist saw my RO? Or is it a seperate test",
      "MessageIndex": 915,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 11, 2014 01:12PM Susug wrote: Jeanell, That is what I use its great. I have very dry skin it keeps it moist all day. I didn't use it during radiation because it's scented. I think they told me not to use scented lotion. I started using it again after my rads. I'm healing really goo",
      "MessageIndex": 1145,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/823520",
      "Title": "Fall Rads 2014 writinghelps sas-schatzi"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 21, 2014 03:46PM Susug wrote: My breast surgeon said I'm only to go through him from now on when I get mamos. He said all imaging goes to him from now on every 6 mon for several years. He was very adamant about it.",
      "MessageIndex": 15297,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Aug 24, 2017 11:46PM Susug wrote: I find comfort in BCO. In 2014 I was DX with IDC had a lumpectomy and radiation. I didn't really worry about it very often after I finished treatment. The two yrs later I was DX with DCIS. Thought about having a mastectomy with recon but after a couple of second opinions I went with lumpectomy. I'm on BCO a lot lately. I do worry now that it probably will surface again. In the back of my mind I feel like I will have surgery. My twin had cancer when we were younger she had a double mx. I saw what she went through so it's been hard to pull the trigger on having the big surgery. I come here often to read and keep up with haw everyone Is doing. I have some wonderful friends but they can't really relate to what it like to have BCthat's why I come here. Hugs to all.",
      "MessageIndex": 15372,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 23, 2017 08:55AM Susug wrote: Hi girls... speaking of grandchildren. My little baby love is turning ONE! Tomorrow ..... we are having his birthday at our house. He is adorable (aren't they all) he's our one and only. We ha e many sleep overs Hug",
      "MessageIndex": 15396,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 25, 2017 04:18PM Susug wrote: Afternoon all... my baby Jax birthday was great! Completely worn out but fun. I have noticed lately I'm fatigued a lot. Went to MD today for my yearly routine test results...... I'm in stage 3 renal disease WHAT! Crap!!!! He said probably due to my heart Ugg! Yep I have heart issues since 2005. EF of 35 to 40. Im so bummed. I have my mamo Oct.13. I have been worrying about that for about a month. I'm having a problem with my right nipple (DCIS side) its scaly and ruff. My skin doc did a biopsy on it a couple of months ago with neg results gave me medicine went away for a few weeks how it's back. Has anyone ever had the problem with DCIS. Now I have to tell my husband.... I need a stiffdrink",
      "MessageIndex": 15404,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 7, 2017 08:28PM Susug wrote: I love silvadyne it worked really good for. I have a tub of it left I keep in the refrigerator it's wonderful for small kitchen burns and sunburns. My grandson was swimming at our lake house last weekend he is very fair. That night he woke up screaming he was so burned I put that silvadyne on him it was instant relief. Hope you get to feeling better soon",
      "MessageIndex": 5,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/858499",
      "Title": "How long after rads til healed tlgio17 msphil"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 17, 2014 09:49AM Susug wrote: Hey Girls, I got my test results back they are negative yea!!!!!  Now I need to make a decision rads or mx. The genetics councilor (female) didn't say she thought I need mx but I think that's what she was swaying for. My surgeon says no I should do radiation. This may sound vain but if I have rads and I get a lot of shrinkage can a plastic surgeon do surgery to fix that? And will insurance pay for somthing like that. Soooo many questions. Thank you all for you comments. Oh and I have heart problems. The cancer is on my left breast my RO says they can block the heart from getting radiation. ??",
      "MessageIndex": 15250,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Nov 4, 2014 02:09AM Susug wrote: 59",
      "MessageIndex": 339,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Sep 1, 2017 11:23PM Susug wrote: It's crazy how we have to wait on our results no matter how hard we try to put in the back of our mind it won't go way. When my twin went in for a mamo they immediately did a mammogram then a sonogram then a needle biopsy all in the same day Some states ( larger one ) do it all under one roof the same day. The first time I was very anxious. But 2 years later I was not in a hurry to find out I had a new primary in the other breast. My next mamo is next month. Will se how it goes. If it's not good I will have a double mx but now my breast have both been radiated ugg hope all goes well. Hugs to all susu",
      "MessageIndex": 6,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858348",
      "Title": "How would you rather receive your results? FarAwayToo Susug"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Dec 5, 2014 04:47PM Susug wrote: Hey Michelle, I'm sorry you have cancer. Sometimes these forums can be a little slow or the people that have had that procedure were no available to answer you. This is a great place to talk to women that are going through all the emotions I'm sure you are feeling now. Do you know yet what kind of cancer or the stage ? I will be thinking about you. Keep in touch. Susu",
      "MessageIndex": 3,
      "PostDate": "05/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/826662",
      "Title": "Is a mammtome biopsy painful? Michelle1103 Michelle1103"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 17, 2015 10:42PM Susug wrote: I've had both the Muga is more precise when they are checking your ejection fraction. In 2010 I was diagnosed with cardiomyopathy my heart was only pumping at 32 %. After being on meds for 4 months. They did a Muga I was told it would tell them the exact %.",
      "MessageIndex": 8,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Jun 20, 2015 11:18PM Susug wrote: I would love to have 66 I would be jumping through hoops Lol! No hoops or running for me.",
      "MessageIndex": 9,
      "PostDate": "20/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/832637",
      "Title": "Echocardiogram vs MUGA scan Cheesequake"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Susug wrote: I finished radiation treatments 3 months ago everything has cleared up. The only problem I am having is pain in the area that has a fibroadenoma I was dx with in 2010. They did needle biopsy. The spot where they biopsied throbs. Has anyone elese had this problem Surgery 6/18/2014 Lumpectomy: Left Surgery 6/30/2014 Lymph node removal: Left, Sentinel Radiation Therapy 9/28/2014 Breast Dx 5/10/2016, DCIS, Right, 1cm, Stage 0, Grade 3, 0/0 nodes, ER+/PR+, HER2- Surgery Lumpectomy Radiation Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827726",
      "Title": "Pain Susug Susug"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Mar 27, 2015 11:25AM Susug wrote: yes my twin sister had it 13 years ago. Hers was more aggressive than mine and it was In a couple of lymph nodes. Hers was seen on mamo she wasn't getting regular mamos. That's why I think it's important to take it out so if it is something you have a jump start. Some doctors will say to wait a few months and see if it changes. If you have been reading post on this site there are many women who were told to wait and later found about 6 months later it was cancer. My thoughts are with you.Sus",
      "MessageIndex": 7,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829945",
      "Title": "I feel it, Dr feels it, but mammogram and ultrasound are clear. thoss Susug"
    },
    {
      "AuthorID": "Susug",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/201563/profile",
      "Content": "Mar 27, 2015 08:11AM Susug wrote: Hello Thoss, I found a lump in areola went to my MD he sent me in for mamo and us. It didn't show up on imaging. MD sent me to surgeon. He could feel it so he said he thinks if you can feel it take it out thats the only way you will know what it is. He thought mine would be benign. To his surprise the path found a 4mm (very small) CANCER What we felt was swelling he sad prob due to the cancer. He said it would have eventualy shown up later but more advanced. The chances are on you side it is prob benign BUT YOU WONT KNOW UNLESS you take it out and let pathogy look at it. It's you body do what feels right for you to have peace of mind. Let us know how it turns out. Susu",
      "MessageIndex": 3,
      "PostDate": "27/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829945",
      "Title": "I feel it, Dr feels it, but mammogram and ultrasound are clear. thoss Susug"
    }
  ]
}