{
  "AuthorID": "sutherndiva",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
  "Posts": [
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 25, 2009 03:30AM sutherndiva wrote: Hattie, I think that mine is a PIG as well, but it has to go.",
      "MessageIndex": 13,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 25, 2009 03:31AM sutherndiva wrote: Deb, Thank you so much! I love the hat.",
      "MessageIndex": 14,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 24, 2009 08:49PM sutherndiva wrote: I am so glad that I posted versus just keeping this stuff floating around in my brain. Thank you ladies. Sutherndiva",
      "MessageIndex": 6,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 25, 2009 03:39AM sutherndiva wrote: Nene, I am actually 31 years of age and I think that fact put Dr. B  into overdrive towards the cure. I can only imagine what would have happened had I not had he chemo up front you know. It pisses me off that I had a doc that took such a laid back approach to something and led me to believe that it was a very small thing when in fact it could have cost me my life. I am so glad that my nagging  ( I love her) aunt Mary who was a patient of Dr. Brackett pushed me to see him. I told my  husband that from this point I will just have to take my anxiety meds before I see him. My husband who is absolutely ANAL & INTENSE LOVES him. Yeah I ask myself all the time why I married him:) LOL! Thanks Nene. We need to get together for coffee, tea or maybe survivor walks when I actually get my headtogether. I have tests and appts scheduled for the next week. So I will PM you later.Thanks A Million! Really",
      "MessageIndex": 15,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Nov 9, 2011 12:02AM sutherndiva wrote: Bullshit!!! I have a certain friend that always tries to tell me what lifestyle choices I made to get cancer. Needless to say I talk VERY little with her! Pisses me off always blaming us!!!",
      "MessageIndex": 15,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777774",
      "Title": "This kind of thing drives me crazy. lynne248 pbandj"
    },
    {
      "AuthorID": "sutherndiva",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "sutherndiva wrote: Today I really wanted to just give up. Today was actually set to be the day that I had my masectomy but after my family begged and pleaded I went and had a second opinion with a doc that was local. Now to give you some history I started my treatment  with Doc 1 on May 21st. We did the biopsy, mamm, ultreasound bit and he explained that I had 2.5 cm tumor with what they believed was about 10 more cm of cancer in situ. So we decided on a masectomy as there was such a large area. So after talking with the family I got a second opinion and doc 2 doc thinks that the the cancer is more aggressive then Dr. Barron explained. Dr. Barron said that it was a grad 1 tumor and he would not stage until after masectomy. The new doc has given no grade but staged me as a IIIa tumor. So my head is spinning. The new doc seems very intense and intelligent but he also scares the crap out of me. He wants to do chemo before we do  any surgery so that we can possibly reduce the tumor size and kill any cancer cells floating around in the body. So I have decided to go with Doc 2 as he is local and he has put me through a battery of tests and he seems very cutting edge. He told me today that my prognosis depends on how this tumor responds to the chemo. My path report from doc 1 says that the tumor is ER positive, progesterone weakly positive, Ki67 20% and her2neu weakly positive. I really feel like I am at the end of my rope after this second doc. The first doc made me feel like we would be able to do the masectomy and get this over while Doc 2 really makes me feel like we really need to arm ourself with every bit of info possible and that my prognosis is not so good. Any comment or encouragement from anyone with similiar experience will be appreciated.   Optimism is NOT optional! Dx 5/27/2009, IDC, 2cm, Stage IIA, Grade 1, 0/0 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 24, 2009 08:47PM sutherndiva wrote: Hey Nene, Doc 2 is Dr. Brackett so please don't mention that he scares me ok. I have only seen him one other time and he is INTENSE. SO thank you for letting me know that I am doing the right thing by allowing him to care for me. Please email me with updates on your progress as we beat this!",
      "MessageIndex": 4,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 24, 2009 08:48PM sutherndiva wrote: Thank you Tender!",
      "MessageIndex": 5,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jul 1, 2009 09:51PM sutherndiva wrote: Thanks Nelia!",
      "MessageIndex": 21,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/736466",
      "Title": "Hope Seems Fleeting sutherndiva nene2059"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 30, 2009 10:01PM sutherndiva wrote: Hey Sea, My radiologist was the one that told me as well. After my mamm my obgyn sent me to a Breast Center where I had the chance to meet with one of the best radiologists ever. She told me while she was doing my ultrasound guided biopsy that it was a big tumor and that I would have a a mx, and get a tummy tuck in the process from the tram flap :). So like a lot of the ladies said the radiologist sees this stuff all of the time and I am sure they become familiar with the way it looks. I was diagnosed on May 21 and I have not really cried yet. I feel that crying somehow will mean that I am giving in to this CRAP and I will not. I did shed a few tears at church as the pastor encouraged us and explained that sickness was not a result of some terrible thing that we do like so many would have us believe. Yet I have not totally just all out lost it yet. But if I ever feel like i Want to I WILL JUST DO IT and tell anyone around I DESERVE a good cry!  So right noe yo are just in process and survive mode when yo get a handle on this and yo are ready to breathe a sigh of relief it will happen, To be honest women are naturally just VERY STRONG, I SEE IT TIME AND TIME AGAIN, I know that sounds cliche but it's true so just deal with any way you feel comfortable and keep coming back for support. We love you and we are right there with you each time you add a piece to the puzzle.",
      "MessageIndex": 15,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/736584",
      "Title": "When do I cry? seaofhope one-L"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Nov 9, 2011 02:49AM - edited Nov 9, 2011 02:50AM by sutherndiva Although I have no experience with dual pathology, I just wanted to wish you the greatest of blessings and peace as you put the puzzle to your survival together. There are so many wise women here I know someone will have something familiar to share:):) Racheal",
      "MessageIndex": 3,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/777664",
      "Title": "Dual pathology? kestrelgurl kestrelgurl"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 30, 2009 08:49AM sutherndiva wrote:  Hey Nannie, I am sorry that you had to join the sisterhood but you can rest assured that our support will never waver for you, as a newbie these ladies are unwavering in their committment to encouraging you and they are fabulous resources of info. So with that said, just like Idaho said Ductal Carcinoma In Situ, which in my simple understanding means that your breast cancer cells are a still like very normal cells which is a good thing and the fact that it is contained in one area is even better. I am a novice to the BC thing but I believe that your BC is in the very early stages which gives you a great prognosis and obviously some sharp docs who were paying attention. So feel assured that you will be given a TON of info and tests and appointments in the coming weeks to determine the strategy that is best for your situation. Just give yourself permission to behave abnormally(cry, get mad, scream, I still do a lot of these:) and know that there are many that have walked this path and not only survived but THRIVED!",
      "MessageIndex": 2,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736647",
      "Title": "just diagnosed nannieS sutherndiva"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Jun 4, 2009 01:30AM sutherndiva wrote: Good point Otter I literally tune out sometimes. Just TOO much Info!",
      "MessageIndex": 34,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/735216",
      "Title": "If cancer, do they call me??? jjjmjoh I_am_4_GOD"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Feb 18, 2013 02:24PM sutherndiva wrote: I am so sorry that you have to go through this. I have been where you are about 4 years ago to be exact. i don't have any children so I can imagine that only makes it more difficult. Without knowing the full diagnosis, stage etc, I would go out on a limb and say that YES you will survive. Treatments have become so advanced and accurate that a lot of us that started out with not so good situations have been given a second chance at life. So here is simple advice from me- denial is not really a bad thing in times like this. I don't mean denial in terms of getting treatment, meds, doc visists etc. I mean you don't have to know EVERYTHING AT ALL TIMES. Take in only as much as you can at a time. Take someone with you to visits, takes notes and when you have dealt with what you can, THEN deal with more. In my opinion cancer is as much mental as physical. It can kill our physical bodies but it can also control our minds while we are still alive. This may sound cliche, but just LIVE. One step, one minute one day at a time. If I can be of any help message me. As your doc for sleep aids if you don't start sleeping, trust me a restful night makes everything look better:) ((((((hugs))))",
      "MessageIndex": 23,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800344",
      "Title": "Please tell me I will survive this. indenial sutherndiva"
    },
    {
      "AuthorID": "sutherndiva…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/84673/profile",
      "Content": "Feb 18, 2013 02:26PM - edited Feb 19, 2013 10:35AM by sutherndiva",
      "MessageIndex": 24,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800344",
      "Title": "Please tell me I will survive this. indenial sutherndiva"
    }
  ]
}