{
  "AuthorID": "Suz-Q",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
  "Posts": [
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 28, 2016 02:31PM Suz-Q wrote: Thanks whippetmom. I'm having a hard time finding doctors who do this procedure. I know that there are many well qualified docs doing this, but I'm having a hard time figuring out who they are!",
      "MessageIndex": 158,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 29, 2016 03:09PM Suz-Q wrote: Thanks lane4 and dancetrancer! Dancetrancer, I registered on fatgraftpatients.com but can't figure out how it works. I can't seem to see any post or join any discussions. I can log in",
      "MessageIndex": 161,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 31, 2016 06:43AM Suz-Q wrote: thank you dancetrancer! I was able to see everything last night. I guess I'm just avery impatient person!",
      "MessageIndex": 163,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 19, 2018 11:51AM Suz-Q wrote: I've had FG three times. What kind of information are you looking for? ",
      "MessageIndex": 183,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 12, 2018 06:41PM Suz-Q wrote: Imkopy2, Sorry I didn't get back with you! Looks like you got some good responses. I've been on Pentoxifilne and vitamin E for 1.5 years to soften up my radiation damage. I had another round of FG in December. I found out too late in the process that the Pentoxifilne is strongly antiangeogenic. My fat take has always been way lower than most people. However, Last summer, my plastic surgeon did comment that I had the softest radiated breast that he had seen. I think it's due to the fat grafting and the Pentoxifilne + vitamin E. even though the fat didn't take very well the fat that was transfered healed some of the radiation damage. Good luck",
      "MessageIndex": 192,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 22, 2016 08:38AM Suz-Q wrote: Has anyone done fat transfer to lumpectomy site? I just finished radiation and my PS said to wait 6 months before I have a consultation.",
      "MessageIndex": 156,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 16, 2016 07:50AM Suz-Q wrote: Oh, just wanted to add, my RO wouldn't let me use any topical antioxidants, take any antioxidants, or drink any antioxidants. So I have not taken any vitamin E, Fish Oil, C. I haven't used any creams with vitamin E or C in it either. I only use what he prescribed. I haven't had any tea, black, green, white or rooibos since the middle of December. I'm counting the days until I can sip hot tea on a cold night! My RO gave me a long list of supplements that I wasn't allowed to take. I want my cancer GONE, so I'm not tempting fate on this one!",
      "MessageIndex": 656,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 22, 2016 07:57AM Suz-Q wrote: El Tigre, I'm in total agreement with Kimmer. I held off until yesterday, a week after completing my rads. I didn't want to confuse the side effects and wanted a little time to heal. My first MO said to wait and I didn't see the second MO until after rads were over Etnasgrl, I used exercise to minimize fatigue and felt it really helped. Fatigue would hit me around 8 in the evening and I'd be in bed by 10. I'm usually an 11:00 pm bedtime person. I never felt tired during the day thank goodness since I work full time. Good luck!",
      "MessageIndex": 805,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 28, 2016 07:46AM Suz-Q wrote: Yay Cubbie!!!! Let the healing begin!",
      "MessageIndex": 927,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 1, 2016 05:59PM Suz-Q wrote: Yikes this thread moves fast! Octogirl, I started having the shooting pains last week! 2.5 weeks post rads. I'm going back to my physical therapy stretches and I'm going to massage like crazy. I'm sure my husband thinks I'm really weird since I've been massaging my breast for a half hour or more during movies or Downton Abbey! Our TV room is in the basement away from risking my 21 yr old son seeing me working on my boob! I can just imagine what he would think of his mother if he caught her in the act!",
      "MessageIndex": 1013,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 9, 2016 11:28PM Suz-Q wrote: Marijen, yup, I sure did! I never used an antidepressant or anti anxiety medication before BC! I've said it before and I'll say it again, it's the best thing I've done for myself since being diagnosed! HappyHammer is so right on. It's there, take it for a short time to get through this terrible adjustment to BC! I was a basket case before starting rads. I was crying all the time, I was extremely paranoid about long term radiation SEs. I nearly didn't do the boost. I'm done ,it's over, I'm glad I did the whole prescribed treatment! I couldn't have made it through without Celexa! I am happy and feeling \"normal\". I'm seeing my PCP in April to discuss going off it. BTW, Xanax made me very sleepy,start with a 1/4 or 1/2 pill until you know what works best for you.",
      "MessageIndex": 1198,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 20, 2016 05:16AM Suz-Q wrote: Neen56 I'm five week out and feeling really good. You should be fine for your trip. I agree with Octogirl, exercise now! Fearless, I started Arimidex a month ago. I was really scared at first, but took the plunge a week after rads were over. I couldn't bear stressing over it any longer! The first week I had some brain fog, and a nearly non existent head ache, since then I think my sinus have had a bit more drainage(yuck Sorry) but it could be winter in Michigan too! No aches or hot flashes or anything else yet! I've been hanging out over here and it's been helpful: Topic: For Arimidex (Anastrozole) users, new, past, and ongoing",
      "MessageIndex": 1498,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Apr 5, 2016 11:45AM Suz-Q wrote: Hi Fearless, I'm 2.5 months out from rads. I can feel a definite thickening of my skin and breast tissue. My muscle in the treatment area has become more stiff. I have been stretching all along, but noticed 3 weeks ago that my muscles are getting tighter. I went back to my RO and she prescribed OT and lymphedema treatment. I had my evaluation and first treatment this morning. I thought my axillary webbing had gone away, but therapist found that I still have some going on as well as my other problems. The therapist also worked on my breast area to get the fluid flowing out. I have no arm swelling at all My radiated side is much perkier. I've gone for three reconstruction consultations and all the docs say they will lift my left side to match my right breast. I'm having fat transfer done in hopes of filling my divot and improving the radiation damage. Anastrozole is not causing any side effects for me. I just filled my next 3 month prescription with the Teva brand everyone keeps talking about. However, since I'm not having any SEs I'm sure I won't notice any difference. Mary, take it easy on your first couple of weeks back at work! Congratulations to all of you who have finished! I have enjoyed getting back to life since treatments ended. It's so nice to focus on something other than cancer! I felt well enough mentally and emotionally to go off of my antidepressant, Celexa. I had been on it for three months. My last day was two weeks ago. I'm so glad it worked for me during those dark days before and during radiation! Much love to you wonderful ladies! I couldn't have made it without you!",
      "MessageIndex": 2413,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Nov 28, 2015 03:18PM Suz-Q wrote: Thank you! I wish I weren't here. I'm having a really tough time handling this cancer diagnosis. I spent the day before Thanksgiving crying. Radiation therapy and all of the side effects and the ongoing long term effects makes me wonder why I didn't choose a mastectomy! I'm scared. Every time I get really good news back from test results I feel more like crying than celebrating. My Oncotype score came back a 10 on Tuesday. I really should have been celebrating, no chemo for me. I'm going to talk to my doctors about getting counseling. Sorry for being so negative.",
      "MessageIndex": 69,
      "PostDate": "28/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Dec 31, 2015 02:51PM Suz-Q wrote: I had my 12th of 16 today. I super fair too. I can just barely see a blush to the upper area of my treatment. My RO prescribed Mometisone cream to start using from the first day. It's a corticosteroid. My nipple is starting to become a little tender as well. I'm small breasted, like a n A/B cup, I'm wondering if small breasted women might have it easier. Tomorrow the doc and techs will do a planning session for my boost which will be 5 more treatments after the whole breast is done. My center is closed on New Year's Day so I will end up having two three day weekends off in a row. I hope this doesn't make my treatments less effective. My RO couldn't give me an answer for that one. sos1125, I did not get a mammogram after surgery or before radiation, just a ct scan and x-rays. That would just be cruel! Thr yet, you need at least a month or more off to heal from surgery before starting radiation. I don't know where you live, but ask your RO if you can stretch the time out until you start rads toMarch or so when the weather starts getting better. 50 miles each way is tough!",
      "MessageIndex": 343,
      "PostDate": "31/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 5, 2016 12:42PM - edited Jan 5, 2016 01:20PM by Suz-Q ctgal48, my MO was fine with me waiting for a month after radiation was done to start on Arimidex. Im not very anxious to start it with all of the possible side effects. I am getting a second opinion on the 14th. I heard that Doctor likes to start women on tamoxifen and switch to an AI after a couple of years. Neither sound wonderful to me! I told myself that I will keep an open mind about the drugs and deal with any side effects when and if they happen. Many women don't have side effects. Shopgal2, the nurse had me watch a short film on radiation then she went over ALL of the details. Keep pen and paper close by so that you can write down questions as they pop into your head. I see my RO once a week so I always have a list ready when I see him. My RO nurse said I could wear deodorant because that area was not in the radiation field for me. I am not having lymph nodes treated. From what everyone is saying it sounds like every doctor has a different cream preference. Mine had me using a corticosteroid from day one! So far I'm barely pink! I have 2 more days on the whole breast to go! I haven't tried anything else. I asked my RO this morning how long after treatment endsbefore I will start healing. He said about a week after I stop having treatment. Since I have two different treatments, whole breast and boost, most of my breast will start healing then a week later my boost area will start healing.",
      "MessageIndex": 412,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 11, 2016 12:33PM - edited Jan 11, 2016 12:35PM by Suz-Q Octogirl, Congratulations on finishing! I'm right behind you, my last day is Wednesday! Marijen, I read the article and I have felt all along that radiation is overkill for my situation. In hind sight I really think partial breast radiation would have been enough. My RO said that he expects in the next 5 years we will see a lot of change in cancer treatment. I believe more individualized care plans will emerge. 1957, I got x-rays everyday of my whole breast treatment. They would line up the images on the computer and adjust the table accordingly. I'm glad they were making it as accurate as possible. Ha ha Peachy2, I'm with you about losing track of how many new aquatints have seen my breast in the last few months! Loved your wig story! Jd2015, I feel for you. I felt really stunned and lost too! Just before starting rads I couldn't stop crying all of the time. I made an appointment with my primary care physician and he put me on Celxa an antidepressant. I feel like a new person. I wasn't handling any of this cancer business even though every test came back great and my prognosis is excellent. All I did was get more and more unhappy. I couldn't believe that I could get cancer. I was/am one of the healthiest 56 year olds that I know. I thought I was doing everything right. I had a healthy diet, maintained a low BMI, exercised regularly, etc. and was totally stunned with the diagnosis. If you are this unhappy, Don't wait, get help! My doc said he would help me get off the meds when I needed to. Good luck!",
      "MessageIndex": 518,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 14, 2016 02:43AM - edited Jan 14, 2016 02:56AM by Suz-Q Sorry to hear you're feeling so bad lindab143! marijen, For example, if your recurrence rate was 30%, 66% of 30 is 19.8, so you would be left with a recurrence rate of 10.2% after treatment. I would be good to know what number your RO is talking about!",
      "MessageIndex": 587,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 14, 2016 04:52AM Suz-Q wrote: I wish we had a \"like\" button. I don't always feel the need to write anything, but would like the opportunity to concur with many of the posts! Really nice HH, I \"like\" it!!!",
      "MessageIndex": 1291,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 16, 2016 12:18PM Suz-Q wrote: mdoc, I found my lump 3 months after a mammogram. I have dense breast. Got the letter saying they were dense, but no one told me what that meant! I didn't know the mammogram wouldn't pick up on BC in dense breast. I was so pissed! On the day of my lx I let the radiologist know that the letter sent to patients needed to have something in it to direct women to more information about breast density. He actually took my suggestion! I hope other women benefit from my complaining. I'm done with everything except Arimidex for the next 5 years. I do not feel cured at all. I believe my cancer is managed as best as possible, but the reality is I will never feel cancer free the rest of my life. The next 5 years are when most recurrences happen. Personally, I will never trust a mammogram again. I will be lobbying for an MRI. Im not subjecting myself to more radiation from a mammogram for zero results",
      "MessageIndex": 1359,
      "PostDate": "16/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 18, 2016 11:32PM Suz-Q wrote: Brightsocks, I did the short treatment, 16 and 5 boosts. I didn't have any problems. I turned pink by the end, I didn't have any soreness or itching except for the nipple, I never peeled, I did turn purple-red with deep freckling over part of my breast after treatment ended, I'm slightly tan now. It's been a month since my my last treatment. I do get a few twinges of pain now and again, but nothing terrible or lasting. Please remember everyone's experience is different. If you have any concerns make sure your RO knows about them. BTW, I upped my workouts during rads to battle fatigue. I think it helped. I was tired each evening after work, but not too bad! Good luck! you will make it through rads just fine and any remaining cancer cells will be toast",
      "MessageIndex": 1453,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 18, 2016 09:23PM Suz-Q wrote: morelandks, so sorry to hear about your ring! (((Hugs))) hopefully some honest person has found it and turned it in",
      "MessageIndex": 1476,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Nov 28, 2015 10:29AM Suz-Q wrote: Hi, I go for my simulation on Dec. 8th and hope to start therapy during the holidays. Im doing 16 treatments with 5 boost at the end. I'm wondering how radiation will affect the healing process of my lumpectomy site and my sentinel node biopsy site. Does anyone know what it will do to the scaring/healing process? Right now I can still feel a small seroma in the lump ectomy site and the sentinel node biopsy site is hard along the scar. I had 40 cc's of fluid taken out of the sentinel node area two weeks ago due to a seroma",
      "MessageIndex": 63,
      "PostDate": "28/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 1, 2016 10:24AM Suz-Q wrote: Had my simulation done for my upcoming boost this morning! A CT scan and one more tattoo. After my radiation treatment the tech said \"we will go next-door for the CT scan.\" I had not even remembered being in that room for my set up the first time around. I could've sworn it all took place in the same room where the radiation was done. I must have been really losing it. Once I got into the room and got under the CT scan I remembered the little sticker that was on the machine. It was little cartoon sticker that was starting to wear off. The first time I had radiation one week after the sim, I thought to myself \"where's that little sticker that I saw when I was here before.\" Well Duh! The sticker was on the CT machine in the other room, and not the linear excellerator! Thank goodness for Celexa my antidepressant. I'm feeling great, thinking clearly, and positive for the first time in months! My boost area is about a three inch circle over my scar/ tumor bed. They will be using 6 MeV electrons. Electrons only go so deep before they stop. The use of photons or electrons depends on your anatomy and the location of your tumor. It also depends on how deep your tumor bed is. I'm still barely pink. The only irritation is my nipple. After I take my bra off I can't stand it rubbing on my nightgown. Hoping the effects won't get much more worse before the end. My RO said I may start experiencing fatigue next week. I've been working out 30-50 minutes a day stretching, using weights, and doing cardio since I've been off of work for the holidays. I usually only workout 3-4 times a week. I hoping exercise will mitigate some of the fatigue problems. I go back to work on Monday and really worried about fatigue hitting me. Both of the RO's I talked with were happy to hear that I exercise. They said it may help. I'm hoping it will! I'm not a super workout kind of person, however I have been exercising regularly for the past 3 years to stay fit. After I went through menopause I noticed a few extra pounds and I noticed my physical strength had really decreased, so I started working out on a consistent basis. If you need a laugh, my daughter and I went to see Sisters(Tina Fey, Amy Poehler) at the movies this week. I thought I'd bust a gut I laughed so hard. I started thinking about one of the scenes during treatment and had to stop myself thinking about it. I was afraid that I would move too much from stifling a laugh. Be warned the F word is used frequently throughout",
      "MessageIndex": 357,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 2, 2016 09:13AM Suz-Q wrote: PattyMeg, your blanket stealer is adorable! Pets are so positive to have around. They give so much unconditional love! Catfurr, HappyHammer is right on about the Ativan. Do what it takes to get you through this! I'm on Celexa for three weeks and couldn't be happier! phoebe58, I love your Tennyson quote! Indeed 2016 will be happier! Ctgal48, I'm not sure how they determine who gets the boost. The percentage of remaining recurrence is cut in half with the boost. They target only the tumor bed where most recurrences will happen. In my case one of my surgical margins was less than 1 millimeter. Too close for comfort even though it was clear. mdoc524, Congratulations on finishing chemo! How much time off do the docs give you off before starting radiation? Thank You! For being our moderator! I don't know how you have done this during chemo and having twins to care for. I've been exploring the I WANT MY MOJO BACK discussion board in preparation for the next treatment phase after radiation is over. So glad to have so many different topics to explore here! I've seen one MO and he prescribed Arimidex. I'm getting a second opinion on the 14th. The first doc did not give me any warm fuzzy feelings, rather he made me feel very alone on this cancer journey and that contributed to the down turn in my mental state. For me, the worst part of this battle has been in my head!  ",
      "MessageIndex": 377,
      "PostDate": "02/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 4, 2016 11:00AM - edited Jan 4, 2016 11:01AM by Suz-Q lindab142, glad you laughed your butt off at the movie! We need these distractions right now! Mary, I loved the pictures! How nice of your family to celebrate with you! Julie, congratulations on finishing rads! I hope I fare as well as you did! Justmaximom, I'm going back to work today too, I've only been off two weeks though. I'm a little scared of fatigue hitting this week, it's my fourth week of treatment",
      "MessageIndex": 397,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 11, 2016 02:48PM Suz-Q wrote: HappyHammer, my nipple was really itching and sensitive, but once I started the boost it seems normal. My nipple is in my boost area because my scar is located at the edge of my areola, and the scare is always included in the boost too. They are using 6Mv electrons for my boost. I don't know if electrons versus protons makes any difference",
      "MessageIndex": 521,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 14, 2016 10:52AM Suz-Q wrote: Marijen, I don't know what my Ki67 is, only that it was part of the Oncotype test. It is not given in the results.I have totally given up on trying to figure out my recurrence rate! I've read so many things and they are all different. I'm not sure our docs can really give us an individual recurrence number. I guess my point might be that we are all doing the best we can so that our overall survival and recurrence rates are as low as possible. We can't do much more really. Oncotype only guides us on whether or not chemo is necessary. Mapagail, thank goodness the treatments don't take very long! I would get itchy spots on my face or my gown would be wadded up and making my legs feel like they needed to move after I was in position and couldn't be moving. The worst is when my nose would itch! Sometimes I would warn the techs before we got started that I needed to get my wiggles out! Etnasgrl, I loved the treasure map visual! People on here are so creative with their descriptions! Peachy 2 called the blue sharpie marks drawn around her lumpectomy bed an amoeba. Yes indeed we start with a treasure map and progress to amoebas! My techs said they could draw the marks back on. They took pictures of it before I got up off the table. My marks came off with the cream I use and I didn't worry about it. It did make a smeary blue mess on my breast. El_tigre, I'm impressed with the 40 second breath hold! Ladies, I know it must feel good to get started. I hope you all do well with treatment!",
      "MessageIndex": 601,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 16, 2016 06:37AM Suz-Q wrote: Here's my 2 cents worth on the short schedule (16 days 42.5 Gy and 5 days boost 10 Gy). I started turning slightly pink and I had very mild swelling at the beginning of week three. At that point my nipple was very sensitive to rubbing or touch. I started feeling a small amount of discomfort by the end of week three and my skin looked dryer under the cream I was using. I did not need any pain relief. Once I started my boost I had speckled areas from the top part of my treatment area that faded about half way down. Most of my redness is located under my arm. Once I started the boost my nipple quit hurting even though it was still in the treatment area of the boost. My skin got worse looking by the end of the first week after whole breast rads were finished. I'm three days done with the boost and everything. My boost area looks the same. I look a little tanner in the pink splotchy areas. I also started to feel a little more tired in the evening this week. I've not had any problems wearing normal underwire bras for the last two days. I've been able to work full time without any problems. I had my rads at 8:00 a.m. each morning and my employees never even knew. I did not want them knowing since I live and work in a small community. I am truly sorry for you ladies that have suffered and are still suffering. My experience wasn't too bad. I'm guessing it's because I have very small breasts. I went to a new MO yesterday and really liked her. I will be starting arimidex in two weeks. I didn't want to confuse any side effects from radiation with the AI.",
      "MessageIndex": 654,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 19, 2016 08:15PM Suz-Q wrote: Congratulations Happy Hammer, Cardinal, and PattyMeg on finishing this week! I'm two weeks out from finishing whole breast rads and one week from the boost. I haven't seen any real change in the boost area since finishing. The area at the upper part of my radiation field for the whole breast and under my arm still look grey-brown-pink speckled and are improving a bit each day now. My BC nurse navigator said it should heal quickly now Good luck to those starting rads this week. It will be over before you know it! ",
      "MessageIndex": 740,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 23, 2016 11:36AM Suz-Q wrote: Hi Duzy, I did physical therapy to improve my range of motion and reduce the axillary webbing that had developed. It really helped. I still do some of the stretching exercises. My surgeon referred me to PT after I complained about muscle tightness. My PT is trained in massage and works with many BC patients. The sim is the longest time in the entire process that you will have your arms up. Treatments go very quickly. Good luck",
      "MessageIndex": 830,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 9, 2016 11:33PM Suz-Q wrote: No one offered them to me. I made the decision to see my PCP and ask for help. Of course sobbing nonstop in the RO's office after my first treatment made her fully agree to put in a call to my PCP, so he was well prepared for my office visit! Good Luck",
      "MessageIndex": 1199,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 18, 2016 06:43PM Suz-Q wrote: Brightsocks, I didn't start getting fatigue until the end of my boost. I really only feel tired in the evening. I have a normal amount of energy throughout the day. I'm 5 weeks out from treatment and sometimes I still feel a bit more tired than I think I should. Mostly I feel back to normal. My work is not physically demanding, so it hasbeen easy for me to work full time throughout treatment.",
      "MessageIndex": 1463,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 21, 2016 06:39PM - edited Jan 21, 2016 07:17PM by Suz-Q Congratulations to PattyMeg and Jabe! I know you're smiling right now! And for the rest of you in treatment another week nearly down! Yay",
      "MessageIndex": 793,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 2, 2016 06:42AM Suz-Q wrote: Beautiful Andraxo!!",
      "MessageIndex": 1766,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 27, 2016 11:10PM Suz-Q wrote: Tam-iam, Your weekly visit with the RO should have taken place in one of the exam rooms. This is a very tough time and you have every right to feel the way you do. Some of us are more sensitive and feel more vulnerable from time to time. I happen to be one of them. Marijen made some good points about speaking up. I always had a list of questions for my RO, but you weren't really given that chance. I have found,from time to time, that doctors, no matter how good they are, forget to relay important information to patients and you feel like you just slipped through the cracks. I learned this the hard way two years ago when I had a revision surgery. It has made me tougher and I speak up more for myself. Before your next RO visit Let the nurse know what happened and how this made you feel. Make sure she also knows that you didn't get any pre treatment education. I'm sure she will relay your concerns to the doctor. Good luck!",
      "MessageIndex": 920,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 4, 2016 12:02PM Suz-Q wrote: Twnkltoz, I love the idea of a hair funeral! Ha! too ingenious! Morelandks, sorry your RO has been so awful! No one should treat cancer patients, or any patients that way. As for hormone therapy, I'm on Anastrozole and I haven't had any problems so far. My brain has been functioning at full speed since finishing treatment. We are under so much stress and anxiety during treatment that I can't imagine anyone thinking straight! Once I finished rads and started my new, normal, post BC life I felt mentally and emotionally stronger, normal, again. In fact I've been bored at work and took on a couple new assignments. Today I didn't have enough hours to finish everything I wanted to get done. It felt great to have my focus back on work and not on BC!",
      "MessageIndex": 1844,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 6, 2016 03:52AM Suz-Q wrote: I did the 16 fractions with 5 boost at the end, the Canadian protocol. I'm very small breasted. Everything went very well. My skin didn't turn color until the end and then very freckled about a week after. I had no peeling or pain during the process. I had a few shooting pains last week, but started massaging and doing stretching exercises and everything has been great this week! Enstagrl, I didn't notice any difference when I started boosts. Actually, my nipple stopped being irritated even though it was in the boost field. The boost field turned slightly more tan about a week or so after I finished. I finished everything on January 13. I'm still a little tan in some areas, but more than half of my skin looks normal color again. I've read that the pectoral muscle gets a bit stiff and sore at three months when it begins to heal. Has anyone else heard of this?",
      "MessageIndex": 1098,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 10, 2016 09:17AM Suz-Q wrote: Congratulations to all of you ladies finishing up! It seems like so many of you have finished lately! Yay! Katja, I speak your language, I have a MLS degree! Brightsocks, my RO said to wait two weeks after I finished before adding vitamin C and my other antioxidants back into my diet. Mdoc, I loved your wedding picture. It's so nice to look back on happy life events",
      "MessageIndex": 1994,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 14, 2016 12:31AM - edited Mar 14, 2016 12:32AM by Suz-Q Kate, You are young and will have a real battle with hot flashes for some time. My RO prescribes Effexor, which is an antidepressant, for women suffering from them. It has shown to ease hot flashes as well as hormone replacement therapy. I went through menopause 8 years ago with very mild hot flashes. I'm haveing very, very few and only while sleeping now that I'm on Anastrozole. Everyone is different, good luck! http://www.breastcancer.org/research-news/effexor-vs-hrt-for-hot-flashes",
      "MessageIndex": 2079,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 3, 2016 03:23AM Suz-Q wrote: Congratulations to everyone finishing!!! It really does seem to go fast once you get started! Thank you God that this part of treatment is over!",
      "MessageIndex": 1794,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Dec 26, 2015 09:32AM Suz-Q wrote: 2mnykds, I work full time too. I'm off over the holidays, but return to work toward the end of my treatments at the beginning of January. I'm worried about fatigue, however I talked to someone who finished recently and she never experienced any. I'm hoping I will be so lucky. I live about 15 minutes away from my treatment center and have the first appointment of the day at 8:00 a.m. I have not told any of my employees because I'm rather private. I work with the public all day long in a very small community. I don't want people asking me about my health or feeling sorry for me. This is just the way I am. I lost 25 lbs 2 years ago and I had to endure too many comments about my weight loss then. This was uncomfortable for me in my position. I have scheduled myself off at least one day during the last week of treatment and the following week as well just incase I need a little rest during the recovery period. My job is not physically demanding so I feel I should be able to handle it. My children are all adults, I only have one still living at home. My husband is very supportive and cooks most of the time. It gives me time to exercise 4 or 5 times a week. I need this for my physical and mental well being.",
      "MessageIndex": 287,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 3, 2016 09:20AM - edited Jan 3, 2016 09:21AM by Suz-Q Hi TallnTerrific, I Googled Tomotherapy and the company has a website with patient information. http://www.tomotherapy.com Im sure there must be trial results for this therapy. It looks good. I used the search function on the upper left and there were 20 pages of hits. So, it is talked about here on the discussion boards.I think we all want to navigate radiation with the least amount of side effects Good luck!",
      "MessageIndex": 386,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 6, 2016 10:12PM Suz-Q wrote: tshire, it's not your imagination. My RO asked me if I had any shooting pain or twinges at my one week visit. He asks if I'm experiencing any pain at each visit. It is common and normal. I did not have any. I'm having my last whole breast treatment today then on to the boost. I am starting to feel a little difference in my breasts this week, and my radiated side is starting to get a light pink tinge that doesn't go away. So far my skin is holding up. Who knows what the boost area will look like in another week",
      "MessageIndex": 429,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 13, 2016 11:00AM Suz-Q wrote: Mdoc2524, So sorry to hear about your mother-in-law! I hope she makes a complete recovery. It must be a real challenge for you trying to recover from chemo and then to worry about her too! (((Hugs))) I swear I could feel a tiny tingling in the treatment area when I had my rads this morning! Has anyone else felt like they could feel the energy going in? My skin is holding up fairly well. The upper area is faint pink with small splotchy areas. The breast area looks normal color. The most pink is under my arm. I'm wondering if my deodorant was getting down that far and irritating the area. One week from tomorrow and I should be on the positive side of mending! Looking forward to wearing a normal bra in a couple of weeks! Oh the little things in life that can make a person happy! So glad we are all doing this in the wintertime. It's so much easier to cover my sports bras with sweaters and I'm sure the heat would increase the uncomfortable side effects. Is anyone on tamoxifen or Arimidex? I'm going for a second MO consult on Thursday. I'm leaning toward taking Arimidex. I've come a long way since the begining of this horrible journey. I obsessed over all of the negative aspects of radiation therapy. I read every trial I could and assumed the worst. Now I'm looking at the next treatment step without too much trepidation! I'm actually thinking positively. I'm going into this phase with the expectation that I won't have more than mild side effects and if they are bad, that they can be managed in some way!",
      "MessageIndex": 563,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 16, 2016 10:12AM - edited Jan 16, 2016 10:13AM by Suz-Q Fearless, I can eat antioxidant foods and even take a One-a-Day vitamin because they dont have concentrated high doses of antioxidants. My RO said no tea though. He said I can resume taking the antioxidants two weeks after I complete radiation. I didn't find that the boost bothered my nipple. In fact my nip started feeling better about the time I started my boost. If you have a boost it will be after the 16 days of whole breast.Actually, the boost hasn't changed my skin at all. It works deeper. I think the boost hits the lumpectomy bed with most of its energy. The way my RO and techs explained it is the electrons only go so deep and then they stop unlike the the way whole breast radiation works where the photons keep going through and out. That's why the RO's need to be so careful with the angles and such so that we don't get \"hot spots\" of too much radiation in some areas. I'm really surprised your RO or her nurse hasn't explained more. I had to watch a long educational video, they gave me a nice binder with tons of info, the nurse went over the list of things I couldn't take, whether I could weardeodorant or not, and lots more. I hope you have a nice long list of questions for your RO next week! If you don't understand something ask her to explaine it in a different way. This usually works for me.You'll be fine, good luck!",
      "MessageIndex": 661,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 23, 2016 11:58PM - edited Jan 24, 2016 12:00AM by Suz-Q TallnTerrific, my RO prescribed Momentasone cream. I used it from the start and still am. It's all I've used. RO said to keep using it two weeks after the last treatment. I didn't have any severe reactions to rads. I don't know if it was the cream or me. It's a corticosteroid so it should keep some of the inflammation, itching and pain down. Nothing will make our damaged skin and tissue heal faster except time! My \"radiation rash\" is starting to resolve. I see larger islands of normal skin among my rash area.",
      "MessageIndex": 835,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Aug 3, 2016 09:17PM - edited Aug 3, 2016 09:20PM by Suz-Q 1957-2057, My RO prescribed Trental and Vit. E. I did PT and OT for range of motion, swelling, and muscle tightness and pain. It helped a little. The Trental an E took away the swelling and over half of the muscle problems. I'm getting fat grafting to the breast tomorrow. Our breast stem cells were lost and damaged during rads. The stem cells in fat help bring the breast environment back to a more normal state. After radiation the cell turnover process and the cell response to injury is out of balance. This is why fibrosis occurres. To much scar tissues is being made and there is nothing to tell the cells to stop. The cells do not have the right signals to know when to stop. New stem cells will restore some of the lost signaling and return the balance to the different phases of cell turnover. The Trental is a vasiodilator which changes the shape of the red blood cells making them smaller. This way they can get into smaller blood vessels bringing oxygen to the damaged area and healing. Radiation damaged out blood vessels too. Tell me again why breast conserving therapy is so great?",
      "MessageIndex": 2637,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Dec 24, 2015 03:17PM Suz-Q wrote: I started radiation on Dec. 14. I'll have 16 treatments and then a boost to the tumor bed of 5 treatments. Today was my 8th treatment, so I'm half way through the whole breast part. I turned a little pink yesterday afternoon, but it was gone by evening. My doctors prescribed mometasone cream to use from the very start of treatment. They said to use it every day and I can increase to twice a day as needed. I like my RO and really love the radiation techs at the center. Everyone is very, very kind. I'm in and out in less than 15 minutes most days. Monday's I meet with the doctor. They check my weight and my breast, ask if I have any questions. I was really having a difficult time adjusting to the cancer diagnosis. I hated all of the choices, and I am still afraid of the long lasting effects of radiation. I was to the point of crying all of the time. I even called in sick for a half day of work, I was falling apart. This was very unlike me to do so. I tried two different counsellors with no relief. I finally went to my primary care physician. He really made me feel secure. He told me that I would get through this and he would be there for me. He really said so much more and he was extremely caring and sincere. He prescribed an antidepressant (ssi) and Xanax. I'm not sure which worked, his kind and reassuring words or the drugs! I think the combination of the two. I've never been on antidepressants before, but I must say they have worked a miracle for me! If you are suffering don't hesitate to ask for help. My mind is so much clearer. I was dwelling on the most negative aspects of treatment without giving a balanced thought or consideration to its benefit.I feel like I'm at the point where I can come to terms with my diagnosis and grieve too. This is such a difficult emotional journey for me. The surgery and treatment are nothing compared to the emotional toll this disease has taken onme. ",
      "MessageIndex": 277,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Dec 25, 2015 11:06AM - edited Dec 25, 2015 11:17AM by Suz-Q Hi 2mnykds, The simulation places you in the optimal position to receive radiation treatments to your breast. Two techs and my RO doc placed me on the table with this bag thing under my upper back, shoulders and head.The bag thing was filled with something that conformed to my body. The doctor and the techs worked hard to make sure I would be comfortable in my mold position for my treatments. My hands were placed over my head and the body mold comes up on each side of me to ensure the exact position for each treatment. They did a CT scan, x-rays and tooksome real photos too. Once they determined the position that they wanted me in one of the techs gave me 5 small tattoos. I had to hold very still for most of it. My breasts were exposed most of the time. They do this on the same table, in the same room, under the same machine that gives you the radiation treatments. Except the treatments are very short.This session is very important. The doctor will determine your treatment plan from the simulation. He/she will calculate the best angles to completely treat your breast with the least amount of damage to normal tissue. The RO also consults with a physicist and a dosimetrist to calculate proper dosage. This part is done after you leave. My treatments consist of two 20 second zaps and two 5 second zaps. I have a 20 and a 5 second zap at one angle and side then the machine swings over me to a different angle and delivers the second part of the dose, a 20 and a 5 second again. Everyone has a different plan because no two bodies are alike. I hope this helps. it's not scary at all!",
      "MessageIndex": 284,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 9, 2016 04:11AM Suz-Q wrote: lindab142, I sometimes feel a little dizzy getting up from the table too. I contribute it to my high blood pressure. I would agree that the last 5 treatments to the lumpectomy bed will be your boost. I had to have a new CT scan, set-up, and sim. It doesn't take very long to do. The treatment is very close to the breast. I love my techs, but I will be so glad to have this over!",
      "MessageIndex": 476,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 9, 2016 06:20AM Suz-Q wrote: Peachy2, I had quite a mess in my bra last night! I used tissues today too. Tie dye makes pretty effect at least! How many days do you have left? That metal template would make an interesting conversation piece! ",
      "MessageIndex": 479,
      "PostDate": "09/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 11, 2016 10:29PM Suz-Q wrote: Cardinal, Sometimes they will do two treatments in one day if your last one ends on a Monday. You should ask. I hear you about the SE's of hormone therapy. I looked at them over a month ago and I'm not looking again. I'll make myself crazy if I do! Been there and done that with Radiation!Many women don't have side effects. I'm taking it one day at a time. I meet with a MO on Thursday. I met with one already at the beginning of December. I didn't have any warm feelings for him so I'm trying again.",
      "MessageIndex": 524,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 14, 2016 01:10AM Suz-Q wrote: Keepwalking- Loved your photo! Thank God for chocolate. I couldn't have made it through without it! ivy@-Loved the comic! I have one big smile on my face today, I had my last treatment this morning. I'm so HAPPY to be DONE!!! I'm going to do fat transfer in the fall after most of the healing is done. I'm doing it to improve the skin quality and fill the lump dent. I've read much about fat transfers ability improve the skin and tissue fibrosis after radiation.",
      "MessageIndex": 583,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Nov 28, 2016 01:51AM Suz-Q wrote: Hi Mary, So sorry to hear about your double loss! That's quite a blow for you and your family. Congratulations on your weight loss. I'm on Anastrozole and was having so much fatigue with it, I wanted a nap by 3 pm every day! When I complained to my MO about it, she blew me off. I had fat grafting to heal some of the radiation damage in August, I took a five week break from Anastrozole and haven't had the fatigue since. The nurse practitioner at my MO's office said that sometimes after a break the symptoms subside. I've been back on it since September 1, so far, so good! It has been one hell of a year and I think a small part of my fatigue may have been stress related, but I also believe most of it was due to the medication. Good luck -Suzanne",
      "MessageIndex": 2651,
      "PostDate": "28/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 2, 2016 02:23AM Suz-Q wrote: Happy Healthy New Year to everyone! I'm enjoying the new year with my coffee and my kitty this morning! He is a beautiful mut that I rescued from my brothers farm two years ago. He's quite a lover boy and lap kitty! ",
      "MessageIndex": 364,
      "PostDate": "02/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 3, 2016 07:44PM Suz-Q wrote: TallnTerrific, I'm sure your RO friend is concerned about the radiation exposure to your heart. Will you be doing treatments in the prone position? That's where you lay stomach down.My center does not offer the prone treatment yet. For left side cancers the prone position can keep the heart and lung out of the treatment field for many patients.",
      "MessageIndex": 394,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 8, 2016 10:22PM Suz-Q wrote: TGIF, 2 days off! I'm on the home stretch now. Three more days next week and I'm done. My skin is holding up ok. I have an itchy nipple, starting to see some red spots under my arm , and my upper area has a blush going on. I don't think I have any fatigue. I've been exercising often to keep fatigue at bay. Id like to think it's helping anyway. It's part of the control freak in me. Not much on this journey that I have control over. I started my boost. I have blue sharpie circle on my breast. It's about 3.5 \" wide which is a lot for a .8 cm lump I think. I'm really small breasted so this covers a large area on me! The techs said not to take the marks off, however my cream makes a big smeary blue mess of it! Happy Healing this weekend!",
      "MessageIndex": 472,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 12, 2016 11:01AM Suz-Q wrote: Fearless, Congratulations on the 16 day schedule! That's what I had plus a boost. I think it's easier than what most are going through with the longer schedule. I nearly opted out of the boost, but I needed it because of my close margins. I don't think it is all that new. The Canadians have been doing it for years. There are loads of trial data on it's effectiveness, so I wouldn't worry. It's a lot more convenient. Remember you are at stage 0 and your RO wouldn't have recommended it if he/she didn't think it was appropriate. Bad news for my sister-in-law, she was diagnosed today with breast cancer. I don't know the details yet. I'm working until 8 tonight and going over to see her after work. I can really feel for what she is going through right now. It's makes me want to cry. She has had other health problems over the years. She 69, she and my brother celebrated their 50th wedding anniversary in August. I was the flower girl in their wedding.",
      "MessageIndex": 540,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 13, 2016 05:23AM Suz-Q wrote: Congratulations Peachy!!!! I'm next! Tomorrow is my last day! My RO did say that the effects may get worse up to a week after we're finished. I'm supposed to keep using the Mometasone cream for two weeks after my last day. I asked when I can start taking antioxidants, he said two weeks after I finish. I'm looking forward to Rooibos tea and healing supplements! I'm also glad to finish since we are starting to get more snow now.",
      "MessageIndex": 554,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 17, 2016 02:46AM Suz-Q wrote: Hi KatieB, I've always eaten healthy, exercised regularly, maintained a low BMI in hopes of keeping away type 2 Diabetes that plagues my family. Not in a million years did I ever consider that I would be diagnosed with cancer. It was a real blow to me. I think that's why I never handled the diagnosis very well and went on an antidepressant a month ago. I'm doing so much better mentally since. My next big hurdle is to start Arimidex in less than two weeks. A bit scared about the side effects, but I'm trying to keep an open mind about them and not invite trouble before it happens",
      "MessageIndex": 676,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Jan 31, 2016 10:08AM Suz-Q wrote: I'm 2.5 weeks done with rads and started feeling breast or muscle or rib pain a couple of days ago. It's not shoulder pain. Although l had shoulder pain before all of this began. Two things, I stopped using the mometasone cream Wednesday and hadn't done any of the stretching exercises my PT prescribed this week. I think there is loads more healing happening than what we can see on the surface. I'm still feeling tired at night too. I'm going back to the stretching exercises in hopes my muscles will stay limber while healing. I'm going to guess three more months. Does anyone know how long the majority of healing takes? You think you're done when rads are over, and you're not! Like someone else said here, this is WORK! BTW, I started on Arimidex 10 days ago, and no SE's yet. Crossing my fingers. Good luck to everyone going through rads! KateB, I felt exactly like you did before starting radiation. I knew I needed to do it, but couldn't wrap my head around all of the side effects and why the medical community thought the SEs were acceptable. I considered not doing it, then considered not doing the boost, then questioned my decision not to have a mastectomy, and finally wound up so distraught that I went on antidepressants! It was the best thing I ever did. I could finally think clearly again after the months of stress that had built up. My heart goes out to you! Cancer sucks",
      "MessageIndex": 976,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 14, 2016 02:23AM Suz-Q wrote: I am surprised at so many of you being tall. I'm the shortest female in my family at 5'7\" and always wished that I was a couple inches taller! Did you know that one study linked height to an increased risk for breast cancer? It is not conclusive. Just thought you might like reading about it. There are many articles on the net about it, but I thought this one was more balanced http://www.nhs.uk/news/2015/10October/Pages/too-soon-to-say-being-tall-increases-cancer-risk.aspx!  ",
      "MessageIndex": 1288,
      "PostDate": "14/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 18, 2016 01:13PM Suz-Q wrote: Mary, I'm not an expert, but doesn't cortisone stop inflammation? And isn't radiation causing inflammation in your breast and on your skin? So it stands to reason that the cortisone shot took away the inflammation of your skin. I was prescribed a corticosteroid cream that I used twice a day during rads. I don't think it's much different. I think the shot just works better. Hope it helps with the shoulder pain!",
      "MessageIndex": 1448,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 18, 2016 01:23PM Suz-Q wrote: Mary, I meant to add that I think you will be just fine! You are a cancer killing machine!!",
      "MessageIndex": 1449,
      "PostDate": "18/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 21, 2016 07:59PM - edited Feb 21, 2016 08:00PM by Suz-Q Brightsox, I did not have any blood work during rads, just x rays, as mine was image guided. I had 42.5 G to the whole breast and an additional 10 G to the tumor bed (boost) mine was hypofractionated 16 days whole breast and 5 days of boost. Myplan never changed. I had three RO's advise the same treatment plan for me. Everyone is unique so every plan is a bit different. The important thing is that your RO is carefully planning your treatment to get rid of any remaining cancer cells",
      "MessageIndex": 1535,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 25, 2016 12:11PM Suz-Q wrote: Congratulations Shopgal! I'm enveous of the ladies who got to ring the bell. There wasn't one at my rads center!",
      "MessageIndex": 1633,
      "PostDate": "25/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Feb 27, 2016 04:15PM Suz-Q wrote: Marijen, I had higher dose per treatment doing the Canadian style fractionation. I had 16 whole breast at 266cG or 4,256 cG total, I had a boost for five days at 200 cG per dose using electrons for an additional of 1000 cG to the tumor bed. I had three different RO's prescribed the shorter Canadian fractionation and boost. I feel quite confidant that my treatment was appropriate for my body and my cancer characteristics. I hope you are feeling confidant as well. I saw my MO today and my BC nurse navigator. I was given a treatment summary and a suvivorship care plan. So far I haven't had any SE's from Arimidex and hoping I won't get any in the future! I'm settling in to my new normal and it feels good not to be focused on BC. My MO said she would see me every 3-4 months for the next two years, then 6 months for 3 years, then annually. I'm really starting to look forward to spring! I hope you ladies enjoy some rest this weekend!",
      "MessageIndex": 1706,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "Suz-Q",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224870/profile",
      "Content": "Mar 9, 2016 12:05AM Suz-Q wrote:",
      "MessageIndex": 1939,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}