{
  "AuthorID": "suz45",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
  "Posts": [
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 29, 2012 11:35PM suz45 wrote: No smack just a gentle {{hug}} Could it be the pills are coated to be time released or slow released. Thats the only reason I can think of to not cut them in half. The coating on those stops it fom entering your system all at once. If not then I think halfing your dose would be fine. Also dont think skipping a dose would be a big deal... we have so much meds in our system that a missed dose probably wouldnt be missed. Give yourself a break, its tough not feeling well all the time. Hope your feeling better, Hugs Suz",
      "MessageIndex": 13,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781827",
      "Title": "Your advice...or smack upside the head Chickadee steelrose"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 19, 2011 11:12PM suz45 wrote: Sending love & prayers to her family & all her friends. RIP  ",
      "MessageIndex": 91,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/763574",
      "Title": "Bopeep is an angel Leah_S"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 14, 2011 03:23PM suz45 wrote: I had a bi-lateral (no reconstruction) and didnt want to be flat so I took a camisol that had shaped inserts in it (9.99 at winners) and filled the inside with plain new pillow stuffing, keeping the inserts in front of the stuffing for shape. I would think this would work for one side as well.... just remove the insert on the breast side. The Cancer agency also gave me softies inserts (lol, filled with pillow stuffing) to place in a soft sports type bra. I think size would be an issue on whether it works for you. Good luck and hope you find something that makes you comfortable as well as feel comfortable. Hugs suz",
      "MessageIndex": 3,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779551",
      "Title": "proscetics after masectomy twinsmom96 rkt"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 30, 2012 10:12PM suz45 wrote: PizzaDad, Sending you all strength & prayers. Im hoping halaven turns out to be your miracle drug. I admire your wifes strength & determination, she sounds like such an incredible woman. Tears are good if you can allow them to wash away the hurt and come back feeling relief. Know that I'll be keeping, your family in my thoughts & prayers. Love, hope & hugs Suz",
      "MessageIndex": 52,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781372",
      "Title": "My baby got a time stamp. PizzaDad Naniam"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 12, 2011 03:01PM suz45 wrote: Congratulations! Incredible news just in time for Christmas. Hugs Suz",
      "MessageIndex": 13,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779424",
      "Title": "Stable for Christmas DivineMrsM GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 31, 2011 09:53AM suz45 wrote: Derrek, Im so sorry to here such sad news... but am glad she was surrounded by so much love & family at home. Sending Love, prayers & hugs to you, her husband and family hugs Suz",
      "MessageIndex": 3,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780270",
      "Title": "Ruth Flick Ruth1 meima-Bev"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 10, 2012 10:53AM suz45 wrote: Doin a happy dance with you!  Hugs Suz",
      "MessageIndex": 7,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782475",
      "Title": "FIRST TIME WITH NED! MCTHO rosie06ct"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Oct 13, 2010 06:31PM suz45 wrote:",
      "MessageIndex": 3172,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/741982",
      "Title": "November 2009-Starting Chemo BrendaSharon livelife"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Aug 8, 2008 02:14AM suz45 wrote: OK, Have tried to answer this a few times but computer has crashed.. will try again... I just came back from rad & chemo onc appointments this week.. Both have said fatigue is normal a full year after treatment and then some So I dont think that it might be unusual for any of us to feel fatigue . My docs say yes? I tend to agree with them. Big hugs Suz",
      "MessageIndex": 6,
      "PostDate": "08/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719184",
      "Title": "Endless FATIGUE......Anyone?? Krissy37 Krissy37"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "suz45 wrote: OK my first post here in ages. Im just trying to find a place to be comfortable to talk again on this board. So far Ive tried posting on a few threads but deleted them, Im just not that comfortable here yet. After all its been a while and I didnt plan on coming back . Life doesnt work the way we plan. So Im gonna just talk here for this post and see where it takes me. I figured once I had my tubes and ovaries removed last Sept I was done, went on an incredible vacation with dh in Nov. Life was finally returning to normal! Had my routine mammo & ultrasound in Feb. 09. they called me back for a MRI core biopsy,on my right (good) side. They never did it as as soon as I was in the mri machine they said not cancer just a very small cyst. My next set of appointments were set for  August 28 MRI and  Sept 10, 09 with my Oncologist. Great.. I was free and clear for 6 more months. Well the beginning of May I found a noticible lump on my right breast. At first I though naw its just that cyst and maybe it has more fluid in it. made a routine call to the Cancer Agency got voice mail... stated my concern and asked to have my oncologist call me or set up an appointment. Called again that same day. No response! About a week later it seemed bigger... Made a call again ( f-----g voice mail) with all the details and stated I was extremely concerned and I needed to speak with someone about it. no response again. I got busy and had to set my worries aside for a while. It was the beginning of july and I made another call stating it was urgent I get a sooner appointment with my Oncologist. No response!!!!! So around the 1st week of August I ranted on the phone and FINALLY got someone to call me back only to say they couldnt fit me in earlier and my best bet was to wait till my Aug 28 MRI... at this point its no longer a lump but a mass and in my heart I know its cancer. Had the MRI and as my Oncologist was on vacation they wouldnt give me the results. Now in the meantime I have found out my mom is being tested for an Ovarian mass and they were 90 % possitive (maybe more like 100% but couldnt say) that it was cancer. They even booked her chemo date before the results were in. I told her I would be there for her for her first chemo (she's a 3 hr flight away) and I was hoping my would end up being nothing..... So I got on the phone and harrassed every person I could to push the mri results through and have ANY doctor give me the results on the phone. I finally got to the right person (my oncologists personal secretary) and had her working on it. They pushed for the results and then I got the call. A Dr at the Cancer Agency called me late in the afternoon of Sept 2 They were sure it was cancer and they wanted to do a whole ton of tests immediately.  Sept 3rd I kept my appointment with my hairdresser as this was my first real hairstyle cut I had since my last Chemo A really cute layered bob that got ris of all the scraggy chemo curls. It made ME feel better & thats all that mattered. I would have nice hair for a month (maybe) Sept 4th Ultrasound guided core biopsy on the large tumor Sept 9th Full body CT scan Sept 10 Bloodwork saw my Oncologist,went over treatment (chemo, rads, then maybe surgery) went back to cancer agency to have a needle biopsy on a node or lump in my neck then straight to have my heart rythm tested. Sept 11 The needle biopsy the day before is cancer. I go for a full body bone scan. I phone over to my Oncs receptionist and asked if they had faxed in my port request yet (umm no) but chemo is tenatively booked for monday. I asked her to get it faxed immediately as I was going over to the pre op area for ports and was gonna get one come hell or high water. Went over there and explained my situation. The receptionist said no the earliest they could get me in was the END OF OCTOBER..... Ummm no, I need it today and I can wait all day if needed. She thought for a sec sat me in a chair and said wait right here Im making some calls. 5 minutes later she came running out asking if I had eaten today (no as I had the bone scan really early) She had found a vascular surgeon, 4 nurses and an operating room for right this minute. So I was signing the paperwork as I was stripping down for a lovely hospital gown and was rushed by wheelchair to the operating room for the port.. there was a few minor complications, I think they had to reset the tube/wire 3 times also I dont think they really gave the freezing time to set in as I could feel a lot of what they were doing (nothing like the last port I had) but whatever, Im thinking it might have been more difficult cause that side was radiated in 08. Had my son come to the hospital to drive me & my car home. My Oncologist calls me in the evening to tell me she had changed her mind on my chemo cocktail after consulting with many other Oncs online Sept 13, I start my Dexamethasone (2 pills 8am & 2 pills 8pm) So am now hopped up on steroids and will go for my first chemo 9am tomorrow. Sept 14 will be chemo 9am Sept 15 Mammo & ultrasound for markers (also my mums first chemo) Sept 18 Mugga scan So Now Ive vented DX so far is not all in yet.. so this is tenative Stage 3, ER weakly possitive (10%) PR negative and her2 equivical (all need retesting) Dont know tumor size yet, but mass in breast is about 1/3 of my breast (im a D) definately one node under arm and one above the colar bone in my neck So here I am again! Love & Hugs Suz Laugh your heart out, dance in the rain, cherish the memories & ignore the pain, love and learn, forget & forgive. Remember you only have one life to Live. Dx 11/25/2010, IDC, 6cm+, Stage IV, 8/23 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/740327",
      "Title": "Trying to fit in here suz45 otter"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Sep 13, 2009 10:15PM - edited Sep 13, 2009 10:17PM by suz45 Thanks Lisa & Sherry, I just about lived and breathed this website in 07-08. I still also talk to my Dec chemo 07 buddies all the time. We formed a small facebook group so we could stay in touch. We were a fairly small group to start with. I am ok with all this just needed to put it out there. Writing it made me understand what was really going on and how I really needed to push hard no matter what to get them to respond. Ive been coaching my mum by phone and told her to pretend I was next door and call with any questions no matter how small. I think she is more worried about her hair now than the chemo....thats a good sign that the fear is leaving and vanity is taking over Ive had my second steroid dose for today so Im wired again. Sherry thanks, I was one of the earlier people who talked with Norm on the 5 new angels thread and many others, I have no problem with piping up anywhere I might need or be needed, just havent in the last while as I thought I was over it. Now Im just not sure where I fit in. Im sure I'll find a place in the next while. Big hugs and thanks for caring, Suz ugg.. I may need to change my avatar (& stats when they finalize them)",
      "MessageIndex": 3,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/740327",
      "Title": "Trying to fit in here suz45 otter"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Sep 16, 2009 10:51AM - edited Sep 16, 2009 10:52AM by suz45 Hi Alex, Yes this is a different cancer this time. At this point most of my results are in.. Ive had Aug 28, breast mri Sept 4, Ultrasound guided core biopst Sept 9, Full body ct scan Sept 10 Bloodwork, Onc visit, needle biopsy on the node just over my colarbone & heart rhythm scan Sept 11, Full body bone scan, port installed Sept 14, Ist chemo DC Sept 15,Full mammo and Ultrasound Sept 18, Mugga scan (not done yet) Last time around I had a lumpectomy with 21 nodes removed (2 possitive as one was attached to the tumor) Also I found out after the surgery that I carry the brca1 gene. Had I known this in advance Im sure I would have made a few different choices (lol Hindsight) I also had an oopherectomy in Sept 08 as that was one of the harder to detect cancers that I could get. My treatment then was 4 X AC & 4 X Paclitaxol every 2nd week, also gave myself neupogen shots for 6-7 days after each treatment, then rads and ooph From what I know so far this time around (the tests that were ready) is it has not spread to any of my organs (ct scan) Yesterday I got much more (unofficial) information. It is not one tumor in my breast its a cluster of 7-8 in the center top quarter of my breast, One has blood flow feeding it so thats the reason it spread so fast, underarm nodes one large and two small for sure, Then the neck, not sure how many exactly, but at least 2 - 4 again one has a blood flow so its another nasty one. Im on DC every three weeks for ?? 8 cycles, but my Onc said that may change once we have all this new info colaberated. Also still have to find out what my heart can take with mugga on friday. Needless to say this has been a whirlwind, but at least I understand what they are talking about this time around. I have an appointment already scheduled with a surgeon on Sept 28 but its just a consult as I have a bit of a long road in front of that, I also want reconstruction so we will talk to a plastic surgeon to see what those options are. At that point both my breasts will have been radiated and Ive heard its more difficult to do as the skin is not so good. But no matter I will fight on and do the best I can do and live each day as if its on purpose! Love & Hugs Suz",
      "MessageIndex": 5,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/740327",
      "Title": "Trying to fit in here suz45 otter"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 20, 2008 03:17PM suz45 wrote: Happy 1, So sorry to hear about your bad reactions to taxol. Hope they find something easier for you to tolerate. A thread is a new conversation or topic like this one you started. Hugs, Suz",
      "MessageIndex": 5,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701162",
      "Title": "Allergic to Taxol and taxotere Happy1 Delawarebeachgirl"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 10, 2012 05:21PM suz45 wrote: This is a beautiful idea... Going back a few years one of my BCO friends was a children's book author & illustrator. I'll try to lookher her up & bring her over here. hugz Suz",
      "MessageIndex": 2,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 12, 2012 03:44PM suz45 wrote: Wow,this is all so amazing.. I dont have the gift of words & cant draw. But would be willing to contribitute in any other ways. I  heard a simular golden thread story when I was a kid & in the end it mentions that whenever you feel a tug in your heart its from me on the other end of the golden thread letting you know Im still there for you. Sorry I cant remember the exact words or where I heard it or even from who... I was an avid reader when I was young so it could have even been a line in a book that stuck with me. I think that line stuck with me as I think of it whenever I feel an ache tugging on my heart strings. Michele, your sister is an incredible artist... I can almost picture that last one with Zohs features & shorter hair with that gold background. There is a lot of beautifully written poems here as well as the start of artwork & ideas on how to publish small & large scale quantities. Now we need someone who is really organized & can take from whats here as well as Zohs actual posts.",
      "MessageIndex": 59,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 11, 2012 01:53PM suz45 wrote: Bestbird, What a beatiful gift you have with words! That was so beautiful... I could see it as I was reading. hugz",
      "MessageIndex": 29,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 18, 2012 02:58PM - edited Jan 18, 2012 02:58PM by suz45",
      "MessageIndex": 94,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 3, 2008 10:13AM suz45 wrote: Hi, This is just my personal opinion. I have one cat and one small dog. I just finished dose dense 4 x a/c and 4 x taxol two weeks ago. I did all animal potty duty all through chemo. I cleaned the cat box (with rubber gloves) and took the dog for her walk and cleaned up after her daily with doggie doodie bags. I had no problem at all, but I made sure I washed my hands constantly. Everyone is different, but if your dh is going to do the cat box and your cats are gentle so you dont have to worry about scratches, I dont see why you would have a problem. And honestly that furry little animal snuggled up to you on your not so good days will do absolute wonders for you. Hugs, suz",
      "MessageIndex": 5,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703313",
      "Title": "pets and chemo haykat57 mittmott"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 7, 2008 05:05AM suz45 wrote: Hey Yummy, I just got back from a 5 day camping trip and allthough I finished my chemo treatment in March I really noticed that my mosquito bites were really nasty.... some even showing infection right away. Yuck... Like we need more problems.  Hope your OK and you toxed those buggers out. Hugs,Suz",
      "MessageIndex": 1,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708567",
      "Title": "Mosquito Bite reaction YUMMY lisa39"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 3, 2011 02:51PM suz45 wrote: Amy, So glad you now know whats going on and can move forward. Nothing worse than not knowing & waiting. Do you know what chemo you'll be on & when you start it? Sending big hugs and hope your not too sore with the port. Really Big Hugs! Suz",
      "MessageIndex": 27,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778341",
      "Title": "Just Diagnosed Stage IV Mets avjenks8 avjenks8"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 5, 2008 09:19AM suz45 wrote: Wishiwere, Now that you mentioned it my cat stopped following me to the biff when i started chemo. But the odd one was my dog Sophie, When i would come back from the hospital,and get comfy on my lay z boy chair. She would stand on my chest just sniffing and sniffing. Then she would settle in to guard me. Way too funny to see this fluff of a dog chase everyone and everything away from me, and out the door Hugs Suz",
      "MessageIndex": 9,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/703313",
      "Title": "pets and chemo haykat57 mittmott"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 12, 2012 03:47PM suz45 wrote: the second from last... you posted another :)",
      "MessageIndex": 60,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 22, 2012 07:48AM suz45 wrote: 3jays - That's interesting as I have a picture in my head of Zoh with a pure looking harp held gracefully over her heart with golden strings. The strings curl & weave from the harp to each persons heart that she's touched. When she gently touches or plays this it tugs on the hearts of people she loved (or those that loved her).... like the way we feel her tugging on our hearts whenever her beautiful picture with her baby suddenly is in front of us. I guess I have this pictured like a guitar when people don't cut the new strings down... they curl them instead Ive never been able to cut my strings as it seemed like a waste of such a melodic part of the instrument.  They always looked so randomly pretty when they were new, they almost danced were shiny & curled sending off almost a sparkle when they moved. This is just a picture I see in my head. Probably one I would want my loved ones to hold of me. Hmmmm, yes random middle of the night thoughts, hugz suz",
      "MessageIndex": 98,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 31, 2012 02:36PM suz45 wrote:",
      "MessageIndex": 103,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 10, 2012 08:55PM suz45 wrote: Apple, I sent a pm to faithandfifty directing her to this thread, this is also her site... Im definately in to help with this in any way that I can. I really think we all can do this together & make it happen. Zoh touched so many people the moment she talked to them. I cant imagine how beautiful it would have been to have actually meet & talk to her in person. Rainbows Within Reach (www.rainbowswithinreach.blogspot.com) hugz Suz",
      "MessageIndex": 16,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 18, 2012 02:57PM suz45 wrote: Just a suggestion... Im trying to think easy. Could we set up a special paypal account for this so the donations could come from all over the world & be converted to whatever type of money is needed at the time? Certain people could be given charge of it that will need to access the money & the rest of us could donate as much as we want anytime in whatever way (cash visa money orders & so on)?? We could also donate at different times if more money is needed...  I dont know much about paypal except I use it to pay for all sorts of different things.",
      "MessageIndex": 92,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 20, 2012 12:56PM suz45 wrote: bump",
      "MessageIndex": 95,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 15, 2012 04:29PM - edited Jan 15, 2012 05:13PM by suz45 Just want to pipe in to say I LOVE all the idea's.... book/book series, poems, cards, jewelery & a website... and well just all of it... plus all the offered help & finances! I know that soon the right person will see this that can help make it all come together.",
      "MessageIndex": 84,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 17, 2012 08:39PM suz45 wrote: DOIN' A HAPPY DANCE!  I'll 3rd the motion.. and a heartfelt thanks Fumi! I just knew that I wasnt the person that was skilled enough to take this on... 6 years ago I would have been there in a flash, even if I had to learn it on the fly. Lol, now Im just trying to see through the fog thats in my brain.  I had written an tearful apology here then felt a hand stopping me and letting me know that our gal was gonna see this soon... hence the reason my last post was edited. All I can say is wow!! Zohs behind us all the way... Your time-line is really good as well, it would give time for everyone to get things together as well as have a bit more solid of an idea as to how far & how much can/will/should/could be done. Your the piece of the puzzle we all were looking for. And your timing will be perfect! Not exactly sure what I can personally do here... right now DH & I are trying to get my affairs in order before I become too sick or foggy to deal with a lot the Lawyer & legalities..  paperwork or writing of any kind is not my thing, although its been my job for the last 20 years.. Especially when it comes to wills & last wishes... So Im dreading the process but refuse to leave my guys with a tangle of unfinished business when the time comes. So again thank you to all you wonderful lady peeps who have the talent & the drive to make this happen. I'll do what I can as long as Im sure I wont mess things up. happy happy hugs",
      "MessageIndex": 89,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 4, 2012 03:29PM suz45 wrote: WAY TO GO! They sound beautiful & uplifting just hearing about them. By the way, so do you! Very glad to see you bounce back. I go through the same sort of thing... I think we all do at some point. Big hugs for a Great Shop, Suz",
      "MessageIndex": 54,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777500",
      "Title": "Should I Buy a Winter Coat? eag1954 eag1954"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jun 16, 2008 03:20PM suz45 wrote: Hi girls, My chemo was DD A/C then taxol, I started on Dec 12, 07 and last chemo was March 18, 08. Am also just out of rads not even two weeks. My hair also started off as pure white fuzz, but its slowly starting to fill in darker. I cant tell what color it is yet, very ash looking (yeah.. light & dark gray) But honestly its getting thicker daily & Im happy to just have some hair up there. I have given up the wig and hats as I just feel way to phony. Here is a pic from last week...  I still feel a little uncomfortable as its soooo short, but no one else seems  to even give it a second glance when Im out in public. Oh and I also lost all my eyebrows and eyelashes two weeks after the last chemo. My eyelashes are now short but in, and those are my eyebrows in the pic (no pencil) Hang in there ladies, Hugs, Suz",
      "MessageIndex": 28,
      "PostDate": "16/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 14, 2008 03:04AM suz45 wrote: Artsee, Lets just hope that that was a fluke!!!!! So far mine are stuck real tough. I do the same for whatever reason, I tug on the hairs to see if they are for real, Nothin but good vibes so far. Wishing the sme for you. Hugs, suz",
      "MessageIndex": 120,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 31, 2008 05:43AM suz45 wrote: PS my facebook name is Susan Holm, feel free to browse or add me as a friend. Its all good. PM me if you would like my email. I would love to stay in touch with any/all of you gals. Big hugs to the greatest gals I could ever have met... Suz",
      "MessageIndex": 200,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 5, 2008 06:05AM suz45 wrote: Artsee, You asked for a weekly update hair pic. So this is now two weeks later...LOL, ignore the rope in front of my face. The people I was camping with had a few too many wobbly pops to even realize the rope was there. But my hair really is starting to fill in nicely and is slowly getting more ash with white tips. I am ready to have my sides and back professionally cleaned up ( had dh tidy the back of my hairline on the camping trip as it was getting unruly) Hugs to ya all, Suz ",
      "MessageIndex": 91,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 7, 2008 12:58AM - edited Jul 7, 2008 04:25AM by suz45 Deen, Here's Laura's instructions for posting pics from page 9 on our Dec 07 thread. Here's how to put a photo in your posting,  Suz (ps.. Otter, thats the first time Ive seen those instructions you posted, your right they are very detailed and great) First, you have to save the photo out there somewhere in internetland, such as Photobucket, Flickr, etc, then follow the instruction below.   ",
      "MessageIndex": 100,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 7, 2008 01:12AM suz45 wrote: Artsee, LOL,  This was day 4 of my 5 night camping trip. Basically it was a desert island, one outhouse, no fresh or running water, no electricity and no roads. Needless to say my hair was very au natural, no curls for me. I had a soft light natural wave pre chemo, so far it seems to be poker straight. No worries Im just happy to have hair  The guy who took the pic was who knows how many beers into the day and I dont think he was really taking a pic of me. More just playing with my camera. I think this is great seeing real pics of everyones hair progress.  Hugs to ya all. Suz",
      "MessageIndex": 101,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jul 31, 2008 05:36AM suz45 wrote: Thanks Kym,  Honestly Im having a blast enjoying life, cause I can. Im sure you all know what I mean. Here are a few odd pics from my weekend. It was way up there on the weirdness scale, but oh so much fun. Please enjoy. 2 hours ago suz45 wrote: Ok, I think I have a few interesting ones.... I took a gazillion pics and posted about 30 on facebook as well as a short video clip of the Flaming lips from the stage view out. Needless to say I had so much fun, we didnt realize our working passes allowed us anywhere until saturday.  My son Aaron and I at The Tragically Hip Concert   crowd behind us (44,000)  Me (in white) with the tella tubbies backstage ready to go on for the Flaming Lips show  Gord Downie from the Tragically Hip & I backstage (how cool is that)  Onstage with the Flaming Lips looking out at the crowd.  Our truck supplying spring water at one of the bottle filling stations (the reason we were here)  Russ and Aaron (dh & ds) having a beverage and some food in the Artists VIP Green Room Love ya all. Big hugs, Suz Begin each day as if it were on purpose. BRCA1 Dx 10/19/2007, IDC, 2cm, Stage IIb, Grade 2, 1/21 nodes, ER-/PR-, HER2- [Edit] [Delete]",
      "MessageIndex": 199,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 3, 2011 11:45PM suz45 wrote: Good to here your depression is lifting Mary. Thats quite the exercise regimine, congrats! Im lucky to make it around the block lately (just walking) You sound amazing & strong. Good luck on the tx, thesis & film doc. Love & Hugs Suz",
      "MessageIndex": 1,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779005",
      "Title": "my update MJ6266 apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 12, 2010 01:46PM suz45 wrote: Hi Stella, A gentle {{hug}} I'm sorry you have to be here, but send out a warm welcome as well. Hoping that your port wound heals so you can get your rads. I don't have the knowledge that many here have as Im new to the stage IV myself. But I have more than enough care & compassion to offer. Suz",
      "MessageIndex": 11,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761897",
      "Title": "New here updowns jenny66"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 27, 2008 12:42PM suz45 wrote: Krista I had my port put in a day before my first chemo in December. It was sore around the colar bone where the staples were for about a week, but has been fine since. Ive had no problems with bathing and such, just shower or bath as normal. All my bloodwork has been taken from my veins so far, but it cut the use in half. As it stands Im happy I did it and its working for me. Take care and good luck. Suz",
      "MessageIndex": 5,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699197",
      "Title": "I.V Port kissta Cathy-CA"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 5, 2012 04:55AM suz45 wrote: Great news! You both must be so relieved. Sending happy hugs, Suz",
      "MessageIndex": 20,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777786",
      "Title": "Ascites tfriend4ever suz45"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 14, 2012 03:13AM suz45 wrote: Morning Jenn, Hope your having a day filled with sunshine & love! Thinking of you. Will have to look into xanex.. I use clonazapam sometimes at night but its too strong for the day I too wish I had a daughter as well.. Have a female small havanese doggie too that loves to wear sweaters & is by my side day & night. She gets me through the dark days. Sending you light & love xx",
      "MessageIndex": 146,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 27, 2008 06:02PM suz45 wrote: Debbie, I'm having my port removed April 1, 08.  I had a vascular surgeon put it in, but am having it out at a minor surgical clinic at the same hospital, but different building. I was told the removal procedure would take about 20 minutes and to have a driver as I would not be able drive after-wards. I was awake while they put the port in (well drugged) I had two incisions. The lower right above the port is just over an inch and the higher one at my collar bone is about 1/2 an inch. I am assuming I'll be awake when they remove it.  Will touch bases again next week and let you know how it went. take care, Suz",
      "MessageIndex": 3,
      "PostDate": "27/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702945",
      "Title": "Port removal dhettish dhettish"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 1, 2008 07:06PM - edited Apr 1, 2008 07:09PM by suz45 OK, Just got back from having port removed. So here's my play by play. I changed into a hospital gown (waist up) and went into the day surgery room. I had the same surgeon that placed the port originally. I layed on an operating table and they had me turn my head in the opposite direction of the port then placed a cloth so I wouldn't see. The worst part of the whole thing was the needles to numb the area. Once it was frozen I couldn't feel a thing. I could tell when they took the bulky end of the port out (not even remotely painful) and then they worked about 5 min removing the tube. Ive got dissolving stitches on the inside and tape on the outside. I haven't seen it yet as its bandaged but I think the incision is in the exact same place & size as the first one (about 1\"). They didn't do anything with the scar on my collarbone. Overall it went really well, I didn't get any sort of meds to relax or calm me. I was nervous going in but honestly it really was no big deal and nothing like putting it in. Take care Suz ps, I had the port out exactly two weeks to the day from my last chemo. I think they like to wait three weeks.",
      "MessageIndex": 9,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702945",
      "Title": "Port removal dhettish dhettish"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 2, 2008 08:12PM - edited Apr 2, 2008 10:43PM by suz45 Tina, Your quite welcome  Ive been a bit sore today, so took a T3 and that took care of the pain. Probably didnt need something that strong but I ran out of otc pain relievers. If you have your port in and its not being used it does need to be flushed once a month. Hugs, Suz",
      "MessageIndex": 11,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702945",
      "Title": "Port removal dhettish dhettish"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 2, 2008 11:08PM suz45 wrote: Tina, Good luck with #7 tomorrow, your almost done! It really is a great feeling having the port gone. Take care, Hugs Suz",
      "MessageIndex": 13,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702945",
      "Title": "Port removal dhettish dhettish"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 2, 2012 01:23AM suz45 wrote: Hi, Im Suz and I just celebrated my 50th Birthday on Jan 4th this year. Cancer first introduced itself to me August 15 2007, IDC with 2/27 nodes. I was 45 at the time. Then again cancer entered my life in 2009, 2010 & 2011. Ive had a BMX no recon (not by choice) I currently have mets to the bones, widely spread nodes & pleura. Im on Xeloda & Clodranate right now and my last scan showed my tumors were all shrinking! I found the boards right before my first chemo and started posting on the Dec 07 Chemo gals. Ive spend a lot of time learning & reading on different threads, but am posting more again since I entered stage IV. The ladies here have been my lifeline through this roller coaster ride! Im also blessed with an incredible Husband who I met & fell in love with in 1986. We have one son who is 21 and is an incredible young man whom I love so dearly. I enjoy being active so its been a struggle to give up a lot of my favorite activities, but Im happy that Im here. Thank you all for being there through it all. I really do believe in hugs! Suz",
      "MessageIndex": 47,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 1, 2012 04:12AM suz45 wrote: Jen - Im so very sad & sorry to here this new dx.. \"FUBC\" and I really mean it! Its good though (i feel so wrong using the word \"good\" right now) that your team got a plan together so quickly. Sending you a huge {{HUG}} as I also believe in hugs. Suz",
      "MessageIndex": 17,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780266",
      "Title": "It has spead to my brain...... jenn3 lwd"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 10, 2012 10:47PM suz45 wrote: I always say \"oh im hangin in there\" how about you? Or if its a really good day I just say \"Im great and you? Its different if its my family (phone calls) as they are all long distance and really want to know how Im actually feeling. I dont hesitate to tell them Im having an off day because they really do care what Im feeling. I agree its easy to get them talking about themselves. Also notice that everyone glances at my breasts (lol, I dont have any)",
      "MessageIndex": 30,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780733",
      "Title": "oh, hi, how are you? bhd1 bobkat"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 3, 2011 11:36PM suz45 wrote: WOW! Volume 3, yes you have me beat. I was starting to feel guilty that they had to haul this thing around. Not only that but my Onc took a 6 month leave so every time I get a new Doctor they have to try to go through this thing as I always have a dozen questions for them. Hugs Suz",
      "MessageIndex": 75,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 4, 2011 03:46AM suz45 wrote: Hi Bobcat, Im so very sorry you've been doing this on your own and have to be here. A warm hug and Im really glad you decided to post. I hope you find this as safe a place to land and open up as I have. Ive had to stand my ground and \"insist\" to my Dr's a few times to get them to take me seriously. Im glad you did too. I never thought I would get up the nerve to actually post anything when I first got here... I was very uncomfortable writing anything, never mind actually posting something on a forum like this. But after a while this became my lifeline while going through treatments, tests & surgeries along with all the roller coaster highs & lows. And now even though I took a year off it feels like my second family.... one that I can trust to say anything to. I'll be thinking of you Tues and hoping for the best. Sending you love,hugs & prayers. Suz",
      "MessageIndex": 77,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 17, 2011 04:56AM suz45 wrote:",
      "MessageIndex": 125,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 11, 2012 06:56PM suz45 wrote: Shelleyj43 - I had a look and it is colored cocoa butters that are on sale, so Im thinking there would be food coloring in it?? Hmmm yellow (sounds scarey) blue (blue kitty sounds bad) red (something we havent seen in a while)..lol. Where would I find just plain old cocoa butter... dont think Ive seen it in the grocery store and I dont get out much (besides Costco) Would I need to go to a specialty type store. Hugs Suz",
      "MessageIndex": 97,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 12, 2012 12:31AM - edited Feb 12, 2012 12:32AM by suz45 Great! I have a Micheals just a few blocks away.. will stop by tomorrow to see what they have. Thank you Windlass :) Hugs Suz",
      "MessageIndex": 105,
      "PostDate": "12/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 3, 2011 07:40PM - edited Dec 4, 2011 03:54AM by suz45 Hi Gals Im Suz, I first found out I had breast cancer in August 2007 and didn't find out I was BRCA1 until after I had had a lumpectomy with 21 nodes removed and had almost finished my AC/T chemo & 26 rads. I immediately had an oopherectomy and was told they would watch me carefully (hmmm) a year later I found a large lump in my other breast . It was a cluster of fast growing tumors so I went straight on another chemo Docetaxol, radiation then a bi-lateral MX. Oct, 2010 we found I had bone mets to my right 6th posterior rib. Thats when I posted here asking if this is where I belong now... lol, I got such a warm welcome from so many of you. I was fighting to try to get reconstruction and after months of begging, pleading and researching I won the fight! I was put on clodronate for the bone mets and was told I was NED! I think that was my last post here for a while. We had everything set up and ready to go when I found a lump at the base of my throat. It was a cluster of cancer in my nodes. We had to put my surgery on hold and I chose to go on to a trial drug Foretinib with the understanding I would be able to take a 2 week hiatus from it to get my recon. Well after a few months on this trial I had my second CT scan and it showed widespread Lymphadenopadhy throughout the trunk of my body including 2 small tumors attached to the pleural lining on the right side. My surgery got cancelled indefinitely... oh how I cried as I had fought so hard for it. As dumb as it may sound, as long as I had about 2 years left I wanted a pair of bumps so very badly. I took a break and went on vacation for a week in Sept this year knowing I was starting to have issues with fluid buildup under the left lung, I was planning on starting a new chemo as soon as I got back. We went to Las Vegas for a week so I could go on a helicopter ride through the Grand Canyon, then we landed right in the Canyon for a Champagne picnic with my darling DH, we flew back to Vegas as the sun was setting. Wow.... what an experience!! It was everything I had hoped it would be and more! This ride was #1 on my bucket list. By the time I got back home I was having breathing problems and they found that I had a litre of fluid in my right pleural. They drained it manually the first time, but within 2 weeks it was back so I had to have surgery to install a pleura X drain (sp). Nurses now come in to my home to drain it via vacuum bottles, as well as clean & change the waterproof dressings twice a week. Ive had it for 2 months now... I don't like it, but hopefully it will eventually dry out and I can get it removed (that's best case scenario) I had just found 2 perfect bikini tops this summer that I could wear with some pillow stuffing that looked great. Now if I wear them I have this huge bandage & tube right under the bra line. Funny how silly things like that can upset you more than the cancer :P Anyway I'm currently still taking the clodranate (for the bones) and have been on the oral chemo capecitabine. Its 4 pills twice a day for two weeks then one week off. I'm on my 4th cycle of it and find it extremely tolerable. I have my first CT scan on Dec 21.. I'm just guessing but I think this chemo is helping. My tumor markers have come down and I'm almost sure the tumors in my neck are smaller! The CT scan will be my actual proof... crossing my fingers! If for some reason I go off this chemo they have another one lined up for me, but its an IV drug (cant remember the name of it). I was actually given a choice of this or the oral one with the intention of utilizing the other once I finished with the first. I chose the oral chemo as it seemed like the side effects were easier and I wasn't into the whole IV thing all over again. Also didnt want to loose my hair for the 3rd time quite yet. With this one its thinned out but its hair. Ive just come back to the boards a few weeks ago... mostly reading and waiting for the right time to jump back in. I gotta say I feel like Ive come back home and finally have a safe place to fall if I need. Thank you Apple and everyone that has shared and posted here for opening the door. Well... that's my ride so far with a whole lot of short cuts (heh heh can you imagine if this was longer) Yes I talk too much once I get started   Much love & hugs! Suz",
      "MessageIndex": 70,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 9, 2012 09:34PM suz45 wrote: Debke, Yes you will need a presciption for it.. a lot of Dr's havent heard of it so printing out the formula & taking it with you is a good idea. You will then have to take the prescription to a \"compounding pharmacy\" as they will have to make a batch. Sometimes there can be a wait as they dont have all the ingredients in stock (mine didnt) You then should be good to go :) Hugs Suz",
      "MessageIndex": 56,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 11, 2012 04:40PM suz45 wrote: I like the ice cream cone one (really small pic of it) showing chocolate topping :) how fitting is that depending on the size of the mold??",
      "MessageIndex": 90,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 4, 2011 09:16PM suz45 wrote: I had to sleep on my extra large lazyboy chair (leather covered in a huge lambskin)  I now have a foam wedge in bed to raise my upper body about a foot. Have to use this since they installed my Pleurex drain. I was always a stomach sleeper so it was a big change. Hope you find something comfortable... maybe a full size soft body pillow to help support your back & neck?? If I remember correctly my first port settled in quite quickly. Hope yours does too! Hugs Suz",
      "MessageIndex": 83,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 3, 2011 07:41PM suz45 wrote: ps.. has anyone noticed the size of their cancer files? Mine is 4 inches thick!",
      "MessageIndex": 71,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 9, 2011 06:06PM suz45 wrote: Bobcat - Im not sure what its like in the States but in Canada I just go to the Cancer Agency Admin. & sign to have a copy of all files sent to my home (or pick up)  I have to do this each time I want the current info, but they send everything up to the last time I asked. I havent done it in a while but will do it again once I have my CT scan results after Dec 20ths scan. I will say there is a lot more info in the paperwork than what they tell me... lol, even the state of mind they think Im in at that visit. I'll have to agree on the stats... there just guesses. At one point I was told I had a few months! Ummmm I dont think so :D That was over a year ago and Im still going strong. The Onc appologized for that one on my next visit. Warm Hugs Everyone Suz",
      "MessageIndex": 108,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 17, 2011 03:16PM suz45 wrote: Clarrissa - Way to go on starting the first chemo! Make sure you try to keep ahead of any side effects. It goes much easier if you stay on top of them, if you need meds take them! Don't wait till thing are really bad (not that its going to be bad) staying ahead of them will just make things easier. Sending you a very warm hug & prayers. I just had my book keeper drop in unexpectedly with flowers & home made stalin (sp?) a sweet bread. My house is a mess and I'm in my pj's & robe. Didn't care, I invited her in and had a wonderful unexpected visit. She is so sweet & caring I think of her as more of of friend than anything. Just wish I could talk right now without tearing up all the time. It has to be a SE as I'm just not like that. I suck it up & carry on with enjoying each day.  Hugs Suz",
      "MessageIndex": 130,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 23, 2011 04:53AM suz45 wrote: Well said Mazy, and I agree whole heartedly! Questions , support, humor and a lot of love. We are all in this together. Warm Christmas Hugs Suz",
      "MessageIndex": 144,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 29, 2012 01:57PM suz45 wrote: The very best of luck with the Xeloda Banjo. Ive been on Xeloda since Sept last year & my scan in Dec showed all tumors had shrunk by 1/3. Im now on a 7/7 at 1650mg twice a day. I also take clodronate daily for the bones. My next scan isnt until the end of March, am hoping it continues to blast away at the beast. Lol, I have a banjo as well for wall decor. Im in the middle of reno's so its packed away at the moment. I inherited it from my dad when he passed away a few years ago. He was an incredible Banjo & Guitar player. It makes me smile to just see it... the Banjo is such a happy instrument. Hugs, Suz",
      "MessageIndex": 28,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783305",
      "Title": "Not what I expected... banjobanjo banjobanjo"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Nov 30, 2010 01:51PM suz45 wrote: I had the testing done (I'm BRCA1) but it was a little different as after I got my first cancer in 07, I found out my cousin on my mums side carried the gene & got it from her dad (my mums brother) so the testing was really easy. It has caused a bit of an uproar in my family as my mum got ovarian cancer at the same time that I had my second cancer... so we were both in chemo at the same time... needless to say it caused panic and lots of debates on whether to get tested. I think the most disturbing part to me was one of my sisters & her daughter both tested positive. My sister had an oopherectomy done right away & is on a waiting list for a BMX with tram flap. Her daughter is reacting really bad to it all, she is almost 30, not in a steady relationship but wants kids at some point and feels who would want her because she has this defective gene that could be passed on to her children. Its not an easy thing to know and She is now so emotionally fragile that my sister doesn't want her to know that I have cancer again. I guess what I'm getting at is not everyone can process this info in a positive way. Hugs Suz",
      "MessageIndex": 8,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761304",
      "Title": "Genetic testing? YamaMama YamaMama"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 13, 2010 01:53AM suz45 wrote: Leisa, I remember how happy I was to have my drain out last time.... oh such a relief. Hugs Suz",
      "MessageIndex": 161,
      "PostDate": "13/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 14, 2010 11:09AM suz45 wrote: Leisaparis, That was a real peeve of mine... baby oil worked for me. Good luck today Tess.. Its just you and me today. Can I hold your hand as I wait  I have 4 hours till surgery still and Im sooooooo thirsty. May our surgeons hands be strong, steady and true. Oh and I almost forgot..... I found out yesterday my sil will be my attending nurse. She works at a different cancer agency but will be working in my surgical ward for three days. How weird is that..lol Love you all and will pop in when i get at a computer, Hugs Suz",
      "MessageIndex": 168,
      "PostDate": "14/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 5, 2012 04:59PM suz45 wrote: 45 1st left bc, found out BRCA1 after lumpectomy, chemo & rads then had ooph 46 2nd right bc, chemo, rads, bmx (no recon) 48 3rd bone mets, clodronate & fortenib (trial) 49 4th widespread nodes & maybe pleura, clodranate & xeloda It worked out to aprox one every year, but when written looks like a year was skipped it was more just different scan times (the cancer was there)",
      "MessageIndex": 718,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 17, 2010 09:34AM suz45 wrote:",
      "MessageIndex": 182,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 22, 2010 07:12PM suz45 wrote: Mantra, Guess I was writing when you posted. Ive been taking Gabapentin off and on for a few years now. I was originally given them for my hot flashes, kind of one of the good side effects they found when testing it. Then my feet got so bad with neoropothy we upped the dose for that instead. Today was told to try it for the burning in my arm. Lol, Im not sure if it really worked for any of it. Its an odd drug as you cant tell when you've taken it. But will continue as the burning is really painful. Hugs Suz",
      "MessageIndex": 234,
      "PostDate": "22/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 29, 2010 11:54PM suz45 wrote: Thanks Tess, those are great! So Im really happy. I got the last drain out today and also squeaked in an appointment at the CA prothesis bank and came home with a new set of \"C cup\" proths and a really pretty new bra. Im going on vacation Sunday so this will be really nice. Nurse at the CA said its really unusual to have so many new ones but they just had a large donation. This sure beats the $1000 price tag on them!! I dont think I would have paid much for a temporary set, so Im really impressed. I will buy a few extra bra's when my bruising is gone. Right now it hurts like a bugger as I wore them for a few hours today. Hugs Suz",
      "MessageIndex": 294,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "May 2, 2010 02:18AM suz45 wrote: Im not sure if more draining is good or bad or if it even matters. I do know that if you've had a lot of nodes removed with your surgery you will have more fluid, also I found the more active I was with both surgeries the more drainage I had. On a possitive note, I found some suitable bathing suits and swim proths. All I was finding was suits that made me look 70... Nothing even remotely contempoary. Well yesterday I found the prettiest tankini's One was an actual masectomy suit and the other was my favorite brand of suits (sea folley) that worked really well with my new swim bumps :-). So I now have suits for my trip and the summer this year. The swim bumps look best in suits that have a bit of padding in them to start with. Am definately overwhelmed by all this as its just 2 1/2 weeks since surgery. The sales girl at the masectomy store said most people dont shop till 5 - 6 weeks after surgery for the more permanent (semi permanent) stuff. I sure can see why, Im soooo sore from trying all this stuff on (a bra too) and also doing some regular clothing shopping that wont show the bras. Looks like most of my clothing was fairly low cut and now unsuitable to wear. No worries as I can now relax for a week and have clothing that will cover the bras and scars  (heh heh also have a few days in San Diago to browse a few stores) Ive always been a clothes horse, so why fight it . Big hugs and speedy healing, Love Suz",
      "MessageIndex": 312,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 02:48AM suz45 wrote: Cancerkicker, Big hugs Hun, Your lot alone in this, we ALL are having this problem. We have also found a compounded presciption cream called \"Scream Cream\" that works wonders. Its given so many of us our sex life back and the abilities to have orgasms again. Im posting the first page of the thread. The scream cream naturally stimulates and for the girls that have the pain internally we are using lodocaine. By the sounds of it you would just need the cream. Im not going to go into it here as this thread will answer most of your questions. Wishing you all the best with this and hope this gives you your \"love life\" back. Cancer will NOT be allowed to take this away from you. Here's the thread started by our dear angel Zoh. http://community.breastcancer.org/forum/8/topic/776318?page=1",
      "MessageIndex": 2,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 03:02PM suz45 wrote: I just printed out the ingredients & handed them to my GP, Also wonder if you can find a compounding pharmacy out of town and have them send it to you?? Your Dr can just fax them the info. Fitztwins, I feel the same about my body.... having no reconstruction and now the pleura tube on my chest is not only not sexy but hurts if he leans on it. I do use lingerie & prothetics or at least soft bumps as I want to cover my chest and it actually does helps boost my self estime about my body when I can see it looking almost normal. When I had no hair I foung wigs really got in the way and/or started to come off. So I went instead to a very pretty daytime (indoor) hat that had a bit of lace as well. This all made me feel better so I was willing to go through the effort. Im a \"gag\" with the blow jobs but bite the bullet every few years if I forget to buy a birthday gift. Yea Cancer is a load of crap but I am still happy to be alive (yes at a huge price) really wish that I was given the chance to have reconstuction and still be able to lead an active life. But it is what it is so Im making the best of it. Hugs dear Ladies",
      "MessageIndex": 14,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 9, 2012 05:06PM suz45 wrote: Apple, I spilt my tea! Heh eheh.. still chuckling",
      "MessageIndex": 51,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 14, 2012 04:07PM suz45 wrote: No luck at Micheals for the cocoa butter  sigh this might be as hard to find as scream cream (wonder if they named it SC because you want to scream in frustration trying to get it?) Hope everyone has a Great Day .... might be counting to 260 more or less Hugs Suz",
      "MessageIndex": 141,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 03:41PM suz45 wrote: A.A, Lol, Do I get to be considered an Oldtimer yet... Ive been around since 2007. The SC might surprise you in how natural it feels. Sort of like before C ever entered into things. Hoping you get the same response Anko, Im TN and BRCA1, Ive gone through 4 different chemo's, the first put me into menopause & an Oopherectomy kept me there. For me the worst part was that sexual intercourse became extremely painful. Im small down there to start with as I had a C section with my sons birth (even he wouldnt fit) There is a solution for both the stimulation & pain that was introduced per say to us just a few months ago (I pasted the thread in my first post) Its already had over 12,000 hits and counting. So there is very real help for us out there... Im back in the swing of things after 4 years of trying to find something that worked. Hugs Suz",
      "MessageIndex": 20,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 09:27PM suz45 wrote: Ha ah ha... hate to say it but yes I thought about getting the LARGE jar 500 uses and getting it to those who couldnt... but I can see it now NEWS HEADLINES boobless lady busted (aha hee heh) for trafficing unknown pharmaceutical substance across the border for blackmarket resale. Full storey to follow. Only thing is the stuff costs an arm & a leg here (just what I need more body parts gone)... I paid $150.00 for 30 uses. In the States it seems to cost a LOT less.. $30-$60. Which is odd because everyone in the States normally tries to get their pharmaceuticals in Canada?? I get mine in a 30 gram clicker jar, 4 clicks 1 gram no waste  I have heard some get them in tubes down south, but havent seen it here. Oh and what he doesnt know wont hurt him he wouldnt be able to tell you used SC and its applied 20 - 30 minutes in advance. It feels very natural and stimulates your bodies natural um lubricant. Now for the guys who need to have hand jobs. Go to an adult Toy Store and pick him up one of those squishy type Vagina toys. Its supposed to feel incredibly good and it works REALLY well. Supposedly the next best thing to the real thing. They have become really common so all the stores have them. Dont go for the new ones that have all sorts of beads & things in them... they become harder to handle and dont feel as nice. They have funky ones shaped like lips on one end as well to make it a little more fun & not so creepy... it could be a Valentines gift to your significant other. Make sure there's lots of KY around as he'll need it. Yes it will be his new best friend (once he gets up the nerve to try it) and there will be a lot less complaining. So we have SC whenever we want it & he will have his toy when we dont. hugs Suz",
      "MessageIndex": 37,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 13, 2012 07:54AM suz45 wrote: Ahhh Apple, I can see it now.... counting instead of playing. Really wouldnt know how many? Do you count both the downstroke & the up stroke or is that considered one. (gotta get an accurate #) Hugs Dear Buddies, Suz",
      "MessageIndex": 114,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "May 31, 2008 10:08PM suz45 wrote: Hi Ftreloar, Im Canadian and am at #17 of 20 the last 4 are boosts. I had node involvement so was radiated to just higher than the collar bone down to almost the bottom of my ribs and then from the center of my chest , under my arm to around my back a few inches. I'm not overly large though ( 36-38 D) I don't know a lot about it, but so far the skin is pink and sore, but has no tissue break-down, Ive got a sore throat, earache and some shooting pain. Ive only used pure aloe and topped it with a generously thick layer of glaxol base cream three times as day. Im wearing a cotton tank with a shelf bra when I go out and change into a very loose and baggy mens t shirt with nothing under it when I am at home. I hope this helps. Take care and good luck with your desition. Gentle hugs, Suz",
      "MessageIndex": 1,
      "PostDate": "31/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/706528",
      "Title": "Canadian 4 week radiation ?? ftreloar ftreloar"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 4, 2012 01:13PM suz45 wrote: Wonderful news Barsco! Doing a happy dance for you. I agree we do need much more good news for all. Lead the way into 2012. Hugs Suz",
      "MessageIndex": 28,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780408",
      "Title": "Some good news! barsco1963 holding92"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 5, 2012 04:39AM suz45 wrote: Caryn - You've gone through so much so quickly.. Wonderful news that you can go back & enjoy your kids! Here's to slowing that train down and enjoying what you love to do, clink clink. I just may get on that juicer as well... my downfall is I LOVE Breyers ice-cream and have a scoop almost every night. cant give that one up. Also don't think I would like having to clean it every time (we need a self cleaning one like ovens ) Hugs Suz",
      "MessageIndex": 10,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780421",
      "Title": "A Little More Good News exbrnxgrl steelrose"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 10, 2012 06:06PM suz45 wrote: Keepingon, If you have the time, energy and Dr's permission I would try Bikram Yoga (hot yoga) The pounds literally melted off and it left me feeling absolutely incredible. It felt very cleansing with the sweating and the way the postures are meant to naturally release the toxins in our bodies. It also grounds & centers you physically as well as emotionally. Its really hard to get through the first few sessions without bolting from the room, but they suggest lying down until you can join back in. I would leave there with my legs feeling like rubber and my mind clear & fresh. I also have anxiety and felt this helped it tremendously.  I gained about 40 pounds from tx. I started the Bikram Yoga at the urging of a longtime girlfriend, I had already gone through BC, lumpectomy, chemo, rads, oopherectomy, BC, chemo, rads, BMX and bone cancer when I started it (aprox 2 1/2 yrs tx) Ive also always been a very active bubbly, upbeat person. It seemed like nothing was helping me shed the pounds, puffed up feeling as well as feeling tight & painful everywhere. When I started Bikram along with my normal power walking the pounds started dropping off right away (Ive always eaten properly except when actually on chemo) I dont remember how long I did it for?? but sadly had to stop due to extremely high blood pressure when I went on the drug trial Foretenib. I would get back into it if I could but its impossible now with the Pleura drain and numerous other issues. I dont think I would last 10 minutes now and it would be dangerous at this point in my journey. Anyways that was definitely the one thing besides loss of appetite & nausea (currently from meds) that worked for dropping chemopause weight. I would suggest asking your oncologist if this is right for you as it really is HOT in the room, like a sauna. So its definitely not for everyone and individually were all dealing with different medical issues. Its also a very physical & mental workout. Good Luck, Hugs Suz",
      "MessageIndex": 100,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 5, 2010 05:49AM suz45 wrote: I feel the same way... I had a few hours of shock, now Im just calm. Everyone around me is upset or angry but why... things are out of our control. All I can do now is concentrate on things that make me happy, as well as things that will make those around me happy. Im very much at peace.. its kinda cool. Hugs Suz",
      "MessageIndex": 2,
      "PostDate": "05/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/761547",
      "Title": "Strangely Calm FightnF8 justjudie"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 23, 2011 05:01AM suz45 wrote: Ohhh... I guess Im two timing as Reggie just arrived this week and Stable boy dropped in for a wee visit. Nothing nicer for the holidays, sharing Good News! Hugs Suz",
      "MessageIndex": 17,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779903",
      "Title": "The rest of the good news dreamwriter pq2"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 08:07AM suz45 wrote: FUBC So sorry to hear that, hoping WBR & Tykerb do whats needed to get you up & running. Yes I hate this disease and ehat it puts us through. Sending you healing, possitive vibes along with a prayer. {{hugs}} Suz",
      "MessageIndex": 76,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 02:03PM - edited Feb 8, 2012 02:06PM by suz45",
      "MessageIndex": 85,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 27, 2012 02:22AM suz45 wrote: Mmmmm sounds divine! Nothing better than a luxurious bath filled to the brim! Im very happy with my tub, its nice & deep with armrests when i want to read. I'll have to pass on the disarrona but a nice glass of something bubbly & cold does the trick for me. Lol Dh can have my DiSarrona if I get a good candle lit back wash   Great idea Ma, we should come up with weekly \"girls feel good\" things to do Here's one I can buy to use anytime this next year. Was just looking at this weeks groupons or social living deals (or one of my online coupons) this week and they have a 1 hr massage in your own home for just $29 (reg $120) or 2 one hour sessions for $39 (reg $240) and you can buy up to 5 sets of them... hmmmm, yup Im thinking this would qualify for being pampered. Hugs Suz",
      "MessageIndex": 11,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781685",
      "Title": "Let's pamper ourselves ma111 Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 5, 2012 12:22PM suz45 wrote: You are you... and treat everyone with such love & respect. You manage to put humor & grace into everything you say & do. You absolutely shine! ☆",
      "MessageIndex": 12,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780510",
      "Title": "Zoh we love you because..... K-Lo katie31"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 22, 2012 10:51AM suz45 wrote: Chickadee, Im so glad that He's ok! Thats all that matters now... its not worth the coulda shoulda woulda scenario. That was then, this is now. Move forward and dont beat yourself up over it. None of us really know how we will react in the event of an emergency.. My first thought is always get then to the Hospital asap... not the right choice in most cases, but this is our loved one and we want to get them help as soon as we can! Bug hugs to you both! Suz ps. Really glad he's ok!",
      "MessageIndex": 22,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784497",
      "Title": "My stupid decision (off topic) Chickadee bhd1"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 24, 2012 12:51AM suz45 wrote: Definately not a wimp, but probably really tired. Fatique is a sneaky se that tends to whoop our butts before we know whats hit us. Top that off with nasea, muscle aches and lung issues well my hats off to you. Your much tougher than your giving yourself credit for. Try to rest when you can and hopefully tomorrow will be a brighter day. Hugs Suz",
      "MessageIndex": 8,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781519",
      "Title": "Am I being a wimp? Sido rosasmommy"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 26, 2012 01:59PM suz45 wrote: Funny, I always wondered why this was never mentioned in regards to treatment of se's. Ive been really curious over the last 4 years that I hadn't seen this even remotely mentioned on the boards... not that Ive been all over the boards. Mostly the chemo threads, Canadian forum & the stage VI forum... Living in BC Canada medicinal marijuana is just about more common than Tylenol. Ive had both my GP & Oncologist tell me I should try it (by prescription) Im more concerned that it would make me paranoid and focus too much on the cancer... So up to this point Ive just passed on it (literally). I also know people who run a legal marijuana growing operation. They pass all the inspections, get permits, are fire inspected yearly as well as all the other legal requirements in an operation of this sort. Its kind of cool really.. There are a LOT of Cancer patients that swear by this. Ive got no problem with any of it, just think my brain would do the opposite of what I would want. I need something that will make me eat, control anxiety and sleep properly. I have weight issues right now.. Im losing too much. Most food is a complete turn off for me.. well except ice cream, chocolate pudding & cake. Not exactly healthy stuff to try to live on. One thing about eating marijuana  (like in brownies)  is you tend not to get the munchies quite so much and the high lasts a lot longer... neither of these things would really help me (well maybe the pain control part). Then smoking it would cause all sorts of insurance problems as Im registered as a non-smoker. I can just see them pulling the plug on my life insurance if I started now. Anyway its great to see this here!  I found a thread in the stage III forum just the other day and this was my post on there. Guess I didnt really dig or search for it was just surprised I hadnt seen it mentioned :D Hugs Suz",
      "MessageIndex": 77,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764103",
      "Title": "Pot ~ weed ~ and other cures. :) lisa34lisa radiant"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 13, 2012 12:44PM suz45 wrote: Im so sorry for your loss Dave, I cant imagine how you must feel. She sounds like such a beautiful person. Thank you for bringing her to us in a very real way. Gentle hugz",
      "MessageIndex": 37,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780774",
      "Title": "Kimberly Obituary dhmeiser bdavis"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 31, 2012 12:28PM suz45 wrote: When Im feeling down or helpless/hopeless I watch this song \"Calling all Angels\" by Train. This was posted on my facebook wall a long time ago by a very dear friend who's dealing with cancer as well. The line \"I wont give up if you dont give up\" brings me to tears. Not sad tears but tears of relief, I dont feel alone when I hear it. http://www.youtube.com/watch?v=TaG9SDxwPBg&feature=player_embedded Geeze I have a gazzilion phrases, My tag line is probably the one I try to live by, Lol I wont write it out as its at the bottom of this post :) \"You never know how strong you are until being strong is the only option you have\" So very true... this is written on my computer screen so I see it every time I open my laptop. Then finally Ladybugs.. I see them as a sign of hope, healing and luck. I have friends on facebook that post \"ladybug sightings\" as whenever Im well I send out my \"Lucky Ladybug\" to others that need her. Guess thats how I ended up with the nickname \"Ladybug\" ",
      "MessageIndex": 6,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781889",
      "Title": "Songs/ sayings/poems that motivate you? learnin DivineMrsM"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 8, 2012 03:05PM suz45 wrote:",
      "MessageIndex": 15,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 9, 2012 11:54AM suz45 wrote: Bestbird, Thanks for the post that it didnt work for you. Did you use the right amount of it? I know some people have said they had to use much more than the 1 gram that prescibed and they use it interally as well as on the clitoris area. Also did you try the lidocain for the pain? I really hope it works the next time around. I found I had problems reaching an orgasm last time I used it, but was still very pleasant and no pain. I just started using Gabapentin again a week ago.... SE no cookies foe me. Will lower my dosage & see if that helps. Lol, I overheated my \"toy\" trying  hope I didnt break it. Hugs Gals, Suz",
      "MessageIndex": 43,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 11, 2012 04:41PM suz45 wrote:",
      "MessageIndex": 91,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 11, 2012 07:43PM suz45 wrote: To follow Gingers post... Gabbapentin definately affects the libido. Ive now gone 3 days without it and things are definately looking better. Just about fried my awsome lil \"wii vibe\" the other day. This toy hasnt let me down yet so I was shocked when I actually overheated it. Wasnt sure if the gabba was helping anyway with HFS and night sweats. Hugs Suz",
      "MessageIndex": 100,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 31, 2011 12:28PM suz45 wrote: I have to agree, I find I'm in tears everytime I log on right now. I pray that 2012 will bring peace & miracles towards a cure. Sending so much love to all in need... such a fine line wer'e walking on. Hugs Suz",
      "MessageIndex": 11,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780267",
      "Title": "my o my apple Iwillwinthisbattle"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 5, 2012 04:44PM suz45 wrote: My first \"time stamp\"  was a few months to 2 years. Ummmm no! Am just over 1 1/2 years now and last scan showed all tumors shrinking. Im on Xeloda & Clodronate with minimal se's. Hope you find what works for you. (im TNBC & BRCA1 gene) Hugs Suz",
      "MessageIndex": 3,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782201",
      "Title": "Metastatic TNBC - any survivors? rahimaw Bestbird"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 20, 2010 01:48AM suz45 wrote: Paxton, I see your also triple neg and on round 2... is yours on the same breast? Im brca1 and the second cancer is actually a new one, not a spread from the first. Did you get chemo this time? I feel like Ive been through hell and back going through chemo and rads twice in 2 years as well as having an oopherectomy in between. Hugs Suz",
      "MessageIndex": 14,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 21, 2010 01:44AM suz45 wrote: Paxton Thanks, We will still be the beautiful people that we are now! Its hard to think that way, but as people we are what we are and no surgery can change that!! Love and hugs. Suz",
      "MessageIndex": 18,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 31, 2010 03:21PM suz45 wrote: Jenni, this is round 2 for me. The first time I knew absolutely nothing and the surgeon asked me if I wanted a lumpectomy or massectomy.... I just said take as much as is needed and leave the rest. So he just did a lumpectomy and removed 21 nodes. I found out my stage that time after the surgery. I didnt even know about this board, it all happened so fast. Needless to say I know a lot more now and have been through chemo ands rads twice along with that first surgery and an oopherectomy. This second cancer in the other breast hit so fast that they did a whole ton of tests to see how far it had spread (and I pushed for tests, being in Canada they dont always let you know what can be done) Paxton, fantastic news!!! Your right, just breath. Hugs Beck, thanks for the info and YES use your pain meds and dont get constipated. Went through all that with Chemo. Gotta keep on top of everything. Great idea the pillow for the ride home. Wow, there sure is a lot of us going in mid month. Guess we'll all have each other to bounce questions off of as well as our early gals. Love and hugs Suz",
      "MessageIndex": 55,
      "PostDate": "31/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 12, 2010 04:42AM suz45 wrote: Im back... So glad to here that everyone is doing ok after the surgeries. Ive got jet lag and a nasty case of nerves. Cry for no reason at the drop of a hat. Had a bit of an accident the second day in mexico... slipped on the wet marble floors as I was getting ready for dinner. Hit my head really hard (knocked out) and needed stitches. So much for all that snorkling I had planned, we had a relaxing vacation anyway. I did a lot of sleeping on the beach cabana beds and made major bubble baths in the 2 person jetted tub that was in our room (not the bathroom) had bubbles 2 feet high. That was my comic relief. I did get to kayak for a short run on Friday but tired very quickly. No problems with my radiated right side, I just used tons of 80spf sunsceen on it and 30 on the rest. It kind of evened out the radiated box I had going around the right breast. Im rambling and its after 3am. Wednesday seems so close now and my house is such a mess. I wish I could have immediate reconstruction. I know its for the best that I dont as the cancer was too aggressive this time, but the thought of no boobs for a year (maybe two) isnt really working for me right now. Im hoping I can have some of that shared calm that all of you get when its finally done... I guess tomorrow I can waste a few hours having the stitches in my head removed at a clinic. (hmmm practice) I also love that mantra \"you dont have to be brave - just show up\" as Im not brave right now. Love and {{{hugs}}} girls. I know there is a lot of us going in this week. Strength and Courage Strength and Courage Stength and Courage Love Suz",
      "MessageIndex": 151,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 12, 2010 02:46PM suz45 wrote: Hi 1marmalade1, Yes I did chemo, rads then will have surgery this time around. Back in 07 they did a lumpectomy with 21 nodes removed on my left side, then chemo, then radiation. The cancer was much more aggressive on my right side (this time) and I had a lot of node involvement... under the arm, along my colarbone and also the interior mammory nodes behind the chest wall. So they wanted the chemo in my system asap, then radiated, now will have the surgery. I guess they can also monitor how well the chemo was working by doing it first?? Oh well, still havent made it to the clinic to have the stitches removed.... maybe I can have them do it on Wed before surgery  Ohhhhhh and I will FINALLY get my port out as well. Now THAT will make me happy. It sits so high this time that it always gets in the way or bumped. Love and hugs Ladies.... Suz Lexmom sending good vibes and prayers out to you today. Strength and courage Strength and courage Strength and courage",
      "MessageIndex": 159,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 18, 2010 05:40PM suz45 wrote: Sorry Nikki, Cant imagine a 4 year old right now... lord give you strength. Mine is almost 20 and then there is dh. Thats enough for me  .. I havent had a leak yet from the tubes but they sure can be painfull... I had surgery on WED and still no word from the homecare nurses. Spent half the day trying to get a hold of them... hopefully someone will call in the am. I thought I was supposed to have them in every 2-3 days?? Oh well, still napping a lot so Im sure time will fly, Love & Hugs Suz",
      "MessageIndex": 194,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 28, 2010 09:26AM suz45 wrote: Wow took me forever to catch up on everyones posts! I see most of us are in the same boat with a few different issues. I saw the surgeon on the 26th for my follow up and was totally shocked when she jusy pulled all the bandages off and said looks great you dont need to cover anything (except my one drain) that will be removed tomorrow as it finally slowed down. Awesome news on my pathe... The chemo and radiation did a number on all the tumore and nodes. All that was left was a carcenoma \"in situ\" which was non invasive and only.7cm. All my nodes, they took (19)  were clear as well as both breasts. So as far as they were concerned my treatment worked great. They also gave me softies to put in my bras. Said I should wear sports type bras with them for now. I tried them out and wouldnt wear them with a fitted tshirt, but they add bumps with a loose shirt or blouse. Im happy with that for now. I bet they would look way better in a la Senza nicely shaped bra??? As far as pain and range of motion we all heal differently as every surgery was different. I have great range of motion on my left side, but those nodes were removed 2 years ago and I went through hell then as I had numbness from my elbow too my ribsand really bad cording. That surgeon just cut right through all the nerves. Now on my right side Ive had 19 nodes removed but my surgeon tried to save the nerves, so I have minimal range of movement and a terrible burning under my arm. Am taking Gabapentin and T3's for the pain and doing my exercises to try to hurry the recovery of movement (so far can only raise my right arm shoulder height) Question.... Has anyone heard if we are allowed to fly so soon after surgery (2 weeks) I forgot to ask the surgeon. I want to go on a last minute special (cruise from sanfransisco to vancouver) on may 5th. I would fly there and cruise home as I live in vancouver. Need to find the answer quick on this as I have to book it right away.. Love and Hugs Everyone, We can make it through the good, bad and the other stuff  Suz",
      "MessageIndex": 272,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 28, 2010 01:05PM - edited Apr 28, 2010 01:14PM by suz45 Paxton, They kept you in the hospital for 5 DAYS... holy smokes, thats unheard of here. I got one night barely. My surgery was finished at 5 pm and I left the next day at 2 pm. They would have had me out sooner but dh was busy till then. I would have loved at least one more night in the hospital, I really felt I wasnt ready to go home, but thats just the way it is. I havent shopped for those camisols yet, but will soon. I wanted to wait till my last drain is out. Oh and I had my first real shower today...I feel so CLEAN, lol. I may have overdone it time wise in the shower as I noticed a tiny spot on my left incision that had a bit of blood on it. Could have been a small scab that got washed off as I used a washcloth and sterile soap and gave myself a good scrub. Am gonna rest for a while and let it all dry out. Choirlove, I usually pin my drain to the waist of my pants and wear longer tops that cover it. Also have a little pouch that I pin to a beltloop that the drain bulb fits in. And if Im wearing something with a pocket I tuck the tubing away and put the bulb in in my pocket. For the most part I keep it out of site, but I dont like it against my skin.... Im hoping mine will be out tomorrow (crossing my fingers) Love & Hugs Suz",
      "MessageIndex": 274,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 30, 2010 09:15AM suz45 wrote: Dustysmom, Hang in there there hun, Im sure its a really creepy feeling to have a few forein objects in your chest. Have also heard they are like turtle shells in your chest. Hopefully they can tweak them so you are more comfortable, they might just be in a bad place. Gentle hugs Suz",
      "MessageIndex": 300,
      "PostDate": "30/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "May 1, 2010 10:36PM suz45 wrote: Jessamine, I was up there for a few days but my left dropped to almost nothing right away. My right side stayed between 60 and 80 for almost 2 weeks, thats the side they took 19 nodes from. Hanta Yo, Yes I have a really heavy (tight) feeling in my chest when Im still for a while and totally seize up after sleeping for a few hours. The worst is my right side where they took all the nodes. Im also still taking pain meds, but am down to T3's. Hugs Everyone, Love Suz",
      "MessageIndex": 309,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 20, 2010 12:20AM suz45 wrote: Hello Ladies, I guess I'll join you in the April group.. Im having a double masectomy w right side lymph node disection on April 14... I started this journey August 15 2007 and had a lumpectomy with nodes removed then 4x ac/ 4x taxol and 15 rads on my left side... well in August this last summer I found cancer on my right side that was very aggressive.. a cluster of at least 8 tumors and nodes under arm, in neck and behind chest wall. Ive just finished 6 rounds of DC and 25 rads 2 days ago. Im trying not to think about a year or two with no breasts. I havent bought anything yet as this has all been so fast. Im not even sure as to what I will need to buy?? Im going to try to recoup and recover quickly from the rads as I plan on spending a week at a resort in mexico before the surgery. Sorta my last chance to enjoy being me, if that makes scense. No matter... It will give dh and I a chance to be pampered and spoiled. So thats it for the moment.. would appreciate hearing how everyone is doing and dealing with the physical and emotional aspect of all this. Big Hugs Suz",
      "MessageIndex": 13,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 20, 2010 05:48PM suz45 wrote: Paxton, Our orginal dx's are a month and a bit apart... my mri also is showing something on my liver but they are saying its a cyst?? I feel for you on the broncitis as well... I had it twice this winter while on chemo. I cant imagine adding a newborn into all of this at the same time {{big hugs}} hun. My Oncologist is trying to get me in to see a \"therapist\" but Im not ready for it yet. Caused me more anxiety that anything when she set up an appointment, so I cancelled at the last min . Im sure I'll need it later but Im using my vacation as a positive focus point and distraction right now. I'll have 3 days after I get back to get ready for surgery. I do think meditation and acupuncure are a great thing! They got me through the first round of cancer along with the Dec 07 chemo girls on this board. Oh and where do you get these post surgery camisols??? Do I need them (yes, I really do have my head in the sand) By the way I am 48 and have a 19 year old son who has just moved into my main floor bachelor suite. Love and hugs Girls, We can get through this! Suz",
      "MessageIndex": 16,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 28, 2010 08:59PM suz45 wrote: Write me up for disorganized, and scared. I called my surgeons office and they said I dont need to bring anything extra. Im having a radical masx on the right (nodes removed) and a modified masx on the left (already had lumpectomy and 21 nodes done in 07) I cant have reconstruction for at least a year and I will just be in the hospital one night. Now that scares me more than anything, but I will deal with it. Im thinking the most important thing to bring is a big baggy front zippered or buttoned sweatshirt to wear home as it will be too painfull to pull anything over your head. And it gives you something to hide all the drains under. Also think baggy sweatpants and slip on shoes are in order. This was my dress code when I had a had the lumpectomy/nodes done. I couldnt raise my arm higher than my shoulder at first. Love and hugs my friends, our new journey will soon begin. Suz",
      "MessageIndex": 30,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 22, 2010 07:01PM suz45 wrote: Re:tingling numbness & burning The first time I had a lumpectomy w 21 nodes I was \"really numb and tingling\" from my elbow all the way to my ribs. I was getting a fair bit of feeling back by exercising it at aprox 6 -8 weeks. I had just noticed I had 100% of feeling back when I was rediagnosed on the other side. This time my left side is fine but the right has a horrible burning almost bruised feeling. I was kinda wondering whats up with that.. I mentioned it to my at home nurse and she said excersise it and it will help. I go to see the surgeon monday so will ask her about it. Today I have most of my bandages off. My steri strip is just one long horizontal piece with a one inch gap in the middle. Even my nurse thought this was unusual, but said it should make for a minimal scar. Im getting used to the site of the new me and its not bad, I would like a nice camisol with bumps in it  Will go shopping for one after I see the surgeon..they are in the same area. Love & Hugs Suz",
      "MessageIndex": 233,
      "PostDate": "22/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 14, 2012 12:48AM suz45 wrote: Cheryl, Im another one that has fluid buildup in the pleura lining. As I understand it, the pleura is a lining thats normally attached to the lung. When the fluid builds up in the lining it compresses the lung which can be very painful & can also cause extreme fatigue as well as shortness of breath. Im not sure from your post if your Mom has fluid right in the lung or in the lining? Mine started the end of Sept 2011. I had it manually drained with a needle the first time (over a litre) and within a week it was right back again...thats enough fluid to reduce the lungs air capacity by half so the lung Onc set me up with a PleuraX drain. At first I had just over  800 cc's drained twice a week (over 1600 weekly) and at the same time I was started on the oral chemo Xeloda. The fluid is decreasing every week and today was my first full week with just one nurse visit/draining. I had only 360 cc's of fluid from the whole week!!! They are talking that I may be able to have it completely removed by Mar-April. The good thing about this type of drain is you dont have the bulbs or fluid on the outside of the body, just a clear plastic tube with a lock on the end. When the nurse comes to your home, she hooks it up to a vacuum bottle that slowly draws the fluid out. When done they sterilize, pad & bandage it all back up, then apply a waterproof dressing over it all. I have no issues with showers or shallow baths. They give me extra bandages just in case part of the tape lets go. Sorry for the long post... as you can see everyones situation/experience is a little different. Personally I dont like the drain but Im really glad I have it. The oncologist said that someone with my situation would have had almost no chance of the fluid drying up if they had done it by needle. Also they would have had me come in every 2nd week instead of getting a homcare nurse twice a week.... its much less painfull as it never gets really bad. Someone that has a larger volume of fluid can even have it done more frequently (3 x weekly or every 2nd day) Thats great because its not allowed to get really full = better breathing ,less pain. I hope this helps, Suz Oh and im triple neg with BRCA1",
      "MessageIndex": 7,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780972",
      "Title": "Stage IV Mestatstic bc lungs CherylGuy Helmie"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 30, 2007 05:24AM suz45 wrote: Good morning Jan Jewels, I'm Suz from Dec 07 gang  and have been been reading along with all your posts. I think you are all wonderful and strong so hang in there.  KathyL, I had my port placed Dec 11 and 1st tx on the 12, 2nd on Dec 27 without any problems or extra pain. I hope this helps. Didn't even need the lidocain spray. Take care all, and the worst part is the fear of the unknown. Love and Hugs Suz",
      "MessageIndex": 199,
      "PostDate": "30/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 11, 2012 10:45PM suz45 wrote: Happy Hugs! Wonderful news. Be happy & celebrate.. we all have our ups & downs, but really have no control on how our body reacts to tx. I'll repeat whats already been said... its stories like this that gives hope to everyone. Clinking a glass of bubbly for your very good news! hugz suz",
      "MessageIndex": 40,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780879",
      "Title": "Survivor Guilt - I am a lucky girl Fitztwins nancyh"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 16, 2010 05:51AM suz45 wrote: Rayosun & Paxton, Hope all went well yesterday! Mantra Jenweg and Algreach, My prayers are with you to stay at peace, while you wait. I did the same thing got a million things done on nervous energy.... Note for anyone I went to a maternity store tues & bought a really cute long zippered t shirt and a $70 button up boyfriend sweater for $15. They had tons of different jammies front openers as well. I plan on going back in a few days when I feel stronger. Maternity clothes arent like what they used to be... they are fitted for the bust big belly but fit beautifully when worn on a straight figure. Just lots of front openings and a longer torso on them. Also found Winners had a ton of front opening jammies with 3/4 length pants. I was told by my sil not to bring jammies from home (just non skid slippers) as the hospital provides gowns with all the right openings. Made sure I had panties with a sassy saying on the butt to humour the staff. Lol it worked. Its after 3 am so Im going back to sleep. Love ya all and will be sending out great dreams and prayers. Hugs Suz",
      "MessageIndex": 175,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 25, 2010 02:56AM suz45 wrote: Well I guess the shit hit the fan today. I had a complete  meltdown. It started out as a simple first trip to the grogery store to pick up a few items by myself. Tried on half a dozen tops before I realized nothing that I would normally wear was wearable right now. So I tried to put a bra on to see if it would work for a bump and made things worse... a D bra doesnt do a thing for a flat chest. I cried my heart out, but just put on baggy clothes and did my first shopping trip anyway. I guess I will need to make some changes.... I thought because both were gone things would be easier... maybe not. Im so glad I meet with my surgeon monday, I need guidance big time. Love & hugs Suz",
      "MessageIndex": 249,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 29, 2010 11:36AM suz45 wrote:",
      "MessageIndex": 283,
      "PostDate": "29/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 17, 2010 02:18PM suz45 wrote: Lorieg, I have been cat napping since I got home thursday afternoon. I dont think its unusual to be tired after all we've been through. I used to be so full of energy, but plan on listening to my body for the next while... if it wants sleep then sleep it will be. Love & Hugs Gals, Suz",
      "MessageIndex": 187,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 21, 2010 12:39AM suz45 wrote: Jessamine and Anacortes... thats three of us that have had Chemo/rads then surgery. Also am brca1 pos. This is my second time around, first time had lumpectomy chemo rads. I found out I was brca1 pos, after the fact. So not even a week after surgery and I feel pretty good. Ive had the drain removed on my left side, But the right one will be a while, I also have the burning pain on that side. I think thats from them cutting the nerves. It feels more like bruising along with some numbness. I remember having the same issues when my nodes were removed on my left side in 2007. Overall I feel way better than I thought I would. Im looking forward to getting a few pretty camisoles with pockets so I can have some bumps under my clothes. I plan on waiting till surgery has healed. I do remember that doing the exercises 3 times daily really helped with the burning and with range of motion!! Prayer to all who are going to surgery this week. Wishing you peace of mind as you start this journey, Love & Hugs Suz",
      "MessageIndex": 224,
      "PostDate": "21/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Apr 28, 2010 11:11PM suz45 wrote: Mtbookworm, That just sucks when they do that! Im so sorry you have to go through the anxiety of waiting {{{big hugs}}}  I hope all goes well. As for the exercises I got a one sheet handout from my at home nurse. Nothing special, shoulder shrugs, sideways stretches (like a snow angel) holding your hands behind your back and raising them, take one hand and hold the opposit shoulder and press on it (then repeat other side) and the one that works the greatest is stand in front of a wall and put both hands on it with fingers spread open.. slowly spider walk your fingers higher and higher up the wall and hold it when you reach your max. Each exercise should be started with 3 reps and hold for 15 seconds. Lol thats all Ive got from memory.... I think there was one more but that should get you started till you get something from your docs. Basically just try to stretch the arms out in the areas that there really tight. Hope that helps a bit. Hugs Suz",
      "MessageIndex": 278,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 15, 2008 11:19PM suz45 wrote: Dana , try this.... the cat pose/stretch  also better instructions c/o Amy Dec 07 gals www.abc-of-yoga.com/yogapractice/cat.asp I hope this helps. Love & hugs from Suz (Dec 07)",
      "MessageIndex": 1902,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 13, 2007 05:12PM suz45 wrote: Hi All, I'm from the Dec 07 thread.I just had my port put in Tues and 1st chemo Wed. I agree with you all, waiting is the absolute worst part of all of this. A silly tip for those of you who have to carry the drain around. I went to a liquidation world and picked up a few gift card stockings or bags. One of them was a rectangular pink velvet bag with a white fur top & a ribbon handle. The drain fit perfectly into it and I pinned it to a belt loop on my pants. The tube itself can be tucked up a bit around your bra or shirt. Both my surgeon and my doctor thought it was ingenious and I even got complements on what a cute idea for a change pursefrom people at a store. About me, I found my lump at night on Aug 15, had surgery Oct 19 and of course chemo Dec 12. That was probably the longest 4 months of my life. Figure I'll be losing the hair for the new year, but thats really alright with me. Its just a part of this journey that we're all on and I feel so honered to be able to share it with so many others that understand. Start each day as if it were on purpose, I forget where I heard that but I truly get it. So peace & love to you all and I'm sorry you have to be here. Hugs Suz",
      "MessageIndex": 23,
      "PostDate": "13/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 27, 2012 02:35AM suz45 wrote: Maddy, Good to hear that your dates got moved up, I dont know much about any of this but wanted to say your both in my thoughts & prayers! Please keep us posted on how the treatments are going once they start. Really hope they get the pain under control very soon! Hugs Suz",
      "MessageIndex": 18,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781591",
      "Title": "Bone Mets- \"hundreds\" of lesions? MaddyMason chrissyb"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 12, 2012 06:17PM suz45 wrote: Heh heh, love this :) Add into bag different shoes in case feet swell.  Also the monda case of pills that either have to be taken with food, then the 1 hr before/2 hrs after eating pills.... personally its hard to find the right time to take all this stuff. I wonder if thats why you see lol (little old ladies) pushing the mini cart with a seat on top.. ya gotta stop to take your meds. Not knocking lol as I feel like one now. hugz",
      "MessageIndex": 19,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780894",
      "Title": "Need a bigger bag... alesta29 Leah_S"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "suz45 wrote: I just did a great long rant that went poof into thin air..... probably for the better. Sigh..OK I just got in from seeing my PS and they are refusing to do any reconstruction on me NOTHING! I was supposed to have a one year delayed DL but now have bone mets, as far as I know its on one or two back ribs (right side) I had my onc call over before to let her know my new status & now She tells me its a no go for ANYTHING not even any sort of implant.... This is just putting me over the top right now. I dont want to live the rest of my life with two stupid heavy uncomfortable glops of goop pretending to be breasts strapped on with thunder wonder bras. It just isnt me.....  Im not 90, I care about my figure even if I just have a few years left I want to look like me. (sorry for anything that sounds derogatory, I realize many woman live with prothetics or nothing at all and are just as comfortable with it) ...Im not & dont want to be The long and the short is: has anyone had delayed reconstruction on a radiated chest with a BMX after being dx with bone mets to the ribs (also brca1).. Suz Laugh your heart out, dance in the rain, cherish the memories & ignore the pain, love and learn, forget & forgive. Remember you only have one life to Live. Dx 11/25/2010, IDC, 6cm+, Stage IV, 8/23 nodes, mets, ER-/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 17, 2010 01:23AM suz45 wrote: Incredible news I'm NED, yes NED..... dancing with joy. I cant believe it! The rib was the only affected area that had mets to the bone and the ct so far looks clean as a whistle. Since they radiated the rib I'm classed as dancin with NED... Breaking into an old Ann Murray song ...\"can I have this dance for the rest of my life, will you be my partner every night, when we're together it feels so right, so can I have this dance for the rest... of... my life. For the record Yes they are revisiting the reconstruction as well in some form. Im just about speechless & on cloud nine! She did warn me that she still thought I had just a few years... but baby I'll take that optimism and turn it into 20 (well maybe 5) but who cares. This is the most incredible Christmas gift EVER. Love & Hugs Suz xxx",
      "MessageIndex": 8,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 15, 2010 06:01PM suz45 wrote: Leah, As far as I know they are not doing anything for treatment besides having me take Clasteon. Maybe because Ive already done chemo twice and Im triple neg. Will see tomorrow if the Oncologist came up with some way of getting me the PARP inhibitors. But the way she spoke 2 weeks ago it was like I just had a few months to a year. It doesnt sound right to me unless there's a whole lot that hasnt been said yet? I keep hearing here that people are in treatment or that bone mets are not so bad..... It has me really wondering why they are basically doing nothing My PS said there was no way she could do implants on delayed recon with radiated skin... The only surgery would have been the Dorsi Latissimus and that one was too dangerous given thats where my mets are & the Oncologist didnt want to me to be under that long... considering I went in today to get some answers all I have is a whole lot of unanswered questions Hugs Suz",
      "MessageIndex": 3,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 16, 2010 11:52AM suz45 wrote: Annie, Thanks, its not that I don't want to hear it... I just want to know all options even if the answer is I cant get anything done. I appreciate any & all information as this board, the people here are a godsend!! Ive learned more here than I have from any/and all my doctors put together. Alex It was my Onc who said she wanted me to get implants instead of DL, but the PS said it cant be done without adding tissue from another source (belly, back, butt & so on) but she hasn't done a lot of these surgeries & they both think they are too difficult to do in my situation.. I'm really wondering if its a monetary thing here as my recon should be covered by our provincial health plan (wasting tax dollars on a lost cause) Wish me luck as I head to the Oncologists this afternoon to \"try\" to get some up front honest answers... if that's possible. Hugs Suz",
      "MessageIndex": 7,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Dec 15, 2010 06:07PM - edited Aug 20, 2013 03:24AM by suz45 Alex, Thank you! She said tissue expanders & implants wouldnt work? Even without the mets... geeze I wish I knew more before I went in... I didnt expect to be sent to the curb with a \"you can get a second opinion\" Where abouts are you? (im in canada)",
      "MessageIndex": 4,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762064",
      "Title": "Delayed recon on radiated BMX? suz45 Laurita"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 2, 2008 12:12AM suz45 wrote: Hi Wetcoast, It looks like you are on the same treatment that I am. I started a/c in December and will be starting taxol on Tues. My Oncologist said no problem when I asked to have a port put in. Where will you be getting your treatments? Mine are at the Vancouver Cancer Clinic. I copied out a few chemo bag supplies from another post. When I was having a/c it took about 1 1/2 hours so I really didnt need alot. I start Taxol on Tues and the Nurse said it will be 4-6 hours depending on how well I tolerate it. I used some of my chemo time to write out Christmas/Thank you & Birthday cards. I plan on bringing a small dvd player to watch a few movies during the longer treatments. Hope this helps. Chemo bag : pack it up and keep it packed so on chemo day, you just grab it. I replenished it night before. I brought my book, magazines, chocolate, hard sour lemon candy,pretzels , bottled (flavored) water or ice tea, my glasses and iPod, chapstick Your own blankie .... the hospital ones aren't as comfy. pics of your family ... Show the nurses your pics. You are a person and they need to know you and that you have a family who will wring their necks if they keep blowing your veins!!! Actually, you want them to take good care of you and give you good treatment!! old magazines: Have you noticed there are no current mags in the chemo clinic??? Bring your recently read People or latest paperback book and leave them so the person who forgot their reading material, or the first timers have something to read. Kleenex: Have you used their Kleenex??? It's that sandpaper tissue!! I like my real stuff, sometimes I love the lotioned up Kleenex. Take care, Suz",
      "MessageIndex": 65,
      "PostDate": "02/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Jan 27, 2008 07:19PM suz45 wrote: Hello Friends, I'm Suz from Dec 07 thread. I am at the halfway point through my chemo treatment. Its not real easy but with the support here you can do this. The worst truly is the not knowing, its all uphill from there. I would suggest reading the thread, \"tips for getting through chemo\". I just bumped it up to the first page. There is an incredible amount of valuable info that will help you start this journey. Good luck to you all and stay strong.Please dont hesitate to ask any questions. Love,Hugs and Peace. Suz",
      "MessageIndex": 27,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Mar 13, 2008 01:51AM suz45 wrote: Hi Donnalee, I used the lint roller constantly to get rid of the uncomfortable stubble. I post mostly Dec 07 gals. I am down to my last chemo coming up this next Tues. My treatment was 4 X AC every two weeks then 4 X taxol every two weeks. HAIR..... Its about the hair because hair is so personal. Head, I cut mine short then buzzed it when it started coming out in clumps after two weeks (christmas day) All other hair has been sporadic. Right now almost all hair is gone (7th treatment) My head has shedded twice and now I can just barely see fine white fuzz growing (full head) legs & armpits are smooth. 7 out of 8 tx. Eyebrows & eyelashes. This has been one of my biggest fears. My eyebrows are very thin and patchy, maybe they will hang in as they are, they really dont look so good. My eyelashes as of today are 100% gone. My eyelids are swollen and almost seem to have a thin blister along the upper edge. I did go out today and makeup really does hide looking sick.  If you have no lashes eyeliner (soft)totally hides it. I highly recommend the look good feel better class. They will teach you how to draw eyebrows and lashes. Also they utilize quality makeup, it really helps. I am almost done chemo and you will be too, really soon. I go on to radiation after this then I'm done . Please feel free to ask any questions. pm or here. Take care all & Im thinking about all of you. Warm hugs, Suz",
      "MessageIndex": 417,
      "PostDate": "13/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
      "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
    },
    {
      "AuthorID": "suz45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/59494/profile",
      "Content": "Feb 3, 2012 11:46PM suz45 wrote: Hugs {{Formygirls}} You are in the right place! Try to take a moment to breathe, Im sure right now everything is spinning but slowly things will slow down and you'll realize a lot of us stage IV TN girls are here living our \"new normal\" lives. I think there is also a forum on how to talk to your children. You are also young which means your body with help can fight this... I will agree with everyone that you might want to look into another Onc if yours is that willing to give up. Your going to want someone who is up on all the newest treatments and trials out there. Im kinda in shock that she would even say that.... Again Im so sorry for your news. Sending you positive energy and Hugs, Suz",
      "MessageIndex": 17,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    }
  ]
}