{
  "AuthorID": "Suzanne50",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
  "Posts": [
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 4, 2015 05:46PM Suzanne50 wrote: Hi everyone - had treatment #1 today. Nothing to report...I guess it goes downhill from here. 27 more to go!",
      "MessageIndex": 1335,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 14, 2015 07:01AM Suzanne50 wrote: I have 7 treatments behind me and 21 to go. So far no side effects that I have noticed. I was super tired this week but can't be from radiation so early??? I think it is just from life in general. I get up early, work all day, go to radiation, exercise, cook dinner, do housework, drive my kids places.....who wouldn't be tired???!!!! I am getting to know the people who are in the waiting room while we are all waiting for our treatment. They are all seniors. One lady is going to teach me how to knit. I have always wanted to learn so she said she would show me while we wait. Making lemonade out of lemons. ",
      "MessageIndex": 1553,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 18, 2015 05:05AM Suzanne50 wrote: Hi ladies - I saw my plastic surgeon yesterday. I am looking to get my tissue expander our as soon as possible. I have to go back in 6 weeks and if all looks good then, we will schedule the surgery - probably early March. So another step closer to being done with treatment. Next week I see my MO and will probably start tamoxifen. I have read so much about side effects but going to hope for the best. Can't worry about it till there is something to worry about....that's my mantra.",
      "MessageIndex": 2084,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Oct 18, 2015 03:21PM Suzanne50 wrote: Hi all - I am going for my simulation on Wednesday and planning on starting radiation Nov. 4th. I am looking forward to getting this next leg of my BC journey behind me.",
      "MessageIndex": 946,
      "PostDate": "18/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Oct 23, 2015 06:33PM Suzanne50 wrote: Hey Kelly - sorry to hear about your pain but glad you have a counselor to help you through it all. So much of this BC sucks! Just one thing after another but I keep thinking of the big picture. That a year from now (or sooner) this will all be behind us. I am trying to keep a positive spin on radiation - hoping for the best.!! It has to be easier than chemo! Or so I am told. I know - different for everyone. This too shall pass I keep say to self.  ",
      "MessageIndex": 1097,
      "PostDate": "23/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 11, 2015 09:06AM Suzanne50 wrote: I have 4 down and 24 to go. They are using a bolus every other day. I think it because I have a tissue expander?? and they are trying to keep the radiation away from it. So far so good. No side effects yet. I am just looking for the finish line.",
      "MessageIndex": 1482,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 16, 2015 08:05PM Suzanne50 wrote: pennsygal- I was told the same thing. I asked them specifically and they said that I could put aquifer on at night or weekends if I wanted to but it wasn't necessary until about the 3rd week when I would start to see some redness. Congratulations Rads Grads!!! Whooohooo!!!!! Done, done, done!",
      "MessageIndex": 1602,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 19, 2015 09:35PM Suzanne50 wrote: Hi ladies - I completed session 11/28 today. All has gone well - starting to feel some heaviness on right side. It feels like I am swollen and a bit sore. RO says it is normal. Starting using Aquafor at night but they really haven't wanted me to use anything else. So I just go with what they tell me.",
      "MessageIndex": 1676,
      "PostDate": "19/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 2, 2015 05:14PM Suzanne50 wrote: Congratulations Sloan! So nice that you are done!!! And did so well. I have 8 more to go (out of 28). My skin is just starting to get a bit pink. RO said I have done very well so far but that it can go south quickly. I hope not but only 8 more!!! I am so happy to almost be done with this phase of treatment. But I have to admit - I have been so focused on getting through each stage that now that the end is close, I can't help but wonder/worry if this will really be the end. Will I have a recurrence? I should just focus on the here and now. Sometimes I look back over the last 6 months and feel like it is someone else's life. For the first time throughout this whole ordeal, I think I may seek a 3D support group. Maybe it will help with my fears. I don't know. Heavy stuff.",
      "MessageIndex": 1874,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 15, 2015 04:17PM Suzanne50 wrote: Last radiation was today! I have graduated. My skin held up very well. It looks like I have a mild sunburn but not broken skin or rash. I am just glad to be done. Now on to tamoxifen and scheduling my tissue expander swap which I hear I won't be able to do for a few months. Seeing my Dr. Plastic on Thursday. Karen - hoping your lump is nothing! Good thoughts and positive prayers sent your way!",
      "MessageIndex": 2042,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Nov 22, 2015 09:51AM Suzanne50 wrote: Hi ladies - just wanted to pop in and say I also have been having a 'off tummy\" but nothing that really keeps me from doing things. I just haven't felt 100% at times. I have been very tired but not sure if it is due to radiation or just my life. I know I have said this before but it is hard to pinpoint the cause. I am only 12 sessions in and my RO say fatigue usually comes later. I am trying to keep up with the exercise as that really does help with my fatigue. I am just looking to get this whole thing behind me. Soon!!! Keep on chugging people. We are all fighters and heroes in my eyes!",
      "MessageIndex": 1728,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Oct 22, 2015 06:28PM Suzanne50 wrote: Hello all - I had my simulation yesterday and am starting radiation on Nov. 4th. I keep thinking that this is going to be easy compared to chemo but I guess it is not easy for all. Whatever it is, it is as it gets me one step closer to being finished with treatment. That is going to be a happy day!",
      "MessageIndex": 1084,
      "PostDate": "22/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 2, 2015 07:39PM Suzanne50 wrote: I definitely agree with surrounding oneself with the positive thinking! Thank you @Sloan for that reminder. There is another BC board that I visit and every time I go there, it is all negative stuff.....makes me down in the dumps. I think I need to ditch that site. I certainly do feel \"tougher\" than the cancer so I guess I need to hang on to that thought. No one ever knows what is store for them tomorrow. One thing cancer has made me realize is to enjoy the moments in your life. Live in the present. No guarantees for tomorrow and that goes for everyone...not just cancer survivors. I have done everything possible to treat my cancer and avoid a recurrence. I think at some point you just have to let it go and say it's out of my hands.",
      "MessageIndex": 1878,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 4, 2015 05:29AM Suzanne50 wrote: Hey Zinny - thank you for the pep talk! And you are so right - we are not dying now. so live life! I have moments where this crap gets me down but it is not how I want to spend my time - worrying about the future. I am down to 7 more sessions of radiation. The dr asked me if I am tired.....I am always tired. I work full time, have a full time family, get up early to exercise and have radiation 5 days/week. Life is exhausting. Skins still looks good. Counting down the days!",
      "MessageIndex": 1909,
      "PostDate": "04/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 9, 2015 06:05PM Suzanne50 wrote: 4 days of rads left to go and my skin has held up really well. Just this week it is looking tan and speckled but not itchy or irritated. I can't wait to be done mostly just so I can leave work and go straight home and not the daily radiation grind. I am lucky that I work close to my radiation center. Still, I come home exhausted and it certainly has put a damper on my holiday shopping as I can't do anything in the afternoon. By the time I get done with radiation, I just want to go home and put my slippers on!! Oh well - this too shall pass...in 4 more days. My next things on my BC chopping block is tissue expander swap out and Tamoxifin. Jane and Molly ....congrats on finishing!!",
      "MessageIndex": 1993,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Dec 18, 2015 03:42PM Suzanne50 wrote: Molly50 - I am getting my tissue expander swapped out for a silicon implant. But also having some work done on the other side - a lift and small saline implant to \"even me out\". Maybe I will look better than when I before cancer. Non saggy boobs might me nice!",
      "MessageIndex": 2088,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Aug 21, 2016 08:49AM Suzanne50 wrote: Waiting is the worst part of it all. You have no idea what you are dealing with and your mind can take you to some scary places. It is so hard! I have no great words of wisdom other than, keep busy. Try to go about your normal business - work, exercise,...anything to distract you from over thinking. Sometimes all this worrying is for nothing. Sometimes it turns out to be something. Whatever it is, you will deal with it. Hang in there! I remember that time very clearly. It was the hardest. Getting a diagnosis and treatment plan was easier than the waiting!!",
      "MessageIndex": 2,
      "PostDate": "21/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847148",
      "Title": "I'm a mess Begonia Begonia"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Jul 21, 2017 11:24AM Suzanne50 wrote: I had 3/12 nodes positive - one sentinal and two axiliary - all microscopic. I had a mastectomy, chemo and radiation. There was some controversy whether or not I needed the radiation. I got several second opinions and in the end, I went ahead with it.",
      "MessageIndex": 2,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/857196",
      "Title": "Lymph node involvement Margaret67 Margaret67"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Jul 20, 2017 01:54PM Suzanne50 wrote: The waiting and not knowing is the hardest part. Hopefully you do not have BC but if you do, be assured that once you get a treatment plan in place, you will feel better. Making steps towards recovery helps us to stay focused on being well. BC is scary! But there is a lot of treatment out there and people go on to live long, healthy lives. Just take it one day at a time. Hopefully you will find out it's a cyst. Keep us posted. Thinking of you!",
      "MessageIndex": 8,
      "PostDate": "20/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/857065",
      "Title": "I had mammo and ultrasound and now they want me to have MRI . 28sunnny28 Amylisa0706"
    },
    {
      "AuthorID": "Suzanne50",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/218543/profile",
      "Content": "Jul 23, 2017 11:13AM Suzanne50 wrote: I have gotten call backs and it was nothing. But also have gotten call backs and got the dreaded news. My advice is don't get ahead of yourself with worry. You may need a biopsy. 85% of biopsies come back benign. Take it day by day.",
      "MessageIndex": 2,
      "PostDate": "23/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857272",
      "Title": "Dreaded call back breastchangesfear MTwoman"
    }
  ]
}