{
  "AuthorID": "suzilla",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
  "Posts": [
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Nov 26, 2012 02:45PM suzilla wrote: Hello everyone!!! I hope everyone is going thru chemo with minimal side effects. I finished my 4 rounds of a/c treaments n am going to do my 2nd round of taxol of 4..... for me taxol so far is much easier than a/c but feel like if it comes and goes....anyone else feel this way? Does anyone have any advice for oral mucocitis? I havent gotten the sores in my mouth like a/c but i do experience dry mouth, swollen tongue, n heartburn..... any advice? I was given the neulasta shot after each treatment but began to experience excruciating bone pain that lasted more than 10 days....so my onc. Said we were gonna try the taxol this time without neulasta... i was doing dose dense but without neulasta it might delay my treatments by a week so instead of every other week for treatments it would be every three weeks depending on my blood counts. Does anyone know if blood counts drasticalky drop with taxol like a/c? Should i be worried about not taking neulasta?",
      "MessageIndex": 1468,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Nov 29, 2012 02:34PM suzilla wrote: Hello ladies! Hope u r all doing fine thru chemo....well at least with the side effects...n thanx for all the replies. Well im not taking the neulasta n see how that goes my onc n nurse assured me that my counts wouldnt drop drastically to b considered neutropenic....whew what a relief...my blood counts were good yey! N yes, i did use the claritin and also hydocodone with neulasta but pain continued for more than seven days....it was excruciating. I also bought the biotene dry mouth mouthwash and gum and toothpaste. Thanx for all the tips, you are all so wonderful and a blessing!! I also spoke to my onc. About my jaw... he mentioned tmj....like u stated melrose...so he said to take motrin and to see a dentist for a mouthguard. Well i now have a question since surgery is close, so for those that have had mastetomies with axillary node dissection, have u had lymphedema? I havebeen researching and found that 20-30% of patients that get ALND with mastectomies usually get lymphedema....and i am worried.....any advice?",
      "MessageIndex": 1477,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Nov 26, 2012 08:56PM suzilla wrote: Thank you ladies!.....i really appreciate your responses and support. Will any biotene mouthwash do? Or do i get the one for dry mouth? I get my second taxol this wednesday. The left side of my jaw feels i have been punched in the face.....is this a side effect too?",
      "MessageIndex": 1471,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Dec 6, 2012 10:49PM suzilla wrote: Thanx Melrose!!!! you are a Blessing to me! I hate being a pain in the A**, but sometimes my mind just gets the best of me. :( but, with your experience and help I have been able to cope better, sometimes just having someone to talk to is a great big help! ((((HUGS!!! and more HUGS!!!))) to you!",
      "MessageIndex": 2,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797277",
      "Title": "IBC, SURGERY, AND RADS! PLS HELP! suzilla Melrosemelrose"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "suzilla wrote: Hello Ladies! Hope you are all getting by with chemo with few side effects.  I have been thinking alot which is something I shouldn't do cuz I sbegin to think negatively.  Well I have two more rounds of taxol to go or maybe one if my neuropathy doesnt get too bad. Has anyone stopped taking taxol early due to neuropathy not getting worse so it wont interrupt your quality of life? How much of a difference will it make if I dont do the last taxol? I have completed all 4 rounds of A/C treatments and 2 taxol treatments..so far my neuropathy is ok i feel it from time to time but my right shoulder joint aches constantly, is this from chemo? Also, since I have a tendency to think way ahead sometimes.....and since surgery is just around the corner, I am seeking advice on some questions I have, so if any of you ladies have any information it is greatly appreciated. Questions: 1. Do we have to write a will out for bilateral mastectomy with axilla lymph node dissection? This brings tears to me for so many reasons. 2. How painful is the post op? How long should healing take? Will I be able to have motion in my arms? 3. Should I ask my oncologist or surgeon for a physical therapist to increase healing in my arms and in case of lymphedema? 4. I hear beaing nauseous is a side effect from the anesthetics, what can I take prior to surgery is there a patch that prevents this? 5. How long does surgery take? How long will I be in the hospital? 6. Should I be scared? 7. What list of items should I take to the hospital? what types of clothes should I wear? Where can I get a post op camisole with pockets for drains? 8. Also any information on Radiation? I have IBC, stage IIIb, estrogen and progesterone negative,  cancer did not spread, but I do have the gene. so that's probably how I have this. I await anyone whom can respond. Thank you all and God bless you all each and every day!! :) HUGS!! to all. Dx 8/2/2012, IBC, Stage IIIB, 0/17 nodes, ER-/PR+, HER2- Chemotherapy 8/11/2012 AC + T (Taxol) Surgery 1/16/2013 Lymph node removal: Right, Underarm/Axillary; Mastectomy: Right; Prophylactic mastectomy: Left Radiation Therapy 2/20/2013 Breast, Lymph nodes Radiation Therapy 2/24/2013 Breast, Lymph nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797277",
      "Title": "IBC, SURGERY, AND RADS! PLS HELP! suzilla Melrosemelrose"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Jan 23, 2013 04:07PM suzilla wrote: Hello Ladies!!! Sorry for not checking in for a while.....i have been recovering from my surgery on the 17th. My BS said i did very well and that all went good! Yey! I was so happy to see my beloved hubby and daughter when they took me to my room after recovery! I had no nausea due to the anti nausea patch they put behind my ear before surgery. The nurses and docs were all very courteous and sincere they took care of me good. I have been able to move my arms and walk around my home sibce returning back home the following day after surgery. I do try to stay on top of the pain tho' cuz it seems to work up slowly, and atarts to feel tight, heavy, and bruised...... i am taking vicodin. Does the tingling and numbness go away? I hope u r all recovering nicely. Oh and guess what? I went to walmart for a bit today, i wanted to get my young daughter something for her birthday tomortow. I got my first ugly look today...which in a way made me feel bad...but then i thought to myself...he dont know me!!! Or what i have had to go thru!! I forgive him for he doesnt understand.....i know i am bald and flat!! I love it, and best of all my husband loves me for the beautiful woman he knows on the inside! And my children love me too they keep telling me that im just getting cuter!!",
      "MessageIndex": 699,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Jan 8, 2013 03:43PM suzilla wrote: Hello ladies!!!! I have been going back and forth thru this thread and finally decided to post about surgery. I have IBC, stage IIIb, no mestastisis from my prior PET scan early on before chemo. So i'm done with chemo, and saw my surgeon yesterday andam scheduled for dbl. Mastectomy on 1/17/2013, which is next thursday. I am having a modified radical mastectomy on my right side and a simple mastectomy with sentinel node biopsy on left side. Has anyone been thru this? If so, is there any advice, comforting thoughts, information that u can share with me. What to take to hospital, post-op and post-op at home to make things easier and heal the wounds....all advice would greatly be apprecited. Also, wishing everyone undergoing surgery, post-op, or at home the very best and a speedy recovery. I am trying not to be nervous about it but cant help it....it gets to me",
      "MessageIndex": 283,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "suzilla",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163891/profile",
      "Content": "Jan 11, 2013 03:18PM suzilla wrote: Hello to all!! Warm wishes and comforting thoughts to all of u!! For those that have undergone surgery....i wish u all a speedy and healthy recovery! Also, for all that have a surgery coming up....u will be in my prayers! Well as it seems, the daybof surgery is coming just around the corner, and i find myself at times nervous and worried......ugh! Its a drag!! But that day will come! I have a few questions that i have thought of recently, and am hoping that whomever has gone thru a modified radical mastectomy and a SNB on the othet arm may be of some help? Will i be anle to move my arms at all? Will i be able to clean myself when i go to restroom? I dont have enough money for a camisole to put the drains in pockets....what can i do to make them tolerable?",
      "MessageIndex": 381,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}