{
  "AuthorID": "suzwes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
  "Posts": [
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 28, 2009 10:46AM suzwes wrote: Hi Suepen, I had brown hair and it fell out about 2 weeks after my first AC treatment in June.  It continued to fall out for the next 3-4 weeks (as did the pubic hair and underarm hair) and I was left with a white fuzz on my head.  The white fuzz never fell out and began to grow a couple of weeks before my last treatmet of taxol on September 23rd. The white fuzz (or gray as I've been told numerous times by well meaning people) is the longest now and actually lays nicely on my head.  Underneath there are shorter stubly brown hairs that are starting to show more.  In other words, I have gray hair with brown roots!  We're all different and we can all respond to treatment differently and uniquely, although it's nice to hear others' experiences so we can compare and learn from each other.  I hope sharing my experience helped a little.  Good luck on your remaining treatment, I'll be thinking of you. Suzette",
      "MessageIndex": 4126,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 28, 2009 07:34PM suzwes wrote: Hi Lilah, My eyebrows and eyelashes fell out after my last taxol treatment too!  I drew my eyebrows on (for the first time in my life too) for several weeks and about 6 weeks ago didn't need to draw them on anymore and about three - four weeks ago could actually use mascara.  I'm not holding my breath for them to stay though after reading some previous posts - I won't be disappointed if they fall out again and will be pleasantly surprised if I don't lose them a second time. Warm regards, Suzette",
      "MessageIndex": 4128,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 2, 2010 04:43PM suzwes wrote: I'm 3 1/2 months post chemo and you can see in my picture how my hair looks - not very much on my head but it's coming.  I just bought a biotin/B-complex thickening shampoo by Avalon Organics and have begun using it.  If it doesn't work I'll send DD to a salon to look for the Nioxon.  I'll let you all know if this shampoo works or if it doesn't after a few weeks trial.  Anyone have luck with the Biotin shampoos?",
      "MessageIndex": 4183,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 5, 2010 08:41PM suzwes wrote: Diane, Good for you!  It's so hard to \"take the plunge\"!  If I hadn't had my DD #1 and my DIL encouraging me I would have never gone without my wig or hat until sometime this spring - I swear!  With the advice and encouragement of the dear ladies on this thread, my DIL colored my hair this weekend and it looks so much thicker and I don't have the translucent/gray/white hairs anymore - I'll post a new picture sometime this week.  Congratulations Diane!",
      "MessageIndex": 4214,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 15, 2009 11:33AM suzwes wrote: Thanks everyone for this information.  I finished chemo in September and rads on November 24th.  I've been coughing for about 4 weeks, asthma meds helped at first (theophylline, advair, singular and albuterol) but nothing helps now and this cough is dry and different from the asthma cough.  I thought I was going crazy until I read these posts.  I see my PCP on Monday and will ask her to do a chest xray and give me some kind of med so I can at least sleep more than one hour at a time without coughing.  Elimar: I too have what feels like bruised ribs.  The radiation oncology nurse warned me that some women experience this after radiation - she did after her radiation.  She said hers lasted a few months after she finished radiation.  I think these coughing jags are making the rib pain even worse!",
      "MessageIndex": 14,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744855",
      "Title": "Coughing & Shortness of Breath During or After Rads KAK Chevyboy"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 30, 2009 07:43PM suzwes wrote: Diane,  It was hard taking my hat off the first time in public.  I mentioned in an earlier post that my DD and DIL were with me in the middle of the mall the day after Thanksgiving when they encouraged me to take my hat off and I was self conscious the remainder of the day.  However, I feel so free now without the hat and feel more control over my life and body than I've felt in months.  Good luck.",
      "MessageIndex": 4145,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 1, 2010 02:43PM suzwes wrote: I've had hair dreams too.  I dream I have the most beautiful hair and it feels so silky - the dreams are so real.  Then I wake up to the yukky 3 month PFC hair.  I thought the dreams were crazy and am so glad to find I'm not alone in having these dreams.",
      "MessageIndex": 4160,
      "PostDate": "01/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 6, 2010 03:48PM suzwes wrote: LOL, that would be funny to see, so many not matching their passport picture!",
      "MessageIndex": 4222,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Feb 4, 2010 12:56PM suzwes wrote: Navy - My leg hair came back first and hair seemed to appear from the bottom up!  Although my head hair started back right after chemo.  I think when I shaved my legs, that hair was longer than my head hair!  I know a few weeks ago I was wondering if I'd have trouble traveling to Mexico cause I didn't look like my passport.  Like you, I had absolutely no trouble.  We flew from Detroit to Cancun.  The security guard in Detroit, a wonderful elderly man talked to me for a minute and told me good luck.  In Mexico and then back in Detroit everyone was very respectful and kind.  No one questioned my long hair in the passport and my 2 inch hair going through security.  I'm so glad everyone was so kind when I traveled. Also, I've been using a Biotin shampoo for about a month and my hair is much thicker than it was - I can't say for sure it's the shampoo but it sure hasn't hurt anything! Suzette",
      "MessageIndex": 4452,
      "PostDate": "04/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 16, 2009 10:36AM suzwes wrote: Thanks for the pictures Lori.  My last chemo was almost a year to the day after yours so I appreciate the preview of what my hair may be over the next few months.  Your pictures are very helpful and I love your hair.  My hair now looks very much like yours did last December.  I'm thankful my hair is coming in but kind of upset with all of the gray in it given that I had very few gray hairs before my chemo.  Kind of selfish and vain of me given that I have my life and at least the hair is growing back! I love chelev's and Judy's hair and everyone elses who has shared pictures.  Thanks for the encouragement. Thanks to all who've posted on this topic, it's been very helpful. Warm regards, Suzette",
      "MessageIndex": 4084,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 28, 2009 08:36PM suzwes wrote: Hi Jenn3, I must admit I do want to punch the \"well meaning\" people sometimes - like we can't see the gray hair every time we look in the mirror!  Anyway, it was about 8 weeks after my last chemo treatment that I went without a head cover in public.  The top still looks weird to me but it is starting to fill in now.  I still look \"sick\" cause my hair is so short but it feels so much better without a head cover.  I'll try to get my daughter to take a picture in the next couple of days and post it.",
      "MessageIndex": 4130,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 11, 2010 11:05AM suzwes wrote: The hair on my head is slow but steady but like Jane, the hair on the legs is growing super fast.  I think the hair on my legs is longer than the hair on my head!",
      "MessageIndex": 4266,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 17, 2010 03:22PM suzwes wrote: Yes congratulations to all who've gone topless.  I'm very fortunate that my hair has been growing nicely (last chemo 9/23/09).  I used a root touch up color and my hair looks thicker.  I've also been using a biotin shampoo for a couple of weeks and my hair actually feels thicker.  I look like I have a pixie cut. I'm not taking a note from my onc when I go to Cancun this week (i don't look like my passport) but I have so many drugs I'm taking I figure they'll believe me if there's any question about my photo. Have a great week everyone.  You're all in my thoughts and prayers. Suzette",
      "MessageIndex": 4304,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 17, 2009 09:41AM suzwes wrote: Lori and Judy, thanks for the encouragement.  I think I'll have mine colored or highlighted at least.  I'm almost 12 weeks post chemo - any suggestions on when I should have it colored?  My hubby and I are taking a trip to Cancun in mid January and I'd really like it colored before we go.  Thanks so much - Suzette",
      "MessageIndex": 4095,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 18, 2009 10:10AM suzwes wrote: Thanks for the advice Judy and Lori. Keep the posts coming everyone, I love reading them - they give me hope that my hair will eventually be longer again (even though the logic side of my brain knows it will grow - the other side of the brain worries a lot that it won't grow!).  Happy holidays to everyone. Suzette",
      "MessageIndex": 4101,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 4, 2010 02:05PM suzwes wrote: Lovetosail - my DIL buzzed my hair for me and started with a 3 (my hair was long and we were both nervous) but she ended up, after buzzing my hair two times that day, using a 1\" and I was very happy with that length.  It made it easier to clean up my pillow (I slept with a towel on my pillow everynight to catch the little hairs) and made it easier on the shower drain.",
      "MessageIndex": 4199,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jan 6, 2010 03:28PM suzwes wrote: It's going to be interesting to see reactions when I go to Cancun in a couple of weeks and give them my passport and/or driver's license.  Long hair in both pictures - hope they don't give me too much trouble in light of the Christmas scare (I'm leaving from Detroit too!!).",
      "MessageIndex": 4220,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Feb 4, 2010 11:22AM suzwes wrote: I found these answers to your question on this website at this link http://www.breastcancer.org/treatment/surgery/reconstruction/ask_expert/2005_04/question_30.jsp Personally, I did the temporary rinse color when I was 3 1/2 months post chemo.  My hair was probably about 1 1/2 inches at the time.  The color came out pretty fast so I did it again about three weeks later and this time it has stayed a bit better (It's been three weeks since I colored it last time).  It didn't irritate my scalp and my hair came out a very nice color.",
      "MessageIndex": 4449,
      "PostDate": "04/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "May 4, 2011 06:04AM suzwes wrote: Hi Debrox, I lost weight during chemo but have gained it back.  Like Deanna stated, once I resumed normal activities and eating habits the weight stabilized. ",
      "MessageIndex": 2,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768494",
      "Title": "Weight Gain or Loss During Chemo DebRox jancie"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 28, 2009 08:20PM suzwes wrote:",
      "MessageIndex": 280,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 29, 2009 11:27AM suzwes wrote: Lilah, My understanding (from a nurse perspective - not a pathologist's perspective) is that my sentinal nodes were reviewed by a pathologist while I was under anesthetic for my mastectomy and it didn't show cancer at that time.  Then there are further tests done on the nodes that require further teasting and a longer period of time to produce results.   That's when they found a small amount of cancer in one of the sentinal nodes.  I can't tell you not to worry (especially because I'm the queen of worriers) but they probably did the appropriate tests on your nodes when they removed them.  I knew within a week after my surgery that the node was positive.  Hope this helped a little. Thanks for the success story Happy Trisha.  I've heard such negative things from others on AIs so it is nice to hear someone who's been on them for five years actually wanting to stay on them.",
      "MessageIndex": 286,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Feb 25, 2010 12:24PM suzwes wrote: Thanks for sharing your fifteen minutes of fame!!  Very interesting story.  I'm at work so can't go buy the paper but found the article and your picture online.  Hope you don't mind, I'll share the online link below:  http://www.usatoday.com/news/health/2010-02-25-1Agenetictesting25_CV_N.htm",
      "MessageIndex": 526,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jul 12, 2010 08:26AM suzwes wrote: Good Luck Rita and I'll be waiting to hear how it goes.  I agree with it being scary to be on the patient side and actually spoke to medical students regarding that issue.  I am a nurse, I know about certain medical conditions and I do patient education HOWEVER, this is a scary disease and process and we're all individual and as the patient I want all of the information one can give me.",
      "MessageIndex": 346,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Dec 2, 2010 06:10PM suzwes wrote: Hi Alison, Sex after BC for me was also very painful (although I was fortunate not to have the complications you had).  My Onc nurse gave me replens and that worked very well.  I used it before sex and, for me it wasn't messy.  I was fortunate that I only needed the replens about 3 or 4 times and I've been good to go since then (used it in the spring and haven't needed it since).  It hasn't helped the libido but at least it is tons more comfortable for both my hubby and I.",
      "MessageIndex": 1,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/761444",
      "Title": "Sex After BC??? pixelpup lago"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Mar 23, 2011 05:42PM suzwes wrote: Yan, I am so sorry for your loss. My heart goes out to you and the boys during this difficult time.",
      "MessageIndex": 33,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766537",
      "Title": "Olga Simkin Z\"L leprechaun Bestbird"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jul 9, 2010 09:40AM suzwes wrote: Good Morning my fellow nurse sisters! I have been so fortunate in my career and am currently a QI nurse in the College of Human Medicine at Michigan State University.  I've done different nursing from premies to home care and have done my fair share of public health nursing at the local and state level.  I've been in QI for over 15 years.  I've had a good experience with my colleagues who allowed me to work around my MX, Chemo and Radiation and keep my full time job and benefits.  It was hard at times but it was worth coming to work for the support of fellow nurses and friends.  My family was terrific but there's nothing like friends to help get through this (along with my friends on this board).  I am very saddened that some nurses and other women are treated poorly by coworkers and employers but most of all that nurses are treated poorly by other nurses or health care personnel when they are going through this horrid time in their lives.  Thanks for activating this thread again.",
      "MessageIndex": 327,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Aug 23, 2010 09:36AM suzwes wrote: Dear Sas, You and your family are in my thoughts and prayers.  May eternal rest be granted unto Greg, and let perpetual light shine upon him. I am glad to hear that your experience with the Hospice nurses and the Hospice team was positive.",
      "MessageIndex": 414,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jul 11, 2010 10:33AM suzwes wrote: I went to Madonna University (in Livonia, MI) and am now in grad school for nursing education at Michigan State University (hoping I stay healthy enough to finish - I'm only half way through).",
      "MessageIndex": 332,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "suzwes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/89738/profile",
      "Content": "Jul 13, 2010 11:16AM suzwes wrote: Oh Karla, so happy for you.  Congratulations.",
      "MessageIndex": 350,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    }
  ]
}