{
  "AuthorID": "suzyb",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66134/profile",
  "Posts": [{
    "AuthorID": "suzyb",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66134/profile",
    "Content": "suzyb wrote: Hi there, I am a new member and live in Australia.  I am 58 years old and have three children.  I have no man in my life to go through this with me.  I was diagnosed in March.  My first reaction was denial, and then when it hit I just went to pieces.  I attended for my usual mammogram and found a missed call on my cell phone a couple of weeks later asking for me to phone.  It was the Breastscreen Clinic.  They asked me to return as there was something on my mammogram that wasnt there the last time.  I went back and had an ultrasound, fine needle biopsy and a punch biopsy.  They called me through and said that they felt, from the results that I had a malignant tumour.  I was absolutely beside myself.  I went to pieces.  Luckily my sister had flown up from where she lives to attend for the results and my kids were there.  Everybody was in disbelief when it was found that I had three tumours, in their early stages, but still three of them.  I had to wait the weekend to get the final pathology results and then I had to make an appointment with the breast surgeon.  I just wanted them \"out\" of my body and gone.   I went into hospital and had a lumpectomy.  Over here there is a test called a sentinel node biopsy, and I am sure you have it there.  It tells the surgeon what lymph nodes may have the cancer.  This prevents the whole of the axillary glands having to be taken out.  I had two layers of glands taken on a second operation the following week and out of 18 nodes present only 1 had cancer.   He said that was good news.  I cant see how anything with cancer in it is good news.  Prior to both operations I broke down in front of my family as I was just terrified at what they may find.  The surgeon told me that there is no blood test in the world that can tell you whether or not any cancer has leaked into your body and he told me that I would have to have chemotherapy and radiotherapy. I donated some breast tissue at operation to research. I will be undergoing chemotherapy very soon and am not looking forward to it.  I know I want to live and thats why I will do anything the doctors tell me in order to see my grandchildren grow up. There is a great support mechanism over here with breast nurses, psychologists to get you through the mental anguish, breast surgeon, medical oncologist and radiation oncologist. I can only fight and look forward to the future, whatever it may hold.  I am taking one day at a time and am determine to live for a long time.  If you are at the same stage as me just remember \"don't sweat the small stuff\".  Fight for your life and you will be rewarded. My heart goes out to anyone who is going through this and although I have my down days, I am trying to stay strong.  I have been told by my medical team I can cry whenever I want to.  Dont be afraid to ask for help and support. God Bless you all Sue B Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "26/04/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704601",
    "Title": "Starting my journey suzyb suemed8749"
  }]
}