{
  "AuthorID": "SuzyBlue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153020/profile",
  "Posts": [
    {
      "AuthorID": "SuzyBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153020/profile",
      "Content": "Aug 31, 2015 04:23PM SuzyBlue wrote: Hi dtad, sorry to hear from a fellow sufferer, but glad you found us! May I ask if you have a name for your disease? I've had my chronic pain for 17+ years now but I'm not entirely convinced on what it has been suggested it is. Oh well, no cure anyway so it's pain management and learning to live with it. It seems cruel to add cancer into the mix, but maybe we are already made of tougher stuff because of our prior experiences",
      "MessageIndex": 597,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "SuzyBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153020/profile",
      "Content": "Jul 26, 2012 01:03AM SuzyBlue wrote: Hi everyone, I just found this thread and found it interesting. I don't have the conditions that you speak of but I have a chronic pain condition that affects all my joints and my spine. It started 15 years ago when I was pregnant with my fourth, just in my fingers and now is everywhere. Of course I have been unable to be 'labelled' with a particular syndrome. For a number of years I was told it was probably a form of rheumatoid arthritis but a couple of years ago after moving to Auckland, I was told after attending a pain clinic that it was to do with the pain pathways opening up through my body and not closing again. Either way, not curable and I will just have to live with it for the rest of my life (and wonder how much worse it will get). I am on fairly high doses of medication for it and administer extra doses of pain relief myself (prescribed by my dr) according to how I think the day is going, sometimes when my hips or neck are bad I need to up the codeine other days I have very little. Alongside the pain is chronic sleep problems for which I was taking natural remedies (with limited success) but since being diagnosed last Christmas and having 3 surgeries I have been taking sleeping tablets. I have recently taken myself off them and struggling to deal with the resulting sleeplessness. Anyway, I went to my chemist (pharmacy) last week to pick up a renewal of my medications - admittedly there were quite a few boxes as i had run out of everything - and the woman behind the counter started lecturing me about the dangers of being on codeine and pain meds etc! I was quite taken aback and just said that my doctor was still happy with the levels I am taking. I went away thinking, she doesn't know me, she has know idea what I have been through in the last 7 months let alone the last 15 years! Am I wrong to be annoyed at feeling accosted that way?",
      "MessageIndex": 590,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "SuzyBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/153020/profile",
      "Content": "Jul 28, 2012 06:20AM SuzyBlue wrote: Thank you for your thoughts. I looked up fibromyalgia and it does appear that I have some of the characteristics, but my pain is definitely in my joints rather than muscular, still I will put it to my GP next time I see her. I am taking gabapentin already for pain relief which is one of the medications used for fibromyalgia so maybe she has the same suspicion. It has been 15 years so it would be a relief to finally know. I realise that pharmacists do have expertise in medications and their effects but still unless you know the whole story of someone's medical condition I don't think they have a right to criticise, especially in front of other customers in the shop.",
      "MessageIndex": 593,
      "PostDate": "28/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    }
  ]
}