{
  "AuthorID": "SweetHope",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
  "Posts": [
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "SweetHope wrote: I have had 3 out of 4 DD AC infusions. Shortness of breath at inappropriate times warranted a follow up Echocardiogram. Results show a lowered EF% and Diastolic Dysfunction. From what I have read the Diastolic Dysfunction (which means that the heart does not totally relax between beats so it does not completely refill) is related to the Adriamycin. Chemo is now on hold until I visit a Cardiologist tomorrow. I am assuming more tests will be ordered and it may be a while until I get a new treatment plan. I am very anxious about starting Taxol. Radiation now seems heart-threatening since cancer was 9 o'clock on left breast. Both of those treatments can further stiffen the heart muscle. DH and I are discussing a BMX....UGH! I would greatly appreciate hearing from those who have faced this dilemma. Please! Age 65 at dx. Oncotype dx score: 18. Clinical trial: SWOG S1007 A Phase III. Dx 11/12/2014, DCIS Dx 11/12/2014, IDC, 1cm, Stage IIA, Grade 2, 1/29 nodes, ER+/PR+, HER2- Surgery 11/12/2014 Lumpectomy: Left; Lymph node removal: Left, Sentinel, Underarm/Axillary Surgery 11/24/2014 Lumpectomy: Left Chemotherapy 1/20/2015 AC + T (Taxol) Radiation Therapy 5/20/2015 Whole-breast: Breast, Lymph nodes, Chest wall Hormonal Therapy Arimidex (anastrozole), Femara (letrozole) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829321",
      "Title": "Diastolic Disfunction...Damn! SweetHope leftfootforward"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Dec 18, 2014 05:33AM SweetHope wrote: Scanxiety...oh yes! I have my first PET scan tomorrow. I don't know what to expect or how long before results. I should have googled this, but I mostly use Dr. Google searching for reasons for my 2 cm lung nodule to be benign. Any words of advise or info would be so appreciated. You all are appreciated anyway for sharing your thoughts and experiences. Hoping I don't light up tomorrow...please let me just be dull.",
      "MessageIndex": 16,
      "PostDate": "18/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/826989",
      "Title": "Scanxiety Hopeful82014 Hopeful82014"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Dec 23, 2014 09:52AM SweetHope wrote: It took so long to get back to ya'll. I had forgotten where I had posted. Great news, the PET scan showed no mets to my lung. WHEW! I cried, DH cried, kids cried...as you can imagine. It took about 24 hours to really sink in and relax. It seems to be encapsulated pneumonia. (I had pneumonia last April.) Now I can proceed to chemo, rads, and hormone therapy smiling all the way. The outlook sure is brighter. Now I am saying extra prayers for our sisters with mets. Just the suspicion of metastasis is terrifying. Confirmation must be Hell. ",
      "MessageIndex": 20,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/826989",
      "Title": "Scanxiety Hopeful82014 Hopeful82014"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "May 29, 2015 08:00PM SweetHope wrote: Maria, this news is devastating. But your boyfriend and family are there to hold and comfort you. And we are here sending you our best hugs.",
      "MessageIndex": 26,
      "PostDate": "29/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/829847",
      "Title": "Had VLNT or LVA? Please share here or message me! Nordy MRock"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jun 7, 2015 08:52PM SweetHope wrote: Mariasnow, that's great news!",
      "MessageIndex": 41,
      "PostDate": "07/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/829847",
      "Title": "Had VLNT or LVA? Please share here or message me! Nordy MRock"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "May 31, 2015 05:36PM SweetHope wrote: I don't understand why our metabolisms slow down; especially for you since you are so proactive on working off some excess weight. It must be so frustrating. But please don't think about the weight gain right now. I am stressed and depressed about the 30 pounds I have added since dx. (But I have been very sedentary and spent the first month inside a Cheetos bag.). But everyone tells me not to worry over that right now...Just get thru dx and get the strength back. So I am passing that on to you...please don't distress over this. Just be proud of all you do for yourself and hopefully, the rewards will soon follow.",
      "MessageIndex": 34,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/829847",
      "Title": "Had VLNT or LVA? Please share here or message me! Nordy MRock"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Mar 17, 2015 06:18AM SweetHope wrote: Sunilmishra, Your mother's Final Report showing no positive nodes and clear margins is very good news. It is good that you have gone to the appointments with her. She needs a \"second pair of ears\" to absorb all the information the doctors give during an office visit. Please make a list of any questions she (or you) have for each future appointment. This is a stressful time but once the treatment plan is in place you both will feel more in control. I cannot tell you what is the next right step. We are each so unique and our breast cancers are so varied. Our Oncologists follow a standard of care that is the best medicine available today for each type of cancer. Your mother will make the right decision. And I hope you will keep us informed on her progress on this challenging journey.",
      "MessageIndex": 2,
      "PostDate": "17/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829593",
      "Title": "IDC in left breast sunilmishra sunilmishra"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Apr 12, 2015 06:59AM SweetHope wrote: My resection was much easier than the first lumpectomy. It only elongated the original scar just a minute bit. No SND or drains the second time, yeah! I was home by the afternoon. I don't have an issue with anesthesia, so it was a very uneventful surgery. Wishing you the same...an uneventful surgery with clear margins.",
      "MessageIndex": 3,
      "PostDate": "12/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/830343",
      "Title": "Resecton After Lumpectomy flutterbykisses ruthbru"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 10, 2015 10:33AM SweetHope wrote: One more thing. Constipation (here is is referred to as the Big C) is a horrible side effect from nausea and some pain meds. Keep Mom supplied with stool softeners, senna tea, Sennokot S, prune juice, etc.",
      "MessageIndex": 2,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828346",
      "Title": "My mother diagnosed with breast cancer leaf999 SweetHope"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jun 22, 2015 12:19PM SweetHope wrote: OMG! I can't believe you don't need a pain pill. Gentle hugs.",
      "MessageIndex": 15,
      "PostDate": "22/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832762",
      "Title": "Burn...scalding tea Jenwith4kids sas-schatzi"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 17, 2015 11:08AM SweetHope wrote: Dear Sandra, your surgery is less than a month old. How are you healing? Please contact cleaningforareason.org \"Fighting cancer is difficult enough, but living with it is even tougher and that's where Cleaning For A Reason steps in. As a nonprofit serving the entire United States and Canada, we partner with maid services to offer professional house cleanings to help women undergoing treatment for cancer, any type of cancer. To date, we have provided more than 17,000 cleanings for women with cancer with a value of more than $4.5 million in donated cleanings, and partnered with over 1,100 maid services.\" Gentle hugs and strong, positive thoughts for you and Mike and your family. Becky.",
      "MessageIndex": 441,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jul 9, 2015 10:22AM SweetHope wrote: Wow! That looks so much better. Hope what a difference two weeks makes",
      "MessageIndex": 27,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832762",
      "Title": "Burn...scalding tea Jenwith4kids sas-schatzi"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 2, 2015 07:55AM SweetHope wrote: I want to resurrect this thread as I have found a lot of valuable information here. Hope you all will update us newbies and not-so-newbies on your progress.",
      "MessageIndex": 2204,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jun 21, 2015 10:30PM SweetHope wrote: Try a cold fruit smoothie. Also protein is so important for her right now. Congratulations on finishing Chemo! That is quite an accomplishment.",
      "MessageIndex": 4,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828346",
      "Title": "My mother diagnosed with breast cancer leaf999 SweetHope"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 29, 2015 02:12PM SweetHope wrote: Cloesmom, you must be reeling. What was your score? I'm sorry to add you to the growing list of Chemo Warriors, but it actually is not as bad as we think it will be. Devastating news, yes, but totally doable. I was putting on a confident face, but so scared inside that even during the first week of chemo I was questioning myself on continuing the program. (And I only had some rib and skin pain which I mostly slept through.). By the second week I was more myself and realized it was mostly fear and I will try to push away those frightening thoughts at next weeks Chemo. Worse side effects may be in the future. But I'll put up with side effects if I can keep cancer away. Please join us at the \"Bad Cancer Patient, Observations from the Chemo Chair\". And the \"Starting Chemo January, 2015\" thread shows our progression from traumatized at the thought of chemo, through side effects, then great satisfaction in realizing just how strong we are. Jump right in with questions or comments. Everyone there knows exactly what you are going through. You are not alone.",
      "MessageIndex": 471,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 10, 2015 09:30AM SweetHope wrote: Sid, I am 65, Stage 2b and just finished my second round of chemo. A trip to the hospital for low WBC count is not unusual, but is worrisome. It may be a one time only event; let's hope so. I receive a Neulasta shot the day after each infusion to help build back WBC. It causes bone pain and I take Claritin for that side effect. Mostly, I have slept through Days 3 to 6 and have avoided taking any pain meds. I am sure your Mom is on something similar or the same. As far as food, keep Mom well stocked with cold, small snacks...pudding, mandarin oranges, frozen grapes, and Jello. She can eat whatever she wants. (The nausea meds are great as long as she takes them on a timely basis; ahead of any queasiness.) Just make sure if it is fresh fruit - peel it! Wash any vegetables. My personal opinion is that during Chemo is not the time for lifestyle changes. I will diet and get back to a more rigorous exercise program when I feel like it. Right now, I am listening to my body and pampering it with my favorite foods. I take walks to clear my thoughts when I have the energy. Please have her read the different forums here at BCO. \"Chemotherapy, Before, During, and After\". \"Starting Chemo January 2015\". \"Older People with BC\". She will soon be making friends with people from all over the world that are experiencing the same challenges that she is. You will also learn a lot about what she is going through but may not openly express. Stay supportive but remember these are her decisions about her body. FYI, my mother was in her late 80's when she had a \"radical\" mastectomy. She did great with no complications. Keep us posted.",
      "MessageIndex": 1,
      "PostDate": "10/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828346",
      "Title": "My mother diagnosed with breast cancer leaf999 SweetHope"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 2, 2015 08:06AM SweetHope wrote: Becca, what was your chemo?",
      "MessageIndex": 2,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/828088",
      "Title": "My Chemo Experience - Hoping It Will Help You Becca9800 april25"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 10, 2015 09:54PM SweetHope wrote: Hopefulmomof3, my DDIL sent me this link. I'm sure DH and your dear kids are doing a great job helping, but who couldn't use this? Cleaningforareason.org \"Fighting cancer is difficult enough, but living with it is even tougher and that's where Cleaning For A Reason steps in. As a nonprofit serving the entire United States and Canada, we partner with maid services to offer professional house cleanings to help women undergoing treatment for cancer, any type of cancer. To date, we have provided more than 17,000 cleanings for women with cancer with a value of more than $4.5 million in donated cleanings, and partnered with over 1,100 maid services.\"",
      "MessageIndex": 408,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 17, 2015 07:21PM SweetHope wrote: Ah, Ireland! My ancestral home. Good prognosis, you live in the one foreign country I must see. My brother did a lot of genealogy studies of our family. We are descended from the Earl of Mar who lived in the original Balmoral Castle. Unfortunately, he backed the wrong man for King, so he had to flee the country. So, not only am I unlucky with BC, but also unlucky with dumb relatives! Please, please, please send some pictures of your island. Even at -4 Celsius, I bet it is b-e-a-u-t-I-f-u-l.",
      "MessageIndex": 447,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 18, 2015 11:48AM SweetHope wrote: Sandra, I hope you love your concrete floor! Seriously! Thanks to Katrina, I have a lot of experience with bare floors and I wish I had just sealed them and been done with it. I love the look...very Scandinavian. Add a well worn recliner or two and you have an eclectic, modern decor! And, trying to work around a lot of \"things\" made me realize that I didn't own them, they owned me. The trailer I lived in during those times was so stress-free because it was so uncluttered and there was a \"place for everything and everything in its place\". (Gheez, I'm full of cliche sayings this morning.). Boxing up a lifetime of memorabilia can be emotional. Let your DD's friends do that. Once out of sight, out of mind (Gheez! Again!). And I bet you collected some lovely things in Europe. They will have double meaning when you get to unwrap them again in a couple of months. I am very disappointed that the cleaning service can't help. They advertise \"any kind of cancer\" qualifies, so I thought they would consider Mike's dx. Oh we'll, your lovely daughter and friends will be more fun. (Even better if you had some of your great-grandpa's whiskey.) Take special care and please don't overdo it.",
      "MessageIndex": 449,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Jan 19, 2015 10:50PM SweetHope wrote: Goodprognosis, thank you so much for the picture. That is exactly what I expect Ireland to look like: serene and green. It is so beautiful. I just got home from port placement surgery. So having this lovely photo sent especially to me all the way from Ireland gives me the warm and fuzzies! My father use to say that I would argue with a Stop Sign, so I'm definitely Irish. I hope we are related! ",
      "MessageIndex": 460,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/826070",
      "Title": "December 2014 Surgery Sisters knmtwins Scottiemom11"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Apr 9, 2015 08:16AM SweetHope wrote: Love the \"No Hair Day\" ball cap! Infusion center provided ice chips and toasty warm blankets. My big issue with AC was not the chemo, but the bone pain from the Neulasta shot. I finally realized that Claritin was not working for me and I switched to Zyrtec. Big improvement! As comforting as a snugly puppy is, I was told to not let my dogs sleep with me; and don't let them lick me. So many rules.",
      "MessageIndex": 47,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/830231",
      "Title": "Chemo scares me more than the disease AnewBeginning lcm123"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 9, 2015 06:01AM SweetHope wrote: Wonderful news! Now go enjoy your happy, healthy life! Xoxo",
      "MessageIndex": 16,
      "PostDate": "09/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/828164",
      "Title": "Biopsy tomorrow! BodhisattvaNH Trvler"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Apr 7, 2015 09:47AM SweetHope wrote: AJ, I am 65, and halfway through DD AC+T. My side effects have been minimal, so far, and as Meow13 said, the MO's load you up with meds (which work great). I chose that chemo regime because I wanted the best available drugs to give myself peace of mind in my later years. After AC#3, I was sure I had heart damage (short of breath while doing nothing). MUGA showed my heart was fine, and I proceeded with chemo. Maybe it was just chemo fatigue, maybe it was fear setting in, but once I was tested, the symptoms stopped. The decision is your, of course. But reading your dx I see this is your second cancer in four years, and you have four positive nodes. I highly suggest you go with the plan your MO has laid out for you. You are only 68 and have many good years ahead...so why not fight hard for those extra and very special years. I am so sorry to read of the loss of your DH. Cancer is cruel and unexplainable. I am sure his death weighs heavy on your decision. Some get the easy way out within months, some suffer the cruelty that cancer can bring for years. I have seen both and hope I get hit by a bus rather than suffer the years of pain I have seen others go through. Please do chemo, it is doable. Ladies our age are experienced fighters and quite frankly, we don't have the extra burden of young children to raise or demanding jobs, or premenopausal hormones to deal with. And we have Medicare! Join the Starting Chemo in April group. The support you will find there will help you tremendously with a place to rant, cry and share without judgment. These ladies and a few good men, will be there for you 24/7 with broad shoulders, many good tips, and they will also reach out for your support when their going gets rough. Whatever you decide, be at peace with it and know that you are choosing what you are most comfortable with. We are here to share and comfort you through whatever path you take on this journey.",
      "MessageIndex": 9,
      "PostDate": "07/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/830231",
      "Title": "Chemo scares me more than the disease AnewBeginning lcm123"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 13, 2015 02:44PM SweetHope wrote: My sister has jotted a daily note on those yearly calendars with the inch square day boxes. And she has kept them for years. Her DH was struggling through a very aggressive cancer when a scan showed a problem on his kidney and the MO wanted to delay treatment until the kidney issue was fully investigated and resolved. She knew that DH had been seen years earlier by a urologist who found the cyst initially and concluded correctly that it was only a fatty deposit. So Sis went through her calendars, found the Dr., date, and place and was able to resolve the issue quickly. It saved her DH from more testing and unnecessary delays. Which shows that keeping records may save you years from now.",
      "MessageIndex": 16,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/828381",
      "Title": "Stage change after 5 months Butterfly53 Kayrem"
    },
    {
      "AuthorID": "SweetHope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/209006/profile",
      "Content": "Feb 21, 2015 03:26PM SweetHope wrote: zjrosenthal, Great news. I bet you are relieved to have that behind you. Now if they could just give you your path report immediately, I'm sure you'd be doubly relieved. I put a sterile gauze pad under my drain tube and secured the whole thing with lightly stick bandaid. When showering the drain can be hung from your neck by a strip of pantyhose. My DH made up a spreadsheet so I could record the cc's collected...so sweet but so unnecessary. Did you see the great report yesterday about how very successful your cocktail of Herceptin, perjeta, and taxol has been? So not only do you have a very talented surgeon, your Onc is a winner as well. May all your path reports be clean, Becky  ",
      "MessageIndex": 74,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816528",
      "Title": "Axillary Lymph Node Dissection annabananas Batesburg"
    }
  ]
}