{
  "AuthorID": "sweetjam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
  "Posts": [
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Feb 24, 2014 04:57PM sweetjam wrote: Franny.  I would get some Hibiclense from the drug store.  Wash your whole body several days before surgery concentrating on your breast, underarm and arms they will be putting iv's in.  There is some very good documentation out there with Hibiclens preventing surgical site infections.  Also make sure the surgeon and staff wear powder free gloves.  That will also give you the best results.  Good luck to you.",
      "MessageIndex": 42,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/815593",
      "Title": "Thought I'd be one of the 80% FrannyM424 sweetjam"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Mar 4, 2014 09:33AM sweetjam wrote: 1. Did you find your lump on your own or did a mammogram pick it up? I had a baseline mammogram at 35.  I had 15 clean mammograms including in March of 2013.  Discovered mine in the shower.  Even marked it is undetectable on the mammogram.  2. Please describe to me what exactly your lump felt like to you or your doctor. Felt like a small, hard marble.  I think that is how the primary care doc knew it wasn't a cyst. 3. Is there a family history? Aunt on mother's side diagnosed at 68 lived to 94, cousin on mothers side diagnosed at 41 and dead at 48. They thought strongly I would test + for BRCA because my father died at 64 of esophageal cancer and his mother in her 60's of ovarian cancer.  I came up negative.",
      "MessageIndex": 57,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/695857",
      "Title": "WHAT did YOUR lump FEEL like? gscott MomOfTeenGirl01"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "May 12, 2014 12:55PM sweetjam wrote: no symptoms at all. In fact I had had 15 years of clean mammos.  I have dense breast and marked this tumor can not be seen.  Found less then a year after a clean mammo and annual poke and grope.  That was why I waited until after the holidays.  Ate organic no processed food for years, slim snd worked out regularly.  It hit me like a ton of bricks.   Through 5/6 chemos right now.  Wouldn't wish chemo and the side effects on my worse enemy.  Surgery scheduled and hoping for no node involvement.  So ready for this whole thing to be over.   ",
      "MessageIndex": 41,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819541",
      "Title": "Did you have any symptoms prior to being diagnosed? Footballnut Footballnut"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Jun 4, 2015 10:27AM sweetjam wrote: I was stage 1 grade 2 but biopsy was triple neg. I had 6 chemo treatments prior to surgery. I also had nipple and skin saving. I had no node evolvement either. My post surgical biopsy was hormone positive so. They think I actually had 4/5 markers. If your oncotype score is low you might not need chemo. I have a friend whose score was a 2 so no chemo for her but another who as in the middle and she had chemo. God luck! The whole business stinks",
      "MessageIndex": 11,
      "PostDate": "04/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/832298",
      "Title": "Stage 1 clear nodes no radiation or chemo? Taramay hummingbirdlover"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Feb 3, 2014 12:50PM sweetjam wrote: Got the labs back and I'm triple negative *sigh*  They had to send the samples to Rochester because I cam back a 2 and they weren't sure.",
      "MessageIndex": 12,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817294",
      "Title": "This Sucks! sweetjam vbishop"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Feb 3, 2014 12:51PM sweetjam wrote: That would be great.  Thanks for reaching out to me smillsbc.",
      "MessageIndex": 13,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817294",
      "Title": "This Sucks! sweetjam vbishop"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "Feb 3, 2014 01:03PM sweetjam wrote: Going for a second appointment with the oncologist tomorrow.  My cancer is TNBC, 1.4cm, stage 1 grade 2.  No clue what he is going to recommend for treatment because at the last appointment he spent most of his time talking about Herp? (yes dumb to have the appointment when the labs aren't back)  I am a candidate for immediate reconstruction and the surgeon does the skin saving and nipple saving technique.  The surgery will be long 4-6 hours but I think it will be worth it to be done with this whole thing.  The oncologist did put me in touch with a naturopathic doc which I'm happy about.  I'm looking into alternative therapies such as acupuncture and I have already started reiki. I have decided against a port after doing a lot of research for many different reasons. The next big decision will be if I will move forward with the chemo or not.  Mayo routinely does the therapy before and after surgery.     It has been a whirl wind of internet searching and compiling questions for my visit with the oncologist tomorrow.  I have been busy with work too which is a great distraction for me.  I told my husband yesterday that I have done everything to lower my risk and this thing still got me.  I guess it is an equal opportunity disease.  ",
      "MessageIndex": 14,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817294",
      "Title": "This Sucks! sweetjam vbishop"
    },
    {
      "AuthorID": "sweetjam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/195341/profile",
      "Content": "sweetjam wrote: I was just diagnosed a week ago.  Have met once with the surgical oncologist.  Waiting to see whether HER is positive or negative (no good options there)  I was convinced I had e+ or p+ had my mind set on bmx with no further treatment.  I'm super healthy, eat all organic no processed foods, no hydrogenated oil and no high fructose corn syrup.  I am active and exercise regularly.   I can not wrap my brain around putting ANY toxins in my body.  Meeting with the oncologist on Tuesday and getting testing for BRCA.  Still sticking to bmx with immediate reconstruction so I'm one and done.  Don't EVER want to go through this again and I just don't really care about my boobs- they are real but not spectacular.  I feel like I have no options and no control over what is happening.  My biggest concern is long term side effects from chemo or chemo resistance (which I read was 1 in 5).  Surgical Doc wants me to do chemo before surgery but I also can't figure out how suppressing the immune system is good for preventing surgical site infection or the healing cascade- it seems the opposite of every thing I know about surgery.  I want to be at my peak both mentally and physically before going under the knife. She is saying make the tumor small but it already is small and below what they normally see.  Any one have any thoughts or questions I should ask oncologist?  I don't even feel like I know what questions to ask because I just don't know enough about it. Dx 1/17/2014, IDC, Right, 1cm, Stage IA, Grade 2, 0/3 nodes, ER+/PR+, HER2- (FISH) Chemotherapy 2/10/2014 Carboplatin (Paraplatin), Taxol (paclitaxel) Surgery 6/23/2014 Mastectomy: Right; Prophylactic mastectomy: Left; Reconstruction (left); Reconstruction (right) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/817294",
      "Title": "This Sucks! sweetjam vbishop"
    }
  ]
}