{
  "AuthorID": "SweetMaggie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200156/profile",
  "Posts": [
    {
      "AuthorID": "SweetMaggie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200156/profile",
      "Content": "SweetMaggie wrote: I very much appreciate this forum and the support from everyone.  I posted originally under another topic while I've been going through the diagnostic part of this journey but have finally been diagnosed (although not staged.)  I have at least 3 tumors in one quadrant for an area of about 3 cm.  So far the results have been negative for ER and PR and it looks to be aggressive, which makes me feel even more depressed.  I will meet with my surgeon and radiation oncologist (I think that's a standard practice in case lumpectomy is considered) this Friday to map out a treatment plan.  I don't really understand when we test the lymphnodes but assume that will part of the consult.  I hadn't read much about radiation or chemotherapy and just started some reading today - whew, it seems so overwhelming, scary, and never ending.  I'm definitely worried about telling and dealing with everyone where I work, I have a very publicly and visible, fast paced job. Funny, I just thought to myself that that part isn't really important. Thanks to everyone for all the good thoughts and hugs.  I guess I'm moving from TripAdvisor to BreastCancer.org for the foreseeable future.  I hope to one day be able to provide positive encouragement to others here, it really helps! Remember you are not in a cave, but in a tunnel, and you will come out at the other end! Dx 4/2014, IDC, 3cm, Stage IIA, Grade 3, 0/2 nodes, ER-/PR-, HER2- Surgery 6/4/2014 Mastectomy: Left; Reconstruction (left): Tissue expander placement Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821224",
      "Title": "Recently Diagnosed, Not Feeling Very Strong SweetMaggie Nimm"
    },
    {
      "AuthorID": "SweetMaggie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200156/profile",
      "Content": "May 19, 2014 01:32PM SweetMaggie wrote: It really is so helpful to be able to come here and talk to other women who have been in the same shoes.  I know I'm not supposed to feel bad for others, but my poor husband is so supportive, and I really don't want to totally overwhelm him everyday, but he is my lifeline right now.  I know he just feels so badly that he can't seem to comfort me. I just got an email from a friend I haven't seen in a while who went through her cancer journey several years ago (some kind of lymphoma) and she knows of a great place to get a wig.  I'm sure I will need chemo so I'm thinking heck, I might as well just cut my hair really really short beforehand and start with the wig.  Wondering if others do this... ChaoRains - yes, I am trying to doing the same, reminding myself to breathe...I will look for you here over the next few weeks.  ",
      "MessageIndex": 5,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821224",
      "Title": "Recently Diagnosed, Not Feeling Very Strong SweetMaggie Nimm"
    },
    {
      "AuthorID": "SweetMaggie…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200156/profile",
      "Content": "May 20, 2014 09:11AM SweetMaggie wrote: Thanks for all of the encouragement and tips to start planning.  I was able to read my pathology report today on-line, confirming what the radiologist told me last week.  A 3 cm area that includes 3 areas of ADH, possible medullary carcinoma, and IDC, grade 2 (with an in-situ component.) ER/PR negative, but nothing about HER2.   Interesting comments about lymphocytic infiltration (some interesting studies out there about how this component may be helpful in treating triple negative cancers.)  I do want to understand treatment options before I go to my surgeon on Friday.  I have now told a few more family members and friends (that seems to be really hard) and have so many supportive people that I'm feeling a bit better today. The more I talk about it, the more it seems real and that I need to start thinking about how to fight it instead of just feeling paralized.   I'm going to try and limit myself to how much time I spend on the internet researching side effects of treatment, and try to spend some time enjoying the weather and do a little hiking this weekend :)  ",
      "MessageIndex": 10,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821224",
      "Title": "Recently Diagnosed, Not Feeling Very Strong SweetMaggie Nimm"
    }
  ]
}