{
  "AuthorID": "Sweetea84",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172331/profile",
  "Posts": [
    {
      "AuthorID": "Sweetea84",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172331/profile",
      "Content": "Sweetea84 wrote: I'm just nervous. I have this painless lump under my armpit on the side of my right breast. I have gotten painful cysts under my arm before and was given an antibiotic by my Dr. It went away after that. I have this new lump now and it's too close for comfort for me. It's about the size of a pea and painless. I first noticed it during my cycle last week and I KNOW it wasn't there before because I'm ALWAYS checking my breasts (kind of obsessively). I made an appt but its not for 2 weeks and the wait is killing me. I don't know what the likelihood is but I'm a nervous wreck right now. My grandmother passed from ovarian cancer and my fathers aunt passed from breast cancer. That's the extent of my history. I'm not exactly fit but I don't eat bad, don't smoke, don't drink. I have 2 children and have been on the pill most of my life due to AWFUL cramps as a teen. I'm African American and 28 if that matters. I just need to talk to someone cuz I'm stressing myself out :(. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801135",
      "Title": "I so nervous, I feel like I'm being irrational Sweetea84 Beckers"
    },
    {
      "AuthorID": "Sweetea84",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172331/profile",
      "Content": "Mar 15, 2013 07:14PM Sweetea84 wrote: Well, the lump under my arm has gotten smaller and has almost disappeared. I had an ultrasound today at a cancer center and it was pretty much clean accept for the underarm thing which they said was a cyst just under the first layer of skin, and I also have fibrous breasts. Other than that I was told \"BREATHE! Your fiiiine.\" Even thought I'm good now, it's not lost on me that it could still occur later, so I will be taking part in the risk assessment program they offer. I DO feel better now and I thank you all who have answered me for the little bits of advice you had to give. I really do wish all of you the best and I guess it's time for me to move on and stop worrying.",
      "MessageIndex": 4,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/801135",
      "Title": "I so nervous, I feel like I'm being irrational Sweetea84 Beckers"
    }
  ]
}