{
  "AuthorID": "Sweet_Pea",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
  "Posts": [
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 12, 2017 03:36AM Sweet_Pea wrote: mustlovepoodles, it's interesting you suggest it, because my regular gynecologist mentioned it at the beginning, took it to the tumor committee at his hospital, and nothing ever came of it. All I know in this respect is that my sister tested negative for BRCA1&2. (Yay!) But, like you, others might come back positive, I have no idea. I'll mention it to the new gynecologist/oncologist that I'm seeing now and see what she thinks. Both places I've kept pursuing advice from (one is through a reconstructive surgeon who's taken a special interest in my case and the other a gyno specializing in oncology) have decided they need more information (ie testing) before surgery, so that has relaxed me a bit, to tell the truth. I'm all in for more testing. It was the sudden mastectomy that had me thrown for a loop, so to speak. Plus, this way I can get the other breast checked out too, since there are things that do show up in the MRI with contrast, and I also have pain in the left breast. I have more pain in my right...although it's not a shooting pain as some describe. It's more of a dull, annoying pain. One doctor told me it was because I have dense breasts. I don't buy it...I've had dense breasts all my life -- it's at least because of the changes in them. Does anyone else have pain? Have you talked to your doctors about whether it's associated with the ADH?",
      "MessageIndex": 17,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/846747",
      "Title": "So Far Benign, but still have more testing to go. momof4va Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jun 30, 2017 07:03AM Sweet_Pea wrote: It seems that ADH ( atypical ductal hyperplasia) can be somewhat tricky. In May I went in for my routine ultrasound/mammogram (my older sister had breast cáncer at age 32 AND age 41, so for me the screenings started early), and since then, for the first time, I got called back (it came back BI RADS 0) and have had: 1. MRI with contrast, BI RADS 4, right breast 2. vacuum-assisted, MRI-guided biopsy. ADH. Here's the thing in my case, as opposed to some of yours above: they recommended removing it right away, no question, and it's BIG -- almost 6cm across on one side. So I'm actually going to need reconstruction if I want any normal breast on the right side (which I've decided I do). Now, I *do* have family history, and a whopper of one (my sister), but the different surgeons I've spoken with have coincided that they won't know if there are any cancerous cells lurking until they do the surgery AND the pathology report is back. I don't want to alarm anyone...after all, most of you haven't had a 6cm área of atypical cells seem to crop up from nowhere in just one year. So I'm still trying to pin down the surgical team (I wish they all coincided in their opinions on reconstruction, it would make this all a lot less stressful). In the meantime, things have been pretty hard! So I understand all that testing can be worrisome, but keep going, march on, it's worth it to know you have a clean bill of health or to get to a place where you can plan your next step.",
      "MessageIndex": 15,
      "PostDate": "30/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/846747",
      "Title": "So Far Benign, but still have more testing to go. momof4va Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 12, 2017 07:46AM Sweet_Pea wrote: It's good to have all of your stories, because up until a couple of weeks ago, my only option seemed to be a mastectomy because of the size of the área affected by ADH in comparison with the rest of my breast. And they wanted it out, to make sure that there was nothing else lurking in there. I understood, but I was shocked and scared, to tell the truth. I was expecting a lumpectomy. So when this past week both tumor committees who are following me decided to get more information through testing before taking such an aggressive approach, I was relieved and thankful. I'll face the mastectomy if I need to, but I'm all in for more testing to, as my new gyno who specializes in oncology puts it, \"find out exactly what those cells are doing in there.\" She says she'd like to know how active they are, how quickly they're changing (tomorrow will be a second MRI after a month, but not another biopsy, which I suspect might come soon), etc. Then they can decide whether they put me on a course of tamoxifen and check my progress after 3 months, for instance, and only do a lumpectomy, or whether it's really necessary to do a mastectomy. I agree with you guys who say that the more information we have, the better, especially when it's about our own particular cases.",
      "MessageIndex": 812,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Sep 15, 2017 10:41AM Sweet_Pea wrote: Hi everyone, Sorry it's taken me so long to get back to the forum. I had my surgery on Aug 29 so I'm two and a half weeks out at this point. I'm happy to read that people seem to be doing generally well. For those of you who aren't doing so well, I wish you all the recovery speed in the world so that those pains, etc. go away as soon as possible. As far as I'm concerned, they've kept a close watch over me. At the beginning I had to go in to see the PS team every day, then every two days, and on Wednesday I JUST graduated to seeing them once a week. Next Wednesday will be my first expansion. Hoping for not too much pain. It's been hard to sleep, and when I tried to wash and dry my hair for the first time myself I apparently pulled a muscle so this week I've been pretty much down for the count! Luckily there's a super cheap place to get my hair washed and dried that just opened in the neighborhood right before my surgery. It was like a sign, I swear. Does anyone else's TE feel kind of like an uncomfortable metal piece shaped weirdly, almost triangular? I'm hoping the expansion will give it a different shape but I'm also scared of the pain. I've got to be the only person who hasn't seen Game of Thrones so I started watching it. Already on Season 2! My PS said regular lotion on the scar and breast with the TE to keep skin as flexible as possible, so I'm just using whatever I can use that feels comfortable and non-irritating on my sensitive skin. Happy to be getting back in the loop with all of you troopers! Any tips to prepare for first expansion?",
      "MessageIndex": 394,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Aug 7, 2017 11:41AM Sweet_Pea wrote: Carol246, What kind of surgery are you having? It will help us figure out if you're going to have drains at all! Good luck to all those having surgery this week! @CandyApple, sorry you had all that nausea but glad you're finally home and best wishes for a speedy recovery now :) @MarlynIllinois, good to hear your experience went smoothly. Hope every day is a small step forward. Keep us in the loop! ;) My surgery was pushed back until the week of the 28th of August. MORE WAITING. Ugh. Well, what can I do? Just learn from you all! Best wishes to all!",
      "MessageIndex": 59,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Aug 26, 2017 12:25PM - edited Aug 26, 2017 12:28PM by Sweet_Pea LSunshine, your operation is scheduled for Monday? Mine is scheduled for Tuesday! :) Is anyone else scheduled for Tuesday, the 29th? What about other days this coming week? Can anyone tell me how many drains I'm likely to have with a unilateral mastectomy and TE? The plastic surgeon told me there would be one from the TE. I realized I know nothing about whether there are drains from the mastectomy...I assume there are, but I have no idea. I guess I'll find out on Tuesday no matter what LOL. Sending good recovery energy to everyone in the forum :)",
      "MessageIndex": 240,
      "PostDate": "26/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Sep 19, 2017 06:13PM Sweet_Pea wrote: MrsWinnie, so sorry about your bad news. But good for you for going farther on your walk today! I feel tugs still every time I take steps so I have to take my walks short for now :( I also think the hissy fit is a good idea. WellWishes you are DRAINLESS! Congratulations! That's a huge step. I remember for 2 days after I kept reaching for the cords when I would get up (even though they weren't there). Too funny. Phantom cord syndrome. I can't remember which of you mentioned Knitted Knockers but I got in touch with the women who make them in Spain where I live. They're sending me some! I can't even wear a bra yet, so they'll probably get here just in time for me to be able to try them out. I'm so excited. Thanks for the tip!",
      "MessageIndex": 414,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 31, 2017 02:26PM - edited Jul 31, 2017 02:28PM by Sweet_Pea Hi everyone, First, best wishes to everyone with surgery tomorrow! We'll all be here to support each other. I'm getting scheduled as we speak for surgery in August but my date isn't even finalized...my doctor wants it to be NEXT WEEK so I have all my pre-op on Thursday! Pretty insane. I feel like I've been waiting and waiting for it to happen and now it's suddenly upon me. \"It\" will be a unilateral mastectomy with a sentinel node removal. So I have some getting ready to do. I really need to take another look at that great list of hospital stuff (pre-during and post) that's posted on one of the fórums here and get the stuff together. Does anyone else feel overwhelmed at the thought? Also, I really don't want my 7 1/2 year-old to get scared when she sees me post surgery. I'm a divorced, single mom and will have help from my friends, but it's going to be, well, tough! I'm so thankful for you all and this forum. PS. Brightness: you can talk about the scary things here. :)",
      "MessageIndex": 36,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jun 13, 2017 06:23AM Sweet_Pea wrote: RESULTS IN: no malignancy in samples taken, but they don't like the looks of what they found, so recommending surgery to take the entire questionable área out (about 6cm) and clean up the sides a bit. That way they can make sure none of the rest of it is malignant and also prevent these questionable-looking cells from turning into cancer not to far into the future, especially given it's rapid change from last year to this year. So it's very good news, indeed. I'll need to visit a couple of surgeons, I dare say, to see who I feel comfortable with. It's quite a chunk to be taken out...has anyone had experience with having to have a chunk that big taken out and did you consider a prothesis to even things out? I'm lucky because the scar won't be near my nipple, but I don't scar particularly well, Any tips, questions for the surgeon, etc. would be welcome. Hoping for similarly good news or BETTER for everyone else!",
      "MessageIndex": 17,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856023",
      "Title": "Anyone else expecting results next week? Mins_Mum Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 14, 2017 07:37AM Sweet_Pea wrote: I just got an MRI done with diffusion yesterday and the results will be in next week. It will show changes after a month and a week, if any, so I'm a bit anxious to know what it does show. Also, it was done during the second week of my menstrual cycle, whereas the first MRI wasn't (and was deemed to have perhaps masked some potential results), so it will be interesting in that respect, too. The first MRI results were definitely harder to wait for, I notice that I'm calmer this time. I still feel a bit impatient, though...especially since my ADH *only* showed up on an MRI with contrast, nothing was visible on the mammogram or ultrasound visuals.",
      "MessageIndex": 53,
      "PostDate": "14/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856023",
      "Title": "Anyone else expecting results next week? Mins_Mum Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 4, 2017 10:37AM Sweet_Pea wrote: I'm so glad to have found you all. I was just dx with ADH in my right breast at the start of June. My sister has had two breast cancers leading to a double mastectomy with reconstruction. My breast tissue is very dense with microcalcifications, but the mass they found following a vacuum-assisted, MRI-guided biopsy is big -- 6cm on one side, 4 on another-- and it grew from one year to the next. No one has given me a percentage risk for BC, but I'm pretty high given my sister's history and the growing speed of this boob-eating mass of cells I've got. Everyone seems to agree it needs to come out in its entirety, and it will leave my right breast very deformed because of the ratio of what is to be taken out compared to the breast. All of this led me to decide to have reconstruction. Now, weeks later, I'm so anxious and still trying to decide which team to pick to do the surgery with, partly because one team said they'll do a lumpectomy, go in again if they need to, wait for the pathology report to come back, and depending on the results, do a masectomy if they need to (then they'd do immediate reconstruction) or go in again and take out more if they need to...and then if they've just done a lumpectomy, 4-6 months later, when everything has stabilized, they'd reconstruct. The other team wonders whether there's going to be enough tissue left to work with, or if they should do a mastectomy from the beginning (regardless of whether there's anything lurking in there or not, assuming it's all good when they go in) and immediate reconstruction with tissue expanders (to implants). I freaked out a bit at the thought of a mastectomy right away and the PS is consulting with the radiologist and the tumor committee about my measurements on my test results to get their opinions on how much tissue he would have left to work with, but he said, I just don't want to leave you for 4-6 months if there's no point to it in the end. When I read all of the stories in this thread about multiple lumpectomies, biopsies, 6 month screenings, etc., I wonder...would having the mastectomy now be so bad after all? Does anyone know the percentage chance of developing BC after a masectomy? I guess I need to make an appointment with an oncologist to ask this, huh? I'm so anxious these days...and I was already supposed to be having the surgery -- and still looking to pin down what kind and by whom. :(",
      "MessageIndex": 799,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Aug 21, 2017 06:36PM - edited Aug 21, 2017 06:37PM by Sweet_Pea Good luck, BeachMama! We'll be sending good vibes your way tomorrow! xoxoxo P.S. My date JUST got confirmed today: next Tuesday, August 29th. Finally a date!",
      "MessageIndex": 173,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Sep 18, 2017 11:59AM Sweet_Pea wrote: Toughiebird, what does your plastic surgeon say when you have gone in for the fill or other revisions? I'd ask for an appointment if your next fill isn't soon because it sounds pretty bad and the burning feeling...maybe they have an easy answer to that or maybe someone needs to look at that for you. Tomorrow I'll be three weeks out and I don't have burning, I don't think...lots of other weird pains from the TE, like there's a huge paper clip all bent out of shape in there hahaha. I wish I could help you!",
      "MessageIndex": 404,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Oct 4, 2017 05:12AM Sweet_Pea wrote: I hear you, kmb4! Those fills are hard for me, too! But you're through with it! How many did you have, in total? Let me know what you find out about the implants, though I don't know that I'll get a choice presented to me when the time comes. Mine was a single mastectomy. Still can't wash my own hair and dry it for fear of pulling a muscle again (boy did that set me back). I do have a lot of really long hair, I guess. It's a drag for this. People say \"cut it\" but I say I'm already undergoing a lot of changes as is! Today is another fill. let's hope for minimal discomfort.",
      "MessageIndex": 467,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Oct 10, 2017 04:09PM Sweet_Pea wrote: Is anyone else still having trouble washing her own hair? I tried again and hurt something AGAIN. Not as bad as last time but the morning after I felt llke I had used a ton of muscles I never knew I had and WAY TOO MUCH. Think I'll be going back to the cheapie hair place again tomorrow. :(",
      "MessageIndex": 476,
      "PostDate": "10/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Sweet_Pea wrote: Hi everyone, My MRI with contrast came back with BI RADS 4, and they've ordered an mri vacuum assisted breast biopsy. I can feel the cyst, apparently the concern is about changes it's undergone since last year. It also hurts. I can't really give much other information from the MRI report because I don't know what's relevant (plus it's in Spanish, I live in Spain). My sister has had two breast cancers, so she's unfortunately an expert at all of this (good support for me, sad for her), so my family history is there. Does anyone have any thoughts on this? Has anyone had the same kind of biopsy ordered? Any thoughts would be appreciated. I'm determined to stay positive! :) First dx ADH 6/2017, 2nd dx IDC+DCIS 7/2017 Dx 7/13/2017, DCIS/IDC: Mucinous, Right, Stage 0, Grade 2, 0/1 nodes, ER+/PR+, HER2- Surgery 8/29/2017 Lymph node removal: Sentinel; Mastectomy: Right; Reconstruction (right): Tissue expander placement Surgery 4/24/2018 Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/855672",
      "Title": "About to have an mri vacuum assisted breast biopsy Sweet_Pea Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 5, 2017 03:23AM Sweet_Pea wrote: Oh Kaso, I wish you all the luck in the world in your surgery, that your nodes are perfectly clear and that you get the best path report back possible. I don't pray, but I'll be sending all the positive energy I can all across the ocean for you (I'm in Spain). You have six kids and have gone through fertility treatments! We already know you are a very, very strong person. You've got this!",
      "MessageIndex": 801,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jun 12, 2017 04:27AM Sweet_Pea wrote: The waiting is terrible no matter how zen I try to be about it. Last week I had a vacuum-assisted, MRI-guided biopsy and am expecting results TODAY! I have a near migraine pushing behind my right eye from the tension, no doubt, but I'm at work until my appointment with the doctor later this afternoon. Best to distract myself as much as possible. Canela, I hope your results come back today rather than tomorrow. Even if it's bad news, then we know, we can make a plan, and move AHEAD! The waiting game is the pits. That said, I hope all of your results come back begnign, and I'll be thinking of you.",
      "MessageIndex": 11,
      "PostDate": "12/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/856023",
      "Title": "Anyone else expecting results next week? Mins_Mum Sweet_Pea"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Aug 27, 2017 02:21AM - edited Aug 27, 2017 02:28AM by Sweet_Pea kmb4, thanks for replying! So maybe two drains. We'll see.... AliceAgnes, thanks so much for the advice! Will definitely keep it in mind. rljessu Thanks for updating us! You are up doing laundry?! My goodness, what a trooper! It sounds like things are rough but at the same time you're doing really well pulling through. Signs of real strengh there :D The blister on your back I'm sure is not helping you sleep but is probably the least of your sleeping problems. I'm sure it will get better every day, from what I read on here and what my sister told me (she had a double mastectomy about 6 years ago). Break out the prunes! Unless, of course, they tend to give you horrible gas or something. You've got all the other solutions going on, let food laxatives work for you, too. I think they have Vitamin A and C in them, too. Anyway, you all are going to think I'm from the prune council or something. LOL. Keep on writing us, if you can, and we can all keep encouraging each other! ",
      "MessageIndex": 246,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "Sweet_Pea",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/253259/profile",
      "Content": "Jul 12, 2017 06:50AM Sweet_Pea wrote: Hi Mlezak, I was recently diagnosed with ADH and they also put a mastectomy on the table as perhaps the only option for me...but they made it clear that my case IS NOT NORMAL. In my case it has to do with how large the áffected área is to be removed in comparison with the rest of the breast. Even then, they are now doing more testing to see as much as they can if there are other treatment options (e.g. tamoxifen and check on how it evolves) before going in and doing such an aggressive procedure. In the ADH thread there are people who have had mastectomies after ADH diagnoses, they will be able to respond to you. But my sister had to have a doublé mastectomy after breast cáncer and I would encourage you to try less aggressive treatment options first. Tamoxifen gave my sister osteoporosis, but my sister had to take it in her 30's -- COMPLETELY different scenario than yours, completely different side effects in younger women who take it in larger doses because they have cáncer (she had two cancers and took it before the double mastectomy). In any case, best of luck with everything. I know how it feels when they whip out that word \"mastectomy\" -- I nearly fell over.",
      "MessageIndex": 3,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/856385",
      "Title": "Atypical ductal hyperplasia: mastectomy Mlezak MTwoman"
    }
  ]
}