{
  "AuthorID": "SweetRain52…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
  "Posts": [
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Sep 13, 2016 09:35PM SweetRain52 wrote: Well, I am past my third infusion and my hair has really started to fall out. I hoped I would be one of the lucky ones and it would just thin, but that doesn't seem to be the case, so I'm scrambling for a wig. I am so not looking forward to being bald. Regarding the infusions, I really haven't had nausea. The darn steroids after the second infusion gave me crazy dreams and well, it seemed like every really bad thing I have ever thought, or happened to me came to mind either in dreams or my thoughts on the second night after my infusion. I really think it was the steroids and told my doctor who immediately lowered the amount. I never want to experience a night like that again. At one point, I just started praying so I wouldn't have such awful thoughts and dreams. The next night, I had no problems and I never want to experience that again. Oh, emotions, God bless my husband, because it is like PMS all over again. My WBC count has dropped. My 4 year old granddaughte, whom I babysit, has a cold which worries me. The steroids have increased my appetite dramatically and I just can't say no to food. It is almost embarrassing. I eat like a horse. Since I am diabetic, that has me worried, too! Is anyone else going through these experiences? ",
      "MessageIndex": 793,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Aug 19, 2016 11:22AM - edited Aug 19, 2016 11:40AM by SweetRain52 Yes, I am starting on August 25. I'm terrified, but I'm hoping this website will help with that. I have good veins, but maybe I should request a port or is that up to the nurse or doctor??? It just seem to boggle my mind that so many women are getting breast cancer. Sometimes I think that if had been men that were getting cancer like us, they would have already found a cure. Yes, that's frustration talking. My cancer was the size of a thin crayon box, yet they said I was lucky to have discovered it. No cancer in my family, a lot of diabetes and heart disease, but no cancer. Go figure. I just felt a thickening in my left breast and some unusual sensations. It involved one lymph node, so I guess I'm stage 3. Geez, it is so hard not to be depressed. Oh, just colored my hair. I'm 64 and I'm not going to get any reconstruction. May I ask if anyone here has acrylic nails? My surgeon said that I should stop going to the salon as he pointed out the possibility of infection. You know there are so few things that make me feel like I'm pretty and that was one of them. It breaks my heart to stop. God bless you all for your comments, it has really helped me.",
      "MessageIndex": 319,
      "PostDate": "19/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Aug 30, 2016 09:27AM SweetRain52 wrote: Thanks Hopefloats.. , I too felt really good after my first chemo, I am so glad for the heads up. I'm going to be more careful. Still waiting for my hair to fall out...not looking forward to it. No wig or scarves yet. Guess I'd better get going on that! God bless you and I hope your infection heals quickly!",
      "MessageIndex": 550,
      "PostDate": "30/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Aug 19, 2016 11:24AM SweetRain52 wrote: God bless you. I hope it goes easy for you!",
      "MessageIndex": 320,
      "PostDate": "19/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Sep 13, 2016 09:50PM SweetRain52 wrote: One of the things that happened to me this last (3rd) infusion was I went to get my blood checked the night before so when my sister-in-law came with me this would cut off an hour of the waiting time. So, I do that, she comes with me the next day for my 3rd infusion, we sit in the waiting room for an HOUR and A HALF. I was so embarrassed. I have never waited that long. Here I thought I would get her out of there fast, well I finally went up to the nurse's station and asked if they had forgotten me. I told them about getting my blood work done the day before which should have made everything fast and easy, but no. Even when they put me in the room, I still had to wait another 10 minutes or so. I was so embarrassed and dehumanized, I cried in front of my sister-in-law. She was fabulous. So encouraging and understanding, me, I was a mess. I guess I can kind of laugh at it now, but then, it was awful. Hope nothing like this happens to any of you. God bless you all. ;)",
      "MessageIndex": 794,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 20, 2016 04:31PM SweetRain52 wrote: OMG Lynn, such a high sugar number! I hope you were able to bring the number down. God bless you! ",
      "MessageIndex": 1128,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Nov 26, 2016 01:26AM SweetRain52 wrote: Well, you can see I don't go to this site too often because of how late I am in answering your question. Sometimes I find it depressing, also scary. Anyway, the doctor said that some drugs in chemo can affect the heart and he wanted to see how strong my heart was. I woke up from a nightmare just a short time ago and really wondered if I was having a heart attack as my chest was hurting so bad. I'm hoping that all it was was heart burn. I have to say, it was one really hell of a nightmare. Hope I don't have anymore any time soon. I am going to have my second mix of Doxorubicin and Cytoxan, plus the steroids, and Nuelasta this Thursday with two more to go, two weeks apart, then on to radiation. I find I am getting more tired, and short tempered (unfortunately for my husband) lately. I developed a kidney infection the day before Thanksgiving. God bless whoever discovered Cipro. God bless all of you. May we all survive to a ripe old age. :)",
      "MessageIndex": 1305,
      "PostDate": "26/11/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Aug 29, 2016 09:29AM SweetRain52 wrote: Well, I started my chemo on 8/25/2016. It went like a snap, except the warmth of something, I can't remember, they put in. Felt it enter and go up my arm, then the feeling eased. My husband was with me all the time, which was so helpful. He pretty much watched TV and me. LOL I was given no anti nausea meds. It was suggested that because my veins were pretty good, that I not go with a port for now. Sounds like everyone here is getting a port. It kind of makes me feel uncomfortable that they didn't feel it necessary. The young lady that supervised my infusion was very kind and positive. She explained how the infusion would go in the future. She actually made it easier and I am utterly grateful. I have to say that I ate so much that day, it really surprised me. I noticed no side effects. The second day I lay around a bit. Saturday, I took my granddaughter to a park event which required me to walk a lot in the heat, but I still seemed ok. Sunday, all I wanted to do was lay in bed, still, went to church, came home and then lay in bed, a lot of the day. I had pains in my right foot. When I went to bed, the pain in my legs, kept me up most of the night. At this point, I don't know if the walking caused the pain or it was a side effect. It has really helped to read everyone posts. I'm a little afraid of the depression. I feel ok and then suddenly it hits me and the bottom wants to fall out. Has anyone here ever heard of a person who hasn't lost their hair through chemo? I think it may have just have been a story my nurse told me, I am still hoping. Well, I felt frustrated this morning and cut half my long hair off. I guess I'd better be realistic and order a wig. God bless us all.",
      "MessageIndex": 525,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Dec 26, 2016 11:42PM SweetRain52 wrote:  Thank you all for your canker sore remedies. I've been trying the baking soda/water and that hasn't helped. Well, I am going to have my last infusion this Thursday. Not looking forward to it. I was doing really good till this last one which made me so tired all I had to do was bend over, pick up something, and I was ready for bed. LOL I have never felt so tired. Nausea has picked up a bit and acid stomach. I still have some neuropathy from the taxol. My toes and fingers are still somewhat numb. My doctor said a month ago that the feelings should start returning, then last week he said in another few weeks.....I'm like, wait..you keep adding more time on!!!! At least I don't have tingling and burning that others have had. I'm scared, but will so glad when this last infusion is over! Then there will be 6 weeks of radiation. Is that normal for radiation treatment, 6 weeks, 5 days a week? Thank you all again and hope you all had a very Merry Christmas and Happy New Year!",
      "MessageIndex": 1411,
      "PostDate": "26/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Jan 15, 2017 05:06PM SweetRain52 wrote: Sensitivehrt, I am so excited for you! Hair!!! I ended chemo about three weeks ago and have peach fuzz. I just wish my stomach wasn't upset so often. Good luck and God bless you!",
      "MessageIndex": 1485,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Jan 15, 2017 05:32PM SweetRain52 wrote: Does anyone know what to do about upset stomach. Keep getting crampy stomach, makes living just awful. I finished chemo about three weeks ago, but the last Nulasta didn't work and my white blood cell count dropped considerably. I felt like a dishrag. Then I got the awful cold that is going around Cleveland. You cough and cough, especially at night. I've been coughing for three weeks, and heard that this cold lasts for 4+. Low WBC didn't help. I could deal with it so much better if I could eat normally. Any comments, help is welcome! God bless you all!",
      "MessageIndex": 1486,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 19, 2016 01:24PM - edited Oct 20, 2016 04:28PM by SweetRain52",
      "MessageIndex": 1119,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 20, 2016 04:25PM SweetRain52 wrote: Thanks DaraB, My sugar went up to 433, I about had a heart attack about that. I had been trying to get sliding insulin for 3 or 4 weeks, but the nurse said that I had to keep a record of the readings for a few days so she could get a picture of how my numbers were. Then a day or so later they started to run in the 300's, fortunately I saw my surgeon that day and casually mentioned that. Well, he was shocked and took my sugar reading right away which was 390. He call my hospital (internal medicine) and insisted I see a doctor right away and set up an appointment. Saw the doctor and she increased my metformin to 1000 in the am and 500 at night. She prescribed the insulin, but said to wait till I saw the nurse three days later so the nurse could instruct me on how to use it. Trying to get the insulin has been kind of a nightmare. I share the blame with my doctors as I was not keeping consistent records. I go see her tomorrow. Thank you for the tip about water. I will start drinking more water. I'm so hooked on Diet Pepsi, it is hard to drink water, so tasteless, but I WILL DO IT! Regarding my neuropathy, my doctor told me today that this would be the last taxol infusion. He said that the symptoms would persist for a month and slowly ease off. I was like, \"Wait a minute, it is going to get worse for a month, \" and he reluctantly said, \"Yes.\" YIKES! He also said that neuropathy caught early, like now, should be reversible. WHEW! So, he said that they would give me an ultra sound of my heart. Three weeks later I would be put on the next and last set of drugs. I would get them once every two weeks for 4 times, after that, I would get radiation and later a pill taken at home. There is an end! Yay! God bless us all!   ",
      "MessageIndex": 1127,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 20, 2016 05:22PM SweetRain52 wrote: Thank you so much for your kindness. I recently decided that my hair was just looking too thin to really continue having it and so went to a salon to have it shaved off and my wig trimmed to a style liked. The stylist said that she would not be able to trim my wig as if a mistake was made, it would be too much to replace the price of the wig. While I was disappointed, I made myself not cry and pushed forward with the hair cut. It was traumatic, but I laughed. I looked like Mr. Clean. She said that the hair cut would not cost anything. I was so happy. It is so hard not to cry when people around you are being so nice. She told me of a wig place close by that did cut wigs. I got in my car and told myself it was ok to cry now and get it over with. I drove around and found Ann's Wigs. I went into the back door and met a man, not a woman, who owed the place. He was over 70 years old and originally from South Korea. He had lived in America for over 40 years. He was so nice and said that the trim of the wig would cost $10. I was a little afraid that it would be much more. I put my wig on and he sat me down and started to trim it. We started talking and discovered we went to the same church and began talking about that. He was so very nice and we both enjoyed our conversation. My wig looked like everything I wanted. I was so incredibly happy. As I stood up, he said that I didn't owe him anything. We went to the same church and he was happy to do it. I left there feeling so very blessed. When I got home, my husband said my wig looked GREAT! I looked so nice. It is so wonderful to find so many out there that want to help. Thank you for Gracie Foundation and all that you do to help us, it is appreciated. God bless you!",
      "MessageIndex": 1129,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 9, 2016 07:10PM SweetRain52 wrote: Thank you for your comment VLM. My doctor went from 4 four tiny steroid pills to two. The dreams disappeared. YAY! That said, I get my infusion on Thursday, but by Saturday, I am experiencing aggravation and tenseness. It is like when I used to have really bad PMS. I have been having to remind myself every Thursday that I might be feeling this aggravation again on Saturday and that I have to watch for it and not take it out on anyone else. It is kind of scary. I haven't had nausea, but my sugar has gone from 145 to 180 to, at times, 250. My cancer doctor said that I should have a sliding sale insulin and I have been trying to get this from my primary physician for three weeks. I've never had sugar that high. I'm not looking forward to going on insulin, but today, I felt miserable and I think it is because of my sugar. Oh, I did get a UTI which has been a bear to get rid of. I'm finally on Cipro, but it has not cleared up. I'm kind of worried about that as now I have an itchy rash from it. So frustrating.",
      "MessageIndex": 1013,
      "PostDate": "09/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Oct 19, 2016 01:24PM - edited Oct 20, 2016 02:38PM by SweetRain52 If you have started to experience neuropathy, when did it occur? Just had my 5h infusion last week and my right ring and pinky have felt numb, my toes have started to feel heavy, but not tingly. Told the doctor right away. He said that they would give me one more infusion, and then start on the mix of drugs. So scared. All my infusions have been ok, no nausea. I made the mistake of eating something acidic right before my last infusion and got sick after they gave me the pepsid and steroid. My temperature rose, they got scared, I still don't know what all happened, I just know I was there for 4 hours. They must of had to wait till my temp went down, then restarted again. My poor daughter got frightened when I didn't call her for pick up at a reasonable time. So, don't eat like I did, learned my lesson. Something else I have learned from this experience: If you are diabetic, as I am, your sugar will rise. When your sugar rises, watch out for UTI's, try to keep your sugar under control. Make sure they give you 8th drug your UTI is most sensitive to first, if you get one. I went two weeks on two different antibiotics then got a yeast infection. That kind of experience will really get your depressed. Watch for the neuropathy, I think most people will get some form of it. You are going to get tired, eventually, as you go through this. I was doing pretty good until recently. Get some sleep, as much as you can. Do lots of things that make you happy and God bless us all! :)",
      "MessageIndex": 1120,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Dec 23, 2016 08:15PM SweetRain52 wrote: Well, this stupid computer dumped my post! Does anyone have a proven remedy to canker sores? Baking soda/water are not helping. One more infusion and I'm done, but these meds are wearing me down. I was doing so well, then WHAM! exhaustion set in, canker sore, acid, irritability. Forget Christmas. All that said, I am going to wish you all a very Merry Healthy Christmas and go to bed. LOL",
      "MessageIndex": 1402,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    },
    {
      "AuthorID": "SweetRain52…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237944/profile",
      "Content": "Aug 13, 2017 11:20PM SweetRain52 wrote:  I am 65, mother of a 28 year old daughter, and 40 years into my marriage. I was diagnosed with stage 3 breast cancer in my left breast. They tested my lymph nodes and found one that was had cancer cells. The surgeon decided to remove only the left breast as the right appeared cancer free. I have to say, I cried after he said that. I keep trying to feel like the same woman as before this started, but the removal of my left breast made me feel less a woman than before. I've come to accept this, but sometimes it hits me and I get depressed for a while. Well, I got through the Chemo and it went pretty good until the Nulasta failed on the last chemo dose. I live in Cleveland and we had this horrible cold going around, so as soon as my white blood cell count dropped, I naturally got it and coughed for three months. My husband said that that was the only time that he thought I might not make it. He has been an angel through this whole experience. I put off radiation until I thought I was over the cold. Radiation was not bad until the 4th week when the skin started to feel pretty tender. By the time my radiation treatment was over, well, the last two weeks were pretty painful. Then the healing started and it was about another two weeks before I really started to feel like I was going to be ok. It was worth the pain to think that I may just survive this to live several more years. My hair has grown about 4 inches. No more wigs! My husband and daughter said that the short hair was very attractive on me as well as a friend, so I have been considering keeping it short and maybe gray. Oh, don't be surprised that your hair grows back in curly or wavy when it used to be plain straight! It happened to me! I look in the mirror sometimes and ask myself, \"Who are you?\" LOL! After the radiation, they put me on anastrozole. My wrists have ached, I have a chronic stiff neck, I sometimes get leg cramps, but I am happy, alive and feeling well! We went camping with my 5 year old granddaughter this summer and had a great time! The only thing I have faced recently is a rash. I have no idea where it came from, but it itches pretty bad. I want to see my onocologist about it soon and maybe a dermatologist, but it is the only thing that is really bothering me now. I feel so very lucky to be alive. My mother died at 65 of a heart attack and every day I live past my 65th makes my heart sing. I just want to encourage everyone who is going through this, you can make it, you can endure, you can survive! God bless you all! SueR.",
      "MessageIndex": 1713,
      "PostDate": "13/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/846225",
      "Title": "Anyone starting chemo August 2016? MFalabella Kechla"
    }
  ]
}