{
  "AuthorID": "swimangel72",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
  "Posts": [
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 21, 2008 02:29PM swimangel72 wrote: OH that's great news Kalyla! So have you decided if you'll be reducing the \"good\" side to match the new side?",
      "MessageIndex": 5,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/722945",
      "Title": "Uneven tram flap, so partial prostheis? kalyla twirlgirl"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 12, 2008 10:49AM swimangel72 wrote: Hang in there sweetie..........I know what you're going through, it's hardest in the beginning when you are first forced onto this roller-coaster. But don't worry - we're all in this together - and yes, the hardest part IS telling the family - like somehow we've changed, taken on a new identity......but you are STILL you and you WILL get through this! Just take it one step at a time and come to us whenever you need help. Hugs and best wishes!",
      "MessageIndex": 6,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/703866",
      "Title": "im scared jacqdan sueper13"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 26, 2008 05:47PM swimangel72 wrote: The same thing happened to my cousin - her husband cheated on her during her chemo 10 years ago. Amazingly - she forgave him - after he begged for her forgiveness and after couple therapy. The entire family was shocked - but now, years later, we have all forgiven him because my cousin took the high road. If it happened to me - I wouldn't be so understanding - but my cousin is a deeply caring, compassionate forgiving person. I don't think her husband deserves her - but I tell myself, \"Judge not lest thou be judged.\"",
      "MessageIndex": 54,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719264",
      "Title": "Can you believe John Edwards? waterlily Daffodil"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 7, 2009 01:07PM swimangel72 wrote: Joyce I read that Vitamin E oil can cause problems on incisions, including allergic reactions and that topical Vitamin C is much better - just be sure it doesn't oxidise (turn brown) because then it is useless.",
      "MessageIndex": 8,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731802",
      "Title": "Weird feelings in surgery area - normal? Cydney Joyceska"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 7, 2008 09:01PM swimangel72 wrote:",
      "MessageIndex": 2,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708622",
      "Title": "Blood in nose? Caithi Caithi"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 3, 2008 03:48PM swimangel72 wrote: Hasn't anyone given you a breast MRI? I would think that would be a non-invasive way of helping with your diagnosis.........maybe you can ask for one? Good luck and I hope you'll get some relief soon!",
      "MessageIndex": 17,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/718934",
      "Title": "Misdiagnosed? jhawks67 Shirlann"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 5, 2009 10:40AM swimangel72 wrote: Chico1 - maybe your onc could change the timing of your tx's? Do you go every three weeks or every two weeks? Also - ask him is there anyway he could just give you the Herceptin without the chemo (they usually say no)........it's the Herceptin you really need for a year. I had very little SEs with Herceptin - just bad fingernails - and my chemo was \"light\" (Navelbine every two weeks for 4 months - I didn't lose my hair).........each oncologist is different in their approach. Are you also getting steroids? They made me feel awful - so my onc stopped and it made a huge difference. Good luck and I hope you feel better soon.",
      "MessageIndex": 2,
      "PostDate": "05/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/744959",
      "Title": "Stopping chemo chico1 vstadey2"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 6, 2009 05:48PM swimangel72 wrote: Binney - WAY TO GO GIRL! Congratulations - you deserve this award and all my gratitude for helping me with my own lymp problems - you are truly a blessing! ",
      "MessageIndex": 24,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/730259",
      "Title": "CONGRATS TO OUR DR. BINNEY! OneBadBoob gracejon"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 1, 2009 06:12PM swimangel72 wrote: Lursa I'm so sorry you suffered through this awful ordeal. Your story sounds so similar to mine - when I went to the ER after my  mx with free-tram - I was stuck in that hospital for an additional 2 weeks.........most of the care was good..........but on two separate occasions I had to literally BEG the night nurses to give me my pain meds! Same thing happened - I was always the \"good girl\".........trying to be polite and considerate........until finally I realized that they did NOT understand how seriously ill I was and how high my pain levels. Even if you tell them your pain level is a \"10\".......if you're smiling and joking, they don't \"get it\". After a week in the hospital..........and being \"forgotten\" on two nights in a row.........I totally lost it! I dragged myself out of bed, IV pole in hand - a blanket draped over my head.........stood in the darkened hallway and screamed, \"WHERE ARE MY PAIN MEDS!\" (this after ringing for a nurse for over an hour.) Let me tell you - my pain meds came IMMEDIATELY! Lol! I learned the hard way, \"the squeaky wheel gets the grease!\"  My bad experience happened over a year ago........it took me this long to recover from the mrsa, surgery, blood transfusions, chemo and emotional duldrums to finally contact a malpractice lawyer. But two different lawyers said it'd be nearly impossible to prove my case.........so now I'm wondering if it's even too late to write a letter of complaint to the hospital administrator? Still,  I figure, \"better late than never\"..........at that time, I DID complain to the social worker on staff - and to the head of the nursing staff (two nurses were reprimanded for forgetting me)..........but I really need to complain about the doctors on staff who all bowed down in homage to my bc surgeon and plastic surgeon, nearly killing me in the process. Lursa I'm so happy you were able to go home the next day.............another lesson learned.........when possible, have a family member stay over-night with you - we are truly at the mercy of budget cuts and understaffed hospitals. I hope you're feeling better now!",
      "MessageIndex": 15,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735107",
      "Title": "Frikking cold, heartless BUTCHERS! ......rant Lursa5 marshall2000"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 24, 2008 08:50AM swimangel72 wrote: Pam I'm so glad you're feeling more energetic - I was going to suggest that you might be dehydrated. I felt much like you 3 weeks after my surgery - and discovered the dehydration problem which was cured by a huge bottle of Gatorade. I can't stress how sick I felt - my PCP was ready to hospitalize me again, until he noticed the \"slight\" dehydration problem in my blood work. The nurse suggested the Gatorade - it was like a miracle drug. I couldn't believe the difference it made!  Pam I'm also sending hugs your way regarding the stress level in your home, especially with your new teen driver and the car accident. It's unbelievable what we have to deal with as BC patients - the parental responsibilities just don't go away. My daughter is begging me to let her drive alone to her camp job in July, but I refused because I told her even though she got her driver's license last year, she hasn't driven a car for the entire year (no car in college) and in my opinion, she's not ready to go solo. Also - I told her - even if she feels ready - I'm not ready for the added stress, especially worrying about accidents.......I told my 3 kids - I can't deal with any more illnesses or doctor visits, they REALLY must try to stay well and healthy this summer!  Yesterday, my daughter's cat ate half of a 200mg ibuprophen tablet that was on the floor and started vomiting. Half the day was spent at the vets........$350 later.....3 different pills that the cat won't take - more vomiting this morning, and probably another visit to the vet and possible hospitalization for the cat because he might have damaged his kidneys. The cat really is part of our family, so this added stress has made me very teary-eyed all morning.  Anyway Pam - hang in there and please get stronger every day!",
      "MessageIndex": 9,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707315",
      "Title": "Energy Level Dropping to O- 3 wks after surgery Dejaboo Dejaboo"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 19, 2008 08:41AM - edited May 19, 2008 08:41AM by swimangel72 Hi Swmmom - I'm so sorry you're going through all this. I'm following what's happening to you because I've been to my LE therapist three times now and she's is sooo different from yours! She took my entire history, and arm measurements - does massage therapy - gave me printed exercises to perform - talks to me about her sweet little 4 year old, I really like her so much - and I hope you'll find a therapist you like also. I haven't had my arm wrapped at all - but my swelling was very slight so it may not be necessary. She said she will measure me for a compression sleeve if and when I decide I need to fly somewhere, but since I rarely travel by air, it won't be a problem for now. Binney I was interested in reading about the foam quilt garments - do you think I should ask my therapist if I need that for my abdomen? It still feels tight and swollen, especially at night or if I've done more exercise during the day. Today it feels fine - but I did absolutely  nothing at all today. It seems such a shame - that exercise exacerbates the lymphedma problem when it is so important for healing and maintaining good health in the long run! I can't WAIT to get back into the pool and start swimming my laps......Swmmom, I hope you will learn to swim - your 12 year old daughter sounds like she'll be an excellent instructor AND a great business woman too!  My kids all swam competitively - it's a wonderful sport because where kids of all ages can swim together on the same team. Even when my son was only 6 years old, he swam with the \"big kids\" on the same team as my daughters......you don't see that with soccer or basketball!",
      "MessageIndex": 9,
      "PostDate": "19/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 22, 2008 04:15AM swimangel72 wrote: Swmmom - I'm happy you got a referral to a different therapist - and hope she is as good as she sounds so far! Binney - thanks again for all your advice......I saw my PCP yesterday and he poked around in my abdomen and wrote a prescription for a Cat scan to rule out a hernia. He said this is the only way to know for sure. I'm hoping my insurance approves it - normally they don't give me any problems, but I've had so many procedures already, who knows? My PCP asked me, if the Cat scan DOES show a hernia, do I want my plastic surgeon to perform the repair? I said \"absolutely not!\" Although my PS is great with mico-vascular surgery (my Diep was successful in my \"foob\" - no problems with fat necrosis or anything there), I don't think I want him poking around inside my abdomen anymore! Maybe I'll change my mind - my PS is a very nice gentleman, I just don't get the feeling he takes my complaints about my swollen stomach seriously. I see him tomorrow, at which time I'll mention how I'm going to get a Cat scan - I'm dying to see his reaction to that. Also - I'm going to tell him that my LE therapist AND breast cancer surgeon (who performed the mastectomy) both said my breast is NOT swollen - that it's so bulky because of the fat tissue that is there. My PS keeps telling me that it'll get smaller when the swelling goes down - but there IS no swelling......it's like he moved ALL the fat from my lower abdomen to the one breast. There was enough there for TWO size C breasts.....right now it feels like DD breast - most of it on the side, under my arm, and it is soooo heavy! I feel like I need a bra with super-support to hold it up! I really want him to finally ADMIT that the breast is too large and to agree to make it smaller when he performs Stage 2. Of course, that probably won't happen for a year, when I finish the Herceptin. Sorry to ramble on - and thanks again ladies for all your kind advice!",
      "MessageIndex": 25,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 19, 2008 10:13PM swimangel72 wrote:",
      "MessageIndex": 11,
      "PostDate": "19/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 2, 2008 03:32PM swimangel72 wrote: Great news swmmom! I'm so happy you found a good therapist - will you be returning to her any time soon? I've been seeing my LE therapist twice a week now for over a month - she's been doing massage therapy for me and it's helped so much (even though I only have a bit of lymphedema in my right arm, with cording, and in my torso.) I've been doing the exercises at home too - and am expecting my compression sleeve to be delivered in a couple of days. I'm curious though if you're scheduled to go back for more therapy and if your insurance will pay for it - because I feel so spoiled by my LE therapist and how often I've been seeing her.",
      "MessageIndex": 38,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/705632",
      "Title": "My visit with the therapist swmmom swmmom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 17, 2008 05:04PM swimangel72 wrote: Hi Bernice - I'm so sorry to hear your news - but I hope I can reassure you that Navelbine isn't all that difficult to tolerate. I'm a weird case - my onc put me on Navelbine even though my tumor was Stage 1 Grade 1 - because I'm Her2+, he wanted me on Herceptin, but Herceptin works better in combination with other chemo drugs. He chose Navelbine for me because of its light side-effects - it won't cause any heart problems (Herceptin will) and it won't cause total hair loss (although my hair has gotten thinner.) I get my infusions every two weeks. The main side effects I've experienced with Navelbine are as follows:  burning and heavy feeling in my arm (they tried a medi-port for me, but after it got infected, they're using my veins.) The solution to the burning feeling was for the nurse to run the Navelbine at the SAME time as a bag of saline - the arm pain (which had lasted a week) was totally gone! The other side effect I experience is painless diarhhea - it hits me about 2 hours after my infusion and lasts for about 4 hours. Then it's totally gone. When I switched oncs, the new nurses gave me (as they routinely do) premeds: Decadron (a steroid) and Zofran (anti-nausea meds). This was unnecessary for me since I never got nauseous on the Navelbine and Herceptin. The premeds were AWFUL - the Decadron kept me up all night for two nights in a row - and the Zofran gave me painful constipation for 3 days - my belly swelled up and the cramping was so bad I felt like I was giving birth! So I told them to forget the pre-meds - they cause more problems than they cured. So I'm back now to just Navelbine (with saline) and Herceptin. The only other side effect I noticed is a bit of tiredness - but that could be from the Herceptin - or from anxiety. Otherwise I've been perfectly fine - and once they removed the infected port, I was able to return to swimming and my energy level has been getting better every week. The onc does check my counts every week - but so far they haven't dropped low enough for any concern. I hope my story gives you confidence Bernice that Navelbine will be much easier to tolerate than your prior chemo experiences. Hang in there - and be sure to tell the nurses any side effects you experience.",
      "MessageIndex": 2,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719661",
      "Title": "Progression...Navelbine Quest Maya1 Maya1"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 16, 2008 12:48PM swimangel72 wrote:",
      "MessageIndex": 1,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704092",
      "Title": "Got Answers but chemo again minette badboob67"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 22, 2011 06:22PM - edited Jan 22, 2011 06:25PM by swimangel72 Barry - has your tumor been tested to see if it's Her2+? That made all the difference in my treatment - even though my tumor was only a Stage 1, Grade 1, ER+ and PR+ - even with an Oncotype DX score of 22 (which is low-intermediate) I had a uni-lateral mx with immediate reconstruction (and a lot of infections afterwards). I should have just waited to make this decision after getting the breast MRI (which showed no other abnormalities). A lumpectomy with rads has the same survival rates as a mastectomy...........however..........the more important decision you'll have to make will be concerning chemo treatment - do you need it or not? Did you get an Oncotype DX test done? Was your tumor Her2- or equivacal? If equivacal, you need to get the FISh test done - if the tumor is Her2+, you'll need Herceptin with chemo for a year. I understand how difficult all these decisions are............good luck and may God's angels watch over you! P.S. Edited to add - after my breast cancer dx 3 years ago, my thyroid was tested and showed to be hypothyroid and was immediately put on a low dose of Synthroid every day. It never interfered with any of my chemo/Herceptin/Arimidex treatments.",
      "MessageIndex": 14,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 24, 2011 12:17AM swimangel72 wrote: More than an assault on our femininity, breast cancer is an assault on our lives. :-( May God's angels watch over us all! ",
      "MessageIndex": 44,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763808",
      "Title": "How serious is stage 1, low grade cancer? Hindsfeet annettek"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 18, 2010 06:59PM swimangel72 wrote: Hi Ang - glad you're home and feeling OK!",
      "MessageIndex": 29,
      "PostDate": "18/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 12, 2010 07:53AM swimangel72 wrote: Nursecal - I'm sorry you ended up with abdominal problems even after you did such great research (more research than I did prior to my so-called \"DIep\"). The following web site really explained things well to me, unfortunately not until it was too late - hope it's useful for any one else: http://www.diepbreastreconstruction.org/ Also Nursecal - my abdominal problems were probably STARTED by the PS removing a cuff of muscle, but it became so much worse after I developed mrsa in my abdomen and lungs. I coughed so hard for about a week - and yet, even then, my PS refused to acknowledge that I had a hernia. My new surgeons did not use Alloderm, but rather Strattice because it has anti-mrsa properties and they didn't repair just a small area around the hernia but rather my entire lower abdominal region. They both wrote a paper describing their new technique - perhaps you can print it out and bring it to your Dr. Spiegal - tell him Dr. DeNoto travels the country giving talks about his new procedure. Hope this info helps you! We post-tram-flap hernia girls need to stick together! Title of the article below is:  Extended mesh repair with external oblique muscle reinforcement for abdominal wall contour abnormalities following TRAM flap click the link below for the article: http://www.ncbi.nlm.nih.gov/pubmed/19934848",
      "MessageIndex": 22,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 11, 2010 08:34PM swimangel72 wrote: Navygirl - my PS promised me a Diep - yet he took a \"small cuff of muscle\" when he dissected the perforators, which means I really had a \"muscle-sparing free tram\".........so you are right not to trust your PS. Mollydog - I discovered the truth about my surgery by obtaining the operative reports from the hospital - anyone can request their reports, they belong to you. I ended up asking for the reports after being encouraged to do so by my insurance company follow-up nurse (who was the best support person I had during my long ordeal). She would call me every two weeks and gave me fantastic advice. I started doubting that I received a true Diep when I saw a bulge just above my abdominal incision - my PS was so dishonest - he kept suggesting that I gained weight (I lost weight) or that it was \"post-surgical swelling\". After I saw my operative reports, I went to my PCP and he ordered a Cat scan. Even then, the radiologist did not see a hernia - but he did report on a defective abdominal muscle. Thanks to BethNYC here at bc.org, I went to a hernia specialist with my CD - he took one look at it, then showed me the scan on his laptop and said that it WAS a hernia - but a radiologist wouldn't notice it because the scan was taken while I was laying down. This surgeon had me stand up and cough while he placed his hands on the bulge - this was proof that I had a hernia - the cat scan showed that I had no muscle remaining on the right side where the PS took the perforators. I needed open abdominal surgery (which took place a year after my so-called \"diep\") and the hernia surgeon worked with a plastic surgeon to place a biologic mesh material - they also tightened up my muscles and supported the mesh so I should never experience another hernia again. Repeat hernias are common after hernia repairs, especially with mesh that isn't biologic. The mesh they used on me was called Strattice - made by the same company that makes Alloderm. This summer will be my first summer without surgery in two years - and I'm so grateful for BC.ORG and the wonderful people here who have helped me.   I hope my info has helped you - there's a lot of info here at bc.org about hernias - just do a Search - there's an article buried here somewhere where it states that women who have had prior abdominal surgery run a 25% increase risk of hernia after a Diep.......the risk for hernia after a muscle-sparing free tram is even higher. Good luck and I hope anyone who experiences a hernia after breast reconstruction surgery can find an experienced hernia surgery as wonderful as mine (Dr. George DeNoto - North Shore University Hospital in Manhasset NY on Long Island - he works with Dr. Ron Israeli a wonderful plastic surgeon who's practice is devoted to breast reconstruction. You can see his web site at www.breastreconstruction.org",
      "MessageIndex": 19,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749990",
      "Title": "HERNIA OR BULGING AFTER DIEP SURGERY Mollydog carmstr835"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 3, 2008 08:59PM - edited Oct 3, 2008 09:07PM by swimangel72 Renee - what is your complete pathology? Are you Her2+ or BRCA positive?  There are so many new treatments today for women with bc - my own attitude about mastectomy was totally influenced by women my mother's age.......times have REALLY changed a lot since then. I hope you'll slow down a bit and think this through very carefully. Have you spoken to an oncologist yet? You sound a lot like I was back in February when I was first dx'd............I had barely a month between my dx and my surgery. I let fear totally overcome my mind - and stubborn stoicism determine my decision. I really would have been fine with a lumpectomy and radiation - but was very fearful of radiation and so chose a unilateral skin-sparing masectomy followed by an immediate Diep. Well things don't always work out for the best.  I didn't get a Diep, I got a \"muscle-sparing free tram\" - and I got something I never anticipated - a MRSA staph infection in my abdomen, which caused about 8 inches of my incision to reopen. It needed packing 2 times a day for over 3 months. Now I have a very large abdominal bulge which is really a hernia (the staph ate away most of the muscle on my right side) I need more abdominal surgery to repair this with a mesh. And the new \"foob\" isn't great to look at - it'll be OK after Stage 2 and possibly Stage 3 surgery, but it feels heavy and fake - has no sensation at all. Also my belly-button is weird and I have no feeling in my skin around that area either. Of course you may end up with a totally successful surgery without all these problems - many women do - but you'll have to do a lot of research to get a very experienced plastic surgeon. I THOUGHT I had a very experienced Diep plastic surgeon -but even so I ended up with big problems. I also ended up with stage 1 lymphedema in my right arm...........fortunately I only had one breast removed, so my left arm is still useable for blood draws and my Herceptin tx. Having both breasts removed does increase your risk for lyphedema in both arms AND in your trunk.  So why put yourself through all this if a lumpectomy and rads have the same recurrence rates as mastectomy? Back when I made my decision - I didn't know that fact - I thought mastectomy had much lower recurrence rates - but newer studies show that's not true. At least give yourself a chance to see if a lumpectomy and rads will work for you. You can always get a mastectomy later on. I wanted to do something to \"put cancer behind me\" - and instead, my huge scars are a constant reminder of what fear can do to a person, more damage than my .9 cm stage 1 tumor should have done.",
      "MessageIndex": 32,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721847",
      "Title": "Should I have a full mastectomy? BooBee kjcsis"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 9, 2008 11:50PM swimangel72 wrote:",
      "MessageIndex": 1,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703511",
      "Title": "PICC line site sore 9 months later beth1225 beth1225"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 14, 2009 12:24PM swimangel72 wrote: Miriam I was following your other thread - so I'll stay in touch with you here now. Hang in there.........you and I have very similar signatures (except my tumor was Her2++++) - remind me, did you have chemo? Did your tumor show signs of vascular invasion? I'm really praying that your biopsy will be B9! Hang in there - and forget cleaning the house! Give yourself a break - go to the movies - go shopping - get your nails done - hang out with friends - try to have some fun to take your mind of all this nastiness!",
      "MessageIndex": 6,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743844",
      "Title": "Sense of Impending Doom mixed with Terror!! mshalto mshalto"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 29, 2009 07:58PM swimangel72 wrote: Snowflake - I wish I had seen my medical oncologist BEFORE I decided on my mastectomy with recon. My BS was very gung-ho about the mx - and very eager to have me do the recon.......I think surgeons are overconfident in their own powers to cure people with their scalpel. After all my staph complications, when the oncologist saw the condition of my abdomen, he said he wished he saw me first. He says so many women jump into surgeries so quickly without talking to the oncologist first. I just never even THOUGHT of asking to see a medical oncologist - the fear of cancer ruled my mind and heart and all I could think was \"cut it out now!\" So you are very smart to do your research now and find the best doctors, hospitals and treatment - be sure to get copies of ALL your scans and reports and keep them in a file. Hang in there - and may God's angels watch over you!",
      "MessageIndex": 8,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731591",
      "Title": "Just diagnosed - what should we look for in a doctor? Snowflake70 LindaYO"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 29, 2009 03:07PM swimangel72 wrote: I trust word-of-mouth referrals the most, but always have my brother-in-law (a cardiologist) check out my doctors credentials. Still I've stumbled across several doctors that were just \"not that into me\". No matter how good their credentials or reputations, some doctors are still losers - here's a checklist of how to spot a BAD doctor (wish I knew this last year!): http://nosurrenderbreastcancerhelp.org/page16/page14/page14.html WARNING SIGNS OF A BAD DOCTOR: Talks to you only in the exam room while you are undressed 2. Never looks at you when you are speaking, but rather, writes furiously in your chart not listening to a word you say 3. Has not reviewed your case at all prior to your visit. You know this because while you are perched on the iron table in your paper dress waiting for him, you hear him leave the exam room of another patient, then he is standing outside your door and you hear him remove your chart from the little cubby on the front of your door, flip through a few pages for 30 seconds and then he comes in. THAT is not PREP. Either come in and open the chart and talk or review it before hand at your desk in a proper way. 4. He doesn't wash his hands upon entering. He just left another exam room- do you really want him touching you? 5. He makes no eye contact, isn't quite sure of your name and simply goes through the motions of an exam. Or worse, never touches you. Never lays hands on you but writes up five prescriptions anyway. 6. He acts as if we are all the same person- more like cars in a body shop than human. Once he opens the hood of a Chevy it is the same as a Ford. 7. He doesn't let you speak, ask questions, or express your fears 8. He doesn't seem to care that you have cancer. There is no empathy. He either tells you he can \"cure you\" or he says off hand \"we'll see if this works\" 9. When you question him about wanting a test or a certain chemo he makes a face because you \"read it on the internet\". He then proceeds to inform you that anything you read is wrong and he is the only one who is right. 10. He has the same routine with everyone, never thinks of you as an individual. You can tell from the way he is talking it is a rote speech he has delivered thousands of times. But he never puts YOU into the speech. You can tell your particular case is of no interest to him-he has done this thousands of times, he would like you to just be quiet and listen to what he has to say. 11. You express a fear about your hair falling out and he makes a joke and tells you to stop being vain. 12. He doesn't take into account the quality of your life when he is lining up one harsh treatment after another. 13. If you ask him about a side effect he says it \"goes with the territory\" 14. He makes you wait-not just in the waiting room but even in the exam room where you are left there waiting and waiting. At least in the waiting room there were magazines to read! Once in a while, and if an apology is given then it is fine, but every time with no apology is unacceptable 15. He is unavailable for after hours emergencies. OR if you finally do get through to him, he insinuates that you \"bothered\" him for nothing 16. He won't share your case and what he feels needs to be done with your other doctors. 17. He never calls you with test results. 18. He thinks you are overreacting and might need some kind of counseling, anti-depressant, tranquilizer, etc. or you have fibromyalgia-when if he took five minutes to put your mind at east you wouldn't need anything. 19. He won't let you bring your husband, brother, sister, or best friend in with you to discuss your case- all you are doing is taking up too much of his time. 20. He doesn't remember you. After six months of chemo he still has no clue who you are.... Don't wait six months to discover this. Six minutes will tell you a lot about your doctor!",
      "MessageIndex": 3,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/731591",
      "Title": "Just diagnosed - what should we look for in a doctor? Snowflake70 LindaYO"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 31, 2008 08:34PM swimangel72 wrote: Thanks for posting this article Bald - perfect timing for me since my onc was trying to order Procrit for me to have on hand since my hemoglobin had been dropping - fortunately for me, it never got below 11. I'll be printing this article out to keep on hand - some of my tiredness is due to low thyroid. They wanted me to start on that medication too, but I refused until the endocrinologist researched the connection those meds have with an increase in breast cancer recurrence. He never heard about that but was very interested  - it's amazing how much grass-roots information we need to supply to our own doctors!",
      "MessageIndex": 11,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/718830",
      "Title": "Procrit and Aranesp Ordered to Change Label rock swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 1, 2008 05:48PM swimangel72 wrote: Thanks Otter for sharing that info.........I've been thinking the same thing - that all the meds I've been on since this started last March is probably what caused the change in my TSH numbers, so I'm content to just \"watch and wait\". Still - here's the link to a recent abstract from the American Society of Clinical Oncology that shows women who have hypthyrdoidism have a LESS aggressive form of breast cancer - which made them state at the end of the abstract:  \"Prospective studies are required to confirm these findings but in the interim we suggest caution in the TH supplementation of hypothyroid BC patients per ATA consensus guidelines.\"  So while the jury is still out, I'm not about to start on any thyroid meds just yet! (I forced a return to keep this link from messing up the view of this thread - so you'll have to cut and paste the entire thing to make it work right.) http://www.asco.org/ASCO/Abstracts+&+Virtual+Meeting/Abstracts? vmview=abst_detail_view&confID=55&abstractID=31728",
      "MessageIndex": 13,
      "PostDate": "01/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/718830",
      "Title": "Procrit and Aranesp Ordered to Change Label rock swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 18, 2009 03:26PM swimangel72 wrote: MED - I responded to your other thread where you stated that your tumor was Her2 equivacol. It's extremely important to find out your Her2 status - your tumor sample should have immediately been sent out to a lab for a FISH test. Here's a link explaining about the FISH test: http://www.breastcancer.org/symptoms/testing/types/fish.jsp If your tumor turns out to be Her2+++ your onc should recommend chemo with Herceptin. Her2+ cancers are very aggressive no matter how small. If your onc isn't pursuing the FISH test you really need a second opinion. Good luck!",
      "MessageIndex": 4,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/734143",
      "Title": "Positive node but no chemo MED swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 5, 2008 10:03AM swimangel72 wrote: I get the early-morning tears, always when I get ready for a shower. This is when I look at myself completely in the mirror and feel down - I didn't lose my hair, but it is thinner. My abdominal scar has finally healed, but it remains a bright angry red, and feels like a tight band across my belly. My new \"foob\" is still too big and too flat - and my PS won't do Stage 2 until I finish my Herceptin next April. And my port scar is an ugly two inch scar - with an added \"dimple\" scar high in my neck. However - my sense of identity is tied to other people's view of me, rather than my own view of myself in a mirror. Thus I do much better when I'm engaging in conversation with people, or get busy helping people. Part of my problem is I'm just not involved enough with people outside my family - so the walls seems to close in and I get a lost feeling. Thus, I hope my feeling of \"self\" will return when I return to work in September. Still, I have lost a lot of my old zest, though I understand that this too is a process. Perhaps it has allowed me more quiet time to rethink my priorities. I haven't returned to work since my surgery back on March 3rd - and now the school is closed for summer. I stayed involved with everyone through emails, but so much time has passed, I feel disconnected from my old co-workers and my old job. I'll be returning to work in September - but it seems unreal, like it won't be the same. I'm nervous about returning and having everyone look me up-and-down and asking me a million questions. Part of me wants to quit my job and start something new - the other part is grateful that my job is waiting for me. The bottom line is - I am a changed person. For better or worse - there's no going back. But I need to stay mindful that all change is difficult. Life is nothing but change. So often I feel like a lump of rock........and the good and bad events in my life are like a river pouring over me, day after day, smoothing out my rough spots, making me harder, shinier, more resilient.......hopefully turning my rock-hard soul into a jewel that, at the end of my journey, would be bright enough to be picked up by God.",
      "MessageIndex": 9,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708505",
      "Title": "Identity and late-night tears LorenaB cp418"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 23, 2009 02:59PM swimangel72 wrote: Miriam I'm shocked to hear this news! I too figured it would be something else........I hope they find out where it came from - I'll be praying that God's angels watch over you!",
      "MessageIndex": 11,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/744315",
      "Title": "Horrible News re Swollen Groin Node mshalto mshalto"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 2, 2008 02:13PM swimangel72 wrote: Sazylazzy - my mastectomy and reconstruction is scheduled for tomorrow........let's both report back here soon with glowing reports!",
      "MessageIndex": 4,
      "PostDate": "02/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701425",
      "Title": "Surgery tomorrow! sazylazzy KiminJax"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 11, 2009 09:44AM swimangel72 wrote: Great thread - thanks for starting it! My four months of chemo went very well but I was on a \"light\" chemo of Navelbine and Herceptin every two weeks. I wish I knew that a chemo port was unnecessary ............that with the right infusion nurse, who used saline along with the Navelbine, my veins worked just fine. I ended up with a port, but it never healed and after only a month it needed to be removed - so now I have an ugly scar which was totally useless. Also - thanks to these boards, I read that not everyone needs pre-meds. When I switched oncologists after a month, my new oncologist gave me steroids and an anti-nausea medication before my chemo. It caused the most awful constipation and tummy pain! Next time I told them forget the pre-meds - I was fine with just the Navelbine and Herceptin - I'd rather deal with the diarrhea all that night than suffer for three days with constipation! I was lucky my infusion nurse was an angel and a good communicator...........we never had any problems after that. So my #1 advice to everyone is - communicate with your nurse - learn to understand your own body's reaction to drugs. Research everything you can beforehand..........and be prepared for the unknown for our bodies are unique and special!",
      "MessageIndex": 1,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/733975",
      "Title": "What we wish we had known about chemo before we started! ddlatt kerry_lamb"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 28, 2008 05:30PM swimangel72 wrote: I don't know about everyone - but I got \"a little\" in my arm too and have been seeing an LE therpist for the past month. She said it's very mild - but measures at Stage 1 - so she's fitted me for a compression sleeve and gauntlet (a finger-less glove) which I'll need to wear if I fly or if I do any exercise with that arm. I had 2 lymph nodes removed under my arm (sentinel lymph nodes) and 5 removed during the mastectomy - so that increases my risk. My therapist is excellent - she does massage therapy and has taught me exercises to do at home - her motto is \"better be safe than sorry\", thus we are working on preventing the lymphedema from getting any worse.",
      "MessageIndex": 1,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/706356",
      "Title": "Does everyone get lymphedema after a lot of nodes removed? tomatojuice bomber410"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 30, 2008 05:49PM swimangel72 wrote: There are so many wonderful plastic surgeons - I hope you'll get a second opinion before deciding. My ps spent about 90 minutes with me going over all the different options - even playing a movie for me and giving me a free book about reconstruction. I will say that after my unilateral mastectomy and Diep on March 3rd my recovery is taking much longer than I expected........due to developing a staph infection. I ended up spending an extra 11 days in the hospital. I still have bandages on my \"tummy-tuck\" area - and can't stand up straight or walk for very long. I am finally finished with all the antibiotics and pain meds. So my advice is to take your time deciding and be 100% sure before proceeding - you'll need all the mental strength you can muster to help you recuperate.",
      "MessageIndex": 2,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/703097",
      "Title": "Bad PS visit made me reconsider reconstruction Sable Vz_mom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 31, 2008 01:24PM swimangel72 wrote: Thanks Sandy - I never saw that video - it brought tears to my eyes too!",
      "MessageIndex": 10,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/703097",
      "Title": "Bad PS visit made me reconsider reconstruction Sable Vz_mom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 21, 2008 01:05PM swimangel72 wrote: I'm sending you a big hug and a TON of prayers Stephanie...............could you get a pain pump? I hope your onc can give you more suggestions - and that your mom can stay with you a while!",
      "MessageIndex": 27,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721550",
      "Title": "Morphine all day everyday - Things are getting serious TripleNeg lewisfamily503"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 13, 2009 10:08PM swimangel72 wrote: MapleTree - thanks for your \"calm energy\" - I appreciate it! And your surgeon sounds amazing........and I think he's right on the mark saying that the output should be 15cc's or less to reduce the risk of seromas. I'm happy to report that my PS removed my drain today (for the 2nd time) - it's output was 22cc's once-a-day for a week and he felt confident that it could be absorbed by my body. I'm really  keeping my fingers crossed that he's right! The other good news is he told me in 48 hours I could go swimming - including my lap swimming, yay! I know the water pressure helped reduce my LE in my right arm last year - and the exercise will also help. Oh and MapleTree you're also right - that my drain was NOT really painful..........the \"pain\" was more mental in my impatience to get rid of it.........and in the annoyance of showering and dressing. The drain removal was completely pain free this time - so I hope other people won't be frightened - it is a big nuisance but a necessary one as you heal from surgery.",
      "MessageIndex": 11,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 25, 2009 04:13PM swimangel72 wrote: Thanks MapleTree for making me laugh- you have a great sense of humor!",
      "MessageIndex": 14,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 14, 2009 10:18AM swimangel72 wrote: Hi Bess - I had a unilateral free-tram and have a circle shaped flap the size of my old areola - the mastectomy was performed through this hole and through the incision for the SLN. I'm not happy even with this circle, it seems to flatten my breast more than it should. Since the reconstructed breast is too big, too flat, and too fat under my arm, and because of communication and other problems with my original PS, I've switched to a new PS who only specializes in breast reconstructions. He'll be doing major revisions on me - going in through the same scars, removing the flap from the chest wall, repositioning it higher, making it smaller to match my B cup natural breast on the other side and hopefully removing the circle all together. I know there's another woman on this site who had major revisions done to her bi-lat breast reconstructions by travelling to NOLA........her photos are on TimTam's photo site - her revisions took several surgeries, but her large foot-ball shape scars are gone and her breasts are beautiful! Maybe she'll post here to give you some advice. Sometimes you need to get a second opinion by another PS in order to get the results you want if your original PS doesn't have an open mind. Good luck and I hope you'll get the results you want AND deserve!",
      "MessageIndex": 9,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/728984",
      "Title": "DIEP Surgeries BessB BessB"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 6, 2009 10:54PM swimangel72 wrote: Wow - what an awful ordeal for you! I'm assuming your drain is gone now? Did you ever see an infectious disease specialist for the staph - or go see the special doctor in Upstate NY? After reading about all the travels the NOLA girls have made, I've come to realize that travelling may be necessary in order to get the best care we need (if one can afford to travel). I hope you're not uncomfortable - and I'm sorry for complaining about my drain - compared to you, I have NOTHING to complain about!",
      "MessageIndex": 2,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 20, 2009 03:23PM swimangel72 wrote: Geneva - the same thing happened to me. My surgeons and onc told me that since my tumor was \"only\" Stage1 and Grade1 I would only need Arimidex for five years not to worry. Even when my Onoctype DX came back at 22 my onc said it was low enough that I wouldn't need chemo, but \"wait a minute, what's this? We didn't get the results of your Fish test yet? Hold on while they fax it over............oh oh, bad news, you DO need chemo after all - your tumor is Her2+++ - you'll need Herceptin every two weeks for a YEAR - oh and even the \"light\" chemo we're giving you can destroy your veins, so you need a port too, so sorry.\" WHY don't our surgeons and oncologists WIAIT until they have the ENTIRE pathology report before trying to \"reassure\" us that we don't need chemo? I truly felt like I had the rug pulled out from under my feet - a second time! This was almost as bad as finding out I had BC! Ok - sorry for my rant - you are NOT alone Geneva - and if in doubt, get a second opinion on EVERYTHING!",
      "MessageIndex": 6,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/736226",
      "Title": "What do you know about the \"oncotypeDX\" test? genevajap Seabee"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 3, 2009 01:22PM swimangel72 wrote:",
      "MessageIndex": 43,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/727488",
      "Title": "Happy New Year + Update HeatherBLocklear AnnNYC"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: I'm SICK of drains! Was so relieved two weeks ago when my PS removed my abdominal drains, only to end up with fluid under my skin next to my belly-button......pushing on the skin made it move like a water bed, yuck! So on Tuesday the PS put a new drain back in - immediately 350cc came out, which flattened my tummy beautifully, but now I'm stuck with this pain of a drain for who knows how long, sigh. Since Tuesday it's still outputting about 50cc every day, and the nurse told me today I'd definitely need to keep it in over the weekend and to call her Monday.Next Thursday the 13th I see my general surgeon (who did the hernia and gall bladder surgery with the PS) - I'm PRAYING the output will be zero by then and he'll remove it. We're going on vacation Saturday the 15th and I do NOT want to be stuck with this drain! It's been nearly a month since I had the surgery and I'm so so tired of everything. I do realize how lucky I am to have found such fantastic surgeons who could repair my large hernia - and I thank God I didn't end up with another mrsa staph infection........and I am sooo happy that large hernia/bulge is gone and that my incisions are healing well and my tummy is feeling less and less tight each passing day............but this YUCKY drain is getting me down and for some reason I feel more tired. I see my oncologist on Monday - I hope my blood work is OK. Does anyone know if excess blood/fluid loss because of a drain causes anemia? I can't find anything online about that. Sorry for whining - I feel better already having gotten this out of my system. Now if only I could get this DRAIN out of my body! 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 9, 2009 01:20PM swimangel72 wrote: Thanks so much Hollyann - hugs back to you - hope you're feeling OK too!",
      "MessageIndex": 7,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 9, 2009 01:39PM swimangel72 wrote: Me1ani - aren't you SICK of measuring the output? I'm also sick of hanging my drain from a long shoelace around my neck when I shower. Are you able to shower? I know some surgeons insist on sponge baths only. I should warn you - they removed my drains when there was only 25cc's of output, and I still ended up with fluid under my skin........later, after they took out 350cc of fluid in the PS's office, his nurse said \"the other surgeon shouldn't have removed your drain until it was nearly dry.\" I TOTALLY trust this nurse (she's been right before) and was sorry she hadn't been in the office when they first removed my drains. ANYWAY - I hope your drain comes out soon too.........I'm not far from Connecticut - we shop at the Danbury Mall (which is 30 mins from my house). It'd be great to meet up with you someday! Sailorgirl - thanks so much for your kind words - and if my PS removes my drain on Thursday you can bet I'll take it easy (learned the hard way already!) Both my college-daughters will be home by then, so I'll be delegating a lot of the packing to them! BTW - my SIL just flew back from the airport in Sarasota - they have a condo near there (one of the islands in the Gulf - about 20 minutes from the airport - I'll have to find out the name of the island.) She LOVES her condo and shopping in Sarasota - I haven't gone yet, but maybe this winter!",
      "MessageIndex": 9,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 9, 2009 01:04PM swimangel72 wrote: Thanks so much Melani for your offer of a care package - your words themselves are a wonderful care package! I'm an hour north of Manhattan - are you in the city?  I'm feeling much better - yesterday we drove 3 hours north to visit my brother and his family to celebrate my nephew's successful year in Tokyo as an English teacher. He's returning again in September - it was wonderful to see everyone. My thinking was - I'm sitting in the car and sitting at their house, what's the difference if I have a drain? I was able to keep the drain well hidden under a pretty, long, \"flowy\" blouse.........and I hardly felt tired at all. The output is down to 25cc's for the past two nights..........I'm keeping my fingers crossed that by Thursday, it'll be less than 5ccs so my surgeon can remove it then. We leave for vacation on Saturday - and I do NOT want to take the drain with me - I've other fun summer toys to take - the drain is NOT invited!",
      "MessageIndex": 4,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 23, 2009 06:56PM - edited Oct 23, 2009 06:57PM by swimangel72",
      "MessageIndex": 16,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 22, 2009 05:58PM swimangel72 wrote: Will it ever end? I don't want to complain, but feel compelled to report to my sweet sisters that I have yet ANOTHER drain in my abdomen! Yesterday I had a seroma drained at the hospital under ultrasound (very cool watching the video screen - like watching a balloon deflate). I'm hoping this drain will come out next week, but I've learned my lesson...........and unless the output is totally ZERO, I'm going to tell my PS to leave it in, sigh. The amazing thing is how flat the right side of my stomach is (where the large hernia was).........so it was very disappointing to watch this hard egg on the left side of my stomach grow larger and harder. I thought massage might help, but it did nothing but make it get larger. A cat scan showed the seroma clearly...........the radiologist who aspirated it said it's actually the beginning of a hematoma, because it was mostly blood that was removed. Fortunately it was very fluid - so that means it wasn't a true hematoma. Sorry if this is a gross subject..............I'm so so tired of problems with my stomach!",
      "MessageIndex": 15,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738530",
      "Title": "Drain pain! swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 26, 2008 08:15PM swimangel72 wrote:",
      "MessageIndex": 6,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704596",
      "Title": "Could I really be done? Kathy_K lvtwoqlt"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 25, 2008 11:14AM swimangel72 wrote: Abrede - I'll be praying you'll come back to us and say, \"it's B9!!\" If it's not, I'd recommend immediately finding a reputable breast cancer surgeon. My cousin (a nurse) had BC about 10 years ago - she was the first person I called for advice and she immediately told me to steer clear of general surgeons - to use only a BC surgeon. A breast center would be even better if you have one near your home. Things can get very complicated very quickly if your tumor comes back positive - dealing with so many different decisions, doctors, tests, and reports can be much easier if it's controlled by a BC center group. Good luck - and let us know what happens!",
      "MessageIndex": 8,
      "PostDate": "25/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705935",
      "Title": "It's all happening so fast.. abrede Looneymom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 17, 2010 03:32PM swimangel72 wrote: Julia - I'm glad you are no longer coughing and that you can have surgery tomorrow. The nurses tomorrow should still be taking your temperature just prior to surgery - be mindful that clear lungs do not necessarily mean you are 100% well. The nurses know best...........if a nurse even makes the tiniest suggestion that you are not well enough for surgery, listen - then don't hesitate to reschedule, even at the last minute. I hope that doesn't happen however - good luck - and let us know how everything goes!",
      "MessageIndex": 11,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 21, 2010 09:54AM swimangel72 wrote: Julia - sounds like you did have angels watching over you in the OR! I'm so happy your surgery is over - and I'll be praying you heal well!",
      "MessageIndex": 14,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 9, 2009 12:06PM swimangel72 wrote: HI Nancy - you may hear from the NOLA girls who will tell you all that was included with their normal hospital stay, lol - but that's the difference I've found between New York City and the rest of the world no matter what services we are looking at.  I see that Dr. Mark Smith will be performing your surgery - which is great! I heard wonderful things about him! I'm assuming Beth Israel doesn't normally offer private rooms My surgery was done at Northern Westchester Hospital - and I was in intensive care for 24 hours while they checked the doppler - then I was in a private room - ALL their rooms are private rooms with private baths (which impressed the heck out of me at my initial research stage)..........I ended up with MRSA anyway (because they consider themselves a \"teaching hospital\" and plenty of student nurses were coming and going into my room - a few even did blood draws on me - every one was going \"wow what a unique surgery you had\" (that eventually raised a red flag in my mind that they didn't have that much experience with Diep/free-tram patients). ANYWAY..........I'm sure your insurance will pay their portion of your hospital visit - so the question to ask is how much money is the difference? In a way - you DESERVE to treat yourself to this \"vacation\" while you can.........it will give you a better overall experience (someone did say they weren't too thrilled about the nursing care at Beth Israel, I forget who.........under one of the discussions about Dr. Smith).........so I'd say GO FOR IT GIRL! And may God's angels watch over you and protect you during this time - I'll be praying for you!",
      "MessageIndex": 2,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745138",
      "Title": "Luxury suite anyone? NancyD cakeisgreat"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 9, 2009 12:53PM swimangel72 wrote: Nancy - the antibacterial hand disinfectant is a good idea - but ALL hospitals should now be providing an automatic dispenser at the entrance to each patient's room - even in the regular rooms. Be sure to check out www.hospitalinfection.org for the 15 ways you can help yourself avoid hospital acquired infections. They also now list the New York State hospitals and their infection rates - maybe Beth Israel is in there somewhere. I hope you're feeling well - stay clear of holiday crowds so you don't pick up any colds or germs prior to your surgery - and even if you feel sick the day before surgery, be sure to call your PS to let him know. Better to postpone surgery until you feel better than go through what I did!",
      "MessageIndex": 6,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745138",
      "Title": "Luxury suite anyone? NancyD cakeisgreat"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 14, 2009 11:30AM swimangel72 wrote: Oh Kalyla I only just saw your thread! I'm so sorry you're still going through so many painful and difficult times with your tram flap! I remember when my chemo port was slightly infected, the oncologist put me on Keflex - but as soon as Dr. K saw it, he immediately switched me to Levaquin - he said Keflex just isn't strong enough when you're on chemo. My only advice is stuff you already know - be sure you're getting enough protein in your diet and take extra vitamins...........and ultimately, if things don't improve, try to get a second PS to look at your situation. Second opinions are usually covered by insurance companies -  maybe you can find a reputable PS closer to home.  I'll PM  the name of my certified LE therapist in White Plains who was absolutely WONDERFUL! I hope you'll get relief soon Kalyla - I'll be praying for you!",
      "MessageIndex": 8,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/727685",
      "Title": "bright red area on foob kalyla swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 18, 2009 03:19PM swimangel72 wrote: MED - your diagnosis is similar to mine - my tumor was also Her2 equivacol  but I had no positive nodes. My Oncotype score was 22 - and at first my onc said I wouldn't need chemo. Ten minutes later, he finally received my FISH report - and immediately changed his mind - because the report showed the tumor was Her2+++.  I had to go on a \"light\" chemo regime of Navelbine for 4 months with Herceptin continuing for a year. I didn't lose any hair or experience any heart problems. My onc told me that Herceptin could not be given alone but it worked well with Navelbine. Has your tumor sample been sent out for a FISH test? Most Her2 equivacal tumors must undergo the FISH test to get a definite answer. This will finalize the decision for you - if your tumor IS Her2+ then I'd be very very surprised if your onc still tells you no chemo - and I'd immediately seek out another opinion. Good luck with your difficult decision!",
      "MessageIndex": 19,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/734116",
      "Title": "oncotype DX test MED lynninpa"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 7, 2008 11:45AM - edited Jul 7, 2008 11:46AM by swimangel72",
      "MessageIndex": 50,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 6, 2008 10:38AM swimangel72 wrote: Since my very first mammo in 1991, my right breast showed calcifications. Back then, the radiologist and my ob/gyn acted like that was normal and just said to come back in a year. Well, I never assumed anything bad could happen, so for the past three years, I was negligent in getting my mammo's - and low and behold, my mammo in January showed IDC..........so I tell everyone to take calicifcations very seriously. It doesn't mean that they automatically turn into cancer, but they CAN so do whatever your radiologist recommends to be safe. Good luck Heartbroken......and don't worry, yours can turn out to be fine. It's just best to keep a close eye on anything happening inside your breast - we're all here to help you if you have any more questions.",
      "MessageIndex": 2,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703482",
      "Title": "CALCIFICATIONS??? heartbroken1 leaf"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 13, 2010 11:14AM swimangel72 wrote: Julia - learn from the mistakes made on me by my surgeons and anesthesiologist - I too had the beginning of bronchitis - my surgeon put me on an antibiotic 4 days prior to my surgery which seemed to do the trick. Then on the morning of surgery the nurse took my temperature (in my ear) which registered 100.6...........yet because my lungs were clear, the anesthesiologist gave the green light to proceed. I had a 7 hour surgery (uni-lateral mx with immediate free-tram recon)......was released from the hospital after 4 days..........2 days later I was coughing my lungs out, killing my stomach and breast, and had to return to the ER because of severe congestion, shortness of breath and pain. THey admitted me and I was stuck there for 2 more weeks on IV antibiotics to fight off a MRSA staph infection which took hold in my lungs and abdomen. My abdominal muscles were desetroyed by the MRSA...........which necessitated opened abdominal surgery a year later to insert a mrsa-resistant mesh. I am only now getting my strength back. So - as you can imagine - my advice to you is fight your bronchitis now and do NOT undergo surgery until your immune system is back to peak performance. Do not risk getting a mrsa or c-diff infection (they are becoming extremely common). Check out www.hospitalinfection.org for more information on how you can protect yourself. Good luck with everything!",
      "MessageIndex": 6,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/748295",
      "Title": "Should I Postpone? Julia257 Julia257"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 7, 2008 11:50AM swimangel72 wrote: You ladies are so wonderful - thank you for your honesty, wit and wisdom!",
      "MessageIndex": 51,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708370",
      "Title": "What I hate MOST about being bald! HeatherBLocklear dhettish"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 22, 2009 03:04AM - edited Jun 22, 2009 03:05AM by swimangel72 I got my period late (nearly 15) had three children and breastfed them all, had an early menopause (48) and still ended up with triple positive IDC. I was so low risk it confounds me - so much that I don't trust any studies or statistics at all........thus I went for the \"big guns\" and had a mastectomy and a year of Herceptin. My risk for getting BC was lower than my risk for a recurrence.............so of course, I'm quite nervous that I WILL get a recurrence or mets no matter what the studies say!",
      "MessageIndex": 11,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736200",
      "Title": "Just a Weird Though Irishred PanamaBound"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 9, 2008 05:03AM swimangel72 wrote: Hi Apple - I totally agree with everyone here, but I see that you are already in agreement too. Thank God for that! The only other suggestion I have is to try to EDUCATE your husband about breast cancer. When he says you're spending too much time online - tell him you are RESEARCHING your disease. Use the word \"disease\" - I'm finding some men act like BC is nothing more serious than a bad case of acne. They have heard so many \"success\" stories - that they think \"no big deal\". Has your husband gone with you to your doctor appointments? Your doctor could sit down and explain to him your risks of recurrence should you choose to do nothing. Some doctors are afraid to spell out in dirty detail what actually happens at the end of BC..........so print out the scary scene flyrzfan posted above and show him. Also - if your doctor or nurse can give you written details about what your treatment will be - how long - the side effects - it should help you make realistic plans. I am one who really believes in planning ahead - especially on this roller-coaster ride - better to sit in the front seat with your eyes wide open to see what's coming than cower in the back! Good luck Apple and stay in touch with us here!",
      "MessageIndex": 21,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705034",
      "Title": "can I give up? Appleg8 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 31, 2008 12:35PM swimangel72 wrote:",
      "MessageIndex": 33,
      "PostDate": "31/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 9, 2009 05:36PM - edited Jun 9, 2009 05:36PM by swimangel72 Have you received your pathology report and talked to a medical oncologist? Usually your treatment plan is determined by the oncologist, not the surgeon. Also you can't assume just because you get a mastectomy that you won't need chemo - you probably won't need radiation, unless the tumor was close to your chest wall. Lumpectomy with radiation is equal in survival AND recurrence rates to mastectomy. I thought that my mastectomy would be enough (considering my tumor was \"just\" Stage 1 and Grade 2 - but later, to my dismay, learned taht I still needed chemo when the FISH report showed that the tumor was Her2+++. My advice is - do NOT make any hasty decisions - make an appointment with a medical oncologist before deciding what kind of treatment, including surgery, that you need. Be sure you understand your pathology report - and if necessary - get a second opinion from another oncologist. Good luck and let us know what you decide to do!",
      "MessageIndex": 3,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735600",
      "Title": "Am I choosing the right treatment? ssimmons66 achen2iron"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 8, 2008 03:07AM swimangel72 wrote:",
      "MessageIndex": 1,
      "PostDate": "08/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719225",
      "Title": "How long after chemo before your nails start growing again? VBG evans"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 26, 2009 08:27AM swimangel72 wrote: me1ani - I had 3 c-sections without any problems, but then again, time erases many of the bad memories I think. Also having a new baby to care for is such a joy, that I didn't nurse my wounds for long........I'm sorry you had a bad experience with your c-section - but I want to reassure you that anesthesia and pain control has come a LONG way in 10 years! Be sure your anesthesiologist talks to you before you enter the operating room.........tell him/her about any prior bad experiences with anesthesia and pain control. From all I've read here at bc.org, a mx is much more tolerable than a c-section - still you are 10 years older and fighting  BC, so your fears are normal. What helped me was doing the Lamaze breathing techniques prior to my surgery and especially during and after my sentinel lymph node blue dye injection (which I was forced to have without any pain meds or numbing cream.) Believe me - the Lamaze puffs of breath REALLY helped me not to focus on the pain! Relaxing music and visualization techniques also help........I brought a photo in of my kids and I kayaking on Lake George........the green mountains and blue water and smiles REALLY helped me! Praying the rosary for several days before my surgery also helped me - I kept reminding myself that my suffering is NOTHING compared to what others have to endure on planet earth - what Mary had to suffer. I kept reminding myself that I was STRONG - and so relieved that I'm the one going through this and not my daughters or son or DH. I'll be praying for you - to stay strong and relaxed - hang in there - we're all here for you!",
      "MessageIndex": 13,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/737976",
      "Title": "nervous about my mastectomy... me1ani anne26"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 10, 2008 03:55AM swimangel72 wrote: Diet AND exercise is the best way to go - one helps the other. And once you do start losing weight you'll feel so much more energized that you'll be able to do more. Your walking will then naturally turn into a part run/walk exercise which will burn even more calories. Good luck - and keep us in the loop with your progress - I need some inspiration myself to lose about 30 pounds!",
      "MessageIndex": 4,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/720921",
      "Title": "Healthy weight to lower risk alohamomof3 NancyD"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 15, 2008 01:46AM swimangel72 wrote: Julee I'm sooo happy you can exit the 'ol rickety wooden roller-coaster! Way to go!  LOVE that picture LUV!!!",
      "MessageIndex": 12,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708819",
      "Title": "Back on the Roller Coaster Sooner than I thought! julz4 leaf"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 9, 2009 06:13PM swimangel72 wrote: Ssimmons66 - you do not have to rush your surgery. Unfortunately I didn't know that - I didn't meet an oncologist until I was already in the hospital recovering. After all my complications with the mrsa - my oncologist said it's unfortunate that the surgeons don't send them the patients FIRST - he would have recommended just a lumpectomy with rads for me and I could have avoided so many problems. If you need to cancel your surgery in order to make time to see a medical oncologist - do it! You should at least have a copy of your pathology report in your hand before surgery.........oh, and ask your surgeon to get a second opinion on the pathology report too. My breast cancer surgeon said he never performs surgery without a second OUTSIDE opinion on the reading - because pathology labs have made errors in the past.",
      "MessageIndex": 8,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735600",
      "Title": "Am I choosing the right treatment? ssimmons66 achen2iron"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 8, 2010 10:48AM swimangel72 wrote:",
      "MessageIndex": 13,
      "PostDate": "08/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/746451",
      "Title": "Hiding over here while the rocks fly my way... Running_Violet kim40"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 6, 2008 08:08PM swimangel72 wrote: Hi Jax - one of my biggest concerns was \"when to tell the kids\". My son is 15 and he figured it out on his own since my dh took me twice to the doctors and I'm never sick. My two daughters live away at the same college, so I waited to tell them in person when we were up to visit. After a nice dinner at a great restaurant, I told them both - my oldest daughter's boyfriend was there, so he was a great support for her. It broke my heart to see my sweet kids so nervous and upset for me, but I gave them all the \"good\" news - you know, \"we caught it early\" - \"I'm attacking with the big guns\" - etc etc. My second chemo treatment is tomorrow morning - but I've been told I won't lose my hair. My tumor is Her2+ and yet only Stage 1, so I'm on Herceptin and Navelbine. Do you have a complete pathology report on your cancer? There's tons of information on this web site, thank God I found it early in my treatment! Good luck Jax - you'll get through this - hang in there - we'll all on this roller-coaster ride together!",
      "MessageIndex": 5,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705148",
      "Title": "Surgery next week! Vinogal swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 20, 2009 02:44PM - edited Jun 20, 2009 02:51PM by swimangel72 Hi - I'm sorry you'll need chemo - it was very depressing to me when I also found out I needed chemo (especially after already going through a mastectomy). My Oncotype DX score was 22 - what's yours? There a thread here somewhere listing everyone's score -  you can put \"Oncotype DX\" in the search field to find it. Also - here are two links with expert info here at bc.org about Oncotype DX: http://www.breastcancer.org/symptoms/testing/types/oncotype_dx.jsp http://www.breastcancer.org/symptoms/testing/new_research/20060126.jsp Good luck and I hope you get all the answers you need to your questions!",
      "MessageIndex": 1,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/736226",
      "Title": "What do you know about the \"oncotypeDX\" test? genevajap Seabee"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 3, 2009 06:45PM - edited Mar 3, 2009 06:49PM by swimangel72 Karen I'm surprised that your onc was able to order the Oncotype DX for you since your tumor is already Her2+. Some insurance companies won't pay for Oncotype DX in your case since it's assumed you ALREADY have a high risk for recurrence due to your Her2neu status. For more information (including the suffering of ladies with mets) go to http://www.her2support.org/. You can also watch the move Living Proof which is the inspirational story of Herceptin http://www.youtube.com/watch?v=rvtVC1oOPyw As you can see - I rather TRY to prevent a recurrence of BC than deal with mets down the road. Yes heart attacks are the number 1 cause of death - but once you've been dx'd with BC, especially HER2+ bc, the odds are MUCH higher that you will die from BC. Good luck with your decision.",
      "MessageIndex": 28,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 3, 2009 07:42PM swimangel72 wrote: Jamie I agree that a second opinion is a good idea - but why not wait until your Oncotype DX score comes in, then you'll have a better handle on your personal recurrence rate. I know of a few women on these boards who were like you with Stage 1 and Grade 1 Her2- tumors who were shocked at their high Oncotype DX score. It is very strange - but it does happen, so I'll be thinking of you and hoping you get a really really LOW score! Let us know when it comes in.",
      "MessageIndex": 32,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 4, 2009 07:41PM - edited Mar 4, 2009 07:47PM by swimangel72  I just want to tell Karen I'm praying for her to get through her surgery without any complications and that she'll get a clean lymph node report! No matter what you decide to do Karen, I'm sending you healing wishes and hugs!",
      "MessageIndex": 53,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 23, 2009 05:55PM swimangel72 wrote: I'm confused - if you had a double mastectomy with \"clear margins\" how is it possible for you to still have a 1.4cm IDS tumor and DCIS left behind? Are they stuck in the chest wall muscle?",
      "MessageIndex": 1,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727881",
      "Title": "Help me out ladies... PeaceCat mawhinney"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 11, 2009 08:14PM swimangel72 wrote: Karen I'm so happy your surgery is over and that you had negative nodes. I won't be posting here any more however because I have said all I will say about the benefits of fighting Her2+++ cancer with Herceptin. At this point in time - you need to get those 2nd and 3rd opinions from different oncologists, but I have a feeling no matter if they all agree, you'll still refuse chemo. Your fears about chemo are not specific to the chemo regime that would be tailed for you. Not all chemo txs are the same - and not all patients experience all the worse side effects - and certainly, not all side effects are permanent or deadly. Her2+++ cancer is deadly however if you get a recurrence or mets. To get real answers to your questions - as I've said before - you should visit the www.her2support.org web site - and meet the women there who had tumors the same size and grade as yours, who weren't able to get Herceptin and who now have mets. It will help you to think more clearly and with an open mind - and to visualize a future you CAN control now if you make the correct choices. Good luck and may God's angels watch over you!",
      "MessageIndex": 74,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 12, 2009 06:25PM swimangel72 wrote: I didn't get antibiotics - and I ended up with a MRSA staph infection in my lungs and in my abdomen. For 3 days prior to my mx and free-tram, I was on Levaquin to battle the beginning of bronchitis. After that - nothing.......and thus began my long sad story of getting MRSA.  The use of certain antibiotics prior to surgery can actually make your immune system MORE susceptible to MRSA.........I don't know about C-diff though. Check out the information at the following web site to learn more about all hospital-acquired infections..........I suspect many women with infections of their implants are actually suffering from hospital acquired infections of one sort or another: http://hospitalinfection.org/",
      "MessageIndex": 13,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730228",
      "Title": "after surgery antibiotics Andy17 samiam40"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 22, 2008 10:05PM swimangel72 wrote: I'm happy the lumpectomy is behind you now Kira - and hope you'll feel better in the next few days. Don't push yourself - now's the time to take it easy and be kind to yourself. I hope your oncotype dx comes in with a very low number - and that you can put your worries aside in order to enjoy your daughter's wedding.",
      "MessageIndex": 29,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705441",
      "Title": "lumpectomy vs. mastectomy? kira Shirlann"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 12, 2008 06:06PM swimangel72 wrote: Kira - this is one of the toughest decisions you can make. I'm so sorry you have to go through this! I too felt rushed - because I really wanted to get the cancer out. So much depends on the size of your breast tissue now.........I was a \"barely B\" and not to much in \"love\" with my breast, so I knew that a mastectomy would bring me much peace-of-mind, especially when my surgeon told me recurrence rates are MUCH lower with mastectomy than with lumpectomy/radiation. If you go for a lumpectomy you will need radiation - something that did not appeal to me, for many reasons. I felt that a mastectomy would \"get it all\" and I was willing to live with a prothesis. However, I was happily surprised to find out about the Diep reconstruction option which leaves very little scarring if done immediately after the mastectomy. So I had a unilateral skin-sparing mastectomy followed by an immediate Diep. I was home in 5 days and doing well - until I ended up back in the hospital because of a staph infection. The healing of my abdomen has been painfully slow, but I'm almost there now. If I didn't get that infection, I could have returned to work after 8 weeks.  I'm happy now that I went through it all......after my Stage 2 surgery my new \"foob\" will be hard to tell from the other \"real\" one. The decision for a lumpectomy or a mastectomy is very personal and difficult - what you need to do is look closely at your pathology report, look at what kind of recurrence rate your cancer has, and see what you're comfortable doing. Since you have a wedding in just 4 weeks, perhaps you're better off doing the lumpectomy first and see if they can get clean margins. You can always opt for a mastectomy later - especially if they don't get clean margins, or if your lymph nodes show cancer, or your Her2 status is positive, or your Oncotype DX score is high......these tests all take time, but it helps you to decide on your treatment plan. Good luck Kira - and stay in touch! We'd like to hear what you decide - AND to hear all about the wedding (did you get your gown yet?)",
      "MessageIndex": 2,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705441",
      "Title": "lumpectomy vs. mastectomy? kira Shirlann"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 12, 2008 03:08PM swimangel72 wrote:",
      "MessageIndex": 8,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/703801",
      "Title": "Don't have LE--therapy consult anyway? otter NancyD"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 6, 2008 10:16PM swimangel72 wrote:",
      "MessageIndex": 3,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/708562",
      "Title": "What do you look for in a THERAPIST?? Binney4 LuckyLady"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 12, 2008 01:07PM - edited Apr 12, 2008 01:07PM by swimangel72",
      "MessageIndex": 5,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/703801",
      "Title": "Don't have LE--therapy consult anyway? otter NancyD"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 6, 2008 01:47PM swimangel72 wrote: Thanks so much Binney! Everything you recommended to me was what I found in my therapist, Danielle. She's a gem! And now you've reminded me that I need to send her a thankyou card too! I've also give her business card to my plastic surgeon and oncologist - they both said they have patients in the area looking for a well-qualified LE therapist. Danielle was really happy when I told her this (she's close to getting her PhD - anyone in the NYC area who needs a fantastic LE therapist can PM me.) Danielle diagnosed me with just Stage 1 lymphedema - but even so, she's been extremely thorough since I started seeing her - she totally eliminated my stubborn arm cording (which came back twice!) I have only 2 more visits with her - she's teaching me the manual massage - and even though I don't have to wrap my arm (thank goodness) Danielle ordered me a compression sleeve and gauntlet which I'm supposed to wear if I'm doing repetitive tasks or if I go flying. She even told me how to wash the sleeve so it won't get ruined (by hand, cold water, with Ivory soap - drip dry only.) She has told me over and over, it's important to catch lymphedema early and to go through all these steps so as to prevent a full-blown case from developing. Education is the key to prevention - and my LE therapist is a GREAT teacher! Thanks again Binney for all your helpful advice!",
      "MessageIndex": 1,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/708562",
      "Title": "What do you look for in a THERAPIST?? Binney4 LuckyLady"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 5, 2008 01:47PM swimangel72 wrote:",
      "MessageIndex": 8,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 6, 2008 01:56PM swimangel72 wrote:",
      "MessageIndex": 11,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 12, 2008 04:22PM swimangel72 wrote: Thanks Sue - and I wish I could go shopping with you for the wig - actually, that's the one part of this that sounds like fun to me. If you have to lose your hair, why not get the most glamorous, beautiful wig you can find? My daughter's sixth grade teacher at the age of 70 developed bc, and showed up in September with the most gorgeous wig - it totally changed her look! After her own hair grew in, she colored and restyled it to match her wig. I admired her so much - because she taught at the same school for 50 years, and never once complained about all her treatments......a wonderful role model for me! Anyway Sue - I appreciate your support and wow - what a great Muga score you got! I'm very impressed! Since I can't swim, I've promised myself to start walking/jogging/bike-riding this spring!",
      "MessageIndex": 18,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 4, 2008 01:58PM swimangel72 wrote:",
      "MessageIndex": 2,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 20, 2008 01:40PM swimangel72 wrote:",
      "MessageIndex": 30,
      "PostDate": "20/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 29, 2009 01:26AM swimangel72 wrote: Hi Sandy - I just sent you a PM then found your thread here. I'm sorry you're still feeling so tired, but 5 weeks is still a bit early to feel totally back to your normal self. It's been over a year since my surgery and my energy level isn't the same - but I'm blaming it on the Herceptin I'm still getting (I'll be done next month) - and the Arimidex. Emotionally our minds are saying, \"Enough - let's get back to normal\" - but our bodies still need to heal and get stronger at their own pace. I'm sorry you are getting swelling in your stomach.........I had that too.........wearing the binder when walking helped a lot (I got the binder from my new surgeon, no thanks to my original PS who never even so much as suggested that I wear a binder to help with my obvious bulge - nor even suggested wearing a tight girdle (which helps me so much during the day.) Where is your swelling occuring exactly when you say on both sides of your abdomen? Is it right next to your incision? Be sure to complain to your PS........call if you feel it necessary........and if after a while you don't get the answers or help you want, go for another opinion. The best advice I got was from a woman here at bc.org who convinced me to get a second opinion (thanks BethNY wherever you are these days!) Sandy I'm sorry I didn't write sooner and I hope you'll be feeling more energetic soon! Pam - your dx is close to my own......my surgery was just two months after yours. I'm so sorry that you have had such disappointing complications and hope your new PS will be able to help you. I'll be finished with the Herceptin in April......my infusions were given to me every two weeks. Are you getting Arimidex? I'm post-menopausal and was happy I didn't need Tamoxifen because I read it can cause endometrial cancer. My onc said he prefers Arimidex for post-menopausal women - I do feel more achey in the joints, but nothing unbearable.  I also love to kayak........we have 3 Stearns inflatables that work very well on quiet lakes........so easy to pack and carry in the car! Can't wait to get them out in the warmer weather........thanks for mentioning the kayaking.........your advice to Sandy is so helpful to me, to keep doing the things we enjoy but not to push too hard. I need to remind myself that \"this too shall pass\" - that there are better days coming!",
      "MessageIndex": 2,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731542",
      "Title": "Pedicle Tram Flap Recovery - Help! sandy2009 Nissi"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 15, 2011 10:56PM swimangel72 wrote: You might be dehydrated - it can cause exhaustion and nauseousness..........your electrolytes could be off ...........what helped me soooo much was a big bottle of Gatorade. Hope you feel better soon!",
      "MessageIndex": 3,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764955",
      "Title": "felt better after surgery, now feel lousy luv2trav memory"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 28, 2009 02:51PM swimangel72 wrote: Herceptin is the way to go - I wouldn't refuse it if I were you. My tumor was only .9cm with no node involvement - but once they told me the tumor was Her2++++ there was no choice but to get Herceptin. Her2+ tumors are VERY aggressive! Do your research and see what the recurrence rates are - and read some of the stories at www.her2support.org from the women with mets who weren't able to get Herceptin. Fortunately I was able to get a \"mild\" chemo (Navelbine every two weeks for 4 months with the Herceptin) so I didn't suffer hair loss or any additional heart risks. The Herceptin plus chemo reduces your risk of recurrence 50%.........my Oncotype DS score was 23 - which put me at a 14% risk for recurrence. The Herceptin and chemo reduced my risk to 7%. I don't like to gamble with my life - other people are more comfortable with gambling. If you are still in doubt, get a second opinion from another oncologist Good luck with everything and may God's angels watch over you!",
      "MessageIndex": 5,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 4, 2009 08:26PM - edited Mar 4, 2009 08:29PM by swimangel72 Sorry girls to cause confusion! I did delete the post because I answered my own question immediately after I hit \"submit\". I felt like an idiot - and still do - after a quick Google check I thought it was a stupid question, but you are right - perhaps it will help others understand what \"vascular invasion\" means.. So thanks to both of you for your quick and helpful responses! I'll have to go back now and check my path reports.",
      "MessageIndex": 59,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 28, 2008 07:44PM swimangel72 wrote: Hoping and praying your surgery went well Deb! You need to get strong again soon - so you can kick Dr. no-little's butt BIG TIME!",
      "MessageIndex": 247,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721511",
      "Title": "Alaska Deb Update newter OrliNaaman"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: I just saw my oncologist yesterday and all was going well.......my Oncotype DX number was very low, my cancer is a grade 1, well-differentiated, ER+, no lymph node involvement, and my BRCA1 &2 tests were negative, so we were happily going along making plans that I would only need an estrogen suppressor drug once a day for 5 years, when suddenly the doctor realizes we never received my FISH report back. It was first requested back in February when my original biopsy was done. So instead of leaving, he asked me to wait in the waiting room while the FISH report got faxed to him. After about 10 minutes, the nurse came back to get me and she and the doctor had very sad expressions..........the results were positive. They were both very surprised since every other indication was that my cancer was slow growing. My doctor was so surprised (and untrusting of Quest laboratories) that he requested a second opinion on the FISH - and told me he'll call in 4 to 5 days with the results. I'm not naive enough to get my hopes up that a mistake was made on the first FISH test......but it would be nice to have a little bit of hope that I won't need to go on Herceptin and chemo.......my oncologist said he would use a low-dose chemo where I won't lose my hair, but it all depends on the results of this second opinion. Has this ever happened to anyone else? 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 9, 2008 02:39PM swimangel72 wrote: I got tired of waiting to hear back from my oncologist (after a week) so I called him this morning myself. The girl looked at my records and read the results to me:  the first results (I'm assuming they were the FISH numbers?) were 3.3 - and the latest numbers were 4.3.........so, I'm positive and pretty sad about it, especially reading about all the side effects with the Herceptin treatments. My MUGA test last week was good (68%) so at least that's a bright spot. Even though some women have decided against treatment, knowing me, I'll start the Herceptin and chemo, just to increase my chances of a non-recurrence - unless the oncologist advices otherwise. Feeling pretty down right about now............",
      "MessageIndex": 13,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 10, 2008 02:20PM - edited Apr 10, 2008 02:23PM by swimangel72 Saw my oncologist this morning and he confirmed that I am Her2+ and need Herceptin. (He and I agree about being very aggressive against my cancer - this drug regimen should reduce my recurrence rate from 14% to 7%.) Oh - and it turns out my Oncotype DX score was 22 - not as low as I thought.) He discussed many different studies and said he believes my best course of action would be to go every two weeks for an IV infusion of Herceptin with Navelbine (a low side-effect chemo drug that shouldn't make me lose my hair.) I've been reading about navelbine and it appears the biggest problem is constipation and sometimes severe stomach pain - and sometimes low white blood cell counts. Since I still have an open incision in my abdomen, the doctor wants to consult with my surgeon as to when to start the drugs. He said it can take months for my incision to heal - but on the other hand, he doesn't want me to risk getting another infection. Looks like I won't be swimming for a looooong time yet - it's the one thing I really miss!",
      "MessageIndex": 16,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703373",
      "Title": "Second opinion on FISH results....anxiously waiting swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 30, 2009 02:14PM swimangel72 wrote: Hi Francine - and Vicki and Diana -  sorry I only just now saw this thread; thanks for starting it! I'm in Northern Westchester and love living here! We moved here 6 years ago from Long Island.......loved the beaches on Long Island but hated the traffic and crowds. My sugeons are still on LI........but my oncologist is in Yorktown. Hope we can all get to know each other better and maybe meet up! Lisa - do you miss Westchester at all? We looked for homes in Chappaqua but alas, couldn't afford to live near the Clintons, lol!  I travelled through San Diego on my honeymoon 25 years ago - the purple wild flowers growing along the highways were amazingly beautiful as was their scent! Are you near San Diego?",
      "MessageIndex": 9,
      "PostDate": "30/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/739614",
      "Title": "Weschester and Rockland Ladies crusader1 Jisman"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 13, 2008 01:21AM swimangel72 wrote: Otter I'm happy you stand by your words. I'm an optimist at heart.........I think even on my death bed I'll be an optimist because I don't believe in death...........just the start of a new journey for my soul. However I am terrified of more pain and suffering like I experienced after my surgery because even though I was and am healthy as a horse, I BECAME very sick after my surgery and getting the MRSA. Then packing an open wound for 4 months made me feel mentally sick it was so visually disturbing. Even though my chemo was \"light\" there were days I felt tired and sick. The thing that made me the most sick was something as simple as dehydration. I thought I was dying then................I could barely hold up my head. So when I talk about those dark days, I do say, \"when I was sick\"......................the first time I said it, I felt a paradigm shift in my head...........a new way of seeing myself in relation to the world. Skyrat you make an important distinction....................there's such a big difference between Stage IV and Stage 1 - when hope is almost removed from your vocabularly - when the word \"terminal\" becomes your new reality - the word sick probably just doesn't have enough power. I'm so sorry Skyrat, and any other Stave IV ladies - if it appears we are just playing a parlor game of semantics - I admit that I can't begin to understand what you really are going through. Oh I might IMAGINE what you feel like - but I really don't understand it. I think our brains are wired to prevent that kind of understanding unless it happens to us, so please forgive me for any tactlessness.",
      "MessageIndex": 29,
      "PostDate": "13/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 13, 2009 03:28AM swimangel72 wrote: I had my Oncotype done while waiting for the results from FISH............but it didn't clarify anything because my score came back in as \"low-intermediate\" with a 22. My onc then advised me to skip chemo (which I was happy to do).........but 10 minutes later, he got my FISH report finally faxed to him which showed my tumor was Her2++++...............then he pulled the rug out from under me again and said I DID need chemo with Herceptin after all. So...........my advise is to wait for the results of your FISH test. If your tumor is definitely Her2+++ you'll need chemo and Herceptin anyway - no matter what the Oncotype DX says. If the FISH results are that you're Her2- you can then go the extra step of getting the Oncotype DX done. But ultimately you need to ask this question of your oncologist............my feeling is he'll say wait for your FISH results first. Good luck with everything!",
      "MessageIndex": 2,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743769",
      "Title": "Oncotype. savva savva"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 2, 2009 06:08PM swimangel72 wrote: I'm so happy for your Angie - way to go! I completed my year of Herceptin last April. Are you on Arimidex? Like Otter, I've finished a year of Arimidex - just four more to go.",
      "MessageIndex": 10,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736762",
      "Title": "I am done angie27 Maire67"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: I had my first visit with an LE certified therapist today and she said I have \"latent\" lymphodema in my right arm (where only 2 sentinel nodes were removed). It's very slight and not worrisome - but she said it was good I came to her now to get measurements. Also she'll be doing massage therapy to help my arm heal from the cording. But the interesting thing is she noted that my abdominal swelling is also due to lymphodema (I'll tell this to my plastic surgeon tomorrow.) All along I assumed my protruding stomach was due to the open abdominal incision I've been packing since my staph infection after the Diep surgery on March 3. I look like I'm 6 months pregnant - I can't wear any pants except bagging cotton drawstring types and I'm getting tired of looking this way! I was so happy when she said she can also massage my abdomen (not touching the incision of course) and that will actually help it's healing. Has anyone else had experience with abdominal lymphodema and does massage therapy really help? I'll be seeing her twice next week - and can't wait for the therapy to begin! Certainly beats getting chemo treatments! 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 26, 2008 12:15PM swimangel72 wrote: I'm wondering - after my surgery, when they installed the two abdominal drains and one in my breast - is that yellowish-reddish fluid that drains mostly lymph fluid? That would totally explain the interruption in the lymph system!",
      "MessageIndex": 12,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 9, 2008 07:33PM swimangel72 wrote:",
      "MessageIndex": 26,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 19, 2008 12:32PM - edited May 19, 2008 12:34PM by swimangel72 I've HAD it with my swollen stomach! It's starting to worry me even more now that nearly 3 months have passed since my surgery. I made an appointment with my PCP for tomorrow morning - because even though my lymphedema therapist is wonderful, somehow I'm beginning to think it isn't lymphedma in my tummy, but something else. It isn't \"soft\" or \"fluid\" - it's rock hard, as though I'm 7 months pregnant. I haven't asked my PCP for his advice in any of this journey, so now's the time. While I was in the hospital, a \"hospitalist\" was in charge of my care (an internal medicine doctor) - NOT the plastic surgeon or breast surgeon - and it was because of the hospitalist that they finally did a CAT scan on my abdomen and found 3 pockets of fluid - and at his insistence, the PS aspirated some of it and that's how they found the staph infection. If I had just been under the care of my PS, I doubt very much he would have aspirated the fluid - or even acknowledged that the fluid was there. So the lightbulb went off in my head this morning that I need to involve my PCP - hopefully he'll order a CAT scan and we'll get to see what's happening in my abdomen. I'm really worried that it could be a hernia or a hematoma or seroma. At least this way I'll get another opinion before I see my PS on Thursday. The good news is that my abdominal incision is really closing up now. If it turns out to be \"only\" lymphedema in my abdomen, then I'll feel more relaxed - especially if I get the OK to go swimming again. Even if I have to wait another month or two, at least I'll know it's nothing more serious. Sigh.......I'm just so tired of looking AND feeling like I'm 7 months pregnant!",
      "MessageIndex": 27,
      "PostDate": "19/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 16, 2009 08:54PM swimangel72 wrote: Hi Movin on - I'm so sorry that you've been dx'd so young! Your dx is similar to mine - except I am Her2+++.......do you know what your Her2 status is? I had decided to get a mastectomy and Diep recon even before knowing my Her2 status. Still it was a shock to learn that I'd need chemo and Herceptin - I thought by going the radical route of mastectomy I could avoid chemo. I agree with the other women who have advised you to seek out the genetic testing. If you end up BRCA1 or 2 positive, then it may give you more confidence moving ahead with a bi-lat and recon. However, if you're negative - and you're Her2-, you may wish to take a less radical approach and go for the lumpectomy and rads. The mastectomy and recon surgery is difficult.............you can end up with many complications you never envisioned. Besides the MRSA staph infection which destroyed my abdominal muscles (and now I need more surgery to repair the big bulge) - I am saddened that I have lost sensation in the skin from my abdominal incision, up past my navel and to my chest bone. I also have no feeling in my new foob so I'm glad that I kept the other breast. I know how scary the shock of a dx first is - how quickly we can c ome to a decision - but it's ok to change your mind. Yes it is a very personal decision - but don't rush; take your time - get a second and even a third opinion before you move forward. And good luck with everything - I'm sorry you've joined us on this roller-coaster ride.",
      "MessageIndex": 4,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727489",
      "Title": "Lumpectomy, Mastectomy or Bi-Lateral Mastectomy movinOn movinOn"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 21, 2009 05:29PM swimangel72 wrote: I'm on Herceptin - and I had a muga scan at the beginning, then an echocardiogram after 3 months, then 3 months later, another muga scan. I assume I'll be getting one at the end of my treatment (April - yay!) I would imagine whether or not you get a muga depends on the kind of chemo you're on and if it can cause heart damage. Did you get the results yet? Why not call your oncologist and ask him directly why he wanted you to get one - it'll put your mind at ease..........I always call my onc with questions - I just figure it's part of his job! Good luck with your treatment and let us know what your onc says.",
      "MessageIndex": 2,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729492",
      "Title": "Muga Scan test 1/2 way through Chemo? Scrappygrl Scrappygrl"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 12, 2008 12:56AM swimangel72 wrote: Canuck - a second opinion will definitely bring you more peace of mind. My cancer was even smaller than  yours - everyone kept saying it \"wasn't that serious\".........even after MRI's of both breasts showed no other cancers, my doctor was so thorough he ordered MRI's of both my hips since I complained about hip pain (turned out to be arthritis) - and he even gave me a complete bone scan. Because I am who I am (jumping into the ocean all at once, riding the front seat of the roller-coaster type of person) I opted for a skin-sparing mastectomy followed immediately by Diep (because I saw my dad die of brain cancer at the age of 59). I'm glad I did the mastectomy (not saying YOU should be so aggressive) - because my Her2 status took a LONG time to come back - and when it did (just last week) it turns out I'm positive. So I'm happy my breast doctor was as aggressive as I was all along. My oncologist is just as aggressive - and I'll be starting on chemo and Herceptin soon. Bottom line - get a second opinion - and I hope they agree that you need MRI's done on both breasts. Good luck - and I'm sorry you have to go through this - but remember, we're all here to help each other!",
      "MessageIndex": 8,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/703754",
      "Title": "First Surgical Consult canuckintx Gardenlady"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 8, 2009 10:17PM swimangel72 wrote: Fran I sent you a PM - I hope you're feeling OK. It's a bummer getting the hernia........did you talk to a surgeon? Try not to strain yourself - see if you can get a binder or tight girdle to help. I'll be thinking about you - let us know how you're doing.",
      "MessageIndex": 2,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731150",
      "Title": "Abdominal Hernia after DIEP? Lifestooshort1 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 22, 2009 11:31PM swimangel72 wrote: Hi Nancy - I was wearing a size 38A for quite a few years - and always found it easy to find my size at JCPenney:  www.jcp.com. If that doesn't work, try getting a 36A then buying the bra extenders for the back - that helped me many times until I lost weight. Good luck shopping!",
      "MessageIndex": 1,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737773",
      "Title": "Who Makes Size 38A Bras? nancyu dreaming"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 25, 2008 11:25PM swimangel72 wrote:",
      "MessageIndex": 9,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 9, 2008 12:21AM swimangel72 wrote:",
      "MessageIndex": 21,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 19, 2009 05:37PM swimangel72 wrote: Fantastic news Nicole! I hope your mom is feeling better!",
      "MessageIndex": 28,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 23, 2009 08:30PM - edited May 23, 2009 08:35PM by swimangel72 Hi Nicole - I'm sorry your mom is feeling sick. I hope she's getting enough fluids - dehydration can really make you feel sick. Try some Gatorade or Pedialyte.  I hope she doesn't have a fever. What did her doctor say? You sound exhausted - try to relax - your mom will recover soon from the lumpectomy - most women do so very quickly. The physical battle against the beast of BC can be won .............oftentimes it's the emotional wounds that take longer to heal. Try to maintain your own life Nicole - are you able to get out with your friends at all? At this stage, your mom shouldn't be treated like a complete invalid.  A lumpectomy is painful - but she should be up and about walking - I hope you're taking care of yourself!",
      "MessageIndex": 32,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 29, 2008 11:09PM swimangel72 wrote: Hi Jeanne - I'm on Navelbine and Herceptin - I've had three infusions so far (every two weeks) and this past week I've experienced muscle weakness in my arms. The nurse at my onc's office said it's definitely a side-effect of Navelbine and that Motrin will help. It really starts to bother me in the late afternoon - and by the night, I could hardly sleep. The Motrin did help me last night - so maybe it will help you. I'm grateful it's not in my legs - the pain in my arms is bad enough! So be sure to call your onc and tell them what you are experiencing.........the nurse told me I should have called them right away instead of \"toughing-it-out\" for three days.",
      "MessageIndex": 2,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706437",
      "Title": "myopathay anyone? jeanne46 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 26, 2008 12:35PM swimangel72 wrote: Thanks Frogger and I'll be praying that you DO ultimately get back to yourself! Oh and my drains were removed a long time ago, thank God - my question was just a scientific inquiry - trying to understand what exactly happened to my body during surgery. The information shared here is so fantastic - I feel so blessed that I found this web site!",
      "MessageIndex": 14,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 3, 2009 08:02AM swimangel72 wrote: So so sad - I'm clapping but crying at the same time - may Heidi rest in peace!",
      "MessageIndex": 875,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 11, 2008 07:35PM swimangel72 wrote: Hi Kim - I'm thinking about you and hope you're feeling better about your dx. I know it's a bummer thinking about losing your pretty hair - but think of it as an \"investment\" in a future with less worry about recurrence. That's why I went with the mastectomy - because I wanted to be as aggressive as possible. I was really bummed when I found out I was Her2+ and needed chemo, but in the BC crap game, I want to stack the odds in my favor as much as possible so I'll put up with the meds. Have you gotten all your test results back yet?",
      "MessageIndex": 12,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707018",
      "Title": "Stage I, Grade 3, HER+ prognosis SecretCancer swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 11, 2008 08:37PM swimangel72 wrote: Kim I'm so happy your nodes were negative - that's a big plus! As for my tx - I knew nothing about chemo at all, and was shocked when my onc said I needed it - but this was immediately after he found out I was Her2+. So - no - I didn't \"negotiate\" with him at all.....he's an amazing man, very intelligent - has done many studies of his own - and came highly recommended. He discussed with me all the recent studies done with Herceptin and their outcomes and said he didn't like some of the chemo drugs used in conjunction with Herceptin because they aggravated the heart problems and that since I was Stage 1, Grade 1, I didn't need such strong meds.  He decided to use Navelbine because a recent study showed that Herceptin worked well in node-negative Stage 1, Grade 1 patients like me, as long as it was given with ANY chemo drug - not alone. I didn't get an \"official\" second opinion -  however, a friend of my husband's is a doctor who's SISTER is the head of oncology at a major hospital in California. I emailed her my entire sob story and she wrote back and said my onc is right on target with everything and I should feel very comfortable moving forward with this treatment. Sometimes I do feel nervous though since I don't know any other women on Herceptin and Navelbine who are early stagers like me.....most women on this regime have mets...........but, I realize everyone's cancer (and family history) is very different and ultimately it comes down to trusting your onc. Kim if you're not satisfied with the treatment suggestions from your onc, be sure you go for a second (and even third) opinion. It'll put your mind at rest.  Oh and how goofy am I? I can't stop hearing the Mary Poppins song \"Just a spoonful of sugar helps the medicine go down\"........wouldn't we all love a magical Mary Poppins-nurse when we get our chemo tx - with rosy cheeks and no warts too!  No matter what happens Kim - remember - chemo isn't forever - you can get through it - all the women here are like Mary Poppins for me!",
      "MessageIndex": 14,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707018",
      "Title": "Stage I, Grade 3, HER+ prognosis SecretCancer swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 17, 2010 04:08PM swimangel72 wrote: Two and a half years.",
      "MessageIndex": 92,
      "PostDate": "17/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/758694",
      "Title": "How many years have you been a Survivor? IllinoisNancy Lou789"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 16, 2009 06:20PM swimangel72 wrote: Do you have an OB/GYN since you're pregnant? The results should be sent to this doctor. Sounds like this radiologist is recommending you have a biopsy of the 4mm nodule - to rule out breast cancer of course. If you don't have an OB/GYN, you really need one since you're pregnant - good luck and let us know what happens next. The women here are very supportive - you came to the right place - I'm sure someone else will come along and help you with more information.",
      "MessageIndex": 1,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742244",
      "Title": "I dont have a PCP,Im trying to figure out the results myself... blackhotflame momzybaby"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 6, 2008 05:38PM swimangel72 wrote: Hi Pam - I have two college-age daughters, and I was very nervous waiting for the results of my BRAC1 & 2 tests - fortunately for me, sometimes when I'm waiting for results - I put my head-in-the-sand, by getting really busy and \"forgetting\" that I'm waiting. Thank God I tested negative - even my first cousin was happy to hear this news (she had BC 10 years ago and was thinking now of getting tested.) Funny things is - I never got genetic counseling at all - my breast cancer surgeon just spoke to me about my family history - about what's involved if I tested positive (how other family members, including my brothers, should also then get tested) etc. Somehow or another he was able to get approval from my insurance company. So Pam I'll be praying for negative results for you - and for future peace-of-mind for your daughters!",
      "MessageIndex": 4,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705116",
      "Title": "Getting My BRAC results tomorrow Dejaboo leaf"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 19, 2008 03:15PM swimangel72 wrote: My breast surgeon requested a second opinion on my path report as a matter of routine - he said he NEVER performs surgery until he gets a second opinion. Later, my original oncologist requested a second Fish test because he said it was very unusual to be Her2+ and Stage 1 and Grade 2. Unfortunately, both second opinions confirmed the first. Then I took it upon my self to get a second opinion from a second oncologist because I wasn't absolutely sure about his ideas for my tx........oncology is an art as well as a science too......the second onc agreed with my first onc (as did another oncologist - my husband's friend's sister, who is a head onc at a major hospital).....AND I wrote to a web site called  \"Ask an oncologist now\" and received an email back also agreeing with my unusual tx - here's the web site:  http://www.askanoncologistnow.com/cancer/question/ So yes - a second opinion is definitely worth the price for peace-of-mind. Don't hesitate to go for it!",
      "MessageIndex": 7,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707607",
      "Title": "Anyone ever think about getting a 2nd path opinion? BustersMom drcrisc"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 6, 2009 09:04PM - edited Nov 6, 2009 09:09PM by swimangel72 I had an enlarged lymph gland in my groin -  many years ago (in my wild-20's) before BC. I felt fine too - no fevers, chills, etc. My ob/gyn at that time did a pap smear and said I had something going on there - he did cyro-surgery and put me on antibiotics and that took care of the problem. Perhaps it was some kind of STD..........not that I'd wish an STD on anyone - but compared to BC, they look like VERY treatable problems don't you think? Good luck and I'll be sending a prayer that your results are B9. P.S. Years later (after my 3rd c-section) I had what I thought was another swollen lymph gland in my groin on the opposite side - went to my ob/gyn and he shocked me by saying this one WAS a hernia! I had out-patient surgery where they put in a teany-tiny piece of mesh and that was the end of that. So it's not uncommon to confuse a hernia with a swollen lymph gland.",
      "MessageIndex": 3,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743383",
      "Title": "FREAKED OUT--3 cm enlarged groin lymph node mshalto MelissaDallas"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 7, 2008 07:58PM swimangel72 wrote: Pam I'm so happy your BRCA tests came out negative - that's such a huge relief for you and your daughters! And thank God they found out the real reason you've been SOB after all these years! Do some of your own research on the cardiologist and be sure to get a second opinion before making any decisions. I'll be praying for you!",
      "MessageIndex": 10,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705116",
      "Title": "Getting My BRAC results tomorrow Dejaboo leaf"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 15, 2008 05:02PM swimangel72 wrote:",
      "MessageIndex": 20,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705476",
      "Title": "Got my port!!!! Watson LuAnnH"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 7, 2009 11:17PM swimangel72 wrote:",
      "MessageIndex": 7,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/730317",
      "Title": "When to tell daughter away in college Eliza2009 murphmort"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 8, 2009 02:10PM swimangel72 wrote:",
      "MessageIndex": 11,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/730317",
      "Title": "When to tell daughter away in college Eliza2009 murphmort"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 6, 2009 11:25AM swimangel72 wrote: I'm sorry this is happening to you - I remember reading somewhere that women who stopped wearing bras and protheses were able to eliminate the swelling more quickly. Did you doctor recommend a compression garment for your chest - I've heard this halso heps. I'm sure Binney and other more knowledgeable women will post soon to give you further advice - good luck.",
      "MessageIndex": 1,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/738520",
      "Title": "Chest wall swelling--edema or LE? dancingneedles dancingneedles"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 25, 2009 11:23AM swimangel72 wrote: Did your PS test your infection to see was it MRSA? Were you on IV vancomyacin while in the hospital? I just get FURIOUS reading about infections - no matter that they \"warn\" us prior to surgery, according to www.hospitalinfection.org - these infections are totally avoidable if the surgeons and hospitals would follow proper infection protocols - and if they would educate patients on how to care for their incisions at home. Sigh........sorry for my rant Millie - I truly feel sorry for what you are enduring. I had an opened abdominal incision after my free-tram and it had to heal from inside-out, which meant packing it twice a day for 4 months. Infections ARE avoidable - even with implant surgery. I just wonder how long it'll take (how many more BC patients need to endure infections) before major changes take place in PS's attitudes!",
      "MessageIndex": 11,
      "PostDate": "25/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737893",
      "Title": "incision infections MillieD swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 29, 2009 09:24AM swimangel72 wrote: I'm so sorry for Stephanie's family, but I'm happy she's no longer suffering and is now an angel in heaven. Her faith not only sustained her, but so many of us here as well. I'm crying as I write this - she was such a beautiful person, her heart and soul glowed on these forums.",
      "MessageIndex": 11,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 12, 2009 06:30PM swimangel72 wrote: You should meet with the CEO or President of the hospital where he did your surgery and make a complaint - preferably with someone with you who has experience with this - preferably a lawyer friend. I'd also avoid the You-tube route. I'm sorry for all your suffering - and pray God's angels will watch over and protect you from now on!",
      "MessageIndex": 3,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/743733",
      "Title": "Opinions Wanted Regarding Public Complaint Against My Surgeon Pat634 melissa-5-19"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 12, 2008 09:14PM swimangel72 wrote: Hi JenMarie - I'm so sorry you're going through all this anxiety at your young age! My daughter is 22  -  young people have enough stress getting started in a career and life without worrying about BC! I'm sorry I can't help you at all with your question - but here's a question of my own that you may have answered elsewhere - did you have genetic testing done to see if you're Brca positive?",
      "MessageIndex": 1,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/724361",
      "Title": "Results in; Huge Scare & Even Higher Risk than before... JenMarie Annabella58"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 3, 2009 12:29PM swimangel72 wrote: The biopsy will give you some measure of peace-of-mind, rather than waiting 6 months. Here's praying it's B9...........and if it isn't, be sure to inquire about getting genetic testing for the BRCA1 & BRCA2 genes since it's so strongly in your family. Good luck and may God's angels watch over you!",
      "MessageIndex": 11,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/743192",
      "Title": "MRI Found suspicious spot-What to do?? Biopsy or wait 6 months rmalisegs paigelise"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 31, 2008 01:29PM swimangel72 wrote: Deb you are always in my prayers - may your guardian angel watch over you! ",
      "MessageIndex": 82,
      "PostDate": "31/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 12, 2008 06:54PM swimangel72 wrote: Shells - try to relax - have that glass of wine! I was a nervous wreck too, but like RedWeasel said, it really was MUCH easier than going to the dentist! I had a sonogram-assisted, vaccum-needle aspiration done back in February. I drove myself there, and drove myself home (with the ice-pack inside my bra. The ice-pack really helps to keep the swelling and bruising down.) I was able to go to work the next day too - so it's not bad at all. Waiting can be unbearable, but once you get it over with (AND you get your results) you'll feel better! Hang in there!",
      "MessageIndex": 7,
      "PostDate": "12/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705318",
      "Title": "Help! Core Needle Biopsy! shells leaf"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 23, 2008 07:32PM swimangel72 wrote: Hi Sarmcl - I had a unilateral mastectomy on March 3, 2008 followed by an immediate Diep - my surgery took about 6 hours. I stayed in the hospital from Monday through Friday - and went home with three drainage tubes and pain pills. I had to be readmitted the following Sunday due to shortness of breath - and they kept me there another 11 days due to a shaph infection in my abdomen. I was then sent home with an open abdominal incision (which is finally beginning to close) and more antibiotics. I'm still not permitted to return to work - my surgeon put me back on MORE antibiotics (because now my port scar is infected.) So much depends on how your surgery proceeds - what kind of reconstruction surgery are you anticipating? Are you planning on implants or a free-Tram or Diep? I chose the Diep because it would come the closest to matching my healthy breast and I didn't want any problems with my muscles. Also I didn't want an implant under my chest-wall muscles since I'm a swimmer. Complications like mine can occur even with very minimal surgery, so please don't let me get you too worried! You are MUCH younger than me.......and if you have a strong immune system you should be fine no matter what surgery you choose, as long as your surgeons are very experienced. Good luck and God bless you with a positive outcome!",
      "MessageIndex": 1,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706060",
      "Title": "Mastectomy w/reconstrcution sarmcl Erica"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 14, 2008 09:34PM swimangel72 wrote: I'm praying for you Deb - and sending you a big hug! ",
      "MessageIndex": 325,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720346",
      "Title": "Dear Lord, I just scheduled brain surgery AlaskaDeb heymoose"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 18, 2009 07:40PM swimangel72 wrote: I believe I'm developing fat necrosis near my sternum - after my Stage 2. My entire foob is very soft except for this area..........I've been massaging it - hopefully that will help. But it's great to read other's stories about how fat necrosis can resolve on it's own over time!",
      "MessageIndex": 4,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735828",
      "Title": "fat necrosis after DIEP pjcrn pshelton"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 1, 2008 10:59PM swimangel72 wrote: Eight months is too long to have a doctor just tell you to take Motrin - you definitely should seek another opinion and at least get an x-ray. I hope you'll get an answer - and relief - soon!",
      "MessageIndex": 4,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708333",
      "Title": "Good news, but frustrated. vega swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 7, 2008 04:48PM swimangel72 wrote: Hi Alenej - and thanks for sharing your information. I actually never even considered NOT going on chemo or hormone therapy if my oncologist recommended it - you've given me some interesting numbers that I'll pass by him for his advice. My gut feeling tells me though that 7% really IS worth it all - if YOU fall into that 7% - and from the get-go, I'm been trying to attack my breast cancer to give me the best possible outcome because I seriously do NOT want to deal with this again - not 5 years from now, not 10 years, not 20 years. In a way, I consider all the pain and infection and drugs a \"twenty-five year investment\" in my life.......but you have given me pause to consider the QUALITY of my next five years. So thanks again Alenej for your information and good luck with your decision!",
      "MessageIndex": 131,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 29, 2009 05:51PM swimangel72 wrote: It's OK that you made the appointment to see an oncologist first.......he will be able to help you understand your biopsy pathology report..........some surgeons are too \"gung-ho\" and can scare you into getting an unnecessary mastectomy (which happened to me). My tumor was also triple positive with some DCIS..........as Cathy said above, your oncologist will determine whether or not you need a FISH test - but if your pathology remains triple positive, you'll be needing Herceptin for a year. Good luck with all your difficult decisions.",
      "MessageIndex": 7,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/744682",
      "Title": "onco or breast surgeon..which visit first? PiscesMoon MaineCoonKitty"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 25, 2008 01:29PM - edited Apr 25, 2008 01:39PM by swimangel72 Lee your DH sounds so sweet AND funny too! I love the bird's nest idea! And thanks for suggesting the sick bank to me - but support personnel in my district can't use a sick bank according to our union. It's really not a problem right now for me - but next year I hope to be a union rep for the technical department and you can be sure I'll try to fight to get a sick bank included in our benefits. Lauren I too had to wait so long before my first tx.....2 hours in the waiting room - but having a good book to read really helped! My biggest complaint is that the drive to my oncologist's office is 40 minutes away. I'm sorely tempted to check out the new little cancer center building only a mile away from my house. I do trust, respect and LOVE my oncologist - but the idea of driving back and forth every two weeks for a year is a big turn-off, especially considering that price of gasoline - can you BELIEVE it's nearly $4 a gallon!! Also, my dh has to either take a day off from work, or work at home so he can drive me. Has anyone else switched oncologist just for the convenience factor? I'm sure my oncologist will understand - but I'm also afraid of switching because I do really like the nurse practitioner there who does the infusions so expertly......and I've been feeling well after my first treatment so maybe I shouldn't rock the boat so soon? Anyone have any advice?? P.S.  Sorry ladies - I seem to have missed some posts - this happens to me alot when I read the new threads - I THINK I'm responding right behind you, then suddenly there are a bunch of new posts that I didn't even see! It's hard to keep up sometimes - forgive me! Otter I'm happy you're doing well today - I find that I'm feeling great every-other-day. Angie I'm so sorry you're all backed-up - I went nearly 7 days in the hospital after surgery, which really bothered my tight tummy - until I finally asked for a laxative. Then the reverse problem started - so hang in there and I hope you're feeling better soon. \"April is the cruellest month\" goes through the literary part of my brain - but it's a gorgeous day here so I should get off my butt (away from the computer which is my refuge these days) and go out and water my plants!) Oh and Happy Birthday Nancy - and many MANY more!",
      "MessageIndex": 487,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 2, 2009 03:53PM swimangel72 wrote: Bumping this up - my last cat scan showed a 2mm nodule on the left upper lobe of my lung. Of all the things mentioned in my cat scans, this was the only thing my oncologist actually said anything about - he pointed to the tip of his pencil and said, \"Don't worry - it's smaller than this.\" Well as we all know, size isn't always relevant...........I'm wondering now should I ask him to give me a Pet scan next time I see him (the end of August?) I never had a Pet scan - and strangely - when I first switched to this onc, he raised the issue himself, saying \"Didn't your old onc every give you a Pet scan?\" My answer then was no - and it's still no. I'm not overly anxious - but trying to make educated decisions based on the last bunch of cat scans that were done. They had nothing to compare the chest cat scan too - so that's a bit of a problem. Anyway - I'm happy to have found this thread and to learn from everyone else's experience!",
      "MessageIndex": 18,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/693970",
      "Title": "Small Solitary Lung Nodules cmhartley swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 13, 2009 08:13PM swimangel72 wrote: Hope you got good news by now M.........did you have the biopsy yet?",
      "MessageIndex": 5,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/743383",
      "Title": "FREAKED OUT--3 cm enlarged groin lymph node mshalto MelissaDallas"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 23, 2009 08:22PM swimangel72 wrote:",
      "MessageIndex": 127,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 13, 2009 04:11AM swimangel72 wrote: Heidi I just wanted to tell you that I'm praying for you - I've been following your posts and my heart is broken for what you are enduring. Sending you a BIG cyber hug - may God's angels watch over you! ",
      "MessageIndex": 60,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 17, 2009 11:01AM swimangel72 wrote: Heidi I'm praying for you - and thanks Little Bro for keeping us updated - you are truly an angel!",
      "MessageIndex": 409,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 6, 2009 08:36PM swimangel72 wrote: Hi everyone - are we still on Page 1? Lol! These threads have a tendency to get so busy so fast, and I find it hard to keep up with everyone - but still I wanted to stay hi to all my Stage 1 sisters. I'm also a frequent contributor to the Breast Reconstruction forum - and an occasional visitor to the Her2+ forums. Also - I visit www.her2support.org for helpful info. Now an interesting thread would be - Stage 1 sisters who had mastectomies. So many people are shocked when they find out I had a mx for a Stage 1, Grade 1 tumor - but I remind them that many Stage 0 girls have mastectomies too - that everyone's BC is different and we each need to make the best decision we can with the information that's available to us. I may do a LOT of complaining about my \"foob\" and all the reconstruction surgeries I needed - but I really feel that I've beaten my BC down to a mere little nuisance buzz in my brain now and then. My prayers are for all our sisters who first start on this nightmare roller-coaster ride - no matter what stage - may God's angels watch over and protect us, everyone!",
      "MessageIndex": 26,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 1, 2010 06:19AM swimangel72 wrote: Hi - my tumor was also Stage 1, Grade 1 - I opted for a mastecomy, then I had 4 months of chemo (Navelbine) and a full year of Herceptin, twice-a-week. Once I finished the Navelbine, my onc started me on Arimidex........I was already post-menopausal, and my tumor was highly ER positive. I was told that our bodies continue to produce estrogen, especially if we are even slightly overweight..........so I'm not taking any risk, especially not after all I already went through to try to beat the Beast. GOod luck with all your decisions - may God's angels quide you and protect you!",
      "MessageIndex": 5,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/752027",
      "Title": "Stage 1 did you take hormone therapy? NancyLa NancyLa"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 22, 2009 09:11PM swimangel72 wrote: Very original and beautiful photo!",
      "MessageIndex": 4,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/744354",
      "Title": "A pic to share Bugs Momcat1962"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 11, 2008 09:49AM swimangel72 wrote: (((((((((((((((((((((Otter))))))))))))))))))))) Hang in there - you're doing everything right and you're a wonderful role model for me and other women here!",
      "MessageIndex": 184,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 23, 2008 10:32PM - edited Apr 23, 2008 10:34PM by swimangel72 Count me in now as an \"April\" girl.....I just had my first infusion this morning (Herceptin and Navelbine). I sat for two hours in the waiting room, but found a great book to read there! Then I sat in the lounge chair for another two and a half hours. This is certainly a lesson in patience - for both me and my dh! They told me I won't be losing my hair but it may get thinner. Next week I get my port installed - todays infusion was through an IV in my hand, and my vein didn't hurt at all, but they won't chance it a second time. Other than being a bit tired (I blame it on my lack of sleep last night) - I'm feeling fine tonight.......so far, so good, keeping my fingers crossed - drinking a LOT of water -  and trying to catch up with everyone's posts here to get to know my April sisters better.",
      "MessageIndex": 439,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 25, 2008 01:43PM swimangel72 wrote:",
      "MessageIndex": 489,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 25, 2008 03:21PM swimangel72 wrote:",
      "MessageIndex": 492,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 28, 2008 07:55PM - edited Apr 28, 2008 08:06PM by swimangel72 Otter - I hope you'll talk to your doctors about what you discovered with the Nottingham Prognostic Index - maybe the computer isn't interpreting it the same way as they are. I actually have to tell myself to get off the computer (I'll end up with carpal tunnel syndrome soon!) and then zone out in front of the TV. The other alternative entertainment is doing the laundry......life is so unexciting these days for me. Now it looks like I won't be going to my cousin's son's wedding on Saturday - it's a two and a half hour drive and I can't imagine sitting that long in the car with my stupid, slow-healing abdominal incision. That plus the fear I have that I'll feel lousy after they put in my port on Wednesday - plus the fact that I look like I'm 6 months pregnant, nothing fits me, my hair is awful - I just don't feel in the party mood at all, so I'll be calling my cousin today to cancel. P.S.  DUH! Did it again - posted a reply to a MUCH earlier thread - why do I ALWAYS keep missing the newer threads?? P.P.S  My Nottingham Prognostic Index is very low, but it doesn't appear to assign any points to someone who is Her2+.....anyway, there is an emotional toll these tools can dump on us, sometimes I think my mother is right, \"ignorance is bliss.\"",
      "MessageIndex": 546,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 30, 2008 01:53PM swimangel72 wrote: Today's the day - at 1pm I get my port installed, have to be there at 11am. THe worst part is I can't eat or drink anything now.....and already I'm so thirsty! The good news is I finally have a cleaning lady over so at least when I get home the house will be clean - especially the bathrooms. Makes it easier to keep a positive outlook, but still, I'm anxious about going back to the same hospital where I got my staph infection.",
      "MessageIndex": 586,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 1, 2008 10:42PM swimangel72 wrote: The port install went well - thanks for your support ladies! I was worried about \"twilight sleep\" but the anesthesiologist was fantastic - instead he just gave me an infusion of meds that put me to sleep, and I felt and heard nothing - then woke up on the operating table and started talking like I just left off. My neck was the only thing that hurt - still hurts actually - I can feel the tube there hitting against my collar-bone, especially when I move my head hopefully that will stop soon. I also saw my PS today - he remarked how much my swollen stomach looks better but still said I should stay home another week from work (which I'm not objecting to at all, especially with my neck hurting me and the steri-strips on my port incision.) Also I get my second chemo infusion next Wednesday - I'll feel better returning to work knowing how I feel after that. I really feel very whimpy compared to what all you other ladies are going through, especially with the hair loss. Today I saw a very young mom holding hands with a 3 year old in my PS's office - she was very athletic and energetic looking, with a beautiful scarf around her pretty head.......it just amazes me to see how YOUNG some women are who get this stupid disease!",
      "MessageIndex": 648,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 24, 2009 08:04PM swimangel72 wrote:",
      "MessageIndex": 2,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740876",
      "Title": "hematoma after DIEP lesleycnm swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 18, 2009 07:22PM swimangel72 wrote: I'm so sorry you're facing this difficult decision - I sent you a private message. Since you are Her2-, it would be helpful to wait for the Onocotype DX results before making your decision. Are you finished having children? Have you been tested for the BRCA1 & 2 gene? That test would also help you make your decision - because if you're positive for those genetic mutations, you'll also be at higher risk for ovarian cancer. I hope you'll get more responses from other women - this is a great web site with a ton of support! Good luck and may God's angels watch over you!",
      "MessageIndex": 2,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732697",
      "Title": "Chemo vs Ovary Removal rqd817 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 11, 2009 09:55PM swimangel72 wrote: Thank you girls for posting the Veterans' Day photos. School was closed today - my 16 year old son had basketball practice at 8am. At 10:30 am he calls and says he needs a trip to the hospital. Another boy's head crashed into my son's prescription goggles and he got a huge gash on the top of his cheekbone, just under his eye. Thank God his eye was OK. So I made up my mind to take him to one particular hospital near the school, but we were detoured by a Veteran's Day parade - and ended up on the highway driving back to the hospital where I got the MRSA staph in my abdomen. I felt extremely nervous going back in there - but we had no choice. As soon as we entered the ER, I made my son wash his hands with the santizer dispenser - and I did my own too. Thank God it all turned out very well - the ER nurses and doctors were fantastic! We didn't wait at all...........and we were fortunate that a plastic surgeon was available - he stitched him up beautifully and said he should only have a very slight scar. So I told my son - even though I was afraid to return to that hospital - I think God's angels sent us on that detour - who knows if the other hospital would have had a plastic surgeon available when we got there? I really am not a nervous-nilly type in hospitals. Usually I'm fascinated by all the equipment - but when it's your son - and when it's a hospital you had a bad experience in - a person's heart beat can sound REALLY loud in their own ears! I'm so glad today is over............all's well that ends well............my job is to keep reminding my son to keep his hands clean and AWAY from his face while his wound heals.",
      "MessageIndex": 211,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 12, 2008 07:56AM swimangel72 wrote: Hi Toni - you sound like a wonderful strong woman and I'm so sorry you've had to join our club here. So many women here have helped me to cope - and so many women I work with as well, women I didn't even realize had suffered BC themselves. I've always been the \"giver\" too, and it was hard for me to receive - to be the patient - I almost feel embarassed sometimes, isn't that ridiculous? Hang in there Toni - I'll be saying a prayer for you today!",
      "MessageIndex": 15,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707056",
      "Title": "Just need a shoulder kinde5069 sbmolee"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 6, 2010 05:09PM swimangel72 wrote: I developed stage one LE after my sentinel lymph node surgery and mx with immediate free-tram. The first symptom I experienced was the axillary web - running from my armpit down to my wrist - I couldn't lift my arm - and it was very painful. Thankfully, my oncologist recognized the syndrome and tried to help me by massage. However, even he didn't recommend an LE therapist - only thanks to bc.org was I educated about this problem and found a certified LE therpist who measured my arm and taught me how to do massage, measured me for a gauntlet and compression sleeve, and taught me preventative techniques. Fortunately I have experienced no further difficulties - but I protect this arm from all blood draws. I find it shocking that BC.org uses Lillie Shockney as an \"expert\" and would sign any petition asking the moderators to remove her. Thank you Binnie and Kira for all your helpful information and dedication to LE sufferers everywhere!",
      "MessageIndex": 98,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/752976",
      "Title": "Risk after SNB/ Lillie Shockney gets it wrong kira voraciousreader"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 24, 2008 06:07PM swimangel72 wrote: Thanks so much for your help ladies! Binney yes I have been a swimmer for most of my life - used to swim on an adult team but have slowed down considerably after having kids. Still, even while pregnant, I used to swim a mile a day. I swam a half mile the day before my surgery knowing I'd be out of the water for a long time. Grace - I can't wait to get back into the pool - I just KNOW it'll make a world of difference in all my swollen areas. My arm isn't that noticeable as of now - and hopefully it won't get worse. The swelling in my new Diep breast and abdomen is annoying - but again I'm trying to stay positive that they will improve with time, especially with therapy. Thanks so much for the advice about the LE garments...I really need to google them and see what might fit and help my breast area. I can't wear anything tight on my abdomen right now until it finishes healing. And you are so right about the surgeons.....they seem to just look at the incisions or at the new breast. Even the other doctors comment in a negative way about the surgeons - how they don't get the \"whole picture\" (mine is a very sweet kind man, but he was in denial about the location of my abdominal staph infection until he was proven wrong.) Sue and Debbie - the weight gain is always a worry - I do have a fibroid in my uterus that doesn't cause any bleeding, but sometimes I wish I had my own portable MRI machine - or X-ray vision - to SEE inside there to be sure it isn't growing since it was checked last time! WHERE or WHERE is Dr. McCoy from Star Trek? Remember how he'd call our 20th century doctors \"butchers\"? Or maybe you are all too young to remember that show with Capt. James T. Kirk - sigh - to THINK how he has reduced himself to internet commercials!",
      "MessageIndex": 7,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/704483",
      "Title": "Abdominal lymphodema? swimangel72 sccruiser"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 5, 2009 06:56PM - edited Jun 5, 2009 06:57PM by swimangel72 Laurie I've had several cat scans and bone scans and my lower back always lights up - an MRI the first time proved it to be arthritis so I don't worry about that part of my body any more, especially since I'm symptom free and my tumor markers are normal. Hang in there - hope you can do something fun this weekend to make the time pass quicker!",
      "MessageIndex": 3,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/735356",
      "Title": "Was DCIS, Cancer found in Lymph Node TCGGal Bellz"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 7, 2009 09:48PM swimangel72 wrote: Wow - 4 pages already and I've only been gone a couple of days! Nice to see old friends (hi mmm5!) and new ones too (aabinion - good luck with your upcoming bi'mx and recon........won't be long now. Where are you having surgery done?) And to everyone who hates pink.............it's pathetic in November to see the castaway sales-table from October. Oh the stale Halloween candy is sad enough - but the left-over PINK breast cancer awareness junk is NOT inspiring........who wants them now in NOVEMBER anyway? Hope everyone has a nice weekend.........the sun was shining brightly all day and later when it set, the pink clouds WERE inspiring to me (they did NOT remind me of bc!)",
      "MessageIndex": 101,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 6, 2009 02:23PM swimangel72 wrote: Seyla I'm in Northern Westhcester County - been here for 6 years and LOVE it!Our first snowfall of the year came last night - the trees are GORGEOUS in white! Welcome nmi - I wanted to tell you I went to an opthamologist at my gf's recommendation (she was a Stage 1 survivor 10 years ago) - I never knew that BC could spread to the eyes! My exam was fine - but here's a link to information concerning bc mets to the eyes: Breast Cancer spread to eyes",
      "MessageIndex": 768,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 18, 2009 06:19PM swimangel72 wrote: I'm so sorry you're experiencing this difficulty! I experienced very painful cording in my right arm after my mx and free-tram recon. I needed the help of an LE therapist who did massage therapy to break up the protein in the cord. She also performed therapy to give me back total range-of-motion in that arm. I tried exercising on my own, but it didn't help at all. I got the referral for my LE therapist from my plastic surgeon - insurance paid for everything. Search the threads here at bc.org and you'll find other women's stories. Good luck and I hope your arm feels better soon!",
      "MessageIndex": 1,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736121",
      "Title": "Cording after surgery teri50 FACECRAFTER"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 8, 2008 08:49PM swimangel72 wrote: Kelly if it's any comfort to you - I believe you told them in just the right way! I remember how awful I felt telling my children - my oldest is 22 and my youngest 15 - I can't imagine having to tell such little ones as your children - but your love shines through and that's what will matter to them always. I'm sending you a big hug through the internet Kelly!",
      "MessageIndex": 2,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724140",
      "Title": "Told The Kiddies.....Sigh KellyC God-is-good"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 30, 2009 09:09AM swimangel72 wrote: Hi Millie - what did your PS say? Did you find out what kind of infection you had? I hope you're feeling better!",
      "MessageIndex": 18,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737893",
      "Title": "incision infections MillieD swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 14, 2009 01:54PM swimangel72 wrote: Hi Dorrien - I'm sorry you experiencing problems. For a better response to your question  you should start a NEW thread at the Breast Reconstruction Forum. Just click on \"FORUM INDEX\" then click on \"Breast Reconstruction\" then click on the right \"Start a new Topic\". Then you can also get email updates whenever someone posts a response to your question. Good luck with everything!",
      "MessageIndex": 21,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 24, 2009 07:19PM swimangel72 wrote: I hope your headache is better today Nicole. Are you worried at all about Swine Flu? My 15-year-old nephew was just dx'd with it (he lives on Long Island near Queens).........no cases have shown up in my town yet, but I'm being extremely cautious about being in crowded places - and washing my hands like crazy!",
      "MessageIndex": 34,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 20, 2009 12:52PM swimangel72 wrote:",
      "MessageIndex": 5,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736121",
      "Title": "Cording after surgery teri50 FACECRAFTER"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 15, 2009 04:57PM swimangel72 wrote: Alaina - sounds to me like your oncologist is taking too much for granted. Herceptin can cause heart problems on it's own - perhaps you should talk to your Primary Care Physician or get in to see a cardiologist. Jaimieh is also correct - echo cardiograms work as well as muga scans. Here's a link to more info on muga's with Herceptin (from our very own BC.org): http://www.breastcancer.org/treatment/targeted_therapies/herceptin/side_effects.jsp",
      "MessageIndex": 3,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737463",
      "Title": "MUGA Scans Alaina Ihavehope"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 16, 2009 04:12AM swimangel72 wrote: Forget the family physician - find yourself a breast specialist who works in a cancer center. It's YOUR body - and with your family history you need to be as proactive as possible. Good luck!",
      "MessageIndex": 2,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/735947",
      "Title": "Fear that Dr. may not be taking us seriously. picardlx HeatherF"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 7, 2008 02:04PM swimangel72 wrote: Hi - I had an nearly identical pathology report - Stage 1, Grade 1 is excellent news! Er+ and PR+ is also good news - the treatments are very effective. However, the jury is still out on your Her2 status.........mine was also 2+ which means \"equivacal\" - and it was also sent out for FISH analysis. My oncologist was shocked when my Fish report came back positive - so shocked that he sent it out to a second lab for another opinion. It returned positive as well, so to my great dismay I had to start on chemo. The good news is that Herceptin really works so well against Her2+ tumors and the side effects are very light. So even though it's unusual to be Her2+ with Stage 1 and Grade 1, it's not impossible. Be sure you get a follow-up report on your Fish results!",
      "MessageIndex": 3,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708633",
      "Title": "Decoding help needed oldlady ICanDoThis"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 6, 2009 12:23PM swimangel72 wrote: Go for a second opinion - some onc's (like my first one) have STRONG opinions about what a patient should do - it will give you some peace of mind no matter what you decide. Good luck!",
      "MessageIndex": 2,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738514",
      "Title": "31 yrs. Old Struggling to decide on Chemo yasminv1 yasminv1"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 8, 2008 10:24AM swimangel72 wrote: My surgeon told me that if I had a lump with rads, my chance for a recurrence would be 14%, but if I did the unilateral mastectomy, my odds of recurrence (using him as my surgeon) would be 0% (because he's such a great surgeon. While I didn't buy into HIS egotistical logic, I knew I didn't want rads and knew that for my own peace-of-mind a mastectomy made sense. I opted for a skin-sparing mastectomy with immediate reconstruction with a Diep flap - unfortunately this turned into a muscle-sparing free tram, which would have been fine, except I then developed a MRSA staph infection in my abdomen which meant another 2 weeks in the hospital on IV drugs - then home with an opened, debrided abdominal incision that needed packing for 3 months. Later on, I realized that my surgeon didn't give me the correct facts - that recurrence of cancer is equal with lump/rads or mastectomy. This is an important scientific fact - RECURRENCE RATES ARE THE SAME (new studies prove this.) So now I wish that I just went with the lump/rads. I also erroneously thought that a mastectomy would mean I wouldn't need chemo - WRONG! I never saw an oncologist until after my surgery - another big mistake on my part. The surgeon and plastic surgeon had rushed me into surgery so fast my head was spinning! And it fed my fear to \"get it out\". I should have slowed down and spent more time researching. Turns out that my tumor was Her2+ and my Oncotype DX score was 22 - in the low end of the intermediate stage. Thus my onc said I needed Herceptin and chemo anyway - and more surgery to implant a port -which also got infected and had to be removed - needless to say, I'm NEVER returning to that hospital! The good news is that at least I didn't need radiation - and my new foob \"took\" even if I still have major surgery down the road to repair my huge abdominal hernia. I've since switched plastic surgeons to one who is truly an artist and will make this fat foob look like a real breast. Through all this I've never regretted keeping my \"good girl\". For years it has never shown even the slightest sign of problems, not even calcifications. My \"bad girl\" always had calcifications - even at my very first mammo when I was just 37. Now my question is \"Why didn't my old radiologists and ob/gyn ever TELL me that my breast had calcifications and that I should keep a close eye on it?\" They never said ANYTHING to me - just \"everything's normal, come back next year.\" So I skipped 3 years worth of mammo's while we were moving and I was getting my daughters off to college. If I knew that calcifications were something to keep a watchful eye on, I would have been more vigilant. ANYWAY - I'm happy I still have my \"good\" breast. No matter that it's small and a bit saggy - it FEELS alive and my new foob doesn't. That's one thing that's often not discussed - how after a mastectomy the nerves are cut and your breast (including the skin) feels \"dead\". Oh - and how the area around my navel also feels dead after the free-tram. If I ever get breast cancer in my good girl, I'm not going to reconstruct that side. I've had enough surgery and infections to last the rest of my life!",
      "MessageIndex": 18,
      "PostDate": "08/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724088",
      "Title": "For those who \"could\" have Lumpectomy.... why choose Mast? Estepp sbmolee"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 7, 2008 02:00PM swimangel72 wrote: ((((((((((((((Otter))))))))))))) - it's totally understandable about being in denial about your hair. I am really amazed at how you have tackled everything so far - with eyes wide-opened. To me you have been very brave and smart. So don't get down on yourself about being in denial, just take it one day at a time. I'm still in denial that I'll need Herceptin - I'm still waiting to hear from my oncologist regarding the second Fish report........but deep down inside, I know the answer will be positive. Last I spoke with him, he said he prefers to administer Herceptin with chemo - but hopefully I'll only need a \"light\" dose and won't lose my hair. I'll know more by the end of the week...........so I'm still sitting right behind you Otter - hanging on by my fingertips!",
      "MessageIndex": 128,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 24, 2008 04:26PM swimangel72 wrote: Navelbine is a funny name - but easy to remember. I did connect with other Her2+ women over at this web site (I believe some of you are already posting there): http://her2support.org/ I also work in a school, in support personnel (I'm a Computer Aide in a middle school.) There seems to be a LOT of teachers here at bc.org with breast cancer - and my goodness, I am soooo impressed with all of you who can balance teaching with breast cancer and chemo! So many of the teachers in my school have been wonderfully supportive to me, including my principal who is a 7 year survivor. I just found out today from my PS that I can not return to work this coming Monday after all (that would be 8 weeks since my surgery) - because my abdominal incision is still open and he won't risk me getting any germs at school. Now I don't worry about germs at school - since I started work there, I've been healthy as a horse, not so much as a sniffle (but then again, I keep my computer lab really clean - all 24 computers, keyboards and mice!) Still I have to go by doctor's orders, so I will be off the payroll now since I used up all my sick-days. It's ok - my salary has been just to help pay the college tuition - and I'm hoping to return to work at least by the middle of May. I'm blessed that my DH has been steadily employed for many years. I wonder if the scientists have looked at the breast cancer risks of different jobs? That would be an interesting study - like, what's the risk of getting BC if you're a teacher - or a nurse - or a doctor - or a secretary, etc et. - but I suppose the variables of location would make that an impossible task. Sorry to ramble - I'm known for that - and I hope everyone has a quiet, restful, healing night tonight!",
      "MessageIndex": 457,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Aug 6, 2008 05:06AM swimangel72 wrote: I'm sorry I haven't been keeping up with everyone on this thread, I forgot to check! My own chemo has had ups and downs........after switching oncs, I didn't realize they ADDED drugs to my Navelbine and Herceptin regime - specifically, Zofran and Decadron. The former (an anti-nausea med) caused me terrible constipation and 3 days later awful stomach cramping - and the latter (a steroid) prevented me from sleeping for 2 nights in a row. Also - they had to remove my mediport because the infection never did heal, so my infusions have been going into my veins. My arm was so painful the first week..........I ended up back on pain meds. But let me say I LOVE my new nurses........last Wednesday, at my request, they took me off the Zofran and Decadron (because the chemo never made me nauseous before) - and then instead of flushing my vein with a bag of saline before the Navelbine, they ran both through my veins at the same time. WHAT A DIFFERENCE! My arm felt fine - I had no constipation or stomach cramping - no more sleepness nights!  I was back to the manageable SEs I had gotten accustomed to at my first onc's office (painless diarhea for about 5 hours after treatment - some tiredness, some hair thinning and fingernails splitting.) I have only two more infusions of Navelbine - then it's just Herceptin every two weeks till next April - and Arimidex for five years. I'm not looking forward to getting any joint pains because I already have arthritis in my hips. I had minor hot flashes when I went through menopause so maybe it won't be too bad for me on the AI. I'm going to try to stay positive and try to keep swimming as much as I can - and try to lose weight. My goal is 25 pounds before next summer when my PS says he can do my revision surgery. I scheduled an appointment with a spine doctor - because the MRI on my lower back showed spinal stenosis and a herniated disc which may be causing the hip pain (it's so bad somedays I feel like a crippled old woman). This way I can start on physical therapy if necessary BEFORE starting on Arimidex. Also, my thyroid levels have dropped - I'm scheduled for a sonogram of my thryoid tomorrow - hopefully I won't need to go on even more meds. I'm looking forward to returning to work when school starts in September - but I'm nervous because I don't want to be the new \"poster child\" for BC......my co-workers are all wonderful, but I get embarassed by the extra attention. They haven't seen me since my surgery in March and inevitably they'll be looking me up and down to see if I changed. But the show must go on.........and so must I. Otter I hope your hair will start growing back soon - I'll be interested in reading about your experience with Arimidex and yours too Nancy. Some of the stories I've read are awful......but since my tumor was ER+ at 90%, I hope the SEs aren't too bad.",
      "MessageIndex": 1411,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 6, 2008 08:15AM swimangel72 wrote: Good luck with your port, Erika from da Bronx (my old home town!) I felt very uncomfortable with mine for the first few days especially in my neck where the catheter goes......and unfortunately my incision didn't heal (it's been over a month now) so my infusions have been going into my arm. Yesterday my PS cleaned the incision and afterwards, he held up a piece of brown thread and said, \"THIS is why your port incision didn't heal! They left something in there!\" YUCK!! I was so grateful he got it out and stitched it up - \"on the house\" he said. (My PS is a very kind and rare breed of surgeon- not greedy.) I plan on calling the radiologist who inserted the port to complain!",
      "MessageIndex": 6,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/706771",
      "Title": "i got my port today ekenny315 cupcake7"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 2, 2009 11:18AM - edited Dec 2, 2009 11:21AM by swimangel72 Welcome Gina and Kelley - and all new Stage 1 Sisters - I'm so sorry I haven't been on this thread in a while. Gina I just had my final reconstruction on Monday and I was also extremely nervous. I suppose the thought of anesthesia and infections never leave our minds..........but I'm happy to report that I woke up in the recovery room without any nauseousness, and very little pain. A bit of a twinge where they put in the drain, but otherwise, nada! Extra-strength Tylenol was all I needed after the first night..........and I think to myself, but of course, all my nerve endings were removed during the mastectomy! You could put ice on my foob and I wouldn't feel it similar to Mrs. Doubtfire, lol. I'm not allowed to get my bandages wet - my sweet plastic surgeon will perform my \"unveiling\" this coming Friday - so I'm looking forward to seeing the fipple and areola. It's been a long long journey, but I've been blessed with a wonderful supportive DH who makes me laugh every day - fantastic kids - and a job I love (with women there who have been through worse cancers than myself). I never joined a support group other than bc.org - like you Gina, I felt a bit guilty that my BC was \"only\" a Stage 1. Still I hope to convey messages of optimism and caution with my writings here - especially with surgeries that put all of us at risk for mrsa. Once again, everyone please check out www.hospitalinfection.org to better prepare yourself to avoid mrsa or c-diff. I will never ever again take hospitalization or surgeries lightly........no matter for what reason! I was a wreck when one of our teachers' needed surgery to repair his hip.......at the same hospital where I got mrsa............thank God he came through with flying colors! Now - I must admit - my worst pain these days is no longer my hip (that cortisone shot REALLY did the trick!) It's my upper neck.........and I know why it bothers me so much..........because I spend way too much time writing on my computer, lol! Have a wonderful day my sweet sisters! ",
      "MessageIndex": 640,
      "PostDate": "02/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Dec 6, 2009 10:17PM swimangel72 wrote:",
      "MessageIndex": 784,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 17, 2009 10:35AM swimangel72 wrote: Cheryl - hope you don't mind my posting here - I was on Dilauded when I was hospitlized with mrsa staph after my surgery last year but I'm sorry to say I don't know what dosage. At first they gave it to me through an IV - then later in pill form I believe 3 times a day. I didn't experience any of the SEs you are - except lack of energy - but that could have been caused by the mrsa. I was on this medication for about 10 days - but didn't go experience any withdrawal problems. Have you taken your temperature? I'm worried you have a REAL fever and not just side-effects from the Dilauded. I'll be praying for you to get through the next week.",
      "MessageIndex": 1,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734328",
      "Title": "Dilaudid SEs and Withdrawal Fears mason204 DaughterMom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 17, 2009 12:21PM swimangel72 wrote: Cheryl - I became extremely weak at one point after my bout with mrsa - thought it was my blood cell counts - which turned out normal. Thank God for an insightful nurse who told me I was \"slightly\" dehydrated and recommended Gatorade. As soon as I gulped half a bottle, I felt immediately better. So even if you can't eat as much as you'd like - watch your fluid intake and electrolytes - not sure if you can handle Gatorade - maybe Pedialyte would be better. Do you have a nutritionist helping you now?",
      "MessageIndex": 4,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734328",
      "Title": "Dilaudid SEs and Withdrawal Fears mason204 DaughterMom"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 29, 2008 08:57PM swimangel72 wrote: Thanks again Dakota - for my next PS visit I'll write my questions down on an index card to be mentally prepared! Sometimes, when I get in there, and everyone is so upbeat and cheerful - I actually forget what I want to say! So this time I'll be ready.....because I really need to get answers to my questions!",
      "MessageIndex": 27,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 13, 2008 08:54AM swimangel72 wrote: It really bothers me sooo much that chemo nurses act like they know everything! Unless they themselves are currently going through the exact same cancer txs as you, they have no right to be so inconsiderate! I hope you'll be able to sleep now Tooyoung......I'm so happy you DID have the breakdown......don't feel embarrassed or apologize - obviously it had a desirable effect on the chemo nurse and she was smart enough to admit she was wrong! Now if only MY snippy chemo nurse would admit she's been wrong - maybe I wouldn't be looking to change oncs!",
      "MessageIndex": 5,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707227",
      "Title": "I had a meltdown at chemo today... tooyoungtohavebc Rovergirl"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: This Post was deleted by swimangel72. 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706011",
      "Title": "Vision changes due to chemo? swimangel72 wishiwere"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 29, 2008 09:21PM - edited Jul 29, 2008 09:23PM by swimangel72 Wow I'm so happy to see I'm not the only one who had major issues with the nurses at the oncologist's office! I too loved my oncologist - he had a wonderful, warm bedside manner - but his nurse practitioner was very offensive..........downright rude........and dismissive to me. His waiting room was awful - the normal wait was 90 minutes to 2 hours.  It got so bad I switched oncologists - and now I'm happy to report that the new nurses are absolutely wonderful (maybe the honeymoon isn't over yet, but I never got a \"honeymoon\" at my old onc's office.) My new onc doesn't have the warm personality of my old onc, but on the other hand, he has performed more tests for me and seems to manage his office better - also it's only 2 miles down the road from my house, so I'm saving gallons of gasoline!  It was important to me to find an onc's office I liked because I go for treatments every two weeks - and this will continue until April of next year. Of course, not everyone is able to switch onc's - so my advice is to call your oncologist any time you are treated poorly - it's important they get the feedback from their patients! Edited to add:  TT - I read in another thread you're a graduate from Dobbs Ferry - and now I got shivers up my back thinking you're going to my OLD oncologist's office in White Plains! I'm sending you a PM to tell you his name (I don't want to start a smear campaign against this lovely man just because his nurse practitioner is so snippy!)",
      "MessageIndex": 5,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709837",
      "Title": "Hate My Onc's Staff TrixieTumor swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Feb 15, 2009 01:56PM swimangel72 wrote: Stephanie don't leave - I'm sorry if someone offended you - I love your posts, your honesty and your faith sustains me. But whatever you decide to do - do what makes YOU happy at this time of your life! I'll be praying for you!",
      "MessageIndex": 44,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729109",
      "Title": "I'm Done TripleNeg AliceJean"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 21, 2008 04:22PM - edited May 21, 2008 04:23PM by swimangel72",
      "MessageIndex": 7,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 26, 2009 01:37AM - edited Jul 26, 2009 01:45AM by swimangel72 Millie - you NEED to know what kind of infection you had. No one told me I had MSRA until I started complaining to the insurance company nurse (who called me every two weeks with an angel's voice!) She was worried about me and checked her files on me and lo-and-behold SHE was the first person to tell me I had contracted MRSA!  No thanks to ANY of the doctors or nurses! Of course they try to keep a low-profile about MRSA in the hospital (afraid of law-suits and bad press). I immediately went to the Records department at the hospital and got copies of all my hospital reports - there it was, spelled out in black and white - and all the notes from the specialists, including an infectious disease specialist. It wasn't until a year later this past May, when I was going for Stage 2 free-tram revisions, that my NEW plastic surgeon advised me to get checked again for MRSA with their infectious disease specialist. He had to swab my nose, underarms and groin - I was SHOCKED to learn that MRSA was cultivated (meaning alive but dormant) in my nostrils! I had to apply an antibiotic ointment twice-a-day in that area for 10 days, then get rechecked (it was then negative, thank God) before my PS would perform surgery. I was VERY angry that neither my breast surgeon nor old PS recommended that I get rechecked for MRSA............I was walking around with it in my nostrils for a YEAR! Don't these doctors have ANY conscience at all? Oh - and btw - vancomyacin isn't the only antibiotic they use - when they tried to give it to my prophylactically before my abdominal hernia repair surgery on July 10th, I immediately got a rash on my arm and the nurse stopped the IV and they switched me to ZYVOX which is very effective, but very expensive. Anyway Millie - try to get copies of all your operative/hospital reports. It's good to keep a file at home, especially if you ever need to go for a second opinion - or just to act as an advocate for yourself (which is so important in today's world of rush-rush medicine). Good luck and I hope you continue healing well! ited to add:  To understand WHY I get so angry about hospital-acquired infections please check out http://www.hospitalinfection.org/. Their 15 steps to protect yourself from infection is very helpful.",
      "MessageIndex": 16,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737893",
      "Title": "incision infections MillieD swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 14, 2009 11:48AM - edited May 14, 2009 11:57AM by swimangel72 Hi Nicole from another Bronx native (GO BRONX!) My old school is on Castle Hill Avenue - St. Raymond's - what a gorgeous church! My mom got married there about 50 years ago - and I was a brides-maid there for two of my high school girl-friends. My family moved to northern NYS many years ago - but I still get the news about my old high school. I am very impressed with your maturity and how you are helping your mom - and how close and loving your family is. And I TOTALLY understand about the unnnecessary stressful phone calls - my husband's family is like that. When he had knee surgery, the phone was so busy, I was frustrated - but he comes from a very close and loving Italian family so with the blessings come the frustrations. Hang in there sweetie - and I'll be praying for your mom to have an easy surgery! Let us know what the final pathology report says - many women on this site are very expert at reading the reports! P.S. Nicole you put tears in MY eyes with everything you've written so far - just want to send you a cyber-hug!",
      "MessageIndex": 19,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 10, 2009 10:53PM swimangel72 wrote: Hi Nicole - thanks for the update, I was thinking about your mom. What was her Oncotype DX results? Did she already start chemo and does it include Herceptin? I had a skin-sparing mastectomy with immediate recon lke your mom is thinking about - the \"added bonus of a tummy tuck\" really enticed me, but unfortunately, I ended up with a staph infection in my abdomen and now look like I'm 8 months pregnant due to the hernia that developed. I'm not trying to get you more worried Nicole - I just hope you can help your mom do the research to choose a VERY experienced plastic surgeon who has done HUNDREDS or THOUSANDS of these surgeries. There are many choices to make, even with the tummy fat - will your mom get a Diep flap (where they only remove the fat and no abdominal muscle) or a \"free-tram\" where they remove a small piece of muscle to help the veins survive - or a pedicle tram - where they remove the fat but leave it attached to the stomach muscle and tunnel it upwards through the abdominal cavity to create a new breast? I hope she can get the Diep - it really causes the least amount of problems with the stomach muscles afterwards. Here's a helpful web page my new plastic surgeon on Long Island developed: www.breastreconstruction.org Oh and there's another very experienced Diep surgeon in Manhattan at Beth Israel Hospital - his name is Mark Smith. Several women here have used him and have been happy. You could also go to the Breast Reconstruction forum and search for information there. Good luck - I'll be praying for your mom!",
      "MessageIndex": 37,
      "PostDate": "10/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733669",
      "Title": "For my Mom aka Superwoman Nicole_Bronx Nicole_Bronx"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jan 13, 2010 08:05PM swimangel72 wrote:",
      "MessageIndex": 6,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/746613",
      "Title": "help! open sores 5 months post-rads KS1 leslie43"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: It's been about a month since I had my port installed by a interventional radiologist. He closed the incision with surgical glue and the next day my PS put steri-strips across it. About two weeks later he removed the steri-strips, then the following week, he removed some of the glue (it was irrritating my skin.) Now I have one tiny area that healed beautifully - but the rest looks separated and scabby with what looks like old glue. It looks to me like I'm going to have yet another wound that failed to heal properly - and it's getting me really down. I'll be seeing my PS this week, so of course I'll bring it to his attention - but I'm anticipating that he'll have debride it, reopen it, and start me packing this incision too. Has anyone else had a problem with their port scar healing well? I'm so down about this - now that my abdominal incision is almost finished healing (took about 4months!) the thought of another wound problem is so discouraging. I know I shouldn't complain compared to what some of you are going through - but I am NOT looking forward to the summer - what with the chemo, the wounds, my bloated stomach, thinning hair.....somehow I seriously doubt I'll get back into a swimming pool this summer - never mind the beach. Someone said it very well - this isn't just a \"bump in the road\" - this is a NEW road I'm on - and I do NOT like this detour at all! 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 3, 2008 01:25PM swimangel72 wrote: Annie, I'm so happy you decided to stay longer! I still feel like a newbie here and am only now putting names with \"voices\" - and yours is a voice that makes me laugh and touches my heart. I have always prided myself as a literary person, which causes me to sit and ponder and ponder over every word I type, as is evident from how often I edit my own posts but I'm slowly beginning to realize, it's ok to make verbal errors on this board. I don't have to be a creative genius with language; it's ok if I find myself wordless at times, unused to finding the language that pefectly expresses empathy; it's ok if I don't have time to read all the threads in depth, or if I don't know everyone's names just yet.....what does matter is that I feel welcome here, never judged, always encouraged and supported - and even more - I feel humbled by the power of the strong souls of all my sisters here who have suffered so much more than me - wonderfully smart, beautiful, powerful women who have been whittled down to their bare bones - and even their bare bones are something astonishingly beautiful to behold.............even if the rest of the world denies us our dignity, as a result of this beastly disease, we are splendid and marvelous right here amongst ourselves - so thank you again Annie for staying aboard!",
      "MessageIndex": 29,
      "PostDate": "03/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704951",
      "Title": "Unsubscribing HeatherBLocklear sueps"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 6, 2008 04:43PM - edited May 6, 2008 04:44PM by swimangel72 Wow - that song says it ALL! And Annie you are so funny - thanks so much for making me laugh!  Oh - btw - instead of a song going through my head, an image of the bug in Kafka's story The Metamorphosis kept appearing in my mind as I lay on my back after surgery and tried unsuccessfully to get out of bed. My original post comparing my \"new\" life with BC to this short story was very depressing so I deleted it - now that I'm feeling better, I find the image funny, the way some critics believe Kafka originally intended the story.  ",
      "MessageIndex": 56,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704951",
      "Title": "Unsubscribing HeatherBLocklear sueps"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 28, 2008 10:09PM - edited May 28, 2008 10:10PM by swimangel72",
      "MessageIndex": 25,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Apr 5, 2009 12:28PM swimangel72 wrote: Cheryl I'm so happy you've joined your friends in the pool! I've been a lap swimmer for over 30 years so after my surgery and long recovery I couldn't wait to get back in the water. My LE therpaist did some research and was happy to report that the water is very helpful - it's like a total body massage and really helps the lymph fluid flow. My only complaint is that the chlorine is often too strong at the club where I swim and my skin gets very dry. I haven't been in the pool for over 2 weeks now due to a cough and tiredness that just won't quit. I see my onc tomorrow and hopefully he'll give me an antibiotic. Swimming is such excellent exercise for your entire body - and water aerobics is much harder than it looks! Only wish I could lose weight - it'll happen once I get back to Weight Watchers and increase my time in the pool. Vivo I much prefer swimming in an outdoor heated pool, or in a lake, but I can't stand cold water so for my lap swimming I always use an indoor pool.",
      "MessageIndex": 2,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/731976",
      "Title": "Swimming is wonderful! CherylG711 dreamwriter"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 4, 2008 04:12PM swimangel72 wrote: I'm so happy I'm not alone complaining about my port! It was installed in the hospital during an out-patient procedure by an interventional radiologist (whom I never met - I had no consultation concerning different ports, locations or anything. I've never had any follow-up with him at all - only my onc and PS have been checking on it.) The port was implanted into my chest with the catheter going up, over my collarbone, into my neck, about 5 weeks ago. It took about 3 weeks for the pain in my neck to disappear. The surgical glue they used irritated my skin - as did the steri-strips. I had my second infusion through this port a week after it was installed - and after that, the incision opened and oozed - prompting my PS to put me on 10 days of antibiotics. My 3rd and 4th infusions had to be done through a vein in my hand - NOT a good thing because I'm on Navelbine for four months, which is very dangerous to your veins. Unfortunately, the port still appears infected - and my PS won't put me back on antibiotics. They want to wait to let it heal itself with just Bacitracin ointment. I believe I see the incision looking a little more closed - but now it's hurting me - sigh - and I get down thinking by the time this stupid thing is healed, I'll be finished with the Navelbine! All the time I told my onc that I didn't want a port - but they said it was very important not to burn my veins. Once again I feel like I'm taking 10 steps forward, then 20 steps backwards!",
      "MessageIndex": 27,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694114",
      "Title": "Port-a Cath pain? TinaLee Kicks"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 6, 2010 10:32PM swimangel72 wrote: Thanks for the links MarieKelly - the articles confirm what my oncologist first believed, that it was very rare that my well-differentiated, ER+/PR+ tumor would be Her2+ - thus he was shocked at the first FISH report results (the FISH was ordered because the original IHC results were equivacal.) That's why he then ordered a SECOND FISH test done at a separate laboratory (not sure though if their testing methods differed) - but the results of the second FISH test came in with an even higher score of Her2+ (it was a 4.5 score I believe) which then pushed my onc into changing his recommendation..........however, he didn't go with the usual protocol of the taxols or adriamyacin with Herceptin - he gave me a \"light\" chemo - Navelbine for 4 months with Herceptin continuing for a year. I sometimes feel like I was in my own strange clinical trial.........but I had 3 separate oncs agree with my onc, so I felt there was no choice but to follow this advice. Chasinghope - it isn't hard to get a second opinion from another oncologist - I hope you'll be able to do this just for peace-of-mind. ",
      "MessageIndex": 14,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/753551",
      "Title": "Meaning of low Oncotype Dx score sling99 cuddyclothes"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 28, 2008 06:44PM swimangel72 wrote:",
      "MessageIndex": 23,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 21, 2008 04:21PM swimangel72 wrote: I had my third infusion today - the nurse said she couldn't use my port because the incision seems infected to her. Sigh....back to the vein in my hand. Didn't hurt too much, but now I have a prescription to fill for an antibiotic and instructions to show the incision to my plastic surgeon - I know he won't do anything (like stitching it up) - he'll probably have me just \"watch and wait\". At the slow rate my abdominal incision is healing - by the time my port incision heals, I'll be finished with the Navelbine! Which means I'd have gotten the port for nothing! OK - I know I shouldn't anticipate such a negative outcome - but sometimes by anticipating the \"worse-case-scenario\" I prepare myself better for disappointment. Still I'll be keeping my fingers crossed that it heals within 2 weeks in time for my next infusion. Sigh.....",
      "MessageIndex": 6,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 17, 2008 11:11AM swimangel72 wrote: My port incision is still oozing - and I'm getting down thinking that tomorrow they'll be giving me my chemo in my arm for the 4th time. This is getting ridiculous! Today I have a consultation with an oncologist closer to my house to get a second opinion on my treatments (and to see if he runs his infusion centers more efficiently and in a more friendly way). I wonder what he'll think about my port incision problem?",
      "MessageIndex": 12,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 11, 2008 10:58PM swimangel72 wrote:",
      "MessageIndex": 18,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 8, 2008 04:12PM swimangel72 wrote:",
      "MessageIndex": 2,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705245",
      "Title": "Chemo from John Hopkins IllinoisNancy AnnNYC"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 6, 2010 03:23PM swimangel72 wrote: I agree with MarieKelly's observations - that \"If I had to choose between believing the Oncotype score or believing the assigned grade, I would believe the Oncotype score.\" My situation is the reverse of yours - my tumor had a LOW grade (Grade 1) yet my Oncotype score was intermediate (22) - at first my oncologist said I didn't need chemo - yet he was confused because of this discrepancy. Thankfully he questioned his first advice to me, went through the paperwork on my case and saw that my FISH report was never received (due to errors on the part of my breast surgeon's office). When my onc finally received the results of my FISH report, he was shocked to discover that my tumor was Her2++++...........thus his treatment plan for me changed drastically - and I needed chemo for 4 months with Herceptin for a year. Therefore, it is important for you to get a second opinion - the discrepancy must be accounted for - at least to give you peace-of-mind. Good luck and I hope it turns out you really don't need chemo!",
      "MessageIndex": 10,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/753551",
      "Title": "Meaning of low Oncotype Dx score sling99 cuddyclothes"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 6, 2008 04:54PM - edited May 6, 2008 04:54PM by swimangel72 Otter I had to re-read the story online - and then I posted the link. The story isn't long - but truly, the real \"metamorphosis\" wasn't when the salesman turned into a bug overnight - it was how his family changed in how they treated him after discovering his \"condition\". This was the depressing part of the story to me......thus I deleted it. The funny part is how he is stuck in bed on his back with no way of getting up - that was me in my bed - until a super-woman visiting nurse put my arms around her neck and practically picked me up. I was laughing so hard, I thought I'd split my gut (which was already split anyway!)",
      "MessageIndex": 58,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/704951",
      "Title": "Unsubscribing HeatherBLocklear sueps"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 18, 2008 05:52PM swimangel72 wrote:",
      "MessageIndex": 2,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 1, 2008 09:39AM swimangel72 wrote: Well it's still not healed - I finished up a 10 day supply of Levaquin.....and the scar looks the same to me - red around the edges and opened in the middle. I just can't understand why it doesn't heal properly.  Maybe I need to be tested for diabetes - I read if you're diabetic, wounds don't heal well. I don't seem to have any diabetic symptoms (excessive thirst, constant need to urinate) but who knows? Or maybe it's just the chemo itself that's preventing it from healing, even though my blood counts have been all \"normal\". Guess I'll be calling my oncologist again tomorrow morning, sigh..... Anyone else have slow healing issues with their incisions?? ",
      "MessageIndex": 8,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 1, 2008 10:06PM swimangel72 wrote: Yes Otter - I'll be on Herceptin for a full year - so it would make it much easier to continue using the port. I'm just so bummed that it still hasn't healed - I do NOT want another infusion of the Navelbine in my arm......last time, my arm felt weak and pained - I needed meds to get to sleep. Chronic irritation sounds about right - my abdomen is almost healed now, but there are bumps and red spots where I just know a suture is trying to force it's way out. They used surgical glue on my port incision and it hurt like heck for about 4 days.....also the glue from the steri-strips hurt so much too until my PS removed them. So maybe my body is just rejected everything in that area.....it's right above my good natural breast which is not very large (a \"barely B\"). A wound specialist may very well be in my future - thanks for the suggestion Otter and I hope you're feeling well! Thanks Shannon for sharing your experience......I'd be interested in hearing your theory about why your port incision didn't heal well if you have the time to write it. The good news is that I'm truly feeling sooo much stronger and more energetic! I can't WAIT for my PS to give me the green light to get back to swimming!",
      "MessageIndex": 11,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jul 7, 2008 09:34AM swimangel72 wrote: Stephanie you are in my prayers - you have been an angel amongst us - I pray that an angel stand guard at your bedside to relieve you of all pain and worry. ",
      "MessageIndex": 94,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Nov 6, 2008 06:40PM swimangel72 wrote: I had a free-flap and was sent home with 4 drains but no antibiotics. Perhaps that's the normal protocol for implant reconstruction, I don't know, but  I wish my PS did put me on antibiotics - I ended up with a MRSA staph infection in my abdomen! I had been very clean at home - but it was too late; I got the infection either during my 7 hour surgery or afterwards during my 5 day stay at the hospital. So you are being very vigilant about cleaning your laundry - but be MORE vigilant during your hospital stay. Tell anyone who comes in your room to visit you that they need to wash their hands; most hospital rooms have antibacterial hand wash at the door to the rooms - don't be shy - you should even remind your doctors and nurses to wash their hands. Other women have taken antibacterial wipes and/or wipes with Bleach to wipe down things in their hospital room, including the railings, doorknobs, etc. Here's a copy of a recent article in AARP regarding MRSA and C. difficile: ------------------------------------------------------------------------------------------------------------------ THE VILLAIN: MRSA Methicillin-resistant Staphylococcus aureus (MRSA) can live harmlessly on the skin. But when it gets into the body, it can wreak havoc, causing fever, chills, and a full-body rash, among other symptoms. In healthy people, a properly treated infection is usually confined to the skin around a cut or a scrape. Those who have weakened immune systems or are recovering from illness should take extra precautions, however. Best Defense * Wash up Keep hands scrupulously clean (see sidebar for tips). If you're in the hospital, ask visitors and docs to wash their hands when they enter the room. * Bring your own snips Shared facilities are high-risk MRSA environments. Tote your own tools to manicure appointments, and wear flip-flops in the gym shower. And pack two towels-one for machines and a second to dry off with. * Don't pick Wash cuts and scrapes well; cover them until they're fully healed. Call the doc if... your skin develops pus-filled pimples or boils. MRSA is resistant to penicillin and certain other antibiotics but can be treated with other drugs.  Hand Washing 101 What they didn't terach you in kindergarten 1. Use warm water Excessively hot water is hard on your skin, and cold water inhibits the sudsing of soap. 2. Don't sweat the soap You don't need to kill germs with pricey antibacterial soap. Just dislodge them with a good lather. 3. Hit the hot spots Soap up every millimeter of skin, including the thumbs, the backs of the hands, and the undersides of nails. 4. Rinse repeatedly Use running water, and lots of it, to remove every last trace of suds (and germs). 5. Save your work Faucet taps can be loaded with germs. Use a paper towel to shut off the water. THE VILLAIN: C. difficile The Clostridium difficile bacterium strikes at the gut, triggering severe diarrhea. It lives harmlessly in many people's intestines, held in check by other bacteria, says Patricia Raymond, M.D., an assistant professor of clinical medicine at Eastern Virginia Medical School. \"When strong antibiotics wipe out what we call these ‘friendly flora,' C. difficile can proliferate.\" Best Defense * Keep clean Frequent hand washing helps. And if you're bed-bound in the hospital, keep a hand-sanitizing gel nearby for your own and others' use. * Don't be pill hungry Antibiotics can be lifesavers for those who need them. But if your doctor says they probably won't help you, don't insist on a prescription. * Add friendly flora If you do need an antibiotic, ask your doc about a probiotic, helpful yeast called Saccharomyces boulardii (commonly sold under the brand name Florastor). Call the doc if...you develop diarrhea that lasts longer than 24 hours or is accompanied by weakness, a racing heart rate, or blood in the stool. --------------------------------------------------------------------------------------------------------------------------- Here's a link to another AARP article written by a doctor on how to avoid infections in healthcare settings: http://bulletin.aarp.org/yourhealth/healthyliving/articles/finding_your_way_2.html",
      "MessageIndex": 5,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/723962",
      "Title": "Disinfecting laundry to prevent infection rayhope swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Mar 29, 2012 06:46PM swimangel72 wrote:",
      "MessageIndex": 525,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/754362",
      "Title": "anyone out there with auto-immune/chronic pain issues before dx? jessamine SuzyBlue"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Sep 29, 2008 06:34PM swimangel72 wrote: Thanks awb - I appreciate your response.",
      "MessageIndex": 2,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721950",
      "Title": "Hysterectomy & oopherectomy during Stage 2? swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 10, 2008 10:28AM swimangel72 wrote: Hi Puppy - thanks for writing! You had a bi-lat Diep, right? When was your Stage 2 - and did you get any lipo? Michele - I'm so sorry to hear about the cervix - years ago I had a bad pap smear too and the doctor did some kind of \"cyro-surgery\" - burning off the bad cells with something really cold. Another reason for me to get everything taken out. My brother and mother are worried for me though - they think I should just have all this done laproscopically - but I'll see what the gyno/oncologist recommends. I certainly don't want to risk another staph infection...........but I must have open abdominal surgery anyway to repair the hernia, and 2 other doctors said this is the way to go. I don't even know if they CAN do laproscopic surgery on me after my free-tram.........my stomach is still very tight and my original PS said it would make it difficult for the surgeon since my stomach isn't \"normal\" now. Maybe I'll post that question in another forum - someone on this board might have had a laproscopic surgery after their free-tram or Diep, do you think??",
      "MessageIndex": 8,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721950",
      "Title": "Hysterectomy & oopherectomy during Stage 2? swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 4, 2008 02:09PM swimangel72 wrote: bump for anyone with time this Saturday afternoon to respond, thanks.",
      "MessageIndex": 3,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721950",
      "Title": "Hysterectomy & oopherectomy during Stage 2? swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "May 18, 2008 07:45PM swimangel72 wrote: Oh Nancy - you just gave me the URGE to pull my own \"thread\"......I used to find it impossible not to pull that one hanging stitch in a thread even if it meant my hem would hang down! Lol! Still I don't think that is the surgeon's intention.....unless maybe if your stitches are all on the outside. Most of the internal stitches are supposed to be \"dissolvable\" - or so I thought - actually my own stitches that have popped through seem hardly dissolvable - they are as tough as fishing line, and when I pointed that out to my PS, his nurse said they are STRONGER than fishing line!",
      "MessageIndex": 4,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 17, 2008 11:04PM swimangel72 wrote: The new onc didn't say anything about the port when I showed it to him - but I didn't make it very clear how long ago I had it installed. He seems very competent - his office very modern, bright and clean. The nurses and secretaries were very friendly. This onc agreed with my first onc's original treatment plan - and said he would continue with the bi-weekly treatments. He did seem concerned that I didn't have any Pet scans or tumor marker tests done yet - nor that my old onc didn't do blood work on my \"off\" week to see how low my counts would go - but he said he'll do all that for me once we start. So tomorrow is my last infusion at my old onc's - at which time I'll get my dosage reports and say goodbye. I won't miss the long drive and long wait - but I will miss my old onc - he's a very sweet man! Thursday I see my PS and hopefully he'll be able to do something for the port. I'm getting tired of dealing with it!",
      "MessageIndex": 14,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Jun 17, 2008 11:30PM swimangel72 wrote: Thank you Lori - I appreciate your kind words. All-in-all, I must admit I feel so much better that I feel guilty complaining at all. Funny how once we feel better, we can \"forget\" all the horrors we suffered (much like childbirth)! So that I will never forget (and for the new onc's information) I typed up every thing that happened to me since my dx - it was 6 pages long! The new onc really liked having this written history (as well as copies of all my reports) - and it helps me to visualize the progress I've made in my \"transformation\". I still have a long way to go, but I do see the light at the end of the tunnel. This is funny - while I was showing my new onc my abdominal incision, he asked me \"do you see daylight\" and for some weird reason I thought he meant do I see \"daylight shining through my scar\"? So I started looking down at my scar again, thinking \"Daylight? Daylight? Do I see daylight?\" as though I could see THROUGH my own stomach out my back........then, duh! I finally GOT what he meant, and said, \"OH! You mean, can I see daylight at the end of the TUNNEL! Yes - I DO see daylight, finally!\" How silly is that?! Lol!",
      "MessageIndex": 17,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705743",
      "Title": "My port scar isn't healing swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "Oct 7, 2008 08:22AM swimangel72 wrote: Thanks so much Maria - I appreciate your response!",
      "MessageIndex": 5,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721950",
      "Title": "Hysterectomy & oopherectomy during Stage 2? swimangel72 swimangel72"
    },
    {
      "AuthorID": "swimangel72",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62935/profile",
      "Content": "swimangel72 wrote: I've been a bit anxious lately because after going over my old scans from February I realized that in addition to a large fibroid they found a larger-than-normal endometrium (at the top of the \"normal\" range) and small cysts on my ovaries. These will need surveillance every year since I'm post-menopausal. None of my doctors ever talked about these things - so I decided to ask my PS - while he's reopening my abdominal incision (because it needs a mesh repair) can I have a hysterectomy and oopherectomy done at the same time? He said yes - AND he said he'd also remove my gall bladder (which has a large stone.) A general surgeon told me the same thing - that yes, they can do all these surgeries at once, but first I have to get an appointment with an gynecological oncologist to get his opinion. I called his office but the secretary said they won't even schedule an appointment for me until I send them all my scan reports (which I did on Friday.) Hopefully I'll hear from his office next week and get in to see him soon. I'm nervous about all this surgery - because I'm so afraid of getting another MRSA staph infection. However, it just makes total sense to me to get it all over with at once - so I never have to think about abdominal surgery again. I'm hoping the surgery can wait until next summer so I won't lose time off from work (I work in a school) - but that depends on the surgeons' schedules - and if my abdominal bulge grows - and if I end up with a gall bladder attack (keeping my fingers crossed that I don't!) I'm also hoping that the PS will be able to reshape my foob at the same time - but that may be expecting too much in one surgery. Has anyone ever had to face so many surgeries at one time? I think I'll be OK under anesthesia - my free-tram took 7 hours - I can't imagine this surgery taking that long since micro-surgery won't be involved. I'll be relieved to get the uterus and ovaries out...........I'm so afraid of any other cancers! Any good or bad stories or advice will be truly appreciated! 3/3/08 Right-side mastectomy with immediate muscle-sparing free tram; 3/9/08 Developed abdominal MRSA staph infection and hernia;Completed 4 months Navelbine and 1 year Herceptin; Arimidex - 3 more years! Diagnosed at age 53 Dx 2/5/2008, IDC, <1cm, Stage IB, Grade 1, 0/7 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721950",
      "Title": "Hysterectomy & oopherectomy during Stage 2? swimangel72 swimangel72"
    }
  ]
}