{
  "AuthorID": "swolfram",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101055/profile",
  "Posts": [
    {
      "AuthorID": "swolfram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101055/profile",
      "Content": "Apr 27, 2010 11:33PM swolfram wrote: Hi, I'm new to this site although I have been reading posts for a month or so. I had a stroke while at work at the age of 57 in April of '07.  On 10/1 of last year I was diagnosed with breast cancer.  I was in a state of shock.  I had a lumpectomy, a reincision to get clear margins, radiation, and chemo.  I just finished chemo on March 16 (four rounds of taxotere and cytoxan).  After my last chemo and even though I had the neulasta shot, my WBC plummeted and I was in the hospital for a week and received several blood transfusions.  It is so nice not to have weeky blood work, doctor visits, hospital visits, and etc.  I am regaining my energy and getting back out and about.  My hair has just started to grow (more peach fuzz than anything) but still no hair on legs or body.  I did not lose my eyebrows. Look forward to posting in the future and getting to know all of you.",
      "MessageIndex": 2561,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "swolfram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/101055/profile",
      "Content": "May 16, 2010 03:05AM swolfram wrote: Just wanted to wish you all well. I was diagnosed 10/1/09 and had a lumpectomy and then a re-incision as I didn't have clear margins the first time.  I had radiation followed by chemo (taxotere and cytoxan...four treatments)l  I finished on March 16.  If I can offer any advice, it is to take your nausea meds as prescribed and to drink plenty of water.  I did lose my hair on the 12th day of my first treatment.  My ONCON score was 31,  I did lose 23 lbs.  I had a stroke at age 57 and was diagnosed with breast cancer last October 1.  I had a mammo on 3/30 after chemo and it showed no cancer.   My hair is just beginning tp sprout...thank goodness...still no hair on legs, under the arms, and etcl Keep the faith...you can do it. ",
      "MessageIndex": 285,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751649",
      "Title": "May 2010 Chemo fotopet leftduetostupidmods"
    }
  ]
}