{
  "AuthorID": "swt1prncss",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172169/profile",
  "Posts": [{
    "AuthorID": "swt1prncss",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/172169/profile",
    "Content": "Feb 27, 2013 01:28PM swt1prncss wrote: Beesie, This is my first post, and I found this website due to having received abnormal results.  I found a lump the size of a \"pea\" in my right breast, just after the birth of my daughter in 2009, and had a mammogram that June. I was told not to worry about it, so I didn't. Flash-forward, and we are now in 2013 with the \"pea,\" now the size of a \"nickel.\" I finally went back to a GYN on the 13th of this month, and had a mammogram on the 19th.  I knew when they scheduled the mammogram, that should the Radiologist find anything of concern, an US would follow. An US followed. The US tech scared the living daylights out of me when she stated that I definitely would want to follow-up with my GYN, AFTER I had infomed her that I was already scheduled to meet with my GYN within the next two weeks.  I went to the facility and requested the report, literally within the 24 hour window, and read the findings.  Upon reading the results, I have found that there is another identified lump in my left breast, (God help me the size of a \"pea\" that wasn't there in 2009) and I have a BI RAD 0. The Radiologist had my films from 2009, and the BI RAD is listed on the US, which occured after the new mammogram and with the comparison of the old...I am confused as to why the Radiologist would put 0 when the old films were there for comparison. Any ideas? He did recommend a right breast MRI as further follow-up recommended. There was no recommendation or concern noted in the identification of the new lump in my left breast (both lumps are in the retroareolar regions). I was contacted by my GYN the very next morning, and she recommended I meet with a surgeon, which is scheduled on the 11th of March, 2013, to identify the need for an MRI, or biopsy. She did not mention the presence of the \"new\" lump either, just referred me on. I wonder if you or any others have a take on this BI RAD score? I guess I am just seeking reassurance that this is normal and that my fears may be a overdramatic? My husband does not want to talk about it, unless the results come back positive for cancer, but I want preparation for the unexpected...Thanks to all in advance to any replies!",
    "MessageIndex": 5,
    "PostDate": "27/02/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800646",
    "Title": "Terrified! Pebbles123 swt1prncss"
  }]
}