{
  "AuthorID": "tabby",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
  "Posts": [
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Apr 22, 2009 07:44PM tabby wrote: NeoPat:  Sorry to hear you are having more surgery.  Does it ever end?  I know it does, but it seems like I've been cut a lot lately.  I'm still sore from sentinel node as well as the last lumpectomy.  Thanks for asking how I am doing.  I am doing better than I thought I would be.  I'm kind of \"nesting\" now--working hard in the yard and doing stuff I'm not sure I'll be able to do for a while, if that makes sense.  I have a lot of folks praying for me--I'm actually calmer than I was a year ago when my oldest daughter was getting married and my son was getting ready to leave home.  You say you are removing because of high risk cells?  I am removing both due to LCIS and of course the ILC, but I was going to do it anyway because of the high risk of LCIS--I'd rather attack cancer before it has a chance to attack me (further).  Hope you are sane through all of this and that you have lots of people praying for you--I will be. ",
      "MessageIndex": 5,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "May 12, 2009 01:15PM tabby wrote: Lursa:  Thank you for the encouraging words.  I am very independent so this lying about is getting to me a bit.  I am grateful for all the prayers, kinds words, food, and especially my family.  My husband, children, and mom have been great.  I know not everyone has that in their life. Jayne:  I'm so happy you are doing so well!  May you continue to do so.  I had tissue expanders as well and like you am glad to see a little something there--underscore little-ha ha! Best wishes to the rest of the May girls!  You can do this!  The worst is the two days before and the two days after.  After that, it's all downhill.  I'll be praying for you.",
      "MessageIndex": 82,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Apr 21, 2009 06:40PM - edited Apr 22, 2009 07:34PM by tabby Bilateral masectomies with expanders on May 7.  Kissing cancer goodbye.......hopefully.....doing all I can",
      "MessageIndex": 1,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Apr 23, 2009 07:14PM tabby wrote: Hi Cherneski:  Sorry you are so scared.  You and I have the same diagnosis--not the kind of thing most people bond over-huh?  How did you find your ILC?  Looks like you haven't known very long.  You are going to beat this thing.",
      "MessageIndex": 11,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "May 11, 2009 06:18PM tabby wrote: Just had the bilateral masectomies this past Thursday.  I won't lie to you.  It was a lot of pain and I had 6 drains so that was a lot to deal with.  I was really anxious a couple of days before and e-mailed the breast surgeon to ask her when I'd have to take that first look.  I figured I would be really bandaged, but no.  She said the plastic surgeon did not want any pressure put on the tissue expanders.  I was able to take a look while in the hospital.  It wasn't that bad.  I sort of look like an olympic swimmer.  I was also reluctant to just go home after one day.  My surgery was in the ambulatory surgery center at Duke University.  My surgeon said that they do that to reduce the risk of infection, but if I was not ready she would transfer me over to the main hospital.  She did not want me to do it (it was also graduation weekend for UNC and Duke) so I decided to go home.  I left with a class II narcotic (delaudid--sure I'm not spelling it right), then I switched over to vicatin.  I am also on an antibiotic as long as I have the drains.  I began having some sharp pains in the esophogus area that lasted only a couple of seconds.  I'm not sure if its from the trach since it's so low or if it's reflux (never had it before) but I'm taking Zantak just in case.  Anyway pain has decreased, I can get out of the recliner (where it has been most comfortable for me since I've been home) without it killing me.  I am breathing deeper and feeling like I'm glad this will be over soon.  The drain liquid is decreasing.  I do not regret my decision and am thankful I have such a loving family and neighbors.  They are just great!  I know my Heavenly Father loves me and that Jesus Christ had carried me.  May you all be blessed in your journey.  I'm sorry this is your path, but you can do it.  You are in my prayers. ",
      "MessageIndex": 79,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "May 17, 2009 05:42PM tabby wrote: Nanabolini:  You can do this.  I had my bilateral masectomies on May 7 and things are much better now (pain wise).  Let others help you the first week or so.  I will be praying for you and the others who are going down this path.  May God bless you.",
      "MessageIndex": 101,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Jun 2, 2009 04:19PM tabby wrote: Hey ladies, just checking in.  Had bilateral masectomies on May 7 with tissue expanders.  On May 29 went in for the first fill but I have an infection instead.  Recheck today reveals that things have not gotten worse but is only slightly better.  PS gave me less than 50 percent chance of saving the tissue expanders although he can try the iv drugs and pic line and may have to as I will see him on Friday.  Please pray for me that I can save these tissue expanders.  I'm so disappointed to have worn this IRON BRA only to have to take it out and start all over! Lursa:  You are in my prayers.  Thank goodness you were not alone when all this happens.  Oh the things we have to live through.  So happy you are okay.",
      "MessageIndex": 160,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Apr 22, 2009 07:45PM tabby wrote: Lovinmama:  I hate to hear you having so much surgery at one time.  I hope you are okay.  You are in my prayers.",
      "MessageIndex": 6,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732869",
      "Title": "May 2009 surgery lovinmomma dkhancock1948"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "tabby wrote: I have had both breasts removed and have had reconstruction.  Just found a lump and had a biopsy and they say it is a spindle cell lesion (non-cancerous).  Has anyone had this to happen? Dx 3/4/2009, ILC, <1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/766870",
      "Title": "Spindle Cell Lesion tabby Shirlann"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 2, 2009 08:38AM tabby wrote: Jeanne:  I know the waiting is killing you.  Can you make phone calls to see if they can see you earlier due to cancellations, etc.  I'm a pro-active type and this wouldn't work for me.  I guess I have been blessed because where I was diagnosed is a teaching hospital (I don't know if that makes a difference, but I'd like to think so) and they move right along with me when I tell them I want something done ASAP.  I don't understand why they are not biopsying the calcifications as well.  Why are they waiting for six months?  In my last mammo there were calcifications in my left breast.  We biopsied and they were benign but they did diagnose me with LCIS.  Now the breast surgeon had me go for an MRI which showed another cyst in the same breast.  They think it is a fibroadnoma, which is benign, but who knows?  They were going to send me for another ultrasound and then another biopsy.  I contacted my breast surgeon and told her I wanted it removed and did not see going through all of this process since I wanted it removed.  She decided I still needed the ultrasound (because she would need to know if she could see the fibroadnoma with that or if she'd need the MRI to remove it) but that I could skip the biopsy.  Maybe you need to tell your surgeon what you want to do and that you are not pleased about waiting as the worrying is working on you.  May you be blessed with good news and quickly!! ",
      "MessageIndex": 4,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729474",
      "Title": "Waiting...rambling jwnh tabby"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Jul 1, 2009 07:11PM tabby wrote: Angie:  Congratulations on making it to the \"end\"!  May you be blessed with knowing what you learned during this trial in your life and cherish every moment of the life ahead of you.  You are a SURVIVOR!  Again, congratulations.  When you feel you can, please come back and help another sister with your knowledge.",
      "MessageIndex": 5,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/736762",
      "Title": "I am done angie27 Maire67"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Jul 20, 2009 06:36PM tabby wrote: taraleec:  So sorry to hear things have gone so wrong for you lately.  You have every right to be upset about it but don't stay there.  Use this anger to get some help for yourself and your son.  Help is available but unfortunately we have to work to find it sometimes.  Let everyone you know know what's going on and let them help you.  I like the idea of the doctor writing a note to the judge to delay custody issues until the person is healed--that really makes sense because we all know cancer is such a strain on us emotionally, economically, as well as physically.  My prayers are with you!!",
      "MessageIndex": 8,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/737630",
      "Title": "Sorry hysterectomy surgery dr mistake INJURY, Help please. taraleec nancypat"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 2, 2009 10:54AM tabby wrote: I also have a fibroadnoma (they think) and I had one two years ago in the opposite breast.  I am very proactive and decided to have mine removed two years ago.  Now, two years later, I have had calcifications in the left breast (and after biopsy, have been diagnosed with LCIS). I had an MRI which showed the fibroadnoma? as well in the left breast.  My surgeon sent me to do an ultrasound (then they were going to do a biopsy on this fibro.. as well but I told her to get it out while she is going in to take out more due to the LCIS diagnosis).  I know, complicated story.  But the answer to your question is Yes.  Both times that I have had a fibroadnoma (if that's what this is this time) they have sent me for an ultrasound and it showed up.  The first one (two years ago) did not show up on mammogram although I could feel it.  It showed up on ultrasound.  May you be blessed to be strong and make the decisions that you feel at peace with.  I'm sorry this is happening--I feel your pain.  Tabby",
      "MessageIndex": 4,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729949",
      "Title": "Can doctor see fibroadenoma on US? comeonirene Stumped"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 7, 2009 09:31AM tabby wrote: I am in the process of doing genetic testing.  From what I understand, there are only some things they can identify at this point that are genetic mutations and that as time goes on they may be able to identify other \"markers\" that may give you and your family some understanding as to what may be \"passed on\" to their children.  Also, I found it interesting that while this is useful information for my daughters, my son also would be at increased risk for prostrate cancer should my testing be positive.  If you have not yet me with the genetic counselor, please do so as he/she can give you the family \"mapping\" that includes those in your family with whom they are concerned may be \"linked\" to cancer.  I had some on my father's side which for years I had reported to doctors (but they always said it didn't matter because it wasn't on my mother's side--guess what, it matters!) and those with cancer on my mother's side they just didn't seem to matter since they smoked and were all diagnosed with lung cancers.  This teaches me to listen to my own self!  For years I knew something was fishy with the 2 aunts and cousin diagnosed with bc at about the same age--45.  So, even if my test comes back negative, I know something's smelling!!  Just had a diagnosis of LCIS and found and removed lump--waiting on diagnosis on that then got to make some hard decisions.  Wish I didn't have this to go through but it is what it is--hopefully it is a blessing in disguise. ",
      "MessageIndex": 19,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729198",
      "Title": "BRCA1 & 2 testing shelloz1 gfigman"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 7, 2009 09:33AM tabby wrote: Sorry, it's going to cost me about $625 as I have met deductable with other testing and now I pay 20 percent of the over $3000.",
      "MessageIndex": 20,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/729198",
      "Title": "BRCA1 & 2 testing shelloz1 gfigman"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Apr 18, 2010 10:56PM tabby wrote: Hi all.  I, too, am (was) a stage 1er.  Had bilateral masectomies by choice (also had LCIS) and have had over a year now tied up in hospital/surgeries/etc. and you all know this drill well.  Did not have chemo (did not have too and the breast surgeon said she'd kill me if I did) but am still struggling to get the reconstruction thing to work (have had infections and retries and currently am getting ready to be off all antibiotics and praying that nothing else rears it's ugly head) and am also getting the monthly Zoladex shots until everthing clears and I can yank out the ovaries.  I'm looking forward to all this stuff being over and trying to get on with life.  I am feeling blessed to have all this support from all of you sisters and I pray for everyone here and others dealing with this awful disease and the effects of treatments.  May we be understanding of each others' feelings and decisions as we all deal with this in our own way and may we be blessed AND HEALED. ",
      "MessageIndex": 2482,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 2, 2009 11:23AM tabby wrote: Sorry you have had a hard time.  We can ALL relate!  When anything is \"found\" thank goodness they respond quickly.  I am especially glad they responded quickly for you at such an early age.  I have always been \"lumpy\" since I am fibrocystic, so I started young to the mammo's.  Two years ago I found a lump which did not show up on mammo but did on ultrasound.  They also found calcifications in the other breast.  This threw me into the crazies!!  With something wrong in both breasts I'd have to be more than lucky to come out okay.  I felt the odds were against me.  I am very proactive and wanted to be seen right away.  I was able to have a consult with a breast surgeon the same day and double biopsies the following day.  The calcifications were benign and the lump was a fibroadnoma.  I decided to have it removed and did so.  The surgery was outpatient, the scar is about an inch long.  I would advise putting mederma (something for scars) on it.  I think it would have faded quicker.  I understand your need to be \"vain\" as you put it.  We are only given one body and we need to feel as good as we can about it!  However, your scar will remind you of how hard that trial was and how you faced it and WON.  Now, it's two years later and another diagnosis (LCIS), more benign calcifications, and after an MRI, another fibroadnoma?.  That's coming out on Wednesday, then there's long-term decisions to be made.  I wish you well.  You are so young.  Stay on top of your health.  You are the one that will benefit/pay for it otherwise.  You as well as all of these ladies are in my prayers. ",
      "MessageIndex": 10,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729500",
      "Title": "new here - worried, please read sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Mar 7, 2009 09:45AM tabby wrote: I too am considering masectomies.  I have been diagnosed with LCIS (Jan. 2009) and have had two bouts of calcifications and two fibroadnomas (if that's what they just took this week!).  The LCIS is not cancer (yet) but puts me at high risk.  I am in the process of doing the genetic testing and don't know the answers on that one yet.  I just had a lumpectomy for the fibroadnoma? and they took some tissue where the LCIS diag. was made.  I am told that I can look forward to tamoxifin (or something similar) for five years, I can do clinical trials (such as random biopsies), and of course, close follow-up.  I find these options invasive and don't think I want to wait until cancer finds me (if it hasn't already).  My biggest fear is hanging on to my breasts only to hear that I now have cancer (then knowing I could have done something to avoid it), so I am thinking let's just get rid of the source.  It's not a great choice, but it's a choice I get to make instead of having it mandatory at some point--maybe I can save my skin or something this way and not have to go through radiation/chemo.  Best of luck to you.  Hopefully you (and selfishly me too) will hear from someone who has made this decision and how they are feeling about it. ",
      "MessageIndex": 41,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/727659",
      "Title": "Bi-lateral prof mast? runalot08 runalot08"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Jul 27, 2009 02:54AM tabby wrote: daughter 16:  How sweet of you to do this for your mother!!  I too felt mutilated with my bilateral masectomies, even though I saw the pictures of others beforehand.  I am totally happy with my decision to have the masectomies, but it seems like in this century we could do better.  The best you can do is what you are doing:  loving your mom.  Let her take her time and heal emotionally and physically.  Get her on-line or with a good support group or therapist.  A lot of hospitals have these support services, but I've learned you have to search them out sometimes.  Please let your mom know she is beautiful with or without breasts!  We all have to learn that lesson and find a way to get beyond our visible scars.  Again, bravo for wanting to help your mom. ",
      "MessageIndex": 4,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737806",
      "Title": "Beautiful Mastectomy Bras? daughter16 daughter16"
    },
    {
      "AuthorID": "tabby",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79437/profile",
      "Content": "Jul 28, 2009 02:17AM tabby wrote: daughter16:  It angered me so to hear that your mom (or anyone else for that matter) felt \"judged\" at a support meeting.  Are you kidding me?  Cancer is cancer.  Everyone's experience is different and IMPORTANT.  Oh my goodness--MOVE TO THE SOUTH!!  By the way, went to Wal-Mart today and found some camisoles (one in the fitness area that has a racerback back to it and places where you can insert pads (just like a bathing suit).  I had previously found some cheap silicone inserts for bathing suits, so I may try inserting those to see how they make me feel.  I also found another shelf bra camisole that I'm wearing right now.  I did not put any prosthesis in there and unless you push on it no one would know.  It also alleviates having to wear a bra around me right now.  That might help your mom before she is really ready to be fitted.  I have not yet been fitted but am getting ready for that.  There are some things that don't look quite right without anything.  I am fine, though, wearing nothing--I feel like I deserve that right at this point.  Let others think what they may.  Is your mom active in a church or anything or does she have someone she knows who has been through breast cancer that she might could relate to?  Maybe she just needs to make a connection (as we all have--I have through this site as well) with those who are having similar feelings.  Either way, you both are in our prayers.  Tell her I said she is a beautiful sister of mine and to hold her head high!",
      "MessageIndex": 6,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/737806",
      "Title": "Beautiful Mastectomy Bras? daughter16 daughter16"
    }
  ]
}