{
  "AuthorID": "Tamara",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
  "Posts": [
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jun 5, 2009 07:14PM Tamara wrote: Are you getting a Neulasta and/or Nepogen shot?  Those medications help keep your WBC from dropping too low after the chemo and can cause a \"spike\" in the WBC.  Mine would spike to 23 and the onco said this wasn't anything to be concerned about.  I dropped really low after my first tx (.7) even with the Neulasta shot - so we added the Nepogen injection too.  The time I saw the spike to 23 - I had my blood drawn on day 4 rather than day 7 because I needed to get results to now if it was \"safe\" for me to go to work.  I was always back in the normal range by day 14. Call your doctor if you have questions or concerns - don't worry about \"bothering\" them - I found that they often could ease my worries or help with the SE if I just asked. Good luck",
      "MessageIndex": 1,
      "PostDate": "05/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/735400",
      "Title": "White Blood Cell Count Skyrocketed, Please Help bqswnnhn09 Madge24"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Mar 6, 2009 04:02PM Tamara wrote: Congratulations, Binney.  I know that you have helped so many of us with your sound advice and reassuring words.  The recognition is well deserved. Tamara",
      "MessageIndex": 18,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/730259",
      "Title": "CONGRATS TO OUR DR. BINNEY! OneBadBoob gracejon"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Sep 17, 2008 06:07AM Tamara wrote: I had the oncotype test done in July - you can request the test and they will request your lab sample and contact your insurance company.  They won't start the test until they have confirmed what coverage you have, what it will cost  you and then verified with you that you want to continue with the process.  They also have some \"financial aid\" programs, so depending on your insurance coverage and financial situation, the test may not cost you anything.  My impression when I spoke with them - is that they really try to work with you regarding the cost.  Fortunately, my insurance covered the test (I have United Healthcare).  I am someone who prefers more information rather than less - so even though I was pretty sure that I was going to do chemo - I wanted more specific information on my re-occurance risk and what the benefit of chemo was going to be.  My test came back in 10 days and was a 25 - right in the middle of the intermediate range and confirmed for me that going forward with chemo was the right thing to do.",
      "MessageIndex": 2,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721350",
      "Title": "Oncotype DX ckern Coltsneck"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jul 29, 2008 04:59PM Tamara wrote: Passenger, I have just started my TAC tx with one down and 5 to go.  Similar experiences to others: Nausea day of tx (my treatment day is Friday).- got Aloxi in my drip and Zofran to take at home but I may have waited too long to take the Zofran and did have vomiting the first night.  Next tx, I am taking the Zofran when I first get home since now I know for sure that I will have break thru nausea and the drip isn't enough fo me.  Days 2 & 3 & 4 - tired and not much appetite; some GI issues with constipation & diarrhea - but nothing that over the counter medications can't help with. I have also faithfully been using the biotene toothpast and mouthwash and haven't had the mouth sores yet that some complain of. Day 5 - I worked from home about 6 hours I also had the Nuelasta shot on day 3 but my white blood cell count still dropped very low so had to have Neupron shots too on days 8, 9 and 10.  I will have another blood test this week - so hopefully they have rebounded.  I am scheduled for my 2nd tx in a 1 1/2 weeks. So far - very doable. Good luck to you! Day 6 - Felt back to normal",
      "MessageIndex": 8,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/714642",
      "Title": "TAC treatment??? Help! Passenger59 BikerChick"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jul 8, 2009 08:37AM Tamara wrote: I found a \"fishing shirt\" with long sleeves with uv 50 at Sam's Club - it was much less expensive than the ones I found on-line or at the sporting goods stores.  The size selection was minimal but I was using it for a bathing suit cover up - so getting a larger size wasn't a big issue.  Good luck -have fun!",
      "MessageIndex": 5,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734923",
      "Title": "sun protection clothing pattih Tamara"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Oct 23, 2009 06:12AM Tamara wrote: I also received a heart shaped pillow after my lumpectomy & axillary node dissection from the volunteers from ACS at the hospital.  It was the perfect shape and was very comfortable. ",
      "MessageIndex": 7,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742617",
      "Title": "Heart-Shaped Pillows choca1711 SLL101984"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jul 29, 2009 06:07AM Tamara wrote: I also had the 6 rounds of TAC with tx every 3 weeks.  But, I also don't know how the onco pick which regime to recommend. ",
      "MessageIndex": 4,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/738059",
      "Title": "TAC??? buccaneersdj NatsFan"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Apr 10, 2009 06:43PM Tamara wrote: My last chemo was 10/31 and I stopped wearing the wig about 3 weeks ago.  My hair is coming in pretty much the same color (brown) and texture (straight).  I always had longer hair and used volumizing mousse before using a hair drier to get some body in my straight, limp hair.  So, with hair this short, that doesn't need to be dried - I am not sure what kind of hair product to use to try and give it some shape and keep the ends from being - not really frizzy more like lamb's wool (would that be wooly?).  Any product recomendations for short hair?   ",
      "MessageIndex": 1568,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jan 6, 2011 06:06PM Tamara wrote: I am also a recent  member to this group.  I was 2 1/2 years out from my surgery and thought that I was past having to worry about lymphedema but over Thanksgiving developed swelling.  I have been in PT since mid-December and almost all of the swelling has gone down - only one stubborn area around my elbow is still at 1cm larger than before.  I have been doing the self massage, stretching exercies and wearing the sleeve except for sleeping and showering.   I was worried about wearing the sleeve in public and I work at a job where I interact with alot of different people everyday so I thought I would have to keep explaining the sleeve.  But, actually it hasn't been too bad.  Some people ask about it but most don't and most assume I have tendinitis or carpel tunnel.  When asked about the sleeve -if it is someone I know well and the circumstances appropriate - I educate them on lymphadema but otherwise I just say that it is to reduce some swelling I have in that arm and move on to another topic.  Of course - it is long sleeve weather right now and less noticiable - I  may not be as comfortable in short sleeves in the summer and am really worried about our annual Hawaii vacation where we spend hours at the beach.  Oh well, cross that bridge when I get to it.  Thanks to all of you who post so much valuable information here - it has been very helpful to come back to this site and find support and information.  ",
      "MessageIndex": 10,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/762919",
      "Title": "Does the swelling ever go away???? nannajean Marple"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jan 7, 2011 06:36PM Tamara wrote: Kira, Thank you for the response.  My PT hasn't used the wrapping yet - since the swelling was mild and the sleeve and massage seemed to be getting under control - we decided to wait on the wrapping.  If I stop making progress with just the sleeve and massage - she suggested trying night sleeves and/or wrapping.  She also has me using some foam \"chips\" on the stubborn spot by my elbow at night.  Seems odd - but it has helped too.  When I bought sleeves right after my surgery - I got one in a bright blue but never wore it and now it seems too tight.  I have been wearing the beige one I got at the same time and had worn several times when flying - it is more stretched out from wearing, I assume.  I am working at getting re-fitted though since it has been 2 1/2 years since I bought those.   I have seen other providers that have a variety of colors in the custom sleeves but beige is easier than trying to match sleeves and clothes!   I don't burn easily but have gotton much better about protecting at least that side when in the sun - I have a oversized shirt that has that sun block fabric that I wear as a cover up.  Anything to be aware of when picking out sunblock if I am wearing the sleeve?  I wasn't sure if lotions etc were a problem with the sleeves. Thanks Tamara",
      "MessageIndex": 15,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/762919",
      "Title": "Does the swelling ever go away???? nannajean Marple"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "May 7, 2010 04:57PM Tamara wrote: Of course you are in a panic - this dx scares all of us into a panic!   It isn't unusual to have some time between dx and surgery or chemo - it actually may benefit you to have some time to get multiple opinions and think through all the treatment options.   You don't want to wait along time - but a few weeks is very  normal.  I was dx on May 30, 2008 and had my surgery in mid-June and then chemo in mid-july (they won't start chemo until you are healed from surgery).  I had to wait a week before I saw my surgeon after the dx because he was leaving on vacation - that week gave me the opportunity to do some research and schedule a 2nd opinion.  When I met with the surgeon - he talked me through all the options for treatment and referred me to an oncologist.  You will have so many questions - but you will get them answered and then be able to make the best treatment decisions for you. You will feel much more in control of the situation once you can talk through options with your doctor. I am so sorry that you are having to go through this ordeal.  There is lots of support on this site - so you have come to the right place for information and support. Tamara",
      "MessageIndex": 2,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/752347",
      "Title": "Dx yesterday and really in panic jeanwash jeanwash"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Dec 18, 2008 11:48PM Tamara wrote: Hillary, The others have done a great job at explaining why surgery isn't always enough and we need chemo and/or rads to ensure that all the cancer cells are gone.  I had a lumpectomy in June followed by chemo and am now about 1/3 of the way through rads to be followed by tamoxfin. I still have numbness in my armpit and the back of my arm - when they do the surgery on your nodes - nerves are damaged and it takes a long time for them to repair themselves - so you are  numb in those areas. Perfectly normal side effect of the axillary dissection. Good luck with your tx Tamara",
      "MessageIndex": 4,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726027",
      "Title": "Just had lumpectomy and still confused ccdh MBrads"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jun 11, 2009 09:23AM Tamara wrote: I am further out from radiation than you are - I finished in mid-January but I just got back from 2 weeks in Hawaii and we spent every day at the beach.  A couple other precautions that I took were - I wore a long sleeved rash guard when snorkeling and I bought a large \"camp shirt\" that had fabric with UV protection and wore that when sitting in the sun. ",
      "MessageIndex": 2,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/735688",
      "Title": "Sun exposure on vacation? udpt82 Dawnmrn1"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jul 11, 2008 10:13AM Tamara wrote: Emath - I am sorry that you are having to go through this.  I was diagnosed on May 30, 2008 so am relatively new to this diagnosis myself.  The initial shock is totally normal and I think it is a normal coping mechanism your mind uses to help you get through it.  I still find myself not quite believing that this is really happening.  I also lost weight after the diagnosis - which is typical for me when under stress.  You will need  your strength for the upcoming treatments - so take care of yourself physically and emotionally.  I was concerned about being underweight because In didn't really need to lose weight so I have been very conscious of trying to eat healthy, calorie laden food - especially  high protein food. I have put peanut butter on my toast in the  morning, yougurt and nuts for snacks etc. ",
      "MessageIndex": 1,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/708902",
      "Title": "Ok, so I have cancer emath jdg1"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Feb 16, 2011 05:03PM Tamara wrote: I did 6 rounds of TAC about 2.5 years ago.  For me, the first few days after the treatment were the worst - fatigue and some loss of appetite & nauesa (but the meds really helped with that - we added a few meds after my first round).  I had my chemo on Friday - rested all weekend; participated in a couple of work related conference calls on Monday, worked from home on Tuesday and sometimes Wed - back to normal by Thursday and really felt pretty good until the next round.  I did have some challenges with low white blood cell counts and a couple of times - even though I felt fine, I had to work from home during week 2 because of concerns about too much interaction with people and their related germs (I have an office job but related to retail and that just seemed like too much exposure when my counts were down). Some tips that helped me: 1.  I kept a box of ginger snap cookies by my bed - keeping food in my stomach helped with the nausea and the ginger (get cookies with real ginger - not artificial flavoring) seemed to help. 2.  I used biotene toothpast and mouthwash - didn't have any problems with mouth sores. 3.  During the last few rounds - constipation was a problem - wish I would have used the Senokat Stool softners sooner in my tx to help prevent.    4. Drink lots of fluids. Good luck - hope your tx goes smoothly - it really will be over before you know it.",
      "MessageIndex": 11,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/764926",
      "Title": "TAC X6 ?? Thundershowers Leslie1010"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jun 29, 2009 09:15AM Tamara wrote: I also noticed the same pattern - after my lumpectomy, my left breast was smaller and seemed \"perkier\" than my right breast because less weight for gravity to pull down.  But, after radiation, by left breast was swollen and larger than my right and much harder.  I finished rads 5 months ago and believe that the swelling  has gone down and while my left breast is still firmer - I think it has softened up some over the 5 months.  My understanding that this is all caused by the tissue's reaction and recovery to the rads. Tamara",
      "MessageIndex": 4,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/736653",
      "Title": "Breast bigger after radiation rgiuff kimaesha"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Aug 5, 2008 09:28AM Tamara wrote: I normally post in the July Chemo thread - my first tx was 7/18 but pop into yours ever now and then since you all are 2 months ahead and I pick up some clues of what to expect down the road. (and you have some pretty entertaining dialogue in your group if you don't mind me eavesdropping :)  My question is for Sue since I see she is getting ready for her last tx of TAC.  I am also on 6x of TAC - getting ready for 2nd tx this Friday.  My first tx went fairly well with few SE that just lasted a couple of days.  Do the SE get progressively worse?  Or, can expect the other tx to go like the first?  The only other medications I am taking is the dex the day prior, day of and day after tx and Zofran for the nausea. Thanks and congratulations on being almost done! ",
      "MessageIndex": 1962,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Feb 19, 2011 10:04AM Tamara wrote: I also had 6 tx of TAC and 2 years out from chemo still have low WBC. I don't know how the math works - but I guess there are several individual counts that then total up to a total WBC - my individual counts for neutrphils (sp?) are within normal range so he isn't worried about me being vulnerble to infection - I am not \"neutopenic\" but the overall score is slightly below normal.  Interesting to note as well - in the almost 2 1/2 years since I have finished chemo, I haven't had a cold, flu or any other type of infection - I work in a retail environment and my husband works with children so I have to think I have been exposed to alot of germs - but my immune system seems healthy even with the low WBC. ",
      "MessageIndex": 8,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765058",
      "Title": "Low White Blood Cell Count - Over Two Years Out? azs40 TammyLou"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Apr 13, 2009 03:58AM Tamara wrote: I avoided retail stores and any place with large crowds, used alot of hand sanitizer if I was in a public place.  I also didn't eat any uncooked fruits or vegtables and was very careful about eating out.",
      "MessageIndex": 4,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732308",
      "Title": "What precautions do you take when your white count is down? Laurie09 vbabey"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Jul 7, 2008 06:27AM Tamara wrote: I also had the sentinel node biopsy  with the radioactive dye at the time of  my lumpectomy.  It stung alot but only last a few seconds and was over - so I agree that it wasn't intolerable - I expected worse from things I had read.  They found microscopic cancer cells in the SN - so all my nodes were removed.  I am still meeting with my oncologist on the chemo treatement plan - so haven't learned much about the radiation process yet.",
      "MessageIndex": 3,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708609",
      "Title": "Does this sound right? ettelok 41yrpeachgal"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Nov 7, 2008 05:04PM Tamara wrote: If you are running a temperature - you need to call your oncologist.  I was told to call for anything over 100.5 - your immune system hits a low between day 7-14 (though mine has dropped earlier than that) so it will be more difficult for you to fight an infection and that can get serious.",
      "MessageIndex": 1,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724081",
      "Title": "Phlegm wblibrary wblibrary"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Feb 15, 2009 04:16PM Tamara wrote: Kathie, I had 6tx of TAC and my last tx was 10/31/08.  I had quite a bit of nausea the first tx but with some added anti nausea meds that was easily controlled; I only had problems with severe constipation duing one round - use stool softeners if you need them and remember to drink lots of fluids; I was really tired the first few days after tx but within 3-5 days, was back to my mostly usual routine.  Overall, I was fortunate and didn't get many of the possible SE that some discuss here on the boards.  I didn't have a port and used up my \"good veins\" in my good arm after 6 tx - the T & A  in TAC can be tough on your veins. While it was no fun - it was doable - you will get through it.  The important thing is that you kill off all those sneaky cancer cells that might be hiding! Good luck with your treatement Tamara",
      "MessageIndex": 4,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729091",
      "Title": "Is anyone else out there having TAC treatment? kat4pink NatsFan"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Sep 11, 2008 12:30AM Tamara wrote: What you are experiencing is very normal and common after surgery - it is referred to as \"cording\" or axillary web syndrome(use either of those terms to search or google for more info).  I had a lumpectomy and all nodes removed and experienced the same thing a couple weeks after surgery and also freaked out.  I still have some faint cording 3 months later but it is much reduced.  Did your surgeon give you any post surgery stretching exercises to do?  They will help gradually stretch out that area. When I researched it, the info said that it usually resolves it self in 8-12 weeks.  It is not lymphedema.  Tamara",
      "MessageIndex": 1,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721005",
      "Title": "Eeek - a CORD! I'm freaking out... Kleenex knowledgeforpower"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Feb 16, 2009 06:56PM Tamara wrote: Kathie, You might consider asking your onco why he is choosing the drugs that he is.  I was so busy weighing the pro's and con's of chemo - I never really questionned which regime he recommended.  While I trust my onco too - in hidesight - I would have asked more about why he recommended TAC over the over regimes just to satisfy my curiosity and understand the rationale. Good luck Tamara",
      "MessageIndex": 9,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729091",
      "Title": "Is anyone else out there having TAC treatment? kat4pink NatsFan"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Aug 19, 2008 09:36AM Tamara wrote: Lynette, The hardest part is waiting for the results and having all the information you need to make treatment decisions.  Grade 1 is a slower growing tumor and with the size of the tumor being smaller - all are good signs.  You will know more once you have the pathology for the SNB and can meet with your doctors about tx recommendations.  I had a 7mm tumor with micromets (less than 2mm of cancer) in my SNB.  They tested my SN during surgery so knew right away about the micromets - so all 13 of my lymph nodes were removed with no other cancer found.  Because of my age (45), the surgeon and onco both recemmended chemo (whether or not there was cancer in the SN) - so I had a lumpectomy, am currently doing chemo (which isn't horrible - so don't let fears of chemo SE scare you if they recommed chemo) and then will have radiation followed by Tamoxifin for 5 years.  Good luck to you!",
      "MessageIndex": 2,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719727",
      "Title": "Can grade 1 IDC spread if it's less than 2cm? Lynette pod1257"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Sep 8, 2008 07:28AM Tamara wrote: I know that they want you fully healed from any surgery before starting chemo. I had a lumpectomy on June 17th and started chemo on July 19th - we talked to my onco about delaying until mid-august because of a vacation.  He was willing to work my chemo tx around the vacation but didn't want to wait to start.  So - I started chemo about 4 weeks after my surgery.  I think starter as early as possible is ideal but have read that starting within 12 weeks of surgery is reasonable. Good",
      "MessageIndex": 2,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720822",
      "Title": "when does chemo usually start? angel_eyes hopefullady"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Tamara wrote: I am about 1 1/2 out since my dx and while I don't have lymphedema - I know I will always be at risk since I had axiallary dissection (13  nodes).  I have developed rotator cuf problems in both shoulders (I think it may be a bad reaction to the anti-biotic \"cipro\"). Anyway - shaving my underarms has become almost impossible because of restrictions to my range of motion.  A friend (non BC friend) suggested laser hair removal.  My question is rather that would be safe to do on my bc side or whether it would increase the lymphadema risk. A year ago when I was trying to get use to having no hair while going through chemo - I never thought I would be thinking of a way to get rid of hair!   Any experience or opinions about laser hair removal would be welcome!    Dx 5/30/2008, IDC, <1cm, Stage IIA, Grade 2, 1/13 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/750104",
      "Title": "Laser Hair Removal Tamara"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Mar 26, 2010 09:57AM Tamara wrote: Thank you for the feedback - I didn't really think the laser idea was going to be a good one but thought it was worth asking!  I have an electric razor - my problem is that my range of motion doesn't let me reach or get at the right angle to get a close shave.  I will keep working with the PT and hope I can increase the range of motion. Thanks again",
      "MessageIndex": 4,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/750104",
      "Title": "Laser Hair Removal Tamara"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Aug 25, 2008 06:24AM Tamara wrote: Mandy, I am getting 6 tx of TAC using my veins.  I have done 2 tx with no problems - a single prick to get the IV started is all.  Drink lots of fluids prior - well hydrated veins are \"plumper\" and easier to access.  Also - warmer veins are better so don't hold that cold water in the hand they are going to use.  Last tx the chemo room was cold and  arm was cold so the onco nurse put a heating pad on my arm for a few minutes before starting the IV - I later had some achiness in the arm during the tx (she said probably because I was cold again) - so she left it on and the achness went away. Neither  my surgeon or my onco every really discussed the port option with me - they both looked at my arm and said \"you look like you have good veins\" so we went with that.  I have never had a problem with IV's or blood draws.",
      "MessageIndex": 2,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720063",
      "Title": "has anyone had IV chemo? Mandy1313 talbrig13"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Sep 15, 2008 07:32AM Tamara wrote: My lab report was back by the time I had my follow-up appointment and my drain was removed at that time as well.  I was still have some draining - but he pulled it and I didn't have any problems.  I didn't feel anything when he took the drain out and I was very nervous about it.",
      "MessageIndex": 3,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721216",
      "Title": "Removing Drains and Getting Pathology Report Route53 hostanut"
    },
    {
      "AuthorID": "Tamara",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67646/profile",
      "Content": "Sep 8, 2008 07:29AM Tamara wrote: Sorry - must have hit a button.  Meant to end with good luck on your upcoming tx -  hope they going smoothly for you.",
      "MessageIndex": 3,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720822",
      "Title": "when does chemo usually start? angel_eyes hopefullady"
    }
  ]
}