{
  "AuthorID": "Tami4965",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227478/profile",
  "Posts": [
    {
      "AuthorID": "Tami4965",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227478/profile",
      "Content": "Apr 14, 2016 06:51PM Tami4965 wrote: Hi. I have 33 scheduled treatments. I have 8 treatments left. I was given a two day break because my skin hurts so much! It has been intact but VERY RED. I have one blister now and under my boob it feels so raw like someone has cut it with a knife. I am super swollen, I am emotionally a wreck with crying. I know 8 days seems so short but I can't even stand the cone on my sore skin. I finally got silvadene cream called in today. I love my RO but she was worried my skin was sensitive and was reluctant to give me anything to put directly on the skin. I have been asking,, and asking. I have gotten skin cooling pads and norco. Today I called in tears and finally they called it in. I am supposed to come in tomorrow to start back up. I honestly don't know if I can do it anymore... I wish I had just went for the mastectomy. Anyone else ever feel that way?",
      "MessageIndex": 88,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Tami4965",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227478/profile",
      "Content": "Apr 15, 2016 09:39AM Tami4965 wrote: I just don't think I physically and emotionally can put myself through another treatment. I \"only\" have 8 left. I have one in two hours but I just don't think I can go through with any more... The skin under my boob is so raw and split it just burns. I had blisters but the cream took care of that. I need some kind of antidepressant that's for sure. My skin was great for so long then bam.",
      "MessageIndex": 107,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    },
    {
      "AuthorID": "Tami4965",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227478/profile",
      "Content": "Apr 14, 2016 12:03PM Tami4965 wrote: thanks Randi. I will try the cabbage leaves... at this point I will try just about anything. I just got a rx for silvadene and I hope it helps. Hugs and thanks so much!!",
      "MessageIndex": 95,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/842627",
      "Title": "Spring 2016 Rads Moderators Sitti"
    }
  ]
}