{
  "AuthorID": "tamkay123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
  "Posts": [
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "tamkay123 wrote: I've finished 4 rounds of A/C and now I start dense dose Taxol on Monday. I did pretty well on A/C side effects-wise but I did get a couple of infections during treatment. The first one was relatively minor and I was on 10 days of antibiotics. I missed a day of work. The second one was a doozy. I had an infection in my blood. I had to have my port removed and I was in the hospital Tuesday through Sunday. I've got one more week of the 24 hour antibiotics that I'm receiving via a picc line. I'll be glad to get rid of the picc line. Dx 5/28/2015, IDC, Left, 1cm, Stage IIA, Grade 3, ER+/PR+, HER2- (FISH) Chemotherapy 6/15/2015 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834221",
      "Title": "Anyone Getting DD Taxol? tamkay123 avmom"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 30, 2015 08:26AM tamkay123 wrote: I was told if it was ever wet that I was supposed to call right away.",
      "MessageIndex": 1,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835375",
      "Title": "Depressed because my neulasta thing leaked HazelFrances HazelFrances"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jul 1, 2015 11:01AM tamkay123 wrote: I got a hold of my doctor just a few moments ago and she is okay with the occasional drink as long as I wasn't on narcotics. molly1976 - I read more about alcohol increasing estrogen levels and found an article that stated that high intake of folic acid like spinach, broccoli, corn, legumes and multi-vitamins appear to mitigate the increased risk http://www.dslrf.org/breastcancer/content.asp?CATID=60&L2=1&L3=6&L4=0&PID=&sid=132&cid=596",
      "MessageIndex": 5,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/833089",
      "Title": "Alcohol and Chemotherapy tamkay123 BeachMom2018"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "tamkay123 wrote: What has your doctor said about alcohol intake during chemotherapy? I'm not a big drinker but I usually have 2-3 drinks during the weekend. Since I started chemo, I haven't had any but there have been days I'd really like to have a drink. I meant to ask my doctor on Monday and totally forgot. Dx 5/28/2015, IDC, Left, 1cm, Stage IIA, Grade 3, ER+/PR+, HER2- (FISH) Chemotherapy 6/15/2015 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/833089",
      "Title": "Alcohol and Chemotherapy tamkay123 BeachMom2018"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Nov 10, 2015 06:17AM tamkay123 wrote: Two more days until BMX with TE. I'm a little stressed that I don't have as much done as home as I wish I did but we've had a lot going on. Tonight we are going to try to explain to my soon to be 5 year old (November 27th bday) about mommy having surgery, etc. I swear I'm more worried about this than surgery. I was in the hospital for a week in July due to a staph infection and I think he still worries about mommy leaving since then.",
      "MessageIndex": 160,
      "PostDate": "10/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 20, 2015 02:45AM tamkay123 wrote: I now have a surgery date. BMX with expanders on November 12th",
      "MessageIndex": 10,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 20, 2015 02:27PM tamkay123 wrote: Should we add a list of everyone and their surgery dates or start a new post with that info? Tammy",
      "MessageIndex": 13,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 25, 2015 10:16PM tamkay123 wrote: I had an ultrasound of the lymph nodes performed after my positive biopsy result. Since there were a couple of enlarged lymph nodes, they then performed a fine needle biopsy. This also came back positive. Due to the lymph node involvement, I had chemo prior to surgery. I won't know current lymph node involvement until after surgery. I will be having bmx with TEs. ",
      "MessageIndex": 26,
      "PostDate": "25/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Nov 5, 2015 07:36AM tamkay123 wrote: Miss Bee - So great to hear you are doing well!!!! I'm one week out from surgery. I will have a BMX with TE. I'm doing pretty well so far emotionally but perhaps that is because I just finished chemo. I'm ready for this next step to be done. I'm really hoping I won't have to have radiation but won't know until the pathology comes back after surgery. I live 2-1/2 hours away from my immediate family. They've made plans to come stay with me for the first week after surgery. I'm so thankful they will be there. I have 4 sisters so between them and my mom I will have a lot of support. My husband has been great but this will allow him to focus on our 4-1/2 year old.",
      "MessageIndex": 97,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 13, 2015 08:28PM tamkay123 wrote: I expect to get my surgery date on Thursday when I meet with my surgeon and that it will be early to mid November.",
      "MessageIndex": 2,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835614",
      "Title": "November 2015 Surgeries Thread? Girl53 Live4them"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 13, 2015 10:36AM tamkay123 wrote: Thanks avmom!! It seems most people get the weekly dose of Taxol so I appreciate hearing from someone that had the dense dose.",
      "MessageIndex": 2,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834221",
      "Title": "Anyone Getting DD Taxol? tamkay123 avmom"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 13, 2015 12:39PM tamkay123 wrote: I also got the Neulasta shot and still got 2 infections. The first one popped up a week after my 2nd treatment. It left me yucky for a day but the antibiotics seemed to do the trick. The next one popped up a week after the 3rd treatment. That one landed me in the hospital for almost a week as my port was infected. They removed my port and I had a picc line for 4 weeks while I received 24 hour antibiotics. After that though I was able to avoid infections.",
      "MessageIndex": 6,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835721",
      "Title": "Infections during chemo..... Josie44 tamkay123"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 26, 2015 05:11PM tamkay123 wrote: I am a VERY similar to Leighrh. I'm 42 and Stage IIA. It had spread to my lymph nodes. We proceeded with dense dose A/C+T. I'm doing my chemo prior to surgery. I very much felt that I was going to hit this as hard as I could to knock the crap out of it. ",
      "MessageIndex": 7,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 1, 2015 03:00AM tamkay123 wrote: gretmph2 - I have finished dense dose A/C and today I've had my 2nd dense dose of Taxol. Thus far I've had very little side effects. I'd be happy to answer any questions. Everyone is different but I've been really happy with my treatment thus far",
      "MessageIndex": 24,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 26, 2015 05:22PM tamkay123 wrote: I guess I don't fully understand all the %s being given for the benefits. I did 4 rounds of dense dose A/C first. At the end of the A/C, they did an ultrasound. My tumor had shrunk by over 50% and my involved lymph nodes had significantly decreased in size. They also did another EKG and everything looked great. I was very happy with these initial results as I moved on to bi-weeky taxol.",
      "MessageIndex": 9,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 1, 2015 05:32PM tamkay123 wrote: In my experience, they have many options if you experience issues such as nausea etc. They give pre-meds before hand to combat nausea and then I was also sent home with 2 anti-nausea drugs. I was instructed to take one and if it didn't help within a half hour to take the other. If that didn't help, I should call in and they will get me something else. I started losing my hair on day 15 or the day after my 2nd A/C treatment. My 1st treatment was 6/15. I noticed the hair loss on the 30th. On the 2nd, my neighbor cut my hair short and then on the 5th I shaved it. It was coming out way to heavy to try to keep the short haircut. I really had little to no issues with A/C. I think I took one or two anti-nausea pills the entire time and those were just because my stomach felt slightly off. I did have an issue with infections. 8 days after my 2nd A/C treatment I noticed the upper incision from my port felt warm and tender. I had a superficial infection and was on antibiotics for 10 days. 7 days after my 3rd A/C treatment I was feeling kinda yucky...rundown, etc. I woke up in the middle of the night with a fever and ended up heading to the E/R. I had a bacterial infection in my blood. They had to remove my port and I was in the hospital Tuesday through Sunday. I was also on 24 hour antibiotics for 4 weeks which was a pain but nothing I couldn't tolerate. Looking back, my port did feel tender at that 3rd treatment and I should have mentioned it. I bet it was the initial signs of infection. I'm now getting my treatments via I/V. I've noticed a few more side effects with Taxol but nothing awful. With my 1st treatment, I felt like I was getting the flu on the 3rd day...achy and tired. I felt fine on day 4 but did have muscle soreness and some restless leg syndrome through day 6. It was nothing intolerable. ",
      "MessageIndex": 25,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "tamkay123 wrote: I had BMX 3 years ago with my anxillary lymph nodes removed. I have not had any problems with lymphedema until just recently. I noticed my left hand was slightly swollen. I called my breast surgeon and got a referral to the local hospital's PT department. This is not where I went for my cancer treatment as I live in a small town 1-1/2 hours away. My visits to PT have consisted of wearing a jacket type apparatus that inflates and deflates for 30 min, massage and then wrapping my arm. The issue I'm seeing is that when they wrap my arm the swelling actually worsens. I'm not seeing swelling in my arm. I've expressed concern to them and they wrapped further down the next time. I'm not really sure what I should be expecting from the treatment. I don't have a lot of faith in the local hospital so perhaps that is clouding my view of their current treatment. They took measurements at my first 2 visits but nothing for the last 5 or more. Dx 5/28/2015, IDC, Left, 1cm, Stage IIA, Grade 3, ER+/PR+, HER2- (FISH) Chemotherapy 6/15/2015 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/869456",
      "Title": "First time dealing with lymphedema tamkay123 Parrynd1"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Oct 8, 2015 03:10PM tamkay123 wrote: I think that is something we tell ourselves on the crappy days to make it feel worth it. I started with Neoadjuvant DD A/C and I also didn't have any real side effects to speak of although I did get a nasty infection at one point. They did an ultrasound after that portion of my treatment and the tumor was reduced by over 50%. I just finished DD Taxol which did effect me more than A/C but still not terrible. I'll have an ultrasound next Thursday before I meet with the breast surgeon.",
      "MessageIndex": 2,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/835585",
      "Title": "main effects vs side effects Cheesequake molliefish"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 20, 2015 02:15PM tamkay123 wrote: Katy gave great advice. That is the treatment plan I'm on. I had AC every two weeks for 4 sessions and just had my first Taxol session on Monday. I'll get Taxol every 2 weeks. Everyone is going to be different in their experiences with each drug. I had little to no side effects with AC but I did have an issue with infections. I ended up getting 2 different infections during my A/C treatment. I'm hoping for the same with Taxol but yesterday I felt almost like I was getting the flu...just kinda blah. Today I'm feeling good though.",
      "MessageIndex": 2,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834392",
      "Title": "No chemo yet but know the meds.. Artista928 tamkay123"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 13, 2015 08:41AM tamkay123 wrote: I start dense dose Taxol on Monday. Has anyone heard of tips to prevent issues with your nails?",
      "MessageIndex": 386,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 16, 2015 10:00PM tamkay123 wrote: Espanola - I start dd Taxol tomorrow.",
      "MessageIndex": 399,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 18, 2015 07:22AM tamkay123 wrote: They gave mine through the IV. It wasn't long after they gave it that I could feel my eyes getting really heavy. They put me in a bed for the first Taxol dose in case of allergic reactions. I was glad to be in one considering how much I slept",
      "MessageIndex": 412,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 11, 2015 10:01AM tamkay123 wrote: KickinBootay - I am also neoadjuvant therapy. I have 2 more sessions of dense dose Taxol expecting my last to be on 9/28 and then I'll meet with the surgeon. I have an appt on the 25th with the plastic surgeon. I'm having bmx and we will discuss reconstruction options.",
      "MessageIndex": 429,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 21, 2015 11:00AM tamkay123 wrote: Looking forward to my last DD Taxol on Monday. Last time they reduced my dose by 20% as I mentioned I had had some tingliness in a couple of my fingers. My MO mentioned that if it got worse they would cancel my last treatment for fear of permanent neuropathy. Thankfully it's been about the same or less. I really want to get all the treatments. I meet with a plastic surgeon on Friday to discuss options and then expect surgery early to mid-November.",
      "MessageIndex": 451,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 22, 2015 09:07AM tamkay123 wrote: Great picture, Eaglemom!!! Today is one week since my first A/C treatment. I've still been feeling really good. I'm a bit tired this morning but I think that is just normal Monday tired with no connection to the treatment. I was soooo happy that I felt good all weekend and we were able to have a really nice Father's Day. My husband has been so completely amazing with everything and I just really wanted to make sure he had a great weekend. We were able to spend time on our boat which is his favorite thing.",
      "MessageIndex": 140,
      "PostDate": "22/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 26, 2015 10:26AM tamkay123 wrote: lulu2533 - I have hard some random pains from my port as well and I've had it for 2 weeks. It's nothing bad but just a random shot of pain here or there. I assumed it was just healing. I too have a bump at the end of my incision. That kinda makes sense about the stitch.",
      "MessageIndex": 190,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Sep 30, 2015 09:24AM tamkay123 wrote: Last chemo was on Monday!!!! Yay! I'm feeling great. Taxol has been a bit rougher than A/C due to muscle pain on days 4 and 5 but nothing unmanageable. I had some tingliness in my fingers but that seems to have gone away. I celebrated with my mom and sister yesterday with a great girls' day. I meet with the breast surgeon on 10/15 and will be working on scheduling bmx and reconstruction.",
      "MessageIndex": 455,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 18, 2015 01:28PM tamkay123 wrote: I had my first treatment on Monday, June 15th and so far I'm doing really well. I did take an anti-nausea bill last night as my stomach felt a bit crampy but otherwise I've been feeling fine and working everyday. I'm worried I'm going to feel bad on the weekend when my 4 year old is home with me all day long. Positive thoughts that I keep feeling good.",
      "MessageIndex": 103,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 19, 2015 05:34AM tamkay123 wrote: Thanks ladies. I'm on a bi-weekly regimine so I think that's the plan to do it when I'm there for treatment.",
      "MessageIndex": 108,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 24, 2015 09:53AM tamkay123 wrote: Hi Magbrew- Glad you found this board post for support. I'm on a different therapy,A/C&T, but I had my first treatment on June 15th and I've really been feeling good thus far. The treatment itself really wasn't bad at all. There was always a nurse available if I had any questions or issues. They were really great about explaining everything. For myself, it's really helped to not focus on the possible side effects and really just focus on taking each day as it comes. I read the tips post and bought some things based on it but otherwise I've tried not to worry about it until something happens. I've really focused on drinking a lot of water. I was always a big water drinker at work but I've made sure to do this at home and while out as well. I've also made a point of keeping active by walking at least a mile or so every night. Thus far I've felt good so I've actually done more than that. I'm really hoping my doctor will say I can go back to the gym as I really miss it but I'm still in that 2 week no gym time period after my port placement. Hope everything goes well for you. This group is great for encouragement and support. Tammy",
      "MessageIndex": 157,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 24, 2015 05:20PM tamkay123 wrote: Claritin has been found to help combat the bone pain that can sometimes be a side effect of the Nuelasta. I took it the day before, day of and day following my injection. I didn't have any issues with my first treatment.",
      "MessageIndex": 161,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jul 1, 2015 10:11AM tamkay123 wrote: December - So sorry to hear you are having troubles. Have you spoken with your doctor to see what they can do to help?",
      "MessageIndex": 235,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 4, 2015 10:48AM tamkay123 wrote: I just finished my 4th A/C treatment. The side effects have been slim to none but infections have been my problem. I got a superficial infection in my upper port incision after treatment #2. I was on antibiotics for 10 days. I noticed at treatment #3 that my port was a bit sore but I brushed it off. 1 week later I woke up with a fever and ended up in the hospital from Tuesday to Sunday due to a bacterium infection in my blood. They ended up taking out my port. I currently have a picc line as I'm getting 24 hour/day antibiotic infusions until 8/20. They had to put in an IV yesterday for my 4th treatment. In 2 weeks, I start my dense dose Taxol treatments.",
      "MessageIndex": 367,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 25, 2015 08:38AM tamkay123 wrote: justmaximom15 - I get my bloodwork done each time I go in for a treatment so bi-weekly. I'm on day 11 of the first cycle of AC and I've noticed my hair feels different as well. It seems a lot more dry. I've already got a wig that is very similar to my current hair. I'm trying to decide as well what I ask for at the hairdresser. I think I plan to transition straight to the wig so it's not so noticeable at work to some people with which I haven't shared my diagnosis. I'm not totally freaked out about losing my hair but it might be less traumatic to go really short but not buzzed and then let it fall out from there. Thoughts? I noticed you are in Missouri. Where are you located? I'm originally from STL but now I live at the Lake of the Ozarks. I'm receiving my treatment at Ellis Fischel in Columbia which isn't too bad of a drive.",
      "MessageIndex": 168,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 26, 2015 10:41AM tamkay123 wrote: justmaximom15 - I wouldn't have been prepared for it either but my friend who just finished chemo had randomly mentioned one day \"wait till the swelling goes down and you can really see it\" I hadn't even considered it before that.",
      "MessageIndex": 192,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 12, 2015 08:55PM tamkay123 wrote: Hi ladies. I just had my port put in on Thursday. I'm scheduled to begin chemo on Monday June 15th. Although I'm nervous to begin, I'm ready. It felt like it took so long to finally have answers and now I just want to start fighting.  Tammy",
      "MessageIndex": 59,
      "PostDate": "12/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 19, 2015 02:51AM tamkay123 wrote: Brigthsideplease- I was really noticing my port yesterday as well. The steri strips are still in place but it was just kinda bugging me. I'm up right now at 330 am which is unusual for me but otherwise I'm still feeling good. I did take a stool softener today as I woke up having to go to the bathroom. I've been wondering about my hair tonight. I know many people said it was right around 2 weeks that they lost it. There is a girl at the wig shop (part of the cancer center gift shop) that will help me shave/cut when it falls out so I can transition to my wig. The cancer center is 1-1/4 hrs away so I'm thinking I should just plan it with her for my next treatment on the 29th. For some reason, I really don't want to do it at home or have my husband do it although I know he would.",
      "MessageIndex": 105,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 25, 2015 09:19AM tamkay123 wrote: Espanola - I had my first treatment 4 days after port placement. I didn't have any pain associated with the port. ThePrincess - I agree about doing it when there aren't people around. I think the place I may go is willing to do before or after hours. My neighbor is a hairdresser. I know she would be willing to do it but not sure I want that. I think I may want someone who is more removed since she is a good friend. justmaximom15 - I'm from Kirkwood. My family still lives there. I'm surprised my mom hasn't tried to kidnap me to have treatment there but I do love Ellis Fischel. No way I was getting treatment here at the lake. I wondered where you were getting treatment as I remembered that awesome picture of the outside area/",
      "MessageIndex": 171,
      "PostDate": "25/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 26, 2015 06:44PM tamkay123 wrote: thanks for the update Lulu",
      "MessageIndex": 196,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Jun 30, 2015 04:50AM tamkay123 wrote: I had my second round of A/C yesterday. It was a really long day (in addition to chemo got an IUD and had genetic counseling). We were away from home for over 12 hours. I was tired last night but I figure that's not too surprising based on our busy day. Day 15 and my hair is starting to go. It's felt different for a few days and today I had a lot more than usual in my hands while washing and styling my hair. My neighbor across the street is a hair dresser and I will probably have her cut it this week.",
      "MessageIndex": 223,
      "PostDate": "30/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 18, 2015 03:54AM tamkay123 wrote: I had my first treatment of DD Taxol yesterday. It wasn't bad at all but I did sleep through pretty much the entire treatment due to the Benadryl they gave me in pre-meds. I had an ultrasound yesterday to check on any changes in my tumor. There was significant decrease in the tumor and lymph nodes. The tumor had shrunk by 50%. Yay for good news.",
      "MessageIndex": 410,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "tamkay123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216653/profile",
      "Content": "Aug 20, 2015 01:38PM tamkay123 wrote: I have noticed more effects from Taxol then I did A/C but I'm sure some of that could be the cumulative effect. Yesterday (day 3), I felt like I was getting the flu. I ended up going home from work a few hours early to lay down before I picked up my son from preschool. Today I feel much better but I am definitely achy. My legs keep getting these twinges of pain and I've noticed today that I feel like I have menstrual cramps...and pretty strong ones at that!",
      "MessageIndex": 415,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}