{
  "AuthorID": "tammyjden",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107354/profile",
  "Posts": [
    {
      "AuthorID": "tammyjden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107354/profile",
      "Content": "Jul 17, 2013 12:54PM - edited Jul 17, 2013 12:54PM by tammyjden I have been suffering with arm pain for the past 6 months.  I went to my breast surgeon who gave me a whole 5 minutes of her time to tell me I did NOT have lymphedema.  She didn't feel my arm, she didn't do any measurements, she did nothing.  She told me I probably had fibromyalgia.  So after being extremely upset to the point of having a nervous breakdown, my husband insisted I see my family doc.  My family doc sent me to PT and they told me I DID have lymphedema and I've now been in PT for a month.  My arm has fibrous tissue all through it and does not swell very much but it is a constant pain.  I have no use of the arm right now and waiting for disability paperwork to be complete because I can no longer work.  It's sad when my own breast surgeon won't take an extra minute to listen to me and I have to be diagnosed by my family doc.",
      "MessageIndex": 10,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/807787",
      "Title": "Doctor says 'Lymphedema is not painful' - Is it? ailenroc LadyHelaine"
    },
    {
      "AuthorID": "tammyjden",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/107354/profile",
      "Content": "Oct 28, 2010 11:17AM tammyjden wrote: I start chemo on Nov. 1st.  Thank you all for the wonderful information.  I don't know how I would get through it without these pointers!",
      "MessageIndex": 489,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    }
  ]
}