{
  "AuthorID": "tammie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
  "Posts": [
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 8, 2012 09:47PM tammie wrote: Dawn sooo glad to hear from you!! I hope things get better soon... Big hugs and healing vibes your way... Sorry repeating myself but.. ITS AWESOME TO HEAR FROM YOU!!! <3",
      "MessageIndex": 6,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791738",
      "Title": "to my beautiful BC women friends china BouncingBetties"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 27, 2011 07:43PM tammie wrote: OUCH!! The crap they put us through it seems they should be able to find a way to make these procedures a little more tolerable...Gentle hugs to your sister..Tammie",
      "MessageIndex": 9,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777139",
      "Title": "omg, stephanies biopsy with pet/ct torture.. Travelingpants2 3katz"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 29, 2012 11:47PM tammie wrote: Sendin hugs to you Jenn.. Ironically im in a very similiar situation right now not sure even where or how i want this to end but thinkin it probably should as I just dont have it to give and this guy often seems to give very little and expect a whole lot... Hope all works out and ultimately your happy as thats whats important :)",
      "MessageIndex": 30,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/797754",
      "Title": "The Breakup (the grass isn't always greener on the other side) JeninMichigan tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 12, 2012 08:01PM tammie wrote: Awesomee news!! Congrats to you !! Big hugs..Tammie",
      "MessageIndex": 33,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789002",
      "Title": "Happy Tears Falling Falling! soleil505 Brendatrue"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 22, 2013 11:53AM tammie wrote: Sorry I'm of no help. But given your current circumstances it couldn't hurt.. Think of u often n hope your doin well. Sending lots of good thoughts your way",
      "MessageIndex": 1,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803666",
      "Title": "question ot soleil505 HLB"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 26, 2013 09:33AM tammie wrote: Sending light and love to your family.. So sorry for your loss..",
      "MessageIndex": 44,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801017",
      "Title": "Sheff is an Angel Sheff dawny"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 13, 2012 08:08AM tammie wrote: CONGRATs to her .. Hope you enjoyed your day those r the best moments <3",
      "MessageIndex": 16,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788987",
      "Title": "It's going to be a great day! TonyaB meima-Bev"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 13, 2011 09:49AM tammie wrote: Big ((hugs)) to you Kelly..Its a heart wrenching conversation to have to have with your kids. The only suggestion i can make is that you be honest with them about all you know and continue to communicate and share along the way..You may find it easier once they know as mine knew somthin was wrong due to the way id been acting... Hope it goes as smoothly as it possibly can for you and your babies..Hugs..Tammy",
      "MessageIndex": 10,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/776402",
      "Title": "how do I tell my kids spunkyboobster Miller1353"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 9, 2012 09:35AM tammie wrote: Sending hugs i hope you have a good weekend, you deserve it!! The things we deal with sometimes is insane!! Much love to you friend and do follow the other girls orders n keep anti bacterial on hand!!",
      "MessageIndex": 9,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783865",
      "Title": "Eeeewww - gross! alesta29 banjobanjo"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 19, 2012 07:15AM tammie wrote: Karen I too have been experiencing horrible (scary) headaches shoulder hip and back pain since early June.. I completed chemo in March and started arimadex, I've been on zometa monthly  since last Sept.... I can now safely say ive had every scan under the sun in the past month and a half... My PET/CT scan just came back showing great results that my tx is working when compared to the scan done last Nov. in fact my CT was barely able to show the mets in my liver!! All of this news is awesome of course but odd i been so fatigued and in pain quite often?? My Onc. can only conclude since the necrotic bone is appearing to be more dense that its my body tryin to heal the bone.. As for pain management i take 15mgs of extended release morpihine twice a day and recently do to uptake in pain am now taking 3 a day and it does take care of the pain perhaps if you find yourself needing pain meds so often you could try an extended release.. I love it because i hate the dopey feeling i get from pain meds and with these i dont ever have that in fact if it werent for the constipation id never even know i was taking morphine lol.. I responded to this as it sounded soo much like what ive been going through..Keeping my fingers crossed its the arimadex or possibly healing bone.. big hugs to you and hoping it lets up for you soon..Tammie",
      "MessageIndex": 6,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790617",
      "Title": "Pain Flare? Karen2012 Karen2012"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 1, 2012 06:04PM tammie wrote: Positive scan vibes and hugs coming your way :)",
      "MessageIndex": 5,
      "PostDate": "01/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794282",
      "Title": "Scan Today @ 11:00 TonyaB HLB"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 12, 2012 06:38PM tammie wrote: Congrats on feeling better!! I felt better on A/C than i was before it and it worked on bones alot!! I get scanned every 3mo. seems to be the standard unless your in a study or your current tx warrants it... Big hugs and glad your doing better",
      "MessageIndex": 5,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790438",
      "Title": "How do we know if the medicine is working stellaratovsky Heidihill"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 16, 2012 06:56PM tammie wrote: WOW!! As if our scanxiety isnt enough to begin with.. Soo sorry your Onc. obviously seemed to want to rule something out that may have been a concern but why not tell you this instead of having to hear from radiologist that their scanning for a specific reason perhaps it would be nice if they told you what that reason was.. Well i'm keeping fingers and toes crossed for you that all comes back good, and that your onc. chokes on her words or should i say lack of words.. Big hugs..Tammie",
      "MessageIndex": 10,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792055",
      "Title": "worried - but am I just being paranoid harvey harvey"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 3, 2012 03:52PM tammie wrote: There was a program here in NY that immediately covered you if you had breast cancer... I'm in Syracuse and the social workers put me right through immediately they also put me on SSD within 2 months im shocked they arent assisting her better.. not sure of the name of the cancer center in Rochester but they are spose to be good seems somethings off here i had no troubles they seemed to rush it all through.. The breast cancer program was through NYS dept. of health but it was years ago that i used that during my first treatment.. I wish i could be of more help but it seems they should be pushing it through.. Plus if medicaid eligible they go back 3mo. so drs. should be able to start treatments right away.. Big hugs to you and your sister",
      "MessageIndex": 1,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794398",
      "Title": "Diagnosed with Stage IV Breast Cancer and no insurance. Help?! Saddaysahead vickib"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 4, 2012 10:40PM tammie wrote: So sorry your having to go through this, I couldnt imagine your fears or pain right now.. I'm not very sure of her stability medically speaking however with appropriate care bone mets can be very treatable.. I dont know of any facilities that offer housing for cancer patients however depending on the state you reside in perhaps they can push her into a subsidized apt. rather quickly.. you can also request a case manager to assist with her appts., housing, and even take control of her finances to be sure her bills etc. are being paid.. I was once a case manager here in NY so im fairly familiar with that process..Perhaps it would take some of the strain off of you and your siblings.. Best wishes and positive thoughts your way.. I hope things work out for the best for her..Tammy",
      "MessageIndex": 2,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793002",
      "Title": "my mother has stage IV breast cancer, I desperately need help... camd383 LauraOntario"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 4, 2012 10:41PM tammie wrote: So sorry your having to go through this, I couldnt imagine your fears or pain right now.. I'm not very sure of her stability medically speaking however with appropriate care bone mets can be very treatable.. I dont know of any facilities that offer housing for cancer patients however depending on the state you reside in perhaps they can push her into a subsidized apt. rather quickly.. you can also request a case manager to assist with her appts., housing, and even take control of her finances to be sure her bills etc. are being paid.. I was once a case manager here in NY so im fairly familiar with that process..Perhaps it would take some of the strain off of you and your siblings.. Best wishes and positive thoughts your way.. I hope things work out for the best for her..Tammy",
      "MessageIndex": 4,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793002",
      "Title": "my mother has stage IV breast cancer, I desperately need help... camd383 LauraOntario"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 27, 2012 03:14AM tammie wrote: I had an ultra sound guided liver biopsy.. I wont lie the procedure itself was quite painful and the Dr. made 3 unsuccessful atempts at gettin a sample due to the fact that my lesions are many but very small.. However after the procedure all was well.. I was monitored for several hours and then went home they told me to take it easy due to bledd risk for 24hrs. however im not very good at that, but do be mindful not to overdo it.. Best of luck and hope all goes well for you and your right back home to your kiddies that im sure will be waiting to make you nuts ;)",
      "MessageIndex": 6,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792598",
      "Title": "Ever had a liver biopsy? llanabeth SPAMgirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 10, 2011 02:21PM tammie wrote: ((Mary)) Hugs to you..Dumb scans i agree this was the week of DUMB scans!! I'm of no help with Gemzar but i hope it kicks some butt ...Positive thought coming your way <3",
      "MessageIndex": 4,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777883",
      "Title": "dumb scan results MJ6266 rosie06ct"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 20, 2014 08:55PM tammie wrote: our stories sound similar I fought stage IIb in 2002 and thought I was done.. In sept. Of 2011 I was diagnosed stage IV with mets to almost every bone in my body skull to toes and mets to both lobes of my liver and several lymph nodes in my chest.. I've burned through many anti hormonals, I've seen some women go years on one anti hormonal and others burn through them like water, we all seem to differ in that.. About a year ago things went nuts for me and the bones and liver were growing like crazy and I had new progression to my rt lung and brain.. I then had a successful gamma procedure to my brain and was put on Xeloda an oral form of chemo.. Here I am a year later still on Xeloda but all mets to lung are dead and for the first time since diagnosis the mets to liver are fully dead (best they ever held was stable) and a bunch of the bone mets have died off with many reducing in size.. There's no way to know exactly what path your treatment will take as we all vary.. As for remission my oncologist told me with as many bone mets as I have the best I should hope for is stable.. I have learned as many on this very board told me when I first came to stage IV boards that stage IV doesn't have to be a death sentence and there are many treatments and options out there for us.. I hope arimadex works for you for a very long time... Hugs to you and welcome",
      "MessageIndex": 14,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818219",
      "Title": "Stage IV: ER+ PR- Her 2 -, a lot of Bone Mets- any others? WanderingSpirit WanderingSpirit"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 29, 2008 04:59AM tammie wrote: Hi Ginny..Sorry you had to join our club...BUT i can assure you the ya ya sisterhood has nothing on these ladies here..We are the rah rah sisterhood and will be here to help you through! I remember oh so well that blank empty feeling that i had when i first knew and waiting for the tests were hell! It took me weeks before i even felt any of it i was too damn busy trying to calm the hubby and the kids and assure them i was fine...Well today marks 6 years since my lumpectomy and im cancer free! treatment was hell but you too will get there...Remember whenever you have a question or just need a friend to talk too these boards are here i dont think i couldv done it without these ladies! Hugz to you to help you through..Tammie",
      "MessageIndex": 11,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723527",
      "Title": "Got Diagnosis today ginnysue Harley44"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 12, 2012 10:09PM tammie wrote: I was dx'ed stage IIb in 2002, i had my ovaries removed right out of tx...However 9yrs. later i was dx'ed with inumerable mets to my bones which quickly moved into the liver...soo i dont know how much the oopharectomy did for me.. Big hugs hope that helps reassure u some",
      "MessageIndex": 24,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785583",
      "Title": "For the Hormone Positive Gals smiley2 kaycancer"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 27, 2011 07:39PM tammie wrote: Becky i did weekly Taxol 9yrs ago but have heard it hasnt changed much in the way of Se's...I use to be feelin like crap but zooted on steriods for 24-48 hrs post tx...Then felt like crap for several days as i recall the further into tx i got the fewer good days i had..I would do it early in the week so you can have as many good days as possible with the family..Big hugs and i hope the Taxol kicks some cancer butt :)..Tammie",
      "MessageIndex": 2,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777159",
      "Title": "Info on Taxol rkt Heidi_Norway"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "May 10, 2012 09:04AM tammie wrote: OM ladies im soo sorry.... I am doing well so sorry my sister doesnt get internet in fact she barely gets phone service in the redwoods... I did have a beautiful vacation , was wonderful to hide from cancer for a couple weeks... However back to the appts and crap... On the upside i have u beautiful ladies to chat with...I also have a facebook my name is Tammy louise Goff on there... Again im so sorry for causing fright i do soo know how it feels when one of us disappear for a while.. I must confess that im over joyed to know you all missed me thank you soo much for makin me feel so wanted...big hugs and much love to you...Tammie",
      "MessageIndex": 10,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787009",
      "Title": "Tammie??? texasrose361 Cathy2"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 21, 2012 02:20PM tammie wrote: I have many mets to the liver and bones too... Ironically i'm highly allergic to taxol, however you will find there are many different chemos out there some arent even as aggressive in symptoms such as Xeloda which has shown to work great with liver mets... Do keep that hope and never let it go you have every reason to believe theres a treatment out there that will get it under control..So sorry you have to deal with this ugly disease and the beginning of the proverbial rollercoaster can be hell on the mind.. However judging from the screen name you've chosen you clearly have the right idea already!! Feel free to message me if you ever need to talk or need anything.. I got my  fingers crossed that they get you on some good meds to beat the heck out of that cancer.. Big hugs and positive vibes to you..Tammie",
      "MessageIndex": 10,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792321",
      "Title": "Liver mets just diagnosed. staycalmandcarryon nicole0714"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 6, 2011 06:06AM tammie wrote: beautiful pic. Stephani hope your doing well..Big hugs and Happy holidays to you and your family <3 Tammie",
      "MessageIndex": 7,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779093",
      "Title": "Stephanie Next to the Traveling Pants tree ! Travelingpants2 Anne45"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 2, 2012 04:42PM tammie wrote: Thank you sooo very much.. that was well written and very informative.. I hope many of the papers pick up on it, I know i wont see the cure in my lifetime but one of my biggest hopes is to see more going to research than awareness and a time when stage IV isnt kept in the closet for the month of Pinktober.. Thanks again :)",
      "MessageIndex": 51,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794020",
      "Title": "My Message re MBC Bestbird Heidihill"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 4, 2012 09:51AM tammie wrote: Thank you all and I know you all really care thats why its so easy for me to discuss these things with you that i often dont even share with some of the people closest to me.. Spamgirl I PROMISE im takin care of me too.. I'm listed as stable right now and havent missed any of my meds yet ill admit throughout the weekend i was a bit off schedule... My oldest (adopted son) has been here with me all week and is quite adamant about my eating sleeping etc... My other children were unable 2 get time off work and 2 of them have children so it would've made it tougher.. But im taking care of me and my baby and soo far holding it down despite being very emotional at times.. Big hugs to you all and hope your doing well... Tammie p.s. Has anybody heard from China yet? I hope shes o.k.",
      "MessageIndex": 44,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 9, 2011 07:23PM tammie wrote: trying to find info on cold caps or the elasto gel caps..Anyone with any feedback to offer would be awesome ty..Tammie",
      "MessageIndex": 1,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777668",
      "Title": "Has anyone tried Elasto-Gel Helmets/Caps? LouLa Laura5"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 16, 2011 09:14AM tammie wrote: You are so entitled to rant!! It seems life for us is one big SE after another!! Hoping the DAM Se's give you a vacation soon sounds like your overdo..Big hugs and hopin the dr. has a trick or things let up for you soon..Tammie",
      "MessageIndex": 4,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776566",
      "Title": "Had enough of SE - Rant Jac53 Jac53"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 26, 2012 09:59AM tammie wrote: Tracy i think thats a totally normal feeling i too felt the very same way after finishin my chemo in March... I was soo excited at the thought of feeling better again but deep down I was petrified that without the chemo it could begin to creep back up and still become anxious over the fact that idk how they can say stable when i have soo many mets that i dont see how they can tell... However just had my full set of scans this past month and am being told all is stable on the arimadex... I have to say a couple weeks out of chemo when i could feel my strength coming back the anxiety became much better n ive been enjoying this honeymoon from chemo for all its worth!! Soo please do enjoy your summer and whatever break you can get...big hugs..Tammie",
      "MessageIndex": 6,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/642796",
      "Title": "bit stressed Tracy1964 bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So things began getting rough for my son that was with my sis in Ca. several weeks ago so we made arrangements for my nephew whos 28 and my DS's favorite person to drive him home.. He seemed depressed and was beginning to talk to himself... Well on the trip home things became totally out of hand.. My nephew calling several x's a day sayin Aron talking to himself etc... Never experienced this before nor has he ever behaved this way.. Well he got home very late Fri. night and ooo boy its bad..He seems to be living in a fantasy state.. Bending souls? Saying bazarre things.. Several hrs after he returned we brought him into the hospital... My baby has been labeled with accute psychosis and theyr fearing schizophrenia!! He was tranferred to facility 2hrs away today.. I got to follow him up and get him settled.. Now tomorrow instead of driving 3hrs. NW to Buffalo for 2nd opinion i'll be packing and got to live at a campgrounds as cant afford hotel so im close n can see him once a day... I'm trying to be hopeful things go well its a beautiful facilty and spose to be one of the best in the state.. I cant stop crying never seen anything like this and am scared out of my mind!! Needed to get this out some place losing it over this... Thank you all for listening.. Also if im off for a while u know where im at..Big hugs..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 3, 2012 02:52PM tammie wrote: THANK YOU ALL SOO MUCH FOR YOUR SUPPORT! I cried reading these posts, my 2nd opinion is rescheduled for Aug. 9th in Buffalo which is 5hrs from the facility my son is in.. I've been livin in the back of my SUV since Mon. at a campground near the hospital with one of my older sons.. We r now in a hotel till Sun. at which point i will have a bed in a place called Amanda's house where i can stay for free.. Been 1 hell of a week got my ex of 2yrs. camping with us which has made life uncomfortable to say the least.. My ex has no car or way to be here or get to see my son but is actually tryin to be here for him which is very important for Aron's recovery the drs. said.. Next week looking almost as bad as the place im going to stay will only offer 1 room per family.. Soo apparently i'll be sharing a room with 2 single beds with the ex STILL... Aron still seems to be more in his fantasy world than our world the drs. and therapists feel its important we be close n see him for the 2 scheduled visiting times per day, which we've been doing daily.. He came to wed. and actually played a ful game of chess before goin back into his fantasy stuff.. I cant put into words the fear and anxiety not to mention the sadness ive felt this week.. Hoping it gets better soon..Big hugs and thank you all for you support..Tammie",
      "MessageIndex": 36,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 21, 2011 05:28AM tammie wrote: Gentle hugs..So sorry you r goin through this, i hope it goes smoothly..Never a dull moment i swear..Much love and haling vibs your way..Tammie",
      "MessageIndex": 16,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779816",
      "Title": "Back in hospital for me. sigh Chickadee Frapp"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 03:32PM tammie wrote: You ladies are all soo awesome I put a call into my onc. And am waiting if they don't say go in tonight they will definitely be seeing me first thing in the morning n I will be determined for them to check for lymphodema n cellulitis..",
      "MessageIndex": 5,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/803609",
      "Title": "Unexplained swelling in leg? tammie mom2twins34"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I been in horrible pain this week and thought it was perhaps due to my being switched to Aromasin... However yesterday I developed a horrible sore throat and am definately coming down with a cold or the flu... My bone pain is horrendous I been using my instant release morphine for several days now and this morning can barely move.. The last time this occured some may remember i was admitted for 3 days and informed i had a 6cm. mass in right lung that turned out to be infection.. Has anyone else endured severe increases in bone pain upon getting ill? Not sure i can handle this much more and im spose to be making the 3hr. drive home tonight for the weekend.. Thanks ladies hoping this is just from cold as i cant handle both at once something has to give here.. Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794399",
      "Title": "Horrible bone pain... Due to illness? tammie SonnyB"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 9, 2011 09:15PM tammie wrote: What may i ask is pcc's 9yrs ago when i did first tx there was nothing like this..We had scarves and wigs..But i will search and see what i can find so far not much luck but thank you much..tammie",
      "MessageIndex": 3,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777668",
      "Title": "Has anyone tried Elasto-Gel Helmets/Caps? LouLa Laura5"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 5, 2012 09:00AM tammie wrote: Cam they've actually allowed me in and encourage my visits 2x a day since he got there.. The Dr. has arranged for me to stay at a place called Amanda's house for free until he's discharged.. Aron is 16yrs. old and doesnt do well when im not there he asks for me all day during his moments of clarity, despite voicing anger at me for bringing him there he still wants to know when i'm coming.. I'm due to go to roswell for my rescheduled appt. this coming Thurs. not sure how im arranging it yet, but have decided since i'm currently listed as stable and just had all scans in june and PET in July that so long as my rescheduling until he's discharged wont cause me to lose my place there i'll wait till he's home to go as its 5hrs away from me now as opposed to the 3hrs. it was before.. I know many will disagree with that choice but it took almost a yr for me to get off my butt to do it a few weeks isnt going to break me... Honestly I live at this point for my baby so this is number 1 on my list right now..Without him theres little point in fighting.. My whole goal since DX was to get him grown and stable before im gone.. Right now he needs me and I feel blessed my healths stable enough for me to be here.. Thank you all for your positive thoughts and best wishes they are more needed than most could know or realize right now..Big hugs to all..Tammie",
      "MessageIndex": 51,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So things began getting rough for my son that was with my sis in Ca. several weeks ago so we made arrangements for my nephew whos 28 and my DS's favorite person to drive him home.. He seemed depressed and was beginning to talk to himself... Well on the trip home things became totally out of hand.. My nephew calling several x's a day sayin Aron talking to himself etc... Never experienced this before nor has he ever behaved this way.. Well he got home very late Fri. night and ooo boy its bad..He seems to be living in a fantasy state.. Bending souls? Saying bazarre things.. Several hrs after he returned we brought him into the hospital... My baby has been labeled with accute psychosis and theyr fearing schizophrenia!! He was tranferred to facility 2hrs away today.. I got to follow him up and get him settled.. Now tomorrow instead of driving 3hrs. NW to Buffalo for 2nd opinion i'll be packing and got to live at a campgrounds as cant afford hotel so im close n can see him once a day... I'm trying to be hopeful things go well its a beautiful facilty and spose to be one of the best in the state.. I cant stop crying never seen anything like this and am scared out of my mind!! Needed to get this out some place losing it over this... Thank you all for listening.. Also if im off for a while u know where im at..Big hugs..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791302",
      "Title": "Not making it to 2nd opinion OT tammie bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 13, 2012 11:39AM tammie wrote: Claire its your turn to ask 5 questions now... So pick a friend and ask away ;)",
      "MessageIndex": 20,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793384",
      "Title": "Five Questions - clairejslm CoolBreeze exbrnxgrl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 18, 2012 11:11AM tammie wrote:",
      "MessageIndex": 6,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789290",
      "Title": "Anti Hormonals...can you go back on them at a later date? smiley2 JillThut"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 22, 2012 09:45AM tammie wrote: Kita soo happy to hear your enjoying some good family fun would love to see the pics of your lil one... I'm keeping fingers and toes crossed for you that this trial kicks the crap out of that cancer.. Big  hugs and soo happy for you..Tammy",
      "MessageIndex": 21,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792375",
      "Title": "What a great day :-) kita exbrnxgrl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 16, 2014 02:45PM tammie wrote: I had gamma knife a year ago feb 3rd.. I must confess despite bein so anxious and nervous it was the easiest treatment I've had yet.. I hope you have an amazing success with it as well.. Hugs to ypu",
      "MessageIndex": 11,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818086",
      "Title": "Had Gamma Knife on Friday lovinmomma vickib"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 13, 2012 11:16AM tammie wrote: Count me in sounds like alot of fun and will get to know one another better... GREAT IDEA ;)",
      "MessageIndex": 18,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793384",
      "Title": "Five Questions - clairejslm CoolBreeze exbrnxgrl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 2, 2013 09:17AM tammie wrote: <3 and ((hugs)) to you Kita.. I've not been on the boards much.. Soo hoping things turn around for you fast.. Sending lots of good healing vibes to you... Kind of at a loss for words but refuse to believe you wont rally and come back to kik cancers a**",
      "MessageIndex": 9,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798278",
      "Title": "Hospice at 25 oh he'll no! kita stride"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I dont mean to be a winer, or sound ridiculous when so many of you have been fightin for much longer some with a far worse prognosis than me.. My 20 yr old daughter whos a full time student with a 1 yr. old daughter texted me from work yesterday asking if since i was doing so much better did the Drs. still say i was going to die.. She was there at dx when Dr. doom and gloom informed me things were grim and i probably had a yr left.. It broke my heart to tell her that my dx hadnt changed but i did feel that i should have more than a yr but couldnt say how long.Gave her the whole line about enjoying the good times and dealing with the bad when they come..After quite a lengthy discussion i THINK i had her feeling more positive about the situation.. Today my 15 yr old whos been behaving like a little trooper through this past month which has had me waitin for the other shoe to drop as hes a quiet little guy who keeps alot in finally with no warning barged into my room saying we should talk.. He says he feels like i just walk around acting like everythings fine and acting all happy even though i know that im going to die!! I was floored!! Safe to say the other shoe dropped alright right on my damn head thats for sure.. After lengthy discussion some tears and a quick tour of the internet to look at my disease and the fact that some people fight for yrs he seemed to be a little more confidant that i clearly have some more time left and it may be a good idea to be happy and enjoy as much as we can right now..Needless to say much like probably every other mom out there now that i have them put back together some im now tore up..I HATE THIS DAMN DISEASE!! I been tryin to keep it together ive got scans on tues. for pet/ct and also doing a  brain MRI due to headaches and little round lumps behind my earlobe any1 ever experience this? I already know theres a small lesion in my liver..But i have a bad feelin bout these lumps showing up now behind ear and keep fearing the worst..I'm sorry for wining ladies but i could desprately use some advice and support here..Definately having one of those days where i cant seem to find the light at the end of the tunnel..Get so frustrated at times i just wanna throw in the towel i hate seeing our families go through what they endure do to this nasty a** disease its just not right..Much love and sorry for wining yet again i just cant take this sh** anymore its too much!! Thank you all for being hee any advice or pointers much appreciated.. (((HUGS))) Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777300",
      "Title": "Please some one help me outta this hole,cant seem to get up!!! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 9, 2011 08:06AM tammie wrote: I can soo relate the other day i ran into a co-worker she asked why she hadnt seen me at work in some time..I replied that my cancer had returned and the drs. pulled me from work as i can no longer keep up with the lifting..she replied well at least your still a survivor!! idk what people think some times?? I assume she was probly tryin to console me but dam i didnt even know what to say other than yup im still fighting on lol???",
      "MessageIndex": 3,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776162",
      "Title": "uuuggh apple nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 31, 2011 08:09PM tammie wrote: Well despite a rough night with little sleep i learned i dont like oxycodone immediate release, my extended release morphine.. I'm slowly finding my new normal here..Its hard when im normally the rock i need to learn to ask for help..I also have to learn to let it all go which is hard as im a control freak...No DH here i threw him to curb 1 1/2 yrs. ago like the worthless cranky piece of machinery he had become.. I got 4 children ranging from 23-15, the older ones are here most of the time, since i became ill,which has been a change as they all live on their own, my oldest and his family have moved in to help me (lucky me)..I'm not lookin forward to tomorrow brain MRI, then riht into PET/CT scan for full scan gonna be long day in machines but at least it getting done..I'm gonna think positiveand hope for good scans..Big hugs to you all and thanks again <3 Tammie",
      "MessageIndex": 19,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777300",
      "Title": "Please some one help me outta this hole,cant seem to get up!!! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 11, 2011 11:23PM tammie wrote: I dont have ibc im stage IV idc and was told upon diagnosis that i couldnt consider tryin to do my job as i work with the disabled and can be very physical at times.. I applied only a few weeks ago and they are telling me that i should be recieving payments within a month..The woman on the phone today says its because of my stageIv dx and the paper work my dr filled out i apparently dont have to wait 6months..I dont know how much help that is just figured i would share in hopes you could have the same luck...Best wishes and do keep us posted big HUGS..Tammie",
      "MessageIndex": 8,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776313",
      "Title": "Disability Retirement? Faith316 PaulAndSandy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 3, 2012 09:38PM tammie wrote:",
      "MessageIndex": 9,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789932",
      "Title": "Always something.... silentbell bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 28, 2012 08:21PM tammie wrote: Sending lots of positive thoughts your way Mary (((hugs)))",
      "MessageIndex": 29,
      "PostDate": "28/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794063",
      "Title": "Not More?!! marywh GatorGal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 30, 2011 11:01PM tammie wrote: Zoh thank you soo much i really needed to hear that..I would be sleeping right now but i discovered being the genious i am i never got my morphine script refilled today like i was spose to soo im up quite sore to say they least, kicking myself in the hiney like you wouldnt believe!! Your words meant alot to me and really hold true i too may just print this soo the next time i feel myself falling i have somthing to help me gain perspective..I'm gonna work on tryin to pick me back up here in the mean time im gonna throw that towel all over hell, or at least till tomorrow when i can get my pain under control..Big hugs and Thank you i wish words could convey how much you help me hold on to that proverbial rope we all seem to be hanging by you ladies here are my knot i want you all to know that..Tammie",
      "MessageIndex": 4,
      "PostDate": "30/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777300",
      "Title": "Please some one help me outta this hole,cant seem to get up!!! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 27, 2012 11:30AM tammie wrote: I too have been at a loss with this as of lately.. I made all the final arrangements and wrote a long letter to each of them to be opened in the event of my death.. I do know i lived with my grandmother who was my world and i hers till i was 10 yrs old she wasnt expecting to leave this world and therfore had no time to prepare, however the sterling silver bracelet she won at bingo the night before she passed and told me she wanted me to have is one of my prize possesions in life... I just get too confused as to whether havin things to open on B-days etc. would drag the heart ache out for them or actually make them happier inside i believe it depends on the individual child and thats where i become soo confused in this process as well.. Will be enlightening to hear what others have for input on this topic.. Nice thread idea as i often wonder about this myself..",
      "MessageIndex": 1,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792649",
      "Title": "What should I be doing for my young children 4myangels momto2angels"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 11, 2012 05:20AM tammie wrote: Welcom Sonata to the club none of us want to be in, but seem to be stuck here none the less... I think each of us deals and adjusts to the changes stage IV brings into our lives in our own time in our own way... I think you will find many ppl to relate to n talk to here as time goes on... Glad you are here, I can so relate to your saying you feel all alone i too have felt that soo many times since dx... Big hugs to you and we r all here when you need us best of luck to you..Tammie",
      "MessageIndex": 24,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788796",
      "Title": "Feeling alone...and facing a new reality Sonata rosasmommy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 26, 2011 08:51PM tammie wrote:  just stopping to say i miss your posts and messages i hope you are comfortable...Thank you also for all your support when i found my way back to this sisterhood.. If it were not for you i dont think i wouldv got through the first month, you are one strong lady BIG ((hugs))",
      "MessageIndex": 70,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776192",
      "Title": "Palamino rides again.... thats-life- Naniam"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 3, 2012 11:25PM tammie wrote: Spamgirl i was dx'ed 8mo. ago and was told a year if i was lucky.. Well I believe that Onc.'s about to eat her words, not that i will see her again but tempted to send her a card lol.. I'm 10mo. in and still gettin around as well as i was a year ago... I have too many lesions to count starting with 3 in my skull and ending in my toes , i also have many small lesions in my liver..It amazes me everytime i veiw a bone scan that im up and feeling soo good.. I dont believe any of us have an expiration date.. I too was very occupied in the beginning feeling like i had this time stamp hanging over me but as times gone on ive come to realize im very likely to have in the worse case scenerio at least several yrs and hoping to even defy that ;) My i ask where your mets are and what tx your doing? I'm currently on arimadex and zometa only, but the last bone scan showing the bones are flaring up again so fear it may be back to chemo or some other tx to slow it back down.. But honestly i live a pretty productive life..A wise women from these boards told me when i first started this path to never ever let anyone put an expiration date on me, and to get up everyday and live it to the fullest! This is  a crazy roller coaster ride, that we are stuck on...Its full of many dips and twists, and can at times leave you spinning!! But the biggest dips are worth every minute we get to enjoy in the sunshine..Big hugs to you.. AND most importantly never forget we dont come with time stamps or expiration dates.. :) ",
      "MessageIndex": 4,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790072",
      "Title": "Expected Life SPAMgirl jocanuck1951"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 9, 2012 09:39AM tammie wrote: I hated that part of taxol tasted like i was sucking on a penny..For some reason the only thing that seemed to help was lemon candies and banana popsicles.. The taste does go away after a week or so then comes back with the next tx... Best of luck n big hugs..Tammie",
      "MessageIndex": 6,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783869",
      "Title": "Bad taste in mouth redwolf8812 Moderators"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 13, 2012 05:33PM tammie wrote: Upon being dx'ed with liver mets on PET/CT my onc. immediately did an ultrasound and an MRI to confirm, they also tried unsuccessfully for a biopsy as despite have many small mets to both lobe none where large enough to get a piece.. However on flip side if mets in body chances are it may be mets and maybe Onc. is being cautious.. Doubt that I just did anymore than confuse you further.. But I would suggest requesting further tests if your not comfortable just assuming without being positive i think i would want to know for sure also.. Big hugs <3",
      "MessageIndex": 12,
      "PostDate": "13/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796247",
      "Title": "Liver....Please Read and Share your Thoughts lukejessesmom lilylady"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 6, 2011 05:41AM tammie wrote: It took me a minute to post on this, to say that you will be missed is an understatement..i hope you are at peace..Words could never convey the appreciation i have for you and the support you gave me when i came back on the boards in Sept. after the stage IV bomb hit me in the head..When i first spotted this very thread last month after wondering where you had been, it struck me that while you were so very ill you were taking time to give to me support guidance and strength to fight this evil beast..May your spirit soar my friend.. My condolences and much love to your family and friends..Tammie",
      "MessageIndex": 129,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776192",
      "Title": "Palamino rides again.... thats-life- Naniam"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 08:45AM tammie wrote: Count me in.. stage IV mets to bones n liver 9/2011.. Now progression to brain,and rt. lung with bone and liver progression 2/2013.. Still battling on.. how many are we up to?",
      "MessageIndex": 308,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 9, 2011 05:31AM tammie wrote: Thank you Lynne!! I was 32 when i found my lump and waited several months of them screwing around telling me couldnt be breast cancer as i was too young blah blah blah...I was fotrunate and caught it at stage IIb (or soo i thought) However here i am 9yrs post dx fighting bone and liver mets..I dont think there is a clear cut rhyme or reason it just is and an organization the claims to be providing information and support for women concerning this disease should be more realistic and most of all SUPPORTIVE...Big hugs and thumbs up to you Lynne thank you for speaking up!!",
      "MessageIndex": 20,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777774",
      "Title": "This kind of thing drives me crazy. lynne248 pbandj"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 23, 2013 11:17AM tammie wrote: Sending big hugs to you Jenn.. So happy we can all enjoy this day with you.. Your a true inspiration to me <3",
      "MessageIndex": 41,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/800871",
      "Title": "5 Years Out! JeninMichigan Jac53"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 29, 2011 01:43PM tammie wrote: I too seemed to float for months before i knew my diagnosis, it seems none of it was real till i was almost done with my treatment..Ours sound very similiar exept i was her2-... Do try to learn all you can regrding your dx(diagnosis) , at this point it wont change your tx (treatment) but as with anything in this world knowledge is power...At least you are most of the way through your treatment and on your way to healing up..I so remember that time of my life , when i got up to run back to work and back to my normal day to day life after tx i felt totally changed and with the chemo fatigue and chemo brain it was hard to keep up, it took a while to accept it all and get back to my new self again... wanted you to know you arent the 1st person to be almost done with tx before even knowing your full dx... Big hugs to you my friend sendin healing vibes your way..Tamm",
      "MessageIndex": 1,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775705",
      "Title": "clueless about my diagnosis zumbagirl Wendyspet"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 26, 2012 08:22PM tammie wrote:",
      "MessageIndex": 11,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/642796",
      "Title": "bit stressed Tracy1964 bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I have stage4b.c. With mets to all bones,liver,and recently brain and lung. I had radiation to rt femur almost 3mo ago with no side effects Nd little relief , I'm suffering this odd swelling to upper rt leg for about a week now that we can't seem to figure out, ultrasound shows no clots X-ray negative,somebody on the other thread suggested possible lymphodema as the problem? Can u have lymphodema to your leg? Any insight will be greatly appreciated Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/803609",
      "Title": "Unexplained swelling in leg? tammie mom2twins34"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 28, 2011 04:46PM tammie wrote: big big hugs Zoh!I soo hate those days!! It seems that theres either the dys were you can breeze through without cancer takin on minute and then theres those days were we can almost forget it..I'm hoping todays a no cancer space day!! Love you..Tammy",
      "MessageIndex": 44,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778695",
      "Title": "Help, Im boring. Cant talk about anything but cancer. LivingIt Reneepals"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 16, 2011 07:06PM tammie wrote: Wow Chainsawz thats some advice i needed that as well..I'm so sorry to hear about your wife..I too have recently been diagnosed stage IV and find myself seeking that very same answer..I have realised that although i know i am eventually goin to die from this disease that theres no way of knowing when...I wish i could tell you more or even take some of that pain away..Big hugz to you and your wife..I hope she manages to live on for many yrs to come :)",
      "MessageIndex": 5,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776582",
      "Title": "stage 4 skooby CoolBreeze"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 22, 2012 08:04PM tammie wrote: Congrats to you!! I soo agree with the LIKE button ive thought that for some time :)",
      "MessageIndex": 5,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795351",
      "Title": "First Date reader123 aic"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 18, 2011 10:28PM tammie wrote: I wish i could give you a big hug right now..I was diagnosed in Sept. with many mets to the spine..I have to say i love your attitude,never give up hope!! These past few months have been quite the roller coaster ride to say the least, as im sure you can identify with..There will be those days when it all seems to swallow you up..Please remember we are here to help in any way we can..I'm also here if you ever need an ear to listen do not hesitate to private message me i'll help in anyway i can.. Big big hugs and much love to you..Please keep us posted..Tammie",
      "MessageIndex": 6,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778341",
      "Title": "Just Diagnosed Stage IV Mets avjenks8 avjenks8"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 8, 2012 11:50AM tammie wrote: Im about 4hrs northwest of the city will have to google Mich. ive heard it geourgious this time of yr..I cant find you guys on facebook wanted to add you on the page im on all the time.. When are you considering this..I'm in a bit of a health warp again waitin to hear when i can get into Roswell and hoping for a PET scan soon..Hugs and hope all goin well for you...",
      "MessageIndex": 4,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790141",
      "Title": "Get together in Michigan ? Travelingpants2 Travelingpants2"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 14, 2011 01:45AM tammie wrote: Jacque welcome to our sisterhood so sorry you are having to deal with all this..Try to be positive..I know its so scary and overwhelming tryin to sort through all this crap..I'm only a few months into mets myself..I will share what ive learned so far in hopes it may be of some help..#1 was DONT read statistics and realise YOU DONT have have an expiration date..#2 Ask lots of questions and keep coppies of all scans and reports..#3 If you dont like your Dr. or are unsure always get a 2nd opinion..#4 was to live each day for all that you can!! Big hugs to you and dont lose faith we are here to help you through..Much love to you and your family..Tammie",
      "MessageIndex": 17,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778048",
      "Title": "Just diagnosed IBC and liver met; I'm scared Jacque1102 ibcmets"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 16, 2012 08:41AM tammie wrote: Soleil sending big hugs to you!! Also before i go any further ty soo much for your prayers and thoughts, im hangin in there n trying to keep a positive outlook on this and hopin i will hear b9 in test results next week..Biopsy is tues morning the 19th so at least i know by the end of the upcomin week i'll have answers... As for family and friends not realizing how lucky they are i dont think theres a trick to make them realize mine call me all the time even this week with the most ridiculous concerns from my daughter who fears the dress she bought my GD for her birthday party wont match the decorations she chose well, to my DL flippin out because she caught pink eye and somone took her pic. the other day..The best one was my son flippin cause the screen door was hangin off the back of the house as dogs knocked it down (couldnt have been their fault for not lettin dogs in).. Well just gettin home from hospital took me 2 days to even look as i wasnt sittin in the yard to discover it required my unscrewin 4 screws to remove door myself and 8 screws for my BF to fix it then put it back up!!! Yet he yells why did u take that door down yourself Mom your sick? My reply was because apparently it takes stage IV cancer to have the sense to unscrew 4 screws he didnt like that!! I was furious to say the least.. Needles to say i can relate...Hope your doing well and enjoying an awesome weekend...Big hugs..Tammie",
      "MessageIndex": 12,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789181",
      "Title": "Ever lose patience with civilians? soleil505 bhd1"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 18, 2012 11:08AM tammie wrote: AWESOME NEWS !!! Congrats Leah :)",
      "MessageIndex": 25,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789266",
      "Title": "Good news! Leah_S DivineMrsM"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 17, 2012 08:16PM tammie wrote:",
      "MessageIndex": 32,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786011",
      "Title": "crying tonite apple banjobanjo"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 5, 2012 04:11PM tammie wrote: O.k although balling my eyes out im so on board to contribute in anyway possible financial or otherwise... I do ask however that we can make it a tribute to Zoh and love the idea of being able to have them sent to children who have lost a parent or loved one to breast cacer....Gotta be a little humerous too as we all know Zoh would have it no other way..God i miss her and her humor... But amm loving this Apple you r the best for coming up with such a clever idea i been lost for weeks as to what would be a fitting tribute n this is it... I'm gonna start fundraising now for this so let me know where to send donations when u get more organized...Hugs n thank you..Tammie",
      "MessageIndex": 105,
      "PostDate": "05/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780801",
      "Title": "a thread of gold apple GatorGal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 29, 2012 10:25PM tammie wrote: I have 3 mets to the skull since dx and have an issue seeing 2 black spots ive narrowed it down to my right eye..I also get blurry vision sometimes but never attributed it to skull mets perhaps i should ask on this...I hope you get some answers soon..Big hugs..tammie",
      "MessageIndex": 6,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781791",
      "Title": "Skull mets dunnmd tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 7, 2012 09:49AM tammie wrote: Im not sure how far i am from Mich. what part i would definately consider it i could use a little get away and would love to meet you... <3 Tammie",
      "MessageIndex": 2,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790141",
      "Title": "Get together in Michigan ? Travelingpants2 Travelingpants2"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 9, 2012 07:49AM tammie wrote: Well get back to me when you have an idea on dates and im keepin fingers crossed i can come, i soo need a get away <3",
      "MessageIndex": 6,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790141",
      "Title": "Get together in Michigan ? Travelingpants2 Travelingpants2"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 29, 2012 10:51AM tammie wrote: Sending positve thought and B9 vibes to your hubby... I cant imagine the anxiety you must be feeling.. Will be thinking of you and hope it turns out for the best.. Big hugs to you..Tammy",
      "MessageIndex": 2,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792736",
      "Title": "Are you kidding me????? bourscheid LuAnnH"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 10, 2012 02:23PM tammie wrote: Wow!! Apple thats some tomato!! Really cool i had to show my DL and son.. :)",
      "MessageIndex": 13,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790335",
      "Title": "OT - i own the world's coolest tomato. apple tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 7, 2012 04:46AM tammie wrote: Sending hugs to you... Never looked at a PEt before so i'll let the others chime in with their guesses lol... I hope whatever comes of this you are able to beat it back some... It just occurred to me that us stage IV girls may not feel as brave, couragious,or strong as others like to believe (this topic often angers me) but as i was writing this post the thought just popped into my head that we sure do fight like hell for our lives on a regular basis!! Perhaps thats why ppl always like to think we are so strong when in reality we just want more time in this life and with our families... I hope you get that time Ann not because your strong couragious or brave but because you are a beautiful soul that deserves it...Sending good thoughts and vibes your way..Tammie",
      "MessageIndex": 49,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 19, 2011 01:30PM tammie wrote: How do i go about signing these Traveling Pants?? I noticed this thread last week and thought it was awesome!! we are REALLY blessed to have you Ms. Traveling Pants as our voice does need to be heard.. Untill my Dx of mets last month i had NO IDEA how little there was for support and upon embarking on the information trail for tx and standard course of care the biggest resource i've found was all you sisters here, thankfully i was blessed during my first run of tx by finding this site and made many friends here and knew where to look..KUDOS to you Traveling Pants and THANK YOU for helping to give us a voice... Also BIG hugs to Stephani i hope her tx is a huge success..Tammie",
      "MessageIndex": 23,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776080",
      "Title": "Hmm...whatya think....lets make a movie Travelingpants2 FireKracker"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 3, 2012 04:21PM tammie wrote: Best one was this week stated to me by a psych Dr. tx'ing my DS in a mental facility...  Dr: \"You look wonderful and very strong are you positive you've given us the correct information on your health?? \"When your son becomes clear he seems quite confident you may live for several years or more but that your cancer isnt curable\"!! Me: \"Sir i've got tumors in my bones from skull to toes and also throughout my liver and am stage IV.. Unless you have a cure for that im afraid my DS is 100% correct\" Of course you should've seen his face.. Was soo mad as he asked me sternly as if there were some mistake in the paperwork ",
      "MessageIndex": 112,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 26, 2012 08:53PM tammie wrote:  You could look into cancer treatment centers of america theres one right in Philly, idk how far that is from hershey Pa. but it sure sounds closer than Texas.. theyr spose to be really good there and it would be a great lace to go for 2nd opinion.. Also a snippit of advice follow your gutt and go where you feel most comfortable, if some of my friends and fam had their way id probably be a wired up science project on the damn moon or some forsaken place lol.. Just do your research and look into things fully before jumping on board..I had a friend all bent on putting me on the herbal thing when i was first dx'ed and i found out later if id have taken it i would've been helping to feed my type of cancer cant remember whicch one it even was now but its specifically shown to feed hormone positive cancers, soo good thing i didnt like the sick tummy that came from it and refused after 2 days... Big hugs and hope things are coming along for you.Tammie p.s. i replied to your pm sorry was off last week :)",
      "MessageIndex": 4,
      "PostDate": "26/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792600",
      "Title": "Anderson in TX HLB Chickadee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 14, 2013 01:41PM tammie wrote: Thanks for the update.. I too am guilty of not posting too much but I do tend to check in on posts every week or so.. Hope everyone's doin as well as can be hugs to all",
      "MessageIndex": 13,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805972",
      "Title": "When members stop posting exbrnxgrl Iwillwinthisbattle"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 11:42AM tammie wrote: Barb i havnt exactly left the boards i try to get over here every few days... I spend alot of times on facebook playing stupid apps.. Honestly i been in a bit of a funk for months, not to mention a couple of the losses here has really hit home.. Being soo ill with such extreme progression had me realizing exactly how little time i have left despite feeling n looking so good.. As im beginning to feel better and the wedding stuff is dying down some im sure ill be here more, i love and need all you ladies in my life and soo appreciate you all for being here for me and often the only ones that seem to understand what im goin through <3",
      "MessageIndex": 16,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803385",
      "Title": "Dropping by to say Hello tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 04:02PM tammie wrote: I love dumb jokes could definitely use some of those. Been joking bout fat girl leg all week..",
      "MessageIndex": 20,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803385",
      "Title": "Dropping by to say Hello tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well my daughters wedding was beautiful.. Was quite the busy day/week.. Soo thankful on the Xeloda i seem to be doing well enough to get around again.. My youngest did wonderful at the wedding with all the people.. Im struggling with a head cold for the past week and now laryngitis but hoping if i rest up and take good care of me this week that this too will break... I really pushed myself last week with ll the preparations and activities but honestly seeing my baby girls face and being by her side was such a blessing and soo special its still bringing tears to my eyes.. Honestly its nice to finally have happy tears and see things improving.. I hope you all are doing well and although im not on here often anymore i hope each of you know your all in my thoughts daily <3 Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803385",
      "Title": "Dropping by to say Hello tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 12:11PM tammie wrote: I'm working on doing just that Frapp i need you ladies in my life!! Soo glad things are slowing down for me :) But also trying to learn not to hide when im at my worst as i didnt realize i do that on the boards as well as with family and friends but its in my nature to be the care giver not the caretaker i need to fix that given my current health and place in life..",
      "MessageIndex": 18,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803385",
      "Title": "Dropping by to say Hello tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 20, 2012 04:48AM tammie wrote: I have to say the roller coaster too, despite feeling it at times sounds a bit cliche (probably because i use it so much lol).. but honestly stage IV has given me that same sick pit in my stomach that i get when flying down one of those big dips on a roller coaster.. Then you lift up high as the sky and feel phew i conquered that one without vomitting only to have it dip super fast and often upside down and out of control again, always hoping for the ride to end without making me vomit.. The only difference now I dread that crazy ride coming to an end as I know it  will mean the end of ME and all I still feel I want to accomplish in this life!! So i continue to ride on praying the ride will give me just one more smooth section of track in which i can pull that pit from my stomach and the ride conductor will let me go just one more time without getting off and having to wait in line again.. Most importantly Thanks to all you ladies here for riding with me as i've no clue how i could handles those big dips without you all to cheer me on! <3 this thread hugs to you all.. Tammie",
      "MessageIndex": 30,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792176",
      "Title": "Stage IV Breast Cancer feels like . . . radiant Sanibelblueyezz"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 26, 2011 07:36PM tammie wrote: 32 was first dx.. 41 just dx'ed with bone mets this month",
      "MessageIndex": 693,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 13, 2011 01:48PM tammie wrote:",
      "MessageIndex": 16,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775737",
      "Title": "MBC Awareness Day Tweets & FB Updates You Can Use EnglishMajor Marie50"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 22, 2012 01:00PM tammie wrote: Welcome Claire!! You are very appropriate for this forum, actually from my perspective almost anythings appropriate here, i dont think theres much we dont share with each other... Its very normal to get frightened ..I was dx'ed in sept. with bone mets head to toe and liver mets 2months later.. I can fully relate to the big fear with the skull mets, of all the mets i have the 3 in my skull scare me the most!! I'm always worried any little head pain sends me reeling, recently i went through a bout of horrendous head aches and i'm sure you can imagine what was goin through my mind.. I hope your onc. has a good trick up his sleeve to get things settled back down and stop the progression.. I dont know your type of cancer or er/pr status her2 etc.. I have learned in these last 10 mo. that there are many treatments and drugs out there to help slow things down Soo dont give up hope theres probably something out there that will get things back under control... Wish I could do more than tell you your not alone and remind you we are always here to listen... As i'm sure you already know this disease is like a roller coaster ride that has far too many dips and drops that never end.. Big hugs to you and please keep us posted soo glad you joined us...Tammie",
      "MessageIndex": 2,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790939",
      "Title": "Skull mets clairejslm clairejslm"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 7, 2012 12:29PM tammie wrote: I have to say Hawaii is one of my favorite places in the world soo beautiful there... What a cute little guy... Hope you had a wonderful time",
      "MessageIndex": 6,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790214",
      "Title": "Hawaii pics bkglenn50 Moderators"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 16, 2011 07:17PM tammie wrote: WOW!! You are an amazing person soo many thanks for helping to make our voices heard!! Ty ty and big hugs...Tammie",
      "MessageIndex": 3,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776330",
      "Title": "LINK TO YAHOO SHINE ARTICLE !!!! Travelingpants2 tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 4, 2012 11:50AM tammie wrote:",
      "MessageIndex": 8,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790075",
      "Title": "Happy fourth bhd1 ibcmets"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 17, 2012 08:11AM tammie wrote: Welcome and as many have said sorry you had to join us here... I'm sure as you can see theres lots of support and information here... I've been stage IV for a year now with inemerable mets to almost every bone in my body an inumerable (i hate that word now lol) mets to both lobes of my liver... I remember when I first heard the diagnosis I couldnt even begin to wrap my head around it, I felt like Alice in wonderland and was in that deep dark hole... When i first came back to these boards i thought my life was over and these ladies picked me up and dusted me off so to speak and before i knew it I was moving forward..  I'm 42 with 4 children my youngest has just turned 16 .. If you ever need a friend to talk to or bounce questions off of feel free to message me any time.. Also try to remember you are not alone and as difficult as the first months of this can be dont ever lose hope.. Some advice dont read statistics their false, research your treatments and always remember if not comfortable with your Dr. theres plenty out there... I just past the one year mark a couple weeks ago and the stupid Dr. that diagnosed me gave me 1 year tops and im actually more healthy today than I was a year ago, thanks to the guidance here I fired Dr. Jerk and am doing great... Big big hugs to you we are all here when you need us dont doubt that... Tammy",
      "MessageIndex": 13,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793621",
      "Title": "Petrified...Stage IV with mets to the liver right out the gate aic GatorGal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 13, 2012 10:03PM tammie wrote: I joined a group from my facebook page called shift the awareness.. We have all been looking up different companies and requesting where donations are going and how much, the ones that dont reply or arent seeming to do much of anything we then been leaving lots of comments and e-mails giving them negative publicity.. We have also begun to take on Komen and flooding them with letters and e-mails asking for more support and awareness for stage IV.. Hoping to spread more awareness for MBC and promote research money... I've been amazed at the number of companies that are clearly scamming it all the way around..",
      "MessageIndex": 15,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794864",
      "Title": "Perverse Satisfaction Department Tina2 DivineMrsM"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 30, 2011 11:41PM tammie wrote: (((HUGS))) Vicki i too have been feeling lost and robbed of my life due to this disease the past couple days..Wish i could say or do more to make you feel better..Hope tomorrows a brighter day..Tammie",
      "MessageIndex": 4,
      "PostDate": "30/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777299",
      "Title": "Missing my old life and what I thought it would be. vickib irish22"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 1, 2012 10:29AM tammie wrote: Thank you ladies for the advice im gonna look into ortho pedic drs as well just to get a good idea on my options.. My femurs are apparently becoming a mess also so its porbably a good plan to have it all looked at by an ortho dr..",
      "MessageIndex": 10,
      "PostDate": "01/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794173",
      "Title": "Buttitis = broken hip tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 29, 2012 10:56PM tammie wrote: Spam girl I myself didnt fully understand but decided i wouldnt look a gift horse in the mouth lol... I finished chemo in March then went onto arimadex.. The Drs. at the cancer center said i could still be riding affects from chemo on the liver or and could simply mean since the bone mets are far more established theyr going first... Could also be a signals that either arimadex wasnt doing it or bones possibly changed status.. He felt i was stable enough to try Aromasin for 3mo. and see if it made a difference and if not then go onto chemo.. Jan the radiologist is not going to radiate hip and said it doesnt need set or anything as its not a fresh break told me my calcium and D are very important right now and to call onc. to see about increasing them.. Crissy thank you so much for making it sound simple i needed to hear it that way. I promise you all i've been taking very good care of myself, havnt missed an important appointment yet... My son is finally progressing out of the psychosis on this new med. and im hoping to have him home within the next month at the latest.. Thank you all for being here for me through all this.. Big hugs to you all",
      "MessageIndex": 5,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794173",
      "Title": "Buttitis = broken hip tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 5, 2012 10:10AM tammie wrote: OMG!! LMAO!! An iguana... My current Bf this past X-mas was stumped on what to get me as im very non materialistic and was asking every1 in my family.. We had talked about my driveway needing to be widened in the spring and he was gonna get the rocks at a discount for me..While upon talking at length with my oldest son about what to get me my son jokingly said get her the gravel she needs for the driveway.. well i'll be a son of a gun if he didnt take him serious and i came home Christmas eve to find a load of gravel all spread and leveled as a gift, he was so proud and said i didnt know what to get you and i knew you wanted these..LMAO.. My son later told me of the discussion and laughed sayin Ma i didnt think he'd take me serious...",
      "MessageIndex": 17,
      "PostDate": "05/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791554",
      "Title": "OT - Worst present ever... dormouse72 Iwillwinthisbattle"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well i did the gamma knife this morning it actually went very smoothly and i must say its definately on the list of easier treatments ive encountered.. Gearing up to start Xeloda Fri.. Was wondering what creams i should get for the hand/foot thing.. Hoping Xeloda can make a miracle happen and get these new lung,liver, and bone mets under control... Big hugs to you all and hope your all in good health <3   Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801365",
      "Title": "Gamma Knife done ;) tammie soleil505"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 7, 2012 11:02AM tammie wrote: Ann i'll be keeping my fingers crossed that theres decent news for you tomorrow... I too have a 15 yr old son an totally relate to your thoughts as thats all i been prayin for is to get him through high school and into college... Big hugs and thinkin of you..Tammie",
      "MessageIndex": 56,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 7, 2012 02:40PM tammie wrote: Crap!! Cancer does suck!! Sending positive healing vibes and keeping my fingers crossed that WBR kicks the crap out of it...Big hugs to you",
      "MessageIndex": 40,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782258",
      "Title": "friggin brain biopsy results :< chainsawz AnacortesGirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 10, 2012 10:54PM tammie wrote: Sending you big hugs.. dont blame yourself for trying to go with something you believed was showing the best results, isnt that what we all do.. Also i'm HIGHLY allergic to Taxol but did fine on A/C... Dont lose hope if maybe you should try 2nd opinion... I got hope for you keep looking till you find what works.. Your in my thoughts sending hugs..",
      "MessageIndex": 13,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793326",
      "Title": "Holding my breath and trying not to worry soleil505 soleil505"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 8, 2012 02:10PM tammie wrote: LOL OMG!! Definately a rough start to the morning... Hope the day gets better hugs..Tammie",
      "MessageIndex": 5,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790256",
      "Title": "Share a Funny... Lowrider54 barsco1963"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 21, 2013 03:58PM tammie wrote: Thank u all for the replies never considered lymphodema. I want to believe not rad related as been 3mo. Since rads to femur. Hoping to get answers this week",
      "MessageIndex": 6,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803600",
      "Title": "Swollen leg? Now swelling in rib area???? tammie Mzmerz"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 17, 2011 12:21PM tammie wrote: OMG Sheila big big hugs to you what a very frightenin horrible experience i teared up reading your post...This damn disease is soo cruel it seems to touch every part of our lives and our families... Big hugs to your DH as well its got to be soo hard on our families to try to carry us through all this..Thank you soo much for sharing as it makes me aware that i too need to keep a close eye on my family as well..Much love to you and your family..Tammie",
      "MessageIndex": 30,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778183",
      "Title": "STAGE FOUR NIGHTMARE. AussieSheila ibcmets"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 17, 2011 03:16AM tammie wrote: I'm so sorry you are having to deal with all this with so little medical support..I agree ER is probably your best bet..Is your mom elegible for medicaid or here in Ny theres a program through medicaid that will cover all treatment costs..Perhaps theres a way you could find her another oncologist that is willing to be more involved and supportive...I too am pretty new to all this myself..I wish i knew where to point you for better support.. Big hugs to you and your mother keep us posted and i'm always here if you need to vent..Tammie",
      "MessageIndex": 2,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776572",
      "Title": "in the dark knowclu MJLToday"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 5, 2011 01:07AM tammie wrote: WTH!! So sorry that sounds ridiculous!! Where are you being seen i know your close by me perhaps a new dr with  more thourough approach somebody has to do somthing..I hope they stop passin the puck soon..Big hugs and much love to you..Tammie",
      "MessageIndex": 3,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779047",
      "Title": "Time For Me To Rant and Rant and Rant 37antiques MJLToday"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 6, 2011 09:20AM tammie wrote: I think you need a 2nd opinion..Are you with hemotology oncology ass. or are you being seen at the ROC thos are the two biggest in our area..I just had my ONC switched..I am also gonna try to go to NY for 2nd opinion after the holidays, plan on drivin we could make it a road trip :)...Big hugs i sooo understand your frustration..Tammie",
      "MessageIndex": 12,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779047",
      "Title": "Time For Me To Rant and Rant and Rant 37antiques MJLToday"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 10, 2012 01:44PM tammie wrote: My understanding of stable which is were ive been fortuntely since March, is that theres still evidence of disease but no current growth, NED is when theres no evidence of disease in your scans,and ive been told for those lucky enough to go 5yrs NED you are then considered to be in remission.. hope that helps you some ;) As for the work subject its definately something i feel VERY strongly on.. I was pulled immediately upon stage IV dx and was forced onto SSDI.. Its been a full year now and there are times I still grieve for my job I miss the feeling of having a purpose and I actually unlike many loved my job.. However one year out I dont know how I ever did both and actually feel pretty fulfilled (sp) in my new life as I call it.. Dont get me wrong i wish often I could be done with all this and just have my old life back, but I have come to love this new one i've made for myself.. Not to mention when all is said and done the time i've spent and had available for my family in this past year has become priceless to me.. Given current circumstances I wouldnt trade that time for anything in the world.. In the end it is really a personal decision and you need to do whats best for you and makes you happiest.. Doubt I was of much help on that lmao.. If you find yourself to bored or wanting to put more into community or whatever look into hobbies or volunteer work to fill some time that may even give you an idea as to how much stamina you have and you will also feel your accomplishing something.. Big hugs to you and im also sure your family and DH feel you contribute plenty.. ;)",
      "MessageIndex": 2,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793306",
      "Title": "What is the difference in Stable, NED, and remission? chefmiche Lynwaz"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 28, 2012 01:52AM tammie wrote: I hope the new treatments bring great success for your Mom.. I myself have discovered everything in moderation seems to be the best answer to this question.. After my DX i initially went mostly vegitarian, would only eat organic meats etc.. While i was doing all this believing it would make a huge difference i discovered it had invaded my liver.. Upon serious soul searching i decided to continue to make healthy choices and exercise as often as possible to maintain good health.. But it was then very apparent to me that herbal tx and diet alone couldnt cure cancer or there would be no chemo etc. and we wouldnt be searching for a cure still.. Keeping you and you Mom in my thoughts and sending positive healing vibes her way..Big hugs..Tammy",
      "MessageIndex": 13,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792493",
      "Title": "Chemo versus healthy lifestyle--Advice Please! daughterneedsadvice bourscheid"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 26, 2012 12:45PM tammie wrote: Mets to liver soon after bone mets last fall... Did few rounds of chemo and liver mets are staying stable on arimadex at the moment... Not sure if your mom's cancer is er+ or not... But do keep faith that there are many treatments out there for liver mets... Sorry she may have to deal with all this but ive discovered mets can be very treatable... Best of luck to you and your mom keep us posted and I'm here if you need a friend to talk to.. Where in NY are you? I'm in Syracuse NY myself... Big hugs..Tammie",
      "MessageIndex": 5,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791075",
      "Title": "Metastatic to LIver 4ever4mom Annemie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Soo I had my appt. at radiology today... I've been suffering hip/femur pain for 2mo. now... I told them i either had to do it next month or in Glens falls where my son is... So he poked and asked questions.. I let him know my pain was consistantly between a 2-7 for about 2mo. now.. He said he was gonna look at scans and see what he thought about where we should be radiating as my femurs and the ascilia? (the ball that goes from femur into hip is also showing alot of uptake) Well he looks and pops off with we cant radiate the hip do you see that right there its a fracture in your left hip and it doesnt look like a fresh break.. He also told me if I ever say my pains a 10 he will run as hes never seen a patient handle pain as i do.. He says i can wait a month to do the radiation and that he would wait also if in my position, he gave me a list of movement restrictions to follow, and added that if the radiation didnt fully do it he felt it may be time to go to the orthopedic surgeon (WTF?)... Soo now im flipping i been down playing the uptake in bones despite the discomfort ive been in as my liver was staying stable... Any input will be much appreciated, trying to calm myself down and am now scared to death as i been ushin through the pain but rethinking that if its breaking!! Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794173",
      "Title": "Buttitis = broken hip tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 11, 2012 08:06AM tammie wrote: Well Onc. says mass is 5.4cm in right lung n waitin on interventional radiology to let me know if and when they will do biopsy today.. Soo I shall hurry up n wait here :)",
      "MessageIndex": 29,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 9, 2011 07:06PM tammie wrote: Big gentle hugs and positive vibes to you and your wife..I'm soo hoping the chemo turns it around for her..I soo hate this disease!! Seems everytime we hit a bright spot it comes along and rips the rug out from under us..Well ill be thinking of you both and praying chemo kicks some cancer butt...Tammie",
      "MessageIndex": 22,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777801",
      "Title": "No Five Alive FiveAlive Traci-----TripNeg"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well i was all geared up for lung biopsy n scared to death over 5.4cm mass in rt. lung this AM... However the interventional radiologist said he doesnt feel comfortable doing such an invasive procedure when could b an infection..Soo they are sending me home on antibiotics for 10 days then re-scanning my lung to see if mass is gone... I'm torn here on one hand im thrilled to get out of here and go home now that my pains under control... On the other hand im anxious and fearful with what ifs concerning mass in lung.. I'm looking for the positive thinkin cap n rose tinted glasses right now and hopin mass disappears with antibiotics.. Thank you all for the help and support this week you ladies are amazing despite my staying away so much over the last few months you have all been here for me so much through this past week id be lost without you..Big hugs..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788942",
      "Title": "Leaving hospital waiting on lung biopsy tammie myangels"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 18, 2011 10:16PM tammie wrote: Big gentle hugs to you!! I'm hoping it get better for you and fast!!",
      "MessageIndex": 16,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776693",
      "Title": "Checked into the un-spa. Been hit by the Taxotere truck. MJLToday alesta29"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 10, 2012 04:45AM tammie wrote: TY all soo much for your support and advice.. I got fingers crossed n hoping that nothing could grow to 5cm in 10 weeks especially with bone n liver mets stable.. Very weird... Having hell night with the nurse from hell shouldnt complain as untill tonight theyv all been fabulous... Also any quick answer as to why they keep refering to this 5cm nodule in lung when onc said 5cm mass in right lung whats diff.? Gonna look it up and hope didnt ask another stupid question as this morphine often makes me quite stupid for lack of better word.. Just call me Dopey these days i guess.. Cant wait to have biopsy done Mon. n get sum answers so i can hopefully wean back on pain meds dont like them...Luv n hugs to you all an THANK YOU soo much for being here",
      "MessageIndex": 12,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 11, 2012 07:29AM tammie wrote: Well Ladies today is the day.. Waiting impatiently for them to let me know when interventional radiologist is squeezing me in for biopsy.. Learnin i will re-ask Onc. this am but I recall him clearly stating 5cm mass rt.lung, he was confused at size n fact that grew so fast since March, as normally my mets have apppeared tiny and many at a time in the past.. The nurses have said nodule ... Shoot i will b quite thrille if turns out to be 5mm instead of 5cm ;) I will be sure to keep all posted n hopin i can get answers soon not wantin to wait for days... Thanks to you all for being here id be lost without you..Big hugs Tammie",
      "MessageIndex": 28,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 31, 2011 11:42PM tammie wrote: I had the whole family over all the grand babies and my brother even came up from Baltimore with his wife n two little ones it was a great night with the family... Plus i got lots of leftover candy :)... Hope you all had a wonderful Halloween big hugs to you all..Tammie ",
      "MessageIndex": 8,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777332",
      "Title": "Happy Halloween! CoolBreeze justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 20, 2011 08:41PM tammie wrote: Ive was dx'ed stage 4 with mets to bones in many areas, in Sept 2011..Liver mets have now moved in as well..I have to say that in 2002 this site carried me through tx. and especially with my new dx several months ago id be lost without all of your support here..Much love..Tammie",
      "MessageIndex": 7,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778423",
      "Title": "to all new stage 4 members apple apple"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: O.K. ladies i know i havnt posted much but hoping somebody here has experienced this sort of thing and can point me and my Drs. in a possible direction... I'm on Xeloda for new progression to lung,liver and bone.. I just finished my 2nd cycle.. My rt. leg has been sore and semi bothersome despite completing radiation in Jan. of this yr... Well after my daughters wedding my whole upper leg above the knee began to slowly swell despite my staying off of it for several days.. I went to the Drs. on Tues. as it was twice the size of my other leg.. Oddly its not very painful.. The Onc. did a sono to rule out clots and an x-ray which both came back negative he suggested i continue to try to stay off it as much as possible thinkin i over did it.. Well its continued to stay huge and warm to the touch.. Only hurt when touched in certain areas and if up too much my knee gives out while walkin.. Now yesterday woke with lower rib pain on right side and am noticeing im beginning to swell there some as well.. I plan on callin Onc first thing Mon. morning but if anyones experienced anything like this please share as im beyond curious and dont know which direction to even go in.. Thank you all bunches for any input or advice as im lost <3 Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/803600",
      "Title": "Swollen leg? Now swelling in rib area???? tammie Mzmerz"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 27, 2012 12:59AM tammie wrote: I must admit upon my dx of stage IV in sept. my son sent me what he called a tincture, he told me to take it for my appetite, pain, and if unable to sleep..I hav to admit i love it for my appetite and it really works wonders for sleep n a little to calm my anxiety when im in pain... I swear by that little bottle i discussed it with my new onc and he said he wished he could offer it to all pt. as he believe its a great help and does the least damage n causes few s/e's...So although illegal i must confess i eat my tincture 1-3 times per day and think id b lost without it...I think its up to each individual but i have to say i dont regret the day i decided to give in and try it as i slept a full night that night for the first time in two months since my dx...Big hugs tammie",
      "MessageIndex": 84,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764103",
      "Title": "Pot ~ weed ~ and other cures. :) lisa34lisa radiant"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 16, 2011 12:37PM tammie wrote: TY soo much for the link i definately want to attend my brother lives close by there, so trying to decide on a hotel and if i can scare up a travel buddy right now..I'm really excited to try to do this, its what ive been looking for is knowledge and being able to meet some of you in person also is a HUGE perk.. :)",
      "MessageIndex": 6,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776553",
      "Title": "Who's going to the conference in Baltimore? rkt neogirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 1, 2011 12:26AM - edited Oct 1, 2011 12:27AM by tammie I was just dx'ed with bone mets this month so i'm not of much help..Radiation has helped my neck and back pain some..Soo sorry your uncomfortable, i'm on morphine er 15mgs twice a day n it seems to work and doesnt make me dopey..Sorry couldnt be of more help...Big ((gentle))) hugzz to you hopin the pain lets up for you soon..Tammie",
      "MessageIndex": 4,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775369",
      "Title": "bone pains Sunshine32 tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: My hairs coming in from chemo still too short 2 do anything with it, a friend told me they used chemo to help grow hair back faster i normally dont bother with such vain things however im a bit eager to remove this scarf from my head as its gettin hot out!! Soo im trying it gonna chalk this up to another crazy cancer adventure seem to have alot of these now days ;) so anybody ever hear of such a thing or have any success with such an endeavor? Yess its safe to laugh now :) Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789509",
      "Title": "dumb hair ? Rogaine? tammie SPAMgirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 9, 2012 12:24PM tammie wrote:",
      "MessageIndex": 156,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 16, 2011 04:34AM tammie wrote:",
      "MessageIndex": 3,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776553",
      "Title": "Who's going to the conference in Baltimore? rkt neogirl"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 18, 2012 09:23PM tammie wrote: Sophie thank you soo much for such very informative posts.. I was off for a few days but wanted to check back in on this thread.. You did help me understand why my Onc. is always saying we've got alot left in your arsenol but i wanna save the big stuff till we really need it.. Thank you",
      "MessageIndex": 51,
      "PostDate": "18/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796311",
      "Title": "Studies that show that \"aggressive\" chemo prolongs life? LizLemon JeninMichigan"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 1, 2013 11:27PM tammie wrote: Bon Thank you so much for making me smile i needed that.. One of my goals is to try to jump this hurdle and be enjoying the summer when it finally comes.. I've got two weddings to look forward to as well.. My only daughters getting married April 13th, and my oldest son is getting married in July.. I truly have been trying to focus on the good but honestly this craps had me scared to death it gone freaking everywheres.. Thank you again for the smile and encouragement it sure goes a long way these days.. Big hugs and happy thought to you as well <3",
      "MessageIndex": 30,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So as I posted my happy update the other day l went today for my PET results and to meet with my Onc. whos finally back after going through a terrible auto accident.. So i have gamma set up for Mon. for this new brain met and one area of the skull they believes putting pressure on my brain.. My onc. although horrified and angry i was told not only did i have brain met but liver no longer stable and spots to both lungs on top of severe bone uptake was happy they were wrong.. We discussed my starting Xeloda two days after my gamma knife next week.. He then appologized for not reading pet scan as was his 1st day back and we could read it together.. WELL it seems my liver is taking off again ive got spots with high activity in all 3 lobes of the right lung, my bones havnt just doubled in size but theres a ton of new ones.. My Onc. seemed quite shocked ive never seen him soo upset as was I.. I left there with my head spinning it seems after thinking all was well its back to mets everywheres again.. Have any of you ladies here dealt with mets to so many areas and had positive outcomes to reahing stable again? I'm soo lost and scared right now.. Bone,liver,brain and lungs!! How can i fight this back?? I'm determined to give it my all but im petrified <3 Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 14, 2012 09:03AM tammie wrote: I've asked myself the very same question time and again.. I've also attempted to research results however it seems theres no data on such things, not sure if its because they simply dont treat recurrance as aggresively or what.. Perhaps maybe some of the wise ladies here will know the answer to these questions.. Wish i could be of more help on this topi but very curious as to what responses you recieve.. hugs to you",
      "MessageIndex": 1,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796311",
      "Title": "Studies that show that \"aggressive\" chemo prolongs life? LizLemon JeninMichigan"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 11, 2012 12:41AM tammie wrote: Welcome to the boards Maxerpaws!! I'm no expert on time or how many treatments we can go through as im only 10 mo. into stage IV but wanted to say your initial dx to stage IV sounds almost identical to mine from the sounds of it... Is your cancer er/pr positive mine was originally but unfortunately in 2002 they didnt test my her2 status and despite 4 attempts to get a biopsy after stage IV dx theyv been unsuccessful.. The only advice i can offer is not to give up hope, i was told 1yr and 10mo. into i actually feel healthier and get around fairly well and am fairly confidant i'll be here longer than a year.. Have you ever gone for a 2nd opinion or to a cancer center.. I'm about to go to a treatment center 3hrs from home to see if there are other treatments out there for me as im gettin more activity in my skull..I hear you on tryin to keep life as normal as possible i was pulled imediately from my job as it was too physical and missed it dearly..I've learned to fill my time stayin busy with the family and house.. Please keep in touch i hope they have a good trick up their sleeves to knock those mets back and get you feeling a bit better..Big hugs to you feel free to reach out anytime..Tammie",
      "MessageIndex": 6,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790385",
      "Title": "Running Out of Time. Maxerpaws K-Lo"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I was just dx'ed with bone mets througout my body on 9/9/11...I've never yet to hav a pet scan i requested one from my onc. to verify issues in liver or not? as ct scan says sm lesion..My onc. informed pet scans not necessary as bone scan will track progression and even if liver mets wont change my dxs, plus he says insurance wont want to cover pet scan???? Well i informed him would matter to me... so just wondering which is more accurat pet scan or bone scan?? ty and hugz Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 26, 2011 07:19PM tammie wrote: Ty ladies i think i may just see if i can pay for pet scan myseolf then..The radiologist originally brought up pet scan to c what was in liver n detect (metaphysical) behavior in bones? as they have just diagnosed there really isnt a baseline of any scans other than scans from 02 which show nothing  so i would like to be followed by the most accurate..Not to mention im still finding it hard to swallow that there are soo many mets to my bones, and was curious if pet shows how active they are?? Thans ladies think im gonna yell and get one as im in this whole wantin to know all phase..Figuring knowledge is power at this point and i want to get ontop of somthing thats clearly run pampant through my body so will see..Big hugz and thanks for listening to my rambling..Tammie",
      "MessageIndex": 6,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 26, 2011 08:57PM tammie wrote: I'm definately not down for liver biopsy either lol..I do however want a closer look at what goin on...All said imma fight for a pet scan so i can see comparitively what activity it shows!!! I just feel like in 2002 when i had my 1st diagnosis i did just what they told me and went along like a mule..Post tx i had many issues with pain and my left leg...I swore it was bone aches the onc insisted nuerological pain and sent me to nuerologist well despite my gutt tellin me there was somthin wrong i convinced myself it was the nueropathy that the nuero dr said i had...I plugged on livin in pain working full time and raising my family for 8yrs. before discovering i now have mets from my skull to my darn toes..So ive decided i want all the answers now and im gettin 2nd opinion this time...Want every bit of info i can as im not expiring in one yr like this drs. telling me my youngest is only 15 n im faar from ready darn it!!Ty ladies for all your support most of my the ladies i use to talk to on these boards back in 2002 either have lost this battle or dont frequent the boards anymore much like myself till a few weeks back..Its so wonderful to know however that i always have a place to come we have the best sisterhood her HUGZZZ To u ladies n ty for bein here id be lost without u all..Tammie",
      "MessageIndex": 12,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 1, 2011 05:00PM tammie wrote: Glad you found somthing thats helping i too am considering asking about anti depressants and somthin for those wonderful nights when i cant sleep..Sweet dreams my friend...tammie",
      "MessageIndex": 3,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777379",
      "Title": "Thanks for the advice - I can now sleep! banjobanjo cmhartley"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 3, 2012 01:22AM tammie wrote: Sending hugs to all her friends and family...Breaks my heart to see another beautiful person taken by this disease...",
      "MessageIndex": 10,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785151",
      "Title": "Heaven has a New Angel Cafelovr camillegal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 16, 2012 08:08PM tammie wrote: YES!! For me i've discovered it definately does.. I too am in upstate NY and for some reason this past week or so its been flaring up..I noticed the other night while out on the pation late in the evening as we had friends over i was getting very sore.. Seems I recall this from last winter but for some reason seems worse as of later perhaps our bones know the cold is only gonna worsen ;)  Hope it lets up soon if not gonna be loong winter.. Big hugs to you",
      "MessageIndex": 1,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793614",
      "Title": "Does Colder Weather Make Bone Mets Ache? blainejennifer SonnyB"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 18, 2011 01:08AM tammie wrote: Big big cyber hugs to you..I;m hoping you get some relief soon...This sh.. can be so relentless on us at times...Im hoping the sun shines your way and soon..Much love to you..Tammy",
      "MessageIndex": 12,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778272",
      "Title": "So F+%ING SICK OF BEING SICK Chickadee pq2"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 20, 2012 11:05PM tammie wrote: Sending big hugs Laurie.. so sorry your stuck in hospital again it gets soo darn boring and lonely.. I soo can relate to being far from home though as im still stayin 156miles from home with my son in the hospital.. I keep hoping he will improve soon as i cant stand bein so far away anymore..Fingers crossed you get feeling better and home to do your remodeling soon.. Much love to you..Tammy",
      "MessageIndex": 5,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792271",
      "Title": "Stupid bloody neuts... alesta29 Brendatrue"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 19, 2012 12:19PM tammie wrote:",
      "MessageIndex": 8,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789299",
      "Title": "Can't take the last infusion. How bad of a thing is this? soleil505 holdontohope"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 3, 2011 05:06AM tammie wrote: Wow! I love it very well said..",
      "MessageIndex": 3,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775849",
      "Title": "My mom wrote this for bca month Amyf Amyf"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 27, 2012 01:59PM tammie wrote: I think thats a wonderful idea soon into my DX my DIL whos been right there with me and my biggest support tried to get on here and she discovered the same problem with that thread.. I do recall after her 2nd attempt she came to me and said \"Ma, I dont think that boards gonna be of any help to me it just made me realize how horrific we have it and i went to bed last night wishing i could have these other peoples problems as they seem easier\"... I reminded her that we only have it as bad as we choose to make it etc. to pick her back up and promised if i found a better board or support line for caregivers i would let her know.. Fingers crossed something comes of it as that would be awesome.. Big hugs to you all",
      "MessageIndex": 9,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792587",
      "Title": "Stage 4 caretakers bhd1 Moderators"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 28, 2013 09:28AM tammie wrote: Thank you all so much for your posts and replies.. I'm feeling confidant on the gamma knife fixing the brain met as its very small.. I start Xeloda one week from tomorrow I heard in the past Xeloda was awesome for liver mets but then ive also heard its one of the more gentle chemos and im hoping its powerful enough on the cancer to knock this all back.. I've found some resolution within myself last night to be able to gear up and fight despite all thats crumbling around me.. Its so damn hard to tell your family and friends when the bottom has fallen out yet again the looks in their eyes just cut like a knife.. I'm lucky to have so many that love and care for me but at the same time it kills me to see them going through this,i know they'r here to support me but at the same time seeing the hurt and fer in them also weakens some of my resolve.. Who knows im sure ive lost my mind here and am hoping for strength and miracles to be able to jump this damn hurdle that feels like a mountain right now.. Big hugs and much love to all of you thank you so much for being here when i need you.. <3",
      "MessageIndex": 13,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 10, 2011 06:45PM tammie wrote: Dar your right in the fact that your making progress it seems from dx to treatment yoou fly through so fast that your already onto somthing else just as you begin to absorb what youve been through..Its only normal..Idk what chemo regimen im gonna be on yet still waiting..I hope your port placement goes well, i recall being very sore after first one for almost a week.. but after that i loved having it...Be sure to keep me posted..I also got my genetic testing next week..Keeping my fingers and toes crossed our little December group fares this well :)",
      "MessageIndex": 4,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 15, 2011 05:50PM tammie wrote: Well ladies sorry i been off this section of the boards for a few days!! So i get port placement and bone biopsy this coming Fri. my onc is starting chemo on Tues. I'm going to be doing A/C i guess but if biopsy comes back her2+ then back to taxol and herceptin..I did taxol in 2002 and the nueropathy was an issue not to mention i was allergic to it and had to do cortisone on top of the steriods to offset issues so my onc is hoping to save that for future tx...Try to be positive Dj its soo scary going through all this and with every scan or test comes so much anxiety that it a miracle we keep our sanity lol...Much love to you all i will keep you posted on port placement, hopin it goes better than first one as 1st port placement was quite uncomfortable..Hugs..Tammie",
      "MessageIndex": 15,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 24, 2011 06:56PM tammie wrote: Dar glad port went well i got my fingers crossed for good news on that ovary..So sorry to hear about your DH i swear it does all fly at once..My SE's today seem to still be nausea a bit worse than yesterday but dinner went great and the whole family seems happy!! Big hugs to you to Gator tell these hubbie no falling apart right now...Thanks Rach so far doable been keeping my chin up holidays been a great disraction..Much love to you all.",
      "MessageIndex": 70,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 28, 2011 06:34PM tammie wrote: Also i appologize for spelling my comp. will not type right cursor dances everywheres..Glad at least somthings dancing round here i spose..very frustrating!!! <3",
      "MessageIndex": 99,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 20, 2012 11:37PM tammie wrote: I much like the other women here dont believe your ase is all that rare.. I do however know from very sad experience that for some reason Stage IV people are looked at and treated differently as I soon found out after my mets Dx almost a yr. ago... I cant say how much it saddens me to know the society as a whole seems to want to push us in a closet when they hear stage IV yet when I was early stage ten yrs. ago they seemed to want to lament about how young I was for this and shower me with pink ribbons etc., however now when i say i'm stage IV these very same organizations i thought were so awesome and supportive yrs. ago look at me as if i've got horns sticking out of my head.. But as you can see your not alone here and all we can do is HOPE much like we do for a cure that one day they will acknowledge us Metsters and give us the support and care we deserve.. Big huggs to you and soo sorry you've had to endure this I too was never aware till I became stage IV a yr ago and it really saddened and hurt me...Tammy",
      "MessageIndex": 36,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792240",
      "Title": "I thought this was supposed to be rare 4myangels carpe_diem"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 16, 2011 10:45PM tammie wrote: WOW!! I wanna see this movie...One day at a time has been becoming my motto...Thanks for sharing that..Bighugs and much love t you...Tammie",
      "MessageIndex": 9,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778180",
      "Title": "Film got me thinking alesta29 tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 12, 2012 09:31PM tammie wrote: YAY Ma!! Do enjoy your time with your family... Glad theyr helping you get caught up on things...Hope you have a great time and make some wonderful memories :)",
      "MessageIndex": 12,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790452",
      "Title": "Company is coming! ma111 reesie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 21, 2011 08:34AM tammie wrote: HUGS..I'm at a loss for words..All that comes to mind is i hate this disease..Ill be snding positive thoughts an healing vibes to you and your mom i hope things turn around for hr soon..Much love to you both",
      "MessageIndex": 13,
      "PostDate": "21/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779820",
      "Title": "I Am So Lost, Scared, and Pissed Cafelovr Hopbird"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 31, 2012 09:55AM tammie wrote:",
      "MessageIndex": 1,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781889",
      "Title": "Songs/ sayings/poems that motivate you? learnin DivineMrsM"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So as I posted my happy update the other day l went today for my PET results and to meet with my Onc. whos finally back after going through a terrible auto accident.. So i have gamma set up for Mon. for this new brain met and one area of the skull they believes putting pressure on my brain.. My onc. although horrified and angry i was told not only did i have brain met but liver no longer stable and spots to both lungs on top of severe bone uptake was happy they were wrong.. We discussed my starting Xeloda two days after my gamma knife next week.. He then appologized for not reading pet scan as was his 1st day back and we could read it together.. WELL it seems my liver is taking off again ive got spots with high activity in all 3 lobes of the right lung, my bones havnt just doubled in size but theres a ton of new ones.. My Onc. seemed quite shocked ive never seen him soo upset as was I.. I left there with my head spinning it seems after thinking all was well its back to mets everywheres again.. Have any of you ladies here dealt with mets to so many areas and had positive outcomes to reahing stable again? I'm soo lost and scared right now.. Bone,liver,brain and lungs!! How can i fight this back?? I'm determined to give it my all but im petrified <3 Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 10, 2011 10:13AM tammie wrote: Wow! is all i can say to that...You are going through so much i'll be sending positive healing vibes to you and your son..Hope things start to smooth out and both you and your son begin to improve..Big hugzz...Tammie",
      "MessageIndex": 7,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776210",
      "Title": "Out of remission, now my son has cancer mcbird edwh001"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: As many of you may remember my 16yr. old suffered a psychotic breakdown of some sort and was transferred to a facility 3hrs from our home..We have been here for a full month tomorrow.. The first med. they tried brought no success and this week by about mid week we should know if this new one will work.. I've been fortunate to have a place called Amanda's house here that works like ronald mcdonald house and is free for me to stay at which has been a life saver.. I cant say its been an easy month by any means.. I wake every morning and drive 40min. to visit him then 40min. back to an empty house that although nice isnt home and sit read, t.v., and basically climb the walls till soon after dinner i make the drive again to arrive and see my son who doesnt seem much like my son anymore most days he tells me i should go home my visits are preventing him from doin program and without doing program he says he cant get his dispatch papers and he wants to come home, these are actually the clear moments..Most of my visits consist of trying to make conversation with him while he mumbles to himself occasionally making weird noises in his demon/soul battle, he occasionally engages with me throughout the visit about whats going on at home or asks about his dog.. But unfortunately most of his lengthy conversations consist of him telling me to get my palleds out of him they my duds put there or some crazy story about the demon wanting his Mcdonalds etc... I feel like im in an endless hole thats just swallowing me up i go home for weekends and try to catch up some with the family and the visits are far too short to accomplish much and then i'm back in my daily routine of horror and heartache.. My son is in a wonderful facility, i must say as far as mental hospitals go i now know why theyr considered the best in the state and theyv made this hell as tolerable as it possibly can be for both him and myself.. However I just cant take nomore i dont even know what i feel inside other than empty heartache, it hurts to be here hurts more when im not here to see him and make sure hes o.k. everyday.. Not to mention im going broker than broke.. I'm drivin a little over 80 miles a day 2 visit alone then 156 miles home on fri. but have to give my truck to my EX so he can get here for weekends so Aron's not alone as ive no car then get a ride 156 miles back up to get my truck its over 1000 miles a week on average that ive been putting on this poor lil SUV... Sorry i'm here wining again I'm trying to stay positive and just keep pluggin on knowing theres gotta be an end to this loong dark tunnel i been lost in for weeks, but it gets so lonely here and i cant help but wonder at times is my lil guy ever going to come back to me.. Seems a year ago when I was given a year to live my biggest fear was not seeing him graduate high school,now today i'd give anything to just see him come back to reality again!! Thank you all for listening and sorry again I know this is not on topic at all but i needed to vent someplace i feel understood... Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792620",
      "Title": "Still praying for a miracle OT tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So I been in the hospital since Thurs am due to extreme rib and back pain... Well the Ct scan results came in showing a growth in my right lung measuring 5cm...In March the lungs were clear n showing nothing at all.. The weird thing is my liver and bone mets are all appearing to be stable... Even more ironic yet is that all of my mets have always been teeny tiny and everywhere, for example the largest of my inumerable mets in bone or liver measures 1.2 cm n thats the one in the liver too close to the heart for biopsy.. I was sick for 2 weeks with laryngitis and horrible cough in fact just last week i was at ER with fever but they discharged me without so much as bloodwork or anything saying laryngitis and a cold.. Soo with that said im prayin that this growth in my lung is actually infection, onc. seems to feel thats also possible doesnt want to discharge me as he says can get biopsy quicker if im inpatient as ill have priority.. Honestly ladies i'm scared to death and although tryin very hard to be positive feeling that lung mets on top of bone n liver is gonna way decrease my life.. Not to mention 5 freaking cm's thats huge n grew very fast as 10 weeks ago lungs were crystal clear..Any pointers or similiar stories please chime in.. I dont know how to handle all this im scared to death, things been going so well n i been gaining strength... Dont know what to do from here or where to turn :'( Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So I been in the hospital since Thurs am due to extreme rib and back pain... Well the Ct scan results came in showing a growth in my right lung measuring 5cm...In March the lungs were clear n showing nothing at all.. The weird thing is my liver and bone mets are all appearing to be stable... Even more ironic yet is that all of my mets have always been teeny tiny and everywhere, for example the largest of my inumerable mets in bone or liver measures 1.2 cm n thats the one in the liver too close to the heart for biopsy.. I was sick for 2 weeks with laryngitis and horrible cough in fact just last week i was at ER with fever but they discharged me without so much as bloodwork or anything saying laryngitis and a cold.. Soo with that said im prayin that this growth in my lung is actually infection, onc. seems to feel thats also possible doesnt want to discharge me as he says can get biopsy quicker if im inpatient as ill have priority.. Honestly ladies i'm scared to death and although tryin very hard to be positive feeling that lung mets on top of bone n liver is gonna way decrease my life.. Not to mention 5 freaking cm's thats huge n grew very fast as 10 weeks ago lungs were crystal clear..Any pointers or similiar stories please chime in.. I dont know how to handle all this im scared to death, things been going so well n i been gaining strength... Dont know what to do from here or where to turn :'( Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 16, 2012 11:21AM tammie wrote: I want to thank you for your support... The week has drug on back on the rollercoaster were one minute im confidant n resolved this lung things just a scare, then the next im fearing what if?? I'm resolved to the fact that one day this craps gonna take me and im not afraid of death honestly, but i just feel robbed of the things i wanted to do with my children n grandchildren.. Didnt think a yr ago that at 42 id be sitting here retired on SSD and tryin to build as many memories as possible with my children n grandchildren...A year ago i thought i was waitin for my youngest to graduate in 2 yrs. and go off to college so i could begin to enjoy life some as i had my children young, which i now veiw as a blessing as opposed to a poor choice as i never would want to give up the yrs ive had with them... Enough winin imma wait for biopsy tues. and keepin fingers crossed it comes out for the best :) Cathy sendin you big hugs and hoping you have as much comfort as you can possibly have, to make as many pain free memories as possible with those 4 grand babies of yours... I'm still in fight mode but i can fully relate to the idea that at some point we all lose this fight n treatments become more damage than good for us, deep down ive resolved myself to the fact that day will come..I been on honeymoon for months since my chemo over the winter and 2 weeks in California hiking with my sister in Apr. had me feeling and believing i could take on the world, well now im 2nd guessin myself as it begins to crash down... I hope you enjoy a pain free happy weekend and remember im here too if you ever need a friend to talk to..Big hugs to all...Tammie",
      "MessageIndex": 35,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 22, 2012 05:09AM tammie wrote: Thank you all so much for your replies... Both my onc. and the Onc. at Roswell recommend Aromatase (sp) I think it was but needless to say have script.. Roswell feels the only request I should be discussing with my Onc. is marker tests since PET scans are hard to come by on my insurance... My son is still in the hospital and has developed a new world yet again however he seems more aware in this new world so im not sure if thats a sign of clearing or not yet.. I will be back up there with him in a few hours and am spending extra time there this week, missed him these past 2 weeks not been there much with all these appointments.. I meet with rad. Onc. this coming fri. and am hoping we can make an arrangement to get rads done my hips and femurs would be very happy im sure..  Thank you all more than an words can express for always being here and reminding me im not alone.. big hugs to all..Tammy",
      "MessageIndex": 18,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793776",
      "Title": "Scan results ? tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 5, 2012 10:21AM tammie wrote: Big gentle ((hugs)) to you... Where are you having pain? Is it consistantly in one place or in several?? I get sporatic bone pain it seems all over at different times but my mets are all over...",
      "MessageIndex": 4,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793040",
      "Title": "Just whining Lynn1 susan_02143"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 16, 2014 05:32PM tammie wrote: Judie I don't think it gets any easier to be bald. What chemo are you currently doing? I love the Xeloda as I've kept my hair even though I keep it short as I know the dreadful day will come when I too will be bald again.. I sent you a pm n promise to check in more often.. Big hugs to you my friend and hope to hear from you soon ;)",
      "MessageIndex": 15,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817949",
      "Title": "Getting ready to welcome a new wig!! justjudie Annie62"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 26, 2012 06:15PM tammie wrote: :'( Dang its been a rough few days here... Hoping it lets up soon... My condolences to her friends and family...",
      "MessageIndex": 1,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789718",
      "Title": "Another angel. Dell neogirl seaperch"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 13, 2011 12:14PM tammie wrote: How do i find the faces of mbc today?? I can spend the day veiwing :)",
      "MessageIndex": 14,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775737",
      "Title": "MBC Awareness Day Tweets & FB Updates You Can Use EnglishMajor Marie50"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 17, 2011 01:17AM tammie wrote:",
      "MessageIndex": 21,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 27, 2012 02:38AM tammie wrote: Thank you soo much for being here, i think im just losin it cause i hope every sun. after 2 days of missing him it'll b better but its the same... LOL my visits r not hinderin his progress he's come to realize if hes attendin programs thats part of coming home.. Theres no program during visiting hours.. The Drs and councelor encourage me to visit as often as i possibly can as he talks more to me and it enables them to get more feedback the councelor started this last week where we visit n she records it to hear what hes thinkin/saying cause he doesnt communicate much with them.. As for cause its a toss up between severe psychotic break brought on by stress n depression or early onset schizophrenia..",
      "MessageIndex": 4,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792620",
      "Title": "Still praying for a miracle OT tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 23, 2011 05:53PM tammie wrote: Well ladies first A/C down yesterday!! So far the nasea has been the only real problem ive had..I've just been keepin up on the meds and its actually been very tolerable..I'm also pretty tired today but hopin to rest up for tomorrow..Hope you all have a wonderful Holiday!!",
      "MessageIndex": 63,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 26, 2011 07:57AM tammie wrote: So glad your port went well..As for talking to the family its soo hard and seems no matter whatapproach we take they still are devestated and feel totally helpless..All i can offer is big hugs and hope it all goes well..Idk whos goin on /ac here but i can say the nausea is wearing on me somthing awful..I hoped today would be a bit better but instead i seem to be vomiting now and am almost out of the stomach meds which help ease it so keepin fingers crossed it gets better today..I realised last night that iveonly got a few weeks of hair left:( ive tried to be chin up  about it as ive done it beforebut hav to confess for some reason today its got me down and scared, as much like one of you stated once  its gone theres no hiding the fact im sick :( Sorry to be a winer today hoping my mood brightens as the day wears on big hugs and love to ll of you..Tammie",
      "MessageIndex": 77,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 1, 2011 09:53PM tammie wrote: Gina what your describing sounds like taxol hell the aches and burning rashes were hell they use to come on a couple days after tx..Definately do not cover it u wanna dry it up..watch for other rashy type burns too try to keep them clean n dry also benadryl will actually help ease side effects some i use to take it at night to help shut things down enough to sleep..Sending you big hugs..Tammie Mar we should get frequent flyer discounts with all these drs i feel like i live in the drs office as well..Glad you decided on a surgery plan your comfortable with Markat i did the same thing with tape after my surgeries it makes for hell hope it clears up n glad your ports feeling better today and rach hope yours is on the mend too..Big hugs n love to all of you..Tammie",
      "MessageIndex": 143,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 4, 2011 05:41PM tammie wrote: Mar tell them hell noo!! Well unless they r doin all cookin and cleaning!! I think our families seem to forget sometimes that we r sick i swear..I hope the fatigue gives you a break soon i was beat tired all last week feel energy pickin up this week finally Yes Keloggs this is a busy thread to keep up on with chemo brain kickin in i often lose track despite readin all posts <3 you all",
      "MessageIndex": 198,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 1, 2012 09:51PM tammie wrote: I was always told upon the cancer invading the organs that it was time to do some chemo... Upon them realizing my liver was involved is when they put me through chemo then back onto hormonals and my zometa which they started sine diagnosis to strengthen the bones... Right now my bones have started taking off again but since livers stable we are waiting on chemo to see if this one works... I hope they get you stable soon and always remember a 2nd opinion is never a bad thing my Onc. encourages them.. Big hugs and thinkin of you",
      "MessageIndex": 6,
      "PostDate": "01/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794306",
      "Title": "Overwhelmed lulu89 Just_Sue"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 4, 2012 09:47AM tammie wrote: Soo sorry you got this news, I have inumerable mets to the bones starting with 3 in my skull and goin completely to my toes, i was also dx'ed with many mets to the liver...I was dx'ed only 5 months ago and am currently in chemo due to the liver involvement... The best advice i got soon into my dx from one of the sisters here was to live each day as if they never told me i was terminal and to look at it all as a change in life style but not the end, of course it took some time for me to wrap my head around that way of thinking as i was busy making funeral arrangements etc... However today im living a pretty normal life despite many drs visits lol.. The beginning of this road is filled with so many emotions its worse than the big dip in a roller coaster, but it does get more managable in time..Wish i could offer more than a big hug... But do know your not alone here and you will find endless amounts of support and info from the ladies here, if you ever need an ear to vent to im here... Sending big hugs and happy healing thoughts your way..Tammie",
      "MessageIndex": 6,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782112",
      "Title": "Bone mets ladyleen4 ladyleen4"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 27, 2011 04:18PM tammie wrote: Yea it would be a great idea Nancy to do an ask the experts, it get confusing  to know what the best tests are for different things...If pet scans show only  how active the cancers are it would seem beneficial to us to hav done occasionally so we know whats goin on with those little gremlins feeding on us...I'm gonna fight for one regardless cause my radiologist still thinks it would b a good idea..ty n hugzzz..Tammie p.s. Nancy couldnt help but notice your join date for this site..You must have known Sunshine, Pepper and some of the other ladies from that era on this site..I miss them i kept in touch with Pepper for years but lost touch a few years back..Hugs",
      "MessageIndex": 18,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 27, 2011 09:15PM tammie wrote: I've had ct scan to spine and ct of abdomen,mri,and complete bone scan, ive never had a pet scan ever...And can they biopsy the bone as thats the only place it appears to be, i didnt know er/pr and her2 status could change..Ive had no ovaries since 2mo. post rads in 2003 and if er/pr has changed tamoxifen is of no use..Hmmm this gives me even more ?'s for the docs and my current one doesnt seem to wanna answer many...He also says if lesion in lver is mets dont change tx which confuses me..I'm only 41 and i dont recall saying i wasnt gonna fight this war but he seems to be not so much of a fighter so will see considering requesting a new dr. from the practice n tryin to get record together to go to roswell for 2nd opinion..TY Mj an big hugzz to you",
      "MessageIndex": 20,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So the results are back.. Lots of uptake in the bones to many areas, recommending radiation to the hips/femurs of both legs.. Good news is liver still appears to be holding stable.. Onc. is recommending a new anti hormonal forgot name even, I have the script but i'm going to Roswell in Buffalo tomorrow so im waiting to get their take on things before I start the new medication or make any further moves... noo clue how i'm doing radiation when im in one place mon-thurs and home fri-sun.? Guess time will tell..Thank all for being here im sure ill be back and losing it by sat.. big hugs and hope every1's doing well Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793776",
      "Title": "Scan results ? tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: It's been some time since I've checked in I just typed a long post but seems my phone froze up an lost it! I hope many of you are doing well and im unsure if any in here will even remember me! So a little upset on me after several years back with new progression to brain an lungs with extreme progression to liver an bones I was lucky enough to have gamma which worked an 15 months of xeloda which actually left lungs and liver clear.. Last year my lover mets came back with a vengeance and in March that stubborn brain met as well, so far gamma has seemed to keep it at bay.. Gemzar gave me 9 amazing months in which I felt great an now do to bone progression I'm on taxotere which has been hell n wiping me out. Got the hand foot thing eyes don't ever stop watering an just blah in general rumor marker is lower than ever which is good sign but my body is getting tired of the poison after three years with no break . Overall I'm truly happy and felling blessed to be here with my family and try to keep busy.. How are all of you soo get? I often wonder how everybody in here is doing? Big hugs an much love to all of you Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839919",
      "Title": "Checking in tammie Boo123"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 25, 2012 11:22AM tammie wrote: Monica i hope your treatments go well... I do so remember how lost i was in the beginning of all this and trying to find a routine seemed impossible my mind was flitting everywhere.. Prior to the whole stage IV crap i lived a very normal structured life... My anxiety was through the roof for the first few months post dx and beginning treatment... My youngest is 15 and upon dx i inherited my oldest and two of the granbabies with a third on the way, to put it simple it was just plain crazy here...I'm now 6 months into this whole process have completed some rads to spine and 4 runs of A/C as this crap has moved into the liver,ONC is now moving me onto xeloda (oral chemo).. I have to say my home routine has changed a total 360 from what it was, however we have all adjusted and i can say we are closer than ever... As for anxiety there are days that mine goes through the roof and others where i seem to forget i even have cancer (those r the best days and i take advantage of them)... If you find however that your unable to get the anxiety under control or feel depression creeping in and not leaving theres no shame in trying anti-depressants or seeking some counceling... I'm here if you ever need a friend to chat with or an ear to vent to this is a tough path in life but it does seem less bumpy once you begin to travel it..I've come to see it as a new way of life and refuse to let it knock me down...Big hugs to you and your family...Tammie",
      "MessageIndex": 11,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/784625",
      "Title": "Getting a routine together MonicaAnne123 nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: As many of you may remember my 16yr. old suffered a psychotic breakdown of some sort and was transferred to a facility 3hrs from our home..We have been here for a full month tomorrow.. The first med. they tried brought no success and this week by about mid week we should know if this new one will work.. I've been fortunate to have a place called Amanda's house here that works like ronald mcdonald house and is free for me to stay at which has been a life saver.. I cant say its been an easy month by any means.. I wake every morning and drive 40min. to visit him then 40min. back to an empty house that although nice isnt home and sit read, t.v., and basically climb the walls till soon after dinner i make the drive again to arrive and see my son who doesnt seem much like my son anymore most days he tells me i should go home my visits are preventing him from doin program and without doing program he says he cant get his dispatch papers and he wants to come home, these are actually the clear moments..Most of my visits consist of trying to make conversation with him while he mumbles to himself occasionally making weird noises in his demon/soul battle, he occasionally engages with me throughout the visit about whats going on at home or asks about his dog.. But unfortunately most of his lengthy conversations consist of him telling me to get my palleds out of him they my duds put there or some crazy story about the demon wanting his Mcdonalds etc... I feel like im in an endless hole thats just swallowing me up i go home for weekends and try to catch up some with the family and the visits are far too short to accomplish much and then i'm back in my daily routine of horror and heartache.. My son is in a wonderful facility, i must say as far as mental hospitals go i now know why theyr considered the best in the state and theyv made this hell as tolerable as it possibly can be for both him and myself.. However I just cant take nomore i dont even know what i feel inside other than empty heartache, it hurts to be here hurts more when im not here to see him and make sure hes o.k. everyday.. Not to mention im going broker than broke.. I'm drivin a little over 80 miles a day 2 visit alone then 156 miles home on fri. but have to give my truck to my EX so he can get here for weekends so Aron's not alone as ive no car then get a ride 156 miles back up to get my truck its over 1000 miles a week on average that ive been putting on this poor lil SUV... Sorry i'm here wining again I'm trying to stay positive and just keep pluggin on knowing theres gotta be an end to this loong dark tunnel i been lost in for weeks, but it gets so lonely here and i cant help but wonder at times is my lil guy ever going to come back to me.. Seems a year ago when I was given a year to live my biggest fear was not seeing him graduate high school,now today i'd give anything to just see him come back to reality again!! Thank you all for listening and sorry again I know this is not on topic at all but i needed to vent someplace i feel understood... Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792620",
      "Title": "Still praying for a miracle OT tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Apr 1, 2013 08:38AM tammie wrote: <3 Thank you Judie",
      "MessageIndex": 2,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802590",
      "Title": "Checking in and wishing all a VERY Happy Easter ;) tammie stagefree"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 29, 2011 03:16PM tammie wrote: Hugs!! You definately not an idiot..I just did the same thing with my pain meds yesterday!! We need a pill elf i swear..hugs tammie",
      "MessageIndex": 7,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778772",
      "Title": "FEELING LIKE AN IDIOT!! dchase ibcmets"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 7, 2012 03:12PM tammie wrote: Sound very futuristic.. But if possible sounds awesome.. thanks for sharing :)",
      "MessageIndex": 1,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793147",
      "Title": "Electronic Fields soleil505 soleil505"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 24, 2011 11:32PM tammie wrote: Soo sorry Redwolf big hugs to you!! I too just got hit with the liver mets a few weeks back..Just did first round of A/C on tues..Im hoping your treatments will knock those crappy things right out of there..Much love to you..Tammy",
      "MessageIndex": 10,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778577",
      "Title": "Liver mets confirmed redwolf8812 redwolf8812"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 30, 2012 10:08PM tammie wrote: YESSS January has definately sucked on the boards, You said that right!!! Big hugs to all,hoping it gets brighter soon <3 you all...Tammie",
      "MessageIndex": 9,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781869",
      "Title": "Well January Sucked Fitztwins 3littlegirls"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 18, 2012 11:39AM tammie wrote: My 1st chemo was over the winter and prior i had horrible lower back and hip pain, miraculously that pain disappeared a few treatments in and i had little or no pain for months... I cant really answer your question but i myself assumed the chemo was killin some of the little buggers back therefore less pain... I hope your tx is working for you and less pain is a beautiful thing i rejoice for everyday that i have little pain and can get up n live as much as possible.. I know wasnt much help probly, i consider myself pretty new also 8mo into stage IV and also when feeling good frequently like to visit denial isle so dont keep up on things as i probly should... Big hugs to you..Tammie",
      "MessageIndex": 1,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789277",
      "Title": "Body feels better stellaratovsky stellaratovsky"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 12, 2012 01:10PM tammie wrote: Sending hugs, wish there was more i could do other than to just be here to listen... Your son sounds wonderful!! I too have grown tired with the friends that have faded away in the past 10mo. and in my case ive got a house full of well intentioned grown kids that claim to wanna help but never seem to on the ball when the time comes..Honestly im petrified of when the time comes and i actually need alot of help as i fear im gonna be screwed.. To make matters worse my youngest that just turned 16 in Apr. has been in California with my sister since April as he was losing it,I miss him so much and worry all the time..Well i found out the weird things he was doing such as talking to himself and making weird hand gestures has continued but theyv been hiding it from me as they didnt wanna stress me out!! They told my oldest son about it all and i had to overhear him telling his wife the other day.. Apparently the only reason they mentioned it was because theyr all coming for a visit this next week and are worried i may flip out when i see how Aron's not progressing!! I have every intention of keeping my baby home when he gets here and taking him for the help he needs the dr out there has him on an antidepressant now, but im soo scared he's exhibiting signs of schizophrenia or something idk... the one thing i do know is before this damn stage IV crap i had a fairly good quiet home life with just me and my youngest son livin home and he was quite happy and we were very close..  I've never let my kids be far from me for extended periods and soo regretting it now.. hope i can handle it all but am determined to take it on and get him back together... Sorry for rambling your post just really hit home for me today...Big hugs..Tammie ",
      "MessageIndex": 3,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790458",
      "Title": "Family rant seamstress seamstress"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 25, 2012 10:04AM tammie wrote: Well its hard to give u that push back as i think we all been there, and i soo know the feeling when the hugs just make you crumble... I joked with my ffamily through my whole chemo about how insane i must b to willingly pour poison into my body and make myself sick... Its funny to me how we can look n feel so good and be soo sick, i too was the healthiest id been both physically and mentally when they were telling me i had inumerable mets to bones n liver, and the irony of it is even through chemo when i ran into ppl i hadnt seen in a while they carry on about how good and healthy i look! Sad part was in honest assessment they were totally being honest! I've come to call it my cancer glow!! You will find that glass half full attitude again im sure of it but YOU are also allowed to be angry and beat down, this sh** can make us feel so hopeless at times especially when we r feeling good and get told things r not as they seem... Soo nooo hugs as i dont want u crying not quite in me to kick u for feeling as i often have, but i can offer a hand to help u up and if that dont work i'm willing to come back and give you a kick in the pants... Positive healing vibes and noo hugs to you...Tammie",
      "MessageIndex": 3,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789640",
      "Title": "How is this happening?!?.... Lynn1 cmhartley"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 1, 2013 10:27PM tammie wrote: Shel Ty knowing your there doing the gamma dance will put a smile on my face Monday morning ;) HLB Thanks so much for sharing thats story it gives me hope i can actually dance with stable again for a while.. I've been soo out of sorts these past few days i keep realing between i got this and gearing up to beat it down, to scared as HELL because its suddenly everywhere and im not getting it!! I will keep you all posted.. Big hugs and Thank you all soo much for being YOU ;)",
      "MessageIndex": 29,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801144",
      "Title": "SH*** gone from bad to worse in a day.. PISSED N SCARED! tammie justjudie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 26, 2011 09:34PM tammie wrote: Thanks and im startin this fight and not backin down!!",
      "MessageIndex": 14,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775555",
      "Title": "Pet scan vs. Bone scans???? tammie IllinoisNancy"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 27, 2012 02:06AM tammie wrote: I'm on Arimadex and have to say i've no trouble with zits.. But my skins always dry and holy hairy lady!! My arms, my face, everywhere... I was so disgusted i used my BF's beard trimmer on my arms two weeks ago to get it down some as it was long and believe it or not my arm hairs fully back already..I'm even having to shave my legs everyday now its crazy!! I been jokin with the family at this rate they can put me in the local side show as sasquach (sp?) and make serious mony if this keeps up as its horrible... Sorry your dealing with this too,no offense but at least i know im not alone on this anymore.. I keep telling myself its worth it as its working, but damn im gonna be wolf lady before long if it dont slow down..Big hugs to you",
      "MessageIndex": 5,
      "PostDate": "27/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791149",
      "Title": "Question about AI's Mzmerz tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 29, 2011 04:27PM tammie wrote: SOOOO very sorry you had to join our club but welcome sister...Yea in the beginning i felt like Alice and was sure i had fallen down the rabbit hole!! I went along dr. to dr. jumping through hoops..I was well into treatment before i began to even learn what i was dealing with..Do try to learn all you can about your disease and dont settle for anythig you feel uncomfortable with a 2nd opinion has never hurt any of us..I'll be thinking of you and sending lots of positive thoughts and healing energy your way...Much love..Tammi",
      "MessageIndex": 1,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/775711",
      "Title": "Diagnosed yesterday HSMOM2011 elimar"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 3, 2011 10:53PM tammie wrote:",
      "MessageIndex": 32,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777495",
      "Title": "NED is still loving me!!! :-) JeninMichigan sarah1968uk"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 6, 2012 04:47AM tammie wrote: I was in a place like that for a while a few months back.. The only advice I can offer is enjoy every second of the healthy bliss you can..As for the stability on future plans I find myself tripping over them as well.. I now make the plans and put a tentative plan in place so the important stuff gets done as for the rest of it i do as much of it as i can... Sorry couldnt be of more help other than to let you know your one of us and if not you definately think like one of us :) You can always do what i find myself doing and take a trip to denial isle I love it there its become my new favorite vacation destination... Its always sunny and the veiw is beautiful... big hugs to you ;)",
      "MessageIndex": 1,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793076",
      "Title": "totally surreal TKSit TKSit"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 5, 2011 10:45PM tammie wrote:",
      "MessageIndex": 7,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777465",
      "Title": "why is it that i feel down when i am making everyone feel up LilSchatzie joaniji"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well ive had increased back pain all last week while fightin a flu so thought was just body aches... However since feeling better my pain is gettin progressively worse.. I had called onc a week ago n left message because i realized he never scheduled my Zometa infusion for the month of may which was due mid may... The last go round was 6 weeks as they were havin tough time fitting me in with my other appts.. Well last night my pain went through the roof and has yet to let up..Took all day for onc's office to call me back they have me coming in at 8am tomorrow morning... I know it seems unlikely that my pain level is so severe due to lack of Zometa but honestly im afraid of my other options... I'm wondering if perhaps anyone has ever experienced this when going long periods between Zometa infusions? I do have many mets to the bones in fact hard to find a bone unaffected.. Hoping its lack of Zometa as ive been having a very good run and up untill i became ill last week been feeling awesome and gaining strength.. Thank you all for your help nd support..bih hugs to you all..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788696",
      "Title": "In serious pain/ Zometa question tammie ibcmets"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 13, 2012 09:28PM tammie wrote: I have filled out paperwork to donate my body to science upon my death through my Onco. office.. Hoping I can as if studying my body/cancer can help anyone in the future in any way I would be thrilled..",
      "MessageIndex": 7,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791936",
      "Title": "Organ donation bhd1 jcb51"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 27, 2012 04:08PM tammie wrote: You are all the best!! I will look into NAMI as soon as im able to be home on a more regular basis.. Luann ill be sendin a private message perhaps it got lost in the flow of things.. TY all soo much for being here..",
      "MessageIndex": 20,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792620",
      "Title": "Still praying for a miracle OT tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Aug 29, 2012 09:23AM tammie wrote:",
      "MessageIndex": 25,
      "PostDate": "29/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792620",
      "Title": "Still praying for a miracle OT tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well as some of you may remember i was fightin for a biopsy since Sept. when i was dx'ed with mets after 9yrs of thinkin id beat this crap...Well the biopsy was done on nov.17th of the bone cause mets in liver too close to heart and dr wasnt comfortable with that..So when i went in to get my nuelasta shot on Thurs. i asked after biopsy..Well my dr. came in and informed me the biopsy wasnt showing my cancer..That i definately have cancer but they must not have got it from a met on the bone!! I havnt posted on this as i been trying to put it out of my mind..BUT truthfully im so frustrated as im already in chemo and definately not in condition for a biopsy!! I been waitin so long to know the pathology of this crap thats runnin rampant through my bones and liver and seems ive still no clue when i will obtain this knowledge..Thank you ladies for listening to my gripe im hoping to just push these thoughts back out of my head till a later date when i can obtain a biopsy, just sick of being in the dark..Love and hugs to you all..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779062",
      "Title": "USELESS BIOPSY tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 14, 2011 07:43PM tammie wrote: Thank you all for your responses it does help in the fact that at least i know now its not just me that this guys messing my treatment up..which believe it or not is awesome news to me as i decided if this was the typical course of tx that i was gonna be done for.. I'm also gonna check out that site you recommended English... Big hugs and much love to all of you..Tammie",
      "MessageIndex": 7,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778099",
      "Title": "Useless Dumb Dr. rant!! tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 26, 2011 07:05AM tammie wrote: OMFG!! So sorry you had to  endure that..I think sometimes people get soo consumed by the anxiety and what if fears they often dont seem to realize what they are doin or saying..Its also difficult to comfort somebody thats too busy lookin for the what ifs to stop n smell the roses..Big hugs is all i can offer to you and the lady whos seems so consumed for answers about a boogie man that nobody can give...I think the bastards been under my bed for 9yrs since first dx only to bite me on my almost 10 yr survival anniversary..We never know we just deal..Much love and sorry it upset you so..Tammie",
      "MessageIndex": 6,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778654",
      "Title": "People are un-freaking believe-able... Sido PizzaDad"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 21, 2011 08:46AM tammie wrote: Wow we do have quite the group going here..My port placement was awesomee..It was done by interventional radiology an im told they do them a bit different..My first port in 2002 was hell 5 days later i was still in pain, well when the surgeon looked at my scar as i was askin if they could do the same side..He said who did that mess ive never seen such a scar n told me that he couldnt do that side as with the mess there he couldnt trust that the vascular flow wasnt damaged..Naan im starting chemo on Tues also apparently AC..Well i got my hair cut super short in preparation and actually get alot of compliments it soo weird as its normally half way down my back..My shoppin lists as full as its gonna get the rest ill worry bout when the time comes..I'm hopeful Thanksgiving wont be ruined by chemo hang over as ive got my whole family together for the 1st time in yrs. and i wanna have a few glasses of wine and enjoy the day, this will also be the first yr. i dont have to do most of the cooking :) Well ladies here we go team CHEMO i say hope we all weather the se's well and kick some cancer A**!!! Much love and big hugs to you all..Tammie",
      "MessageIndex": 44,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 13, 2011 09:01AM tammie wrote: TY all and Frapp definately go to the program i got lots of good makeup..I was also amazed at how many awesome wigs they had there..I'm sure everyone is different though..Hugs to all..Tammie",
      "MessageIndex": 11,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779446",
      "Title": "Got awesome FREE wig..And dont like wigs i thought tammie Naniam"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 1, 2011 08:48AM tammie wrote: Good luck to all of you ladies that are starting today!! I hope all goes well...Im of for my nuelasta shot today hopin it works quick as im feelin like crap!! Big hugs and hope alls well..Tammie",
      "MessageIndex": 127,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 3, 2011 04:54PM tammie wrote: Mar my ONC nurse said to take claritin the day before, the day of then the day after..I had my nuelasta shot on Thurs..Have had awful headache and lots of pain the last couple days but bein told thats common after nuelasta if you have bone mets..I'm not sure if its from nuelasta or just the chemo that im gettin all these aches but being hopeful it lets up soon... I have to say after a week and a half since AC my tummy finally feels a bit better ive had no nausea or heartburn today FINALLY!! OO the fun we endure together ladies LOL...Much love and ty all for being here through this with me..Tammie",
      "MessageIndex": 177,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 1, 2013 10:35PM tammie wrote: I'm afraid to admit at the moment im very uncomfortable with my treatment and care ive recieved recently, but for me unfortunately things are extremely out of hand and i cant get another opinion and have to start treatment ASAP... However if you let us know where you live im sure many here will have suggestions on good places to obtain a 2nd opinion.. I too have liver mets and well honestly as of this past month i apparently have new mets everywhere but thats another story.. What are they recommending for your liver mets? There are several treatments for the liver.. I do hope whatever treatment that you choose gives you the best possible outcome and leaves you dancing with NED..",
      "MessageIndex": 3,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801253",
      "Title": "Who is really confident about their doctor and treatment. preciousgrama"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 15, 2011 01:02PM tammie wrote: Well my phone call was returned by the office manager today, she asked if i could come in to speak to her while i was at the hospital to have my echo done..She was quite taken back by all of my issues and appollogized,she said she was going to speak to the Dr. and asked if i would still see him on the 22nd and that after that appt. if im still uncomfortable she will assign me a new onc in the practice..Well she mustv spoke to him as he called to inform me about surgery fri. and also let me know that he would like to startchemo that very same day..He's starting with a/c and said if pathology comes back her2+ he will be switching to taxol and herceptin..He's trying to avoid taxol till further down the road cause of the reactions i had in the past..I cant say ive got much faith in him but at least its a start will see where we go from here...Thank you all for the support and encouragement to speak up..Much love..Tammy",
      "MessageIndex": 10,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778099",
      "Title": "Useless Dumb Dr. rant!! tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Soo theres barely any mass left to biopsy after the run of antibiotics!! Soo noo biopsy today which means with all tests run in hospital last week im OFFICIALLY STABLE on arimadex for the first time since Dx im stable!!!! Prolly a good thing they didnt run a psych evail. or stable would prolly not be the word that came from my Oncs. mouth lol.... I'm finding it a bit hard not to be bitter by the fact that when i was in the ER weeks ago they did nothing n barely looked at me as that would have avoided a hospital stay and more stress than me or my family should have to handle, decided ill deal with this another day and rejoice in the fact that lungs are clear... Much love to you all for being here for me and hoping all those waiting on tests and scan results will be able to do a cyber cheers with me this week!! :) Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789334",
      "Title": "AWESOME NEWS :) tammie barsco1963"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 8, 2012 07:34AM tammie wrote: Sending big hugs to you Apple!! I hope things begin to get better for you in the weeks to come, you have been the bright spot in many of my rough days as I began this stage IV journey.. In fact between you and Zoh i decided I could pull all this off.. In fact although you may not know it I think my big girl pants came hand tailored in a rough denim by you and Zoh alone... Sending positive thoughts and lots of gentle hugs your way... Hoping things get brighter for you and the heck with that housework...Tammie",
      "MessageIndex": 27,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790229",
      "Title": "bummer apple apple"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I havnt been on here much but want you all to know i think of you very often.. Im just ending my first cycle of Xeloda and have been feeling a bit better my pain seems to be reducing rapidly which has been a blessing.. Gamma knife went awesome and ive every reason to believe my brain is once again cancer free.. My only daughter will be getting married in two weeks, it has kept me quite busy when im up and about.. I'm very excited for this it will be beautiful and im feeling blessed to be here for it.. My son is slowly progressing on a new medicine and im hopeful to continue seeing progress he talks more to us than his voices these days.. I think of so many of you often and hope for those of you that celebrate Easter you had a wonderful holiday filled with love and laughter.. Big hugs to you all.. Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802590",
      "Title": "Checking in and wishing all a VERY Happy Easter ;) tammie stagefree"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 31, 2012 04:33PM tammie wrote: I first found the boards in Dec. 2002 right after starting chemo for my first dx at the age of 32...Was stage llb IDC..Did lumpectomy,12 weekly taxol,8weeks rads, and then oopherctomy..The boards gave me a wealth of support and i made several close relationships with a few of the girls here... I stopped coming as much after losing several of them long after my tx... Well in Sept 2011 severe back pain brought me to the ER and i was dx'ed with bone mets and admitted to the hospital for several days for scans etc., discovered i had inumerable mets from my skull to my toes..Soo back to the boards i ran..Ive done 10 rads to lower spine and neck and was put on tamoxifen and monthly Zometa..Then in nov. 2011 disccovered the little buggers invaded my liver..My first ONC was horrible and ive since got a new one..I'm now doing 4 rounds of A/C.. After 3 attempts to get a biopsy with no success my ONC feels the chemo is more impotant..Apparently i have inumerable diffuse mets to liver which are tiny making it difficult to get a piece of..My original path was highly er/pr + her2 - invasive IDC, scares me that still cant get a piece of it as after 9 yrs who knows and deep down id like to know what it is that im battling..the boards have been priceless source of information and support to me..Honestly the ONC i fired would have probly killed me were it not for the information i recieved here.. I have 4 children from age 24-15, and im about to have my 4th grandbaby (they need to slow down).. I was 2 yrs out of divorce at the time of stage lv dx and ironically had my first dinner date scheduled for the very day i was admitted to the hospital n told bone mets.. Thanks to many of you here after several months of hiding n thinkin the world was gonna end i got the courage to go on that date..So i now have a wonderful man that i spend weekends with that has even taken me for my liver biopsy n last chemo..My oldest son his wife and children have moved back home from California to be here with me, we have the house remodel almost done so we can coexist more comfortably..they have been a big help with both the bills and my 15yr old not to mention the granbabies being soo close helps keep me going..Thanks and love to all of you for being here your support n friendship is priceless to me... Tammie",
      "MessageIndex": 27,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 19, 2011 09:54PM tammie wrote: Kimbo i was dx'ed last month with extensive bone mets my bone scan shows them from my skull to my toes, my spine and left hip and leg seem to be the worst..Be positive ive discovered since my dx many ladies doing quite well  hope you have the pain under control and are comfortable..Welcome to our club none of us ever wanted to join..You will find alot of support and good laughs here, your not alone..Big hugs to you and dont lose faith..Tammie",
      "MessageIndex": 8,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776730",
      "Title": "bone mets klewandowski lulubee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: So this genius dr.That stated lesion in liver wouldnt change prognosis in Sept., and couldnt order PEt scan as he claimed insurance wouldnt cover...He then ordered PET/CT 3 weeks ago which ended up showing significant liver involvement..Well then he decided we should be getting aggressive so wants to start chemo but dont even seem secure in what chemo he wants to give me? Its taken 4wks since he ordered bone biopsy and thats finally happening on Fri. with port placement..Found out last week biopsy is taking so long cause he hasnt sent paper work..When i went to office last week he said i would require alot of blood work to check liver stats and pre-sugery..Well no surprise last week at office he didnt have orders written for bloodwork and was spose to write them for me to do at end of appt. but instead said would be done when i come for Echo to be cleared for chemo..Well this am i recieved a call from surgery center informing me that they dont have bloodwork reports or orders STILL...So thankfully the surgeon doing biopsy and port placement is writing my orders and sending them to hospital to be performed when i go for echo..Sorry so long and dont mean to be winey im just beat down..I cant even get it together enough to find all my records to get 2nd opinion...This ONC. is obviously not going to be sufficient in proper tx and this is my damn LIFE here.. I already requested a switch and have heard nothing back on that..I just made a call today to request help from the social worker or a patients advocate the lady tried telling me i had to call the main hospital to even file complaint or get support..Well thankfully when i informed her that it was in regards to oncology why would i be calling the main hospital, she politely put me through to the voice mail of the office manager..This is a state run hospital that is in process of transforming into a tx center..Is it cause im now on medicaid or am i an alien..WTF is going on here..Has anyone else had this much difficulty? Do they not realise this is about our LIFE..Thank you and sorry for the rant im just frustrated beat down and scared.. Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778099",
      "Title": "Useless Dumb Dr. rant!! tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Well  i have to say im so glad i gave myself this chance to put my decision to be alone forever aside and go on a date last week... He is the sweetest nicest guy ever i dont think he can be real even!! With our children growing up together he was naturally at my sons baby shower i threw Sat..I was so good from surgery i volunteered to keep the 2 grandbabies for my son after the shower so my daughter in law and son had a night to themselves..He took me and the kids to his house and spoiled us all rotten!! I even woke up yesterday to breakfast in bed with roses to boot (SCARY)..Hes even been a total genlteman through all this.. Which by yesterday im having a hard time doing...I find myself feeling bad today as all these feelings are scaring the SH** out of me!! After being alone for the past several yrs. then my dx in Sept. i resigned myself to never feeling this again shoot dont know if ive ever felt this way UGH!! Ive got this whole run while you can quick quick thing competing with this stupid giddy school girl thing sleeping with a damn sweat shirt he gave me yesterday when i was cold what the hell is wrong with me?? So ladies since i trust and need your advice please pinch me or give me that kick inthe butt im needing!! I know this is off the normal path of advice but you ladies are whom i share my deepest secrets with so please weigh in so i know if i should run like hell or just got with this..Although i think im stuck like a deer in the headlights idk if i can run i like him ALOT..Tammie Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778460",
      "Title": "New guy update tammie GatorGal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 15, 2011 02:27PM tammie wrote: Big big cyber hugs to you!! I can so appreciate how frustrating it is to have in compitant care!! Its so difficult to deal with or even know which direction to turn as we are already beat down emotionally..Sounds like your on the right track though snd hopefully this new Onc. is more on the ball with your care..Much love your way..Tammy",
      "MessageIndex": 22,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778074",
      "Title": "Just a little bit of a rant... alesta29 tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 23, 2012 05:24AM tammie wrote: Welcome Azie, so sorry you had to join us.. I wish i could offer some magic trick as to how to cure or prevent this disease from attacking us but ive seen many people from every walk of life fighting this disease, there seems to be no rhyme nor reason as to why it happens.. I'm glad youv reached out and found us do not hesitate to share your experiences, treatments and ask questions here as you move along this path.. The ladies here are amazing in the knowledge and guidance they give to us, i couldnt get through without them many days.. Sending positive thoughts and healing vibes your way, and hoping your surgery and treatments go well.. Big hugs to you..Tammy",
      "MessageIndex": 13,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/795321",
      "Title": "Metastatic Breast cancer Azie Chickadee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 11, 2012 02:00PM tammie wrote: Ty Luann that explains it some as i was curious as well, since my stage IV dx ive dropped a total of 30lbs.. However my stomach is still fatty/bloated or something its very frustrating at times... :)",
      "MessageIndex": 7,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793355",
      "Title": "Abdominal Fat smiley2 redwolf8812"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Mar 3, 2013 01:33AM tammie wrote: Ive been on 15mgs of extended release morphine twice a day since my dx, ive recently increased to 3x per day due to all the pain ive been suffering from my progression.. I do however have instant release im spose to use for my breakthrough pain but i cant take it as i dont like the loopy feeling and i become all emotional and cranky with everyone.. I hope they come up with something that works for you soon, constant pain SUCKS!! Big hugs to you",
      "MessageIndex": 5,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/801293",
      "Title": "Morphine Mzmerz Naniam"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 5, 2011 11:27PM tammie wrote: Ty all!! My biopsy was done under CT by an interventional radiologist..Apparently as many of you have said here bone met must be hard to get a good sample of?? IDK just very frustrating..They are not keen on biopsying liver mets as theyr saying to close to the heart apparently..I'm just gonna hope this AC kicks the crap out of all of it i guess and they can biopsy whatevers left when chemos done..I hope they get it together soon as im so sick of fightin to get good care it frustrating as hell..Much love and hugs to you all..Tammie",
      "MessageIndex": 13,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779062",
      "Title": "USELESS BIOPSY tammie tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 8, 2011 01:01AM tammie wrote: I too was just informed a month ago that i was stage IV now,it has been the most scary and difficult month of my life.. I had a breakdown just last night as i realised i was REALLY terminal... But i then realised there are many of us here that have been riding this dam roller coaster for years without any repreave and are still handling the hills dips and drops like pros..And darnit even though we may feel weak queezy and tired of all the dips in this road all we can do is hope the next hill or dip leads us to an easier road to ride..Enjoy everyday and know that you are not alone..So sorry you had to join our club but welcome friend and i promise your not alone we will all be here to hold your hand as we ride this never ending loop together..I hope we can support each other for years to come!!! Big hugz to you and remember day or night you will find a friend here that can identify with the hell this roller coaster can put us through!!!  ",
      "MessageIndex": 14,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776092",
      "Title": "Im a newby and scared lilredpony DivineMrsM"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 8, 2011 12:36PM tammie wrote: Yup ive grown quite the foul mouth these past months..From here on out after reading these posts Im gonna tell all its a cancer symptom lol..Hugas to all",
      "MessageIndex": 8,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779217",
      "Title": "Dirty mouth? Chickadee tammie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 24, 2011 10:34PM tammie wrote: Soo that crappy metal taste from chemo creeped its way i tonight feel like im sucking on a penny!! OO well at least it waited till after dinner..Popsicles here i come",
      "MessageIndex": 72,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 28, 2011 06:32PM tammie wrote: K ladies sorry havnt been on in a couple days computers not been cooperative..I had a beautiful dy yesterdayn with ll the kids and grankids..We took pictures and cooked out which never hppens in upstte Ny at the end of November..Loved your post Dar as it was very ironic that we both had the same day lol..I too have been feeling very emotional this week not sure if its the holidays or what..I soo remember 9yrs ago Dar when i too realised my life had been forever altered and would never be the same..Hope you come to veiw that very profound moment as a blessing as thats wht it eventully became to me <3 So as for chemo week pardon the potty mouth but it tastes like shit lol.. the nausea and chemo mouth i must admit has had me a bit down..but im keepin the positive and had a beautiful weekend and holidy with the family..So whos next to join the chemo line up i lose track with so many of us posting..Sorry not sure if chemo brain or sometimers but cant keep it straight..big hugs and much love to you all..Tammie",
      "MessageIndex": 98,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 29, 2011 08:12AM tammie wrote: HUGs Gator!! the anxiety is the worst i swear!! I hope the hubbys tests come back awesome will be keeping my fingers crossed!! I hope your not getting sick on top of it all..Try to keep yourself as busy as possible it can help with the anxiety..Wish i had more to offer on that..Big hugs to you..Tammie",
      "MessageIndex": 102,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 1, 2011 07:12PM tammie wrote: Glad your tx went well Mar we are on the same chemo regimen..The dirty pennies r nooo fun still battlin it...Do try to rest a little extra as i felt fine so stayed up n goin n wonder if rested maybe white count wouldnt have dropped so low...Had my nuelasta shot today and its got my mets or somthin achy tonight,,hopin tomorro i feel more like me.. You got the right idea on the anti nausea meds my nurse told me even if fine take them the first night before bed to stay ahead of it.. Welcome to the new ladies we have quite the group formin here!! How many are doin what treatments would be nice to get an idea of whos on what and when..Perhaps its my chemo brain flairin but ive lost track lol..Big hugs and thank you all for being here for mee ..Tammie",
      "MessageIndex": 139,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 6, 2011 08:13AM tammie wrote: Welcome Ckk..I can tell you fatigue has become a new way of life lol, i think between the emotional stress and procedures then the chemo fatigue just seems to follow for quite some time...I was gonna try the cold caps but opted not to i think a couple of other ladies here r tryin them though... Big hugs ..Tammie",
      "MessageIndex": 233,
      "PostDate": "06/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: I'm newly diagnosed with mets to the bones from idc thats er/pr positive..I'm currently tryin to find info on diets that would benefit my health and increase my bodies ability to fight this... I've looked online and seem to be finding very little info on this topic any ideas or pointers would be greatly appreciated..Much love and big thanks to all you ladies <3 . Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774997",
      "Title": "Help finding diet tammie Lauriesh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "tammie wrote: Soo my guy shaved my head yesterday and i went and got hats and a whole bunch of cool dangley earings..Then today by good fortune was my look good feel better class..So i got cool makeup AND of all things the cutest darn wig EVER...Its a color i never wouldv seen myself in and faar shorter than i normally wear my hair but it looks real nice its too darn cute..I had three family members that didnt know i lost my hair yet come in and flip over how they loved the color and cut on me..The best was the look of shock when i said its a good wig lmao i couldnt resist.. I hated wigs on the first go round but honestly this is so cute i can see myself wearing it :) Just had to share its a great week..Hoping i can say soo further in as 2nd chemos Wed... Everytime the wheel turns round bound to cover just a little more ground!! Dx 10/8/2002, IDC, 2cm, Stage IIB, 0/7 nodes, ER+/PR+ Surgery 10/28/2002 Lumpectomy: Right Radiation Therapy 5/7/2003 Breast, Lymph nodes Dx 9/7/2011, Stage IV, 0/7 nodes, ER+/PR+ Radiation Therapy 9/11/2011 Bone Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/779446",
      "Title": "Got awesome FREE wig..And dont like wigs i thought tammie Naniam"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 5, 2011 10:26PM tammie wrote: Goo Jan!! Thats awesome news..Big hugs to you ..Tammie",
      "MessageIndex": 9,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/777610",
      "Title": "good scans jan125 reesie"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 22, 2012 01:23PM tammie wrote: Reesie I can't say I know how you feel as brain mets have always been my biggest fear... But Your an inspiration to us all and i admire your attitude... Hope those big girl panties are fitting comfortable now that you found them, i often wonder how mine have'nt worn thin some days.. However if needed let us know and we can stitch you up a brand new pair.. I also have a georgious positive thinking cap that virtually hides the loss of hair we all experience that you are more than welcome to borrow if needed                                                                   Big hugs..Tammie",
      "MessageIndex": 19,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790929",
      "Title": "Ok, Done Wallowing reesie katie31"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 9, 2011 07:42PM tammie wrote: I'm havin my port put in place Nov.18th then starting chemo the following week i believe..Thought when i did this 9yrs ago i was done but here i am again..Would be happy to join Dec. group as ill only be 1 in by end of November..Big hugs to you all looking forward to start chemo asap..Tammie",
      "MessageIndex": 2,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 21, 2011 10:26PM tammie wrote: I unfortunately havnt been working since my stage IV diagnosis. looking for somthing to keep me busy..Actually went on a date for the first time in 2yrs. last week soo thats been exciting looking forward to more,we have been friends for yrs and the day i got my stage IV dx and admitted to hospital was spose to be our 1st date,but i ran after my dx..Anyway he wasnt hearin that soo,long story short im now running round like a little school girl with a crush..Mayb just what i need to help me push through side effects better..soo anyways first AC tomorro hoping all goes well..Stephani i did weekly Taxol in 2003 for original dx the numbness wasnt too bad..The achy thing got me alot along with the forgetfullness rashes and bowel crap is what i remember the most but we all respond differently...Much love to all of you..Tammie ",
      "MessageIndex": 51,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 22, 2011 06:50AM tammie wrote: Welcome to our group Gina!! Your wise to do that chemo anything that betters our odds is worth doing..Pinned to the beginning of the chemo forum you will see the lists of possible necessities..We are all different in se's from chemo.. I'm off to begin my first round of A/C today, hoping i do well with it..Keep up that good attitude Gina, i hope you breeze through it..Thank you Rach i plan on enjoying as much up time as i can hes such a sweety, crazy fool was tryin to offer to bring me to chemo lol..Well i spose i should get me dressed and ready to head in for chemo..Thank you all and big hugs..Tammy",
      "MessageIndex": 56,
      "PostDate": "22/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 29, 2011 07:36PM tammie wrote: Welcome Bc50 we will al get each other through one way or another im sure.. And Lady bug ty for droppin in to share your wisdom and concern, this isnt my first rodeo but i dont think this crap gets easier with time or at least most days it dont seem any easier anyways..I spent today with the crappy throat n mouth taste thinkin after a week the tummy should be better but what ever..I still went out for one on one dinner with my 22yr old and cozying up for movie time with my 15yr old son which never happens so mayb these sick chemo days have their benefits after all... Dar i wish i could share words of wisdom but all i can confirm is that this disease is hell on our whole family and the stress and fears it creates knows no boundaries..But the one thing i can tell you is that the closeness and strength that our family grows during it is priceless..I try everyday to remind my family just how strong they make me and what they mean to me..I also made it a rule that we all agreed that my cancer isnt just happening to me but to all of us as they often felt as though they needed to protect me and shelter me from how tore up they were over it and it made it a bit easier for them to share their feelings..Much love and hugs ..Tammie",
      "MessageIndex": 107,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 30, 2011 01:32PM tammie wrote: Soo ladies im feeling like crap and went n got my blood work done today..Well i barely made it home before they were calling askin if i could come back in for nuelasta shot as my white count is really low apparently..Well at least now i know why i been feeling soo crappy..This sucks :(",
      "MessageIndex": 118,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 30, 2011 04:11PM tammie wrote: Welcome Susan..I'm not of much help as ive only done taxol and am currently doin Ac as i was just dx'ed stage IV in sept...As for exercise do what you can tolerate when you can dont push yourself as chemo wreaks havoc on our bodies and if you push you will find you can crash as i just discovered this week...The hair thing is the worst and it varies with each different chemo you do.. With taxol i kept mine for almost 2mo. but the nurse said with my Ac it will probly start falling out about after 3weeks..Big hugs to you looking forward to gettin to know you better as we travel this crappy chemo road. Wish i couldv answered more of your questions..Hope to hear from you soon..Tammie",
      "MessageIndex": 120,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Dec 4, 2011 11:55PM tammie wrote: My goodness alot of ladies are startin tomorrow good luck to you all!! You will be fine and also find once first once done it feels like a big hurdle done!!Much luv and hugs to you.. Gator im fighting canker sores on tongue and roof of mouth, they are a pain and that stupid taste oo such fun it tell ya..I use the biotene as well hoping it will do it for me,, Mar you go get them with the Christmas spirit..The fatigue is improved this week last week after tx was serious sleeptime.. Hope you feel better n can get your tx tomorrow 3girls do be sure to talk to the Dr first though to be safe... Much love to you all looks like most of us are under way on this journey now..Tammie",
      "MessageIndex": 211,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777733",
      "Title": "Has anyone started a Dec 2011 group? darlam mamabee"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Oct 8, 2011 09:12PM tammie wrote: You are so right in the fact that you are no longer alone!!! We are all scared and some days even angry..I spent years after my initial diagnosis coming back to the boards just to offer support to those newly dx'ed i wanted them to know much like i had discovered here that we arent alone...Looking forward to walkin this journey with you sister as god knows we soo need each other..Big hugzz..Tammie",
      "MessageIndex": 17,
      "PostDate": "08/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/776092",
      "Title": "Im a newby and scared lilredpony DivineMrsM"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jul 12, 2012 08:24PM tammie wrote: Soo sorry I too remember the way my head was spinning after 10yrs cancer free to discover it was back and all over the place in my bones and into the liver too... TRY to take a deep breath and give yourself a minute to get your feet under you.. I discovered bone mets can be kept in check quite well.. I would ask when they are starting zometa or xgeva as sandilee suggested that was the first med i was put on also.. Its so overwhelming to take in at first.. I have to say honestly that this past 10 months for me have been no picnic it has changed my life in manys ways, but i've been blessed with a great quality of life this far and keep hope that it will continue for a long time... I hope that whatever tx you go into gives you great success... My advice on whats next is to take a minute to catch your breath, do your research into whats out there and dont look at statistics i dont know where they get them from but they are seriously inaccurate from what ive seen... As for the family thats the hardest task.. I've been honest with my grown kids and several of them have even assisted me in my researching my disease and are at times my biggest cheerleader... The motto amongst my children is my cancer affects us all and therefore they have a right to know as little or as much as they want to know.. Soo sorry you had to come back here but welcome back.. Sending big hugs and feel free to come as often as you need we are always here... (((hugs))) Tammie",
      "MessageIndex": 3,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790484",
      "Title": "I can't believe I'm here littlecatsfeet cheryl1946"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 20, 2012 06:23PM tammie wrote: Well i bought me 2 new bathing suits today in celebration after leaving my Onc. appt... For months i been stressing all the weight i lost but discovered today it has been to my benefit in the bathing suit dept. as i finally looking good in a bathing suit again ;) just wish i had more hair but at this point im almost officially to a mans buzz cut lol",
      "MessageIndex": 25,
      "PostDate": "20/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789334",
      "Title": "AWESOME NEWS :) tammie barsco1963"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "May 31, 2012 05:46AM tammie wrote: Welcome Redroan!! I must say i would be lost without this site, in fact i have been something went crazy with my comp. n i been off for weeks so happy to be back!! your tx sounds identical to mine so far..Best of luck to you and we will all be here for support whenever you need it... Big huugs to you...Tammie",
      "MessageIndex": 16,
      "PostDate": "31/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788033",
      "Title": "New to BCO today ! Stalker since January! Redroan Redroan"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jan 25, 2012 11:39PM tammie wrote: I was dx'ed with inumerable bone mets from my skull to my toes this past sept., also recently found ive developed inumerable diffuse mets to my liver..I have been very fortunate thus far as chemo seems to be doing a number on the cancer..Think positive sending good vibes and hope your tx kicks that cancers butt...Big hugs..Tammie",
      "MessageIndex": 11,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781591",
      "Title": "Bone Mets- \"hundreds\" of lesions? MaddyMason chrissyb"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 15, 2011 06:20PM tammie wrote:",
      "MessageIndex": 12,
      "PostDate": "15/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778099",
      "Title": "Useless Dumb Dr. rant!! tammie nancyh"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Nov 21, 2011 07:20PM tammie wrote: We talk all the time we've been friends for yrs our kids grew up together..He does have faults and ive known them for yrs. so they shouldnt surprise me lol..We talk alot like a real lot we even tried to not like each other for months and said so verbally joking..I ran hard after my dx and he wasnt hearin it soo here we are..Guess we'll see were it all goes?? In the mean time im gonna enjoy it ..Thank you all i needed to be reminded not to be all afraid and run ive gotten good at that :)...Much love to you all..Tammie",
      "MessageIndex": 17,
      "PostDate": "21/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778460",
      "Title": "New guy update tammie GatorGal"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 25, 2012 10:53AM tammie wrote: Nancy I will soo accept the invitation to your party!! I can relate to life throwing far too many things at once.. I think you should talk to your Mom and voice how you feel on the subject, maybe point out also that life has no guarantees as to how long you will be here.. you may very well outlive her and i'm sure she doesnt want you to stand there and witness your inheritance going to a distant relative. Maybe suggest she wait till something happens to you before concerning herself with such choices.. I cant even imagine how that must'v hurt.. I went through something simliar when recently my daughter informed me she changed her living will to indicate her Aunt would get custody of my grand daughter should anything happen to her, due to my health situation.. Although i doubt i'll ever witness it and far different circumstances it cut like a knife all the same.. Wish I could give you a great big hug right now.. Sending lots of positive thoughts and energy your way, and hoping for great scans for you :)",
      "MessageIndex": 35,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793995",
      "Title": "Pity party - everyone's invited nancyh sueopp"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Sep 10, 2012 05:35AM tammie wrote: Hoping your having a brighter day today... I have gone through phases this past year where I feel exactly what your describing, however something snaps in me and I get up and start going again... However I must say for some reason as my DIL pointed out to me the other day (she is my second eyes i swear it), I have become kind of numb and flat this past year since dx, I seem to exhibit my happiness during happy times but some how move along through the dark ones showing very little emotion or fear almost like a zombie... I assured her I will not make the full conversion and eat the family but dont know how or why i'm able to shut down like that and just go through whatevers thrown at me like its nothing!! Perhaps its a survival instinct but either way ive learned to become detached from heart ache and sadness most of the time and its concerning me.. Big hugs to you..Tammy",
      "MessageIndex": 33,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793192",
      "Title": "Why do we fight so hard? SPAMgirl Amyf"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 19, 2012 03:30PM tammie wrote: I been checking all day to see how you made out.. Soo sorry more tx in store for you.. Im keeping my fingers crossed that gamma knife zaps those suckers to hell where they belong!! I hear you on the brain surgery thing that would scare the crap out of me!! I've yet to have to deal with the brain mets stuff so im of little help... I can however fully relate to the not using your brain since your first child as i fear i stopped using mine 24yrs ago, my kids can definately verify that as they claim i know nothing and they of course know it all!! Big hugs to you and do keep us posted i'll be watching and hopin all goes well..Sending lots of positive thoughts and healing vibes your way..Tammie",
      "MessageIndex": 6,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789336",
      "Title": "Today's brain scans Tillycat Brendatrue"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Jun 28, 2012 01:43AM tammie wrote: Sending you hugs... Getting use to not going to work was tough, also horribly emotional as i never got to even put in notice Onc. refused to let me return at dx as too physical after 11yrs. there it was hard.. I do however have faith that you being the strong minded person you are that you'll find a way to occupy your time.. Your already filling some with that talk show, cant wait to hear it hope you do post it here...I after 8mo. out wonder exactly how I ever fit work in and still held all this other stuff down so well for years.. Oops on missing chemo, blame it on chemo brain... I'm sure was a very emotional day for you... Sending Big hugs and we will be here to help occupy you whenever you may need...Tammie",
      "MessageIndex": 13,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789770",
      "Title": "I'm no longer a working woman :( CoolBreeze lilylady"
    },
    {
      "AuthorID": "tammie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/2631/profile",
      "Content": "Feb 4, 2012 07:21AM tammie wrote: Sending big ((hugs)) to you... I'm sure your head is spinning right now but do try to stay positive and gather all the info you can, I strongly reccomend you get a 2nd opinion... Wish i could offer more I remember when i was diagnosed i felt lost and went through so many emotions... Just remember there are many treatments out there explore all of your options you will find an endless amount of support and information on these boards so you are in the right place...Big hugs and positive healing vibes to you..Tammie",
      "MessageIndex": 19,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782130",
      "Title": "HELP. Just diagnosed today--lung, liver and bone mets formygirls Heidihill"
    }
  ]
}