{
  "AuthorID": "tammy123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118240/profile",
  "Posts": [{
    "AuthorID": "tammy123",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118240/profile",
    "Content": "tammy123 wrote: Hello,  I would greatly appreciate it if anyone could provide some advice regarding my following situation: On December 10, 2010, I had a five core needle biopsy of my left breast, which came back as:  \"Atypical Papillary Lesion (Papilloma with Atypical Ductal Hyperplasia)--which was \"architecturally complex, proliferative and involves multiple cores.\" The reporst further stated that \"the papillary lesion is involved by florid ductal hyperplasia with extensive apocrine metaplasia [assuming this is all benign], and architectural atypia [possibly benign]. Based on this report, an excisional biopsy was advocated.   I had an excisional biopsy on  December 30, 2010.  Though I do not yet have the pathology report, my surgeon called me this morning and stated that the excision was completely benign.  I was thrilled and then asked her whether they got all of the atypia?  She then responded, \"what atypia?\" and we both kind of paused.  She then asked me if her office had ever read my original pathology slides, and I replied that I did bring the films from the biopsy ultrasound to the surgeon's office, but no one had requested the pathology slides.  She now said they would like to read the original slides and someone will call me soon.  My breast has known multiple cysts and small tumors (which appear to be mostly benign).  However, I am now concerned whether they actually excised the correct lesion?  I'm also concerned because I've already had a benign (with no atypia) lesion removed from my right breast about five years ago.  I should also mention that the subject tumor was not found by mammogram, but instead by ultrasound.  I should also mention that I have also had a complete hysterectomy 20 years ago--I'm 47 now--due to multiple ovarian tumors--occurring in both ovaries--but all diagnosed as benign.  Due to no ovaries,  I have also been taking Premarin for 20 years.  Would you recommend a second opinion on BOTH pathology reports at this point? Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "07/01/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/763024",
    "Title": "Should I Seek a Second Opinion? tammy123 SarahsMom"
  }]
}