{
  "AuthorID": "Tannor1306",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220372/profile",
  "Posts": [{
    "AuthorID": "Tannor1306",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220372/profile",
    "Content": "Tannor1306 wrote: I am really confused and would appreciate any insights. A few weeks before my 35 birthday (in April), my ob/gyn ordered a diagnostic mammo. I was having a pain that would shoot through my RT breast if touched in a certain area and it had lasted for over a month. I figured the mammo would be a waste of my time, but did it. Mostly because my doctor ordered a baseline mammo the year before due to cancer history in the family (no breast cancer) and I never did it. When my husband found out he made sure I went to this appointment. I received a call the next day from my doctor's office saying the RT breast was fine, but that on the LT breast there was an issue. The nurse said that my doctor gave me 2 options. I could go back in 6 months for another diagnostic mammo or they could send me to a breast surgeon now. There was no other information given to me on why, so I picked up the report. It said \"lt side mild area of asymmetry with parenchymal density in medial posterior. Short f/u suggested.I decided to go to the surgeon hoping that someone could fully explain what was going on since trying to get a hold of my ob/gyn was pointless. At the appointment with the BS, she felt a lump that I had discovered in that breast, and then told me she could feel the density they were talking about on the mammo, but that she was 85% sure I didn't have breast cancer. She then told me to come back up in six months for another mammo and she wanted an ultrasound, but to call if there were any changes. A few months ago, I discovered a dimple on the underside of my breast when lifting my arms and if I flex an indented line comes out of the dimple and goes up my breast. I thought it was just lighting, so my husband at a doctor appointment for our son asked that doctor to look. They said no, it's not lighting, we see it, and call your surgeon. So I called when we got home, and for over a week didn't hear anything. Then out of the blue one day, I received a call from someone saying they hadn't forgotten about me, they were just trying to get everything scheduled. When I asked what, they said I was having another mammo, ultrasound, and a biopsy. They did say that depending on what the mammo and us showed the biopsy may be cancelled. That happens next week. I am really confused on all of this. I thought I read that breast cancer does not show like this on a mammo, therefore I am not worried about the dimple or line. I am also getting irritated that no one is telling me what is going on. I expect fully to get a benign report when all of this is done, but I wanted to reach out and see if anyone can share insight on this, or stories similar to this no matter if the results turned out to be cancer or benign. I feel I am so unprepared for the next week and want to know what I could or could not be dealing with. Thank You... Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "25/08/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/834534",
    "Title": "Confused, Can someone explain? Tannor1306 ShetlandPony"
  }]
}