{
  "AuthorID": "Tanya22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128105/profile",
  "Posts": [
    {
      "AuthorID": "Tanya22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128105/profile",
      "Content": "Tanya22 wrote: Hi,  I am 22 years old and just recently ( in the last month ) found a lump on my right breast, i went to my GP who then referred me to the breast clinic.  Where an ultrasound then a biopsy was done, during my ultrasound the doctor stated that it \"looked benign\" .  After my biopsy my doctor seemed prett confident it would be fibroadeoma type of lump. However i am still a little worried as i have to go back this Thur for my results and i am unsure if there is still a possibility it could be something else or it may need to be removed.  I havnt spoke to anyone regarding this although my parents are aware of it i just dont want them to think i am worrying so any help or advise would be greatly appreciated. Thankyou x Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/767997",
      "Title": "22 YEAR OLD AWAITING BIOPSY Tanya22 dragonfly55"
    },
    {
      "AuthorID": "Tanya22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128105/profile",
      "Content": "Apr 22, 2011 04:48PM Tanya22 wrote: Thankyou, i am still out there  living my life hehe, just i am the type never to discuss things with people close to me as i dont like to appear vulnerable.  Just didnt want to make a big deal out of nothing by discussing with people close to me, but at the same time wanted to be prepared for the worse if you get me.  Thankyou again x",
      "MessageIndex": 2,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/767997",
      "Title": "22 YEAR OLD AWAITING BIOPSY Tanya22 dragonfly55"
    }
  ]
}