{
  "AuthorID": "TAPPY",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
  "Posts": [
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 09:24PM TAPPY wrote: I had a horrible burning face rash they day I came home from surgery,  Nothing helped - not even my super powered roseca meds. It felt like my face was on fire....my surgeon seems to think it was brought on by stress. I did take a double dose or two of Xanax and it did help.",
      "MessageIndex": 3,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775678",
      "Title": "Face Rash-- Really?! weerah weerah"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 31, 2011 11:25PM TAPPY wrote: One round of AC here....the nausea can be controlled - you just haveto get it down. Drink lots of water, that seems to help me rebound, gets it out of your system.  I am tired, but just learn to sleep and rest and take care of yourself. You can do this...and they can manage your side effects",
      "MessageIndex": 15,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777341",
      "Title": "Red devil or not? Teakay sarasowise"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 26, 2011 02:44PM TAPPY wrote: Thank you all for the information. I am glad this will all take place in the winter (South Louisiana in the summer is very warm = wig - not a good idea).  But Nov - Feb is  winter, so the temps will be easier to handle (but also lots of rain) I will try to do the hat route if I can (I have a big head so hats always looked funny on me) - but I will buy a wig as well. I am hoping to do chemo Thurs pm and take off Fri, Sat, Sun to recoup if need.  And I will bring something to eat at my desk for lunches so I can leave early. (good idea)   I have good medical/sick  leave benefits so they are there if I need them...plus 4 weeks vacation and two weeks I am going to request to carry over (rather than be paid out for them) - so I am hoping they will work with me.  Or at the very least I will use them in Nov Dec of this year.  I have a girl who went bald with her bc and came to work everyday, I am just not that brave.",
      "MessageIndex": 8,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775503",
      "Title": "Chemo and working TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 26, 2011 06:33PM TAPPY wrote: I will know (I hope) what my course of treatment is on Thursday, as much as I dread it, I also want to know so I can try to plan.   I am a control freak and this is something I cant control.  But I can try to plan at least. I am not so worried about hair loss (it is what it is) - but there are other side effect that do scare me.",
      "MessageIndex": 15,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775503",
      "Title": "Chemo and working TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 21, 2011 05:41PM TAPPY wrote: I am going to try to go back next week. I had 2 rough days after chemo...and still having some break thru nausea now and then. I hope I can make it....the Zofran works but it does make me fuzzy....",
      "MessageIndex": 22,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775503",
      "Title": "Chemo and working TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 06:55PM - edited Sep 28, 2011 06:56PM by TAPPY I am off to see the wizard (Onc doc) on Thursday,   I am anixous to find out more about my path report and the type of treatment.   I will be two weeks out from a double mas.   The waiting has been hard.  I was told by my surgeon that because it is/was in one node that I will do chemo....I want to be prepared and ask questions, but part of me just wants to hand it over and say tell me what to do and when to be there.  Just fix this so I can be done with it.",
      "MessageIndex": 49,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 18, 2011 12:13PM TAPPY wrote: Got home after having the first  A/C. Just kinda tired feeling....i know I am not out of the woods for  side effects...they told me I may not feel sick today, but maybe wed or later in the week. Anyone on A/C have insight into that ?    I do go back in for the neb shot on wednesday ...so should I take the claritin today or Wed ? or both days my chemo nurses were wonderful.What angels...they must love their work. I did notice I was the youngest person in the room (and I am 51 ) !!! Nice calming rain today...good for napping.  Hope everyone has a peaceful and restful day today....",
      "MessageIndex": 298,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 19, 2011 08:19AM TAPPY wrote: Lori - glad to hear about DD tests - one less thing for you to worry about:What is the steriod dex you are talking about ?  (I think they gave my that in my port yesterday)  I woke up with a wicked headache and nausea at 1 am so I started on the Z, I have to take it every six hours or I have break thru, but it kicks in 20 minutes later...but I do feel tired on it. How long will have I have take this after treatment, nurse said about 3 days. My face and chest are bright red (I get this after surgery as well and it is miserbale as it makes my eyes swell shut/burn ...they tell me to take Benedryl - which I can eat like candy with no effect due to all the allergies.  I just cant drink water...it gives me heartburn, so will try some of your suggestions...i really like a cola icee, but I am sure that is not what they have in mind LOL...but what ever works right ????  Right now stale ginger ale and yourgut/saltines and banannas seem to work just fine as far as food.  Nothing makes me hungry, poor hubby likes to cook so I told him to make home made mash potatoes for me tonight...and I am looking forward to it...tis the little things. Off to get the shot and hoping for no bone pain.",
      "MessageIndex": 319,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 19, 2011 10:48AM TAPPY wrote: Lunch today was a micro packet of Brown Rice (Uncle Bens) It tatsted good, settled in good.  And gave me that little boost I needed.  Nurse told me that the rash on face and neck was from the steriods they gave me at chemo yesterday.  Why do they have to give those ?",
      "MessageIndex": 322,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 3, 2011 04:33AM TAPPY wrote: Going in for round two today.  (I just count them down) I have  terrible sinus drip in the back for my throat.  (tis that time of year hear) - really not looking forward to chemo and not feeling well on top of it.   I have no fever or anything like that...just wondering what do they do if you get a fever or get sick ?  My port placement was worse than the surgery...but I am sure glad I have it. Last time I went to chemo I saw the nurses struggling and trying to get a vein for 30 minutes on some one.....lots of poking going on for sure. Have a peaceful side effect free day Oct gals !!! ",
      "MessageIndex": 566,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 10, 2011 04:57PM - edited Nov 10, 2011 04:58PM by TAPPY 51 here.    I tried work again today...I tiny bit better, but I told my boss I dont know if I can take the stress right now. I know the girl covering for me is tired of it andI feel bad about that.  :( But I do believe it would be best if I just took STD and worked on getting well and if they replace me oh well (I am an HR director of a regional bank office) - so it is not like they have some one who is doing my job. Had  chest xray and it was clear, but white counts were really low....this AC chemo is kicking my booty .....but starting a new antibotic med today for this \"bad cold\", is anyone else sick of taking meds ?   All I do is pop pills.....sick of being sick. Does anyone else have these anger issues ?  I feel mad all the time - but I dont know who or what for, and I feel like I take it out on my family, I really want my old self back....I hate feeling bad....I was never a good patient. Hope all the other OCT ladies are feeling good....prayers and cyber hugs out to all of you.  You all inpsire me daily...and I know you all understand.",
      "MessageIndex": 704,
      "PostDate": "10/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 13, 2011 04:41PM TAPPY wrote: Terry  - you look great bald.  You rock it.  I just look like a little wrinkled boy lol.    You will get your beautiful hair back.. And ditto on who ever mentioned popcycles - the tropical flavors are great...I get the sugar free ones. Well off to bed...I am going to attempt a few hours each day for work. Treatment 3 is this week...Hope to be feeling well by Thanksgiving....small goals..",
      "MessageIndex": 771,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 14, 2011 01:15AM TAPPY wrote: For those of you in need of a pretty head cover - try this site http://www.gailafund.org/site/index.php They will send you a free one if you are losing your hair.   I just got mine today and it is really pretty.",
      "MessageIndex": 777,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 18, 2011 06:16AM TAPPY wrote: T Shirt head wrap I tried this today and it worked great. I did not wrap the tails around or use an addition scarf for accent (who has time for all that tying and acents) , but just tucked them in the back into sort of a rosette sort of knot.   Looks really cute and it is soft cotten- very comfy. http://www.youtube.com/watch?v=tNOY4cS_k7A&feature=youtu.be&noredirect=1 For Thanksgiving I think I am going to order the whole shabang from honey hams - they have a resaonable price for a small honey ham with a few sides. We did a Turkey thanksgiving a few weeks ago...so not really hungry for Turkey. My brother has a big dinner at his house and he has invited me...but he has 3 small grandchildren and a house full - lots of germs ha ha.. I am trying so hard to stay well - so I think I will just stay home and enjoy and the hoopla on TV if I am up to it.",
      "MessageIndex": 839,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: I would like to hear from some of you who worked and took Chemo and how it worked out I figure I will be out 5 weeks with my double masc (is that about right ?) before I go back to work/in the office full time  - I am healing well and I am not doing recon untill a year later...want to get the treatment out of the way.  I am actaully working some from home now - remotely/answering emails etc...a hour or two a day. I work a desk job and I do travel (but I can put the travel on hold untill I am over all this)...... but it is stressfull and a whole of people interaction ( HR Manager/Recruiter ), but there are no time clocks and I figure some days I can go home early or work a 3 or 4 day work week with intermit short term medical leave if needed.  I have good leave benefits and time off (saved up)... Is this doable ?  or I will I be just sitting at my desk like a zombie with chemo brain and wanting to take a nap or throw up or running to the bathroom ? I do have to dress professionally as we have a strict dress code and the thought of this wears me out as I know I will lose my hair....... but I am sure I will get some leeway with that as well...I work for a compassionate organization and my coworkers have always been very caring for people in the workplace who go thru this...and I have been extremely open about what is going on (no rumor mills for me) Just wondering how some women are doing it is and if my chemo brain /being tired is gonna kick me ?  My husband travels quite a bit for his work and my daughter is 17 and very dependable, but she works and goes to school...so I need t know how hard this is going to be and to be prepared. Any tips or stories are welcome ! Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775503",
      "Title": "Chemo and working TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 23, 2011 04:21AM TAPPY wrote: Hope everyone hasa wonderful Thanksgiving - SE FREE !!!! I am working pt 7:30 -11:30 this week. .   I am not super productive - but I am keeping up. I have signed up for a look good feel good class in Dec - I hope I am feeling well enough to go :) Everyone has told me how great they are. One more AC treatment then on to the Taxol. I told hubby we should go to Las Vegas w/ a side trip to the Grand Canyon for Mardi Gras  when I am feeling better.  Surely I am due for some good luck at the slots after all this  ! Still have a lingering cough from being sick...it seems to come in spasms - so I am thinking of asking the doctor about some inhaler type meds....I need to knock this out.  I dont know what else to do to get rid of it. I am staying out of malls and shopping centers - trying to stay well.  But I really miss all the Christmas hustle and bustle even though I always complained about it in the past. LOL So Friday I think I will try baking some bread and maybe taking it to some of my good neighbors who helped me out during this time. Anyone have any tried and true easy recipes ?",
      "MessageIndex": 862,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 27, 2011 08:46AM TAPPY wrote: I was told I cant be fitted for my mas bra untill 4-5 weeks post op, so if you want back to work early,  what did you wear ?  All of my \"professional work clothes\" would look strange with a sports bra...and call attention (and like I said I work with the public, plus interviewing) - not that I care, but I am thinking it may make others feel odd to see it (and remember it is still in the 90s in Louisiana, so not like I can wear jackets to cover up with.  plus the skin/scars are extremely sensative, maybe they heal up - but it will be two weeks this Wednesday - I would go back to work now but I just can hardly stand to wear the sports bras (with surgical pads).  I am constanly readjusting them and some padding. Which leads me to another questions, - when can you stop wearing the sports bras at night or at home.  My surgeon said you needed to wear them for compression and to stop the swelling for awhile.",
      "MessageIndex": 20,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775503",
      "Title": "Chemo and working TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 27, 2011 03:20AM TAPPY wrote: I still have quite a few \"patches\" on my head to...some that are growing.....but for the most part I am bald.   I had to stop wearing mascera because my eyelash would fall out and I would have a big ole mascara glob on by face. The antibotics my Doc called in is working - no fever. - but I slept away Saturday.  I think I will just decorate my dinning room table and mantle this year. Of course I woke up at 4 am with this burst of energy so I am doing laundry ! I am sure may family wants me to get back to a normal sleeping scheduled.",
      "MessageIndex": 896,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 30, 2011 06:29PM - edited Nov 30, 2011 06:32PM by TAPPY Thursday is the last a/c treatment for me then on to the Taxol. I am trying not to dwell on it and look at it like I am 1/2 the way there.  I felt so good today I worked all day today.  The meds for the upper resp are starting to work, so that is a big help. But I am sure it will be back to part time next week.  I hope everyone in treatment does well this week...and we all are SE free !!! Oh I went and got fitted for my new bra and boobs...and I like the look. And Blue Cross is going to review my file as I have reached my out of pocket max this year and they need to pay off some bills that did not get paid at 100%.  (I will have to do someting nice for our Benefits mgr who helped me with this)  For what it is worth green tea (hot) works better for me for nausa than ginger tea (I find that Ginger is hard on the inside of my mouth.",
      "MessageIndex": 934,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 11, 2011 01:31PM TAPPY wrote: wild - you took the words out of my mouth \"You know who I'm really pissed at right now.....some of my closest friends actually.  I am not looking for sympathy, believe me, but sometimes I can't believe how insensitive they really are.......shut up already, is all I want to say to them.  I have learned a very important lesson since my diagnosis.......shut up and listen to people....ask them how they are doing/feeling, send cards out often to those who need encouragement for whatever reason.  I think I've always been a pretty good listener and encourager but I've never been much of a card sender......will definitely be doing that in the future.  We all have our crosses we have to bear in life......I kept waiting for the \"ax to fall\"  so to say, as God has been very good to me.....I know He still is and will continue to walk beside me through this\" It amazed  by the people whoh hevae been supportive and the ones who have not..my work friends have really come thru for me..and some \"aquaintances\"  but some of my close friends and family have left me high and dry....it has been an eye opener for sure.",
      "MessageIndex": 1035,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 29, 2011 03:51PM - edited Sep 29, 2011 03:52PM by TAPPY AC then T starting on the 18th ! Every other week with AC for 4 weeks then every other week with T. So about 3 months worth !",
      "MessageIndex": 55,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 17, 2011 06:53PM TAPPY wrote: Holy bone pain batman.... Ok - so no nausea issues...but I am having some serious bone pain today (Taxol treatment was Thursday).   After trying OTC  - which did not touch it..I had some Roxicets left over from surgery, they barely take the edge off of thepain...which is in legs, hips, ankles... What do docs normally prescribe for this ?  I need something that is going to let me sleep...ugh !!!",
      "MessageIndex": 1073,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 26, 2011 10:50AM TAPPY wrote: Gearing up for #2 Taxol and not looking forward to it this Thursday.  Yes it is better than AC but not looking forward to the bone pain again. I am going to drive my self (it is 10 minutes from my house) - why is it the people that saythey will help you always have something else come up Have any of you driven your self back and forth after Taxol ?",
      "MessageIndex": 1113,
      "PostDate": "26/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 31, 2011 11:19AM TAPPY wrote: Sometimes you just have to take a break from reading about all the bad stuff...I know I have had to do that a few times or it just brings you down and makes you worry more.  I crashed today - bone pain...but at least I was prepared for it.   I  only have two more Taxol treatments  to go...so I can see the light at the end of the tunnel.  - How soon do they put you on Tamoxofin ?   I dont even want to think about all the side effects for that yet....",
      "MessageIndex": 1135,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 16, 2012 02:28PM TAPPY wrote: Lor i - so glad to hear about your daughter. One more treatment for me....but I dont think I will be back to normal for a while.... but I am so looking forward to putting this behind me.",
      "MessageIndex": 1188,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 26, 2012 06:11PM - edited Jan 26, 2012 06:12PM by TAPPY Steriod High today - expect the crash on Friday night. for the bone pain.  Like clockwork about 11pm Friday night ! But  No more chemo :) Doc said I will see him in 4 weeks - he wants my body to recover before I start Tamox. White counts were high but red counts still low. So glad to have a break.   He keeps telling me I will do well on Tamox  and we will talk in depth when I come in then.   But mainly he wants me to watch for leg pain (blood clots) and abnormal bleeding while on Tamox...but we will talk more...so I am glad to have a break for 4 weeks to get stronger before I start this.  I want to havea clear head and time to write down all my questions.",
      "MessageIndex": 1220,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 27, 2012 01:46PM TAPPY wrote: You are right behind me sister :)",
      "MessageIndex": 1222,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 17, 2011 12:11PM - edited Oct 17, 2011 12:15PM by TAPPY I went and had a pedicure today.   I was told we really should not get them during chemo....but I hope my feet will look good if nothing else does ha !  Plus they make my whole body feel better... Got a short hair cut on Sat...will go every Friday till it falls out and my hairdresser said she will  wash and trim/or shave as needed - she told me this was for free and her way of helping me feel better...I figure I have one or two apts at the most, but I thought that was extremely sweet and supportive of her.  People have been so kind to me, I am so blessed for this, I am eating light and bland today - and made a Walmart run. I am trying not to think about my first chemo on Tuesday - and just try to catch up on things around the house.    Last night I noticed I could sleep on my side of a bit (small victory) - I will take them. but it felt good to roll over just a bit..I have pillows propping me up every where. My port site is itchy, I just hope it means it is healing up... As for my hubby, I cant complain, he has worked his ass off for me (I have had to lower my cleaning standards just a bit and try not to nag to much about it)    Anything I want he has gone out of his way for me, but I can tell he is stressed.  He had a few happy hours last week and that is not like him to have a cocktail during the week.      He will have to leave in a week or two to go overseas (work) - but he needs to work to and I know he is trying to do what he can before he goes. Praying that all of us have a peacefull week and feel well to just relax and enjoy being !",
      "MessageIndex": 280,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 4, 2012 02:49PM TAPPY wrote: My Onc wont let me take my port out for at least 6-9 months....wth ?   I am going in every 4 -5 weekf for check ups.....I just dont get what a blood test is going to find ? Seems like I should have a scan or something. Wild - I hope it is a a false positive - please keep us posted.  praying for you, ",
      "MessageIndex": 1238,
      "PostDate": "04/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 24, 2011 11:13AM TAPPY wrote: My SIL came and took my to lunch today and it was nice just to get out of the house for a bit.  Was not really hungry- but nice to get out and talk and think about something else. I am going to attempt to go back to work (6 weeks post op and 1 chemo trreatment down) on Wednesday.  I have to admit...I am terrifed about this, getting sick at work, working with no hair...I work in HR and I see people all the time.  What if it is to much for me....I really need to keep this job.  I have been there 17 years and have good benefits so I would hate to loose it or have my performance suffer.",
      "MessageIndex": 389,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Apr 22, 2012 08:10AM TAPPY wrote: What is the metformin taken for ?  I have been having trouble getting my triglycirides and sugars under control and I have never had that before. Got the mediport out in the doctors office rather than out paitent, it was easy peasy..had a day or two of soresness...easier coming out than going in for sure, Tamox and I are getting along well except for hot  flashes.... Hubby and I booked a wonder 25 anniversary trip for May.... hard to look at the past 9 months and not want to celebrate something ! I have lots of eyebrows and eye lashes and hair is coming in fast - so that is good. Hope all you Oct ladies are doing well",
      "MessageIndex": 1370,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jun 16, 2012 04:04PM TAPPY wrote: I broke down and started taking Effexor - it made all the difference for me. No more hot flashes and better moods ! Going in for recon in July....kinda scared about that...but looking forward to another milestone",
      "MessageIndex": 1379,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Aug 8, 2012 12:29PM TAPPY wrote: Hope everyone is doing well. I got my first hair cut and color this weekend...love the new look.  Short brown curly hair.  2 weeks post recon and love the results already, go in for my 2nd fill in two weeks ! Effexor is working well for me - no more hot flashes !",
      "MessageIndex": 1389,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 1, 2011 05:16PM TAPPY wrote: Ice chips really helped me the first time with the red devil  I got another wig and they are not to bad, just itchy !!! Sure saves time in the morning....and I packed up all my hair products and do dads ...wont need em for awhile. I have gone back to work and I am just whipped by the end of the day...tired like I have never known...but it does me good to work and keep my brain busy, Hope all the Oct gals are hanging in there...gearing up for round two this Thursday,  I usually feel bad for two to three days off and on..so will really try to rest up now one weekends.",
      "MessageIndex": 549,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 4, 2011 01:29AM TAPPY wrote: Welcome Lizzybc.  I just got off my 2nd AC treatment (same as you) - will have to T as well. I had heartburn to...I take prilosec the week before/after chemo and it seems to keep it at bay, and help with the naseua...and of course bland foods.   I had a fruit smoothie for dinner last night and it tasted good. I go in the docs office to get my shot (Neulasta ) the next day so I am not sure what the difference is.    I did not get the headache this time (as they told me it was ok to take my Excederian Migriane right before treatment.  And that helped a WHOLE LOT.   So far break thru nasuea controlled with meds. and tired.  good luck with your treatment - this is a good place to come and rant and rave and share. ",
      "MessageIndex": 580,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 7, 2011 08:36AM TAPPY wrote: Taking a bath or shower wears me out.....  I just put on clean pjs right now....I cant even bother with make up. I was hoping to go back to work, but the chest cold has got me down and I dont want to end up in hospital.   I just want all this to be over with....I just keep telling myself it wil be worth it, I hope and pray I am right because it is stealing so much of me right now.",
      "MessageIndex": 638,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 9, 2011 12:21PM TAPPY wrote: As far as the hair...2 weeks after my first treatment it started coming out. So I had it shaved.  Like some one said...this I can control....so I did.     I am glad I did because at least I am not dealing with that now and feeling bad.  The stubble is starting to fall out, but at least it is not a big mess. I did wear my wig this morning to work and it was hot hot hot...it never really is winter in South Louisiana - so send me some cool weather.",
      "MessageIndex": 679,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 24, 2011 05:24AM TAPPY wrote: I have always felts holiday blues....but this year is different.   am not going to make a big to do over them.  I plan on doing gift cards this year  (I love gift cards so I think everyone else should to )  Hubby maybe working overseas for Christmas any way....and my daughter is old enought she does not need me to decorate (and she loves gift cards) - so in a way it will be less stressfull and we have so many good places to eat around here, it will be easy to pick up something tasty to eat if I feel up to it. I am happy to lay on my sofa and watch sappy lifetime Christmas movies with happy endings. You know I made my hubby dinner last night, nothing fancy, but it felt so good to do something for him for a change.   I feel good just to feel good - the little things. And Iam going to look into a netii pot to - good suggestion. My final AC is next week to...but I believe I am doing Taxol not Taxotere - are they they same ???",
      "MessageIndex": 878,
      "PostDate": "24/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 27, 2011 10:47AM TAPPY wrote: Have any of you had to take Levaquin (levofloxacin) for fever or an upper resp ? This is what my doc gave me...and the side effects scare me.  I just hate that all these meds are going in my body :(",
      "MessageIndex": 901,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 27, 2011 03:33PM - edited Nov 27, 2011 03:37PM by TAPPY It is hard not to get down when you feel crappy.  Every time my hubby and I talk about it I break down and cry and he trys so hard to lift me.    I MADE myself decorate my mantle and dinning table today (place mats and candles ha) - I also put out our manager on a table in the dinning area...... I will get a small rosemary tree because it smells so good.   I did that mostly for my daughter.  Other wise I think I would just skip it all. I am so not looking forward to Thursday - (last AC) - I feel such dread,,,,I keep telling myself it is just to the end of January !!! (I pray this is the last time I ever have to do this) - I know there are so many people on this board struggling with this for years.  I feel bad for being a whiner. then on to Taxol. I will need all your taxol tips !!! Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Diagnosis: 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2-",
      "MessageIndex": 906,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 4, 2011 08:36AM TAPPY wrote: I cant even think of food for the first week after chemo. I just feel sick and like my taste buds are dead.   I think I slept for 20 hours yesterday..,,today I can feel my self climb out of it...and slowly feeling better. I do crave veggies when I get my taste back...I guess it is my body telling me what I need.",
      "MessageIndex": 960,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 5, 2011 02:37PM TAPPY wrote: Luv -I think I will have to go and get some vits....I am just worn out and usually by day four I am better than this. OH the look good feel good class is worth it - the make up is awesome.....if you can drag yourself in - it is well worth it.",
      "MessageIndex": 981,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 8, 2011 10:55AM - edited Dec 8, 2011 03:19PM by TAPPY Still around...just dead dog tired. HA....I am working 7:30 - 11:30, so when I come home it is lunch and nap, then maybe a load of laundry, dinner lite (Soup) , bath and bed. And I dont sleep really good - more like and off and on.....At least it is getting cold here and I breathe easier.  I am dreading the switch to Taxol next week -as I hate not to  know what to expect. treatment 4 knocked me back...and I am still not having \"good days\" a week later.   Dang it I want a few good days !!!   My coworkers planned the holiday lunch around my good days and I appreciate it so much...I will have to gag down some food however....meat for some reason is a big turn on to me right now.  So I hope we have some good veggie side dishes.  I did go get \"fitted\"and that whole process wore me out. A good frend of mines mother passed away and I cant go to the wake(as there will be tons of people) and I just cant risk getting sick again...I feel so bad and paranoid.  I will send flowers - but it is not that same as being there in person to give a hug.  I I hope every one is having a good week...we all need a few good days to remind us of what is going to come down the road.",
      "MessageIndex": 1008,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 19, 2011 08:37PM TAPPY wrote: I never took a pain pill with my surgery....the drains were uncomfy....but I did not have pain...it was tender and during the healing process you could tell the nerves were acting up...but as it healed that went away. It was mostly just aggravating because I am a side sleeper and it was hard for me to be on my back ........  My port surgey was painful but he had trouble getting it in.........but the double mas - was not - so dont fear the surgery.   I had lymph nodes taken from both sides and under my arms was tender....but not really painfull  The bone pain does feel like labor  - good way to describe it, it is mostly in my legs and hips....I took the Claritin - but I am thinking this could be from the Taxol as well.",
      "MessageIndex": 1082,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 7, 2012 12:58PM - edited Jan 7, 2012 01:01PM by TAPPY I stay close to home to....this is the time of year for colds and flu Woke up this morning...my nails feel strange, does that mean they are lifting ? Also my right foot feels like it is asleep all day...is that the taxol working its magic !!!",
      "MessageIndex": 1164,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 21, 2012 02:24PM TAPPY wrote: My eyes are super dry - which makes my vision bad :( So far my nails are ok, lots of neorapthy in my fingers however.  I did go and have a pedicure, I told my girl to be easy on them... It is so hot here I cant stand wigs, I am wearing bandanas (the large ones) - that I can tuck under.  I have to wear the wigs to work...but they are hot so I am keeping fans on in my office... Iam hot flashing like crazy at night, sure it will be worse when I start on Tamox..... WishI could sleep like I used to - I wake up all the time. Happy Mardi Gras everyone.",
      "MessageIndex": 1282,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 24, 2012 07:06PM TAPPY wrote: had my follow up - Doc said it will take up to 6 months before all the chemo effects are less :( I am dead dog tired by the end of the week.... Start Tamox on Sat - dreading it. Doc also told me I will see him every other month unless I have issues...he said there is really no test (blood - tumor markers) - that will show I have a reoccurance...I said they are pretty unreliable - I just have to be really aware of my body etc...I wish I could get a scan. He also wants me off the Xanax....thank you freaking Whitney Houston...he said to start weaning my self...I guess he is right. Also does any one know al the meds you cant take with Tamox...I read something about Benedryl ? Also there is supposed to be a Chinese herb that helps hair growth ..anyone heard about that ??? Hope eveyr one gets some rest and has a good weekend. ",
      "MessageIndex": 1288,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Mar 11, 2012 08:52AM TAPPY wrote: I still have neurapthy in my hands and feet...but I am off the happy drugs and finally sleeping better. Melatonin is a big help..hair is coming back...I am very tired still...but yesterday I cleaned my closet out...wore me out - but I felt good after.",
      "MessageIndex": 1334,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Mar 17, 2012 05:53AM TAPPY wrote: Congrats on getting your ports out...I hope I can get mine out next month. Going to the cardio doc today to check out the ole heart to make sure the chemo did not kick it around.   I feel pretty good these days...working full time for a while - I just really know when to rest. I am glad to see so many of you still posting.",
      "MessageIndex": 1346,
      "PostDate": "17/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 19, 2012 04:30PM TAPPY wrote: Congrats to Nancy and all of us who are hitting that one year mark.  What a journey...I am getting my fills every other week and the swap out surgery will be Dec 17th ! Then nipple tattos !   Dont worry - if you are later taking your effexor it will let you know.  I carry a spare pill in my purse in case I forget I always have one with me Hope some of the other Oct ladies check in and let us know how they are doing ",
      "MessageIndex": 1396,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 26, 2012 06:21PM TAPPY wrote: My radiog knew when he saw it on the Ultrasound and told me. He said he still had to biop it and he did. But he told me he was 99% sure when he saw it",
      "MessageIndex": 33,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/781217",
      "Title": "Can doctors really see cancer on mammograms and ultrasound? Emerald097 dogeyed"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 3, 2011 10:57AM TAPPY wrote: What about dental work during chemo ?  Is this doable ?  I have a crown that needs replacing...it could go a few more months, but maybe I should do this before ?",
      "MessageIndex": 101,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 7, 2011 04:28AM TAPPY wrote: I am going to \"chemo class\" today.   What questions do I need to ask ? And I will be getting the shot the day after the A/C treatments. Do you all do this or go back in to your docs office for his ? I am on the AC +T treatment . My port is still hurting today (feels like pulling) - ugh...I just wantall this to be over with.",
      "MessageIndex": 137,
      "PostDate": "07/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 9, 2011 05:19PM TAPPY wrote: What are you all taking for nausea ? I have a script for Zofran and Phenagren (I assume this is for nighttime use as it makes me sleepy). Do you all find these meds work or are the better combo's ?",
      "MessageIndex": 169,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 11, 2011 12:07PM TAPPY wrote: What is the bone scan everyone talks about ?  Is this the same one you get when you go to your obgyn ???",
      "MessageIndex": 192,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 16, 2011 03:56AM TAPPY wrote: I have read a few posts about people being allergic to the \"T\" How is that determined ?  and then what ? I am allergic to everything, it is hard for me to take OTC with out reactions.",
      "MessageIndex": 258,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 17, 2011 07:09PM TAPPY wrote: I took my steri strips off my port tonight (they were about to fall off anyway) I will bring the numbing creme with me, but I am not sure when to put it on. I am forgetting all my chemo tips ! LOL Are we supposed to eat ice during chemo ?  Seems like I read that some where. I hope they have that sort of thing in the\"chemo room\" - it is hard to know what to expect.",
      "MessageIndex": 288,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 18, 2011 03:58PM TAPPY wrote: My lunch is giving my bad heartburn and drinking water only makes it work. The nurse stressed drink drink drink (no diet cokes) - so I am drinking apple juice - bla !!!!! What can you drink that does not have tons of sugar in it.",
      "MessageIndex": 308,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 20, 2011 05:55AM TAPPY wrote: Feel better today (knock on wood) Rash is better I dont have the headache - I am still takeing the nas pill as I feel it creeping in - but not like yesterday.   Still sticking to the bland food. Gonna try to go back to work next week. So far no bone pain from the shot -not sure when that kicks in. Hope everyone has a better day with NO ISSUES !!!  I love a no issue day",
      "MessageIndex": 334,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 20, 2011 07:51AM TAPPY wrote: Welcome Beth...and I am sorry you had to join the group.  But you are in good hands here.... good advice and love and moral support. What type of chemo will you be having ?  I just had my first round this week(AC and then T) ...and it was not horrible like I had it built up in my mind. Yes a few side effects, but very manageable. I am thinking of going back to work next week....have any of you Oct. ladies headed back yet ??? Any tips ?",
      "MessageIndex": 337,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 22, 2011 12:26PM TAPPY wrote: I am on AC +T every other week.   I often wish I could do it every three weeks...but maybe it has to do with the chemo drugs you are taking and the diagnosis/age and health.    Some drugs are differerent time frame protocols.   I feel good today, but I am taking it easy and being super careful with what I eat. Small baby steps !",
      "MessageIndex": 369,
      "PostDate": "22/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 29, 2011 11:45AM TAPPY wrote: Just wanted to say JC Penney has some awesome hats on sale this week.  They also have some coupons online for $10 off to.",
      "MessageIndex": 491,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 12, 2011 06:24AM TAPPY wrote: I start AC (and later) T on the 18th.  They told me to plan for 5-7 hours....some times they have to slow the drip down (headaches for some people ??) and the first one always takes longer because you also meet with the Onc doc as well.  I hope I can just sleep and listen to music and chill out. I am not good and just sitting.  What does everyone pack in their chemo bag ???",
      "MessageIndex": 208,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 16, 2011 01:34PM TAPPY wrote: Just got to say - I love how everyone is so supportive and nice :) It DOES make all the difference.",
      "MessageIndex": 264,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 5, 2011 08:04AM TAPPY wrote: Still having problems with the nasuea.   The Zofran works - but stops working in about 3-4 hours.   I am fighting this horrible sinus drip/coughing to....uck. Is there a better med that I can can ask for to control the naseau for a longer period of time so I dont have the break thru ?",
      "MessageIndex": 599,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 5, 2011 11:41AM TAPPY wrote: Chips and an icee did the trick.   I know it is not \"healthy\" - but it sure helps settle the tummy.  I really dont want to take anything else to make me feel groggy...I just want to get past the bad days...I keep telling myself....just six more treatments. (I pray - I hope)",
      "MessageIndex": 601,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 6, 2011 11:02AM TAPPY wrote: Perts- I think I would have found the strength to knock that person on their booty !  I just cant believe the  things people say to us.  I so want to call my doctors office today and scream........give me something to feel better !!!",
      "MessageIndex": 622,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 8, 2011 09:50AM TAPPY wrote: 6 days post chemo and I am finally able to get off the nas meds. Still fighting a chest cold.....got some antibotics - but they are slowly working and  I am sure will cause tummy issues next. Doc said to take sudafed - but that wires me at night, so I dont know what else to take. I feel so light headed I am almost afraid I will pass out. What do you ladies eat for energy, nothing appeals to me right now.",
      "MessageIndex": 657,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 9, 2011 12:17PM TAPPY wrote: I tried work this morning, but 4 hours was all I could do....I always over do...I should have done 2 hours.       I think I will just work part time when I feel like it.  I have been there 17 years and never missed...so I hope they cut me some slack.  I have good short term leave benefits....but only 12 weeks of job protection.        Dang it - my cold is wearing my down.   I finally called my onc last night at 9:30 pm  and DEMANDED he call me in some of the GOOD cough syrup - and he did - so I did get some rest with out coughing my head off.   I am just surprised they dont seen to concerned about this.  Maybe I am over reacting.... I hate when they make you keep asking for something and tell you to try this or that......MAKE ME FEEL BETTER NOW LOL.  I need to kick this. I am so inspired by all you ladies....you truly keep me going.  No one else REALLY understands how down this makes you.",
      "MessageIndex": 678,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 16, 2011 04:26AM TAPPY wrote: Well another A/C treatment is on for Thursday  and I am just feeling better from this horrible cold so I hope it does not throw me back again.  I have decided I can only work part time/ 3 hours a day is the norm, any more than that and I run a low grade fever at night.  I am really not that productive right now..but at least I get a few things done.  I am really trying to to this one day at a time and not get to far ahead of myself.  Little baby steps.   I do feel light headed a lot and I wondered if it has something to do with low blood sugar or something like that. Any way - hope all the Oct ladies have a good SE free day.",
      "MessageIndex": 800,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 5, 2011 10:50AM TAPPY wrote: My red blood cell count was low this time...and I know that is why I am so tired and short of breath....but this one kicked my azzzzzz.  I feel likeI could sleep for days....  I am gong to a look good feel good class today, I hope it is worth my energy....I will report back.  I go to see my cardio doc in Feb - so I may ask him to order a scan if my Onc does not.  (I am doing Taxaol) Terry - hope you get some good news hun (((((hugs))))))",
      "MessageIndex": 977,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 12, 2011 05:59AM TAPPY wrote: Feeling batter today....the cold has finally taking a turn for th better.  It is still there, but I am not coughing anf gagging and weak.   Ate a decent dinner last night and slept all night - gosh what a treat. The air is cool - and it helps....never thought I would want cooler weather. I did condition my scalp last night and took with wash clothes to help rub itin and the hair (stubble)- came out in droves - it really felt good  to get that off my head - sure is less itchy. Beautiful day here -so I am glad I feel somewhat better to enjoy it...too bad in 5 more days I get another hit of chemo. Stay well and havea peaceful Saturday Oct ladies.",
      "MessageIndex": 733,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 12, 2011 03:58PM TAPPY wrote: Awesome news Malinda  - your energy and spirit is very inspriring to me. I just love having this small corner of the internet....Kinda like the old bar (Cheers) on TV.....were everyone knowss your name and they are always glad your came :)",
      "MessageIndex": 739,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 10, 2011 09:32AM TAPPY wrote: Terry - I dont think the surgery was as bad as the chemo. - and Yes it will be gone...a good way to look at it. I went to put hubby on a plane this morning.  Gone to Holland/Hungray for work...30 days. I will miss having him, he was my rock, he mopped my floors for me before he left this morning....dang I love than man....... his company left him alone for 2 1/2 months while I started surgery and treatment  and paid him, so I cant complain. I am praying Taxol wont kick my ass like AC - as my sister in law will be taking me to treatments. I did a pedicure this morning and I told the girl to clean out the pedi bowl really good and no cutting...she told me about her Dad who just got thru chemo (gastro cancer) - she treated me really well, was extremely gentlel.....I left my nails nude so I could watch them carefully.  I hope 4 taxol treatments wont ruin them. ",
      "MessageIndex": 1022,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 13, 2011 04:43PM TAPPY wrote: I cough all the time to...I do think it is becuase my throat is so dry and I have sinuse drainage and left over gunk from a cold 6 weeks ago. As long as you are not coughing up gunk, but just mention it to your onc next time.I chew orbit bubblemint gum and it seems to help ( I dont care for biotene anymore ) my cough and dry throat issues. Lori - congrats on your last AC !!!! I was so glad to put that behind me.  I got to go to our Christmas lunch today for work - I had a Portobello Veggie Panini - and it tasted wonderful.   I love it when I can truly taste something and enjoyt it. Tis the little things..",
      "MessageIndex": 1062,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 17, 2011 04:46PM - edited Nov 17, 2011 04:48PM by TAPPY I want to respond to everyone to my thoughts are a little mixed up due to the chemo as well I do feel a connection to each of you and I wish I could tell you ALL how good you make me feel and keep my pumped up !  and give a gentle big hug to all of you.  I pray for all of us each night that we beat this and become stronger for having gone thru it...I know it sounds cliche.....butI want something good to come of this battle.  I know it has made me more open and compassiate already and I am able to reach out more when I see people hurting or in trouble. I am having crazy dreams and I never dream...so I know it is the drugs. My treatment went well today so far (thank you sweet Baby Jesus and knock on some wood)  and I start on my anti nas meds before I need them, I know I cant let it ahead of me or else I spend the rest of my time chasing it. Someone mentioned adding a bit of cranberry or apple juice (just a splash or two) -to water...and I have been doing that.  Helps drinking the water a bit easier.   I ate vanilla ice cream (low sugar) tonight for dinner, it was all I felt like....I could not gag down another cracker ot toast or rice....but at least it put something in my tummy and it tasted good.",
      "MessageIndex": 832,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 20, 2011 11:24AM TAPPY wrote: Sherry - that is what I had to do to....as well - it was killing me. The stuff I had from surgery helped the pain....and then the lortabs helped that my doc prescribed...but they just chilled me out and I really did not sleep sleep....like I did with the other stuff... Today is day 5 after Taxol and the pain is just now starting to subsisded so hopefully it wont be cumlative and just last for a few days... I am also hot flashing like crazy !!!",
      "MessageIndex": 1087,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 19, 2011 01:27PM TAPPY wrote: Some place warm and tropical with a drinkie in my hand in June 2012....",
      "MessageIndex": 849,
      "PostDate": "19/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 22, 2011 01:25PM TAPPY wrote: Malinda...I am so glad you are home...sending you healing thoughts and prayers. I feel much better today - 7 days after Taxol.  I just wish I could sleep, I mean really sleep...for like 6 hours....I would be happy Hope everyone has a great SE free weekend and is able to enjoy the holidays.",
      "MessageIndex": 1105,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 28, 2011 05:52PM - edited Dec 28, 2011 05:53PM by TAPPY I hide my \"good drugs\" at home.  I have a teenager - who I trust.  But she does have friends over.   I have counted my drugs before when I thought they short changed me.  Hey it happens. I am wondering if Ativan would help me sleep better - Xanax isnt doing the job...I need to sleep. I may ask my onc to switch me over or ask his about his thoughts... Well I am going to drive myself on Thursday....if I cant drive back my SIL will come and get me - she had foot surgery but can drive. If any of you are the praying kind please keep my hubby in your prayers - He went to Hungary and is now going to Iraq (for work) - this is making me a nervous wreck. ",
      "MessageIndex": 1124,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 2, 2011 05:52AM TAPPY wrote: Malinda we are thinking of you. Ac treatment when well...the norm nausea is setting in, so meds and green tea, light meals. I refuse to say I am doing well because every time I say that I end up having a crash. I am going to a Look Good Feel Good class on Monday so I DO hope I can make that. Ok Taxio Ladies - give me the tips Does Claritn help ?  When do you take it ? Do I still need to chew on ice when taking it ? I also have to take the steriod pills the day before(5) and they day off (5) - do you take them all at once ? Doct said to take Aleve for the joint pain, is this something you all do ? ",
      "MessageIndex": 944,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 4, 2011 03:01PM TAPPY wrote: I have found that Orbit Bubblemint gum is good for getting that nasty taste out of your mouth or at at least hiding it for a little bit.       Sometimes I can do other mint type gums but they tend to be to strong....I love my orbit bubble gum..... oh and Iam sick of the biotene products...I use them, but the taste really turns me off now. I am working, but just part time....I dont work the day of/after chemo...then on Monday I go back to work part time  8-11...if I feel better I stay longer, if not I go home.  Some days are better than others.....  fI had a heart muugga test before AC just wondering if they will do a follow up to see what it did to my heart ?  Any one else have a follow up with this after they got off AC ?",
      "MessageIndex": 971,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 22, 2012 09:29AM TAPPY wrote: One more Taxol treatment this week then I am on to Tamox.   I wonder how fast that takes place, and how often I have to go in for check ups...it all seems surreal to me. Went out to eat last night, but could not really taste a whole lot and could not eat alot either, but good to get out. I went grocery shopping and it whipped me out..so nap time this afternoon How long does it take to feel normal again ?",
      "MessageIndex": 1202,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 12, 2011 03:59AM TAPPY wrote: Getting ready for Taxol #1 this week. - ugh.  Harder cause Hubs wont be here this time....going with my SIL. Do you all take the Claritin the morning off ? I am going to take a nexium to as I heard is causes bad heartburn. This is the first time I have to take the steriods the day before and morning off ? Any tips for this ? I wonder why they are not giving it to me in an IV this time ? Full of questions this morning...I will say I wish I could sleep better :( Auntie - have a great trip :)",
      "MessageIndex": 1041,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 25, 2012 05:36PM - edited Jan 25, 2012 05:37PM by TAPPY Yes - my last Taxol is on Thursday.   I hope I get a small break before the Tamox !  Lori - I know you are right behind me :)  Are you doing Rads ?? Work has truly been a Godsend to me...I know it sounds crazy...but it took my mind off of everything and everyone was so supportive. Hubby comes home next weekend after being gone for 8 weeks...he missed all my Taxol treatments - but was there for the AC.  He is such a big help...cant wait to see him A good friend sent me one of these hats today  jackiefarry dot com.... I dont think I will wear it to my last chemo...but I sure will be thinking it !",
      "MessageIndex": 1218,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 15, 2011 09:39PM - edited Dec 15, 2011 09:40PM by TAPPY So far Taxaol has just made me very tired from all the benedryl. I was there for 5 hours...what a a bummer, but I did sleep for most of it. Just very gorggy, with very little nausea, which is a blessing. I did throw up the burger I had for lunch, I guess it was just to rich....but I was hungry after treatment.   I also heard your whit blood cells crash on this and they watch it close, my face is really read and puffy from the oral steriod.  I hope it only last for a day or two like the IV ones did.. My doct said to try aleave for any joint pian which may or may not hit for a few days. Goint in for the neustla shot today - I am so tired aif appointments..",
      "MessageIndex": 1072,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 19, 2011 01:21PM TAPPY wrote: Wild - I am always glad for any good news...And I to keep saying this will be over soon Lor- I am so tired and cant get a good night sleep either...I long for a nice long sleep. Doc called me in some Lortabs for the bone pain, so I hope it will help.  I do have the stronger meds left over from surgery to...I swear - I never took so much as a vitamen before...and now I will need Betty Ford when this is all done:( It is daunting the meds we have to take to pull us thru this. I am skyping with  Hubby (who is still in Hungary) - and that picks me up :)",
      "MessageIndex": 1079,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 17, 2012 03:25PM TAPPY wrote: I have peach fuzz......I hope that means my hair is coming back.....and I hope the Tamox does not slow it up  (I heard it can do that)  I am still really tired -I dont sleep well at night unless I takedrugs and I want to wean away from all that.",
      "MessageIndex": 1270,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Mar 3, 2012 05:36AM TAPPY wrote: Getting lots of hair on my head...but no brows or lashes.... So far (knock on wood) - no really bad side effects from Tamox...except not sleeping well at night.  I went cold turkey of Xanax this week...I hate to say it - but I miss it. Skin is getting super dry...",
      "MessageIndex": 1306,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 4, 2012 03:00PM TAPPY wrote: Congrats on the last AC...Taxol has its issues - but to me it is better than AC. I think I am going to try a support group next Tuesday.  Have any of you been and what was it like ?",
      "MessageIndex": 1150,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 29, 2012 05:53AM TAPPY wrote: Glad the chemo is over with...I pray that none of us have to sit in that chair again.   I dont know if I could.     I amso grateful for all of you and the support...I can truly say we all know what each other is going thru. I just worry now going forward what to look for....or let go.",
      "MessageIndex": 1224,
      "PostDate": "29/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Mar 25, 2012 02:53PM TAPPY wrote: I am still hot flashing - but it is getting better and I am sleeping better. My eyebrows are coming in all crooked...ugh need to go get them shaped. by the end of theweek when I am tired I get achy and nauseated...I can tell when my energy is zapped and I need to lay low.  My hair is coming in fast...I to wear the bandanas from Walmart..just to hot for hats and wigs...",
      "MessageIndex": 1358,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "May 27, 2012 12:43PM TAPPY wrote: Just  a quick check in. My hair is coming in, very dark and curly - oh my...this from a former blonde with straight hair ! We went to Mexico for our Anniversary / Survivor trip - it was great. The heat kicked me pretty bad. Meeting with the plastic surgeon this month to talk about recon ! Hope every one is doing well....the changed up the forum a bit..and I had a hard time finding this thread. Keep in touch !",
      "MessageIndex": 1374,
      "PostDate": "27/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 6, 2012 06:21PM TAPPY wrote: I have to go in once a month to see my onc, I guess for blood work ?   and they will flush it out (the port then) -   I have some morracon oil...but I was afraid it would make my head break out or something..but hey give it a try It just seems like there should be more...I dunno - seems kind of odd that my worst is over with..now what so of thing... We are not going to do any scans, which I really would like to do, but apparently that is the norm ..I guess I just want to know what to be on the look out for, guess I will find out more at the next apt.",
      "MessageIndex": 1248,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 11, 2012 06:01AM TAPPY wrote: Hope you all are doing well.  I think today will be my first FEEL GOOD day in a long time.  I do think my doc double dosed me for the last one as I really struggled the last two weeks.   But I am sleeping better and the bone pain is almost gone ! I guess I am about ready to jump over to theb bottle of Tamoxifin thread. !!!!!",
      "MessageIndex": 1257,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 14, 2012 03:59PM TAPPY wrote: My eyebrows and eyelashes are gone.   I have gotten pretty good at drawing them on ! ha ! The reason I have to go to the OBgyn -is because of theTamox drugs - I think anyway...anywho looking forward to my follow up with my Onc next week to hear his plan of action going forward.",
      "MessageIndex": 1260,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 15, 2012 04:34PM TAPPY wrote: Stopping in to say hello And ditto on the wild and curly hair....out of control ! Going in for my final fill on Tuesday - loving the recon results. And will do the swap out in Dec. Hard to believe a year ago we were all going thru chemo. Hope everyone is doing well.",
      "MessageIndex": 1427,
      "PostDate": "15/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 28, 2011 08:40PM TAPPY wrote: that you so much for the info....It is helping my upper resp when a Z pack did not do the job. How does one know when one has a lymph node infection ?",
      "MessageIndex": 10,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 13, 2011 04:48AM TAPPY wrote: Tell one trusted coworker that you have a doctors apt and the reason why.  She can let the others knows after you leave.  I could not go back to work the day I was told.  I was a mess....and I still have my days.... But honestly - I like being at work.  I know they all care about me like family.  It takes my mind off of he cancer. Telling them made it easy for me as I know they will help me thru it",
      "MessageIndex": 1,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/774739",
      "Title": "Off to the doctor today. martygra martygra"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 27, 2011 06:29PM TAPPY wrote: I have had an upper resp now for 6 weeks that I can not get rid of and it is dragging my down....I know it is a strong anti b - and has side effects...but I have been told it is a super antib to -",
      "MessageIndex": 3,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 27, 2011 09:52AM TAPPY wrote: I have blonde eyebrows - so if I lose them it is not like it will be a big deal as I have to color them in now  Me trying to look at the bright side of things.",
      "MessageIndex": 11591,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 27, 2011 06:52PM TAPPY wrote: Oh I wish I was done, mine is just starting to fall out... But I love seeing everyones pics - it gives me hope for new hair !",
      "MessageIndex": 12169,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 2, 2011 12:57PM TAPPY wrote: I just ordered a wig and a few head covers frm TLC and headcovers dot com....this is all surreal to me. Does any one recommend any other sites (that are not to $$$$$)",
      "MessageIndex": 11730,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 28, 2011 06:47AM TAPPY wrote: thanks for all the info.....do you think it is better to buzz it or just a shot short little boy cut ????",
      "MessageIndex": 12177,
      "PostDate": "28/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 31, 2011 06:51AM TAPPY wrote: Does it take a whole year post chemo for your hair to come back to s semi normal state  ? Or does it never really come back like before ? (due to the side effects of Taxol then Tamox ) ???",
      "MessageIndex": 12203,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 9, 2011 03:11AM TAPPY wrote: For those of you on AC+T - what day is your worst as far as side effects ?  (as if they all are not bad in some way just for doing this) I have a choice of Tues or Thurs to take my AC. I am trying to plan it so I can work.  ",
      "MessageIndex": 158,
      "PostDate": "09/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 10, 2011 04:17PM TAPPY wrote: How long do you take the claritin beofre/after the shot ? So what is a good pain med if not Ty......I cant take most of the other OTC types due to tummy issues.",
      "MessageIndex": 187,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 12, 2011 07:02PM TAPPY wrote: thats MJ for the positive words tonight.... I am starting AC and T on the 18th...and I so needed to hear positive. I am planning to go back to work on the 24th and I hope I wont have to talk about my illness to much...everyone has been so nice at work and I know they are concerned....but I just want to be positive so I dont break down at work.",
      "MessageIndex": 220,
      "PostDate": "12/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 18, 2011 06:00PM TAPPY wrote: Lori - so glad all your tests came backpositive:)",
      "MessageIndex": 312,
      "PostDate": "18/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 21, 2011 02:28AM TAPPY wrote: Target has some really cute knit hats right now that give good coverage and are not tightly fitted. And they are not very $$$ - so that helps",
      "MessageIndex": 350,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 26, 2011 05:00PM - edited Oct 26, 2011 05:03PM by TAPPY Another good mouth rinse is eqaul parts of (about a 2 tablesoons of each) Malox - mint Childrens Liquid Benedryl Cherry Clorseptic  Dont swallow - just swish and spit out. Personally I like Biotene and keep the small spray size in my purse. FWIIW - I cant do the ginger tea - it made my mouth raw...maybe it was to strong.  ginger does a number on the inside of  my mouth. My scalp is also itching like crazy and hair is starting to fall out...8 days...I thought I would have another week :( Hugs to all my October girls ! ",
      "MessageIndex": 439,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 29, 2011 03:01AM TAPPY wrote: I did not like the wigs from TLC and sent mine back.  They all look like helmets on my head :/   May be is was because I still had hair.  I prob should have taken them to my hair dresser and let her work with them and thin it out, but I was afraid i would like not like them.   I went to a local wig shop and got a R. Welch one I like...I hope my hairdresser can trim it up for me a bit after she gives me the buzz. I am glad it is winter so I can wear hats. FWIIW - I sleep like crap now...I take a zannie and I fall asleep but I am up at 3 or 4 every day.",
      "MessageIndex": 483,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 29, 2011 02:19PM - edited Oct 29, 2011 02:19PM by TAPPY Zannieis is a Xanax - I take two and it helps me enough to get 5-6 hours of sleep.  I know they are addictive, but dang it, I need it right now so be it.... I had my hair buzzed today and I feel better not worrying about it any more.",
      "MessageIndex": 500,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 6, 2011 07:48AM TAPPY wrote: Had a big ole pity party at my house this morning. This treatment zapped me and I have no energy what so ever.   I feel so bad putting this on my family.  I am also fighting a nasty chest/sinus cold (no fever) - that is wearing me down to. What happened to my normal life....I did manage to eat some pancakes this morning,  I hope it gives me some energy to at least fold some clothes.",
      "MessageIndex": 610,
      "PostDate": "06/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 7, 2011 01:40PM TAPPY wrote: My Onc told me that as well.   I can barely gather the strength to shower and get dressed and with this horrible cold...even more so. But I am really struggling with the fatique right now so any tips are welcome",
      "MessageIndex": 643,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 25, 2011 10:10AM - edited Nov 25, 2011 12:52PM by TAPPY Welcome Anna - and of course - join right in. Lots of info and support her..... I think we all hit low spots and sad spots now and I again, it is hard to feel good when you are hurting or in pain...or just so tired you cant hardly moved.  Ok ladies - I am having quite a few of  lower back (????)  spasms....It feels like it is inside and not really my back..., I dont know, is this a side effect of chemo meds or just me being old......(I have never had this before and they are pretty constant).....ugh.  running low grade fever of 100 -wonder if it is a kidney infection. Off to take some meds for the low grade fever...this is supposed to me my good weekend.  Hope this does not spoil it.",
      "MessageIndex": 884,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 11, 2011 06:26AM TAPPY wrote: Wild - I know what you mean.  I have a low tolerance for whiners right now and when I hear people complaining about minor issues I have to just walk away.   I so much want to say be thankful for your normal life. Teri...I cant speak for every one.....Surgery was easy for me for me....I had a double max at 3 pm one day and was sent home the next day by noon. I did not take the pain meds...had some nas after the surgey but they fixed that fast........it was hard to sleep on my back and my back was achy...so I slept in the recliner the first week.    I was just really tired.  We will be thinking of you Terri.....if you made it thru chemo, then you will do fine in surgery...just keep telling yourself that.",
      "MessageIndex": 1028,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: Have any of you taken this during chemo when having fever ?  or a bad upper resp ? My doc prescribed it for my after a Z Pac did not work.    When  I read up on the drug is scared me more than my chemo drugs???? Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 10, 2011 06:15PM TAPPY wrote: An upper resp during chemo treatments can be deadly is what my Onc told me.  And for me it almost was...if  Lev had not cleared it up - I would have ended up in the hospital with tubes in my lungs..... MY goal is to stay out of the hospital (where Stap seems to occure)  So that is what out weighed it for me.   But I was concerned....but then when I started asking about it I heard from tons of people who took it that had no symptoms.....but of course one should be watchful.",
      "MessageIndex": 20,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 29, 2011 08:51PM - edited Dec 30, 2011 03:24PM by TAPPY Mine 2nd Taxol treamtnt  took from 8:30 - 2 today.  Made for a long day.    Gave me extra steriods and nas meds cause I was nas today.  Never happened before - Glad I packed a turkey snadwich and other lunch items  (I hate the crackers and juice they offer, just have gotten sick of them) Glad to know about they eyesight...they have been so dry to...but it is the weather here as well... I drove and went myself and it went just fine, but I live close by.",
      "MessageIndex": 1129,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 7, 2012 04:23PM TAPPY wrote: Congrats Lori - you made it:)",
      "MessageIndex": 1253,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 10, 2011 12:35PM TAPPY wrote: I took a Z Ppac before this and it did nothing.   Lev knocked it out as it had went into upper resp........I only took 6 of them.   I still have a lingering cough from sinus drainage. But I would take it again if I need it.An upper resp really wipped me out...it was worse than the chemo when I had it.",
      "MessageIndex": 14,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Feb 25, 2012 02:22PM TAPPY wrote: Lori where did you get the Biotin at ?",
      "MessageIndex": 1293,
      "PostDate": "25/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jun 22, 2012 03:59AM TAPPY wrote: It buzzed me the first few days....but I got used to it...take it the same time everyday (morning for me). It took away the hot flashes by at least 90% and my moods are better as well.",
      "MessageIndex": 1385,
      "PostDate": "22/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 3, 2012 02:02AM TAPPY wrote: Just a quick check in.    I am going in for my final recon surgery Dec 17th.   My recon went really well so far with very little pain or discomfort.   So far I am loving the results. I finally figured out how to work with my super curley hair :) Hope every one is doing well and has a wonderful holiday.",
      "MessageIndex": 1441,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775360",
      "Title": "October 2011 Chemo group stjude10 cfdr"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 28, 2011 07:59AM TAPPY wrote: thank you - you made me feel better. :)",
      "MessageIndex": 5,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778716",
      "Title": "Levaquin (levofloxacin) TAPPY TAPPY"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 26, 2011 03:48PM TAPPY wrote: My daughter has her eye brows threaded - and they always look great.   She said the first time it does sting a bit, but she prefers it over waxing as the wax always  makes her skin so red.",
      "MessageIndex": 11575,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 29, 2011 05:21PM TAPPY wrote: Ok I buzzed it....it was going to fall in a few more days. So know I dont have to worry about it anymore and that is past me.  It is a weight off my shoulders...done with that. It was a good experience...and my scalp feels better now - not so itchy.",
      "MessageIndex": 12190,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 26, 2011 10:22PM TAPPY wrote: Love all the new hair :) It gives me hope...it is 8 days post chemo and my head is itching and tingling like crazy...I thought I had aanother week. On another note....have any of you heard that it takes a long time for your hair to grow back if you have AC+T  ?  Or it never grows back very thick ? :(",
      "MessageIndex": 12158,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 27, 2011 06:57PM TAPPY wrote: Thanks YM Question for all the hair people....is is better to buzz it early in the game or wait till it starts REALLY falling out. Just wondering if you skip the scalp tenderness if you buzz it early.",
      "MessageIndex": 12171,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 26, 2011 02:11PM TAPPY wrote: Yes still doing chemo....last one was 10 days agao........it was hitting pretty high last night but holding steady now at 99... and I feel much better now  .  Called the doct he called me in some Lexecunie(sp) - it is rought on my systerm so I will try to give it a go.........going in Monday at 7:30 for a work up. Dang it is always something...",
      "MessageIndex": 5,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778667",
      "Title": "Fever - what to do TAPPY TifJ"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 27, 2011 06:40PM TAPPY wrote: he prescribed Levaquin (levofloxacin)  - it seems to work, have any of you had to take it ? I know it comes with side effects ! :(",
      "MessageIndex": 8,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778667",
      "Title": "Fever - what to do TAPPY TifJ"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 14, 2011 05:50PM TAPPY wrote: I just wanted to pass along that I got a genie bra and I love it...I remove the \"cups  they have and put my foam ones in and they work fine. Very comfy They will do untill I heal up and get fitted for something else. AND I did find a good shop near by that does just that. Sometimes things go right for a change.",
      "MessageIndex": 10,
      "PostDate": "14/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: Have any of you used these ?  I was talking to another bc friend today and she mentioned she uses them...and how comfy they are. Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 06:10PM TAPPY wrote: Apple that is what I wanted to know...if a foam prosthesis would stay put in it. I am sure I can find a low cut sexy one for other outfits that are low cut ...but I no longer have clevage either...... any unless there is some magic trick I dont know about LOL - please share...",
      "MessageIndex": 5,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 23, 2011 01:24AM TAPPY wrote: I cant wear mine 8 hours yet, but for most of the day it is fine.   I also use foam foobs in mine for the time being",
      "MessageIndex": 13,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 20, 2011 05:34PM TAPPY wrote: Awww Barb - that made tme cry...- that was beautiful",
      "MessageIndex": 22,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779764",
      "Title": "Bad Experience at the fitter? crystalphm 3jaysmom"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 20, 2011 07:44AM TAPPY wrote: Run to another fitter....I went to three before I found one that I liked and had pretty bras that I like. Do you all like the micro bead foobs ?  I have been thinking about them...I am really not found of the light weight silcone ones I bought .",
      "MessageIndex": 8,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779764",
      "Title": "Bad Experience at the fitter? crystalphm 3jaysmom"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 26, 2012 09:30PM TAPPY wrote: Just an update...I love the micro bead forms from TLC and I am thinking of getting the foam ones. I wear the micro bead forms more with my Genie bras than I do the silcone ones with the masc.bras. Just saying",
      "MessageIndex": 52,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779764",
      "Title": "Bad Experience at the fitter? crystalphm 3jaysmom"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: running a low grade fever all day - taking Tylenyol. Itis now  spiking to 101.5- Ty will bring is donw to 99........do  Icall the docotrs office (and will he just tell me to go to the emergency room) - which I dont want to do. Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/778667",
      "Title": "Fever - what to do TAPPY TifJ"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Nov 7, 2011 06:55PM TAPPY wrote: I am on AC plus T.  I know A is very hard on the heart, so it could depend on your age and other health factors.",
      "MessageIndex": 1,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/777742",
      "Title": "Chemo - which mix of drugs are the best? frenchielover frenchielover"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Dec 20, 2011 02:20PM TAPPY wrote: I have been using the fiber filled foobs in a genie bra and in my old reg bras...I have to do some adjusting to fit each bra.. I bought the ligh silicone foobs but dont think I can wear them till my port is out...and yes the fitter kept wanting to get it tigh/the brat...which was very incomfy.. I am thinkin I will go with the micro bead ones from TLC or just the foam ones (not fiber filled)  - let me know how you all like them...",
      "MessageIndex": 18,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779764",
      "Title": "Bad Experience at the fitter? crystalphm 3jaysmom"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 26, 2011 09:18PM - edited Oct 26, 2011 09:19PM by TAPPY My onc said the same thing...and I find that unsettling as well. I would at least like to do a bone scan....once my treatment are done I want to push for it.",
      "MessageIndex": 1517,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 07:39PM TAPPY wrote: My surgeon said only a small amount was in my sentinel node and he took out that one and the next 3 and they were clear.   (the other side was all clear when he checked) Margins are clear...  He said you always get chemo when it is in the nodes - even it if is one and it is a small amount... Just wondering if this is what you all have been told",
      "MessageIndex": 1462,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: Have any of you used these ?  I was talking to another bc friend today and she mentioned she uses them...and how comfy they are. Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 03:18PM TAPPY wrote: I did not want to ask to many personal questions (aka what type of form she used in them or not) But they do like comfy and not to pricey !!!",
      "MessageIndex": 2,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 23, 2011 10:20AM TAPPY wrote: yes go way up in size - that helps and use foam padding/foob if you need it. it will cushion your scars or TES..  I suspect that I will wear ti to work and go and pull it off in the after noon. when it gets uncomfy.  I have even put a little cushion on my left side which seems to pull and be sensative.  It is not thebest...but it is the best I have found so far untill I heal up to wear something else. For what it is worth....I am kinda liking being flat.   I normally wear my softie cami underneath and just a shirt on top.  I love those softie camis...i stopped putting in the foobs because I could never get them straight.   It is what it is...I am flat now...I think I am growing to accept it.",
      "MessageIndex": 17,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Oct 6, 2011 06:05AM TAPPY wrote: Had my port placement surgery yesterday.  The pain I felt after was worse than my surgery.  I know this is a non event for most people. It took my surgeon 9 trys to get it in....felt like some one has hit my in my chest a full force. Yikes - they area is all bruised up today....good thing I have a week to heal before chemo. Ok stuipd question - I have two bandaged areas, which one is the port ?  And is the other area the failed attempt ???   I did not get to talk to the surgeon after due to the fact I had to be so drugged due to the pain.",
      "MessageIndex": 4,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/775856",
      "Title": "October 2011 Chemo Group Seabrook Timbuktu"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 30, 2011 11:23AM TAPPY wrote: Thanks so much for the review - I am going to check this out Boobless women Rule !!!!",
      "MessageIndex": 9,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775655",
      "Title": "aaahhhhh bra or genie bra TAPPY DocBabs"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "TAPPY wrote: My silcone swim form is was to heavy to wear when swimming ?  Suggestions ? And best site to order swim suits from ? Can you swin in the micro bead or foam form ???? Many things about tomorrow I dont seem to understand. But I know who holds tomorrow and I know who holds my hand. Dx 9/9/2011, IDC, 2cm, Stage II, Grade 2, 1/5 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/785876",
      "Title": "Best form for swimming ??? TAPPY ca1160"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 23, 2011 11:45AM - edited Sep 23, 2011 11:51AM by TAPPY I have not been able to make a descision about this. One part of me says let it go, heal, move on, it is your badge of courage. I was never very breasty anyway...but good ole wonder bras did the trick.  Another part of me wants some clevage...but dont you have to redo implants in 10-15 years ? which would put me doing this AGAIN at 60 or 65 ?  and does insurance pay for it a 2nd time ?  I think I would rather spend my $$$ and time off on travel and going some place fab and out of the way....but that is just me :) I am 50 and I am pretty happy with the way I look (minus a few pounds) If I were going to go thru the hassle of surgery (because no surgery is fun) - I think I would opt for a face lift instead.  :) I keep saying I will decide later..",
      "MessageIndex": 573,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/582184",
      "Title": "No reconstruction- Happy w/your decision? marlee1 quietpools"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Apr 15, 2012 05:22PM TAPPY wrote: Thanks for the info..I have so many swimsuits I hate to not use them some how, my swim forms are way to heavy :(   ",
      "MessageIndex": 3,
      "PostDate": "15/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/785876",
      "Title": "Best form for swimming ??? TAPPY ca1160"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 24, 2011 09:47AM TAPPY wrote: I love this, thank you so much for sharing and for being brave enough to share.",
      "MessageIndex": 32,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/766752",
      "Title": "I started a blog, with photos Turtletots lucylou"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Jan 26, 2012 09:17PM TAPPY wrote: I will Ditto what Titan said..... I had fatigue and nasuea with AC - but it was managable.  I even worked part time.  The main thing is - stay well and stay away from sick people at all cost.  Your white cell count and immunity taking a beat with this.  I did not go grocery shopping ot Christmas shopping and avoided large crowds.  It is a pain, but they can manage the side effects. To me Taxo was worse because of the bone pain...but everyone is so different.",
      "MessageIndex": 20,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/781603",
      "Title": "Red Devil survivors, please wrsmith2x ruthbru"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 28, 2011 10:03PM TAPPY wrote: Thank you for posting this !  I need to hear positive. What are they made of ?  Silicone ?",
      "MessageIndex": 2,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775670",
      "Title": "Why didn't I do this sooner? sespebadger CarylC"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "May 17, 2012 11:28AM TAPPY wrote: I just got back from Mexico...and I have to say I am so dissapointed with all my swimming forms :( I just wanted to cry...sorry to be pitiful....I found the best thing was to take some fiberfill and form my own into a mas. swimsuit...",
      "MessageIndex": 12,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/785876",
      "Title": "Best form for swimming ??? TAPPY ca1160"
    },
    {
      "AuthorID": "TAPPY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135655/profile",
      "Content": "Sep 29, 2011 08:11AM TAPPY wrote: Do you just rinse/wash the off at the end of the day ? and they stick to your skin naturally ?",
      "MessageIndex": 5,
      "PostDate": "29/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/775670",
      "Title": "Why didn't I do this sooner? sespebadger CarylC"
    }
  ]
}