{
  "AuthorID": "taranebrask…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86674/profile",
  "Posts": [
    {
      "AuthorID": "taranebrask…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86674/profile",
      "Content": "Jul 23, 2010 06:40AM taranebraska wrote: Thanks for your input ladies!  barbe1958:  love the thought of a butterfly.  I love horses, but can't find a real feminine looking one yet.  My partner loves daisies, so maybe I'll try that route too.  Have you found where you'll do the tatoo as well?  I'm wondering if they need to have certain qualifications. I meet with the plastic surgeon today.  I need to re-look at some posts about different implants, just so I'm ready with more questions.",
      "MessageIndex": 5,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/755603",
      "Title": "Tattoos over the scars taranebraska aspen"
    },
    {
      "AuthorID": "taranebrask…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86674/profile",
      "Content": "Dec 31, 2010 02:24AM taranebraska wrote: Min - sorry for your unsatisfactory MRI results.  All I can add from the others' posts is from my experience.  I didn't have an MRI the first lumpectomy a year and a half ago.  Went to 3 different doctors, one was clear that an MRI would just show too much scary stuff and we'd \"overtreat\".  So, 6 months after the first lumpectomy (for DCIS), lots of cute spots showed up on a mammogram.  Finally I got an MRI which was read as \"extensive disease throughout\" a 3 cm mass. And the conclusion was as others have said, can't tell for sure what we've got til we go in.  Prepare yourself with as many questions as you can, learn as much as you can and take a support person with you so you will have the doctor explain everything to you as much as you need.  I would always cave when the docs would gather their papers and close the file, not wanting to keep them.  After 4 months of chemo now, screw them.  Its hard, but demand the answers until you are comfortable.",
      "MessageIndex": 4,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/762656",
      "Title": "My MRI Results migallen julie75"
    },
    {
      "AuthorID": "taranebrask…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86674/profile",
      "Content": "Aug 13, 2010 01:44PM taranebraska wrote: Hello, I just got diagnosed a few minutes ago with Stage 1.  BMX on Aug. 10 and got the pathology report today.  My goal was to never to do chemotherapy.  I had two separate tumors in only the right breast, one was 1.4 cm, one was 1.6 cm.  The nurse who gave me the path report said I'd most likley be recommended to have chemotherapy.  I have an onc appointment 8/19. Where do I start researching this stage?  I finally landed on a consensus report about DCIS from last fall.  Where's the latest research I need to look at?",
      "MessageIndex": 3281,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "taranebrask…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/86674/profile",
      "Content": "Aug 19, 2010 10:53PM taranebraska wrote: Hi all - I see many of you have very similar diagnosis and hormone status as I.  I could really use some weighing in on what were all the options we have for treatment.  I had BMX Aug. 10.  I have 2 indpendent tumors with same receptor status - triple positive.  I'm scheduled to get a port on Tuesday, and have been told that I need to have 4 months of chemo with taxotere and carboplatin, and a full year of herceptin.  I would love to find reasons to not do chemo, but I think my life long goal of not having chemo is over.  I had Hodgkins in 1997, chest and abdomen radiation, and lumpectomy for DCIS last year.  Please let me know your experiences.  Thanks in advance.  I'm still exhausted from surgery but I have these tough decisions to make fast, and I know this is the place to get lots of perspectives.",
      "MessageIndex": 3356,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}