{
  "AuthorID": "Taralynn886…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273354/profile",
  "Posts": [
    {
      "AuthorID": "Taralynn886…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273354/profile",
      "Content": "May 1, 2018 08:29PM Taralynn8869 wrote: that is exactly what I'm gonna do... Whenever u get that call back and the doctor suddenly sounds concerned and empathetic, u automatically hear nothing else but \" get ur affairs in order ASAP\" and ur doomed... But I decided tgia was not gonna determine stress affected heath and well being. Im alive today and noone is promised tomorrow.. Ive survived thibgs before some didn't..I did opt on telling just a few close girls of mine and my oldest daughter and simce we have to go to. Big city 2 hours away for the surgeons apt, we are all just gonna call it a girls day and live it up away from this small town we live in for a day.. Maybe get a room and a motel for the night and just be girls.",
      "MessageIndex": 6,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864336",
      "Title": "What just happened.. From routine Mamo. Results to a surgeon Taralynn8869 Egads007"
    },
    {
      "AuthorID": "Taralynn886…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/273354/profile",
      "Content": "May 1, 2018 05:26PM Taralynn8869 wrote: thanks for the info..I will be proactive and get my reports. I just dont want to get cunfused and scared with definitions and words i have to look up 3 root words to understand. Lol..I also dont want to worry myself by completely slipping into thoughts about this and stop living life and start making plans around something I have no idea what it is about...I try to remember everything the primary doctor said but its a blur after She said some findings on the bottom side of the nipple area.. But i wasn't taking it to serious at the time because she didnt seem fully informed that it was a comparison mammogram and was not aware I had a previous u/s... But then she seemed more concerned after I informed her and she looked back at her report and said oh yes.. Well that confirms u need to be seen by a breast surgeon😞.. So Idk.. Reading her reaction was more scary than what I was understanding in what she said.. And in my head I was saying. This isnt real. Dont cry. This isnt real... And I left more confused than when I got the call to come in... ",
      "MessageIndex": 4,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/864336",
      "Title": "What just happened.. From routine Mamo. Results to a surgeon Taralynn8869 Egads007"
    }
  ]
}