{
  "AuthorID": "TardisBlue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200825/profile",
  "Posts": [
    {
      "AuthorID": "TardisBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200825/profile",
      "Content": "TardisBlue wrote: Hi everyone. I'm going to start this off by mentioning that I'm 21, as I do believe that is important.  So during the past week, my left breast decided to begin acting up. I'm normally a 34b, but my left decided to become a 34D in about 2 days. The nipple on that breast wont get hard but is strangely wrinkly, for some reason, which is unusual, and it's damn itchy. My left breast is hot to the touch and pinkish on the bottom. My lymph nodes next to my left breast are swollen and about the size of almonds... actually wait I just checked and now they all seem to be one big mass on the side of my boob. Jolly. I dont know if its connected but I've lost my appetite. I'm still forcing myself to eat but it leaves me feeling sick and in pain. and I've lost 8 pounds this week (kind of hooray?). I'm abnormally exhausted and my entire body feels heavy. I don't have a fever. I went to a walk in clinic last wednesday and the doctor ordered up an ultrasound and mammo. My appt is on June 4th, but the specialist office refused to write me up for a mammo because of my age. I'm okay with that. The doctor said it was probably fibroadenoma, but to me it seems closer to mastitis, minus the fever? Not to mention that mastitis rarely happens in women who aren't breastfeeding. Despite the extremely low chance of me having something serious, I figured I would ask you ladies because I don't know where else to turn and after reading around these forums, it seems like you guys know your stuff. Anyway, thanks for listening. I appreciate any response. edit: I forgot to mention that around my nipple my pores seem to have grown. That could just be from the sudden size change in that breast but its weird. That breast also seems more veined and my armpit is bruised. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821393",
      "Title": "My boob is being weird. TardisBlue MelissaDallas"
    },
    {
      "AuthorID": "TardisBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200825/profile",
      "Content": "May 25, 2014 01:35PM TardisBlue wrote: When I went to the doctor I was mostly worried about the stomach issues and just mentioned my breasts being abnormally sore (they're not so bad anymore). The doctor found some lumps. The swelling of the left breast came two days after I saw the doctor.",
      "MessageIndex": 2,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821393",
      "Title": "My boob is being weird. TardisBlue MelissaDallas"
    },
    {
      "AuthorID": "TardisBlue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200825/profile",
      "Content": "May 25, 2014 01:57PM TardisBlue wrote: Proudtospin - Yes I have an ultrasound appointment coming up on June 4th for both my stomach and breasts. If my symptoms get noticeably worse before then, should I revisit a GP, instead of just waiting for the ultrasound?",
      "MessageIndex": 4,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/821393",
      "Title": "My boob is being weird. TardisBlue MelissaDallas"
    }
  ]
}