{
  "AuthorID": "tarm",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186746/profile",
  "Posts": [
    {
      "AuthorID": "tarm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186746/profile",
      "Content": "Aug 26, 2013 03:14PM tarm wrote: Ok then thank you for your reply that makes me feel a lot better",
      "MessageIndex": 3,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809932",
      "Title": "pain under left armpit - no lump tarm tarm"
    },
    {
      "AuthorID": "tarm",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186746/profile",
      "Content": "tarm wrote: I am 21 and have never had cancer before but have heard of young women getting breast cancer as well so I am trying not to be naive. I woke up in the middle of the night for no apparent reason and noticed that when I moved my left arm I had a sharp pain under my arm. I can not see or feel a lump at this point but this pain is intense and hurts when I touch under my arm and even when I move my arm slightly. I have just come back from holidays and have not done any extreme activites or weights or anything to cause any pain to this area of my body, and I have never had any pain in this region before. I am planning on going to the doctors in the morning and i'm not jumping to conclusions but want to know if anyone has had pain like this with no lump? I have read a lot of posts on here and have noticed people have said that Drs have misdiagnosed them or missed the signs completely in the beginning more often than not. Hoping someone can reassure me that this is nothing or that it infact could be the start of something serious! Please help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/809932",
      "Title": "pain under left armpit - no lump tarm tarm"
    }
  ]
}