{
  "AuthorID": "taylor10203…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207987/profile",
  "Posts": [
    {
      "AuthorID": "taylor10203",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207987/profile",
      "Content": "taylor10203 wrote: So I'm 15 years old and recently I've noticed that my left nipple is retracted more then normal. Both of my nipples are a bit retracted, but in the past month or so it seems that my left one has been getting more and more retracted. I've also had breast pain on and off for the past few months, and right now I'm experiencing pain in mainly my left breast, near the side and in my armpit. Breast cancer isnt in my dads side of the family, but my mom was adopted and we have no contact with her birth family, so it could run in her side. I know breast cancer is super rare in young girls but I'm just so scared that it could be cancer, since most sites that have information about retracted nipples only connect it to breast cancer. I want to see a doctor but I'm to afraid to talk to my mom about it, and I don't want to worry her because the past little while has been hard for her and the possibility of me having cancer would obviously make it a lot worse. Some advice would be very helpful, thank you. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826366",
      "Title": "15 Year Old Retracting Nipple taylor10203 Racy"
    },
    {
      "AuthorID": "taylor10203…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207987/profile",
      "Content": "Nov 18, 2014 08:52PM taylor10203 wrote: thank you both for your advice!! I think i'll tell my mom about it soon... i'll let you know how it goes.",
      "MessageIndex": 3,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826366",
      "Title": "15 Year Old Retracting Nipple taylor10203 Racy"
    },
    {
      "AuthorID": "taylor10203…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/207987/profile",
      "Content": "Nov 18, 2014 09:14PM taylor10203 wrote: thank you for your help Nancy, you're very kind!!",
      "MessageIndex": 5,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/826366",
      "Title": "15 Year Old Retracting Nipple taylor10203 Racy"
    }
  ]
}