{
  "AuthorID": "tbaker59102…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91732/profile",
  "Posts": [
    {
      "AuthorID": "tbaker59102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91732/profile",
      "Content": "Jan 7, 2010 07:39PM - edited Apr 13, 2010 02:45PM by tbaker59102 I am finishing my RADS tomorrow - number 33 of 33!    YEAH!!!  Has anyone sent out thank yous to their medical team after completeing surgery/RADS. Looking for a good idea there. I will continue this \"journey\" with adjuvent hormonal therapy - Arimidex. I am a little afraid of the drug, but more afraid of a reoccurence to not take it. I am open to anyone suggestions or questions - still looking for help and trying to give out  help where I can. Thanks to you all for all you write and talk about - it has been very helpful to me through this ordeal. :):):)",
      "MessageIndex": 285,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "tbaker59102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91732/profile",
      "Content": "Jan 13, 2010 03:16PM tbaker59102 wrote: Thanks to all who responded to my question about sending thank yous to my cancer team. I still haven't decided exactly what to send, but will definetly send something. I did finish my RADS on 01/08/09 and started taking Arimidex the very next day. Didnt notice any se at first...started noticing I was a little warmer than usual yesterday about 4 days into it. I too feel wierd about \"taking drugs\" for 5 years, but plan on doing it anyways. From everything that I've read and heard from the onc, it sounds like the right thing to do to stop the cancer from continuing or coming back. So far the \"hot flashes\" (more like constant heat than flashes to me) are not bothering me much. I have been hot for about the past year anyways (not in the cool way if you get my drift) so I am experienced with the sensation. I will see my onc on the 28th to talk to him about how I am responding and get some blood work done. If anyone knows the routine of seeing the onc after RADS and wants to post it here I would be interested to know what to expect. I specifically want to know why they take blood and how often. As far as the RADS se's for me: I now have a tanned square around my left breast with a sun burned area inside of that approx 4\" squareish that was from the final 8 tx - boosts they called them - targeted at the \"tumor bed\". I still feel a little itchy at times, but not as bad as when they were doing it daily. I used a cream called Xclair that I was given samples of from the doc. I also used Cortizone 10 plus. Both of these items I applied twice a day - the cortizone first then the Xclair and feel like I escaped with little damage. I also used Gold Bond Ultimate Comfort Body Powder through out the 33 tx mostly because of the no deodorant thing. I found that I really like this product and plan to use it from here on out. I am one of those 70's children that used to be sort of \"natural\" and this product reminds me of those days. Even though I have heard that antipersperant dont cause bc - I am still a little suspicious and am going to try to avoid it as much as possible. Best wishes to all and look forward to reading more of your experiences and posting mine. Arimidex is one of my new friends - just like all of you.",
      "MessageIndex": 335,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    },
    {
      "AuthorID": "tbaker59102…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91732/profile",
      "Content": "Jan 15, 2010 03:11PM tbaker59102 wrote: somanywomen - I found the information you wrote about your blood work interesting - I will ask my onc about the numbers you mentioned and especially the part about tumor markers every 12 weeks. I have no idea what this means - but thank you for the leading me to learn more. I am always on the hunt for information. Now 1 week post RADS and I am still burnt/tanned and am actually quite sore. Its the same sore I experienced off and on throughout the treatments I thought it was gone but was wrong. Hard to describe exactly the type of sore it is - not intolerable just annoying. And still itching - not too bad though. One week tomorrow of Arimidex and SE's have not changed just a little hotter than usual - hoping and praying I will not gain any more weight. I have put on 15 lbs since this all started in September - mostly from quitting smoking and subsequently quitting Nicorette gum. I saw a naturopath Doc on my last RAD day and she has given me alot of info on diet that I am planning on trying. I will write more about that as I go. As always thanks to all for the valuable information - I can't write on here much - usually during my lunch break at work, but I value all I learn here very much :):) have a good weekend",
      "MessageIndex": 358,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744272",
      "Title": "December 2009 Rads Group Linda_NJ BonnieSF"
    }
  ]
}