{
  "AuthorID": "TBB",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
  "Posts": [
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 28, 2009 11:24AM TBB wrote: Nadine, Thanks for the information on head gear and your insights on family..Husbands can be an amazing part of all of this... I sat here and read your post and cried my eyes out... (guess I needed that today) I start chemo on the 14th of April... I am getting the haircut short tonight and stocking up on head gear...  Smiles  ",
      "MessageIndex": 63,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Apr 12, 2009 03:51PM TBB wrote: Hi Ladies, I keep writing and erasing because sometimes I am at a loss for words.  I can say right at this moment I want nothing more than ice cream.  It is such a good mood lifter...I hope that everyone enjoyed Easter with the Family and friends.. was a great day all around.... I read all of these posts about the SE's on the chemo, the Neulasta shot, the steroids, the sleeplessness that everyone is experiencing and just want to pull my hair out in bewilderment on how our bodies can actually handle all of this crap that we are actually putting into it.  If you read the SE's that are listed on each of the medications you are taking you could go crazy with wonder any way.  TAC is the chemo that I start next week.  The Adriamycin is the strongest med and the SE to that med is heart failure... WOW.... My ONC had to explain all of this to me before agreeing to go that aggressive...  It is so hard to be so strong knowing that we have to put more toxic crap into our bodies to kill off the toxic crap that is already there.... The neulasta shot is the next topic I have to deal with.. Bone pain is one of the SE's but read the label on the others... YIKES... Luckily I am not doing the steroids... My chemo has been put off a week due to the fact I had an allergic reaction to the tape on my incisions (bilat mastect) which then got infected and could not have expansion done so my drains are still in going on 6 weeks.  I have not been able to take a SHOWER in 6 weeks, (bird bath only), can only wear Mens button up shirts because of my attachments (drains) and am not able to use my arms to do anything AT ALL until my drains are out... My PS is great and I mean great but a little on the anal side.... (about the drains) so hopefully tomorrow is the day he pulls them and I will be in the shower for the next 72 hours.  Then the Port placement which means another 3 days without a shower.  It is amazing how we take showers for granted... So I cut the hair super short last week and going shorter next week.  I think it is fun trying all the new hair dos before it actually falls out.  I went to ACS to look at wigs but decided not to do wigs at all... I am determined to be HAT girl since apparently I was meant to go through BC and experience what I have to date.  Being Self Employed means hat friendly.    My DH shaved his head 2 weeks ago and he actually looks great. He is 34 and that style works for him.  He has a nice shaped head for it also.   I am so glad that we have this forum to be able to vent whatever our feelings are. We seem to be very strong, wonderful woman that have to fall back a few spaces at times.  We have lessons to be learned from this experience and different lessons to each of us.  Not sure right at this moment what mine are but just take a few moments each day and think back to what kind of person we were a year ago or even 6 months ago and see what has changed in each of us.  See what good we can pull out of this and make our lives better after all this is behind us.  I have already said that I am going to travel more and enjoy life way more than I did 6 months ago.. I am going to take at least 3 showers a day instead of one, I am going to shave my legs each day until the hair is gone, and I am doing RETAIL THERAPY (shopping) every time I can to make me feel better... Hats off to all of us for getting through each day, smiling more, and sitting back with our feet up wondering why the hell we are going through this and what are lessons are.... Each and every one of you have inspiring words and you make it a great day when I turn on this computer and read what everyone has gone through to this day and how we are all getting through it... Be strong! tbb",
      "MessageIndex": 247,
      "PostDate": "12/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 26, 2009 05:12PM TBB wrote:",
      "MessageIndex": 57,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 29, 2009 03:05PM TBB wrote: Oh and 1 more thing... I know we have all shared what/when we were diagnosed with and when we are all starting chemo and our thoughts about chemo but one thing I would like to know more about is the experiences of what each of us had as treatment i.e. surgery, lumpectomy etc... or is that for another topic....?  Not sure if everyone would be interested in doing that... :) tbb",
      "MessageIndex": 73,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Apr 1, 2009 02:39PM TBB wrote: Sakura:  I am so proud of you that you made it through the first couple of days.... (not sure how your time works there)  I hope that everyones 1st treatment goes as well as yours.... To all:  My mom told me a really neat thing to do that one of her clients that had gone through BC a few years ago did.  Get a calendar and go backwards with your treatment dates.... Say like this is your 6th one and only 5 more to go... Look at it as a positive number..... just a thought but I think I will try it and see if it is easier.  ANYTHING to make each treatment easier... best of luck to all of those that are starting treatment this week... many prayers and positive thoughts !!!!! TBB ",
      "MessageIndex": 103,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 26, 2009 01:55PM TBB wrote: tulipbebe Dx 01/19/09, ILC Stage IIb, 9+nodes rt and sent lt +, ER+/PR+, HER2- I thought I had done this at the beginning... :) ",
      "MessageIndex": 52,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 18, 2009 03:16PM TBB wrote: Hi to all, I will be starting Chemo in the next few weeks and have been given a few options by one onco.  I am planning to get a second opinion from another on the 27th of March and was wondering everyones thoughts on the second opinions or if it just gets more confusing on what treatment to go with.  TAC was the highly aggressive, highly recommended treatment but the side affects of the Adriamycin were very scarry..... Heck it is all scarry because diagnosis to treatment has only been 2 months... What are thoughts on Radiation as well... No fertility here either since had to have partial hysterectomy at 37... :( ",
      "MessageIndex": 3,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 26, 2009 03:47PM TBB wrote: Ok first question of the day to all is \"What is DH\"?  I have to get with the BC lingo.... Also why do some call them \"FOOBS\"?  I have figured out some of the abreviations but not all yet.... Florida here..... Sakura: GREAT HAIR!!!! Thanks on the tips for chemo shopping... Not sure when I start but should be soon.... meeting with Onco tomorrow... Also has anyone at all experienced SEVERE itching in between the breasts after surgery?? I have tissue expanders, no rash or anything and no redness.. just itching.. Onco thinks it could be from healing or expanding.... ITS CONSTANT!!!!!  Any thoughts...?",
      "MessageIndex": 55,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Mar 29, 2009 03:01PM TBB wrote: To all about crying and coping and laughing: (Nadine) I just want to note that I cried because of your words Nadine not because of what we are all going through..You have a way with words... It is the support from the husbands, the family members etc. that make this situation with BC more bearable. It was how that post was expressed.  (very nicely)  Meds are great for some but it is just adding something more to the body to react too and for our body to defend.... I have a hard time taking Excedrin... again it depends on the person and what they need or can handle... On the other hand I have come to find that my BC has taken away the attention that another family member has recieved in the past and that \"person\" and I are no longer getting along very well... has anyone had that experience? Sakura: I wish you well on Tuesday and hold that head high.... positive thoughts and prayers are with you!  I cut my very long hair yesterday to a very short cute bob... My daughter is in cosmetology school and she did it for me.... after seeing your hair I thought it was time... I start chemo TACx6/18 weeks in 2 weeks.... Didnt think there was a point in waiting for the hair... :)",
      "MessageIndex": 72,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "May 11, 2009 06:57AM TBB wrote: Hi to all the Ladies.. and the new ones. WOW how many new to the group... it is amazing... I have a WONDERFUL STORY that helped me tremendously! Several weeks ago I did a post about Cancer Treatment Centers of America if anyone had heard of them or checked them out.. There are only 4 centers in the US.  They treat cancer conventional along side natural medicine to help with side effects etc.  So I went to Oklahoma for a week and started treatment there while I was there because I fell in love with the place. Also finding out that I had been Stage IIIA with both breast tumors over 6 cm... HUGE! I started my chemo 11 days ago and have had NO side effects at all.  I did have heartburn for 2 days following treatment but found out that it was orange juice and peanuts that were causing that and have not had it since. I flew home to Florida 2 days after treatment.  I had my first counts done and they were good. I have not had to have to the Neulasta shot either.  Those are all put on hold depending on what your counts are. It is not an automatic get the shot like most of our docs do.  I started AC x4.  I go back there every 3 weeks for a total of 8 treatments.  I also met with an Naturopath and Nutritionist which has HELPED in so many ways.  I have been put on supplements to build the heart muscles from the side effects of the chemo.. L-carnitine and Coenzyme Q10 and the Melatonin 20 which helps the immune system.  I have not had to take anything else.. There has been NO constipation or anything.  If your doc says nutrition is not a big deal, PLEASE research and know that it is.  I have cut out sugars (ice cream, choc, processed foods) from my diet and it seems to have helped out the most.   I just wanted to share this information with everyone (Insurance pays for your flight and everything) because it is an amazing place... My 1st treatment was the 29th of April and I still have hair also... has not started falling out yet but I know I am counting the days for that.. if that is the only SE bring it on!!!!!!!!!  Water, water, water I can say is the best BUT to much will through your body off so my nurse told me about G2 (gatorade with less calories) that helps and does not have as many sugars.. While you are having your chemo if you can get about 50 oz of water down you that helps too... I was told that DocQlax (spelling) helps with constipation also... has anyone tried that?  I am glad to hear that everyone is handling the treatment.. It is a tough road but we are getting down that road the best way we know how... thumbs up to our strength and keep on fighting...",
      "MessageIndex": 681,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "May 11, 2009 07:01AM TBB wrote: Oh wait I did forget to mention that with cutting out sugars like ice cream, choc etc. I have lost 13 lbs since I had my 1st treatment (no steroids either) but this is all good weight loss not bad.... that has helped the spirits also!",
      "MessageIndex": 684,
      "PostDate": "11/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Apr 20, 2009 05:47PM TBB wrote:",
      "MessageIndex": 360,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TBB",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81080/profile",
      "Content": "Apr 22, 2009 03:56PM TBB wrote: Can someone please comment on my post from a couple of days ago... Just an acknowledgement would be helpful even if you have not heard of this place.... Its not about chemo, or hair loss, or port placement, or side effects... it is about a cancer treatment center I looked into and thought anyone from here may have heard of it.... Hope everyone had a great day! :)",
      "MessageIndex": 405,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    }
  ]
}