{
  "AuthorID": "tbird57",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
  "Posts": [
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Dec 17, 2008 09:01AM tbird57 wrote: Joia, your hair looks FABULOUS!  So I may still lose my lashes and brows, even though I finished chemo on the 4th?  That really sucks.  And my hair might not be the same color?  That sucks too.  And FACIAL HAIR?  What's that all about?  Geez.",
      "MessageIndex": 926,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "May 2, 2009 09:25AM tbird57 wrote: My husband told me my hair is \"lopsided\" 5 months after finishing chemo and still doing herceptin.  It's about 3/4\" long, thick and curly.  I told him I was thankful to HAVE hair!  All the people I work with tell me it looks great and that I should put gel in it and finger wave it, like a 1920's style - how the heck do you do that?  Teena",
      "MessageIndex": 1782,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Feb 17, 2009 04:30PM tbird57 wrote: Otter, hair looks awesome!  Was your hair that curly before?",
      "MessageIndex": 1262,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Dec 28, 2008 12:18PM - edited Dec 28, 2008 12:19PM by tbird57 I finished my chemo on 12/4 and every day my DH checks my head for new growth, LOL.  He swears he can see it coming, but I can't see a thing.  I second the old, fat, ugly feeling - it's amazing what effect the lack of hair has on my psyche.  In the New Year, I'm going to try to get moving more - I'm hoping that will help. Wishing everyone a better, happy, healthy and blessed New Year!   ",
      "MessageIndex": 978,
      "PostDate": "28/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 11, 2009 12:09PM - edited Jan 11, 2009 12:10PM by tbird57 Can't wait to get hair again...I'm about 4 weeks past last chemo, and nothing yet.  I haven't lost my eyebrows or eyelashes, they're thinner, but still there.  But I really want my regular hair back!  And I want it to be like it used to be!  I never had much going for me in the looks department, except my long, thick hair.  Now I look like Uncle Fester.",
      "MessageIndex": 1042,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 1, 2008 11:51AM tbird57 wrote: I found that just cutting your hair short and letting it do it's thing was a better choice for me than shaving.  At least some hair around the ears and stuff with a scarf on seems to look a little better, but it's such a personal choice. What really tries my patience are these insurance companies who claim that they cover cranial prostheses (wigs) but then tell you to use an \"in network provider\" but they can't tell you which if any medical equipment companies in their network to call - BC/BS is giving me referrals to wheelchair and respiratory therapy companies!  Just try to get reimbursed - you have to jump through hoops. ",
      "MessageIndex": 521,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 11, 2009 04:17PM tbird57 wrote: Otter, you made me laugh, and you really hit the nail on the head.  I don't recognize ME and that's who I'm looking for.  Like you say, it's a little bit me, but I need my hair back to be \"normal.\" I've had the same hair, more or less, my entire life and it's part of who I am.  I want it back! ",
      "MessageIndex": 1046,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Feb 10, 2009 06:26PM tbird57 wrote: Really interesting so I thought I would share that I never completely shaved my head, and I never lost every strand of hair.  I left about an inch or two, and it was really sparse with my scalp gleaming through but not completely bald.  Now that I have a 5 o'clock shadow on my head 10 weeks past chemo, those \"old\" hairs are falling out!  Isn't that kind of weird? Why didn't they fall out before?  It looks really funny with the dark blond \"long\" strands and the blackish-gray shadow coming in.",
      "MessageIndex": 1221,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Dec 15, 2008 11:16PM tbird57 wrote: Hey girls, I've finished my last chemo (4 of TCH) almost two weeks ago and I still have eyebrows and eyelashes!  Woohoo!  Should I be excited and does this mean I won't lose them?  I still have even a little bit of hair on my head, even though my DH says I look like Fire Marshall Bill.  LOL Take care all! ",
      "MessageIndex": 912,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 1, 2009 12:38PM tbird57 wrote: Lauren, at least it doesn't look like \"Fire Marshall Bill\" from the old show In Living Color - does anyone remember Jim Carrey in that role with his tufts of hair randomly sprouting up from his bald head?  That's me!  LOL  I never shaved it all so I still have some strands... Happy New Year!  God Bless us every one.",
      "MessageIndex": 994,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Sep 30, 2008 10:13AM tbird57 wrote:  Eileen, how did it go yesterday?  I'm starting on Thursday and want to hear your experiences. Fammy, I was told a 24-hour Claritin plus one Aleve the day of plus 3 days after for the Neulasta shot would help - and that it HAD to be Claritin. For sleeplessness, the nurse said I could take benadryl or a tylenol pm, but advised me to wait and see if it was needed. Teena ",
      "MessageIndex": 68,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 11, 2008 01:51PM tbird57 wrote: Hi Pageroo and welcome! I had my first tx (taxotere/cytoxan/herceptin) on 10/2!  How are you doing?  I've been working full time, a handful of annoying side effects, but not too bad.  I'm with you on waiting for hair loss and the proverbial other shoe to drop...I'm counting down to DAY 14 as that seems to be the day many of us start to notice it coming out...which puts me at Wednesday and you at Thursday.  My husband thinks mine won't come out because it's so long and thick and so doesn't think I should cut it yet...I hope he's right.  I was told by others that, to get by with your own natural hair as long as possible, cut it short like you've done and then when it starts coming it, it's not as noticeable for a longer time.   Our local ACS here in Phoenix offers free wigs, hats, scarves, etc. and the office is on my way to work, so that's the plan when it starts coming out...or else my other strategy is to wait for the after halloween sale at Walgreens and pick up an assortment of cool wigs - rainbow, metallic, Elvira-type, etc.  Why not be FABULOUS? Peace and love to all, Teena",
      "MessageIndex": 152,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Sep 28, 2008 02:23AM tbird57 wrote: Hi Fammy, Thanks for the tip about the tea tree oil - I haven't heard that.  What do you do with it, rub in on?  I have biotene on my list of stuff to get before next Friday.  I'm also going to try the Claritin to avoid bone pain. Prayers for all, Teena",
      "MessageIndex": 55,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 6, 2008 02:57PM tbird57 wrote: Happy Monday to everyone, My first TCH (taxotere-cytoxan-herceptin) tx was last Thursday, and so far, so good, except for some swelling in my legs and a little bit of nausea last night.  I hadn't taken two of the three meds the onc had prescribed for nausea -- only the Emend -- but took both last night and I'm better today.  The swelling is uncomfortable, though, and I'll call today to see what I can do about it.  Has anyone else experienced that?  I'm also feeling \"hot and cold\" spots - weird - one side of my face is hot, and one side is cold.  But all in all, I'm okay.  I went to buy groceries yesterday, and I've been cooking dinner for us, laundry, etc., so I'm functioning. On my way to work today.  My best to all! Teena ",
      "MessageIndex": 103,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 18, 2008 09:43PM tbird57 wrote: Thanks Annie, for compiling our list.  Hope your SEs are minimal from your second tx.  Love your hat!  I wanted to get that one from headcovers.com, too, because jeans are my uniform whenever possible and I figured I would get lots of wear out of it.  I really haven't purchased anything but one scarf \"in case\" -- but my hair is still hanging on. It's day 17 following tx#1, and almost all of it is still here.  More than usual is stuck in the brush, but it's not falling out in clumps or anything close to that.  Knock on wood. Elizabeth, Linda and strongmom37, hang in there, and anyone else feeling wiped out.  I hope you feel better soon.  Bluedasher, glad your MUGA is fine - onward! Teena    ",
      "MessageIndex": 233,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 14, 2008 08:45AM tbird57 wrote: ggoff0124, I wish I had some of what you got!  LOL, you always sound so wide awake!  Send me a PM with the recipes.  The brownies sound fabulous, but the cheese squares - OH YEAH.  Never heard of cowboy candy, but it sounds like something my husband would adore.  About the hair thing, my hair is still here (day 13) but it also feels kind of lifeless and like straw.  Also my scalp tingles and itches every once in a while; weird.  But all in all, I feel pretty good and almost normal.  So I can't complain too much.  Lisa, welcome, and I hope chemo goes well for you with minimal side effects.  The first tx is the hardest, I think, because it's unknown.  Once you're into it, then it's just about dealing with it on an ongoing basis.  Hope all goes well for you this week and next. My second tx is the 23rd. Well, it's almost 6 am and I gotta get ready for work.  Have a great day, everybody. Teena ",
      "MessageIndex": 178,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 29, 2008 12:09AM tbird57 wrote: Sorry to hear of those plagued by diarrhea.  I usually get it on day 5 or 6 following tx.  When it happens, I take only 1 Immodium or else everything gets plugged up.  If you get the runs, be sure to drink lots of extra water.  I didn't do this the first time, and had terrible charley horses in my calves for two nights in a row until I figured out it was from dehydration and fixed it. And I would add EXERCISE to Anne's Chemo Tips.  My radiation oncologist was telling me today that the reason Lance Armstrong beat terrible odds was the exercise - forcing the chemo to circulate fiercely through his body is what did it, she believes.  Love to all, Teena",
      "MessageIndex": 376,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 1, 2008 10:48AM tbird57 wrote: Welcome, {{{{Cheryl}}}}.  No odd fits here!  We're here to support and help each other through this.  My daughter lives in Barrie, by the way, up there in your neck of the woods. Elizabeth, how are you doing?  Rads AND chemo at the same time?  That's a lot to take on.  I hope you're okay.  Annie I know we will meet all of our loved ones again one day in a better place.  Have you ever read 90 MInutes in Heaven?  If not, and you believe his story, it is comforting to know that we will see them again.  I understand completely what you're saying about inner peace.  Our loved ones who've faced mortality before us inspire us with their courage and strength.  My feelings are so very much like yours.       Peeps, I hope you feel better soon.  And dealing with medical stuff is so frustrating.  It sounds like their system isn't too efficient.  I have an appointment calendar where my onc has booked all my chemo appointments at the outset.  Why wouldn't they, when they know what the tx schedule is and how often you need to come in?  Weird.  And I appreciate your comments about my son, Shane.  My son had an amazing, loving spirit, a sharp wit and a great sense of humor.  He was a great dancer, too - and I know he's got those angels dancing their wings off! Hope RockFan, Elizabeth and everyone else who had tx this week are doing okay.  My prayers and positive thoughts are with you.  Love, Teena",
      "MessageIndex": 411,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 20, 2008 09:32PM tbird57 wrote: Hi Deb, try Miralax in Crystal Lite, juice or water the evening before chemo, and for the next 3 evenings after.  It helps me, and it's really gentle.  (NOT Ducolax - that's strong stuff.)  I get really tired in the evenings but soldier through.  About 4 days after is the worst and then it gets better.  Like bluedasher says, the quality of your sleep matters.  I've been able to work; fortunately I haven't had any business travel and won't have any until the end of January, so that's a relief. Cheryl, I also did the LGFB program.  I was kind of disappointed that there weren't any professional cosmetologists to give expert makeup tips at the session I went to, because NCA (Nat'l Cosmetology Assn) is a partner in that program.  But the makeup is quite high quality and very nice to receive.  Maybe it's a bit different in Canada, because all that we received in our bags was makeup and moisturizers.  My daughter is here in Phoenix visiting from Barrie and enjoying the 85 degree weather.  She is pregnant, and the health care in Canada is really good.  Her only complaint is that sometimes you have to wait a little bit for an appointment, but I encounter that here, too, all the time. ",
      "MessageIndex": 611,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 1, 2009 12:46PM tbird57 wrote: Wishing everyone a happier, healthier, peaceful and abundant New Year.  God Bless us every one!",
      "MessageIndex": 736,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 2, 2009 01:24PM tbird57 wrote: Kristi, I'm having peripheral neuropathy in my left hand/fingers (and I'm left-handed).  The onc prescribed gabapentin (Neurontin) but so far it's not working.  I'm worried about it because sometimes the numbness doesn't go away and causes permanent nerve damage.  And it's hard to write and do small motor things with my left hand now.  So don't let it progress - have it checked out right away.  Numbness in fingers/toes is a side effect from taxols, as you say.",
      "MessageIndex": 742,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 7, 2008 07:09PM tbird57 wrote: Hi everyone, Good wishes to all on upcoming tx.  Elizabeth - As far as being in the chair, I would guess about 3.5 hours for TC?  Premeds, \"T\" and then \"C\" .  At my onc, they do the first infusions slower so subsequent ones may be faster...that's my VERY inexperienced guess-timate. ",
      "MessageIndex": 109,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 9, 2008 04:15PM tbird57 wrote: bluedasher - regarding the \"C\" question in TC - see this study about the \"C\" - http://www.breastcancer.org/treatment/chemotherapy/new_research/20060217.jsp  but I have seen studies refer to the \"C\" as either carboplatin or cyclophosphamide (cytoxan).  I think both are used in breast cancer treatment, but it is confusing when your oncologist refers to \"TC\" treatment and the \"C\" component can refer to two different elements.  I think cyclophosphamide may be used more often in breast cancer, and carboplatin in lung/ovarian/head/neck cancers, but not being an oncologist, my lay knowledge could be very mistaken!  I know lots of people do get the carboplatin.",
      "MessageIndex": 130,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Sep 27, 2008 02:32PM tbird57 wrote: Hi to everyone! I'm starting my chemo on 10/3 -- TCH followed by Neulasta -- and wishing us all the most positive, smooth experience we can have.  There are some great threads on these boards!  The advice I've received has really made me feel more prepared.  I am particularly worried about mouth sores and vaginal sores and hope to avoid them at all costs.  Also, neuropathy is a concern so hope I don't experience that. Suzy:  for a detailed description of the port placement, which I just had done yesterday afternoon, see my new thread on PORT PLACEMENT: DETAILED DESCRIPTION in the CHEMOTHERAPY board. I know we can help each other through this!  Love and peace to all, Teena",
      "MessageIndex": 52,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 9, 2008 02:58PM tbird57 wrote: Hello to all October gals, Elizabeth, don't be scared!  I was anxious but the reality was really boring and uneventful.  It will be okay.  The side effects after can be annoying but all in all less than I anticipated.  ggoff0124, Prayinghands, Threegirlsmom and Jenn46 - hope all goes well today and wishing you the best. For those hours in the chair, I highly recommend a hysterical new book:  \"Lopsided. How breast cancer can be really distracting. A memoir by Meredith Norton.\"  The author is witty, clever and refreshingly frank about what she went through.  Check it out - you'll love it.  It's a very fast read too. \"Chemo teaching\" was a joke.  The young nurse who tore herself away from something else to talk to me was awful - she kept saying, \"mmmm-kay?\" (like the teacher on South Park) as she read the side effects from sheets of paper on each chemo drug and then stated, \"you WILL lose your hair!\" and looked at me like I was supposed to melt down or something.  I just said, \"yes, next?\"  Then I told her I could read the papers as well as she could.  I asked her several questions about why condoms were necessary and she couldn't answer any of them - it was clear she didn't want to be there and wished I would shut up and let her get back to work.  Then she left and someone else came in to finish.  This board is my chemo teaching and has WAY better and more thorough information than I've encountered anywhere else. bluedasher - see my post on port placement pinned to the top of chemotherapy thread - I tried to be as detailed as I could in the description of the procedure. Best to all, Teena",
      "MessageIndex": 128,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 10, 2008 09:33AM tbird57 wrote: TGIF! So glad to hear from those who made it through tx yesterday, and best to all for today.  You are in my prayers. I'm having a really painful side effect - for the last two mornings, I have had a muscle cramp in my calf, first the right, and early this morning, the left.  These are extremely painful although it only lasts about a minute or so.  But it's still tender.  Has anyone experienced this?  It stinks. bluedasher, not surprising I've misread something - the ole brain ain't what she used to be.  My apologies.  Ditto on the bathroom break during chemo, you just drag the pole with you.  I think I had to go 5 times in 5.5 hours and my husband thought I was a bit odd.  He's right. ggoff0124, congrats on finishing tx #3.  And I gotta say, you sound WIDE awake!  Go, girl! Oh well, off to work.  TGIF! Love and peace, Teena",
      "MessageIndex": 140,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 12, 2008 01:11PM tbird57 wrote: Jen, that first experience sounds pretty scary; I'm glad it stopped and you were able to finish the treatment and now just have to deal with crappy side effects.  Dee, happy to hear that your tx went okay too, and hope everyone else is doing okay today. Gaylynn, I love to cook, too - and to eat.  Have any good recipes to share? Welcome to Linda!  We are on the same tx schedule.  How are you feeling now?  At day 11 after the first one, I feel pretty good and I still have hair.  My husband doesn't think it's going to come out so I'm humoring him and just waiting to see what happens.  I really want to try to exercise more.  It's so beautiful now in Phoenix; a week ago it was nearly 100 in the day, but it's dropping and this weekend it's been close to 80 or less, so I need to try to get out and walk to keep everything working well.  Water and exercise, water and exercise, those are what I need to do more of!  I gained 3 lbs in the week after my first tx - bummer. Good wishes to all, Teena",
      "MessageIndex": 160,
      "PostDate": "12/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 23, 2008 03:09PM tbird57 wrote: Hi Everybody, Just a fly-by!  Off to my chemo today.  I guess I didn't make the list - Annie, can you add me? I hope everyone having treatment today has an easy time, and for those not feeling too great, I hope that gets better soon.  I've been so busy with work, haven't been posting this week.  I'll catch up soon. Best to all, Teena",
      "MessageIndex": 304,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 26, 2008 11:17AM tbird57 wrote: I don't have great veins, so I'm grateful for the port - one poke and I'm plugged in.  With regular IVs, my hands often blow up, they need to do multiple sticks, etc.  So the port is a blessing. As far as the Neulasta goes, I don't mind taking it if it prevents my white count from going too low.  My bloodwork on Thursday showed my WBC at 11, which is okay, but my red count is low.  I tend to be anemic, so that's a concern for me - we'll see what happens with that.  Also, I've been flirting with menopause for nearly two years (I'm 51), and I can't believe I just got a period yesterday!  Good grief.  I thought the chemo was supposed to make them stop.  Anyone else experience this?   Combined with the nosebleeds I get every so often, I'll have it running out both ends when I NEED that stuff! Hope everyone with tx this week does well along with the best for all of us! Teena",
      "MessageIndex": 348,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 20, 2008 08:26AM tbird57 wrote: Annie, don't forget me and Linda and Bourscheid.  I have tx#2 on Thursday.  Does your second tx feel like your first?  I thought I was doing good as far as hair loss goes, but as of tonight (day 18 following tx#1), it's coming out as I run my hand over it.  Bummer. ggoff0124, Hallelujah! that's good news.  Elizabeth, I'm praying for you with all positive energy. What is everyone taking for nausea?  I have 3 scripts - Emend, Compazine and Kytril.  I want to drop the Emend and just take the other two (because there are generics for those and cost less). Please tell me what you are taking, if you know what they give you for nausea in your infusion, and if your routine actually works.  I only had one moment of nausea on the night of day 3 - but suffered way more from stomach burn and acid.  I'm going to add prevacid to the mix this time if it's the same. Peace and love, Teena",
      "MessageIndex": 242,
      "PostDate": "20/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 30, 2008 05:07PM tbird57 wrote: Hi Annie, It must be difficult sometimes to do this without your spouse.  And watching someone you love fight a battle alone when you want to help them with everything you've got but can't, can make you sad, or angry, or both, while being humbled by their strength and courage.  I'm 51 too, by the way.  And thanks for the compliment on this old scarf!  It's tie-dyed motif, and I like that. Thanks for your amazing spirit!  Peace and love, Teena",
      "MessageIndex": 394,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 20, 2008 08:29AM tbird57 wrote: Annie, don't forget me and Linda and Bourscheid.  I have tx#2 on Thursday.  Does your second tx feel like your first?  I thought I was doing good as far as hair loss goes, but as of tonight (day 18 following tx#1), it's coming out as I run my hand over it.  Bummer. ggoff0124, Hallelujah! that's good news.  Elizabeth, I'm praying for you with all positive energy. What is everyone taking for nausea?  I have 3 scripts - Emend, Compazine and Kytril.  I want to drop the Emend and just take the other two (because there are generics for those and cost less). Please tell me what you are taking, if you know what they give you for nausea in your infusion, and if your routine actually works.  I only had one moment of nausea on the night of day 3 - but suffered way more from stomach burn and acid.  I'm going to add prevacid to the mix this time if it's the same. Peace and love, Teena",
      "MessageIndex": 243,
      "PostDate": "20/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 25, 2008 10:11AM tbird57 wrote: Hi everyone, Bluedasher, how's the port?  Hopefully you're feeling much better by now.  It is uncomfortable and I fasted too until they did my procedure at 4:30, only to refuse the sedation anyway, so I could have eaten!  But anyway, it's over and on to the next challenge, right? Kathi, glad you're feeling well.  Did you do the Aleve and Claritin 24 hour with the Neulasta? Thanks Unique for the well wishes.  Tx 2 was okay, no benadryl thank goodness - don't like that drowsy feeling - and the whole thing was over in 3.5 hours instead of 5, so I was happy and so was my husband!  We bring the laptop with dual headphones and watch a movie to pass the time, then read (me) or play computer games (him) for the rest of it.  As far as the hair saga goes, mine started on day 14 following tx 1 with a few extra hairs in the brush.  It wasn't really until day 18 that bigger strands started coming out, and by days 19 and 20 I was driving home from work throwing handfuls of hair out the window.  But my hair is VERY thick and so I still had hair - it seems to come out more from the top and front and clings on more over the ears and around the back.  On day 18, I cut it to above shoulder length, and last night, day 23, I had my husband crop it with the clippers to 1\" on top and 1/2\" around the sides.  So I still have hair but it's pretty thin on top and VERY short.  I went to the American Cancer Society in my area and they give you a free wig but none of them worked for me - they had lots but mostly gray and shorter, and not really high quality either.  So I think I'll have to buy one, although most of the time scarves and hats will do.  Lori, glad you found one you like. amezamom5, I'll be in your neck of the woods at the end of January for a trade show at the convention center which my office hosts.  I love the waterfront in Long Beach on Ocean.  Gorgeous!  ebann (Elizabeth), I'm right around the corner from you in El Mirage.   Who are your doctors?  My oncs are at Palo Verde, Dr. Sharon Ondreyco.  My fabulous surgeon was Dr. Brenda Moorthy (after consulting both Drs. Victor Zannis and Ed Donahue). Best wishes and prayers to everyone with tx this week.  Love and prayers, Teena",
      "MessageIndex": 333,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 25, 2008 05:02PM tbird57 wrote: Enjoy your nap, Cheryl!  I'm a little tired too after 2nd tx Thursday, Neulasta Friday, but I'm gonna BBQ in about 3 hours, and then go to the movies with my hubby.  I feel compelled to do some housework, but not really feeling like it...maybe throw in a load of laundry and doze while it spins...lol",
      "MessageIndex": 337,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 11, 2008 09:05AM tbird57 wrote: Hi Annie,  I have tx #3 on Thursday this week... I went to a Look Good Feel Better session last night.  It was nice to receive the bag full of makeup.  I wish they had a professional cosmetologist there to provide some tips...but the free stuff is appreciated. T",
      "MessageIndex": 524,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 11, 2009 11:52AM tbird57 wrote: Lori, how absolutely wonderful, God is good.  That is fantastic news. So glad you're doing well. plakatakr, thanks for the info about neuropathy.  Most of my left hand is a numb stump except for the periodic stabbing pains in it, and also some numbness and pain in the right hand, so it's not fun.  I'm seeing a neurologist in a couple of weeks to see what can be done. Hope everyone else is feeling okay and fighting the good fight.",
      "MessageIndex": 764,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 25, 2008 11:03AM tbird57 wrote: Bluedasher, take the dressing off.  At my chemo teaching, they said it doesn't need to be on.  About hair - I took my hair from 12\" length, to just above shoulder length at day 18, and last night to 1\" on top and 1/2\" on sides.  I wouldn't shave it all off because it just feels better to have a little hair than no hair, I think.  You're probably good as you are for the next 2-3 weeks, then buzz it short and see what happens.  The lint roller on the head tip is a good one for picking up loose hairs.",
      "MessageIndex": 335,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Oct 30, 2008 05:42AM tbird57 wrote: Elizabeth, I know exactly what you mean. When my son passed away in in July from brain cancer, I learned so much.  If I had been going through my own breast cancer without witnessing what he endured, I may have felt like my own situation was all-absorbing and been unable to see outside myself.  But seeing him go through what he had to deal with such as not being able to move since February, or go to the bathroom without help, or feed himself -- and still keeping the most amazing grace and spirit, thinking about his younger brother and sister and worrying about their wellbeing without complaining about his own suffering --- I feel like I can face anything God has in store.  Truly.   We are all so involved in our own worlds.  But we are really just grains of sand in the time and space continuum of life and consciousness, awaiting a new awakening in soul and spirit.  Watching your oldest child die slowly helps you realize lots about life and death, the human condition, and the nature of people.  Sorry if that depressed anyone.  I don't mean it to.  My son was an amazing person and I only hope I can follow his example of love, grace and strength when my time comes.  ",
      "MessageIndex": 386,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 1, 2008 11:05AM - edited Nov 1, 2008 11:05AM by tbird57 My hair is so thin I can see my scalp through it, and it rains down every time I touch it.  It's looking pretty ugly.  But then I think of what India.Arie says: I am not my hair I am not this skin I am not your expectations no no I am not my hair I am not this skin I am the soul that lives within",
      "MessageIndex": 412,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 19, 2008 08:15AM tbird57 wrote: Annie, it's a sad situation when we have to figure out how we're going to get medical care in our golden years.  And our not so golden years, for some of us.  I have BC/BS, which is considered good insurance, and with my out of pocket and deductible, I'm still looking at $5,000 for 2008 and 2009.  My heart goes out to anyone who not only has to deal with illness, but then has to figure out how in the world they're going to pay for it. Best to all having tx this week and recovering from tx last week and looking at upcoming tx next week.  My daughter is here in Phoenix from Toronto, visiting, and I'm so thankful for her presence!  She is pregnant with my first grandchild, so we're excited.",
      "MessageIndex": 602,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Nov 20, 2008 08:29AM tbird57 wrote: On the hats and headgear topic - if you haven't requested your free hat package from heavenlyhats.com, you should.  This is a great organization that will send you a box of hats, absolutely free, upon request.  They sent me great hats, all new (and very high quality - Ralph Lauren with the tags no less). Also, I have patterns for snoods and berets that are easy to sew with remnants if you're crafty.  I made a beautiful snood out of stretchy crushed panne velvet that I get SO many compliments on.  Plus, it looks like hair because it hangs down in the back.",
      "MessageIndex": 609,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "tbird57",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70654/profile",
      "Content": "Jan 2, 2009 01:19PM tbird57 wrote: Cheryl, my goodness, you have every reason to feel as you do and don't feel bad about it one bit.  Try to find some kind of joy in every day - and it sounds like that's what you are already doing anyway.  Just do the best you can.  I hope you are feeling better very soon.  And Sobx, you keep on taking care of YOU and do whatever brings you peace and comfort.  Things will be better in 2009. Praying for everyone and happier, healthier days ahead.",
      "MessageIndex": 741,
      "PostDate": "02/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    }
  ]
}