{
  "AuthorID": "TCLOVE",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192285/profile",
  "Posts": [
    {
      "AuthorID": "TCLOVE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192285/profile",
      "Content": "TCLOVE wrote: Hi there, my name is Christina & I'm 33 years old. I recently had my 1st mammogram bc I had drainage from my nipple. The mammogram showed that my breasts are heterogeneously dense (which being 33 I figured they'd be dense). And microcalcifications seen in both breasts. RUOQ; lef o'clock segmental. BI-RAD 3. I'm aware that 80% are benign, yeah!! Here's a little more back history. My mother died at 33 from ovarian cancer & this past February I went for genetic counseling, the gyny oncologist & breast oncologist labeled me as high risk & I even had the BRCA 1&2 test done (but didn't go through with it bc ins. only covered half the bill so I had to pay $2,000.) My question to all of you experienced ladies is what are the right questions I should be asking? I meet with my ob/gyn next Friday 13 (dun, dun, dunnnn), Lol. How do I make sure I'm not part of the 20%? Should I take my mammogram results to the specialists? As for now the plan is 6 month mammogram & US. Any advice is greatly appreciated!! Thanks!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815359",
      "Title": "What should I be asking? TCLOVE MelissaDallas"
    },
    {
      "AuthorID": "TCLOVE",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/192285/profile",
      "Content": "Dec 4, 2013 08:53PM TCLOVE wrote: Thank you for your reply. I like to be proactive & my ob/gyn has always wondered if my mom would've/could've had breast cancer. Her side of the family has had a lot of cancer. I currently have a cousin with breast ca. The radiologist talked so fast, & she assumed I knew what she was talking about, lol. (I didn't expect to talk to anyome). She said we have to keep a close eye on this & possibly do a bx in 6 months. Thanks again.",
      "MessageIndex": 2,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/815359",
      "Title": "What should I be asking? TCLOVE MelissaDallas"
    }
  ]
}