{
  "AuthorID": "teachgrade3…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75638/profile",
  "Posts": [
    {
      "AuthorID": "teachgrade3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75638/profile",
      "Content": "Nov 30, 2008 08:57PM teachgrade3 wrote: My onco is checking in on insurance coverage for Oncotype testing. I'm not really a candidate because I had a pos. node.  The cost is $3500 and my husband said he will pay it if insurance doesn't. I think the studies for Oncotype are on Stage I & II node neg AND on node pos post-menopausal.  I'm Stage IIa, one node pos, pre-menopausal. If I can get Oncotype I will but it will postpone treatment until that comes in. I heard it takes 12-14 days.",
      "MessageIndex": 104,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "teachgrade3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75638/profile",
      "Content": "Nov 30, 2008 07:46PM teachgrade3 wrote: I might be starting chemo in December if I decide to do so. My onco told me that I need to choose whether to get chemo or not. He gave me all the statistics. I had a lumpectomy and had one sentinel node positive for a micromet. I will get radiation which will put my chance of recurrence at 25%.  If I get Tamoxifen also (which I am definitely getting) for 5 years, the recurrence goes down to 17%.  If I add chemo, it goes down to 11%.  So I guess he wants me to weigh the 5-6% benefit with the negative side effects. Do I want chemo? NO, but I don't want to spend the next 10 years wondering if I made a mistake. If I do have a recurrence, I don't want to blame myself because I could have done something more.  I'm so confused!",
      "MessageIndex": 98,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "teachgrade3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75638/profile",
      "Content": "Jan 3, 2009 09:52PM teachgrade3 wrote: Mombos- Sounds like you are on the same schedule that I'm on. I almost felt like I was reading my own post! I too had pain from Neulasta. It nearly made me cry. It took a couple days, but warm baths and Advil (600 mg) helped.I also thought I was going to be one of the lucky ones not to lose my hair and then I started to see that when I grabbed a handful of hair, 10 or more strands pulled right out. I knew this day would come and now it's hear and now I freaked. You all seem like you handled it really well. I'm trying to follow your example. I guess I'll handle it like I've handled everything else - with my head held high! Did you all just take the clippers to your hair? Did you have a guard on them? I think I'll have my son buzz me tomorrow. We go back to school after a 2 week break on Monday.",
      "MessageIndex": 803,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    },
    {
      "AuthorID": "teachgrade3…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/75638/profile",
      "Content": "Jan 1, 2009 07:43PM teachgrade3 wrote: I have been online reading all your postings for several weeks now. You are all inspirations and your personal experiences are so helpful. I got my first treatment of TC on Dec. 19. (2nd is Jan.9)It went pretty well. Mostly felt real tired and in a chemo fog. The Neulasta shot gave me some sharp pains in my ankles after a few days and then on Christmas Eve I had horrible lower back pain almost bringing me to tears. It's been about 13 days and I still have hair. I am feeling some pain in my scalp. I've heard that's a sign. I teach school and have been out for Christmas vacation since I started my treatments. I'm hoping the hair comes out before I go back on January 5. I went to a wig/hat/scarf shop and tried on all kinds of headwear. The woman who owns the shop liked the way I looked in almost everything and asked me to model them for her website! She said I'll get some products in exchange for my time. I got some scarves and caps so I'm ready for the big reveal. Thanks again for letting me listen in on your postings. You've been a big help in my experience.",
      "MessageIndex": 753,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/724619",
      "Title": "Has anyone started a forum for Chemo in Dec 2008? horsercn Texas357"
    }
  ]
}