{
  "AuthorID": "Teaches",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66978/profile",
  "Posts": [
    {
      "AuthorID": "Teaches",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66978/profile",
      "Content": "Jul 11, 2008 10:58PM Teaches wrote: I had an excisional biopsy on June 30 with just numbing, no anesthesia.  While bearable, I would insist on the anesthesia if I had to do it again.  I took Tylenol for a few days after.  Bumpy rides did bother me!  Also, the shower was uncomfortable for a few days.  I had also had a prior needle biopsy.  My results were that the mass is a lymph node - no breast cancer.  Now I am waiting which the node is being tested.  I still have the steri strip, but it feels fine.  My incision is about an inch across, but my surgeon said that it was deep.  I think going back to work will depend on the type of job you have.  Good luck to you. ",
      "MessageIndex": 8,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708871",
      "Title": "Have you had an excisional biopsy? What can i expect? erin1 leaf"
    },
    {
      "AuthorID": "Teaches",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66978/profile",
      "Content": "Teaches wrote: I'm sorry to be such a baby, but I had an excisional biopsy on Friday and it is still hurting.  The surgeon said that it was deep, but it hurts as much now as it did on Friday.  It's not constant, but moving a certain way or touching the area brings tears to my eyes.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708362",
      "Title": "Should this still hurt? Teaches snowyday"
    },
    {
      "AuthorID": "Teaches",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66978/profile",
      "Content": "Teaches wrote: The results of my excisional biopsy are in... no breast cancer.  Apparently what the mammogram showed was a lump node.  Now that has to be investigated, a process that takes a few weeks.  Can anyone tell me what this means? I so appreciate the kindness of everyone on this board! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/708636",
      "Title": "results???? Teaches FitChik"
    }
  ]
}