{
  "AuthorID": "teachermomf…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
  "Posts": [
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 20, 2018 10:09AM teachermomfl wrote: Ugh...the waiting is the worst! I had a stereotactic biopsy (mammo guided) last month. It was uncomfortable, as the girls were squished in a mammo machine while I laid face down, but the biopsy itself didn't hurt. The numbed the area, and I didn't really feel anything. Make sure you have a tight sports bra to wear after.I didn't feel any pain until later that night and a little the next day. That stinks that you were all ready to have it done, only to have to reschedule. I hope everything goes well!",
      "MessageIndex": 6,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861791",
      "Title": "Upcoming Core Biopsy-Nervous cmh1977 MayDayMelK"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 29, 2018 04:58PM teachermomfl wrote: Yay! That's great!!!!",
      "MessageIndex": 16,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/861791",
      "Title": "Upcoming Core Biopsy-Nervous cmh1977 MayDayMelK"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 28, 2017 08:43AM teachermomfl wrote: Thanks, Silbar. That's what I was worried about. Stereotactic biopsy came back with abnormal cells, officially ADH. I meet with surgical oncologist Tuesday and will most likely schedule excisional biopsy. Due to dense breasts, he's concerned about what could be lurking beyond the tissue they took. I've also been reading the excisional biopsy seems to be standard protocol when abnormal cells are found.",
      "MessageIndex": 6,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860879",
      "Title": "Microcalcifications behind nipple teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 28, 2017 11:59AM teachermomfl wrote: I think the same way you do. The unknown is awful. I'm a bit of a control freak (probably more than a bit), and I hate not knowing & the feeling of having no control. I'm sorry about your wait situation. Is your hematoma from the stereo biopsy? Thankfully, mine has healed up nicely. I hate starting the new year with a surgery, as our deductible resets. I'm thankful to have medical insurance, but I truly hate the insurance companies. I feel like in these situations, the insurance company should do what it can do to expedite things. We'll probably have to pay out of pocket Tuesday. Our HSA card expires the end of December. We called the company and inquired as to why we haven't received a replacement, and they mailed out new cards. I took my daughter to a doctor appointment yesterday and discovered that the HSA company cancelled our current card when the mailed out the new one. WTH?! We'll be able to submit invoices for reimbursement, but jeez...I'll be keeping track of you as well. Good luck!",
      "MessageIndex": 8,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860879",
      "Title": "Microcalcifications behind nipple teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 30, 2017 05:43PM teachermomfl wrote: Thank you, Marie! I’ll check that out",
      "MessageIndex": 11,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860879",
      "Title": "Microcalcifications behind nipple teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 28, 2018 09:07AM teachermomfl wrote: Thank you, Silbar!",
      "MessageIndex": 2,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862000",
      "Title": "Question about excisional biopsy... teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 17, 2017 01:57PM teachermomfl wrote: Hi everyone! My report finally posted to the patient portal, and I feel better after reading it (I think). Birads 4-Suspicious (I guess they don't do a,b,c). The microcalcifications are punctate, which is a good thing, I believe. The reason for the biopsy is that they are clustered with a linear distribution. I know that's a concern, but aren't punctate calcifications rarely cause for concern? Biopsy is scheduled for Wednesday.",
      "MessageIndex": 4,
      "PostDate": "17/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860879",
      "Title": "Microcalcifications behind nipple teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 5, 2018 06:34PM teachermomfl wrote: Good question. I’m with Aetna. Has anyone out therehad this covered through them??",
      "MessageIndex": 6,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861343",
      "Title": "Savi Scout, anyone? teachermomfl UpstateNYer"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 5, 2018 09:36AM teachermomfl wrote: Thank you for the reply! I checked My insurance company, and it looks as though they consider the Savi Scout to be experimental. I haven't heard anything from surgeon’s office, so I hope they’ll be able to get it approved. It sounds much more comfortable than the wires. Fingers c",
      "MessageIndex": 4,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861343",
      "Title": "Savi Scout, anyone? teachermomfl UpstateNYer"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Mar 18, 2018 12:08PM teachermomfl wrote: I have many tattoos, and I’ve never experienced any issues with MRI",
      "MessageIndex": 1,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863293",
      "Title": "Radiation tattoos and MRI gb2115 gb2115"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 5, 2018 09:12AM teachermomfl wrote: Good to know. Thank you. It will be implanted about a week prior to surgery. My only concern is placement. I had a stereo biopsy a few weeks ago. It was pretty uncomfortable. Due to location, I had to put my breast and my arm through the little hole.",
      "MessageIndex": 2,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861343",
      "Title": "Savi Scout, anyone? teachermomfl UpstateNYer"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Feb 13, 2018 03:02PM teachermomfl wrote: I met with my surgeon, and my biopsy results are no cancer!! Super stoked. So, it looks like I'll be staying in this club. I go back in six months for a mammo on the ADH breast, and six months after that for a mammo on both breasts, US and MRI. My doctor talked to me about Tamox., and I'm leaning towards not taking it. He made me promise to talk to the oncologist and get all of the info before I decide. I meet with her March 13.",
      "MessageIndex": 891,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Mar 13, 2018 03:10PM teachermomfl wrote: Starting Tamoxifen tomorrow(if I gather the courage). I have the bottle, but waiting until AFTER my date night with hubby tomorrow. Anyone else here on it? How have you fared so far? I also posted in the hormone therapy group, but I'm curious about my fellow ADH friends. :)",
      "MessageIndex": 918,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 19, 2018 06:06PM teachermomfl wrote: I was curious about the \"moderate\" part, and if that was referencing the density of my breasts.",
      "MessageIndex": 2,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861783",
      "Title": "MRI question teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 19, 2018 06:24PM teachermomfl wrote: Ok, thanks for your help!",
      "MessageIndex": 4,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/861783",
      "Title": "MRI question teachermomfl teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Mar 1, 2018 04:51PM teachermomfl wrote: I'm glad it was not cancer! I had ADH as well. My doctor wants me to go on Tamoxifen, but I'm hesitant, as I'm 43 and it was just ADH. I promised him I would at least talk to the oncologist before I make up my mind. I'm now high risk as well, so I have a mammo on the left breast in six months with an US, and a mammo on both breasts six months after that, with an MRI. Every six month rotation.",
      "MessageIndex": 28,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/862719",
      "Title": "Heading to my excisional biopsy momto3sons beach2beach"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Feb 22, 2018 03:06PM teachermomfl wrote: I have two adult children and one 16 year old. I had calcifications show on my annual mammo in Nov. Went back for diagnostic in December. Was referred for stereo biopsy in late December. MRI in January and excisional biopsy in early February. The only thing that showed was ADH. As you can see, this went on for quite a long period of time. I didn't tell them anything. That would be a long time for them to worry about something that was not cancerous. I agree with DJ Mammo, unless you need their help to drive to/from appointments, I would wait.",
      "MessageIndex": 7,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862725",
      "Title": "When to tell adult children Jat1228 Jat1228"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 25, 2018 01:32AM teachermomfl wrote: Good luck!! My surgery is next Friday, and I just realized I’m going to have to shave these hairy ape legs before then!",
      "MessageIndex": 13,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861685",
      "Title": "Pending Excisional Breast Biopsy StrongJess momto3sons"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 27, 2017 11:21AM teachermomfl wrote: Officially joining the club. A little about me: 42 years old, with a history of cysts and very dense breasts. Started getting mammos about 4 years ago. Always get called back for diagnostic and ultrasound due to breast density. Have had a few cysts aspirated when they've gotten to be too big. Went for annual in November. Was called back (as usual), but this time for calcifications. After magnification mammo,the radiologist took me in a room to talk (that's never happened). They were concerned, as the microcalcifications were in clusters and in a linear pattern. Stereotactic biopsy last week. Results yesterday of ADH. Doctor from hospital said they are very concerned about what may be behind the area they biopsied. I have an appointment with breast surgeon next week. Hospital doc said to plan on surgery to remove more tissue for testing. I know this is going to sound weird, but my biggest concern is taking time off work. I'm a teacher, and I hate missing. Every day missed is one day lost of instructional time for my kiddos. Anyways, just wanted to introduce myself, as I've been lurking on this thread since yesterday. -Paula",
      "MessageIndex": 879,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "May 9, 2018 04:52PM teachermomfl wrote: ADH friends, I have a question & I think this is the best place to post it. As some of you know, I was diagnosed with ADH in my left breast in December after a stereotactic biopsy, and it was removed during an excisional biopsy. Started Tamoxifen in March, and next mammo and appointment with breast surgeon is in August. This morning in the shower, I felt a new palpable lump in my right breast. It's at about the 12 o'clock spot, a few inches above the nipple. I have very fibrocystic breasts, so I assume it's a cyst. Do you recommend calling my breast surgeon since it's new and palpable? I hate the thought of more appointments for something that may just be a cyst. What do y'all think?",
      "MessageIndex": 973,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Feb 13, 2018 01:53PM teachermomfl wrote: I've never heard of ultrasound being recommended before mammo. Did the radiologist confirm it's a cyst? Absolutely talk to your midwife about this, but if you have dense breasts, the mammo will likely not show anything the ultrasound didn't.You can try for an MRI, but they can be hard to get approved by insurance unless you've been diagnosed with something already, like cancer or ADH. If it is a cyst, it may be difficult to aspirate, given the location. I'm sorry you were treated this way by the imaging center.",
      "MessageIndex": 5,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862453",
      "Title": "I was refused a mammogram. What now? JenniferEver bevin"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 27, 2018 06:30PM teachermomfl wrote: Thanks for posting, Jess! I’m glad everything went well. Less than a week for mine. I go in Thursday to have my Savi Scout piece put in. My hospital uses this rather than the wires. It’s a similar procedure to stereo biopsy, only rather than suck something out, they insert the Savi Scout antenna. It’s about the size of a grain of rice. My biopsy is Friday, and my surgeon will use some handheld device to locate the antenna so he know she where to cut. Pretty high tech, and I’m surprised my insurance would cover it, as it was just approved by the FDA a few months ago. Hoping for benign results for you",
      "MessageIndex": 19,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861685",
      "Title": "Pending Excisional Breast Biopsy StrongJess momto3sons"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Dec 6, 2018 10:24PM teachermomfl wrote: I've not had an aspiration while nursing, however I've had numerous aspirations for cysts. It is a very simple procedure. The doctor will numb your skin, use an ultrasound to find the cyst, insert a needle and withdraw the fluid. Very simple and quick. Good luck!",
      "MessageIndex": 2,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868706",
      "Title": "Waiting on fine needle aspiration Sandycna25 teachermomfl"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "May 10, 2018 04:09PM teachermomfl wrote: Thanks, momto2sons. I'll keep an eye on it. This is actually in the other breast, but I had an ultrasound in November and an MRI in January, so I'm sure it's just a cyst. I don't think anything major would show up in that short of time period. Thanks for the reply. How have you been feeling?",
      "MessageIndex": 975,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 21, 2018 03:12PM teachermomfl wrote: If it was your first ultrasound, they generally take longer as they are establishing a baseline of sorts. My first one too forever, because I have very cystic breasts. She had to measure and log the size of each cyst. In my personal experience, the one time I had something truly concerning show, they asked me to wait so the radiologist could speak with me. I hope that alleviates some of your jitters.",
      "MessageIndex": 1,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/861835",
      "Title": "Waiting game. Lxs MayDayMelK"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jan 3, 2019 04:11PM teachermomfl wrote: I have a history of cysts, and they can grow quickly. The ultrasound can tell if it's a cyst or solid. If it's cyst, and it's bothering you, they can just drain it. They typically don't send anything for biopsy, as it's just fluid and cysts are benign. I've had many drained, it's very easy and painless.",
      "MessageIndex": 2,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/869127",
      "Title": "Confused about ultrasound/mammogram Scaredx10 djmammo"
    },
    {
      "AuthorID": "teachermomf…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/235929/profile",
      "Content": "Jun 1, 2018 03:28PM teachermomfl wrote: Not at all. I had a stereotactic biopsy in December after an abnormal mammo & ultrasound. It was ADH, so I had to have an excisional biopsy. I had my MRI a few weeks before the biopsy to get a baseline. There ended up being no cancer, just ADH.",
      "MessageIndex": 1,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/864958",
      "Title": "Does mri always mean breast cancer? fishfish mustlovepoodles"
    }
  ]
}