{
  "AuthorID": "teacher_mom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264448/profile",
  "Posts": [{
    "AuthorID": "teacher_mom",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/264448/profile",
    "Content": "teacher_mom wrote: Hi! this is my first post here and I'm still in the process of learning everything I possibly can and BC. About me: I'm a 40 year old mother to 3 (21, 20, & 12). I originally went to my doctor because I have been having some tenderness as well as intense itching of left breast. The pain/itching isn't constant, though it is frequent enough to be regular. My Doctor did a breast exam, could not feel anything, but ordered a Mammogram to be safe. One day after the mammogram, I received a call that I needed to come back for more imaging. The following day, i had another mammogram with magnification and an ultrasound. The ultra sound showed several cysts, and the mammogram showed a cluster of micro calcifications (not visible on the US if i understood the radiologist correctly). Based on his findings, he ordered an stereotactic vacuum assisted biopsy (scheduled for 12/11). At first I wasn't too concerned, but this morning, when bending over to get dressed, i noticed a spot on my breast that looks like a very light welt, or raised skin. Now I'm freaking out thinking IBC is a possibility. I was completely prepared for a Dx of DCIS, but not IBC. I know I'm getting ahead of myself and may be worrying needlessly, however, I can't help myself and continue to read everything I can on the topic. Unfortunately, the scans were done at Kaiser so I have to follow their protocol for requesting the report and it will take about 10 days to receive it. Has anyone here had similar symptoms/findings and it turned out to be BC? I'm sure this question has been asked repeatedly, but I really need some reassurance right now. I don't know how I am going to make it another week without knowing. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "05/12/2017",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860644",
    "Title": "new and scared-IBC?? teacher_mom IntegraGirl"
  }]
}