{
  "AuthorID": "Teach22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254468/profile",
  "Posts": [
    {
      "AuthorID": "Teach22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254468/profile",
      "Content": "Jun 23, 2017 08:55AM Teach22 wrote: Falconer - Thank you for your reply. I believe that is what she told me as well that they will know something after the surgery. This has been a very harrowing few weeks. I think the not knowing has been the worst part. Thank you for the support here! I've had three replies and I already have more information than I remembered from my 4 doc appts. It's so hard to process this when I keep hearing a new diagnosis every week.",
      "MessageIndex": 4,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856340",
      "Title": "44 and just diagnosed in both breasts. Is this common? Teach22 MinusTwo"
    },
    {
      "AuthorID": "Teach22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254468/profile",
      "Content": "Jun 23, 2017 09:01AM Teach22 wrote: MinusTwo - Thank you so much for the information! I'm hoping they have the hormone stats today. They were never ordered by my OB/GYN on the left side (DCIS) so they are between hospitals mailing slides back and forth. The results on the right side (IDC or ILC)should be here by Monday. Nothing was mentioned about Herceptin before the surgery. I need to look into that. I don't even have an oncologist yet! YIKES! I need to get on that now.",
      "MessageIndex": 5,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856340",
      "Title": "44 and just diagnosed in both breasts. Is this common? Teach22 MinusTwo"
    },
    {
      "AuthorID": "Teach22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254468/profile",
      "Content": "Teach22 wrote: Hello ladies: I've been reading a lot on here the past few weeks and finally have some results so I can ask some questions here. On June 2nd I was diagnosed with DCIS (no hormone receptors were tested...long story) I met with the surgeon and decided that the bilateral mastectomy was my best option. She then ordered an MRI and they found another suspicious 8mm mass that had not turned up on the mammogram. I had a biopsy yesterday and she called me today and told me it was \"invasive\" based on the preliminary pathology report. It's located deep. I have surgery scheduled next Thursday with tissue expander placement. So my question...is this common to have it in both breasts at an early stage? Of course my mind is going crazy thinking that this is all over my body because of the headaches and medical problems I've had for the past few years. When they do the surgery and look at the lymph nodes do they have any answers for you right away or do I have to wait 7-10 days for the full pathology report? She said something about dye in the nodes, but honestly I was so in shock on the phone I heard very little. If the cancer is found in the lymph nodes does this warrant a PET scan? I'm feeling a little better today now that I know some of what I'm dealing with but I'm still very worried. Any information you have would be so appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/856340",
      "Title": "44 and just diagnosed in both breasts. Is this common? Teach22 MinusTwo"
    }
  ]
}