{
  "AuthorID": "teachermom4…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
  "Posts": [
    {
      "AuthorID": "teachermom4…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
      "Content": "Jun 11, 2015 02:52PM teachermom4 wrote: Hi Taramay, I am Stage II but with my oncotype and clear margins, no chemo or radiation, just AI--though I am older than you. If in doubt, don't hesitate to get a second opinion. Best wishes!",
      "MessageIndex": 28,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/832298",
      "Title": "Stage 1 clear nodes no radiation or chemo? Taramay hummingbirdlover"
    },
    {
      "AuthorID": "teachermom4…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
      "Content": "Jul 15, 2014 06:18PM teachermom4 wrote: Hi OneLump, I am Stage IIa and did meet with MO. My onco score came back = 8 so no chemo for me. I still am being followed by my MO and will be for a few years. I will be seeing her in Aug. (3 months since last visit) for blood work (tumor markers) and to manage my Arimidex.",
      "MessageIndex": 11,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/818536",
      "Title": "Anybody have stage 2B IDC Cancer with very low oncotype score? annabananas AKJ"
    },
    {
      "AuthorID": "teachermom4…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
      "Content": "Apr 26, 2014 11:47AM - edited Apr 26, 2014 11:48AM by teachermom4 Thank you both so much for your kind replies-it really helps I think as women, we are so used to doing the caring, nurturing and fixing that when the tables are turned it can be a challenge. At least it is for me! Linda505, my tumor was probably present for a couple of years as well! It was only discovered because I had an MRI to look more closely at the DCIS in my right breast and wouldn't ya know--they found something in my left breast! I don't know what to tell my friends who take comfort in clean annual mammograms. Technology has to improve here. I alternate between marveling at little things each day,  like how beautiful the sky is and being terribly annoyed each day about little things--like people complaining about how much they have to do! I guess it really is a rollercoaster",
      "MessageIndex": 3,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820549",
      "Title": "Waiting for Oncotype--it all finally hit me teachermom4 cookiegal"
    },
    {
      "AuthorID": "teachermom4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
      "Content": "teachermom4 wrote: Hello Ladies, What a mighty and powerful group we are! As we all know too well, when we start down this journey it is a whirlwind. I'm a very pragmatic person, often at the expense of my emotional health. When I was dx there was so much to do! Now, 3 weeks post bmx, it all came crashing down. And where? In a hotel room thousands of miles from home because dammit I wasn't going to let a \"little\" thing like bc get in the way of a business trip! So here I am, alone, waiting another week for my Oncotype and I finally realized, I have breast cancer! Geez that's even hard to write! I could see it, but haven't FELT it until just now. Mammogram didn't pick this up and  so sick of well meaning people saying, \"oh you must've had a bad radiologist\". No, sh*t happens and more often than most realize! Thanks for the vent.  Peace to all! Oncotype = 8 Dx 2/25/2014, DCIS, Right, 2cm, Stage 0, Grade 3, 0/3 nodes, ER+/PR+, HER2- Dx 3/3/2014, IDC, Left, 2cm, Stage IIA, Grade 1, 0/2 nodes, ER+/PR+, HER2- Surgery 4/3/2014 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Hormonal Therapy 5/5/2014 Arimidex (anastrozole), Femara (letrozole) Surgery 9/10/2014 Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820549",
      "Title": "Waiting for Oncotype--it all finally hit me teachermom4 cookiegal"
    },
    {
      "AuthorID": "teachermom4…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/199374/profile",
      "Content": "Apr 27, 2014 10:37PM teachermom4 wrote: Thank you all for making me feel like I  am not alone. Cammychris I sure know about that mind wandering. It's as if you're about to go off the ledge and then try and keep pulling yourself back. It's a surreal. I hope you are able to quiet your mind at some points and take care of yourself--hard with 6 kids! Thank you ziggypop for your kind and encouraging words. It's so weird to go through these emotions when I essentially feel health! I'm trying to focus on healing and small victories. Oh and getting used to living with uncertainties. But I suppose that's life even without cancer! There's that damn word again....",
      "MessageIndex": 6,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/820549",
      "Title": "Waiting for Oncotype--it all finally hit me teachermom4 cookiegal"
    }
  ]
}