{
  "AuthorID": "TeamDeck",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69718/profile",
  "Posts": [{
    "AuthorID": "TeamDeck",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/69718/profile",
    "Content": "Sep 11, 2008 10:56PM TeamDeck wrote: Hi Marietje and Others, Thanks for asking. We've had a very tough few weeks. Steph is lying next to me now, and I think she is close to the end. The latest update is that she had some internal bleeding related to varisces two sundays ago, we went to the ER to find this out after she vomited blood. She was in the ICU after that for several days and had been intubated. She made a remarkable recovery - driven I believe by her sheer desire and determination to get out of the hospital - and we were able to get her extubated, discharged and home. We began in home hospice care upon her arrival. Fortunately, we got all her family and mine in town last weekend and she really rose to the occasion. She was funnay and animated and herself - and that time was a blessing. Most importantly, she saw our only son off to kindergarten - something that  was so important to her.  It's sad. I feel mad sometimes when I drop our son off and see \"normal\" people wearing their gym clothes and chatting, having fun, living. Steph's only 35, and she will probably die before the weekend is out. I’ve been dreading that this moment may come since that day in May of ’02 when the doctor said  - “it’s a breast cancer.”  We were dumbfounded. Stephanie was 29 years old, 6 months married and nine weeks pregnant.   At the time, almost immediately, I felt sorry – sorry for Stephanie and sorry for myself.  I pictured myself eulogizing her and saying something like – “Stephanie was another brave warrior who lost her fight to breast cancer.”   But I must say, while my heart is heavy because Stephanie is dying.   I am proud – even jubilant – to say that Stephanie won.  She was able to do what she most wanted to in life.  She was able to be a mother and to make a home. She is a fighter and she'll go to heaven with grace and dignity. Thanks to you all for the support and expertise. I only really turned on to this in mid-July as things worsened for us but I wish Steph had been able to enjoy this community. Best, MD ",
    "MessageIndex": 1,
    "PostDate": "11/09/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720545",
    "Title": "TeamDeck mpieterse mpieterse"
  }]
}