{
  "AuthorID": "Teddy88",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
  "Posts": [
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Nov 19, 2017 10:44PM Teddy88 wrote: Hi ToughCookie: I am sorry about the diagnosis and sorry to hear that the fellow isn't dealing so well with it all. Would it be possible to simply take it easy, and deal with the medical stuff right now? If he wants to text and you feel like replying - great. If the texts are not helpful - you are allowed to busy yourself with the urgent things in your life and people who can be there in a supportive way for you. You can make decisions about him after you focus on you. In the meantime, he may benefit by a little time and distance. If you were my sister or best friend, I would just ask you to focus solely on people and activities that build you up and help you feel better right now. Cancer diagnoses are emotional shocks. I think its too much to have to worry about how anyone else is dealing with it when you have things to do to get well. I hope you don't find this too personal - but I promise you, a million times over, that there are many good men out there who know how to support their partners when faced with a cancer diagnosis and treatment. When we keep trying to get the wrong person to stay - we can't clear our life and create space for the loving one to come in......I think most of us can relate :) I hope you will post again, and that you will be supported by good people in your life. You will get lots of great support here - its an amazing group Love, xx Belle",
      "MessageIndex": 12,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/860188",
      "Title": "Partner likely to leave after diagnosis ToughCookie101 Michelle_in_cornland"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Sep 8, 2017 07:10PM Teddy88 wrote: Hi IADeb - Sharing my experience in case it should help. After my lumpectomy and rads in 2014 for tubular diagnosis, my radiologist put my other breast on an every six month testing schedule for 1.5 years in order to follow some calcifications (my BC showed up that way originally.) Aaack! You think there is a reprieve and now something else may be brewing. I really related to your post. I became so afraid of scans that I had to have a talk with her and tell her how fearful I was becoming. She had me go for an MRI and then put me back on an annual schedule. That helped a bit. The hyper vigilance is appreciated so deeply, but finding a way to get more conclusive answers and not live in scanxiety mode was even better. Fast forward to a month ago - my new radiologists saw calcs and a troubling something in the treated breast in 3 D mammo. They wanted to do 4 biopsies. We ended up with 2 stereo and one US - guided one. After a scary week - diagnosis made was scar tissue from lumpectomy. The doctors told me that given my prior BC and presentation - they were taking no chances and would have done a wait and see had I not had cancer before. This is a longwinded way of sharing my experiences post surgery of having doctors trying all that they can to help me stay safe. I love them for it and appreciate it but recognize that tremendous anxiety accompanies it in my case. I am very hopeful that your doctors are doing the same vigilant review and that you will get an all clear result. I have not thought fully about a mastectomy to avoid the anxiety. Given this last round of biopsies, I certainly appreciate why others made that decision. I am going to see my ob-gyn and talk this issue over. Hope you will keep us posted. Belle xx ",
      "MessageIndex": 7,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858522",
      "Title": "Bad mammogram one year after breast cancer diagnosis IADeb NotVeryBrave"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Sep 13, 2017 10:17AM Teddy88 wrote: Happy News - and the exact same topic I want to speak with my doctor about. I am so glad for you, IA Deb Belle xx",
      "MessageIndex": 12,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858522",
      "Title": "Bad mammogram one year after breast cancer diagnosis IADeb NotVeryBrave"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Sep 8, 2017 09:49PM Teddy88 wrote: Hi Deb: Just an extra note - the scar tissue presented so much like cancer that the radiologist sent the specimen back for a second look to make sure it was not. Keep the faith + will look for your posts next week.xx Belle",
      "MessageIndex": 9,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858522",
      "Title": "Bad mammogram one year after breast cancer diagnosis IADeb NotVeryBrave"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Sep 14, 2017 06:45PM Teddy88 wrote: Hi Triscuit: I love your screen name :) I read the depth of feeling in your note, and just want to say that I very much hope you get good news. I hope you will post when you hear back on the results, and amsending you good wishes. Love, Belle xx",
      "MessageIndex": 2,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/858637",
      "Title": "Biopsy 3 sites today...don't want to hear anything bad on Monday triscuit triscuit"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Feb 16, 2018 02:05PM Teddy88 wrote: Hi Rhonda: I am sorry that you are faced with worry once again. I wanted to share that I did two stereo core biopsies and one US-guided biopsy in August because micro calcs and a mass showed up in a previously treated (lumpectomy + rads) breast. The radiologist proactively called my ob-gyn to say that she felt cancer had probably returned. Turns out it was fat necrosis and scar tissue changes from original surgery and rads - creating a mighty stir in the same breast - several years later. You have had surgery and rads and are being checked with more advanced machines each year. Wondering if you might have a similar, benign issue coming to pass like scar tissue changes or fat necrosis? I appreciate your point about getting a biopsy but it seems that they want as much info as possible via MRI? Ps - I asked if we could wait and check in 6 months and the radiologist was very afraid to wait at all, too. My birads was listed at 4. I hope you will have a good result and that you will keep us posted. xx Belle",
      "MessageIndex": 4,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862528",
      "Title": "Inconclusive 3D mammogram and Ultrasound Rondeezee Rondeezee"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Aug 23, 2017 02:51PM Teddy88 wrote: Hi Teacher 18 - I think you just used the board in a good way - you told your story and shared your worries. Take the next few days / weeks in steps - don't panic. The doctor will do the MRI to see if there may be any other spot of interest to get a whole picture of your daughter's health. A standard check. You will learn much more on Friday. Will you be going to the appt? You can collect all the information you have and come back here and gain more insights. One breath, and one step at a time. You have already proven that you are strong, and you will continue to be that way with your beloved daughter at your side. I hope you will keep us posted. Love, Belle xx",
      "MessageIndex": 6,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/858123",
      "Title": "Daughter, 55, biopsy results cancer-architectural distortion Teacher18 Concerned2018"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Aug 14, 2018 12:21AM Teddy88 wrote:",
      "MessageIndex": 2,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866565",
      "Title": "Waiting for biopsy results cs1522 Jujibean"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Oct 4, 2017 09:51PM Teddy88 wrote: Hi JenPinc: I am sorry that you are dealing with this worry. I read your post earlier and was thinking of you. I logged back in and see your follow-on post and love that you read the boards and got strength. I also love that you say you will get through - yes you will! The best advice I have gotten here was to be sure and take things one step at a time ( so much easier said than done but the advice is right on! and to remember that when fear grows, we can ask God, Source, Nature - whatever brings you peace - to take the worry from your shoulders and carry you through. Those two pieces of advice from women I did not know kept me afloat, and I hope it will help as you walk through the next few weeks. Wishing you good luck and hope you will keep us posted. Love, Belle xx",
      "MessageIndex": 4,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/859152",
      "Title": "Just diagnosed, Pre treatment, found lung mass Jenpinc Jenpinc"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Oct 6, 2017 01:00PM Teddy88 wrote: Good luck with everything - I was given Tylenol post biopsy and it helped :) I hope all will be well.  Love, Belle xx",
      "MessageIndex": 1,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/859191",
      "Title": "Core needle biopsy Faireygoddess Ozarkgirl"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Aug 6, 2018 05:02PM Teddy88 wrote: Dearest Celebrate_Life / Beautiful Therese: I am so HONORED to read and relish in your beautiful message. THANK YOU for making my day, my week and my month. You are an answered prayer. Sending you much, much love and continued joy, Belle xxoo",
      "MessageIndex": 2,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/866431",
      "Title": "Ten years-whooopeeee! Celebrate_Life dorimak"
    },
    {
      "AuthorID": "Teddy88",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194616/profile",
      "Content": "Feb 10, 2018 11:21PM - edited Feb 10, 2018 11:50PM by Teddy88 My experience with rads began when an intern handed me a marketing brochure during my initial consult. Lord help me! Just answer my questions and keep the brochure with the smiley faces for now, sir. The rad onc I saw was very talented and overworked. I literally had to BEG her to return my call when deciding to do full or partial rads. My MO tried her and she ignored him, as he suspected she would. Her rep is that she is brilliant and a beyotch. She has since moved on to another leading hospital, so she may have been in a less than ideal place. She did help me, and I am grateful. I no longer focus on how I felt having to work so hard to get her attention when important decisions needed to be made. The last time I saw her, I told her how I felt - vulnerable and terrified - and that I appreciated the help but needed more from her. She understood. Not long after, I saw a woman RUN to her and hug her and said she was NED. She has to be around 21 years old. I think I began to understand what a hard job she had, and that she had the world on her shoulders. As for the techs, I arrived first day around 11am and the waiting room was full. People were in every stage of disease - many clearly suffering. My reaction was to wish to RUN as fast as I could out of there. I could not understand why God would allow this level of suffering. So many beautiful people suffering. I was still reeling from diagnosis, had lost my job before the diagnosis ....I was thoroughly and deeply frightened. The lead tech called me in and told me that she thought I looked both afraid and somewhat distraught. I am usually very strong, but I told her how I felt about all this suffering. She asked if I could get there for the first appt of the day for the next few weeks - around 7:00 am - because the waiting area was quiet. I hugged her. I showed up the next day at 7 am and met a crew of 80 year old men who had become friendly as they got radiation for prostate cancer. They chatted with me each morning. It helped so much. The techs were kind. I could not believe that they had guys in there dealing with naked breasts, but I quickly realized that they saw it all sorts of body parts day in and day out and mine were nothing special. I stayed upbeat and positive and just wanted to get the heck done with it all. Sometimes I felt myself sliding into panic mode, but I kept counting the minutes til I could leave. So I guess I was more focused on keeping on track and getting it done and dashing out of there. I have never been that scared. The techs asked me how I was as the first line of reporting should something be wrong. I didn’t really focus on them alot just because the fight or flight mechanismwas out in full force. I just wanted out each morning. There was a big boss guy running the department and he constantly checked in and asked if all was okay. That helped too. At the end of treatment, I gave my fave co-patient a “graduation gift\" - a book that means alot to me - when their rads were done. I received in the mail the most beautiful letter of encouragement along with a small gift that remains the best thing given to me aside from my wedding jewelry. To me, it made this unexpected and uncomfortable experience understandable and worth it. My techs all got gift certificates to Sephora. They never lost their smiles, even when confiding that their own family was sick and they were worried too. And they were relentlessly professional when I looked like a very scared human being. So I had a difficult rad onc, an angel of a tech who saw my worry and got me in a better schedule, getting boob naked with strange men who I ended up liking, getting encouragement from 80 year old men who brought me back to life in that waiting area....nothing was perfect yet everything was in the end. I suffered trying to get information on treatment, but once that was agreed upon, I made peace with the physical downsides of rads - short and long-term. My breast looked as though I had the worst sunburn x 10 (and aquaphor was the saving grace.) My boob shrunk, is scarred and not very pretty. My rads experience was like the whole of cancer itself - you have no idea what is coming, and some of it will test your resolve, cause you to be absolutely terrified and doubting all that you know — and other parts will leave you so damn grateful. I would be absolutely delighted to have missed this experience and be ignorant about cancer, but it’s given me alot of insight. I am still working out how I feel about it all! xx. Love, Belle",
      "MessageIndex": 13,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/861454",
      "Title": "Grumphy McAsshole feelings re: my rads team. And you? Sahmeranah ksusan"
    }
  ]
}