{
  "AuthorID": "teeko",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
  "Posts": [
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Oct 6, 2008 07:41PM teeko wrote: Looks like I am in the 20~30%. When I got home from work today, there was a message on the answering machine telling me to go see my gynecologist at 8:30 tomorrow morning. I hope you're all right, Barb.",
      "MessageIndex": 6,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "teeko wrote: Has anyone had, or is anyone having one of these? I have been told I need one to check on calcifications, and I understand that 70-80% of patients are found not to have malignancies. However, if I should fall into the 20-30% that do have cancer, I am worried that sticking needles into the calcified areas might allow some cancer cells to escape and start metastases. My doctor tells me that won't happen, but after cancer surgery, don't they give people chemo and radiation to mop up any stray cells? My doctor also talks as if there were nothing else that can be done to check on the calcifications, so I'm wondering what they did before the invention of this machine. Maybe patients just had to wait and see if they developed lumps? I have had close relatives die of breast cancer, and this is scary. Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Sep 27, 2008 11:25PM teeko wrote: I think I am going to go through with it, but take modified citrus pectin for awhile, which I understand can help prevent metastases.  My husband has been fighting primary liver cancer for several months, and I don't think I can take the additional stress of not knowing about my own situation. Since in his case there were no allopathic treatments that offered any hope of a cure, he has been following a sort of diet called the Budwig protocol, which has significantly slowed down the growth of his cancer and he has no mets yet, in spite of having had a needle biopsy, so I may try Budwig, too, and hope it prevents mets for me. But meanwhile, being more of a \"get it out, and the sooner the better\" sort of person, and I can't have it cut out unless I have that biopsy, I guess I'll go for the stereotactic biopsy. Shirlann, I still don't get that oncologist's reasoning. I can see he was trying to be reassuring, but transferring live cancer cells into mice is different from having one's own cancer cells move around, and the fact is that people's cancers do metastasize; so now I am wondering if I have been misunderstanding the way that they do it. Ah well, as you said, this is his thinking and we all have to decide what to believe and what not to. I wouldn't want to not have that freedom, and yet all this responsibility for making one's own decision is really daunting, isn't it? I find comfort in your and Beesie's suggestions about subsequent treatments taking care of any mets.  Best wishes to the two of you and to Barb, too. I hope you can get some relief in making your decision, Barb.",
      "MessageIndex": 4,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Oct 8, 2008 02:38PM teeko wrote: Sherlann: Thanks. While the \"atypical cells\" and hyperplasia (abnormal growth) they found were not actually cancerous yet, the biopsy report says some were \"approaching ductal carcinoma in situ\" or something like that, and I now have to have a more extensive surgical biopsy. Fortunately, they were able to schedule an appointment for me to see the surgeon tomorrow, and then I'll know more, but even after this new biopsy, the results won't be back for a week. I have seen something about Americans going abroad for operations and what good care--and even what a good time--they have there. It was a very interesting program. However, my husband is strongly opposed to having a liver transplant, though the oncological surgeon we consulted did mention that and also the possibility of just cutting away the half of his liver that contains the cancer. Such an operation would be complicated by the fact that we are Jehovah's witnesses, so blood transfusions would be out, and there is also a chance that even if the operation were successful, the remaining half of the liver might not regenerate enough to give my husband a comfortable and normal life. Hence our relying on the Budwig protocol, but it has made us really cheerful as to his future. Hugs, Cindi. I appreciate that your situation is very unnerving. It's horrible what happened to your husband. As for your cancer, you probably have a good chance of being around as long as you hope for your daughter's sake, and even longer. We have a friend with metatastic breast cancer who has been fighting it for 13 or 14 years now. She is a single mother, and her only child, a daughter, is about 15, I think. We feel that her concern for her daughter has played a part in keeping her strong through multiple chemotherapies over the years. I'll be thinking of you tomorrow and anxious to hear of your results.",
      "MessageIndex": 12,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Dec 17, 2008 11:05AM teeko wrote: I hope everyone is OK. I did have the stereotactic biopsy, which found abnormal cells and atypical hyperplasia. Strangely, the report noted that the calcifications found in the mammogram, which were what had led to the biopsy, were not found. After that, I had 2 excisional biopsies, the second one because the surgeon wanted to get at least a 2mm clean margin, and she now feels that she has gotten it all, and because it was a very small area, I may not need radiation. I am still waiting to hear on that, but am greatly relieved, anyway. ",
      "MessageIndex": 33,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Feb 7, 2009 03:19PM teeko wrote: Beesie: I'm sorry for not answering sooner. I hadn't checked out this site for quite some time. The first excisional biopsy did find DCIS. The second one made it clear that the first biopsy had gotten everything. When I brought the analog films of my stereotactic biopsy to the different hospital where the excisions were done (because I decided to change surgeons before the excisional biopsies, due to the fact that the first surgeon's staff left the answering machine on for a large part of the time, even during office hours), I peeked at the printout that was in the envelope and found that one radiologist who reviewed them had written that there was a strong possibility of DCIS. Later my surgeon told me that she had rather expected to find carcinoma, anyway, even before the first surgery, which was why I had been sent information about cancer support groups and got a call from some woman who said she could \"help guide me through my treatment.\" I was not pleased to, in effect, be told my diagnosis before seeing the surgeon about the results of my biopsy! Some weeks later, I was able to get appointments, first with a radiologist and then with an oncologist, and both of them, after reviewing my case, decided I needed no more treatment. The radiologist put it, \"There's nothing more I can do for you,\"  giving me a moment's concern before I realized that he meant that I didn't need radiation treatment. The oncologist said that in my case, the risks of Tamoxifen would outweigh the possible benefits, since many people with DCIS never get cancer and I might not need it at all. They will continue to monitor me, but I am happy, for now, to be off the hook. How are the others here doing? I have been thinking about you and hope all is well.",
      "MessageIndex": 36,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "Oct 11, 2008 03:58PM teeko wrote: Looks like we are going to be going through the same process again, Cindi. I saw the surgeon Fri. and am still waiting to hear from her office about how soon she can do the biopsy for the ADH and what may be DCIS or \"approaching\" that. My first reaction was to request a mastectomy right from the beginning so that my husband won't have to (potentially) worry about me through two operations, but the surgeon persuaded me not to have one yet, because I would need to be hospitalized for a mastectomy and not for the biopsy. One good thing is that the biopsy can be done at a good hospital that is only a mile from our house, making it easier for my husband to drive me there and back, or go home during the day and wait till they call him to pick me up. With his eyes bad after a cataract operation, this is something to be thankful for. Beesie: That is a great diagram! For the first time, I can visualize what is going on inside me. Thanks.",
      "MessageIndex": 21,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    },
    {
      "AuthorID": "teeko",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72613/profile",
      "Content": "teeko wrote: Has anyone had, or is anyone having one of these? I have been told I need one to check on calcifications, and I understand that 70-80% of patients are found not to have malignancies. However, if I should fall into the 20-30% that do have cancer, I am worried that sticking needles into the calcified areas might allow some cancer cells to escape and start metastases. My doctor tells me that won't happen, but after cancer surgery, don't they give people chemo and radiation to mop up any stray cells? My doctor also talks as if there were nothing else that can be done to check on the calcifications, so I'm wondering what they did before the invention of this machine. Maybe patients just had to wait and see if they developed lumps? I have had close relatives die of breast cancer, and this is scary. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721768",
      "Title": "stereotactic breast biopsy teeko teeko"
    }
  ]
}