{
  "AuthorID": "Tempy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
  "Posts": [
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 03:00PM Tempy wrote: The doctors are pushing to check lymph nodes before the BMX to have full staging. I don't want to go through another surgery/recovery when the plan is for a BMX in July/August. As far as radiation, if I need it afterwards I know there's the possibility of problems but they're saying it wouldn't be until after I was well healed. At this point, I'm being told I'm a great candidate for nipple sparing mastectomy and given that option would like to be able to keep some semblance of \"me\" versus my reconstruction options being diminished with radiation first.",
      "MessageIndex": 6,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831402",
      "Title": "IDC, DCIS and LCIS in one biopsy Tempy Tempy"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 31, 2015 12:20PM Tempy wrote: I have the health insurance which went into effect early April, I just won't have a paycheck during my recovery as they don't offer the ability to sign up for short-term disability upon hire but do offer long-term disability *boggle* which kicks in after being off of work for 6 months. Luckily things go well and I won't have to be off for that long so that won't be an option.",
      "MessageIndex": 9,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831402",
      "Title": "IDC, DCIS and LCIS in one biopsy Tempy Tempy"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 02:57PM - edited May 13, 2015 02:58PM by Tempy",
      "MessageIndex": 5,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831402",
      "Title": "IDC, DCIS and LCIS in one biopsy Tempy Tempy"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "Tempy wrote: Let me first begin to say I have been extremely frustrated by the process I have gone through with the first facility I have dealt with. Regular screening mammogram in December 2014, called back for a diagnostic mammogram in January of this year to look at a cluster of calcifications on the left and an area of density on the right. The right was ruled out as a \"compression artifact\" with no further consideration. The area on the right was suspicious and a stereotactic biopsy was recommended \"just to be sure but 80% of the time it's nothing.\" The stereotactic biopsy was done in March and came back with 3 types of atypical cells in two core samples (they were unable to get more because lidocaine wasn't working). Because of the atypical cells, I was referred to a surgeon for a wire guided excisional biopsy/lumpectomy which was done on April 14 and again I was told that it was just a formality, that it was probably nothing. Post-operative visit less than a week later (April 20th) my husband and I were told that it was Stage I, non-invasive breast cancer, DCIS and LCIS and an MRI was ordered. MRI was done and showed areas of concern on the right and the left so next step is ultrasound. Ultrasound on the left showed infra-mammary lymph nodes and an dense area on the right so guess what ... another biopsy, at least this time it was ultrasound guided so it wasn't as horrible as the first one. The results came back as fibrocystic breast disease ... luckily benign this time!! But to go through so many procedures, trips to the hospital, facility, surgeon's office for just one more thing makes me want to pull my hair out! After feeling like we were getting the run around with this first facility, we sought out a second opinion from a highly recommended surgical oncologist. The second surgeon requested and was provided a copy of the pathology slides, imaging and all reports. She took her time and did a full breast exam and manually checked the lymph nodes on the first visit. We discussed options and names of an oncologist, radiologist and plastic surgeon were provided and, to date, I have only had an appointment with the oncologist. The second look at the pathology slides is more than a little alarming. The first pathology report stated non-invasive ... the second report is stating infiltrating/invasive. How do they make that kind of mistake? The meeting with the oncologist went well but I believe he went by the first pathology report, perhaps unaware that a second look was being done and stated that his biggest concern was of the LCIS as the cancer was small, non-invasive and the edges were clean. I have sent him a message and will hopefully hear back to see if the second report alters his opinion. He stated though that the lymph nodes should have been checked when they did the excisional biopsy because \"if you're going that far you should assume it's cancer.\" So yay I get to have another procedure when it probably should have already been done to complete staging. Neither pathology report gives a grade (that I have seen) so will have to make a note to ask him about it. The plan is for a bilateral mastectomy with reconstruction that cannot be done until sometime late July as I had recently started a job and short-term disability is only offered during \"benefit fairs\" in July and November. Hopefully they don't deny me because it's pre-existing even though it wasn't diagnosed until after I had started. The lymph nodes still need to be checked and I'm not a fan of having to keep getting put under so am inclined to wait until they do the mastectomies. Dx 4/20/2015, DCIS, Left, <1cm, Stage 0, ER+/PR+, HER2- Dx 4/20/2015, LCIS, Left, ER+/PR+, HER2- Dx 4/20/2015, IDC, Left, <1cm, Stage IA, Grade 1, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831402",
      "Title": "IDC, DCIS and LCIS in one biopsy Tempy Tempy"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 12:33PM Tempy wrote: Thank you for the support, sometimes we just need to vent a little bit which I guess is why it got rambling ... that and I wrote it at 1:30 in the morning. A lot of appointments still to go but I think we're on the right path with the new team of doctors.",
      "MessageIndex": 3,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/831402",
      "Title": "IDC, DCIS and LCIS in one biopsy Tempy Tempy"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 07:32PM Tempy wrote: Rhody I'm leaning heavily towards BMX with immediate reconstruction (I hate being put under as I have a difficult time coming back out). Just have to wait until sometime in July/August until I can get signed up for STD. Saw the MO this past Monday and see the PS on the 27th with a return visit to the BS on the 29th. I worked oncology for years and it's so different being on the opposite side of things.",
      "MessageIndex": 833,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 08:03PM Tempy wrote: My husband goes to all of the appointments and does not have a medical background - although he's learning quickly. The doctors talk to me knowing my background but then (at least with the second facility) take the time to explain everything to him and answer his questions which is great because I've been relatively overwhelmed and just exhausted so have a tendency to forget stuffs. When I was going in for the ultrasound guided biopsy at the initial facility (my BS wanted me to complete work-up where it started rather than shift mid-stream) the nurse navigator came up to me, handed me a big book of BC treatment and walked away. If I didn't have the education I have and all I was given for support is that one book .. well let's just say I was more than a little disappointed and we're not going back.",
      "MessageIndex": 835,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 16, 2015 10:02AM Tempy wrote: PatRN, I've been pretty lucky and have gotten some of my appointments on my days off or after a night shift. Wondering if anyone has had their BMX/Lx, etc at the facilities they've worked at and how you feel about co-workers taking care of you post-op.",
      "MessageIndex": 847,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 12:24PM Tempy wrote: Another nurse here and wish I could say my employer has been supportive. I just started this job in February of this year (12 hour nights on a surgical floor) so don't qualify for FMLA yet. Short-term disability is on the horizon as soon as I can sign up for it during the benefit fair in July. When I got the dx, my manager said that she would work around my doctor's appointments, etc but we're so short staffed from people leaving that flexibility is an issue as I'm still low-person on the proverbial totem pole.",
      "MessageIndex": 829,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 13, 2015 12:52PM Tempy wrote: A lot of other people are picking up extra shifts and I would as the extra $$ would be nice but I've been so overwhelmed and exhausted I just do my 3 days per week. That and there are some weeks I have a lot of appointments and I had another biopsy last week this time on the right side. There's new people starting so hopefully once they get on their feet and running things will get a bit smoother.",
      "MessageIndex": 831,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    },
    {
      "AuthorID": "Tempy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/215481/profile",
      "Content": "May 16, 2015 09:36AM Tempy wrote: Native because I work nights they I guess they assume that I'm free during the days to do all of my appointments at that time. However, I guess they don't think I need to sleep. You know that 5 letter word that nurses don't get enough of? Luckily my co-workers have gotten used to my \"dark 30s\" where I go into an empty room for a quick power nap on my breaks. It's crazy, although I haven't started treatment and probably won't (according to my MO) until after surgery, I've been just exhausted.",
      "MessageIndex": 845,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/721289",
      "Title": "Nurses with Breast Cancer Jo_Ann_K PatRN10"
    }
  ]
}