{
  "AuthorID": "TeresainTuc…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142163/profile",
  "Posts": [
    {
      "AuthorID": "TeresainTuc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142163/profile",
      "Content": "May 6, 2012 07:37PM TeresainTucson wrote: Congratulations! Everyone looks great. It is sooo wonderful to see celebrations!!",
      "MessageIndex": 17,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/787054",
      "Title": "Reached one of life's milestones! Cathy2 texasrose361"
    },
    {
      "AuthorID": "TeresainTuc…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/142163/profile",
      "Content": "Dec 31, 2011 05:50AM TeresainTucson wrote: I know that when I'm at the top of my game I do better. When I have continuous low grade pain my temper gets shorter, no matter how much I try to fight it. It may not get much shorter, but it is shorter.Chemo brain, for me, has one positive and one negative effect and they are kind of the same. My brain slows down and gets fuzzy. When I'm trying to help my kids with homework this is great! I don't wonder \"what is so hard that you don't get this\" I just go to \"how else can I explain this\". Unfortunately at work I was staring at paperwork that I do regularly and wondering why it wasn't making sense. Another effect, for me, is lack of sleep on my chemo days. I don't deal with things and come up with as good solutions when I don't sleep. Not even talking about meds on this part. The dx of cancer is anxiety causing. Not having as much of a sense that things are ok and we have time, energy, ways to deal with whatever problem is happening in our life. Limitations of what you could do before and can't now, frustrating! Staying positive as much as you can and worrying if you are complaining/whining/overreacting etc. Lots of work and stressful. And yes, I completely agree with whoever said apologize fast when you figure out it was an oops (paraphrased). As others mentioned medicine itself has side effects. Go over it with your doctor. Advocating for yourself is a must! I guess I'm saying that for me, I can see some chemo effects (chemo brain). I can see other effects from the side effects (lack of sleep, pain). Some is just the stress, frustration, etc of cancer itself. And of course all of it is affected by how we each individually react to each aspect, medicine, medicine side effects, stress, etc. I wish you all the luck in the world. I actually told my teenager \"I'm sorry my cancer is inconveniencing you. It is inconvenient for everyone. If you live in this house it is something that will need to be dealt with\". I'm not saying you did that, I'm just relaying my experiences because they're the only ones I've had. I definitely understand where you're coming from and I am wishing you the best!! :)",
      "MessageIndex": 24,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780017",
      "Title": "Does chemo affect you emotionally? blondiex46 vickib"
    }
  ]
}