{
  "AuthorID": "Teresa44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
  "Posts": [
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Teresa44 wrote: It has been quite a while since I checked in with the Stage 3 ladies and everything has really changed.  I have been so busy lately, helping to raise 3 grandkids, helping to plan 2 weddings, along with all the day to day things that I have to do.  Health wise I feel great!  It will be 4 years in September.  I just thank God for keeping me here.  I have been having some hip pain but I think it stems from lifting a 2 year old all the time or maybe it is some arthritis.. I am thinking about getting my left hip x-rayed just for my own peace of mind.  I am still experiencing some neuropathy in my fingers and feet, but I have just learned to live with it.    I hope everyone is well.  I promise to check in again soon. God Answers Prayers Teresa44  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709376",
      "Title": "Hi!! It's been a while. Teresa44 maryannecb"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Jul 20, 2008 09:24PM Teresa44 wrote: Hi Teresa, I was dx with triple negative breast cancer in 2004.  My tumor was 6.5cm so I had chemo, mast. chemo and then radiation.  No positive nodes but when my surgeon stripped them out all he could find was 2 nodes and they were negative.  Before my mast. the chemo, (God & Prayers) made my tumor totally disappear.  There was nothing there but I elected for the mast any way.  I did not want to take a chance on there being any cancer in that breast.  I had a clean mamogram 3 months before I was dx with cancer.  Triple neg.  most always comes out of nowhere and takes everyone by surprise.  I hope you are doing well with your treatment.  Hang in there. God Answers Prayers Teresa44",
      "MessageIndex": 4,
      "PostDate": "20/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/709376",
      "Title": "Hi!! It's been a while. Teresa44 maryannecb"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Sep 26, 2005 06:54PM Teresa44 wrote: Hello everyone, I am also a newbie on this board. I was dx with breast cancer on Sept. 15, 2004 so I know pretty much what most of you are experiencing. My faith in God and prayer is what got me through this along with a wonderful family. The cancer I had was a hormone negative. It was 6.5centimeters which is very large. It was a fast growing cancer that came out of nowhere. It does not run in my family, I breast fed 3 kids. I always had the cystic lumps so I was already getting mamograms about every 6 months. I knew that there were 2 cysts we were watching in my right breast but the cancer was in an area we were not even concerned with. I had chemo, surgery, chemo and radiation. After my first 3 chemo treatments, I had an ultrasound and my 6.5 lump had just dissolved and disappeared. My doctor just knew that I would have multiple positive nodes, but after the masectomy my surgeon only removed 2 nodes and they were negative. I really and truly believe that God healed me.",
      "MessageIndex": 369,
      "PostDate": "26/09/2005",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/173545",
      "Title": "Starting chemo Sept 05 Pegk susan_02143"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Sep 28, 2005 08:13PM Teresa44 wrote: Dear Prayer, I really like your log in name. It is just so vital in all aspects of this treatment. Are you a teacher? I am a paraprofessional in a self-contained special education class. We have 8 students from 1st-6th grade, none who are severe. During all of my treatments, I never missed a day of work except when I had my surgery, and that was for 9 days. I had 5 treatments of chemo before surgery and 4 Taxol treatments after with 25 treatments of radiation. I would have to have the nuelasta shots after every chemo treatment and sometimes the red blood cell shot. I also had to have 1 blood transfusion and 1 plasma transfusion during the middle of my chemo treatments. I had my 24 year old son shave my head for me when it started coming out after about 14 days after treatment. By the time he finished, we were both laughing. You would just have to know this son. I am still taking nuerotin for the numbness in my hands and feet and also for my hot flashes. Nuerotin works miracles for the hot flashes. I am not planning on reconstruction of any kind. I have always felt that I could lose my hair, my breast and that it would not be nothing compared to what Jesus did for us. I have also never thought God, why me? Instead I thought \"why not me\". God has given me strength through all of this and I thank him for that. I hope to hear from you and others. Do you know of anyone who is also hormone negative?",
      "MessageIndex": 431,
      "PostDate": "28/09/2005",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/173545",
      "Title": "Starting chemo Sept 05 Pegk susan_02143"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Sep 26, 2005 07:22PM Teresa44 wrote: Hello Ladies, I am a newbie on this board so I am just trying to figure out how to post on here.I was dx with b/c on 9-15-04. My tumor was 6.5c. I had chemo, surgery, chemo, and then radiation. After the first 3 chemo treatments, the tumor had dissolved and disappeared. My surgeon took out only 2 nodes which were both negative. My cancer was hormone negative. It was a very aggressive, fast growing cancer that came out of nowhere. I now have about an inch of hair on my head but I sure wish it would grow just a little bit faster. I now have to see my doctor every 3 months. Yeah!!! Me and my doctor both know who my real healer is. God!!! My faith in God and prayer has seen me through the worst of my treatments.",
      "MessageIndex": 370,
      "PostDate": "26/09/2005",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/173545",
      "Title": "Starting chemo Sept 05 Pegk susan_02143"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Apr 27, 2007 07:41PM Teresa44 wrote:",
      "MessageIndex": 53,
      "PostDate": "27/04/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/572835",
      "Title": "Hey girls kimf nguyenthang102"
    },
    {
      "AuthorID": "Teresa44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/11807/profile",
      "Content": "Jun 28, 2007 07:23AM Teresa44 wrote:",
      "MessageIndex": 16,
      "PostDate": "28/06/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/642272",
      "Title": "Moving on Doctor visits as a stage IIIer. Fitztwins Karenfrew"
    }
  ]
}