{
  "AuthorID": "terridan",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
  "Posts": [
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "terridan wrote: Hello, everyone.  I'm new to this site, but appreciate the insight and help everone gives each other.  I am 35 and for the last couple of years I have had radiating pain in my left breast and also noticed more pronounced veins in that breast. A couple of months ago, I also started noticing puckering/dimpling in the nipple area, especially when I raised my arms.  Early in March, I found a lump and went to the doctor.  An ultrasound was done in the office which only showed fibrocystic changes (even though I had complete hysterectomy  at age 26 and take no estrogen) but the doctor went ahead and ordered a mammogram that was done on March 11. The mammo showed that both breasts were dense, with the left one being more so and a suspected focal density was where the metal bb had been placed over lump. BIRADS 4 and now I have a surgeon consult on April 6.  I have a history of thyroid cancer at age 17.  Does anyone know if this can be related and also what a focal density is?  I'm scared about upcoming appointment and have been told by several people that he will usually go ahead and perform a biopsy same day if warranted.  Any advice anyone could give would be appreciated. Danielle Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731778",
      "Title": "Focal Density? terridan terridan"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 1, 2009 11:45PM terridan wrote: Gg08 thanks for your reply.  The US was negative for a cyst, but I'm not even sure a radiologist looked at it, only the tech, and the doctor's physician assistant had not looked at it when she went ahead and scheduled the mammogram.  At least the surgeon I'm going to is one of only 5 dedicated breast cancer surgeons in the state of Arkansas.  Thanks for the information you posted and I will keep updating as I learn more.",
      "MessageIndex": 1,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731778",
      "Title": "Focal Density? terridan terridan"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 10, 2009 01:46PM terridan wrote: jelly-thank you for the words of encouragement gmr- yes mine was an excisional biopsy and it really wasn't that bad.  They used general anesthesia and the surgery only lasted about 30 minutes and I was ready to go home an hour later.  They covered the steri-strips with a large guaze bandage and the pain was very manageable.  My doctor had already called my pain medication into my pharmacy so I didn't have to wait in line for that, just went through the drive thru.  I thought I would have trouble sleeping last night because I toss and turn, but even laying on that side with a small pillow propped under the arm didn't cause any additional pain or discomfort.  I removed the bandage just a little while ago and the incision is no more than an inch long.  My advice would be to take it easy and rest as much as you need to for next several days afterwards and don't be afraid to take the pain medicine because it's much harder to manage if you wait until it's worse to take the medicine.  Feel free to ask any other questions you have and I hope this has helped some.",
      "MessageIndex": 15,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 11, 2009 01:11AM terridan wrote: Also, kibbles I'm glad your results were benign also, sorry I didn't mention that to start with.  I'm glad you didn't have very much pain, I'm actually experiencing a little more than I expected, but maybe that's because it's right next to the nipple?  Hope everyone has a good day and I'm so glad to have found this site when I needed it, will continue checking in to see how everyone else is doing.",
      "MessageIndex": 22,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "terridan wrote: I have been reading these posts for several weeks and everyone seems so helpful.  I have an appt. with a breast surgeon tomorrow after finding a lump in late February and having a mammogram on March 11 that showed a focal density in area of lump.  Ultrasound didn't show anything except fibrocystic changes so I was referred to a surgeon (BIRADS 4).  I have heard that this surgeon will often go ahead and do a biopsy the same day, if warranted.  Can anyone help me with what to expect and what is an average time for getting results?  I also had thyroid cancer at 17 and have heard that this can increase my risks of developing breast cancer 15-20 years later (I'm 35).  I'm nervous about my appt. but at least I have my best female friend going with me. Danielle Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 7, 2009 02:41PM terridan wrote: thank you for the good thoughts and all the info",
      "MessageIndex": 8,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 8, 2009 08:08PM terridan wrote: Well, my surgery is tomorrow and for some reason I am more nervous before this surgery than any other I have had (thyroidectomy, laparscopic, hysterectomy, and some lymph node biopsies).  I don't know if it's the surgery itself or the potential results and waiting for them.  This is the one place where I know others know what I'm feeling and going through.  So thank you for listening and your support.",
      "MessageIndex": 11,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 7, 2009 06:42PM terridan wrote: thank you for everyone's support- I'm just really nervous because my gut tells me something is wrong and sometimes we just have to trust our gut feelings.  I'm supposed to have my results in 48-72 hours but since it's being done on a Thursday, I'm afraid I won't get results until Monday.  The only other appt. to have it done was April 30 and I just didn't think I could wait that long because I had to wait 3 weeks for the surgeon consult in the first place.",
      "MessageIndex": 10,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 10, 2009 01:38AM terridan wrote: Well, I had my biopsy today and am actually not feeling too bad.  The doctor said it looked like a fatty tumor, but I will have definate results by Monday.  My question is has anyone's doctor told them that the appearance of their lump looked like a fat tumor that turned out to be cancer?  I'm starting to relax about results but won't feel totally reassured until pathology report comes in.",
      "MessageIndex": 12,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 10, 2009 02:10PM terridan wrote: Thank you and good luck with your results, also.  I will be thinking of you and hoping for good results for you.  I wasn't told how big my mass was,so I don't know how big my incision might have been.",
      "MessageIndex": 17,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 5, 2009 08:55PM terridan wrote: Thank you both for the help.  I've already waited 3 weeks for this appt. and just so ready to get the waiting part over with!  Yes, I'm lucky to have a friend who told me there was nothing I could say that would prevent her from going with me- and she's doing this after working all night tonight and the dr. is 1 1/2 hours away.",
      "MessageIndex": 3,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 7, 2009 12:14PM terridan wrote: I went to the surgeon yesterday and he said that we have no choice but to remove the lump so I am having an excisional biopsy on Thursday.  Is my understanding correct that this is the same as a lumpectomy?",
      "MessageIndex": 5,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    },
    {
      "AuthorID": "terridan",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81653/profile",
      "Content": "Apr 11, 2009 01:08AM terridan wrote: Lynnea-that's so ok, we are all here for each other regardless of who started the thread.  I got my results today (doctor called me personally) and mine was also benign!  He wanted to let me know as soon as he got them so I could have a good Easter weekend (which happens to be my daughter's 13th birthday) without stressing.  Thank you for everyone's support and prayers.",
      "MessageIndex": 21,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731988",
      "Title": "Nervous about appt. with surgeon terridan Jellydonut"
    }
  ]
}