{
  "AuthorID": "texas94",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
  "Posts": [
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Oct 21, 2014 07:24AM texas94 wrote: Ha- those of you that replied were probably thinking, \"Wow that FAC must have really knocked her out!\" ",
      "MessageIndex": 10,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825143",
      "Title": "If you've had the FAC combo of chemo, please respond! texas94 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Oct 21, 2014 10:48PM texas94 wrote: Thanks Trisha-Anne. I'm trying to rest, but it's such a relief to be off Taxol and able to get things done around the house, it's tough! I'm so happy to hear you have trouble remembering all of this. I can't wait!  flannelette- What in the world were they thinking with that color? That would make me crazy!",
      "MessageIndex": 12,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825143",
      "Title": "If you've had the FAC combo of chemo, please respond! texas94 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Oct 20, 2014 10:53PM - edited Oct 20, 2014 11:19PM by texas94 Ladies, thank you so much for responding! I forgot to turn on email notifications when I posted this (chemo brain!), so I didn't see these until today. I've been wondering why no one responded! :) My onc recently told me FAC and FEC SEs are the same (they're almost identical chemically). If I could edit the title of this post, I'd add FEC. Also, my onc does things a bit differently than the other oncs at MDA, so I don't get steroids with chemo. He only gives a steroid before the first dose of Taxol, since it's more likely to cause allergic reactions. As for my hair- I'm already completely bald head to toe from Taxol (except my lashes and brows, which I've kept with Latisse... we'll see if they last through FAC too!), so no worries there! I felt very nauseous the first few days after FAC, but otherwise, I've felt pretty good. I continue to feel weak, lightheaded and tired, but I have a feeling those will be a constant until I'm able to be active again (which I can't be now, bc I feel a wave of faintness even walking up stairs quickly). flannelette- I'm laughing at the way your hair came back. Thanks for the giggle. After my first dose of FAC, I was very nauseous the first few days, and since then I've had digestive issues, though they're fairly minor so far (I still get nauseous super easy if I think about chemo though!). Heat makes me nauseous almost immediately, but it did with Taxol too, so I guess most chemo makes it tough to handle heat. I agree COMPLETELY about the red dye in the \"A\" (\"E\" in your case). I wondered from the moment I saw that bag if such a huge shock of red dye is part of the reason we feel sick! YUCK. I'd love to know the reason for adding so much dye to something that is already a poison. As someone who cut out artificial dyes years ago, I'd appreciate having a choice in the matter. I also agree with you about Arimidex. I took Tamoxifen after my first diagnosis and had to stop after 3.5 years due to severe SEs (for example, I'd end up places, like the grocery store, and suddenly realize I couldn't remember getting there. I'm so glad I was driving carpool everyday!). This time, my doctors will put me into menopause if the chemo doesn't (I'm 43). Hopefully the SEs of early menopause aren't as bad as Tamoxifen.  Trisha-Anne-  I'M WITH YOU on Taxanes. I was absolutely MISERABLE on Taxol and would take FAC over it any day. I lasted 11 out of 12 weeks before I broke down crying and begged my onc not to give me another dose (thankfully, the next week my scan showed Taxol had shrunk my tumors over 83%, so missing the last dose wasn't an issue, AND I was able to forgive him a little bit for putting me through Taxol in the first place and also kind of acting like I was a wuss about it). FAC packs a punch, but it lets you get up again! The chance to feel better between doses is game-changing. I'd MUCH rather have someone beat me up badly for a few days than have someone punch me in the face every hour for 3 months straight. I can't imagine a world in which my doctor could talk me into Taxol or any other Taxane ever again. I almost lost it the other day when I heard yet another person tell a patient Taxol is the \"easy chemo!\" balance- I'm also surprised to find FAC isn't that common, because at both MDA and Methodist here in Houston it seems pretty standard. My onc says recent studies show E doesn't actually give a long-term edge over A when it comes to heart problems, so since it's 20x more expensive than E, he goes with A. The first few days I was very out of it on anti-nausea drugs (unfortunately, I can't take Zofran), but even so, I remember how much my eyes bothered me the first few days. It felt like someone had sucked out every bit of fluid from my eyeballs and tear ducts and replaced it with sand. I'm already drinking water like crazy, but your suggestion about the eye drops to flush the eyes is excellent! I have a couple of natural moisturizing eye drops I used while having Taxol, so I'll make sure to use them liberally next week. I have issues with low appetite too (as I did with Taxol), though keeping ice in my mouth during chemo does a lot to keep my taste buds working well. If I didn't use the ice, I don't know if I'd ever eat! Thank you all again!",
      "MessageIndex": 8,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825143",
      "Title": "If you've had the FAC combo of chemo, please respond! texas94 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "texas94 wrote: Hi everyone! I'm looking for information that's specific to FAC chemo. I know a lot of chemo drugs are combined differently, but knowing what these 3 will do to me together would be helpful. I'm looking for info on side effects and any tips to manage them, plus how you feel the 3 weeks in between the doses (after Taxol, I'm really hoping at least there's a few days in there you feel rather good). I've already been through 12 weeks of Taxol (hated every second), but I know FAC is very different. The only tip I've heard is to hold ice chips in my mouth during the \"F\" part of the chemo to try and prevent mouth sores, and then of course get the \"magic mouthwash\" from my oncologist and brush with sensitive toothpaste followed by either Biotine or a mixture of baking soda, salt and water.   Also, I can't take Zofran, so what anti-nauseau meds do you recommend? I've had plenty of surgeries, and doctors usually give me Phenergan, which does the job, but it completely knocks me out and takes days to wear off. I'd love to try an alternative. Finally, is neuropathy a side effect? It doesn't seem to be, but I want to hear it from those who've actually been through it! I didn't have neuropathy issues until after the 11th dose of Taxol, so I'm hoping it will continue to wear off, and nothing in FAC will make it worse. I apologize if this is a repeat topic; I spent an hour looking through messages for \"FAC\" and found nothing. As we all know, other patients and survivors are typically much more helpful than our oncologists, who are more preoccupied with killing the cancer than they are managing the chemo experience (rightfully so!). I appreciate your help! ILC 10/2007 age 36 (BMX, 410 gummies, 3 ½yrs Tamox, Oncotype 19). ILC recurrence 6/2014 age 43 (6mos Taxol & FAC chemo, ALND, LUMP, biopatch left sac to keep implant in place, 33 Rads, Oophorectomy & 10yrs Femara). I also had Thyroid Cancer in 2004! Dx 10/19/2007, ILC, 1cm, Stage IB, 0/1 nodes, ER+/PR+, HER2- Dx 6/19/2014, ILC, 1cm, Stage IIIC, 11/19 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825143",
      "Title": "If you've had the FAC combo of chemo, please respond! texas94 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Oct 9, 2014 12:26AM texas94 wrote: Thank you! I looked at those and found them very helpful but wanted to hear the \"real life\" side from another patient or survivor.",
      "MessageIndex": 2,
      "PostDate": "09/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825143",
      "Title": "If you've had the FAC combo of chemo, please respond! texas94 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 3, 2015 01:15PM - edited Feb 3, 2015 01:16PM by texas94 I start rads to my left side 2/16. I'll have 27 rounds plus 6 boosters to axilla, clavicular, supraclavicular including full neck, intramammary, and my entire left chest wall/breast all the way around to the back. Dosage 66 Gray. My cancer is a recurrence, so my RO isn't holding back in the least. I'll also do the deep breath hold, and to make things even more difficult, my RO is working around my 410 implants from my 2007 reconstruction! I've asked him about damage to my heart, not being able to hit all his target areas and offered to remove my implants so many times I'm pretty sure he thinks there is something wrong with me. :) I look forward to hearing what others have to say on this thread.",
      "MessageIndex": 10,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827776",
      "Title": "Anyone with radiation to left chest & intramammary lymph nodes chrissie29 ThinkingPositive"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Jan 22, 2015 01:32PM texas94 wrote: Hi ladies! I begin rads early February after 6 months of chemo followed by an ALND. This diagnosis is my 2nd time around, so RO says my rads will be \"extremely\" aggressive to my entire left chest, side, underarm, and all the way up my neck. I'd love to hear from anyone else who's had rads after an ALND! Also, I know everyone is different, but I've heard people with fair skin don't fare as well through rads. Is this true? ",
      "MessageIndex": 1078,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Jan 23, 2015 03:12PM - edited Jan 23, 2015 03:14PM by texas94 Thanks WndrWoman, CoyoteNV and Nomatterwhat! I know everyone's different, so I have my fingers crossed. I was MISERABLE though chemo and basically home-bound, so I'm hoping I get a bit of a break through radiation.",
      "MessageIndex": 1094,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Jan 31, 2015 09:35AM texas94 wrote: Aj and LaRock- My Onc told me the same about alcohol. When I asked him about drinking, he said one glass of wine every once in awhile. In his words, \"Most evidence points to alcohol increasing the risk of breast cancer, so why would you?\" Believe me, this is NOT what I wanted to hear, but I'll stick to it. I've always been a social drinker plus usually wine at home while cooking, and now I've have breast cancer twice, so in the least, I'm thinking the alcohol didn't do me any favors. I've told my family I'll do everything I can to never have cancer again, so I can't go against doctor's orders. NOT HAPPY! :( I've finished 6mos of chemo and am now 3 weeks out from a Level 3 ANLD (already had BMX 7yrs ago). I'll have my rad simulation this week then 33 rounds of radiation. I have kind of a random rads question... I've been keeping an eye on this thread and am wondering why everyone has problems with their bra during rads. I'm assuming many of you've had a BMX, so why not go without a bra? I haven't worn one all that much since my BMX and reconstruction unless my top is sheer, and even then I almost always wear a tank top instead of a bra (tank without shelf bra). I was thinking to prevent rubbing irritated skin from rads I'd wear a soft ribbed tank under everything Also, who's used Medihoney products? I've heard great things. Which product(s) did you use and how? My plan is Medihoney and Silvadene (regardless of what my RO says... if I've learned anything through all of this, it's that you ladies know MUCH better how to handle side effects!). Thanks!",
      "MessageIndex": 1270,
      "PostDate": "31/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 3, 2015 12:55PM texas94 wrote: RO told me yesterday starting the day before my first rads he wants me to only wash and dry my entire left side from top of stomach to jaw. No lotions or creams until he says so (he'll check my skin every Monday). He says he knows by looking at my skin what it's about to do and will recommend either Aquaphor or something else he feels is necessary. Boy my skin is going to be dry in those areas! I can't remember the last time I didn't slather lotion all over me the second I step out of the shower. Anyone have thoughts about this? Also, I told my RO about a friend who recently finished rads and had terrible, awful burns (also at MDA). He flat out told me, \"I am one of the most aggressive ROs at MDA, if not THE most aggressive, and I don't often have patients with extensive burns or wounds. We can't predict what will happen, but I know what I'm doing, and I'll get you through this.\" Um, more power to him is all I have to say. :) He'll certainly hear from me if he doesn't hold up his end of the bargain! I begin rads 2/16. Because my RO wants to get a detailed digital scan of the nodes up my left side before finalizing the radiation plan, he pushed my start date back a bit.",
      "MessageIndex": 1360,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 3, 2015 05:27PM - edited Feb 4, 2015 05:31AM by texas94",
      "MessageIndex": 1367,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 25, 2015 05:57AM - edited Feb 25, 2015 05:58AM by texas94 magdalene- Frustrating to have the pain on top of everything else, isn't it? It makes me super concerned to start Femara, as I hear the joint pain is pretty harsh (and it's the very best AI for my type of cancer, ILC, so I'm stuck with it... especially since I'm a recurrence!). CassieCat- Thanks for the Calendula tip. I may get some and start sneaking it. :) So sorry about your insurance company issues. It's ridiculous they'd even question your doctor's treatments. quiggy- Oh my gosh! My heart has felt as if it's racing the past day. I hadn't thought about it. I'm getting rads up into my neck, but since I don't have a thyroid (thyroidectomy in 2004), I wonder if rads would still affect my thyroid hormones? Annie- I agree with you 100%. I may be hurting, especially in the morning (and my hands really ache during the night), but it's all better than the alternative of NOT getting a chance to beat this damn disease!",
      "MessageIndex": 1912,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 1, 2015 08:03PM texas94 wrote: mqt64- I'm a BIG fan of circumin/turmeric! My kids and hubby also take it. I've found I can get it on Amazon for cheaper than most stores. Make SURE you get a supplement that also has bioperene OR eat something with pepper when you take it. You need one of those in order to absorb the circumin (which is the anti-inflammatory stuff in turmeric). I found this one recently http://www.amazon.com/gp/product/B00N9J6U0I/ref=oh_aui_search_detailpage?ie=UTF8&psc=1. For the dosage it's a good deal.",
      "MessageIndex": 1320,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 2, 2015 06:47PM - edited Feb 3, 2015 12:40PM by texas94 Coyote- I've been wondering the SAME THING about the fluid buildup. I'm on day 25 with my drain from the ALND, and it's still draining quite a bit, especially now that they have me doing a lot of intense stretches for cording. I don't like having the drain, but I'd much rather have it than fluid build up. I'm surprised drains aren't standard in lumpectomies. Wouldn't a drain be better than fluid buildup? Also Coyote, after going through a BMX with reconstruction 7yrs ago, I honestly think NOT giving mine the support of a bra allowed gravity to help soften and settle them. They look really natural (I love the 410 implants by the way if anyone is trying to decide). Labelle, WndrWoman & yikes1-- THANKS for your replies. DUH... of course most of you have had lumpectomies or BMX but are not yet reconstructed. :) I understand now why bras are a big topic! My situation is a little difference, since I currently have a recurrence. I went through a lot of what all of you are going through 7 years ago. This time, I had 6 mos of chemo, then an ALND plus lumpectomy that removed a large portion of my implant sac (a super duper plastic surgeon used a biopatch to repair it, so I came out of surgery with both implants... I tell everyone I came out \"rack intact\" ha). Next up is rads, ovary removal and 10 years of Femara. It sounds like not needing a bra is going to be a plus during radiation. I've had very few good surprises through this, so I'll take any positives I can get! Coyote, please put my start date down - Feb 16. I have sim next week, along with a digital scan to ensure I had no spread of cancer during chemo (both bc I'm a recurrence AND they found 5 more positive nodes in surgery last monthk, I'll have 27 rounds plus 6 boosters to axilla, clavicular, supraclavicular, intramammary, and my entire left chest wall/breast all the way around to the back. Dosage 66 Gray. Yes, I'm getting absolutely fried, but being a recurrence, I'm ok with it no matter what it does to me. I have to be! My doctor will check my skin every week for signs of problems, but THANK YOU ALL for this thread. It's very comforting to know I have a place to ask questions once I begin this process. p.s. I apologize for the huge attachment in my post above. It looked really small on my phone! How RUDE. :)",
      "MessageIndex": 1351,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 3, 2015 01:36PM texas94 wrote: Congrats PoppyK!!",
      "MessageIndex": 1362,
      "PostDate": "03/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Apr 9, 2015 10:19AM - edited Apr 16, 2015 04:02PM by texas94",
      "MessageIndex": 2722,
      "PostDate": "09/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "May 5, 2015 01:27PM texas94 wrote: Quiggy- I'm so very sorry your'e having such terrible issues. What a very unwelcome surprise after all you've been through! By the way, you're SPOT ON with this: Sure seems to me that cancer doctors are quick to push us all into this defined box of treatments and how we're supposed to respond. When we don't fit in their box, they dismiss the complaint.  I'm 6 weeks post rads and having debilitating muscle pain on my entire left side where I was radiated, front and back, plus lymphedema in chest, arm and hand. I had almost no issues except tightness during rads. That plus the stiffness and pain from early menopause makes every day a fight right now. I began this journey a 43 yr old in great shape and have finally become very, very angry everyone except my PT seems to think it's totally ok for me to feel like I'm twice my age from here on out. ",
      "MessageIndex": 2877,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 12, 2015 07:22PM texas94 wrote: Hi ladies- I begin 33 rounds Monday. I had simulation Tuesday and \"dry run\" tomorrow. They put me on my back with left arm over head and my face to the right. Once I was in position, they squished up the mold around me, labeled it with my name, and put a bolster under my knees. I had a full room with 2 techs, a nurse, my RO and his 2 Brazilian interns. Once they positioned me and told me to stay still, my RO leaned down near my face every couple of minutes and so sweetly detailed everything happening. I liked him a lot already, but I was incredibly impressed with his bedside manner during what's a pretty weird experience for even the most laid back patient. They had me remove my headscarf and my foobs were exposed, but I honestly didn't think about it until afterwards; I think after 2 rounds of this lovely disease, I've just gotten to the point I don't even notice being topless with medical staff anymore. My RO has told me not to put anything on my entire left side until he instructs me to do so, and he'll check me weekly. For those of you who've been through rads, what are your thoughts on this?",
      "MessageIndex": 1653,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 24, 2015 08:47PM texas94 wrote: Oh my goodness this is active thread. Keeping up is tough! I finished rads #7 of 33 today (left side all the way up into my neck). I have a bolus every other day to increase skin reaction, so I'm already slightly pink and a tad warm to the touch. My RO saw me yesterday and said I look exactly the way he wants me to look right now, and if I can make it to Friday with the bolus he'll be happy. He's also told me not to use anything at all except mild soap and water. No creams, lotions, nothing until he says so. I love, love, love my RO and have zero doubt he's going to take care of me, but I have a sweet friend who gave me some European products that are supposed to have a cult following for radiation, so I'm hoping to get to start using them before things get much worse! I've definitely noticed the fatigue already, but RO says he's not surprised because chemo was brutal for me, so I still have a long way to go to build strength and muscle again. I feel like my rads takes a long time; there's so many angles! I also have to hold my breath for every angle, which makes it worse. I seriously think I may hyperventilate one day. :) I know everything above is expected, but I have another question for you sweet ladies: When I started rads I also started having major joint pains (hands, feet, ankles, knees...). My RO says they aren't from radiation and their onset is coincidental (he wants to check my thyroid labs, which I agree may be it), but I thought I'd ask you too. I'm having an oophorectomy Friday and won't start Femara until after rads, so I know that's not the issue. Anyone else have joint pains not in the radiated area during rads? I seriously feel as if I've suddenly developed arthritis (again, it definitely could be my thyroid, and we'll check soon).",
      "MessageIndex": 1904,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 2, 2015 08:17AM texas94 wrote: Hi ladies! I posted some questions a couple of days ago, but it ended up at the bottom of a page, so I don't think anyone saw it. This is such a great group of women I know no one ignored me intentionally! :) Anyway, I've attached a snapshot of the question part of my entry. Thanks! ",
      "MessageIndex": 1328,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/825850",
      "Title": "Winter rads 2014-2015 ILCMom WndrWoman"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 7, 2015 07:52PM texas94 wrote: floridagal- The way it works at MDA is you first see a Breast Oncologist (MO), then they place you with a surgical oncologist (surgeon) and radiation oncologist (RO). When you first meet with your MO, you can absolutely tell them you prefer specific doctors from there (I LOVE my surgeons- Abigail Caudle is surgeon and Jesse Selber is plastic surgeon- they're incredible). I would be happy to share my MO with you, as I love the guy, but I tried to refer him to someone the other day, and he's not accepting new patients at the moment. :( Call MDA and ask for the Breast Center and tell them you want to make an appt with an MO, then go from there. There are 80 Breast Oncologists at MDA (yes 80... if that doesn't tell you too many women have breast cancer, I don't know what will), and they're all very busy. The good news is no matter who you get, they do confer with each other, and if you end up with a younger MO, it's honestly kind of a good thing, because they must share every treatment plan with a more seasoned team (so you have more more drs on your case). Like most breast centers, it's tough to get in quickly, BUT once you're in, things move pretty fast, and they're such an efficient, well-oiled machine, being a patient there is very easy. Feel free to pm me.",
      "MessageIndex": 2,
      "PostDate": "07/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/828277",
      "Title": "MD Anderson surgical pathologist floridagal texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Apr 7, 2008 02:10PM texas94 wrote: Mary, I've had lots of different surgeries (including bilat mastect 12/07), and my BEST advice is if you are someone that is prone to nausea (I am queen of it), be sure to tell them before your surgery, so they can put Zofran or Phenergan (sp?) in your IV.  Lifesaver for me.  Other than that- it's just like the other girls said- you go to sleep talking to someone, then wake up in what seems like a blink.  For me, I was pretty relieved to be put to sleep so I could stop worrying about having a bilat mastect :) EHK",
      "MessageIndex": 15,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Jan 22, 2015 04:54PM - edited Jan 22, 2015 04:58PM by texas94 luckylegs- I have the same question/concerns, and except for the fact all my cancer is on the left side, our histories sound pretty similar, including the ILC (and I'm sure we're equally grateful to be Stage IIIc and not IV!). My RO told my surgeon to leave my implant in place instead of remove it during my ALND surgery. He absolutely feels he can work around it, but I'm with you and have my fears the rads won't reach 100% of the target areas. However, aside from rads getting where it needs to be, 2 other things are in our favor. My plastic surgeon feels being able to keep my implant through rads will result in a better appearance at the end of this road, and he and my RO have both mentioned older reconstructions tend to do better with rads than newer (both the implant and the pocket).",
      "MessageIndex": 8,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/827122",
      "Title": "Safe to radiate the chest wall through a silicone implant? luckylegs64 texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Mar 19, 2008 07:53AM texas94 wrote: Pregopanic, Please be sure to get back and let us know what you find out.  I too had ILC, which is often a thickening, but mine was a real hard lump.  So, yours certainly doesn't sound like mine, so I'll hope it's nothing!!  Is this your first pregnancy? My goodness it really does the strangest things to your body and the boobs are no exception.  I'll say a little prayer for you. EHK",
      "MessageIndex": 2,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/702449",
      "Title": "Thickening in one area pregopanic althea"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Feb 8, 2015 12:54AM texas94 wrote: 36 at first DX, 43 at recurrence",
      "MessageIndex": 361,
      "PostDate": "08/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "May 30, 2008 03:40AM - edited May 30, 2008 03:43AM by texas94 dads_girl, I had a bilateral mastectomy with immediate reconstruction (expanders).  I also had implants prior to that surgery.  My experience is that the reconstruction is much easier than the mastectomy, so it's worth it.  The mastectomy is the biggest hurdle.  However, the mastectomy for me has been a little like childbirth was- it's been 6 months now, and though I remember it hurt, I don't have vivid memories. Also, I personally think it's been very helpful to have had implants before all of this, because some of the numbness and sensations are not totally new to me.  I think I would have been much more freaked out and uncomfortable if I had no \"boob surgery experience\" prior to all of this :) I hope that helps! EHK",
      "MessageIndex": 10,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706060",
      "Title": "Mastectomy w/reconstrcution sarmcl Erica"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Mar 24, 2008 05:59PM texas94 wrote: Goldie, so glad you're doing well.  Thankfully, for MOST of us it's not as bad as we convince ourselves it might be! Beergirl and Steph- also in Houston and had bilat mastect 12/07 (age 36)- just got my expanders out and implants in and what a relief. Good luck to you both! We're in a great city to get sick :-) EHK",
      "MessageIndex": 10,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/702713",
      "Title": "Mastescomy went well yesterday Goldie texas94"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Dec 2, 2014 11:42AM texas94 wrote: Hi SyrMom- I'm very drug sensitive and often have adverse reactions so don't have an easy time on any chemo, but like Spookiesmom above, Taxol was MUCH worse for me, because I never got a break from feeling awful! I'm about to have my last dose of FAC (AC with 5-fluorouracil). My side effects with the previous doses have all been pretty similar. I feel awful with nausea and flu-like symptoms for 4-5 days, beginning within hours of the drip. Then I have 3-4 days I feel much better but am still tired. After that, I feel rather decent until the next dose. After Taxol, these \"decent\" days seem like a complete gift! As for timing before Christmas, if you're planning to try to clean your house, play Santa AND cook the entire feast, I'd say get your dose at least 2 weeks prior (you feel pretty great your 3rd week). If you can take it a bit easier than that on Christmas, I think 7-9 days is doable. The only side effect that has been consistent for me is lightheadedness if I get up or move too quick. However, I really think it's leftover from Taxol (Taxol side effects take weeks or months to fade). Hair- I went bald head to toe on Taxol except for a few straggler hairs here and there, but the first dose of FAC made any little hairs I had left completely fall out. I didn't have even 1 hair ANYWHERE! Then, I suddenly had all this white, thin, super soft growth all over. A couple of weeks later, it started turning brown and has slowly continued to do so, though it's still very soft (which I hear is normal at first). I shaved my head from the moment my hair fell out with Taxol until 2 weeks ago (I couldn't stand the stragglers!), and now I have ¼\" growth on my head. Mouth- I've held ice in my mouth during chemo ever since I started Taxol, and I've NEVER had taste issues or mouth sores. However, during the last FAC the ice made me nauseous (as well as my own saliva!), so I was only able to hold it in for about 5 minutes, and I've noticed this time my mouth is slightly tender in places (taste is ok though). Overall dryness/feet- On recommendation of someone else on this site, I purchased NOW brand food grade glycerine from Amazon and add a few drops to each handful of my lotion, which is already formulated for extra dry skin. The addition of the glycerine definitely keeps the moisture in my skin much more so than lotion alone! The moment I began using it, any issues that were developing went away. I plan to keep using it even after chemo. http://www.amazon.com/Solutions-Glycerine-Vegetable-16-Fluid-Ounces/dp/B0019LWU2K/ref=sr_1_1?ie=UTF8&qid=1417537513&sr=8-1&keywords=now+food+glycerin Pain- I haven't had joint pain or aches with FAC (they were awful with Taxol), but I do take a double dose of Zyrtec on chemo days and for a few after, so maybe that helps? Nails- I've kept mine painted constantly with a good protein base coat (like the OPI one mention above, but I use Nailtiques) and a dark polish and have had no issues with nails in the least. ",
      "MessageIndex": 19,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826476",
      "Title": "Adriamycin (Red Devil) SyrMom SelenaWolf"
    },
    {
      "AuthorID": "texas94",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/62237/profile",
      "Content": "Dec 4, 2014 09:04AM texas94 wrote: Miralax is a essentially tasteless, so you can mix it in anything. I prefer juice, especially orange or apple. I swear I can taste it in water, so I don't use that. Otherwise, you won't even know it's there. I take one dose the night before chemo, another the morning of and then continue it twice a day for two days after (though obviously stop using it if you begin to have the \"opposite\" problem). :)",
      "MessageIndex": 23,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/826476",
      "Title": "Adriamycin (Red Devil) SyrMom SelenaWolf"
    }
  ]
}