{
  "AuthorID": "texrn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
  "Posts": [
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 23, 2008 08:42PM - edited Apr 23, 2008 08:44PM by texrn D1 & Paula - The bc episode on 'John Adams' is the very last one called \"Peacefield\". The scene is much more powerful on screen then in the book, as you can imagine. Actually, I really like Giamatti in this role ,especially portraying Adams in his later years, but I've always been a big fan of his since 'The Cinderella Man'. My dh & I really think they all did a wonderful job. D1 - As far as my eyebrows are concerned, well my left one is all but gone. I have to almost draw them on from memory. I'm so sorry to hear you're still having the muscle pain, but I've read that some of these se's, like the muscle pain & swelling, can hang on for 3-4 months. I'd better go for now - got a lot to do before 'bedtime'.... Therese ",
      "MessageIndex": 2538,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 28, 2008 08:08PM texrn wrote: Hey all - I haven't posted in several days & it feels like several months. I am still trying, 2 months out, to live in the moment & not freak out over every little ache & pain. From all my research on the subject, it seems to be the national standard  not to do scans as part of the routine follow-up for early stage bc. The theory is  that the lag time between something showing up on a scan & symptoms appearing is about 4 months - & either way, there is no difference in type of treatment, efficiency of treatment, or survival rate. Plus scans are expensive & can have a high rate of false-positive results. As far as tumor markers go, false positive results are common as well - I was told that they were only a reliable tool with recurrence & mets ( haven't researched that yet ). Since my onc seems to follow the nat'l standard, I've decided not to live from test result, to doctor visit, to test result, etc.... I'm trying to stay active & focused in my day to day life, & make every day count for something. It looks like I have a lot to catch up on, plus I have a lot to share about my 5k Race last Saturday - but, alas, I have some studying I need to catch up on first...I'll check back in later for some shout-outs & updates!    Therese p.s. Hope all is well with everyone.",
      "MessageIndex": 2615,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 7, 2008 11:38AM - edited May 7, 2008 11:58AM by texrn HOLA! everyone, ( I know, I'm a day late ) Well I survived ‘ta-ta Tuesday' - had my exchange surgery yesterday! It hurts more where they did the contouring with the liposuction under both arms. I am all wrapped up in an ace bandage until tomorrow, so I don't know what they look like yet. I'm a little groggy from the pain meds, but I don't anticipate having to take them beyond today. I, too, received my secret pal yesterday - I'm pretty excited to get started! I'm going to try a few shout-outs since I haven't been around for a few days. If I forget to finish sentences, or if I don't make any sense - it's the pain medication talking - I am very sensitive to any kind of pain med. Kimberly - Wow, I just love Michael Buble - sounds like a great concert! It also sounds like a fun way to squeeze in a workout. And now, a getaway to Sedona for a long weekend - wow girl, you're living the life! I'm so excited for you. My ps had said that she would only have to use drains if she had to manipulate any tissue or muscle, or if any empty pockets or space were going to be left behind. In my case, the implants fit snug into their respective pockets, so their were no empty spaces left behind, & the only manipulation was from the liposuction - so no drains for me. D1 - You are definitely heading to the finish line w/ your rads. Just like you said, before you know it this will all be over! I really enjoyed reading about your emotional experience about being able to be there for that couple. Bc has definitely given all of us a gift by allowing us to be there for others, & by giving us the opportunity to pay-it-forward. That in itself can be very healing for all of us. Thanks for posting those SP questions - you always seem to say/ask what we all are thinking.   KathyL - The first week on the job can be very mentally taxing, bc or no bc, I can just imagine it taking so much extra energy to focus & remain engaged. Change is not always easy, but almost always worth it. Just like you said, take it one day at a time & before you know it you'll have this first week behind you. Paula - saw you're the video clip from your 5k (?) walk the other day. I am so impressed that you were up to getting out there having just finished chemo tx's a week before (?). Loved the do-rag & the hat.  I must say, though, you look very familiar. You must know how it is, though, working with the public like I do, everyone looks familiar. Good luck to you & Joan on Rads today. I'm sure that D1 has been a great source for information, being that she has paved the way. Julie - I am so sorry to hear that your migraine is back. 1 more week to go for your next big milestone. I have had absolutely no regrets going the expander-implant route. Like I said, for me, the 1st 2 fills were the hardest w/ the muscles tightening up, but the Valium really did help. Kimberly - I agree, walking can sure poop us out, but it's a good \"pooped\" feeling. Plus, in the long run it sure helps keep that energy level up. I, too, am all for the, \"parking lot workout\", being an integral part of any workout regime. Patty - I am so glad surgery went well for your sis. Going through something like this together has got to be so emotionally draining for both of you right now, but hopefully very emotionally rewarding in the long run. Am still praying for the both of you. Dana - so good to hear from you & CONGRATS! on the 98 on your test. You are truly an inspiration. I'll have to try more shout-outs later - time to go sleep the rest of this pain pill off...( I've only edited this post 10 times already ) I'm thinking of all of you, Therese",
      "MessageIndex": 2725,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 9, 2008 05:53PM texrn wrote: Good evening everyone, Just a quick check-in. I'm 3 days out from my exchange surgery & feeling pretty good in the pain department - been off the narcotic pain meds since yesterday. Unveiled the 'girls' yesterday, too. I'm very pleased - of course, my ps says it will be 2-3 weeks until they relax & 'fluff' out. A little bruisey along the sides & some diffuse swelling all around, but nothing I wasn't expecting. I'm supposed to wear a sports bra 24/7 for the next 2 weeks ( I bought a surgical/sports bra that zips up the front ). I think I am hungover from the anesthesia & 1 1/2 days of narcotic pain meds, b/c I'm pretty wiped out today. No pain or nausea, just sleepy tired. I started driving today - took my oldest dd for her annual physical, & then went to the twins' elementary school for field day - stayed until lunch time, then came home & crashed. Of course it didn't help that it was 92 today. I went back to their school for the last part of field day, then picked up dd at school, brought them all home - &...you guessed it...crashed again. I already called work & told them I won't be in tomorrow - I don't think I am up for 2 - 12 hour shifts in a row - my ps had said I could work this weekend provided I got help w/  the physical aspects of my job. My manager & coworkers have been very helpful & understanding - their response today was,\" duh - we told you you wouldn't be up to working tomorrow!\". I've got to go freshen up - am taking my 2 dd's to see a local youth production of 'beauty & the beast' & my dh is taking my ds to see the Rangers play tonight ( they play Oakland ). My ds is a fanatic about baseball, actually any sports for that matter. He wakes up early before school so he can watch ESPN or any TVO'd Ranger game he has missed. I have to admit, his enthusiasm is contagious. Hope you all have an awesome Mother's Day!! Therese ",
      "MessageIndex": 2755,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 9, 2008 09:11AM texrn wrote: Kimberly - there is definitely some good thoughts & prayers coming your twinsis' way from Texas! It's comforting to know she has a sister like you to lean on. LJ13 - I had a case manager after my mastectomy surgery - she called twice over a period of about a month. When she realized I was on the 'right' track, heading towards chemo tx, she signed off. Actually, I didn't feel she was really into her job because her phone calls felt like a waste of time, for both of us. Carol - I had a strong feeling my 'monthly visitor' was coming because my hot flashes stopped abruptly back in June. My onc had told me that at 46 I had a 50-50 chance of remaining in permanent menopause. With me being triple neg. he wasn't overly concerned with what side of the 50-50 split I ended up on. Oh well - I see my gyn next month for my annual check up... Paula - sounds like you're busy, busy, busy...How is your dh doing? You both are in my thoughts & prayers. Like others have mentioned - I read the posts often, it's just finding the time & energy to thoughtfully respond & interact with the group. You all are so chatty & at the same time, articulate, that it's hard to keep up, especially when one skips more than a few days at reading the posts. With that said, I must be off to run some errands..... Therese",
      "MessageIndex": 3804,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 29, 2008 10:16AM - edited Oct 29, 2008 10:25AM by texrn Carol - it really hurts when those closest to us still don't get it. even after we spell it out for them! I told my dh a long time ago to spare me the one-liners, the platitudes, & the pep-talks! I don't need someone lecturing me on what my priorities in life should be, or how I should be looking at things b/c I already know, in my head, how I should be handling things, & he would just be preaching to the choir! Our feelings don't usually have anything to do w/ what's rattling around in our heads, they have to do with what's in our heart, & we can't help or control how we feel. Like Kimberly said - our loved ones can't ever really completely understand what we've gone through -  All they can do is  listen to us & acknowledge how we feel (without lecturing), & then keep on listening to us until we feel better! It took awhile for it to sink in, but I can really sense that he's trying. Nevertheless, it's still comforting to be able to come \"home\" to this site for an ear to listen & a shoulder to cry on. Don't worry about the change in topic here - it's like any other relationship or friendship...for better or for worse....we're here for ya!! Therese ",
      "MessageIndex": 3883,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Dec 23, 2008 11:24AM texrn wrote: Good Morning everyone, As per usual, it's been a long time without a post..I lurk a few times a week, so suffice it to say, I keep you all in my thoughts & prayers daily. Joan - I am so very sorry to hear about your mother's passing. May you find peace knowing she is without any pain or suffering. KathyL - I am so sorry you are having to go through the agony of waiting & wondering...& waiting & wondering. Hang in there - your symptoms, being so transient, sure sound like they are what Julie has described to you. As far as the MRI of the brain go, I had one 1 year ago, one week after my breast MRI ( for a month long headache ), & I can say that the 'waiting & wondering\" is much harder than the actual test. My thoughts & prayers are with you. Julie - Congrats on the new nips & the new car!! Last Aug/Sept. I, too, got new nips & a new car! As far as the new nips go, wow! what a visual difference they make - I no longer have that 'constant reminder' every time I look in the mirror. As far as the car goes ( got a 2008 GMC Acadia ) - well I forgot how much fun it was having a new car. It's a cross-over SUV, so it drives just like a car - which is what I was aiming for because I so hated driving my Suburban. I bought it is a birthday present to myself, since I am into celebrating this year! A JJ reunion anytime & anywhere sounds great! Since I am centrally located, a plane ticket should be about the same to either coast, & regardless of geography, it I buy my ticket with enough of an advanced notice, the prices should be more reasonable. I, myself, am not going to bring my dh ( there are a lot of factors at play there ). Carol - your puppy dogs are adorable! Also, a very belated thank you for your compliment on my picture. Regardless of anyone's religious persuasion - I just want to wish you all a very blessed Christmas & holiday season, & a New Year filled w/ good health, good friends, & precious memories! Therese ",
      "MessageIndex": 4098,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 11, 2009 03:59PM texrn wrote: Just my 2 cents regarding our Reunion Tour - Sun.- Wed. would work the best for me since I work on the weekends only. Whatever works for all of us! Just let me know when & where I sign up. Have a great week everyone! Therese",
      "MessageIndex": 4227,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 12, 2009 10:46PM - edited Jan 12, 2009 10:51PM by texrn Vettegal - Loved the pix of Laguna Beach CA - Brings back a lot of memories. Way back when, I lived in Newport Beach, got married in Laguna Beach, then we moved south to Dana Point CA. The only thing next to my db that I miss the most from CA is the beach!! I just love the ocean - & of course, living up here in North Texas I'm quite a ways from water. D1 - I would love to see EJ again in concert. He is one of the few people I would see over & over in concert! Growing up, he was my idol - w/ posters all over my room, etc... Carol - So how about Sun. 7/12 - Wed. 7/15? I could easily take a vacation day on Sunday, & farm the kids out for 1/2 a week. Have never stayed at Planet Hollywood, but honestly it doesn't matter where I stay as long as it's on the strip, if not. then easily accessible to everything...since I'm in training for the 3Day, it wouldn't hurt me to have to do a little walking.  Paula - I'm sending more heartfelt thoughts & prayers your way today...., & everyday... Kimberly - Sending some 'Get Well' vibes your way - winter can be dreary enough as it is, w/ out adding feeling like crap into the mix. Maz - until we hear otherwise, I remain hopeful & optimistic... Gotta go help dd study her vocabulary words..... Therese",
      "MessageIndex": 4242,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 12, 2008 12:28PM texrn wrote: Hi all, Just checking in - I'm on day #15 post chemo #1. My \"other\" hair started coming out in clumps on Thurs. while I was in the shower & I swear I didn't know whether to laugh or cry - it looked & felt so strange. The hair on my head starting coming out in handfuls, yesterday. I had heard that sometimes your scalp hurts, or feels tingley right before it starts to fall out - but I haven't felt anything. My 6 year old son got a kick out of pulling my hair out, but my 2 daughters, ages 6 & 11, only wanted to watch. After a few laughs, I had my husband, & son, shave my head. I have several bald patches right now, so my head kind of looks like the moon. I'm glad to finally get over this last \"big hump\". I tried on all my hats, turbans, scarves, & my wig - so far, I prefer the scarves & turbans for comfort reasons. I ordered a skull cap/scarf pad to wear under my scarves, turbans, etc. because when I went out of the house to my daughter's basketball game this morning, my head still froze wearing a thick, warm turban. Plus the turban felt like it was going to slide off. Deb & Kimberly - I know what you mean by being & tired & not having any energy. I'm fighting a cold right now, but way before I got a cold, I felt like someone turned the light switch \"off\" on my energy. I feel tired & drained, but not sleepy. After my daughter's basketball game, I felt like going straight home & curling up on the couch - which is what I did. I need to rest up - we have 2 more games this afternoon. Hope everyone has an uneventful, \"feel good\" weekend. Will check in later.........",
      "MessageIndex": 490,
      "PostDate": "12/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 28, 2008 07:05PM texrn wrote: Just popping in to say Hi! I have to say, I so enjoy reading everyone's posts - I feel like you all express yourselves better than I do. I've been on other threads, but, in my opinion, this one has so much momentum & comradarie, I feel more at home here ( even if I'm just lurking most of the time ). I had my 2nd treatment on the 18th - once again, I had the full range of GI symptoms, and each symptom was worse this time. The se's started a few hours after I got home ( w/ diarrhea ), & lasted until a few days ago. However, even though last week was the worst ever, I feel like this week is going to be the best ever - I feel really good today!  I am hoping my bad se's after this last treatment are a fluke & not a trend. I'm not even going to have any expectations about tx #3 - I'm just going to go in prepared. I do not routinely receive the Neulasta shots the day after my treatments - so, instead of bone pain, I had very bad flu-like muscle aches & pains. We'll see what my blood counts are this Friday.  Anyway, I wish everyone a good ( se free! ) week. Therese",
      "MessageIndex": 925,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 9, 2008 11:56AM - edited Feb 9, 2008 12:19PM by texrn Hi all, Sorry I haven't posted in awhile - have been to exhausted & too busy to do nothing but lurk - please know that you all have been in my thoughts & prayers, daily. Had my 3rd tx yesterday - 3 down & 1 to go!  The SE's after my second tx were worse than the 1st, starting immediately after I got home & not easing up until days 9-10. I think with this 3rd tx, I am continuing the trend ( darn, I was hoping last time was a fluke ). I started getting nauseated, right away, during my treatment - had been pre-medicated w/ kytrill & decadron, & also took some pepcid & tylenol before I left the house ( had h/a & indigestion during the 1st tx ). Anyway, they ended giving me 2 doses of Ativan throughout this treatment...which ended up doing the trick. So far, some nausea, but under control, as I am able to take in a full liquid bland diet - plus, no diarrhea...yet. Plus, I'm pretty tired & feeling kind of BLAH ( you'd think I'd be used to those 2 feelings by now ). I'm taking Zofran, Phenergan, & Pepcid to keep the nausea & indigestion at bay. The fatigue had pretty much lasted the whole 3 weeks this last round. I did, however, have bursts of energy - but I still needed to nap/rest at least once a day. The first week I was down- for- the- count for the whole week, which I think contributed to the exhaustion that occured during the 2nd week. The 2nd week I had to play \"catch up\" w/ all the chores, errands, kids, ,my exercise routine, etc.. & the 3rd week I was busy trying to \"get ahead\" w/ all those things - & still trying to squeeze in a nap or 2. I think what has been a big factor in my exhaustion is that after the second round, everything hit me, not just physically, but mentally & emotionally as well. The last 5 months have been quite a ride ( as you all well know from your own experiences ), but I have tried to be very proactive, positive, & upbeat, always looking forward. But looking forward can make everything seem like it's going in slow motion...which can be agonizing. With all the down time I've had over the past 3 weeks, I've had a lot of opportunity to look backward over the past 5 months - looking back, though, makes everything seem like a whirlwind, which can feel overwhelming. Wow,  it's amazing how perspective can effect attitude!  I've resolved to continue to look forward with hope & faith. Along w/ my GI se's, I've had a lot of muscle aches & joint pain, including some muscle spasms, i.e. charlie horses. When ES Tylenol doesn't help, I take Alleve - & of course, rest. My onc says thes se's are not uncommon w/ my course of tx ( TC ). I have not needed any Neulasta/Neupogen shots, as my blood counts dropped as expected during my nadir, but they were not dangerously low - w/ in a week they popped back up on their own. Although, I am no stranger to giving myself shots, if I had to - I went through 2 + yrs of infertility treatments. As far as bone pain from the Neulasta - I have heard that Claritin helps a lot. The metallic taste for me,  usually lasts 10-14 days - I find that tart things & salty things help. I've lost about 75-80% of my hair ( shaved it on day 15 ). Some hair is still growing, but I think when I'm done w/ my tx's, I'm going to shave it all again, so it will all start growing at the same time. My eyebrows & eyelashes are thinning. The other day my brow area was itching over one of my eyes, so I scratched it...I found eyebrow hairs in my nails & a bald spot on my eyebrow ( note to self & others: don't scratch if you're eyes or eyebrows itch ). As far as chemopause: My last cycle started on Christmas Eve, & lasted for 3 weeks, then........nothing. Some mild hot flashes, but nothing frequent yet. My onc says 50-50 chance that menopause will happen. I'll be 47 this year, so I'm mentally & physically ready! As far as neuropathy goes - I get some transient eye twitching ( some people think I'm winking at them ) & some rare, transient, tingling in my fingers. I know there are some herbs & vitamins I can take for this - will have to discuss w/ my onc when I see him. Anyway, that's it for my laundry list of se's - hope it helps some of those behind me in treatments, in knowing what to expect /w each successive treatment. Although, I do realize that everyone is different in how they respond to chemo, & that each treatment can be different, some of our se's are similar. My onc says I should be back to \"normal\" ( definitely a relative term ) by summertime - I told him \" I hope so \" - & he looked at me, rubbed my back & said \" you are going to be fine!\". With all the thoughts that have been going through my head over the past few weeks, that comment REALLY made my day ( because I decided to take it in its broadest sense )! Thank you all for being here ((((HUGS & PRAYERS)))) TO ALL OF YOU!!!! Therese",
      "MessageIndex": 1191,
      "PostDate": "09/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 11, 2008 01:57PM - edited Mar 11, 2008 02:24PM by texrn OK, my story.... First off, only family hx is a maternal first cousin who was diagnosed 2 1/2 - 3 yrs ago...& is doing great! Have always been pretty diligent about annual mammograms, & clinical exams, but was only occasionally diligent w/ my SBE's - 6-7 months out of the year. I found the lump in the shower while doing my SBE ( Sept 13 )- it was late at night, dh was out of town, & all the kids were in bed - I admit it was the only time throughout this whole ordeal that I panicked. I called my dh, woke him up, told him....& instantly felt better! Saw my gyn the next day - he said he thought it felt like a cyst, told me to wait a monthly cycle, then go to the breast radiology center to have an US & possible biopsy. Instinctively, I knew it was bc, but I waited anyway. Had a digital mammo, US, & biopsy on Oct.15 - radiologist told me that day she felt very strongly it was bc. I wasn't surprised, as I had spent the last month studying mammo, & US images on the computer to help me visually differentiate between a cyst, mass, etc. - only because I don't like surprises. Got the call on Oct.18 - IDC on the right. Saw the bc surgeon & the ps the following week. The week after that I had an MRI of both breasts & an MRI of the brain ( I had been dealing with a month long headache as well ). MRI showed nothing new on the right & nothing at all on the left ( brain MRI - negative ). Because I am an \"all or nothing\" type person who tends to worry a lot, I made the very personal decision to have a bilat. mastectomy ( Nov.13 ). I also chose to have immediate reconstruction w/ expanders bilaterally...with absolutely no regrets. I can totally relate to the old adage 'be careful what you wish for' - the 18 months prior to my diagnosis I had joined Weight Watchers,  lost 40lbs., then with the help of a trainer started working out 5 days/week. I was in the best shape I had been in, in a long time - but kind of sad with the toll the weight loss, breast feeding 3 kids, age, etc., had taken on my breasts. I was starting to consider a reduction &/or lift ( I was a DD ) - so believe me, from now on I am definitely going to be careful with what I wish for... As far as my bout w/ se's from this last(#4) tx - GI wise, I just have some residual numb taste buds, & occasional heart burn. It's the fatigue that's hit me much harder this time. I am so, completely, mentally & physically exhausted, that even though I feel excited about being done...if you look at me, you can't tell - I'm in total spaced out mode most of the time ( that is, in between naps). So far, my nails have survived, but I'm still losing some hair, & eyebrows & eyelashes are really thinning. My skin is pale & washed out - so, all in all, I look pretty horrific....but I'm too tired to care right now. My thoughts & prayers are with all of you, Therese",
      "MessageIndex": 1808,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 26, 2008 09:58AM texrn wrote: Hi all, Hope everyone had a blessed Easter! We went to Louisiana ( where my dh is from ) for a long 4 day weekend - it was great! My dh's family has a mini-family reunion every Easter at his cousins farm that my dh & dk's go to every Easter - I've been working the \"weekend plan\" for the last 5 years, so this is the first Easter in a long while that I've been able to attend. I can see why my dk's look forward to it so much - there was an amazing spread of food ( thank goodness my taste buds came back to life! ), an Easter egg hunt, 4-wheeler trailer rides, & fishing for the kids ( his cousin made homemade poles for all the young ones...about 12 of them ).  Had my first follow-up with my onc on Monday...I don't see him again until July. I'm feeling pretty good except for some occasional indigestion, & persistent muscle & joint pain ( for which I take Alleve ). The fatigue has gotten a lot better - & I'm 3 1/2 weeks out from my last tx - so there's hope for all of you coming around the bend with the cumulative fatigue. I see the ps next week to schedule my exchange (implant) surgery - probably for the latter part of April. My eyelashes & eyebrows are still thinning...hope I turn the corner on that sometime soon b/c sometimes I can't bear to look at myself in the mirror - at this point I think I look worse than I feel.  The hair on my head has stopped coming out & the white hairs are starting to grow - but I still look like a plucked chicken up on top...& down below. So far so good with my nails. All in all, I'm doing well - each day is better than the one before & my wonderfully full life is getting back on track - which is a blessing b/c it keeps me focused forward. Have only had a chance to glance over the posts from the last week - Vettegal - I am so sorry to hear about your sister's recent dx w/ bc - wow, your family sure has it's hands full - you, your mom & sis will be in my prayers. KathyL - Thanks for the info on BRCA testing. I am scheduled to see the genetic counselor next week to have my bloodwork done. Dana - you sound so full of life - I am so glad you are taking moments out of your busy schedule to rest & regroup. I think about you everyday. I will try & catch up later on - my refrigerator is completely empty, so I need to run to the grocery store - first time in months without my dh's help. Have a great day! Therese",
      "MessageIndex": 2106,
      "PostDate": "26/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 31, 2008 09:06PM - edited Mar 31, 2008 09:08PM by texrn Yes, I am interested in joining in the \"secret Pal\" gig - just let me know whatever it is I need to do. Welcome home! to all of you who have been away. In the future, a getaway for all of us, when everyone is ready, sounds like a great idea...just let me know when & where! Good luck to all those stepping up to the bar this week - may your se's be few & far between. It's funny - I lurk & post on different conversation threads & even on different sites, but I always come back to this thread for some reason - I guess I just feel \"at home\" here. Even when I have nothing to say or add, I find myself wanting to check on you all at least every couple of days. So on the days I don't take or have the time for shout-outs, please know you all are always in my thoughts & prayers. Therese",
      "MessageIndex": 2207,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 7, 2008 08:55PM texrn wrote: Judy - I am hoping and praying the Xoleda works for you - I, too, didn't realize you had been going through this for so long. My heart goes out to you. Please keep in touch & let us know how you're doing. Therese",
      "MessageIndex": 2301,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 11, 2008 07:55PM - edited Apr 11, 2008 07:56PM by texrn Hi all, Wow, everyone's been pretty chatty this week! Although, I think about everyone all the time, I haven't taken the time lately to do any shout-outs, so here goes... Kimberly - It is so good to hear you are turning the corner - your beautiful posts have been conspicuously absent from this thread. I have my cards all ready to mail, but I've been holding off until I had word that you were feeling stronger. Congratulations! on your upcoming final tx!! Jenn51 - You too are coming up on your last chemo tx! Hope the pleuritic pain has subsided. I, too, got very fatigued from the Taxotere - it finally subsided about 3-4 wks after my last tx. BTW, loved the photos of your beautiful gs & your cute dogs! Vettegal - My thoughts & prayers remain with your ds. I completely understand about the post chemo fatigue - in time, it'll definitely pass. I'm sure the stress from worrying about your ds is just as draining. sista2 - Hope your 2nd Taxol tx went well yesterday (?) That's interesting about the skin problems from your jewelry - but it's not surprising considering all the chemicals we have going into our bodies combined with the hot flashes/night sweats, etc.- who knows what's oozing out of our pores. JulieK - Yay! for your last tx next week, 4/17 (?) - hope that means it'll be your last round of migraines & insomnia too. I'm an AI too...was very disappointed & surprised at who was eliminated last night. I know someone has to go every week, but can think of a few others who should have preceded him. Paula - Hope your visit to the bar today went well. Are you seeing the light shine at the end of the tunnel yet, for this leg of your journey? Before you know it..... Carol - Hope your ds's race went well today. I don't know about you but I sleep, & nap, real well in hotel rooms. Anyway, hope your day goes well. Deb102307 - You're almost there with one more tx to go!! Kris - congrats on your last AC! Is it on to Taxol  for you? D1 - almost 1/3 done with your rads! By this time next month.... KathyL - as far as the cards go - I just put likes/dislikes/hobbies/etc.. I'm with you on the results on AI last night...most definitely 3 others who could've/should've gone before him. This is the first season I've watched from the beginning - it's also one of the few things the whole family is interested in on TV. Maz - Glad to hear this week's tx went well - only one more to go! I'm glad you have a therapist that's working out so well - trying to get through your own journey & at the same time trying to be there for your friend, is a lot to keep bottled up. My heartfelt prayers are going out to your friend Val. DCmom - Welcome! You've come to the right place - this is a great group of women! Dana - I pray you're doing okay... I, myself, am doing pretty well. Survived my first weekend back at work. I was tired, but a good tired - it really helped in getting my sleep schedule back on track. I wish everyone a beautiful weekend! Therese",
      "MessageIndex": 2357,
      "PostDate": "11/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 15, 2008 09:36AM texrn wrote: CathyCA - I'm definitely walking the 5K. I used to run back in my 20's when I used to live in Newport Beach, but even back then I only did it b/c I enjoyed the scenery & really not the running. That whole area of south Orange County is beautiful - I was born & raised in So Calif. & lived there until I was about 35, then we moved out here to the Dallas/Fort Worth area to be near family ( my ds & her family moved out here about 17yrs ago &  my parents retired out here about 15yrs ago ), plus my dh is from Louisiana & he has family out here in Dallas as well. As beautiful as Dana Point was, I really like it out here mainly b/c I'm near the people that I love the most & my children & their grandparents are a part of each other's everyday life...so life is good! I guess if I miss anything about CA, besides my db who lives in Chino Hills, it's the ocean & the hills. Anyway, speaking of walking - I must head out to the gym. Hope everyone has a beautiful day! Therese ",
      "MessageIndex": 2407,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 19, 2008 09:01PM - edited Apr 19, 2008 09:06PM by texrn Happy Saturday everyone,  TinaLee - Wow, what a wonderful support system you have, & a great boss to boot! As far as my hair goes - I am 7 weeks out from my last tx, but the reason my hair is only 1/4 inch is b/c every couple of weeks, as it fills in, I take the clippers & even it out to a 1/4 inch. I feel better going 'topless' when my hair is even all the way around. I'll probably stop doing it when it's all filled in. Paula - congrats to your ds on his homer & induction to the NTHS! (same ds?) Yes, I am back to working every weekend - it's actually great to be back in my old routine & to be working w/ my wonderful co-workers. I do have next Saturday off, however, to walk in the Race for the Cure 5k ( with my co-workers ) - I'm very excited b/c this is something I've always wanted to do, but I've been on the weekend-plan for several years now & even though I get 4 1/2 weekends of vacation/year, I tend to use my vacation time for family-related special events & family vacations. Speaking of 'cations...  D1 - I hope you & your family are having a great time up in White Plains. CathyCA - hope your ds listens to you & his doctor & goes in for his strep test. My ds is feeling better after only 24hrs on antibiotics - he was bummed, though, that he had to miss his baseball game this morning. Carol - I'm sure your ds is bouncing back quickly after a day or two on antibiotics. As for the strep in my house, this time it was just my ds - my 2 dd's both had their infections in the last 6 weeks or so, so I'm 3 for 3 so far in 2008. It is amazing how quickly kids can bounce back - it seemed like only a few hours after starting antibiotics yesterday that my ds was walking around the house whistling ( a newly acquired talent of his ). Well, I hope everyone is having a nice, relaxing weekend. I just got home from work & my dinner is re-heating up in the microwave -  my dh cooks dinner every Sat/Sun since I don't get home until around 8-ish - being  from Louisiana, he actually loves to cook. Later... Therese",
      "MessageIndex": 2474,
      "PostDate": "19/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 16, 2008 06:39PM - edited May 16, 2008 06:42PM by texrn Hi all, Just checking in - have been lurking a lot, & posting a little, since my surgery - I don't know why... I decided not to work at all last weekend, so it was nice to have a Mother's day off (1st one in about 5 years). Doing pretty well post-operatively - things are healing up pretty well, & the 'girls' are looking pretty good considering they aren't completely 'fluffed' out yet. I'm scheduled for nipple reconstruction at the end of August, when the kids are back in school...onward & upward! I want to apologize to my SP - haven't mailed anything out yet, as I haven't been doing too much driving since my surgery. I'm ok'd to drive, but the first week I was on hydrocodone for a lot longer than I expected, & of course once I was back to 100%, I developed a nasty sinus infection when I woke up on Tuesday. I was so dizzy ( I get that way w/ sinus infections ) that I barely could drive myself on Wed. to my primary doc. I'm on antibiotics now & feeling pretty good - finally made it to the grocery store ( hadn't been in almost 2 weeks ). I've also been studying a lot - just finished up a course online (it's taken me over 6 months only b/c I've been a little sidetracked since last Fall ) - good news is I got a 96% on the final & a 97% in the class. Signed up for the next class today. Plus I'm also trying to catch up on some CE courses which are required at work. So to make a long story not so long...if there is anyone out there participating in the SP club & you haven't rec'd anything from your SPal...my apologies - I plan to get on it right away. Kimberly - I applaud your decisiveness. Statistics aside - these are very personal decisions, & only we know what  will give us true peace of mind. If it feels right, then it's the right decision for you - & I say \"more power to you\"! LJ13 - congrats on your MUGA & PET scan results! & for being able to schedule your surgery - in my book that is progress. Throughout this journey of ours it is always a relief to be able to cross the 'unknowns' off of our list, one at a time. Kathy - pretty funny about your ps's comment on only being able to draw circles - good thing she didn't go into architecture or engineering - haha. I\"m happy you're able to spend some time w/ your mom - I agree w/ the others - hope you can have some Kathy-time, while your kids are bonding w/ their grammy. D1 - great news on the le!! That, too, is progress! At least you know you're doing everything you can to treat it & hopefully prevent further exacerbations. Carol - Did your 'cough-cough' flare up today? Hope you were/are able to enjoy some sunshine. I'd better go - taking the dd's out for another night out at \"the theatuh\" - my dh & ds are, once again, going to a Ranger game. I'll try to check in from work this weekend & work on more shout outs. Take care & have a beautiful weekend, Therese",
      "MessageIndex": 2826,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jul 27, 2008 10:35AM - edited Jul 27, 2008 10:36AM by texrn Hi All! Sorry to have been gone so long - between playing \"cruise ship director\" to my children this summer, occasional small get-a-aways as a family, working, & studying, w/ a few computer problems thrown in, I ended up being out-of-pocket longer than I had planned. My, you all have been busy!!! Since I'm posting from work I don't have time for individual shout-outs, but, overall, everyone sounds like they're moving right along! I had my first follow-up appt w/ my onc last Thursday...and all is well. Only had a physical exam & labwork done - but it all looks great & I feel great!! - so I'm good to go for another 4 months/40,000miles until my next follow-up! Next visit he's going to throw in a chest xray ( will have one annually ) with the labwork. I was somewhat anxious about this appt for a few days prior to the actual appt -  but now that I've made it through yet another \"first\" hurdle, I'm feeling like I'm finally on my way to making it to the \"other\" side of all this. Yes, I know I have many follow-ups ahead of me, but making through my \"first\" one feels like a small accomplishment. Like they say, 'it's the little things that matter'. I'd better get back to work - you all are continually in my thoughts & prayers. Take care, Therese",
      "MessageIndex": 3502,
      "PostDate": "27/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Sep 12, 2008 04:38PM texrn wrote: D1- positive vibes are going out to your sister from way out here in soon-to-be-soaked Texas! Hope everyone has a great weekend! Therese",
      "MessageIndex": 3713,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Sep 14, 2008 03:13PM texrn wrote: Hey all, Since I'm up in Dallas ( 6-7hours from Houston), & Ike veered right once it made landfall, all we got was a little wind & rain & a very pleasant drop in temperature. Went last night to see the Eagles in concert...they were awesome! It was an early birthday present from my sister & her dh to me & my dh ( his bday is a day before mine). My bil had bought 8 tickets in the hopes of selling some to make some $, but he decided to treat his wife (my ds) & 6 other family & friends to the concert ( my ds' bday was last week).. Talk about some quality music & entertainment! Hope everyone is having a loverly weekend. Therese",
      "MessageIndex": 3723,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Nov 6, 2008 04:48PM - edited Nov 6, 2008 04:51PM by texrn Hi All! Just a quick check-in - the kids should start rolling in any minute from school, & once they're home, I like to devote my time to them. If I'm done w/ everything I need to do for the day - i.e. chores, errands, me-time, etc... then I find that I'm much more patient w/ them as we sit down at the kitchen table to do homework. As far as the election goes - I am sooo happy the campaigning is over. With that said, even though my candidate did not win, I am respectful of the office of the Presidency, & our new President-elect, along w/ our country, has my support & my prayers. Had my tats-for-my-teeeets  done on Wednesday!!! They look great!! The first thing my dh said was 'Congratulations!!! You're done!!!'. Wow - that is so hard to believe... my first surgery will be 1 year ago on 11/13. I go to my onc on 11/27 for my second 4 month follow-up - I figure I'll start holding my breath on the way to my appointment & until then...no worries! Speaking of hair - I'll be going in next week for my 2nd shaping. Everyone says they like my hair better short, but I haven't decided yet. I feel like I'm just a 'hair tease' away from an old-lady-once-a-week-to-the-beauty-parlor haircut - in other words, I feel like my mom (no offense to her or anyone her age) I'm just not ready for that yet. Yep, my vanity is alive & well here in Texas!! Well, the schoolbus just pulled up..... TTFN, Therese ",
      "MessageIndex": 3918,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 15, 2008 07:11AM texrn wrote: To Trudy, KathyL, Maz, & CarolC, You are all in my thoughts & prayers. Had my first treatment almost 3 weeks ago & I can tell you, the fear of the unknown is much worse than the reality. Throughout this journey I've found myself waiting constantly for the next storm to hit - the waiting & wondering has been the worst, at every step. The best thing we can do is prepare ourselves, in every way possible, for each \"storm\". You'll get through it. Remember, you're not alone...we're all here for you. -Therese-",
      "MessageIndex": 541,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 22, 2008 10:08PM texrn wrote: Hi all, I would have had an okay week, with only some residual fatigue to contend with, but wouldn't you know it - I got sick again with another URI ( just a cold for now ). It was almost impossible to avoid since 1/2 my household has been sick. Finished my antibiotics from my last URI last Sunday, then on Monday...BOOM! I started to get the sniffles. Had my bloodwork done today - my counts are low as expected, but not dangerously so. I plan on lying low this weekend & do my best not to get pneumonia - I may even try standing on my head! My dh is out of town this weekend, so my kids will have to step up to the plate - which I know they will. They have been awesome throughout this whole ordeal. Hope you all have a nice, peaceful, se free weekend! Dana - Your faith & attitude are inspiring & will get you through this - know that my thoughts & prayers are with you. vettegal - I, too, have had the joy of frequent trips to the bathroom. After my first treatment, my GI se's ranged from the big \"D\" to the big \"C\", with horrendous cramps throughout - so I know how you feel. I hope you feel better soon. 1lovewolf - I was told, before I started chemo, that the fatigue was going to be cumulative - BOY, they weren't kidding. All we can do is listen to our bodies & rest, rest, rest.... Julie - Happy 39th birthday!!! Deb - I'm so sorry to hear about your dp's mom - may this be a peaceful time for her, with her loved one's by her side, without any pain or suffering. LJ13 - Congratulations!! on getting that, much dreaded, first treatment behind you. Hope the se's are minimal, if not at all. As always, my thoughts & prayers are with each & every one of you. Therese",
      "MessageIndex": 1496,
      "PostDate": "22/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 23, 2008 04:53PM texrn wrote: Hey there, KathyL & JKiss75 - I, too, had the eye twitching after tx's 1 & 2 - talked to my onc about it, & yes it is a neuropathy related se ( according to him ). Since it was transient w/ me, he took a \"watch & wait\" attitude for tx #3...& lo & behold, no eyetwitching this time around. I guess it's somewhat true that every tx can be different. RN2teach - I am also an avid reader - like you, I'll read anything except romance novels; but since my diagnosis it has been very difficult for me to mentally focus on anything but my current situation - the first couple of months, all I did was research my illness, options, etc. Then, when I started chemo I thought I would be able to get some reading in during all my down time, but post-tx I'm either too drugged or too exhausted - not to mention this mental fog I seem to be in, along w/ the occasional \"down in the dumps\" days. I can't complain, though, b/c my last tx is next Friday - WOOHOOO!!!! , & from where I am now I can definitely see the light at the end of the tunnel...along w/ a pile of books sitting on my nightstand. After chemo, I'll just have a couple of small steps left in the reconstruction process, of which I have no qualms about since the first half of my reconstruction has gone so well. To those of you who are right behind me, or even to those who have just started - Have faith & keep looking forward & you, too, will eventually see that \"light\". Therese",
      "MessageIndex": 1511,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 24, 2008 05:39PM - edited Feb 24, 2008 05:40PM by texrn golfer779- No rads or ht for me - had a double mastectomy w/ reconstruction, plus I am  triple negative, so no more tx's for me in the near future. I am so thrilled to be almost done but also a little nervous to be \"out on my own\". Congratulations! on your son's skating medal - you must be so proud & you definitely are entitled to the bragging rights. time to get my little one's ready for bed...  Take care & a happy Monday to all. Therese",
      "MessageIndex": 1523,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 1, 2008 12:56PM - edited Mar 1, 2008 01:01PM by texrn HI all, Survived my last tx yesterday!!! Even w/ the IV Kytrill ( zofran ), I still got nauseated 1/2 way thru - they gave my some ativan & I sailed right thru - my shortest tx yet. I was only there 5 hours ( which included lab,dr., & chemo ). Been pretty tired & still feeling '\"blah\" in between the zofran & phenergan round the clock - at least I'm able to take in solid foods, albeit bland food. I spent last week, my feel-good week, getting caught up on things around here & also tried to get ahead for my 'bad' week coming up. Although I've never had any neulasta/neopegen shots, I've still had the the muscle spasms/flu-like achiness, & even arthritis-like joint pain in my hands & shoulders. My onc says those se's are from the Taxotere. They've allowed me to take Alleve in the past, & he also says I can take Vicodin if I need it. My nails are fine so far - bought some tea tree oil but am not very consistent in using it...hope I don't pay the price later on. I, too, have some hair that is growing & some that is continuing to fall out - including my eyebrows & eyelashes, which are pretty thin at this point ( I hope they don't come back white & curly ). Aunt Flo came to see me on Christmas Eve, stayed 3 weeks, then haven't seen her since - don't miss her in the least. Have had a lot of hot flashes & night sweats, though. They're not bad or debilitating, just not very conducive to a good night's sleep. The night before my last tx, Thurs. nite, I took my dd (11yo) & one of her friends to the Jonas Brothers concert ( a young teen pop group ). They had a blast, & so did I - it was so priceless for me to see them have such a good time jumping up & down screaming & dancing. I am so grateful I was at the peak of my 'feel-good' week & was able to take her - plus I know the opportunities for me to be a part of her social life are going to become less & less in the near future. It will definitely be a cherished memory for me. Don't have much energy for specific shout-outs - just know my thoughts & prayers are w/ each & everyone of you daily. Therese",
      "MessageIndex": 1619,
      "PostDate": "01/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 11, 2008 02:20PM texrn wrote: p.s. My birthday is 10-3-61",
      "MessageIndex": 1809,
      "PostDate": "11/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 30, 2008 01:05PM - edited Mar 30, 2008 01:16PM by texrn Hi all, Just checking in - I'm over a month out from TC x 4 & the Taxotere has left me w/ some residual se's - tolerable stuff but not debilitating - although I am tired of taking pills. The muscle & bone pain definitely got worse before it got better - I could hardly walk during the middle of last week, had to take Vicodin one night. I'm still trying to do some moderate exercise every day including a lot of stretching &, today, I'm just a little sore but very mobile. The swelling is still there from my thighs down to my feet, my hands, eyelids, & even cheeks ( I keep biting the inside of my cheeks,& on the outside I look like a chipmunk ). My joints ache every morning - so I asked my onc how long am I going to look & feel like an old, swollen chipmunk? I'm up about 15 lbs. He said I can blame the Taxotere for my lingering se's, & about 1/2 of my weight gain,  & that it could take up to 2-3 months for the swelling & aches to dissipate, & that by summer I should feel 100%. I also have some occasional residual indigestion & belching for which I take Pepcid. All in all, I really can't complain, my energy - physical, mental, & emotional - is coming back more & more everyday. I just wanted to share with everyone what it can be like a month after tx is done, & not to be discouraged or surprised if you still don't feel 100% - plus everyone responds differently. CarolC - I am so sorry about your job - but it sounds like you are taking all the necessary steps in rectifying this situation. Like my onc says \" some people just don't have a clue!\" KathyL - How exciting for your ds...a big boy bed, wow! They do grow sooo fast. Every milestone, no matter how small, is a very precious gift to witness. Having gone through years of infertility tx to have my children has made me overly sentimental about all that kind of stuff.   D1 & PAlady - I'm with you on the \"compression jeans\". My wardrobe is very limited right now for that very reason. When I go out to eat I have to think twice about wearing jeans at all! Dana - I so enjoy all of your posts. You sound like you're doing so well - physically & emotionally. You are truly an inspiration. I only perused through the posts from the last couple of days, so I'll catch up later. Have a beautiful day!  Therese",
      "MessageIndex": 2187,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 19, 2008 01:18PM texrn wrote: Maz - I'm so sorry to hear about your bff - my thoughts & prayers are with the both of you. Now more than ever, you both are so blessed to have each other as sisters. Dana - you so amaze me with your attitude & the strength of your faith. You are definitely a beacon for all of us. You are most definitely in my thoughts & prayers...daily! I wish I could put into words my thoughts & well wishes as well as some of you can, but as I've said over & over, you ALL are in my thoughts EVERYDAY! I also wish I could hang on to this positive energy eminating from this group. Sometimes when I'm feeling down or negative, part of me wants to come here & post my feelings & get them off my chest - the other part of me wants to keep it all to myself so as not to bring everyone down with me. I have to admit, sometimes I don't have the energy to stay upbeat. I am so thankful I have my children around to keep me grounded & engaged in everyday life. Well here goes with the  thoughts....it's a very \"naked\" feeling to be done with all of my treatments. I started really working out, i.e. weight training, last week, so I am very sore & achy most of the time. The problem is, I am so in tune with every little ache, pain, twitch from my body that if I have the same ache or twinge for more than 2 days in a row, all rational thought starts to take a back seat to my wild imagination. I see my onc on Monday for my first follow-up appt. Admittedly, I am a little nervous & feeling like I'm about to dodge my first bullet, unarmed. My dear dh is so in tuned to my ups & downs these days that I think I'm really starting to stress him out. I guess it boils down to fear of the unknown...again. Well, I've made it through many \"fear of the unknowns\" up till now, there is no reason I can't conquer this one. Thanks for being here to 'listen'. ...I think I'm going to round up the kids & the dog & go outside for a long walk - it's such a gorgeous day! Happy New Year, Happy Easter, & Happy Spring to everyone! Therese",
      "MessageIndex": 1967,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 7, 2008 03:39PM - edited Apr 7, 2008 03:40PM by texrn",
      "MessageIndex": 2290,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 14, 2008 02:35PM - edited Apr 14, 2008 02:38PM by texrn",
      "MessageIndex": 2398,
      "PostDate": "14/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 4, 2008 11:18PM - edited Apr 4, 2008 11:19PM by texrn Well, I should be in bed right now, seeing as I have to get up at 5:15am tomorrow. I thought I'd check in one more time just in case I don't survive the weekend back at work. I can't complain, I only work 2 days/week. Thank goodness my energy is back - not just for work but b/c now that we're in the full throes of spring, all 3 of my kids are in 1-2 extra-curricular activities each - for the next 6 weeks we have some kind of activity 7 nights/week...one more reason why I should be in bed right now. For the first time, I am going to walk in the Komen Race for the Cure here in Fort Worth on April 26th. There is a group of my co-workers & some of their family & friends who are going to walk in my honor - I was so touched I was speechless. I was able to get that Saturday off from work so I could participate. I, myself, am walking in honor of all of my support system, which includes all of you. I feel it's the least I could do after all you all have given me. Well, I'd better head off to bed.... Therese ",
      "MessageIndex": 2268,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 13, 2008 05:03PM - edited Apr 13, 2008 05:11PM by texrn Hey there, Here's my hair update - stopped falling out about 3 weeks after my last tx (am now 6 weeks out), so after 3 weeks of growing it's mostly dark brown/black w/ some scattered white hairs ( as before ) & straight ( as before ).It was looking pretty sparse about a week ago with the hairs that never fell out  ( mostly white ones )grown out to over 1/2 inch & the new 'fuzz' (all dark ones) at almost 1/4 inch ( which I felt made me look sickly )- then about a week ago I took the clippers & evened it out  - now it's all about 1/4 inch & it looks like freshly mowed grass, which has given it the illusion of looking more filled in. I'd say realistically it is a tad over 50% filled in all over & I had very thick hair, so I'm sure I've got a ways to go. Even so, I feel so comfortable with it looking this way that I'm not even wearing any head covering at work ( so far I haven't scared any patients into a heart attack ). I read somewhere that it takes a few months for the true pigment to come in, as well as the normal texture. My eyebrows/eyelashes are continuing to thin out, but at the same time new hairs are starting to come in, but no new growth anywhere else on my body. Hope everyone is having a good weekend. Therese",
      "MessageIndex": 2381,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 14, 2008 10:36PM texrn wrote: Kathy - work itself is going well - however, I think overall I've been overdoing it. My first weekend back was the weekend before last, then all last week I was on a roll catching up on errands, chores, getting back on track at the gym, etc... feeling pretty productive, but not stopping at all...then worked this last weekend....then today, after I got back from the gym, it hit me - I've been  exhausted the rest of the day. Guess I need to take a day off every now & then. I have just been so motivated b/c I've been feeling so normal lately. I, too, had a lot of problems w/ the site today, but I was so excited that I finally figured out how to post my picture in my avatar, that I refused to give up. Kimberly - I've had my cards/envelopes ready to mail since last Thursday, but never made it to the post office last week...& now I can't find them. They're probably with my favorite black baseball cap I can't seem to find either - hmmm! can chemo-brain still effect us 6 weeks out from tx? Julie & Paula - hang in there, your last one is right around the corner. I hope you both are feeling better by tomorrow. Everyone rest well tonight. Therese",
      "MessageIndex": 2405,
      "PostDate": "14/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 16, 2008 06:19PM - edited Apr 16, 2008 06:22PM by texrn Good evening everyone, Bad news on the hair-front - although the hair on my head is filling in everyday, my eyebrows have all but completely fallen off. All I have left are the few new ones that have started to come in...I sure hope the other new ones aren't too far behind b/c it makes for a very wierd look. It's a good thing I have taken to wearing my glasses most of the time - that way my eyes don't look like they've disappeared into my head. I was thinkin'...if everyone's hair comes in curly then next year's reunion will look like a curly-top convention! I personally don't care how my hair comes in, as long as it keeps on coming! Kimberly - I mailed off my cards yesterday ( yes, I finally found them right where I had left them??- go figure). That is so sweet of your ds's coworker to bring you & your dh a home cooked meal. I'm so glad you won't be spending your last chemo tx alone - it'll be nice to have someone there to celebrate w/ you. Hey, any words of wisdom for me on raising my sibling triangle? My oldest dd is the singleton & the twins are boy/girl, with a 5year gap in between. KathyL - you have been in my thoughts today - hopefully your superiors & coworkers didn't make things any harder for you. Sometimes, even when it feels like the right time to make a change, it still can be a hard thing to do. How's the exercise program going? I hear you on the frustration with the pre-set TM settings. I don't even bother - of course right now I can only muster the warm-up level on my home TM - I keep telling myself it's the length of time that counts right now...right? I figure when I build up more strength & endurance to go more than say, 1/2 a mile, then I can start getting fancy & add some incline or whatever. Julie - WOOHOO! last one tomorrow - hope it's smooth sailing for you! Well, my dd just anounced that AI is on...I'd better go see who gets kicked off tonight.... Talk to you all later, Therese ",
      "MessageIndex": 2430,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 20, 2008 07:51AM texrn wrote: Patty - what wonderful news about your sister!! she can finally move forward & get this show on the road. Therese",
      "MessageIndex": 2483,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 20, 2008 10:43AM - edited Apr 20, 2008 10:46AM by texrn KathyL- I'm seeing less & less scalp everyday, & it's looking darker everyday, too, however, the grey hairs are coming back in the same places they were before. As for the bra shopping - I have a co-worker that wants to give me a 'bra & margarita' party sometime this summer - so I'm pretty excited. Enjoy your last weeks/days of freedom before returning back to the real world. The 'return' for me was bittersweet - I hated having to leave my family on the weekends, but in my heart I was so excited & thankful that I was healthy enough to be able to return when I did. For me it beat sitting at home & making mental lists of every ache & pain. I must say, I think for me, all the residual se's ( including the fatigue) finally disappeared at the 5-6 week mark post tx. Every now & then, when I'm on my feet a lot, I notice some trace swelling in my ankles, but each time it's seems to be less & less. I hope & pray that this journey turns out to be a once-in-a-lifetime deal for every single one of us. Therese",
      "MessageIndex": 2487,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 24, 2008 07:20AM - edited Apr 24, 2008 07:22AM by texrn Tina - LOL at the eyelash story! My eyelashes have always been straight, so I've always used an eyelash curler, but man! I would've freaked if that had ever happened to me. KathyL - I'm so glad to hear the nip-recon was quick & painless. It gives me something to look forward to - hopefully sometime this summer. It sounds like your new job is a perfect fit. Hope you find peace of mind, b/c there is nothing like job satisfaction & being content with what you're doing, that makes for a smooth ride through life. LIfe is too short to waste our time being uncomfortable or unhappy in our careers. Well, I'd better go for now - my 11yo dd re-injured her knee last night, so it's off to the pediatric orthopedic surgeon. Although she is involved in volleyball & tennis, she hurt her knee running & skipping to the car last night after dinner. I'm sure it's just a sprain, as before, but I'm hoping for another referral for physical therapy. My dh has an abscessed tooth, so, believe me, there is a lot of moaning & groaning & pill-popping going on in this house...at least it's not me for a change! I'll shout out some more later... Therese",
      "MessageIndex": 2547,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 11, 2008 09:40PM texrn wrote: Happy Mother's Day to all the Jewels!!! ...& a Happy Birthday to Tinalee!!! Hope everyone had a beautiful weekend. Therese",
      "MessageIndex": 2777,
      "PostDate": "11/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Aug 12, 2008 12:59AM texrn wrote: Hey All, Paula - What wonderful news regarding your husbands tumors!! Now that's what I call progress!! BTW, loved the picture!!   KathyL - here's to a quick & painless mammo! I so hope you enjoy your vacation, what a great way to put the upcoming mammo behind you. Carol - Congrats on finishing your rads - time seems to be flying by for all of us!!  Julie - what a milestone to get those drains out! How do you like the \"new girls\"?? Have only had a chance to peruse through a few posts - hope all is well w/ everyone. I may not be present online often enough, but you all are always present in my daily thoughts. Therese p.s. Thank you to my secret pal for a sweet & thoughtful \"pamper me\" care package!!! soaps, body spritzer, etc...thank you again for thinking of me.",
      "MessageIndex": 3574,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 22, 2008 10:26PM - edited Apr 22, 2008 10:27PM by texrn Hi everyone, Say, did anyone watch the HBO miniseries 'John Adams'. The final episode aired last Sunday, the 20th. I had read the book, by David McCullough - & I thought the miniseries was very well done. Anyway, his daughter died of breast cancer. back in the early 1800's - they did a mastectomy on her right breast - they gave her something to drink (probably a shot of whiskey), gave her something to bite on, tied her legs to the bed posts, & chopped her breast off while 4 men held her down - all while her parents were waiting downstairs ( of course they did it at her house )...poor, brave girl! I cannot fathom how scared & horrified she must have felt. I know we have a long way to go in the fight against bc, but we have sure come a long way, as well. It made me feel so thankful that I live in a day & age where, at least,  we have options. The scene really touched me, both in the book & on the screen. Anyway, if any of you are history buffs you might want to check out the book +/or the movie ( I'd be happy to send the book to anyone who is interested). Have a good night! Therese",
      "MessageIndex": 2527,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 29, 2008 03:11PM - edited Apr 29, 2008 03:16PM by texrn Happy Tuesday everyone! Paula - 'Outstanding Nurse' - what an honor! Please do share the link with us so we all can read about it. KathyL - Good for you w/ the TM - as I've always said - you need to start somewhere. For the longest time I was at the 'cool down' level, but have since moved up to the 'warm up' level - Woohoo! I think, in the end, it is the length of time that matters. I may not be in the shape I was pre-bc, but walking the 5k last Saturday was a piece of cake!( Well...almost ) Carol - I am praying for your friend Steph - hoping this next chemo does the trick. Kimberly - Welcome the the \" down w/ chemo\"...I mean \" done w/ chemo\" club!! I don't blame you for wanting to bask in the no-appointment zone, even if it's just for a day. My hair is still filling in like crazy - looking darker & darker everyday, plus I'm still evenning it out every 7-10days. My eyelashes & eyebrows are still looking more bare every time I look in the mirror - although I haven't actually witnessed them falling out or seen any 'spiders' in the shower - LOL!! The 5k last Saturday was awesome! I had never participated in anything like that before ( mainly d/t my work schedule ). The team I was on had been participating for 9 years & each year it has been growing. There was probably about 30-40 of us, w/ me being the only survivor this year. We met at the team captain's house in the early AM before the race - there they had a continental type breakfast for us, then they had 2 school buse take us to the race site in Fort Worth. It was a gorgeous, clear day, with a high of about 68-70. Although the walk felt farther than a 5k, it wasn't so bad - except for the occasional hill ( who knew they had hills in FW! ). They had cheerleaders at the 1st mile mark, but I swear the 2nd mile mark was at least 4-5 miles away! Never did see the 3rd mile marker, because I was too focused on the finish line off in the distance. All in all, it took me 1hr17min to complete - I know....IMPRESSIVE!! AFter the race the buses took us back to the captain's house, where she had a brunch in her backyard. It was quite a spread & several of the husbands were back there cooking the eggs to order, & the french toast, pancakes, you-name-it! As people would come to sign-in, in the morning, they would fill out small pink \"in memory of\" cards, then they would attach them to these pink & white balloons - well after we ate brunch, they released all these bunches of balloons ( I know, not exactly environmental or airplane friendly ) into the clouds while someone at the gathering was singing....it was very moving - I think b/c there was at least 30-40 balloons floating up into the heavens. They gave me a gift - it was a gardening bucket w/ a tiny potted flower to plant, along w/ seeds, & pink gardening tools, apron, & gloves...all to signify new beginnings & new life. I was very touched. By the time I got home I was so physically & emotionally exhausted - but all in a good way! Plus I had a rum-punch w/ brunch ( hadn't had any alcohol since pre-bc ). I took the best 1 hour nap! There was an elderly man paricipating in the walk who was walking w/ a walker...I got choked up watching him patiently struggle with each step. Of course, pinned to my back was a pink sign saying I was walking in celebration of \" The January Jewels!\" You see, you all are always in my thoughts, & have become a very important part of my life...my survival! Thank you, Therese ",
      "MessageIndex": 2620,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 1, 2008 09:53PM texrn wrote: Julie, I had my expander surgery at the same time as my bilat. mastectomy - some people have more tightness & pain than others. My ps gave me Valium, as a muscle relaxer - I took it every night & it really helped. My ps put 120cc's in each one to start - they looked weird because they are wide-shaped - up until the 3rd fill or so, they looked to me like body-builder-man-boobs. After the last 2 fills they started projecting more, & then about 6-8 weeks after my last fill they really relaxed & filled out more. The pain & tightness lasted about 2-3 weeks for me. They definitely feel & look different than I imagine the 'real' implants do, but once I accepted that it was just temporary I was able to ignore them. It kind of feels like I have coconuts as boobs. I've always worn the camisoles w/ the built-in shelf - although I don't need any support, the built-in shelf gave me some 'shape' up there. I have been very fortunate b/c I have not had any trouble w/ them - I hope you're experience is the same. Therese",
      "MessageIndex": 2659,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 2, 2008 04:39PM texrn wrote: Kimberly- I am 9 weeks out from my last chemo. Try & be patient w/ the hair - watching your hair grow is kind of like waiting for water to boil, or waiting for the phone to ring - it seems to never happen quick enough. Thanks again for taking charge of the secret pal exchange! Therese",
      "MessageIndex": 2665,
      "PostDate": "02/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Dec 11, 2008 07:26PM - edited Dec 11, 2008 07:28PM by texrn Hi everyone! I know....long time no post....time sure flies. I still can't believe it's almost Christmas. I was driving down the road today, listening to the radio & Queen came on, singing \" ...we are the champions...\" & I swear I instantly thought of all of you! You all are definitely my heroes in ways I can't begin to express. Here you are 1 year through this unforgettable journey taking care of loved ones, children, jobs, traveling, buying washing machines & dining room furniture - in essence, still taking care of business! I am so proud of all of you & so blessed to have found this haven to come & express myself. As far as a JJ reunion, please count me in - the end of June sounds great, as does Lake Tahoe! I may or may not have my husband in tow...haven't decided yet. The last 6 weeks or so have been filled w/ dr. appt's & check-ups: eye doc, dentist, gyn, pcp, ps, onc, & for the grand finale!! a gastroenterologist - for my first colonscopy! Apparently, having had bc has put me at a slightly higher risk of getting colon cancer & I decided to have my initial screening now rather than wait 3 years until I turn 50. The colon prep & the subsequent bathroom trips brought back some not so pleasant memories of certain chemo side effects...fun,fun,fun!! Had my second haircut last week & I must say I still don't like my hair short but \" oh well - it is what it is\". My family & friends really like it - I just smile & say 'thank you'. Kimberly - I am so thankful your sis made it through her surgery with flying colors. Also,thanks for keeping up w/ the SP project. PALady & Paula - love the avatar pics!!! I'd take one of myself, but my camera & computer are not cooperating these days. Paula - so glad to hear your dh is doing better & is able to engage in life again - thank God for steroids!! D1 - thank you so much for the Christmas card - what a nice surprise!!! Also, thank you for being the trail blazer & beacon for this group. Kris - congrats!! on the path results....now you can exhale & enjoy the holidays! Well, I best get myself in the kitchen, The kids keep asking me what's for dinner & don't think I can hold them off any longer w/ \"I dunno...\" Talk to you soon, Therese ",
      "MessageIndex": 4042,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 7, 2008 06:02PM - edited May 7, 2008 06:11PM by texrn PAlady - Congrats on being all done!!! I agree, it can be a very emotional time. It's kind of like getting off of the scariest rollercoaster ride of your life - you don't know whether to laugh or cry. It not only closes a chapter on the bc journey, but it also closes the book on our past life, pre-bc. For better or for worse, our lives will never be the same. That can be pretty scarey, & not for the faint hearted, but it can also be exhilarating & exciting thinking about all the positive possibilities that lie ahead. We may have lost  a lot along the way, but we've all been given a second chance. Acknowledge your tears & sadness, grieve for the loss of your former life...then when you, & only you, are ready, move on. Therese ",
      "MessageIndex": 2731,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 21, 2008 10:39AM - edited May 21, 2008 10:45AM by texrn Hi JJ's, Wow, from reading through the posts over the past couple of days y'all have been busy... & chatty!! For the most part, though, that's a good sign - means we're all starting to \"get our groove\" back. sheshe - I'm so sorry to hear about your gb attacks - I know when my father had them he was miserable - & le to boot - I'm sure D1 will be a good mentor in that department. LJ13 - Any news on the PETscan results? I think waiting is one of the hardest part of all this bc bs ( please pardon my French abbreviation) Julie - Congrats on the dh making the Hall of Fame at school - what an honor!! Hope you're on the mend from your foobie surgery. I'm 2 weeks out from mine & I feel pretty good. They haven't completely fluffed out yet b/c we decided to go a size bigger (600cc) than the expanders (450cc) but the shape has still changed a little from 2 weeks ago. Whether it's narcotic pain meds or OTC pain meds, take whatever it takes to make yourself comfortable. Pain control is a very important part of the healing process. Kimberly - Wow girl, you really are a goin' Jesse! Tahoe...Sedona, with a little tequila mixed in:D In regards to propping the foobies up: I did not have to do that after this surgery. I did have to wear the ace wrap around my chest for 48hrs, followed by a sports bra 24/7 for 2 weeks. Even though they haven't fluffed yet, they still are shapin' up real nice. As far as working out goes - my ps banned me from working out until the first of June. She had to release some scar tissue on the inside of my left foob, requiring her to score the tissue like a grid - this takes a little longer to heal, so to avoid the risk of bleeding & developing a hematoma, she doesn't want me doing anything that raises my hr/bp...and just when I was starting to get in a nice, consistent workout routine...I know, all for the best. Patty - 1/2 way through rads...good for you!! Hope Denise is on the mend, physically, from her AND surgery - sorry to hear about the positive node, though. My prayers remain with both of you for the strength to endure. It must be hard to watch someone you love have to endure what you've been struggling throughyourself. D1 - you, my friend, have been one busy beaver! Front yard work... hooking up computers...scouring & scrubbing...those are all of the things I need to do around here! Since I can't do too many strenuous things until the first of June, I'll just have to live vicariously through you. Are \"we\" taking the day off today, b/c \"I am\" pretty tired after all that work. My oldest dd turns 12 today - I can't imagine her driving, but I guess we're just a hop-skip-&-a jump away from having the \"car discussion\". They do grow up fast. Tina - Hope the surgery went well - did you have to spend the night? It's definitely a quicker recovery, then after the mastectomy. I wish I had caught up on all my outdoor yardwork before my surgery - good for you! Hope you & the dh have a nice, relaxing getaway...what a way to recoup! Carol - Did you get a chance to watch AI? I so want David C. to win - I just don't think the other David is mature enough, emotionally speaking & talent-wise. WVgirl - How long did they say chemo brain can linger? For me, I think, either chemo brain has effected my ability to multi-task like I used to, or bc itself has affected my desire to multi-task like I used to pre-bc - it's probably a little of both, but mostly the latter. I feel like it's not just the physiological aspects of chemo that effects our brains, but the mental & emotional effects of bc itself...that's just my theory based only on what I've experienced so far. KathyL - Sounds like your new job is a good fit all around? You've definitely got some celebrating to do w/ the dh back home & a \"first\" paycheck coming down the pike!! Well, I'm off to go pick up the dd's birthday cake...oops, I mean birthday cookie! Have a great day everyone, Therese",
      "MessageIndex": 2863,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 20, 2009 10:57AM texrn wrote: Good Morning everyone! Regarding the LV trip this summer - I do agree that a resort is the way to go because it will have something for everyone. I am not bringing my dh, never even considered it, although he does love to gamble. We are both pretty used to traveling w/o each other, unless it's a family vacation. Are the dates firmly in place yet? Can we start making airline reservations, or are we looking for package deals which might include airline tickets? As far as hotel rooms go, I'd be willing to double up & share a room w/ someone...just a thought. Carol - Thanks so much for the books!! Read the Foot Soldiers book in one sitting - of course, that took me into the wee hours of the morning - but I found it to be very inspirational & motivating. I'm going to the orientation meeting next week. Was up to 3 miles on the treadmill 3 days a week alternating w/ Pilates & Yoga twice a week - but then I got sick last week (just a resp. bug) along w/ 2 of my kids...so I'm thinking I might have to start over cause I'm kind of dragging this week. D1 - what an exciting and memorable day you have planned!! Although I didn't vote for him, he has my respect & benefit-of-the-doubt for now, plus the historical significance is not lost on me. Despite all of the inherent imperfections of, & the blatant mistakes made by our government, I still wouldn't want to live anywhere else. Julie - loved what you did with those rooms!! I'm a big fan of darker colors, so the wall colors really suited my taste. I agree w/ Paula, the basement looks like it's off to a good start w/ a lot of potential, i.e. the flooring, the wall paper border, and that beautiful pub-style table. Since I'm not a big football fan, when exactly is the SuperBowl? The Cowboys have been so disappointing year after year, it's hard to stay \"into it\", if you know what I mean. I\"m sure my dh & ds will be in front of the TV that day, but I'll be working so I guess it doesn't really matter. Hope everyone has a great week! Talk at ya soon. Therese",
      "MessageIndex": 4304,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jun 15, 2008 03:30PM - edited Jun 15, 2008 03:47PM by texrn Hi, Just a quick check-in ( I'm here at work ). The last few weeks have been wonderfully busy at my house. It's been birthday season at home w/ my oldest dd on 5/21 & my twins on 6/11, on top of mother's day, father's day, & my bil & father's bday ( we normally celebrate all of the holidays, special occasions at my house, with this year being no exception...& I wouldn't have it any other way). Throw in all of the end-of-school year recitals, awards, & parties, & boy! does time fly by! It beats sitting around watching my hair grow ever so slowly -at least that's what it seems like to me. I really shouldn't complain - I finally have full coverage & it's about 3/4 inch long ( trimmed it a couple of times back in April ), straight as a board sticking straight up - more 'pepper' than 'salt' ( just like pre-bc ). Everyone around me can't resist rubbing my head...even strangers! I'll probably wait until end of summer for a 'real' haircut & to add color to cover the gray - I had highlights pre-bc, but I may wait awhile to add those. Have only perused over the most recent posts -BOY! y'all have been BUSY!!!! traveling, partying, drinking, cooking, etc...It really warms my heart to see our collective posts go from aches, pains, etc...to discussing future plans & projects - now that's progress!!To all those bringing up the rear - 'hang in there' - the light at the end of the tunnel will never burn out! Got some disturbing news here at work today -2 of my fellow nurses in my unit have just been diagnosed w/ bc - actually one of them is still waiting for her path results. Damn! if there was some kind of quota to be filled here in my world, I would have hoped that I could have been it! On a brighter note - this weekend alone I have had 3 patients in my unit who are bc survivors from 15-20 years ago &  they all are in here for other reasons. Their hx of bc is merely a footnote. Anyway...just thought I'd check in & say HI! Happy Father's Day to all the dh's & df's who have taken such good care of us!  My continued thoughts & prayers to those who are going through new & continued illnesses with their loved ones. Therese",
      "MessageIndex": 3119,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jun 28, 2008 12:26AM texrn wrote: Kimberly - Welcome home! Happy Birthday! & Thank you! for the post card with the very thoughtful sentiment....oh & luv the picture! Paula - Welcome home to you & enjoyed your pic too! I'm praying for your dh.  Well, I'm off to work tomorrow - will check back in on Monday. Have a great weekend! Therese",
      "MessageIndex": 3235,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 14, 2008 09:06AM texrn wrote: Good Morning All! Hope everyone's week is off to a good start. I was hoping I'd feel closer to a 100% than I do. I don't know if it's from the cold I had last week - but I'm wiped out. I get short bursts of energy, then I crash in between. I'm not sleepy tired, just drained. my blood counts dip a little, but didn't drop dangerously low. Sometimes, when I'm full of energy, I feel guilty for not working during my treatments. My employer has been wonderful, but the disability insurance co. gave me a hard time, at first. They said that a lot of people w/ my same diagnosis, treatment, etc. work through treatment - so, at first, they were only approving me from one doctor's appointment to the next. I finally explained to them the nature of my job ( of course, they never once asked me what kind of work I did ). I'm a critical care nurse, & I work 12 hour shifts - so between the stress & the germs, my onc & I didn't feel it was a good idea for me to work right now. They finally agreed & approved me through March. I think they made it unnecessarily difficult & stressful for me ( & I told them so ). Anyway, enough griping....It feels good to be able to get this off my chest & tell people who can understand. Hope it's a good week for all & that you all sail through your treatments w/ minimal, if any, se's. I have my second treatment on Friday & this time I'm prepared w/ an arsenal of drugs. My bathroom counter looks like a pharmacy. Sometimes I can't believe I have a days-of-the-week pill box. For my dry lips & nose, I use Aquaphor, made by Eucerin. My children's pediatrician, & also their orthodontist, recommended it for chapped lips, & the dry,cracked corners of the mouth. Talk to you later........ Therese",
      "MessageIndex": 519,
      "PostDate": "14/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Sep 11, 2008 09:10PM texrn wrote: Hey everyone, Just a quick check-in. Been real busy getting the kids back-to-school & all that goes along w that, plus I've been working extra (during the week) at the hospital. Had my NIP surgery a few weeks back on Aug. 27th...so far so good. I only did it b/c I'm an 'all or nothing' type of a person, but when I did the unveiling....Wow! what a difference! I've always been happy w/ my implants, but having the nips visually adds a realistic look to them that I didn't expect. Even though my mastectomy scars are still visible, they practically disappear now that there is something in the middle of each breast. I go some time in Nov. for the tats. Had my first haircut & color a couple of weeks ago, as well - even had some highlights done! Before, when I used to look in the mirror, my hair (or lack thereof) & my foobs were just a reminder of what I tried all day long to forget. Now when I look in the mirror I feel like I'm really & truly back-on-track. As superficial as it might sound, I actually feel \"whole\" again. Since there is no way I can catch up on the posts, I've only read the last couple of pages - Paula - I'm hoping & praying for more  'feel good days' ahead for your dh...& for you (you sure have a lot on your plate!) Carol - Good luck & Godspeed! on your upcoming 3day race! D1 - Have tried the warming KY before & let me tell you....quite entertaining. Like Kathy says - hope your mojo comes back before the \"joy gel\"(LOL!) dries up! Kimberly - don't know how you teachers do it! I hope the chaos doesn't last too much longer - hang in there! Thanks for keeping up w/ the SP project...don't know when you find the time. I may not post as often as I'd like, but you all are never far from my thoughts. Take care, Therese   ",
      "MessageIndex": 3709,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 17, 2008 04:25PM texrn wrote: Carol - thanks so much for the photo collage - it sure adds another dimension to our comraderie seeing all those pictures at once. Even my dh got a little choked up. D1 - loved the graveyard idea! I've been looking to add to the few halloween dec's I already have... Don't have time for anymore shout outs - got to finish packing for the Komen Race/Spa weekend/female family reunion, then I'm off to the airport to pick up one of my sister-in-laws... Have a great weekend everyone!! Therese",
      "MessageIndex": 3845,
      "PostDate": "17/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 17, 2008 11:42AM texrn wrote: Hi, It's day 10 since tx#3 & I'm feeling (dare I say it )pretty darn good! 2 out of 3 kids are sick & so is my dh - I have no problem avoiding my dh if I have to, but how does one avoid their own young children? Everyone has their own dedicated box of kleenex & bottle of hand sanitizer, but that's about it - as it is, I feel isolated sometimes, not working, avoiding crowds during this bad flu season, etc... Anyway, I shouldn't complain - I work primarily weekends ( by choice ), so it's been nice to be home with the family every weekend. My doctor said he will release me to return to work on 4/1/08, so on my good days I've been cherishing the time with my family - even when I'm down for the count, I enjoy listening to the noises of the house; the pitter-patter of running up & down the stairs, the bickering, etc... The noise is strangely comforting to me. If anyone is interested in reading or hearing stories from bc survivors who are on the other side of their bc, I found a very uplifting website, called: livingconversations.com. It made the light at the end of tunnel shine a little brighter for me. Hope everyone is having a restful weekend. Therese",
      "MessageIndex": 1383,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 9, 2009 11:36PM texrn wrote: Hi All, First off - a few thank you's to all the thoughtful Jewel's who sent out Christmas letters, poems, & cards...Kimberly, Paula, & D1. Also, TY to my 4th quarter SP from 2008 - Julie. My 'new' SP sent a big box full of goody's for Christmas, & I must say, it really is a lot of fun to open up surprises from across the country! Thank you to everyone, for taking time out of your full, productive lives to stay in touch. You all are something else!!! Many heartfelt thoughts & prayers going out to Paula...Damn!!! I am so sorry your news was so disappointing. Your dh is so blessed to have you in his corner, pushing on, searching for answers & options. I pray the weekend flies by, & come Monday morning, Duke provides you with some tangible options & hope. Maz - my thoughts are with you as well. \"FUBC!!!\"...my sentiments exactly. I am very hopeful for you, that the areas in question are residual from radiation, surgeries, etc.. I haven't been on in so long that I can't remember if I've wished everyone a Happy New Year!! I log on & lurk often, but some times I have so much to say & not enough time to say it. I'm afraid if I rush, I might say something that comes across the wrong way, because sometimes it's hard to convey the true intent/sentiment in an email/post. Carol - I get weather alerts on my cell, & when I saw the 'alert' about the situation in the 'Northwest' I immediately thought of you. Glad to hear you have been relatively 'dry' - stay safe.  I need some helpful hints for walking the 3day - just signed up last week - the Dallas 3-day is in November, but I want to start training ASAP! I'd best be off to bed...got to get up at 5:30pm... Talk at y'all later... Therese  ",
      "MessageIndex": 4204,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 15, 2009 10:34AM texrn wrote: Carol - Yes, I plan on doing the Pink tent thing - I think the whole thing sounds like a blast! Y'know, the weather here in Dallas, that time of year, is pretty nice. You are very welcome to come join me - of course, no pressure - just a passing thought. If you didn't see my earlier post, July 12-15 is good for me. Paula - I am so relieved to hear that there is not only more options available for your dh, but a unanimous plan of action from both doc's!! Hopefully this will give you a brief moment to exhale...then onward it is!!! I continually pray for continued, unwavering strength for you, your ddh, & your whole family. Thank you for keeping us up to date. Will check back in later... Therese",
      "MessageIndex": 4263,
      "PostDate": "15/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 27, 2009 09:10AM - edited Jan 27, 2009 09:11AM by texrn Hi all, I'm so bad - haven't done my LV homework yet but a big Thank You to everyone who has done their homework! I've been to LV so many times growing up, but only a few times in the last 10 years or so, in any case, my only requirement on where we stay is that it have a day spa on site or be in close proximity to a hotel/resort w/ one - other than that, I just want to meet/see everyone. But, since I don't want any 'warnings' from the teachers in the group, I will get started on my assignment today! LOL So far, though, the Mandalay sounds good & I've seen the pool area at the Bellagio, which is very nice, but have not seen the pool area at the Venetian. Tonight is the Get Started meeting for the Komen3Day! It's out in Fort Worth, which is about 15 miles away, but there is supposed to be freezing rain this afternoon & tonight, so it might end up being rescheduled. My concern is being able to find any training walks during the week. Since most people in the real world work during the week, I'm not very hopeful. My sister decided not to do the race w/ me - her & her dh had signed up a few years back to do the Leukemia & Lymphoma Society marathon walk & she said it was too hard to raise double the $$ required to participate, so only her dh participated. She did say she would help me raise the funds & train w/ me & be there to root for me - so all is not lost. As D1 put it - G2G! Talk at y'all later... Therese",
      "MessageIndex": 4352,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 15, 2008 04:07PM - edited Mar 15, 2008 04:09PM by texrn Hi, I, too, am a big American Idol fan - it's one of the only shows on TV that the whole family can enjoy together. We are big fans of Carly, David Cook, & Brooke White. Thank goodness for our DVR, or 1/2 the time we would miss it. For all those on Taxotere - I am 2 weeks out from my last tx & feeling pretty good except for the fact my legs/feet, hands, & eyelids are swollen. I just noticed it yesterday - my feet look like hotdog buns. From what I gather from researching the subject, & also what the onc told me - this is to be expected, & it can last from a few weeks up to a few months. The steroids they pre-medicate us with are meant to minimize the future swelling - mainly to prevent severe swelling & pulmonary edema. The median weight gain is 2kg/4.4lbs. I haven't seen my ankles & feet look like this since I was 9 months pregnant with the twins! Otherwise, I feel pretty good - even the fatigue is less. I'm trying to push myself little by little everyday to try & build up my stamina b/c I go back to work in 3 weeks - which will mean being on my feet for 12+hours/day. Also, before my diagnosis, I had gone back to school (online) -  all in all, I'm excited to resume my studies & return to work. It will give me a chance to focus my attention on something else besides bc, & hopefully help me look forward & move on. I'll be here standing by the light at the end of the tunnel cheering you all on - how could I not - if it  wasn't for the January Jewels, the tunnel would have been a very, very dark, lonely, & scary place. Have a good weekend! Therese",
      "MessageIndex": 1894,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 27, 2009 10:31PM - edited Jan 27, 2009 10:35PM by texrn Yeah - we're hunkered down here in north Texas - it's sleeting right now w/ the temp at 28 degrees. Honestly, I love this kind of weather, probably because it remains a novelty to this old California girl. My kids came home on cloud-9 today - dd#1 was let out early, unbeknown-st to me - I was out grocery shopping when she tried to call me at home - of course she forgot her cellphone so she didn't have my cell # w/ her - anyhoo the bus brought the middle schoolers home at 2pm (instead of 4:30p). Luckily I had just pulled up into the garage & was unloading the groceries when I heard the doorbell ring, ring, ring (of course, she left her spare house key in her backpack - which she left in her locker at school). I was a little freaked out b/c she is only 12 in my eyes - while in her eyes she is already 12 1/2! What a difference perspective makes, eh? The twins on the other hand were released at their normal time - 3:15p. Needless to say they were a little miffed that they had to stay the WHOLE day at school! They got over it once they realized there were icicles forming all over the plants outside. I now have an extensive icicle collection in my freezer, along w/ some hail from last spring. I'm enjoying the FB thing, although I have to admit I find it somewhat confusing. It's like listening to 10 different conversations at the same time - kind of like the dinner table at my house every night! Wish I had some JellyBellys to munch on right now... TTFN Therese",
      "MessageIndex": 4358,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 28, 2009 06:54PM texrn wrote: Carol & Norma - just received a little surprise gift in the mail!! Thank you so much for the sweet, thoughtful, beautiful bracelet!! What an appropriate January Jewels memento!! We are all so blessed to have found each other - cyberspace is a wonderful thing!! Therese ",
      "MessageIndex": 4377,
      "PostDate": "28/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 29, 2009 09:07AM - edited Jan 29, 2009 09:11AM by texrn Carol - As far as the Get Started Meeting went...it was canceled d/t inclement weather. I rescheduled for the first part of Feb. (can't remember the date off hand). Interestingly enough, it is at the hospital where I work -so maybe I'll see a few colleagues. I have no idea what the meeting entails - but I'll keep you posted. Yep, Mandalay Bay sounds like the place to be - took the virtual tour...looks very nice!  Hopefully we can get a group rate - if it means we each need to have our own private room, then that's fine w/ me - I'm pretty flexible. Airplane tickets are what I expected them to be - since I'll be taking that Sunday off from work, I'm thinking I'll probably catch a late morning flight in - there is quite a few flights to choose from - even if I connect in Houston, I'll still get there in a reasonable amount of time. I'm very excited, since I haven't taken any plane trips (whoopeeee!) in a couple of years. I think I might be getting the hang of FB - we'll see... It's still a little frosty outside - have to go get my car out of the garage to take dd#1 to school. I'm actually so thrilled I'm able to put my car in the garage at all - my old Suburban never fit very well (it's only a 2 car garage). Have a good day everyone! Therese",
      "MessageIndex": 4380,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 1, 2009 03:39PM texrn wrote: Patty - these answers are for inquiring minds who want to know... Music - (past) Elton, Pat Benatar, John Mellencamp, Bob Seger, Tom Petty, Heart, Queen...some Pink Floyd, Yes, Jethro Tull...& on occasion - some Classical... (present) Jason Mraz, Rascal Flatts, Nickelback, John Mayer,  Five for Fighting... TV - as a family, I love watching American Idol - for just myself, I enjoy a couple of shows on Discovery Health: Dr. G - Medical Examiner & Mystery Diagnosis. My dd#1 & I love to watch What Not to Wear together. Movies - I like action & suspense more than chic flicks, like: Mission Impossible, National Treasure, The Da Vinci Code. Love older comedies like Young Frankenstein, & Monty Python & the Holy Grail... Books - I read a variety of genre's, but do not like romance novels. I'll shout out later, since I'm still at work Therese",
      "MessageIndex": 4419,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 9, 2008 08:52PM texrn wrote: Hi all, Came across this thread, & thought I'd join in, since my first treatment was on Dec.28th; I'm in for TC, every 3 weeks x4 ( 12/28, 1/18, 2/8, 2/29 ). I survived my first treatment - had the full range of GI symptoms, & broke out in a rash...then the clouds parted on day 6, & I emerged alive & well, & on a steroid \"high\". These days I'm just waiting for my hair to fall out - for me, anyway, that'll be the last of the \"big humps\" - i.e. the \"fear of the unknowns\"! I look forward to learning a lot from, & sharing a lot with, you all!",
      "MessageIndex": 442,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 15, 2008 11:26AM texrn wrote: Kimberly, What a fantastic poem! You really hit the nail on the head with that one. To all those who just got their ports - It only bothered me for about a week after I had it put in...then all of a sudden, one day, I didn't even notice it was there. I'm looking forward to getting my 2nd treatment over with, on Friday. I just didn't think I'd still feel so drained this far out from my last treatment. Besides occasional rest periods, I don't know what else I can do for this particular SE. Speaking of rest periods.........",
      "MessageIndex": 546,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 16, 2008 11:08AM texrn wrote: Hey all, Just checking in - have been lying low this past week ( had tx#3 on the 8th). I think I finally \"got it right\" with treating the GI se's; Zofran, Phenergan, & Pepcid did the trick, although I had to take them for almost a week. But I'm proud to say minimal, transient nausea with mostly the \"rock in the gut\" feeling.  As far as my weight goes - I\"m up 10lb. since my surgery last Nov. ( the holiday's didn't help) Some of my buzzed hair is still falling out ( my black hairs ), while my white hairs are still growing...TISNF! Had an upp. resp. infection this past week, & with all the nose blowing, my nose hairs started coming out, too. I've also noticed my eyebrows & eyelashes are thinning. Along with my pastey complexion, not my best look, to date. No matter, though - the majority of the time I'm living a Howard Hughes-like existence ( the flu is out of control where I live ) & I've had 2 colds since I started chemo...NOT FUN!!! The most prevalent se for me has been the fatigue. I figured this past week I was sleeping at least 16-18 hours/day. Of course, the phenergan didn't help. The fog in my head started to clear this morning, although I'm still fatigued - I do one thing like make breakfast for the family, then I have to rest. My dh keeps telling me not to fight it...so I don't - Have rented quite a few movies on pay-per-view.  My last tx is on the 29th! I have heard about post-treatment depression being compared to post-traumatic-stress-syndrome. Since I am triple negative, I will not be on any of the targeted therapies available, so after the 29th I'm on my own. I've tried to face my fears by researching all the possible scenarios, reading about those who have experienced the unthinkable, & verbalizing my fears with my dh ( he's a wonderful listener ), & when I was done, I cried, then I prayed for strength...now I can say I'm ready to get on with my life!! I can honestly say, you all are one of the best things to come out of all of this. I know I don't chat much, but reading all your posts, laughing & crying while I read, is like a safety net for me. This kind of support is priceless, & I feel very blessed to have found this thread. THANK YOU. Welcome to all the new Jewels! A happy, yet very belated, birthday wish to D1! A belated Happy Valentine's to ALL!",
      "MessageIndex": 1368,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 26, 2008 08:08AM - edited Feb 26, 2008 08:09AM by texrn As far as feeling down & blue - the worst time for me was right in the middle of all my treatments, after tx #2...all the way up until tx #3. I felt like I was swimming in the ocean & not yet able to see the shoreline yet. I started to see \"land\" right after my 3rd tx. I guess w/ bc, there is always going to be something to worry about - the only thing we can do is to keep \"swimming\" forward. Hitting rock bottom emotionally has had an advantage,for me anyway - Once I could see the shoreline, life became so much more sweeter & precious to me. Being an ICU nurse for 20+ years & witnessing a lot of human tragedy, I saw, very early on, that anything can happen to anyone of us at anytime - the most we can do is put one foot in front of the other & live one day at a time. Hope everyone has a good day filled w/ \"positives\". Therese",
      "MessageIndex": 1542,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 27, 2008 10:21AM - edited Feb 27, 2008 10:28AM by texrn Good morning everyone,  Julie - I can't imagine already feeling like sh%#, & having to deal w/ a migraine. Hope the Imitrex worked soon enough for you to get some rest. Deb - I'm so sorry for the loss of your dp's mother. Know that you, your dp, & your families are in my thoughts & prayers. I, too, hope that you find peace in the fact that she is no longer suffering. Sherry - Good for you!!! It sucks that sometimes we have to intervene on our own behalf just to get the care & consideration we deserve. I hope this new cancer center brings you the care & peace of mind you need to win, not just the battle, but the whole war. Vettegal - I know all about the heartburn - after my 1st tx it was so constant, even after the nausea was gone. After the 2nd tx, I found that pepcid really helped - I took the first one before my tx, & then took it around the clock, twice a day for 10 days. I also kept my diet as bland as possible during that time.              As far as erratic sleeping goes - I have it from the middle of week #2, until the next tx ( it's been that way after all 3 treatments ). For me, anyway, I think it's the worrying part of my brain that seems to kick in at night, plus my hormones. I haven't had a monthly cycle since 12/24 (which lasted 3 weeks) & now, all I have are hot flashes, especially at night. Sleeping pills make me feel hung over, plus I'm kind of cherishing these \"drug free\" days before my next tx on Friday. If I have to rest during the day, I just try & put my feet up, insteady of lying down, b/c when it comes to napping, I am a champion. ...Hope you were able to rest last night. Paula - Hope you were able to drink your cough into submission the other night, & that last night was FC free! I pray that it's completely gone by the time you slide into that recliner on Friday for your 4th & last (?) AC tx. Carol - I know what it's like to be a chemo-space cadet behind the wheel. In the last 2 months, I can't tell you how many times I've caught myself speeding, or how many times I've missed my exit on the freeway. One of these days, I'm afraid I'll pull into the wrong driveway in my neighborhood. Thankfully, you got the ticket at a reduced price! Kalen - I'm glad you're doing better. I, too, had anxiety & an overactive imagination, prior to my first chemo. Ativan, & even xanax, can work wonders, as well as talking about it to whoever will listen. Of course, like the others have said - keep busy. Fear of the unknown is sooo much worse than reality - you'll probably walk out of there tomorrow & wonder why you were so anxious. You'll be in my thoughts. Dana - I'm continuing to pray for you & send positive vibes your way. D1 - Congratulations!!! by the time you read this, you'll be done w/ your last chemo tx. This chapter in your journey is behind you. Hope the fog clears up sooner this time. KathyL - Hope tx #3 is quick & painless today...just one more TC to go after this!              As far as my nursing career goes, I have worked in a variety of ICU settings, all in adult critical care - trauma, neuro, med ICU, & currently, CVICU. I still love it. Pediatrics - wow! I've always believed it takes such a special, resilient person to work w/ sick children, especially after having children of my own. Wendy - Hope your dh has gotten a lot of rest - you're truly blessed to have a dh willing to step up to the plate - kudos to him! Kimberly - So glad you're out of your fog - did you enjoy the concert? Have always wanted to see the pianoman in action. To everyone going for tx, or going thru se's this week - my thoughts & prayers are with all of you, daily. Therese",
      "MessageIndex": 1564,
      "PostDate": "27/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 8, 2008 12:13PM texrn wrote: Hi everyone, Had my last tx a week ago Friday - & today is the first day I'm actually among the living. Looking back, I'd have to say my 1st & 3rd tx's were the best as far as se's. D1- you are not kidding about the fatigue. I feel like my body is full of lead, even mentally I'm exhausted. Got on the treadmill this morning - went 1/2 mile in 30minutes, then had to rest before I got in the shower...how pathetic is that? I'll have to try shout-outs later...just know, you all are in my thoughts & prayers everyday...I'm headed for the couch to sit & veg with my oldest dd...get to watch Spongebob...yippeee!! Therese",
      "MessageIndex": 1757,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Mar 14, 2008 06:31PM - edited Mar 14, 2008 06:37PM by texrn Hi all, Speaking of chemo brain... I went to pick up my oldest dd from school yesterday, got in the carpool line, kept moving forward w/ the flow, & before I knew it, I was leaving the school...without my daughter. I don't know where my mind was at, but for some reason I just took off! The kids are picked up in the back of the school, so I had to circle around & get in line again. My dd thought it was pretty funny - I was kind of panicked, though, because I have such a small window of time when I have to be back at the house for my twin 1st graders, who ride the bus, to get home.  When I'm running on time I'm usually back at the house by 3:30, & the bus drops them off at 3:38. I do have neighbors I can call in case of an emergency, & the twins both have house keys in their backpacks, which they have learned how to use - anyway... I swear, I'm such a mess. Somedays I feel like a menopausal basketcase and a chemo - space cadet! Had my 2 week/post chemo labwork done today - my blood counts are the lowest they've ever been. Ironically, I feel pretty good today. But, as usual, my family has impeccable timing.... My oldest dd came home today from school crying b/c she felt horrible & mad!!- she \"couldn't believe\" how I let her go to school this morning. But this AM she only had a sore throat, & no fever. Well, when she got home she was burning up, dizzy, & complained of a headache - I was able to squeeze her in at the ped's office, & luckily my mom was available to take her ( not a good day for me to be hanging out at the ped's office ).  Turns out she has strep throat. I feel bad for her, b/c this afternoon starts Spring break for all 3 - & she had been counting down the days! I shouldn't worry too much - last month my youngest dd had strep & my onc told me that  most adults are immune to strep. Even so, I have her quarantined up in her room, just to be safe. I guess w/ bc I'm always going to feel like I'm dodging some kind of bullet. Hope everyone has a pleasant, se free weekend! Therese ",
      "MessageIndex": 1882,
      "PostDate": "14/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 4, 2008 10:41AM - edited Apr 4, 2008 10:53AM by texrn Wow! AZ sounds nice - I don't golf but I do 'spa'. Count me in. I'm 5 weeks past my last chemo & feeling pretty good - indigestion & muscle pain have finally subsided. I go back to work tomorrow, so just in time for the se's to start fading away. I can be a wimp sometimes , so not sure how I'm going to handle back-to-back 12 hour shifts, but I'm very motivated to get back in the saddle & get on w/ my life, so maybe the adrenaline will help. Good news on the hair front! I have new stubble all over my head, & even some eyelash stubble ! The hairs on my head  that have remained throughout tx ( my stubborn white ones ) have grown to about 1/4 inch, but my stubble is coming in very dark brwn/blk. I know everyone's hair re-growth will be different - but I wanted to offer some hope as to when to start looking for new hairs. KathyL, Paula, & D1 - I too am still battling some swelling, but it is less & less everyday. I've dropped 3 lbs & I'm hoping it's some of the fluid but I still feel like a sausage & my hats/scarves still leave a ring. I have been working out at home during all of this ( albeit not as often as pre-bc ) but since my energy has come back I think I am going to hit the gym next week,( I have also been trying to avoid the gym during cold/flu season ),...of course, I have to survive my 1st weekend back at work....we'll see. I see my ps next Thurs. to schedule my exchange surgery - I am excited about this phase, plus I really like my ps - she is a little younger than me but has a very good reputation - and being female makes her more empathetic to my needs/wants. At least, that's the impression I have gotten so far. Carol - Happy Birthday to your grandma - WOW! 98 yrs old. From my vantage point these days, I feel it is definitely a privilege to grow old. I hope we all follow in her footsteps... D1 - Hope your bil turns all the corners he needs to, to start recovering. The 'watchful waiting' that families of ICU patients have to go through can be extremely draining & stressful. You and your family have been in my prayers. Lj & Dana - Hope your tx's are going as well as can be expected today - if there are any se's, hope they are quick & painless. Wendy - I agree with Carol - your nurse situation should be brought to the attention of her nurse manager. Not having a 'comfortable' confidence in your healthcare provider can be unnecessarily worrisome and stressful. Good vibes out to everyone today! Therese",
      "MessageIndex": 2254,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 14, 2008 02:34PM - edited Apr 14, 2008 02:49PM by texrn Hi, Carol - what a weekend for you! I remember not so long ago when I looked forward to at least 2 naps a day - hey, you gotta take them when you can get them. I also had a lot of night sweats while I slept & hot flashes which came mostly in the evenings - & even though I haven't seen Aunt Flo since Christmas Eve, the night sweats & hot flashes have slowed down quite a bit since finishing tx's 6 weeks ago. I hope that doesn't mean Aunt Flo is going to show up for the next big holiday. I'm so glad you have a very sympathetic boss b/c it sounds like you could use a day at home. CathyCA - Good luck on your training! If I still lived in So Cal I would join you ( we used to live in Dana Point ). Don't laugh, but since my muscle & joint pain have subsided, I have started my \"training\" for the 5k Race for the Cure here in Fort Worth (it's not exactly a 3Day) Although, if I don't pick up my pace I just might be walking for 3 days - LOL! Paula - I am so sorry you're feeling so sick from the Taxol - your students are very blessed to have a teacher as dedicated as you. I hope you listen to your body, though, & take it easy if you have to. KathyL - I know what it's like to not fit \"comfortably\" in my work clothes. I had to buy some new scrub pants b/c, even though I could stand okay in the old ones, sitting for any length of time in them really made me feel like a sausage. Good luck w/ your exercize program! wvgirl - Welcome back - don't worry about 'catching up' - it's just a relief to hear from you. Someone's here lurking or posting almost 24/7 ,it seems like - so we'll be here when you need to vent/gripe/chat. Take care. Hope everyone has a good week. Therese",
      "MessageIndex": 2397,
      "PostDate": "14/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 18, 2008 09:20PM texrn wrote: Hi all, Just checking in before the weekend - Had some wild weather last night. Of course, here in TX the weather changes so quickly, especially in the springtime. We had some wild thunderstorms last night w/ golfball sized hail. We were at the ballpark for my ds's baseball game ( a make-up game for one that was rained out last week ), & luckily they cancelled it & sent us home before the storm hit. The minute we got home, though, he started having fever, chills, headache, etc.., & of course I had no children's motrin or tylenol in the house, my dh was out of town, & the storm was just 15-20minutes away, so I couldn't leave to go to CVS. I couldn't even stick him in a tepid bath b/c there was a tornado warning, so we had to wait the storm out in the downstairs hallway closet. Poor little guy, he was so miserable - when the storm let up I was able to borrow some motrin from my next door neighbor. Took him to the pediatrician today - yep, you guessed it - strep throat. So now I'm 3 for 3 w/ the kids & strep. Luckily all 3 were off of school today, I think it was an unused snow day? As far as my bc journey goes - Saw my ps last week - am scheduled for my implant/exchange surgery on Tues. May 6th...I'm pretty excited about this next step! Saw a genetic counselor a couple of weeks ago for bloodwork - she called today w/ the good news - I'm negative for both BRCA 1 & 2. I'm equally excited about those results! My hair is still trying to fill in - I evened it out again today w/ the clippers, to 1/4 inch. I'll probably keep doing that until it all fills in b/c I'm much more comfortable going 'topless' when my hair is all even - especially at work. If my eyebrows continue to fall out I'm not sure I'll know where to draw them in on my face. Maz - I am so sorry to hear about your dear friend Val's continuing battle. As I've said before, you both are so blessed to have each other, & I pray for continued strength for both of you. D1 - congrats to your CG for her internship. My sil & also a childhood bff of my ds's have both done internships at that level of gov't - & even all these years later, they both have only good memories of that time in their lives - you must be so proud of her! Hope your trip to Austin pans out - I've always loved it down there. I hope you are able to stay on track w/ your rads...b/c WOW! only about 3 more weeks left...I'm definitely rooting for you. KathyL -  How exciting - next Wednesday to get the 'cherries on top'! My ps told me I could get mine by midsummer, but I'm going to wait until the kids return to school in the Fall. Good luck w/ returning back to the real world in 2 weeks. Time went by sooo slow while I was in the middle of my tx's...but now that it's over, looking back on everything, time feels like it has flown by. Go figure - I guess it's just a matter of perspective. Julie - Congrats to you too! All done w/ tx's - YAY!! I just loved your computer poem - definitely can be applied to me. Glad you & yours survived the earthquake. Being from Calif. I have experienced quite a few of those. Kimberly - how did the infection check-up go this AM? Hope things are improving. Hope everyone has a beautiful weekend...gotta go...dh is here w/ dinner. Therese",
      "MessageIndex": 2459,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Apr 21, 2008 05:46PM texrn wrote: Maz, I am so so sorry for the loss of your dear friend Val. You and Val's family will be in my thoughts and prayers... Therese",
      "MessageIndex": 2509,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 1, 2008 09:36PM - edited May 1, 2008 09:40PM by texrn I know all about the looks & stares from people, as I rarely wear any hats or scarves anymore. I'm keeping my hair clipped pretty short until it all fills in, so I look like I've just joined the military. I've actually had 2 patients at work tell me that they\"love\" how I wear my hair \"..but what made you decide to cut it so short?\" I think they probably knew what the answer was, & that was just their way of satisfying their curiousity in a roundabout way. I really don't mind the questions or the personal stories that follow. Once you get used to going 'without', it feels kind of liberating. I'm counting down the days until my implant surgery - next Tuesday! The last big hurdle... It seems that one by one we are all making it through the tunnel; from one hurdle to the next - from chemo, to rads, to recon..My thoughts and prayers are with all of those who are having a tougher time than others, those  who  have suffered losses of people dear to them, those with debilitating se's, infections, charred boob's, etc. But we're surviving!...definitely a reason to celebrate! Therese",
      "MessageIndex": 2657,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "May 7, 2008 02:51PM texrn wrote: Just a little story about how not to get ready for a doctor's appt:                                          \"The Washcloth\"  I was due for an appointment with the gynecologist later in the week. Early one morning, I received a call from the doctor's office to tell me that I had been rescheduled for that morning at 9:30 am.  I had only just packed everyone off to work and school, and it was already around 8:45am.  The trip to his office took about 35 minutes, so I didn't have any time to spare.  As most women do, I like to take a little extra effort over hygiene when making such visits, but this time I wasn't going to be able to make the full effort. So, I rushed upstairs, threw off my pajamas, wet the washcloth that was sitting next to the sink, and gave myself a quick wash in that area to make sure I was at least presentable.  I threw the washcloth in the clothes basket, donned some clothes, hopped in the car and raced to my appointment. I was in the waiting room for only a few minutes when I was called in. Knowing the procedure, as I'm sure you do, I undressed, hopped up on the table, looked over at the other side of the room and pretended that I was in Paris or some other place a million miles away. I was a little surprised when the doctor said, \"My, we have made an extra effort this morning, haven't we?\"  I didn't respond.  After the appointment, I heaved a sigh of relief and went home.  The rest of the day was normal ... Some shopping, cleaning, cooking.  After school when my 6 year old daughter was playing, she called out from the bathroom, \"Mommy, where's my washcloth?\" I told her to get another one from the cupboard. She replied, \"No, I need the one that was here by the sink, it had all my glitter and sparkles saved inside it.\" Never going back to that doctor.  Ever. ",
      "MessageIndex": 2727,
      "PostDate": "07/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jun 26, 2008 03:11PM texrn wrote: Hi everyone, A very belated 'Thank You' to my SP - I received a very entertaining book with some very entertaining pictures! & Dove chocolate w/ nuts - my FAVORITE!!! Also, Kimberly, thank you for the sweet card ( does this mean you are my SP? ).My 'girls' are fluffing out quite nice - I am so thankful to have some kind of discernible shape under my shirts/tanks/etc...Went to V.Secrets a week or so ago ( had rec'd a gift card from my sister for mother's day). I measured in at a respectable 38C - which is exactly where I had planned & hoped to be. It's nice, though, not to have to wear a bra all of the time - especially in this Texas heat! ...speaking of Texas heat - Paula, loved the pictures from your trip. If you ever come back out to the big D, give me a call - I would love to come out & meet you! I'm only about 20-30 minutes southwest of Dallas. Julie - Wow! seeing your picture of \"the sea of pink...\" gave me goosebumps - I can imagine what an awesome sight it would have been to have witnessed it in person. Loved your pictures, too! Carol - when is your 3Day? Sounds like your ready-to-go! D1- I would love to see some pix of your new 'do'. How long does the wash-in hair color last? Pre-bc I had always had semi-permanent color but I'm not ready to go that route yet - am thinking about trying the wash-in (wash-out?) color. My hair is 'pepper & salt' with just enough 'salt' to make it look slate grey. As thankful as I am to have hair 'at all' it's still kind of disheartening to see my reflection in the mirror because I still don't recognize myself. I'm feeling pretty normal these days & I'm keeping busy enough where I think about bc less & less every day - & when I see my reflection in a window, a mirror, etc.. it's just a reminder of what I try all day to forget..it's like \"oh yeah... now I remember\". Well, I'd better go for now - there's a MOUNTAIN of laundry calling my name.... Will shout-out more later! Therese",
      "MessageIndex": 3220,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Sep 14, 2008 10:02PM texrn wrote: D1 - Wow - what a small world! If Stuart was the guitarist in the front corner who didn't do any vocals - then from my vantage point & earshot - he was pretty good ( there were 12 guys on stage, including 2 keyboardists, a violinist & the horn section ). The audience was very distinctively middle-aged - a lot of women on a 'girls night out' - some having way too much fun. Although it was nice seeing my peers gettin' out & enjoying themselves, it was kind of awkward seeing some of them (women) enjoying themselves to the point of passing out drunk, right behind me, before  intermission.  One woman was dancing her heart out to the point where she was on the floor goin' at it...alone! Oh, & did I mention she was sitting behind us as well. Paula - thanks so much for the info on the tumor markers. When I had my last check up my onc did a CA 27.29 - I told him I didn't want to know what it was unless it was a cause for concern. That was the one & only time I have passed on any kind of information. Hope all is well w/ everyone. I must be heading off to bed .....I am soooo tired - got home around 1am & had to get up for work at 530a.... Therese",
      "MessageIndex": 3725,
      "PostDate": "14/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 2, 2008 11:46PM - edited Oct 2, 2008 11:54PM by texrn A quick HELLO to everyone - Speaking of BC awareness month - tomorrow I am going to a Komen luncheon over at the Fort Worth Convention Center - there is going to be lunch (duh!) & some comedians performing. I am taking my mom as a guest. I am excited - it'll be a nice way to spend my birthday. On the 16th I'll be taking my family to the TCU football game against BYU - it's advertised as the 'Frogs for the Cure' game. Komen is having a Tailgate Party for 'survivors' & their families, catered by a local mexican restaurant, followed by all of us 'survivors' cheering the players on to the field. I am excited - my niece is a sophomore there, so hopefully she'll be able to meet us. The weekend of the 18th (the 1 year anniversary of my diagnosis) is the Dallas County Komen Race. It'll be a family reunion of sorts w/ a lot of my closest female relatives ( both blood related & in-law) flying in. We'll be staying the weekend at a Dallas hotel. Following the race we are all going to the Grand Spa in Dallas to be pampered, followed by dinner at a local 5 star steakhouse. I know a lot of women who have gone through bc are so tired of how 'pink'  October has become - I happen to feel the opposite. I know I've told you all this before, but Komen's campaign provided a lot of much needed information to those closest to me ( my mom & my oldest daughter). at a very critical time before my diagnosis (1 week before). When it came time for me to break the news to them, they were armed w/ enough information so as not to be too frightened by the news - in fact they both took it very well.  My mom had taken my daughter to a fashion show at the local mall, sponsored by Komen, & subsequently came home w/ a lot of knowledge about bc. Although I had found my lump in mid-September, at that time, noone knew about it except for my husband. Wow....it seems like a lifetime ago, but it's only been a year...or should I say - it's already been a year!   By the end of this year I'll have 2 walks under my belt - maybe I'll try for the 3day next year? Congratulations!!! on everyone's great test results - that goes for all the Jewels who've had glowing reports as well as the ds's & dh's. There is definitely power in numbers when it comes to positive thoughts, prayers, & just plain positive vibes!! Have an awesome weekend everyone & take care!!! Therese",
      "MessageIndex": 3773,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 7, 2008 03:46PM texrn wrote: Thank you for the birthday wishes! I had a great birthday \"week\"! I am really very excited & proud to be 47 - I mean, my family has always celebrated everyone's birthday in a big way, even when I was growing up. but I never thought I would feel so privileged & blessed to be celebrating like this at 47! I feel like one of my life's goals these days is to collect as many birthdays as I can, especially surrounded by those I love. I know, pretty corny - even for a 'black & white', conservative person like myself, I can be pretty sentimental sometimes. I have to say that my most memorable birthday gifts this year was my surprise gift from Mother Nature I couldn't believe it! I had managed to stay in chemical menopause for 9 1/2 months, & just when I thought I was home free...yep, you guessed it - my 'monthly' visitor showed up...& right on my actual birthday too!!  A word of advice: BE CAREFUL what you wish for!!! I had been trying real hard, lately, to get my life back-on-track, but this wasn't what I had in mind! Oh well, life goes on.... Hope everyone is having a good week. Therese",
      "MessageIndex": 3793,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Oct 28, 2008 06:39PM texrn wrote: To all of you who have been down in the dumps lately...count me in. Whether or not it is normal, I don't know - all I know is that it's a reality for the majority of us (or so it seems that way). I agree, those who haven't been through this just don't understand how come we haven't moved on - but in fairness to my loved ones, I have become very adept at hiding my fears & concerns & alway's wearing my \"trooper\" face - plus I don't want to drag them down with me.  Not only that, but I have been keeping so busy with the normal everyday flow of my life ( 2 jobs, young children...) that sometimes I don't even notice, until I'm wide awake at 3 or 4o'clock in the morning.I think as long as we have a safe place to unload every once in awhile, be it with a professional therapist or with each other - I think we'll overcome this obstacle as well. I had a wonderful Komen Race weekend/female family reunion last week! Unfortunately, my camera is not uploading/connecting to my computer correctly -  for that matter, neither is my dd's ipod - always an 'error' screen. We are in the process of getting a new computer...Anyway, the Race went well - we had perfect weather! I guess I really wasn't that  comfortable with all that attention, b/c I felt oddly detached at times. I think some of that was guilt b/c I feel so blessed & fortunate to feel pretty normal, physically speaking - *& I know for some of those survivors, it is a lifelong battle, with no end in sight to the side effects. I guess one positive aspect is that I've been able to provide emotional & practical support to friends who are starting their journey. Speaking of which, one of the mother's on my ds' flag football team has just been diagnosed w/ lymphoma (NHL). She will be starting chemo this Friday - 6 -8 treatments every three weeks with 5 different drugs! I'm putting together a chemo-care package for her - any suggestions? My mind keeps going blank when I try to think of things to add to the package. I don't know if it's chemo-brain or if my mind is trying to block that part of my life. After chemo, she will be starting radiation to the area ( upper-inside area of her thigh) - any tips for radiation side effects? I suppose I could just review our past posts... Anyway, prayers for her & her young family please... D1 - I'm afraid I stole your halloween graveyard idea - I only made 4 headstones, though. My kids love it!! Well I'm off to a middle school football game - dd's band is playing in their first game!!! Take care of yourselves, Therese",
      "MessageIndex": 3879,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Jan 11, 2009 12:50PM - edited Jan 11, 2009 12:51PM by texrn As far as a JJ reunion goes - I'm all for Vegas anytime of the year!! The week of July 13th sounds great! A 2 or 3 night stay sounds good, too. I could probably do a Mon. - Thurs. - since I don't plan on bringing my dh, he can stay home and team up w/ my parents to take care of the kids. Last time I went I stayed at the Mirage - pretty good rates, a very central location on the Strip - really enjoyed my stay. I went alone for a nursing conference, although my sister joined my for the first half of my trip. Even though I love to play BlackJack, I/we didn't gamble too much - went shopping, saw some great shows ( Elton John at Caesar's Palace), ate at some great restaurants, etc... That was 2 years ago this spring, so I am definitely due for a getaway! Hope everyone is having a great weekend!! Having a pretty good day today here at work, although yesterday really sucked!!! Didn't get out of here until almost 10pm (got here at 6:45pm). Between the nursing shortage & patient's getting sicker & sicker here in ICU... Oh, well - life marches on.... Therese",
      "MessageIndex": 4218,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    },
    {
      "AuthorID": "texrn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61454/profile",
      "Content": "Feb 6, 2009 04:27PM texrn wrote: Maz - I too ditto all that has been posted about your re-occurence - Damn!! Every single one of us is here for you, whether it's here or on FB, to lean on. Many positive thoughts & prayers & vibes your way from my part of the world! So Sincerely, Therese",
      "MessageIndex": 4480,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/696709",
      "Title": "Jan 2008--Ain't it Great? Determined1 Diana63"
    }
  ]
}