{
  "AuthorID": "TFrye",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
  "Posts": [
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 7, 2009 09:05AM TFrye wrote: I think you are doing the right thing listening to your doctor and having the diagnostic testing done. I will tell you that a mammogram is uncomfortable but it is bearable. Given your age, your breasts are probably still fairly dense which is why they want to do the ultrasound too. Also, ultrasound can identify cysts more positively than xray can. I was able to find out that one of my lumps was a cyst after having a mammogram and ultrasound. In fact they had found 2 cysts, one of which I was not aware of. I suppose it will depend on the radiologist whether or not they tell you anything right then and there. She did tell me before I left the ultrasound room that it was cysts. I know I probably haven't answered all of your questions but this is all I know for sure. Let us know how it goes for you Trish",
      "MessageIndex": 2,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733791",
      "Title": "Freaking out... Dlw TFrye"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "Apr 30, 2009 05:16PM TFrye wrote: You would think that when I called and asked for my BIRAD score they would know that I was becoming educated and just tell me what it was. But no. She doesn't want to worry me unecessarily, after all it's just an estimate. Well gosh. I know enough to ask what the BIRAD score was doesn't she think I know that? So this tells me that it's either a 4 or 5 which wouldn't surprise me given the radiologist's reaction when she showed me the magnified image. So I continue to wait however today I am surprisingly calm. Still no results in but I hadn't expected them to be back so quickly anyway. I was told that she will call and I will have to go in to hear the results so at least I won't freak out when that happens thinking they are only calling me in to tell me the worst.",
      "MessageIndex": 7,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 1, 2009 11:38AM TFrye wrote: Ok, I can not believe what is happening. Our phone is out of service and I can't make or get phone calls. I had to wait for my daughter to get home (she lives with us) to ask her to use her cell phone. So I call the dr's office to give them the number to call if my test results come in and the nurse says oh I think we got them, hold on. So I'm holding and she comes back on and tells me that I have to call the hospital and talk to the radiology department something about having to re do the biopsy. Has anyone had to go through this? So anyway I called the hospital right away and of course the line is busy but I keep trying and now the lady who does the mammograms is with a patient and that's who the guy says he wants me to talk to. Now I have to wait for a call back to the cell phone and I'm going crazy. I was doing so well yesterday and now this. I called my husband at work and just completely broke down on the telephone. I am simply beside myself.",
      "MessageIndex": 8,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 4, 2009 06:19PM - edited May 4, 2009 06:21PM by TFrye Well, I'm back now with my films and she told me that she also included the path report as well as the imaging reports, so yeah, I had to take a look. But you know it is empowering to have the information. Here's what they say. Mammogrophy-Screening April 14, 2009 Discussion: Standard views of the breasts were obtained. The breasts are composed of non-weight fatty breast tissue. There is evidence of a somewhat poorly defined mass in the posterior third of the upper-outer quadrant of the left breast measuring 10 x 7 millimeters in diameter in size with heterogeneous microcalcifications identified within this mass.  This was not present in 2006 study. The mass is new since 2008 as are the microcalcifications. Impression: Microcalcifications in an irregularly shaped mass in the posterior third of the upper-outer quadrant of the left breast. I am recommending spot magnification views of this area plus ultrasound study for additional analysis. BIRADS 0 - Incomplete: Needs additional imaging evaluation. Mammography Diagnostic - Unilateral April 24, 2009 DIscussion: Spot magnificaion view was obtained in the straight lateral projection. Irregularly shaped calcifications are again identified with an associated focal area of increased density. These calcifications are new since the prior exam. Impression: Irregularly shaped calcifications in the upper-outer quadrant of the left breast associated with a focal area of irregular density new since the prior exam. The appearance is very suggestive of malignancy and biopsy is recommended. Please see ultrasound report as well. Ultrasound guided biopsy is being scheduled. BIRADS 5 - Highly suggestive of malignancy. US - Breast Unilatiral - Left April 24, 2009 Comparison: 03/21/2008 Discussion: Ultrasound evaluations of the left breast was performed. At the 1 o'clock position a focal area of dense shadowing is identified associated with an irregularly shaped hypoechoic lesion measuring 1.2 x 1 x .07 cm. This is adjacent to a 6mm cyst, which was also seen on the prior exam. Impression: An approximately 1.2 cm irregularly shaped hypoechoic lesion with dense associated shadowing as described above at the 1 o'clock position corresponding to the mass with calcifications seen on the mammogram. This is very suggestive of malignancy and biopsy is recommended. Findings were discussed with the patient and with her doctors office as well. Ultrasound guided biopsy has been scheduled. BIRADS 5 - Highly suggestive of malignancy. US - Breast Biopsy Unilateral April 29, 2009 Discussion: Ultrasound examination again demonstrates a focal area of shadowing at the one o'clockk position, left breast. Procedure technique and potential complications were discussed with the patient and informed consent was obtained.  Using sterile technique and local anestesia, a 14-gauge biopsy needle was advanced to the mass at the one o'clock position under ultrasound guidance and biopsy was performed. Using similar technique a total of 6 passes were made. Patient tolerated the procedure well. Impression: Completed ultrasound guided biopsy left breast mass 1 o'clock position. Pathology result is pending. Anatomical Pathology - Final Left breast mass Gross examination: Left core biopsy - The specimen consists of four fatty core biopsies ranging in length from 0.7 cm to 1.9 cm. ES in A through D (8 hour fixation). Microscopic examination: The sections show fatty breast tissue without atypical proliferation Diagnosis: Left breast mass, core biopsy: benign fatty breast tissue, negative for malignancy. Now my questions are, if the dr took 6 passes, why are the pathologists only examining 4? What is the possibility that the mass actually was missed hence the reason for the stereotactic biopsy tomorrow? They included a disc of the ultrasound procedure but it's sealed otherwise I'd watch it too. She had taped closed the envelope with the x-rays and the written reports so it was simple enough to open. And as I've had many tell me, they are mine so why shouldn't I be allowed to look, right?? Anyone have any thoughts?",
      "MessageIndex": 15,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 5, 2009 05:54PM TFrye wrote: Thanks floridian, I'll keep that in mind depending on the results. I'm back now from having the stereotactic biopsy done. I can definitely say that it was uncomfortable but only because of the table itself and where I had to lay in relation to the center hole. I will say that they tried to make me as comfortable as possible since you do have to lay there for a good while without moving. They actually did an x ray on the tissue sample they took this time to be sure that they had removed some of the microcalcs. I don't think that they did that the last time after the ultrasound guided one.And they left a titanium marker behind for future reference. I did learn today that the mass and microcalcs are very near the surface of the skin, They are much more used to having to go deeper into the breast tissue so apparently it was a unique experience for all concerned, lol. Now I'm just back to playing the waiting game. I was told that if I hadn't heard from them, I could call on Friday and they should have the results of the pathology report. Trish",
      "MessageIndex": 21,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "Apr 29, 2009 02:12PM TFrye wrote:",
      "MessageIndex": 2,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "Apr 29, 2009 04:54PM TFrye wrote: Thanks ladies. I'm so glad that I found this forum. My husband is trying to help me think positive too, which is what I need to be doing. There is no history of breast cancer in my family although my father, a grandmother and my great grandmother all had cancer of one type or another. My mom went through something similar and found out that she had calcified milk ducts and not cancer so I am trying to think that what they found on mine will be similar to that. But during the ultra sound, I was asking the tech what certain things were that I was seeing on the screen and I asked once if that was a milk duct and she said no, the milk ducts would be coser to the nipple are so I'm thinking that rules that out.  But, whatever it turns out to be, there is nothing I can do about it until the report comes in and somehow I'll deal with the results when I know for sure what it is. Well, it sounded good anyway, lol.",
      "MessageIndex": 6,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 1, 2009 08:42PM - edited May 1, 2009 08:43PM by TFrye Thanks ladies. This is my therapy so to speak...all this posting. I'm scheduled for a stereotactic biopsy on Tuesday. The hospital said that the path report came back as normal breast fat tissue, so they are concerned that they didn't get the right spot the first time which is why I have to have the re-do. The good thing is that even though I have to go to Ft Wayne and have it done, I'm going to the Breast Diagnostic Center there and from what I understand this stereotactic biopsy has more of a chance of getting pinpoint accuracy than the ultrasound guided one. So hopefully just one more week of wondering and frustration before I find out with more certainty what has caused the calcification and all this not knowing will be gone. Truthfully it's the unknown that has me so frightened. If I knew and it was bad, I could deal with it so much better.",
      "MessageIndex": 11,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 5, 2009 09:40PM TFrye wrote: Welcome to the group lin2009. So sorry that you are joining us under such troubling circumstances but on the other hand that is what has brought us all together Personally, my microcalc and mass was found via my yearly mammo so I haven't even seen a surgeon yet. I would imagine that he will examine you and recommend some sort of diagnostic testing be done be it mammo or ultrasound. Calling is a good idea, they should be able to give you a better idea of what to expect when you go in for your appointment. Keep posting. Take it from me, it is excellent therapy and we'll be thinking about you Trish",
      "MessageIndex": 23,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "TFrye wrote: Well, I certainly never thought I'd belong to a group such as this however, I had my yearly mammogram 3 weeks ago. We were in the process of moving so I didn't get the call from the hospital radiology department requesting that I come back in for a close up and ultrasound of some calsifications that showed up. I learned about that from the nurse practitioner that I see and they scheduled me for those just a few days later. Once I had the close up, I was able to talk to the radiologist and she showed me the x-ray. Sure enought, there was a cluster of calsified deposits that she labeled suspicious and wanted to see if the area could be located on ultrasound. If it hadn't been, I would have had to go to a larger city for a different biopsy procedure. As it was, they could locate it on ultrasound and I went back this morning and had the ultra-sound assisted core needle biopsy done. For the most part I'm just pretty sore but I'm hoping that an ice bag and ibuprophen will help some. When I asked about the pathology report, they said about three days and since it's Wednesday now, it probably won't be until Monday. Man, the waiting is the hardest part. I've had one health problem after another for the past 5 years or so. I hope I can deal with a hit like this if that's what it turns out to be. Anyway, thanks for letting me vent :-) Trish Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 4, 2009 08:23PM TFrye wrote: Well, hmmm. Thanks for the info leaf. I guess that would explain why they tested 4 and there were actually 6. I suppose they have good results doing it that way otherwise why would they do it that way, right? So have you got plans to turn them into art of some sort? It would definitely be a one of a kind piece!",
      "MessageIndex": 17,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 8, 2009 10:40AM TFrye wrote: Thanks everybody! I have been beside myself with relief for about 24 hours now. I actually slept through the night last night, lol I will tell you though that this experience has affected me tremendously in a positive way. Hearing all of your stories and knowing the fears first hand changes a person. In my \"other\" life I enjoy digital scrapbooking. It's scrapbooking on the computer. I have some cyber friends that create the kits that digiscrappers use to make their layouts and I've gotten some of them to agree to make a charity collab kit that is going to be available on their blogs on May 27th and on my own blog that I started when I first began going through this. There will be a donation button on each blog that sends  them directly to breastcancer.org's donation site. I felt it was the least I could do to try and help give back in some small way.  The kit will be getting advertised on many different groups and digital scrapbooking forums so hopefully when they come to download each part of the kit, they will choose to donate something at that time. It's called \"Hope for a Cure, Breast Health Awareness Charity Kit\"  My participation here is far from over either. I've been through the waiting and worry over a BIRADS 5 and 2 separate biopsy proceedures. I am committed to trying to help ease another's fear and anxiety that is facing this for the first time as well. The other thing is my blog. I am trying to promote breast health awareness and the importance of early detection So anyway, I'll quit rambling now. I hope if there are any digiscrappers out there you contact me! I can give you more details about the kit! Take care all, and (((HUGS))) to everyone Trish",
      "MessageIndex": 28,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 2, 2009 10:57PM - edited May 2, 2009 10:59PM by TFrye Thank you all so very much. It is so heartwarming to be in this sisterhood of beautiful women that care so much for each other and men alike. Monday afternoon I will pick up my films and a disc of the ultrasound to take with me on Tuesday. I am the only one so far that has even seen any of these things of myself.  I know that I am not qualified to draw any conclusions from them and now that I'm thinking about it maybe I shouldn't look at them, I don't know how I will react once they are in my hands, know what I mean?? What would you do or have you done if/when you had the same opportunity? Trish",
      "MessageIndex": 14,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 7, 2009 11:46AM - edited May 7, 2009 11:55AM by TFrye Hi all! I just wanted to let you know that the Breast Diagnostic Center just called with my pathology results. It is B9!!!! It is such a relief to know finally that I don't have to worry anymore. She said they identified it as fat necrosis and from what I've been able to gather, on mammogram and ultrasound, it can mimic cancer and the only way to know for sure is biopsy. Thank you to everyone here who has said prayers and offered encouragement. You have all truly been sanity savers during all the waiting and second biopsy. God bless you all. Trish",
      "MessageIndex": 24,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/733329",
      "Title": "Had my biopsy this morning TFrye mkenglish"
    },
    {
      "AuthorID": "TFrye",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83031/profile",
      "Content": "May 1, 2009 01:47AM TFrye wrote: That's awesomely amazingly wonderful! So happy that your wait is over and that you had such fabulous news!",
      "MessageIndex": 1,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733426",
      "Title": "brnign and thanking everyone tayreb patoo"
    }
  ]
}