{
  "AuthorID": "Thancock760",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238483/profile",
  "Posts": [
    {
      "AuthorID": "Thancock760",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238483/profile",
      "Content": "Thancock760 wrote: Well, I find myself here after a random SBE and found a lump. I called the doctor two days after finding it and went in for a CBE. Dr. Confirmed the lump and has set me up for dx mammogram and US with possible biopsy for Monday 8/29. I am trying so hard not to let the worry consume me. The lump is a weird hard one, kind of like a b.b., or what reminds me of a small glass bead. It is in the inner upper quad, a little bi outside the areola. It seems attached in a way to other tissue. In any case, there will be a dr. On site who will review everything with me in the same visit. That is nice at least. If doing a biopsy, results will take longer and will know after. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847460",
      "Title": "New and waiting Thancock760 MelissaDallas"
    },
    {
      "AuthorID": "Thancock760…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238483/profile",
      "Content": "Aug 29, 2016 02:58PM Thancock760 wrote: Well, today was interesting. To start, the good news is that the radiologist said that everything was clear on the mammogram and ultrasound. The part I am uneasy about, is that the techs did the mammo and US and were awesome, and the Dr. didn't even spend two minutes with me. She came in the room and said, well, it is all good news, but the bad news is I have no explanation for your lump. She then questioned how often I am doing SBE's and just kinda said Hmm, when I said I was not consistent. I am not sure why, but I feel really uneasy about all this. I am not feeling I had any explanation on anything, any troubleshooting on what the lump is etc. I should be really happy that the mammo/us were clear, but it all just struck a weird nerve and I do not feel confident in this. Am I tripping out??? I did email the Dr. I saw when she ALSO felt the lump and explained the way the appointment went today and requested perhaps that someone can look at everything again and give me a better explanation of what was and was not seen. (I didn't even get to see the scans). Any thoughts?",
      "MessageIndex": 5,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847460",
      "Title": "New and waiting Thancock760 MelissaDallas"
    },
    {
      "AuthorID": "Thancock760…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238483/profile",
      "Content": "Aug 28, 2016 06:47PM Thancock760 wrote: is there anything I should ask in general with the mammo and US or the the radiologist just guide me through it all?",
      "MessageIndex": 2,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847460",
      "Title": "New and waiting Thancock760 MelissaDallas"
    },
    {
      "AuthorID": "Thancock760…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238483/profile",
      "Content": "Aug 29, 2016 04:21AM Thancock760 wrote: So much for good sleep, up at three AM this morning. Not freaking out, but my mind is definitely racing.",
      "MessageIndex": 4,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/847460",
      "Title": "New and waiting Thancock760 MelissaDallas"
    }
  ]
}