{
  "AuthorID": "ThaQueen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158598/profile",
  "Posts": [{
    "AuthorID": "ThaQueen",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158598/profile",
    "Content": "ThaQueen wrote: I need help today I had a mammogroam and ultrasound done but just like the other two times they don't see anything but they can feel it. Today was the day I freaked out because the doctor peeked in and said \"Its a couple of benign tumors\" my daughter thought it was funny cause she is a college student and she felt the lump in my breast plus denting it feels like if u drop a rock in clay it makes a big dent (visual picture for you) plus when i look in the mirror my right breast is oval my left breast looks deformed like it's shaped funny plus the lump looks from the outside like a bump. I know my boobs I never had a big dent in my breast plus the right breast have all the normal fatty tissue. I asked the girl who was doing my ultrasound why my breast look so white she said it'is densitiy. So ok if my breast is dense how in the world u gonna find a needle in the haysack. I walked out and tear fell from my eyes my grandmother just passed away in April because they couldn't see anything on her mammo. The cancer spread to her lungs her I have three aunts that died from breast cancer one did her mammo every year they caught hers in time. I just want some advice I don't have health insurance I went to the Mary Bird Perkins foundation. I'm just looking for advice. Maybe I'm tripping but I know something is wrong I had too many family members die from this nasty stinky thing. I really feel they didn't want to do anything else because I don't have health insurance. Any advice is welcomed. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "14/08/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792002",
    "Title": "mammograms and ultrasounds not showing lump but it's there. ThaQueen RobinJoy"
  }]
}