{
  "AuthorID": "thatsvanity…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
  "Posts": [
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Apr 3, 2014 02:27PM thatsvanity wrote: Your post is calm, peaceful, hopeful serene, have a beautiful peaceful journey.",
      "MessageIndex": 141,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819674",
      "Title": "Hospice for me. Chickadee Jac53"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 10, 2012 06:51AM thatsvanity wrote: I used to have kaiser, now I have health net PPO, and kaiser is just as good for way less money. Kaiser emails test results ASAP. The only problem I had with kaiser was the communication between the doctors and their pharmacies, which was kind of a big problem, I don't know I guess they all have their problems.",
      "MessageIndex": 17,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780728",
      "Title": "Feeling so upset at doctor liveit56 liveit56"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 9, 2014 03:48PM thatsvanity wrote: thank you ",
      "MessageIndex": 3,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823509",
      "Title": "K-Lo? thatsvanity thatsvanity"
    },
    {
      "AuthorID": "thatsvanity",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "thatsvanity wrote: Hi everyone, I've followed K-Lo since 20011 when my sister was diagnosed with stage IV BC. K-Lo posted so much and helped so many women with brain mets. I hope this isn't her obituary but if it is she's left an amazing legacy of her career as a nurse, wife, mom, grandma and a huge contributor on  BC.org. Love and blessings Kathy Day | Visit Guest Book on Thursday morning, July 24, 2014. The cause was metastatic breast cancer. Born in Philadelphia, PA on February 23, 1955 to parents Mercedes and Charles Lopez, Kathy grew up in Palmyra NJ. She trained as a registered nurse at The Cooper Hospital School of Nursing in Camden NJ, then worked as an RN in Ocean City NJ, Long Beach CA, Bloomington IN, Franklin IN, and Columbia MO, before finishing her career in Birmingham Alabama at UAB Hospital. She gave care and comfort to many during a nursing career that lasted 36 years in several specialties including critical care, operating room, and PACU. Kathy was a member of the Unitarian Universalist Church of Birmingham, where she worked with the membership and justice committees. She enjoyed birding, music, gardening, and playing with her friends and family. She is survived by her husband of 34 years, Timothy Day, her son Matthew Day, 23, her two-year-old grand-daughter, Alaina Day, and by her sister, Barbara Giano, and brother, Charles Lopez. A memorial service will be held on Saturday, August 9 at 3 p.m. at the Unitarian Universalist Church of Birmingham located at 4300 Hampton Heights Drive, Birmingham, AL.Memorial contributions may be made to the Greater Birmingham Humane Society, Birmingham Audubon, or Living Beyond Breast Cancer. Atypical lobular hyperplasia(11/11/10) PBMX NS mastectomy on 5/26/2011 Dx 11/11/2010, Stage 0, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/823509",
      "Title": "K-Lo? thatsvanity thatsvanity"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jul 27, 2011 03:29PM thatsvanity wrote: Having a cup of coffee with my sister. Being silly with her laughing together at silly things only we could relate too.",
      "MessageIndex": 6,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772244",
      "Title": "post a favorite memory if you want apple china"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 9, 2012 05:27AM thatsvanity wrote: When I was in London, I experienced or perceived the way Londoners communicated to be very direct and expressive of their own personal opinions, compared to the way we communicate in the United States. I've never heard a nurse say much more than how much do you weigh, do you smoke, roll up your sleeve to take your blood pressure. I think it is a cultural communication difference. And yes she is mad, she seems like she is not concerned about your emotions but perversely enjoying some power over you---(all patients are in a doctors office with the nurse or doctor are somewhat vulnerable and expect to be protected and healed, not admonished about something that is none of their business, she sounds like a nurse in a horror movie) Amy lynn",
      "MessageIndex": 23,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796077",
      "Title": "Is this nurse slightly crazy? Tillycat K-Lo"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Apr 29, 2012 11:45AM thatsvanity wrote: My sister was diagnosed in jan of 2010 and she died feb 2011. I was diagnosed with atypical lobular hyperplasia in nov of 2010 and I had a PBMX in may of 2011. I still cannot believe I am writing these words. I'm glad for you both that it was detected early and I pray and hope for for the best outcome for both of you. This really seams to be a family disease in my family as many other aunts and an uncle were diagnosed with BC in my family. Amy Lynn",
      "MessageIndex": 50,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/786281",
      "Title": "Sister and I just diagnosed within a week of each other bevg49 AnewBeginning"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 25, 2012 04:05AM thatsvanity wrote: Awe your son sounds so sweet and precious, stay tough you can do it! Tomorrow will be better, take one step at a time.",
      "MessageIndex": 7,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781593",
      "Title": "Young and Over Yet (bad PET> Tiger_Blood vickib"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 20, 2011 06:39PM thatsvanity wrote: I love you Elizabeth I know you are with my sister now, we are all fellow travelers and I'll meet you one day... You were so funny! Thank you for your legacy of honest posts and funny comments! My favorite, \"at least I was wearing panties when I fell! Yeah! Love it!",
      "MessageIndex": 764,
      "PostDate": "20/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/769397",
      "Title": "Welcome to my Bizzaro World konakat CapeBretongirl"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jun 18, 2013 10:16PM thatsvanity wrote: Can you have a mammorgram or an ultrasound? ",
      "MessageIndex": 1,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/806374",
      "Title": "23 and Worried Chibi418 Momcat1962"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 4, 2012 09:35AM thatsvanity wrote: P.s. You are in the UK I love England's cream and butter yummmm, and the food places at harrods yummy!!!!",
      "MessageIndex": 21,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780340",
      "Title": "Lump not detected by mammorgram SueJR SueJR"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 3, 2012 08:50AM thatsvanity wrote: I had a lump only felt by me, my doctor an husband. Imaging couldn't detect it because of my breast density, but the lump was removed and it wasn't cancer but it was atypical lobular hyperplasia. I really hope everything goes well for you. Amy Lynn",
      "MessageIndex": 11,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780340",
      "Title": "Lump not detected by mammorgram SueJR SueJR"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "May 28, 2013 10:04PM thatsvanity wrote: Angie is a world famous A list celebrity who did a selfless act of preventative mastectomy and sharing it with the world so other women can increase their awareness of pre-cancer options. I would not be surprised at all if she advocates for improved screening for women with dense breast tissue and a strong family history of breast cancer. She watched her mother die of cancer, after I watched my beloved sister die of BC I had a PBMX it was a no brainer for me. My avatar is my sister Kara one year before she died. I'm glad she made her medical choice public, it will in no way harm anyone it can only help others.",
      "MessageIndex": 122,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/804660",
      "Title": "Angelina Jolie's prophylactic surgery JoanQuilts SusansGarden"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 4, 2012 09:31AM thatsvanity wrote: Hi sue, Me too I'm glad it wasn't cancer too, I was even shocked it was ALH, as when I got the diagnosis my younger sister had only 3 and a half months to live from mets BC. I just thought wow two healthy sisters me 45 and my sis 42, it was just crazy to have cancer in our lives, but as I read other's stories sadly a lot of families can have more than one cancer going on. But before the surgeon removed the lump he put a needle in the lump and no fluid cameout so then he removed it. I'm grateful fir that doctor, because some doctors could've said let's just watch it keep an eye on it, but he got in there and took it out. Your biopsies breast, sue, might be smaller than your other breast but who cares you want to be healthy of course, like we all do. Good luck. Did your surgeon take a needle biopsy? I'll go back and read more, maybe you already had that done. Love Amy Lynn",
      "MessageIndex": 19,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780340",
      "Title": "Lump not detected by mammorgram SueJR SueJR"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 3, 2012 08:54AM thatsvanity wrote: I agree with the other ladies about the long waiting, but I'm glad your appointment is closer now in January.",
      "MessageIndex": 12,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780340",
      "Title": "Lump not detected by mammorgram SueJR SueJR"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 4, 2012 09:34AM thatsvanity wrote: I think when the doc gets into your breast they look and take out whatever doesn't look like it should be there then they send it to a lab and look at the cells under a microscope and determine if it is nothin, ALh, ADH or whatever it could be. You have 9 days til your biopsy, I'll check on you try not to worry yourself sick. Love Amy Lynn",
      "MessageIndex": 20,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/780340",
      "Title": "Lump not detected by mammorgram SueJR SueJR"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 19, 2013 07:33PM thatsvanity wrote: Hi In The Wind, I have kaiser and they were going to do my prophylactic mastectomy based on family history and an atypical biopsy. I live in California. I'm not sure but can you go to another Kaiser? I think they have breast cosmetic surgeons. When I made my choice though I paid out of pocket for a private practice plastic surgeon only because I could afford it in 2011, but I think kaiser has a lot of good specialists in breast oncology and reconstruction. It sounds like they were slow getting your PET scan. I hope everything goes smoother for you with your upcoming appointments. Amy Lynn",
      "MessageIndex": 56,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798613",
      "Title": "Stage and grade of cancer determined AFTER surgery. What!?! InTheWind InTheWind"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 27, 2011 02:40PM thatsvanity wrote: Dear Apple and the kind women on this topic, and livingit for your gracious sweet honesty, I'll check with the moderators about finding any posts that my sister may have written, thanks for the tip about the moderators. Thanks too for letting me join in on this topic. Love to everyone, Amy",
      "MessageIndex": 29,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778695",
      "Title": "Help, Im boring. Cant talk about anything but cancer. LivingIt Reneepals"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 13, 2011 05:26AM thatsvanity wrote: >> In memory of my sister, Kara, I believe this information is important for the underrepresented young women who are diagnosed with breast cancer. >>   >> If popular opinion were true, \"Young women don’t get breast cancer.\" >>   >> We all know the truth, though— young women can and do get breast cancer. >>   >> Unique Challenges: >> No effective breast-cancer screening tool yet exists for women ages 40 or younger. >>   >> A Different Enemy: >> Compared to older women, young women generally face more aggressive cancers and lower survival rates. >> More and more evidence tells us that breast cancer before age 40 differs biologically from the cancer faced by older women. >>  Since breast cancer occurs at a much lower rate among young women than in our older counterparts, young women remain underrepresented in many research studies. >>   >> Each year, approximately 70 thousand men and women age 15 to 39 are diagnosed with cancer in the US. >>   >> Breast cancer accounts for roughly 15% of all cancers in this age group. >> Women ages 15 to 34 and 35 to 54 die more frequently from breast cancer than any other cancer. >> In 2009, the American Cancer Society predicted more than 190,000 new cases of breast cancer in women. >>   >> They estimated that roughly 18,600 of these women would be younger than 45. >>   >> Cited references:www.youngsurvival.org/ >> Non-profit organization oriented to support and educate about breast cancer in >> younger women.",
      "MessageIndex": 46,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 27, 2011 06:55AM thatsvanity wrote: I wish when my sister was sick I would've listened more--- looking back I can't believe the wall I had around me with her wanting to communicate about everything that BC brings with it. I tried hard to help manage her pain. I came to this site after she had left this physical world to see if I could find any posts of hers to see what she was going through to be close to her but i couldn't find her on here. I think loved ones who have never been through a difficult illness, just truly believe in their hearts that the person they love will live forever. I just thought she would live sick forever.... I made her good smoothies and fluffed a comfy bed for her, picked up her medications, but I wouldn't let her talk sometimes about her fears and worries as if that would somehow have prevented her physically leaving me, I guess I just couldn't bear it, but she was stronger than me, my younger sister who I loved and helped her so much----buying cars, going to college, she was way braver and stronger than me. I know she was worried about leaving me so maybe that is why she let me be the way I had to be. She wanted to talk about side effects of medication, and I said just take the medicine. And I made her a quilt instead of listening, we were both just on a journey of a winding complicated road--just tying to be good to each other in our own way. She said none of her friends would listen about the good smoothies I made. I'm rambling I'm sorry. Cancer isn't boring it effects everyone so we should all talk about it, I guess people just want to shore up against it, as if it will keep it at a distance but cancer will never be distant for anyone, everyone will be in the midst of cancer some how some way in their lives.",
      "MessageIndex": 14,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778695",
      "Title": "Help, Im boring. Cant talk about anything but cancer. LivingIt Reneepals"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 27, 2011 07:03AM thatsvanity wrote: I saw an old acquaintance after an absence of a few years, I asked how she was she replied oh a lot of drama in my life. I said my sister passed away of breast cancer. She curled her lip and said ooooh like my sister had had head lice or something. Her drama was her daughter having relations with low lifes. She never said anything else. I felt like choking the life right out of her stupid face. It is that ignorance that makes me angry more than the human experience of fear of our own mortality.",
      "MessageIndex": 15,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/778695",
      "Title": "Help, Im boring. Cant talk about anything but cancer. LivingIt Reneepals"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 13, 2011 05:39AM thatsvanity wrote: You are so beautiful you can have a wig but you would be beautiful without hair too!",
      "MessageIndex": 48,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 13, 2011 05:37AM thatsvanity wrote: I feel deep in my heart that you can walk through this and rely on the compassion of friends and family to help you. Be specific to your friends and family about what help you will need. Babysitting, grocery shopping, cleaning the house on Tuesday mornings etc... People want to help but it is easier for others to help if you are specific about what you need. As women we want to do everything and be strong but it's ok to let others in and help you. Much love to you. Amy",
      "MessageIndex": 47,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/772537",
      "Title": "In shock bella76 chrissyb"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 9, 2012 09:23PM - edited Jan 9, 2012 09:34PM by thatsvanity I had PBMX in may of 2011 and I was diagnosed with ALH in November of 2010. I was diagnosed with ALH at age 44, at the time of my ALH my younger sister age 42 was dying of bilateral breast cancer, and I've had other family members die of BC so it was a concurring decision with four doctors that a PBMX was a good choice for me. Best wishes to you and your decision. I also had an uncle die of BC so it's highly genetically influenced that I have a high risk of developing BC. Amy Lynn",
      "MessageIndex": 11,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/780683",
      "Title": "ALH farmerlucy Diane5"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Oct 27, 2013 04:57PM thatsvanity wrote: How about swimming?",
      "MessageIndex": 12,
      "PostDate": "27/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/813567",
      "Title": "Can anyone recommend exercise for a girl with bone mets? listee Just_Sue"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 6, 2012 09:29AM thatsvanity wrote: Hi live it, Anxiety attacks are terrifying. I had them really bad. I had to get medication for my own case, but I sure hope they go away for you, and breathing deep is really helpful. The few times I have done yoga the breathing is so relaxing I could almost fall asleep with correct breathing. When I get scared I start taking short rapid breaths and it increases my anxiety. I'm sure you will be able to manage your anxiety with a positive outcome. Amy Lynn",
      "MessageIndex": 2,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780532",
      "Title": "anxiety attack liveit56 liveit56"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 1, 2012 02:10PM thatsvanity wrote: I'm so sad for her family friends. Her blog is really good and heartfelt. I'm so shocked and sad. I hope she has a new purpose somewhere with her husband. Amy Lynn Parker",
      "MessageIndex": 10,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791415",
      "Title": "BlondeLawyer ICanDoThis meima-Bev"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "May 9, 2012 03:03AM thatsvanity wrote: I had ALH while my sister was diagnosed with METS BC. I had a nipple sparring prophylactic mastectomy 4 months after my sister passed away, for me it was the right thing to do for my health and peace of mind.",
      "MessageIndex": 9,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/786926",
      "Title": "ALH what to expect now swimmom01 swimmom01"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 20, 2011 11:54AM thatsvanity wrote: My lump didn't show on a mammogram or ultrasound, so the doctor did a needle biopsy and there was no fluid, so my doctor removed the lump surgically and sent it to a lab. The pathology report was atypical lobular hyperplasia. I am so grateful to the kaiser doctor who removed that lump. He could've waited but he didn't. Then he offered me tamoxifen, or increased imaging, or mastectomy and I chose preventive mastectomy. That was my second mammogram Ive ever had but the lump was felt by me and my husband, while this was going on my baby sister had only 3 months left to live as she was dying of met BC, she implored me to take care of my lump and I did. I never knew my dense breasts cannot be imaged. I am 45 and my sister was 42 when she died.",
      "MessageIndex": 12,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/778215",
      "Title": "How to handle pulpable lumps that don't show up on mammograms dense SarahsMom"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Dec 29, 2011 03:28PM thatsvanity wrote: When I was in France they didn't put a huge media driven cultural point of view----that breasts make a woman beautiful. My breasts are part of my self-image because I had an elective BMX with implants. At age 20 I wouldn not even think of a BMX. I don't know yet at another age if I would have had no reconstruction. Self-image, our culture so many things influence a woman's choice, but I think it would be kind of cool to go running around with no breasts and no shirt on!",
      "MessageIndex": 48,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 3, 2011 02:21PM - edited Aug 3, 2011 02:38PM by thatsvanity My younger sister died of invasive ductile carcinoma in both breast it had mets to her spine, liver and pelvis she lived one year past her diagnosis. I had an aunt, uncle--- brother and sister and their mom my grandma die of breast cancer. My geneticist told me that a male relative is most likely a genetic mutation, but I am not BRACA pos. I chose prophylactic mastectomy with alloderm implants at the same time, no expanders. I also had an atypical lobular hyperplasia biopsy so that is what I decided. Sometimes I think wow what the f was I thinking.... I can't erase fate from my life. Should I remove every potential body part that is susceptible to cancer? Ovaries, uterus, cervix, colon I guess the body parts I don't need I'll have them removed--- my boobs I don't need, ovaries, uterus no need But the pancreas you need so I don't know---- it seems like the useless body organs are breeders for cancer. Of course the ovaries and uterus you need if you want children. I guess we all do what we can to be as healthy as we can but we don't know God's plan, we can only walk with faith, and when my sister passed she was happy I know she was going somewhere beautiful and natural as she told me. She wasn't afraid she was innocent going to her new home. I won't fight death when it is my time, as I know dying is like being born. It's a new normal without my sister and it must be a new normal for her. I feel her trying to tell me not to get twisted and mired in the events of life... She is trying to tell me how wonderful it is where she is and it's our true home and we will see each other soon and we will be together forever, she wants me to have faith in the fact that she will be there for me when it is my time to die, and she is ok we will have eternity together.",
      "MessageIndex": 22,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/771720",
      "Title": "High risk breast surgeon undergoes PBM... Soccermom4force alexandria58"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Mar 5, 2012 05:37PM thatsvanity wrote: I'm glad I can post in this thread and receive support and love from amazing women who have so much to give in their experiences that touch the heart and soul.",
      "MessageIndex": 56,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Mar 5, 2012 05:33PM thatsvanity wrote: Hi Chrissyb, You are so kind and thoughtful to start this thread. Love and hugs to. Amy Lynn",
      "MessageIndex": 55,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Dec 29, 2011 03:30PM - edited Dec 29, 2011 03:30PM by thatsvanity My aunt had BMX at age 60... No recon, I thought she looked amazing because she had great posture and self-confidence.",
      "MessageIndex": 49,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/779933",
      "Title": "Gender Identity? MT1 sespebadger"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Feb 11, 2012 03:44PM thatsvanity wrote: Wow five alive you are so cool thanks for sharing! Write more!",
      "MessageIndex": 89,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Feb 10, 2012 11:51PM thatsvanity wrote: A blow job is called a blow job because it's work! Sex is a hard one I wish I had one good tips but I don't my husband and I love each other but as we are married longer and longer it gets less and less luckily I'm not a super horny wife. The scream cream sounds good but so many factors go into good mutual sex emotions, energy levels, physical well being so. It's no wonder it gets out of balance so easily. Your post is so honest and real. Thank you, Amy Lynn",
      "MessageIndex": 63,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 5, 2012 05:19PM thatsvanity wrote: Zoh, I love your posts because they are always uniquely personable and kind. When I read your writings I can feel your personality shine through, even though I'm reading your posts on an iPad. You have amazing clarity, strength and grace. You are funny without unneeded sarcasm. I also love your avatar picture with your baby. I hope it's ok for me to post this as I don't know you as well as your friends on the threads, but that is how I feel, I have learned from your writings that it is powerful to help others when it is done with love, grace, humor, and warmth. You are an influential example of power, love, and hope. I wish my sister could've read your writings. Love Amy Lynn",
      "MessageIndex": 20,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780510",
      "Title": "Zoh we love you because..... K-Lo katie31"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 7, 2013 11:39PM thatsvanity wrote: I was reading some of Apple's posts and I thought this was really beautiful. Apple is in my thoughts and prayers. apple wrote: in Zoh's angel thread, a suggestion was made by Kathleen1966 that a book be written.. \"When I read that Zoh told her daughter that there was a gold thread that attached her always to her young child's heart, it touched me deeply. It made me think of how wonderful it would be to have a book made about this gold thread\"  \"Let's do it.  I think this is a wonderful idea.  We could have just a few made, or have it published.. the proceeds going to children of breast cancer victims.  a small glowing, loving book with a cover of gold and maybe a special golden heart inside on the first page.  We could send it to the children we know of, who were left motherless. If you'd care to, please write your suggestions and words of comfort and love.  Someone I know, will see this to fruition.  .. will put it all together and create a work of love... little glowing pictures... symbols of love, maybe even a little joke in honor of Zoh.  It could be a big or small project.  I just encourage us to start this. On the day you were born there was suddenly, a piece of gold was in my heart.  I felt it glow and it gave me warmth and love from you.  You grew, and laughed and got bigger,  glowing in the gold that was my love for you and you for me. Though I may not be with you anymore, know that  a thread of pure gold is tied between our hearts that will never be broken. The thread is only visible to me and to you but it will always be there.  With every tear, with every thought of me, that thread will grow stronger, uniting us in a love unequaled to any love on earth.  A love ........ Please do not interpret my own offered words as definitive or in any way an attempt to oversee this project.. just an idea.",
      "MessageIndex": 95,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 14, 2012 08:19PM thatsvanity wrote: Hi NYC, You may want to consult with a plastic breast surgeon who works with a good general surgeon. I know you will find the right doctor. Hugs and happy doctor hunting! Amy Lynn",
      "MessageIndex": 1,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/796338",
      "Title": "NYC Breast Surgeon Recommendation Please NYCMs Zer35"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 4, 2011 02:44PM thatsvanity wrote: I had a PBMX because of an ALH biopsy and my younger sister died of breast cancer 4 months before my mastectomy and reconstruction. There is no way a woman should wait and see what happens with an atypical biopsy, all imaging was useless in my dense breasts. I felt in my heart it was the best choice PBMX for my health.",
      "MessageIndex": 16,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 18, 2011 08:40AM thatsvanity wrote: I understand your confusion about your doctors confusion, sometimes it gets crazy what is one to do have a scan every week? It's like chasing a kite in the wind. We can only do the best we can. I think it's difficult or the docs to be honest sometimes because they have their own fears and demons they are wrestling with in regards to cancer and wanting to help people, just because they aren't the patient doesn't mean they don't suffer in their own way.",
      "MessageIndex": 25,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772868",
      "Title": "Wahh............Whuuuuuu shan1171 K-Lo"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 18, 2011 08:59AM thatsvanity wrote: My sister had mets to liver, spine, clavicle, and her pelvis. She was half in heaven and half on earth, she asked me twice, \"come with me, come with me.\" those were her last spoken words to me I know What she saw was amazing because if it wasn't she would not have asked me to come with her. I stayed by her side touching her arm and face every minute until the night came, I fell asleep holding her arm and when I woke up about 1:00 am her spirit had left her beautiful body, I hugged and squeezed her tight because I couldn't do that when she was alive she was in too much pain and couldn't walk from the mets in her bones. I squeezed her and held her so close she looked beautiful as always. I miss her so much I wish we had stopped all the stupid scans and treatments sooner so we could have gone o Hawaii or somewhere beautiful together, she was stronger and happier without all the treatment meds in her. I'm only sharing my experience please don't take it as a persuasive paragraph it just helps me to write I miss her I cry every day, maybe I need to change forums, I found a piece of paper she was scheduled for chemotherapy five days before she passed-- I said no we are not going and she was happy she thought the hospice nurse was going to give her chemotherapy she didn't want it. She died at home with love and everything in the world to feel comfy and like a princess you kara I'm shouting to you I love you please her me! I miss you!",
      "MessageIndex": 27,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772868",
      "Title": "Wahh............Whuuuuuu shan1171 K-Lo"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Feb 4, 2013 03:09AM thatsvanity wrote: My sister was treated at Scripps La Jolla and everyone from the top surgeons to the chemo room to the people working in the cafeteria were so kind. Cancer Centers of America's commercial just seemed a little predatory.",
      "MessageIndex": 21,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/799703",
      "Title": "Cancer Centers of America? sueopp edwards750"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Dec 30, 2011 04:12PM thatsvanity wrote: I'm glad you love your sister so much, peace and love to you both and your family, safe traveling. Hugs and love to you. Amy Lynn",
      "MessageIndex": 36,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/780030",
      "Title": "the next stage angelsister chrissyb"
    },
    {
      "AuthorID": "thatsvanity",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "thatsvanity wrote: Hi, I had a PBMX age 44 and I went into menopause a few months after my PBMX. Maybe I'm the right age for menopause but I was just wondering... Atypical lobular hyperplasia(11/11/10) PBMX NS mastectomy on 5/26/2011 Dx 11/11/2010, Stage 0, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/803562",
      "Title": "PBMX cause early menopause? thatsvanity MelissaDallas"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 4, 2011 02:49PM thatsvanity wrote: Definition How cancer develops Atypical hyperplasia is a precancerous condition that affects cells in the breast. Atypical hyperplasia describes an accumulation of abnormal cells in a breast duct (atypical ductal hyperplasia) or lobule (atypical lobular hyperplasia). Atypical hyperplasia isn't cancer, but it can be a forerunner to the development of breast cancer. Over the course of your lifetime, if the atypical hyperplasia cells keep dividing and become more abnormal, your condition may be reclassified as noninvasive breast cancer (carcinoma in situ) or breast cancer. If you've been diagnosed with atypical hyperplasia, you have an increased risk of developing breast cancer in the future. For this reason, doctors sometimes recommend more frequent breast cancer screening and careful consideration of medications and other strategies to reduce breast cancer risk. Symptoms Atypical hyperplasia doesn't cause any specific signs or symptoms. When to see a doctor Make an appointment with your doctor if you have any signs or symptoms that worry you. Atypical hyperplasia doesn't cause signs and symptoms, but it's usually discovered during a breast biopsy to investigate breast signs and symptoms caused by another condition or an abnormality found on a mammogram. Causes How cancer develops It's not clear what causes atypical hyperplasia. Atypical hyperplasia forms when breast cells become abnormal in number, size, shape, growth pattern and appearance. Location of the abnormal cells within the breast tissue — the lobules or the milk ducts — determines whether the cells are atypical lobular hyperplasia or atypical ductal hyperplasia. Atypical hyperplasia is thought to be part of the complex, multistep process by which breast cancer develops. The process begins when normal cell development and growth become disrupted, causing an overproduction of normal-looking cells (hyperplasia). Atypical hyperplasia occurs when the excess cells stack upon one another and begin to take on an abnormal appearance. The abnormal cells can continue to change in appearance and multiply, evolving into noninvasive (in situ) cancer, in which cancer cells remain confined to the area where they start growing. Left untreated, the cancer cells may eventually become invasive cancer, invading surrounding tissue, blood vessels or lymph channels. Complications Increased risk of breast cancer If you've been diagnosed with atypical hyperplasia, you have an increased risk of breast cancer in the future. Women with atypical hyperplasia have a risk of breast cancer that is about four times higher than that of women who don't have atypical hyperplasia. Being diagnosed with atypical hyperplasia at a younger age may increase the risk of breast cancer even more. Women diagnosed with atypical hyperplasia before age 45 have a greater risk of developing invasive breast cancer during their lifetimes, compared with older women, especially those older than 55. Preparing for your appointment If a mammogram reveals a suspicious area in your breast, your doctor may refer you to a breast health specialist or a specialized breast center. What you can do Because appointments can be brief, and because there's often a lot of ground to cover, it's a good idea to be well prepared. To prepare for your appointment, try to: Be aware of any pre-appointment restrictions. At the time you make the appointment, be sure to ask if there's anything you need to do in advance, such as restrict your diet. Write down any symptoms you're experiencing, including any that may seem unrelated to the reason for which you scheduled the appointment. Write down key personal information, including any major stresses or recent life changes. Make a list of all medications, vitamins or supplements that you're taking. Consider taking a family member or friend along. Sometimes it can be difficult to absorb all the information provided during an appointment. Someone who accompanies you may remember something that you missed or forgot. Questions to ask Your time with your doctor is limited, so prepare a list of questions ahead of time. List your questions from most important to least important in case time runs out. For atypical hyperplasia, some basic questions to ask your doctor include: Can you explain my pathology report to me? Do I need more tests? Will I need surgery for atypical hyperplasia? What treatments do you suggest? What can I do to reduce my risk of breast cancer? What signs or symptoms of breast cancer should I watch for? How often should I have a mammogram to screen for breast cancer? Should I also have an MRI to screen for breast cancer? What would you recommend to a friend or family member in my situation? Are there any restrictions that I need to follow? Should I see a breast health specialist? What will that cost, and will my insurance cover it? Should I consider genetic counseling? Are there any brochures or other printed material that I can take with me? What websites do you recommend? In addition to the questions that you've prepared, don't hesitate to ask other questions that come to mind during your appointment. What to expect from your doctor Your doctor is likely to ask you a number of questions. Being ready to answer them may allow more time later to cover other points you want to address. Your doctor may ask: Do you have a family history of breast cancer? Do you have a family history of other types of cancer? Have you had a breast biopsy before? Do you know the results of previous breast biopsies? Tests and diagnosis Atypical hyperplasia is usually discovered after a biopsy to evaluate a suspicious area found on a mammogram or during a clinical breast exam. During the biopsy, tissue samples are removed and sent for analysis by a specially trained doctor (pathologist). The tissue samples are examined under a microscope, and the pathologist identifies atypical hyperplasia, if it's present. To further evaluate atypical hyperplasia, your doctor may recommend surgery to remove a larger sample of tissue to look for breast cancer. A diagnosis of atypical hyperplasia may lead to a surgical biopsy (wide local excision or lumpectomy) to remove all of the affected tissue. The pathologist looks at the larger specimen for evidence of in situ or invasive cancer. Treatments and drugs Atypical hyperplasia is generally treated with surgery to remove the abnormal cells and to make sure no in situ or invasive cancer also is present in the area. Doctors often recommend more frequent screening for breast cancer and strategies to reduce your breast cancer risk. Follow-up tests to monitor for breast cancer Your doctor may recommend you undergo follow-up tests to screen for breast cancer. This may increase the chance that breast cancer is detected early, when a cure is more likely. Talk about your breast cancer screening options with your doctor. Your options may include: Self-exams of your breasts to develop breast familiarity and to detect any unusual breast changes Clinical breast exams by your health care provider once or twice a year Screening mammograms every year Screening breast magnetic resonance imaging (MRI), depending on other risk factors, such as a strong family history or a genetic predisposition to breast cancer Ways to reduce your risk of breast cancer To reduce your risk of developing breast cancer, your doctor may recommend that you: Take preventive medications. Treatment with a selective estrogen receptor modulator (SERM), such as tamoxifen or raloxifene (Evista), for five years may reduce the risk of breast cancer. These drugs work by blocking estrogen from binding to estrogen receptors in breast tissue. Estrogen is thought to fuel the growth of some breast cancers. Another option for certain women may be exemestane (Aromasin), which decreases production of estrogen in the body. Avoid menopausal hormone therapy. Researchers have concluded that combination hormone therapy to treat symptoms of menopause — estrogen plus progestin — increases breast cancer risk in postmenopausal women. Many breast cancers depend on hormones for growth. Participate in a clinical trial. Clinical trials test new treatments not yet available to the public at large that may prove helpful in reducing breast cancer risk associated with atypical hyperplasia. Ask your doctor if you're a candidate for any clinical trials. Consider risk-reducing (prophylactic) mastectomy. For women at very high risk of breast cancer, risk-reducing mastectomy — surgery to remove one or both breasts — reduces the risk of developing breast cancer in the future. You might be considered at very high risk of breast cancer if you have a genetic mutation in one of the breast cancer genes or you have a very strong family history of breast cancer that suggests a likelihood of having such a genetic mutation. But this surgery isn't right for everyone. Discuss with your doctor the risks, benefits and limitations of this risk-reducing surgery in light of your personal circumstances. If you have a strong family history of breast cancer, you might benefit from also meeting with a genetic counselor to evaluate your risk of carrying a genetic mutation and the role of genetic testing in your situation. Coping and support An atypical hyperplasia diagnosis can be stressful, since it increases your risk of breast cancer. Not knowing what the future holds may make you fearful for your health. With time, every woman develops her own way of coping with atypical hyperplasia and her increased risk of breast cancer. Until you find your way of coping, consider trying to: Understand your individual risk of breast cancer. Breast cancer risk statistics can be overwhelming and frightening. Breast cancer risk statistics are developed by following thousands of women and can give you an idea of your prognosis, but the statistics can't tell you about your own risk of breast cancer. Ask your doctor to explain your individual risk of breast cancer. Once you understand your personal risk of breast cancer, you can feel more comfortable making decisions about your treatment. Go to all of your follow-up appointments. If you've been diagnosed with atypical hyperplasia, your doctor may recommend more frequent breast cancer screening exams and tests. You may find yourself distracted with worry before each exam because you're afraid that your doctor will find breast cancer. Don't let your fear stop you from going to your appointments. Instead, accept that fear is normal and find ways to cope. Relax, write your feelings in a journal or spend time with a close friend who can lift your spirits. Maintain your health. Make healthy lifestyle choices to keep yourself healthy. For instance, maintain a healthy weight, eat a healthy diet full of fruits and vegetables, get enough sleep so that you wake feeling rested, and limit the amount of alcohol you drink, if you choose to drink alcohol. You can't control whether or not you get breast cancer, but you can keep healthy so that you're well enough for breast cancer treatment, should you need it. Talk with other women in your situation. Talk to other women who have been diagnosed with atypical hyperplasia. Ask your doctor about support groups in your community. Another option is online message boards. Breast cancer organizations, such as BreastCancer.org, offer message boards for women with a high risk of breast cancer to connect with each other. References DS01018 Oct. 1, 2011 © 1998-2011 Mayo Foundation for Medical Education and Research (MFMER). All rights reserved. A single copy of these materials may be reprinted for noncommercial personal use only. \"Mayo,\" \"Mayo Clinic,\" \"MayoClinic.com,\" \"EmbodyHealth,\" \"Enhance your life,\" and the triple-shield Mayo Clinic logo are trademarks of Mayo Foundation for Medical Education and Research.",
      "MessageIndex": 17,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 4, 2011 06:29PM - edited Nov 9, 2011 12:58PM by thatsvanity Of course your welcome--chicken pants. Mayoclinic.com is amazing wealth of easy to find information on just about anything.",
      "MessageIndex": 19,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 11, 2012 08:13PM thatsvanity wrote: Hi, Hmmmm, that is a hard decision, do you want to wait for PBMX because you want to breast feed your babies? What does your gut tell you to do. I'm sorry you lost your mom before you we're so little. My PBMX didn't mess with my periods, but maybe if you have PBMX you will be more relaxed about lowering your risk for cancer and then you can enjoy being pregnant and having a family.... Best wishes, Amy Lynn",
      "MessageIndex": 23,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/780683",
      "Title": "ALH farmerlucy Diane5"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 27, 2012 11:05AM thatsvanity wrote: I would ask for extra!",
      "MessageIndex": 11,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792613",
      "Title": "Valium for biopsy? juliejk thatsvanity"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "May 16, 2012 11:12PM thatsvanity wrote: Hi I was diagnosed with ALH and I had an elective mastectomy but I should be eating better and losing weight and exercising. I'm sure I would feel more energetic and not so tired. I was doing more healthy stuff before my diagnosis, I think it was just my age and genetics, but all the good stuff foe our bodies keeps us healthy! Keep us posted! Amy Lynn",
      "MessageIndex": 14,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/787105",
      "Title": "ADH/ALH Are you doing anything different after diagnosis? JayeGA ED2012"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Feb 11, 2012 03:41PM thatsvanity wrote: I touch my I pad more than my husband oh well...",
      "MessageIndex": 88,
      "PostDate": "11/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782345",
      "Title": "SEX - Very Raw Post cancerkicker Moderators"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 11, 2013 06:10PM thatsvanity wrote: Oh dear Apple you are loved and admired by so many, love to you and your dear family and thank you for being a bright light.",
      "MessageIndex": 200,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798177",
      "Title": "Has anyone heard from Apple? marie5890"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 15, 2011 07:07AM thatsvanity wrote: Call hospice ASAP! They are wonderful. She can continue treatment if she wants hospice also provides palliative care. They will deliver anything you need to your front door free no charge and your mom can still have more oncology treatments, but you need support of hospice/pallative care for yourself too. Love Amy",
      "MessageIndex": 19,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772863",
      "Title": "Daughter desparate for advice from other caregivers amy9528 thatsvanity"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 15, 2011 07:14AM thatsvanity wrote: You need a social workers advice for your mother and brother. I would start with hospice and your mom oncologist. Good luck god has a plan for us he will never give us more than we can handle, but we can look for help!",
      "MessageIndex": 20,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772863",
      "Title": "Daughter desparate for advice from other caregivers amy9528 thatsvanity"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Aug 18, 2011 02:30PM thatsvanity wrote: You are not too young and your breasts may be too dense too show accurate results, ask for a needle biopsy.",
      "MessageIndex": 15,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/773313",
      "Title": "Am I too young for breadt cancer? waybacktexas marie5890"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Nov 29, 2011 05:38PM thatsvanity wrote:",
      "MessageIndex": 41,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777376",
      "Title": "I miss my breasts! topless karen1956"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jul 30, 2013 05:32AM thatsvanity wrote: Hi, This is a really good article from The New York Times about what binds families togther over years and keeps families connected, www.nytimes.com/2013/03/17/fas... I found it to be so true and real. \"The Family Stories That Bind Us\"",
      "MessageIndex": 12,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/808524",
      "Title": "Memory box - what to put in it? Latte DivineMrsM"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Jan 4, 2012 04:12PM thatsvanity wrote: Hi in my experience: 1. I was in the operating room about six hours. 2. Kaiser did not cover the type of reconstruction I had, but they did cover a mastectomy and other types of reconstruction. 3. I have scars that do not show with a tank top. 4. The tissue removed in my mastectomy was sent to a lab for cancer screening. I hope that helps, but like the mods said there is a lot of information on breastcancer.org, and mayoclinic.com. I hope that helps, Amy Lynn",
      "MessageIndex": 4,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/780463",
      "Title": "Q's about prophylactic breast surgery beepbeep klynnz"
    },
    {
      "AuthorID": "thatsvanity…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132731/profile",
      "Content": "Apr 8, 2012 04:57AM thatsvanity wrote: Dear Michelle, A sister is like treasure in the bank that will be there forever. I lost my sister feb 14, 2011 to stage IV bc she was 41 and the loss is unbearable. I can feel how much you love your sister, and how much you miss her. I'm so so sorry. Love Amy Lynn",
      "MessageIndex": 26,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    }
  ]
}