{
  "AuthorID": "TheBluebell…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61141/profile",
  "Posts": [
    {
      "AuthorID": "TheBluebell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61141/profile",
      "Content": "Jan 1, 2008 03:40AM TheBluebelly wrote: Thank you all so much for the info and support. It being New Year's Eve, the doc's secretary (of the one who will do either a needle aspiration or an ultrasound) wasn't in, and won't be in until Wednesday morning. The first referral: the doc didn't take my type of insurance. It's Blue Cross/ Blue Shield! Who doesn't take that?! So the one who I'll be making the appt. with is actually the second referral. Already it's enough to make me want to throw my hand up in the air and say \"Forget it, all this for something that's probably a stupid cyst.\" Getting anything done is like pulling teeth. I can't imagine how hard it is for women without insurance. What are they supposed to do, die? ",
      "MessageIndex": 6,
      "PostDate": "01/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/697672",
      "Title": "moveable lump TheBluebelly TheBluebelly"
    },
    {
      "AuthorID": "TheBluebell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61141/profile",
      "Content": "Dec 31, 2007 08:48PM TheBluebelly wrote: Oh, I had oriiginally planned to ask the doctor to refer me for a mammogram (every hospital I asked said they wouldn't do one without a referral). He said aspiration and ultrasound. Would a mammogram have done any good?",
      "MessageIndex": 1,
      "PostDate": "31/12/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/697672",
      "Title": "moveable lump TheBluebelly TheBluebelly"
    },
    {
      "AuthorID": "TheBluebell…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61141/profile",
      "Content": "Jan 7, 2008 11:59PM TheBluebelly wrote: Oh my God. If the doctor had been \"playing\" with my biopsy in a jar, tossing it then catching it in his hands, I would have liked to slap it out of his hands until it crashed to the floor, and said \"Are you insane?!\" Then gotten another biopsy. This, of course, is fantasy. You never can predict how you will react to such real-life situations. Very smart of you to call the embassy.",
      "MessageIndex": 11,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/698086",
      "Title": "update on my biopsy HeatherBLocklear Jenn51"
    }
  ]
}