{
  "AuthorID": "thebteam",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105321/profile",
  "Posts": [
    {
      "AuthorID": "thebteam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105321/profile",
      "Content": "Aug 6, 2010 04:01AM thebteam wrote: Thanks for the replys, Medigal your right i am hopeing the oncologist this coming monday can tell us some more on the mater. my mum is having no contact with the birds and i am going to install some  type of air cleaner in the rooms that she is in the most. she has got an infection under her arm now and i just hope we can keep the germs away from her. shes very sweet and she loves her farm and family and we lover her, and Calamtykel i love the chick slid my mum will like, that i may have to get them a slid, we have over 1000 hens i guess at least some of them will have a go lol.",
      "MessageIndex": 7,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755737",
      "Title": "Will running a chicken farm be a problem thebteam thebteam"
    },
    {
      "AuthorID": "thebteam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105321/profile",
      "Content": "thebteam wrote: Hi, firstly i would like to say thank you for the site what a world of help in a world that seems to have no help. i am posting this for my dear mum beryl that has IDC ER+ PR+  and after fighting and winning 15 years ago it has come back and we need help to get my mum as strong as she can be to fight this one this time round. i am trying real hard to get her to eat well and to loose some extra weight,but my worries are of were my mum lives. my mum beryl lives on a smallholding with about 900 hens and two dogs, the chicken shed is very close to the house and her bedroom. i am worried that air born germs will bring new problems when my mum starts her chemo. please can any one tell us if she will be safe with the birds or would it be best to move all birds from site untill treatment has stoped, this can be done if it will help. thanks and sorry for the post im a little nerves mums getting more results today.. bless her cotton socks love you mum.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755737",
      "Title": "Will running a chicken farm be a problem thebteam thebteam"
    },
    {
      "AuthorID": "thebteam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105321/profile",
      "Content": "Aug 2, 2010 09:46PM thebteam wrote: thank you so much for the replies it really does mean a lot to us, and thanks i will try a infectious disease DR never thought of that, your right its a hard one..  thanks and god bless every one ps, please if any one knows more on this subject please do let us know thanks..",
      "MessageIndex": 4,
      "PostDate": "02/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755737",
      "Title": "Will running a chicken farm be a problem thebteam thebteam"
    },
    {
      "AuthorID": "thebteam",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/105321/profile",
      "Content": "Aug 1, 2010 09:19PM thebteam wrote: take it there is no chicken farmers here,  but i did think that there would be some one to inform us a little, we are worryed sick and cant seem to find any help on the mater please please give us a helping hand   thanks",
      "MessageIndex": 1,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755737",
      "Title": "Will running a chicken farm be a problem thebteam thebteam"
    }
  ]
}