{
  "AuthorID": "Thegirlinorange",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138042/profile",
  "Posts": [{
    "AuthorID": "Thegirlinorange",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/138042/profile",
    "Content": "Thegirlinorange wrote: Hi,  Long story short, I'm in a serious long distance relationship, so how do I find the appropriate time/place to tell my boyfriend I might have BRCA1?   First of all I apologise for leaping in here with my problems like a complete newbie, but although I am far too inexperienced to be any real help to most people here, I kind of needed to talk to someone who knew a bit about this sort of thing; about my worries/problems. My name is Katie, I am 20 years old. When I was 15 my mother died of breast cancer, she had it recurrently ever since I was about 5/6, with periods of remission. When I was about 16, my father got a letter through regarding a test my mother had taken, the BRCA1/2 genetic test. It turned up positive. Being 16, I couldn't really deal with this and the implications for me - it was hard enough coping with my mother's death. In fact, I often feel like I still can't deal with it and tend to bury my head in the sand. But also, I know the sensible thing to do, I know what my mother would have me do. And despite trying to convince myself otherwise, people do get cancer at my age - a friend of a friend should have been starting her second year at university this year, but she has been diagnosed with ovarian cancer instead. I feel the time has come to take the test. What with going to university and changing doctor's, it's been awkward trying to figure out the best time, but I've pretty much decided that when I get home next summer, I need to get onto it. Properly.  The trouble is, I've met someone this summer. And I can really see this being something that lasts. I'm in another country at the moment but we still care deeply about each other. But, before I get 'too far in' I feel that it is my duty to tell him I could have this gene, if he's thinking of a future together. Originally, I had thought to tell him at Christmas, however I'm only home for two weeks and it will be a really crap way to ruin it for him. So I thought, maybe I should tell him when he comes to visit next week. But I don't want to ruin our short week together either! But it's more than that, the more I think about it the more I know how upset he'll be by this and I don't want him to be worrying for months on end until next summer. I can put it to the back of my mind, I grew up being around the subject of cancer, but he has not. I don't know what to do, I don't want to be selfish, nor do I want to hurt him!   I realise this has been a long post, so I appreciate anyone who has read the whole of it. Thanks Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "18/10/2011",
    "ThreadURL": "https://community.breastcancer.org/forum/47/topics/776682",
    "Title": "How to tell my boyfriend I might have BRCA1? Thegirlinorange purelove5"
  }]
}