{
  "AuthorID": "TheLadyGrey…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135948/profile",
  "Posts": [
    {
      "AuthorID": "TheLadyGrey…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135948/profile",
      "Content": "Mar 9, 2019 05:38PM TheLadyGrey wrote: Thanks everyone. I’m leaning toward the flap surgery — it feels like the best way to prepare for the worst outcome, and I’m getting used to that idea. I feel ashamed at my hubris 7 years ago. I was 100% confident this would not happen to me. My world class oncologist — an advisor to this site — “guaranteed” this would not happen. I encourage anyone who is struggling with this decision to take them both off/. They want to kill you.",
      "MessageIndex": 6,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870254",
      "Title": "Contralateral BC —really? TheLadyGrey wallan"
    },
    {
      "AuthorID": "TheLadyGrey",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135948/profile",
      "Content": "TheLadyGrey wrote: Well I’m back. Should have taken them both off seven years ago. Needle biopsy diagnosis of DCIS but that’s what they told me last time so I’ll wait until the final pathology report before I break out the champagne. Anyone have any experience with this? I can’t believe this has happened again — no family history and BRCA negative. some enterprising oncologist should study me. I’m for sure having a mastectomy. I’m wondering about reconstruction as I have no idea if I’ll need radiation. How can you know? The flap reconstruction sounds hideously painful but I don’t want to go the implant route and have a bunch of complications. I’m very much a “get it over with” kind of chick. I’m really at a loss. Help Surgery 10/9/2011 Mastectomy: Left; Reconstruction (left) Dx 11/1/2011, IDC, <1cm, Stage IB, Grade 3, 0/1 nodes, ER-/PR-, HER2+ Targeted Therapy 11/11/2011 Herceptin (trastuzumab) Chemotherapy 11/18/2011 Carboplatin (Paraplatin), Taxotere (docetaxel) Hormonal Therapy 2/29/2012 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/870254",
      "Title": "Contralateral BC —really? TheLadyGrey wallan"
    }
  ]
}