{
  "AuthorID": "TheresaM",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
  "Posts": [
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 26, 2008 08:18PM TheresaM wrote: Oh man! I am brand new here and wish I had found you guys earlier and had been able to take this journey with you. I have 4 more boosters to go. It's been a rough, somewhat lonely road. But I cannot wait to be able to say \"Yes! I did it!\" I'm fair skinned so burning/blistering has been quite bad and very painful. I just know if I'd found you guys earlier though things would have been easier. Some of you are quite witty. I love it! God Bless!    ",
      "MessageIndex": 455,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 27, 2008 04:35AM - edited Feb 28, 2008 01:47AM by TheresaM Garden Girl-- here's what I posted on another link re: \"foggy brain\": Connie, same thing, all my family lives away... well, the closest is my mom, who is an hour away give or take. But it's more than distance. My family is very small. Two sisters, one in W Virginia, and they are all so busy. And cannot be inconvenienced with any WHINING I might want to do. They both have their own problems. So for the most part it's me and my son, he's 15... well, what 15 year old boy wants a mom with cancer. He really is SO good most of the time, but he's 15! and his talking back and attitude! good grief. Where did my sweet boy go? It seems right when he's going thru \"a change of life\" I am going thru my thing... I cannot even take my dog out to go pottie without fearing I am going to topple down the stairs.  I actually have more community support (little league/high school football moms I have known for years but not really \"friends\" before bc happened. Now, I thank God for them daily)  But God love us... I am determined to get thru this. PS When I told my youngest sister I had bc she said \"you always were the show off in the family\" and my other sister said \"having bc now a'days is like being told you have diabetes\"... I was diagnosed 9/26 at about 2:00 and by sundown, these were my supporting comments.",
      "MessageIndex": 461,
      "PostDate": "27/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 28, 2008 06:14AM TheresaM wrote: I want to take a minute to thank everyone of you for your warm welcomes... I am so glad to have found you. I know my journey would have been smoother if I found you sooner. You are all remarkabley STRONG women... and so full of the sense of humor I run my life by...but when the ugly shows? we must deal with it too.     ",
      "MessageIndex": 466,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 28, 2008 02:06AM - edited Feb 28, 2008 02:17AM by TheresaM You have described my son to a T GardenGirl! Have you met him? Well, you've reassured me anyway. He is so good about letting me relax and nap or read in the bubble bath... but if I ask him to take out the trash/vacuum/empty the dish washer? OH BOY! now we've got WW3 happening. I did explain to him the \"foggy brain\" weird feeling I sometimes get on the stairs so he is good about taking the dog out. Hey, I just thought of something... I have to go down the stairs to take out the trash. hmmm, how did I miss that opportunity to get him to understand. Oh! I know! It's the \"foggy brain\" keeping me from reminding him about the \"foggy brain\"... I'll tell him tonight. Like you, I do have a best friend who is always there for me. Day or night. How many times have I kept her talking on the phone past her bedtime? too many to count.    I don't think I'll ever completely get over my families reaction though. But I'm getting through it on my own and now with you guys! :) I've only got 2 more boosters to go. Fridays my last day. Believe it or not though, I think I am really going to miss my rad techs. As much of a pain in the neck as it's been getting to the hospital every day (and finding PARKING! ugh!) They are such a great team, I will miss their kindness everyday. They nick named me \"little miss sunshine\" and comment how I always come bee-bopping in like everything is wonderful. They told me today though, they're on to my act. They can tell I'm worn out and beat up. I guess it shows outwardly at this point. When they said that I teared up, it hit me that I was going to miss them terribly. I'm going to start crying right now! geeeesh.",
      "MessageIndex": 464,
      "PostDate": "28/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 29, 2008 04:14PM TheresaM wrote: I went to See's Candy and had them make me up a \"Thank You\" gift basket. They did a beautiful job. It was a combination of candies and nuts. They added gold thank you stickers to each of the suckers they tossed is as filler. Today is my last tx but I took it to them yesterday so they would have a couple of days to enjoy it before the weekend. They really liked it. Good thing I took it early as one of my fav techs let me know he would not be there today. He gave me a big congratulatory hug. They are so awesome. I am going to miss them terribly. I am taking them a note today, but I'll give it to them right before I leave. Otherwise, I know I will cry like a baby! ",
      "MessageIndex": 481,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    },
    {
      "AuthorID": "TheresaM",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63499/profile",
      "Content": "Feb 29, 2008 01:50AM - edited Feb 29, 2008 01:55AM by TheresaM Thank you Miss Lolli... no, I did not curse at them. Not out loud anyway. I too am undecided re: genetic testing. Originally, I asked for the test and my insurance approved it. But then I sort of chickened out. Well, not sort of. I DID chicken out. Now, I cannot make up my mind. Joni, I have been worn out only since last week. Which was week 6 for me. This week (during my boosters) I am really really tired. I can barely stay awake 1/2 the time. Tomorrow is my last day! And I am sure you got \"enough\"... silly girl.   ",
      "MessageIndex": 473,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/697061",
      "Title": "Anyone starting Rads in January? Barbie7 Miss_Lolli"
    }
  ]
}