{
  "AuthorID": "theredheadamy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77109/profile",
  "Posts": [{
    "AuthorID": "theredheadamy",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/77109/profile",
    "Content": "theredheadamy wrote: Hello ladies, On Dec. 19th I was diagnosed with poorly-differentiated infiltrating ductal carcinoma, approx 2.7cm at it's largest (ultrasound measurement) in my right breast.  The day of the diagnosis, the surgeon told me surgery, chemo and radiation were in my future (Merry Christmas and Happy New Year to me!) Since that first appointment, and in between holidays in which offices were closed 5 days at a stretch, I have had an MRI, which also showed an area of suspicion in the left breast.  Had a second ultrasound yesterday to determine if this lesion could be biopsied with ultrasound guidance, or if we needed MRI guidance for the biopsy.  Thank goodness for little things--it can be biopsied with US (really did not want the MRI guided biopsy!) and we scheduled the biopsy for next Wednesday (arrrgh--another week before we can THINK about making a plan!!).  The radiologist says the \"new\" lesion is very typical for a fibroadenoma, which I have had before, BUT... I have found out that I am ER-/PR- and HER-2 equivocal (more testing by FISH in the works). I know that's not the \"best\" combo (really, what is???) as it limits treatment options.  Oh, and BTW I'm 39, without a family medical history (I'm adopted), so I did opt for the genetic testing for the BRAC mutation---those results, I think, may have the biggest influence on my treatment. So, sorry for the rant....I actually wasn't considering posting until I had specific questions, but I feel so in limbo, and SO want to know what really is coming next for me.  I will feel so much better when I know what to expect.  Anyone out there in a similar position as me? Trying hard not to obsess and/or lose my mind----telling myself that the more information I have the better off I will be, BUT WAITING SUCKS!!!! Thanks for being here---the forum has been so helpful so far. Amy Bilateral mastectomy, Right side ALND, Left side SNB, prophylactic supracervical hysterectomy 2/4/09; BRAC1+ Dx 12/19/2008, IDC, 2cm, Stage IIB, Grade 3, 1/6 nodes, ER-/PR-, HER2- Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "01/01/2009",
    "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726618",
    "Title": "Just diagnosed w/aggressive IDC theredheadamy kim40"
  }]
}