{
  "AuthorID": "Thinker13",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
  "Posts": [
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Jul 31, 2012 05:03PM Thinker13 wrote: Great news!!!! Hopefully your skin problem can be DX and treated before long.  Keep us posted :)",
      "MessageIndex": 56,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Jul 30, 2012 06:46PM Thinker13 wrote: autism_mom, I'm hoping you will hear good news tomorrow!",
      "MessageIndex": 47,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Aug 7, 2012 08:03PM Thinker13 wrote: Good luck with all of your future testing and glad that all of your results are B9!!!",
      "MessageIndex": 65,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/790196",
      "Title": "Got a problem...how long can I wait? autism_mom Paintingmywaythru"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Aug 2, 2012 08:16PM Thinker13 wrote: I have an appt with the surgeon on Aug 7th and I will find out when and what he wants to do. That was what the radiologist suggested in her report. I will let you know as soon as I find out. Keep me posted on your situation as well. :-)",
      "MessageIndex": 10,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Aug 7, 2012 07:49PM Thinker13 wrote: Mini Update:  My appointment with the breast surgeon (general surgeon) was today and he scheduled me for a ductogram because of the dilated duct that I have in my breast.  I will have it done tomorrow morning at 11:00 AM.  The Dr. said that he is not concerned with the cysts as much because they are probably normal, but that I should go back in 6 months for the follow up ultrasound as suggested.  So what should I expect on the ductogram tomorrow?  Do they usually give the results the same day?  Do they numb the breast before putting in the dye?",
      "MessageIndex": 11,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Thinker13 wrote: I have another post titled Dark Nipple Discharge...cause for concern? It explains my back story more in depth. I started to have spontaneous nipple discharge in mid-May (first rusty red/brown and now it is more of a brown/green).  I had a prolactin level test and a smear test of the discharge.  Prolactin level came back fine and smear test showed no infection. I went to the Doctor today for my scheduled mamm and U/S.  When I got there they informed me that I would only have an Ultrasound because of my age (31). Also, it wasn't a bi-lateral just the right breast. Anyhow, the radiologist Dr. told me that the ultrasound showed a dilated duct and 2 clustered cysts one measuring 4-5 (cm or mm I can't remember). She noted that she could not see any lesions in the duct, but feels that is where my discharge is coming from. She referred me on to a breast surgeon for further testing (glactogram). I will see him next week on Aug 7th. She also said that I would need to be seen in 6 months to watch the clustered cyst area to make sure they haven't changed. She was reviewing the ultrasound images with the U/S tech in the room and asked her \"I think this is a clustered cyst, wouldn't you agree?\" and the tech said \"yes\". That really didn't make me feel comfortable considering the Dr. is asking the tech. My question is has anyone ever had a dilated duct and if so what is the reason?  Also, can cancer be mistaken for a clustered cyst? The spots that I saw were not round and marble looking like the cysts that I have seen on Dr. Google :) I am trying not to worry when I don't need to, but this place did not seem to have their stuff together today and my age was brought up several times in the short time that I was there. What does everyone else think? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Jul 31, 2012 11:05PM Thinker13 wrote: Thanks autism_mom, glad to hear your good news today! dawny, no offense taken at all. I went and picked up my films and official report today from the diagnostic center it said the areas in the right breast are probably benign, with a Bi-Rads 3. The reports suggest a galactogram with the breast surgeon should be considered for further characterization for the dilated duct (with internal debris??) and a 6 month follow up ultrasound for the 2 clusters of cysts that were found at the 1:30 and 7:30 region. The diagnostic center has already scheduled my appointment with a breast surgeon on Tuesday, August 7th so I guess I am back in the waiting game for a while. Have any of you ladies had a similiar experience? click here to see my ultrasound pictures that I uploaded to Flickr and feel free to give me your expert opinions .  I know this is totally against teh HIPA act, but who cares???",
      "MessageIndex": 3,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Aug 1, 2012 12:10AM Thinker13 wrote: Yes there were two \"cluster of cysts\" and I am unclear on how many dilated milk ducts there are.  I am really fascinated about images as well.  I have always wanted to be an us tech.  I found a really cool site the other day that shows your images of the breast and masses and lets you pick (multiple choice) what you would do next.  It was very educational.  I am trying to educate myself on breast health...turns out I was totally clueless LOL!",
      "MessageIndex": 7,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Jul 31, 2012 11:38PM Thinker13 wrote: My report states that noted a \"dilated ducts with internal debris\".  I think that is why she recommended that the surgeon perform a galactogram. The report also indicated 1 cm range. There are what they called a cluster of cysts at the 1:30 and 7:30 position.  Google leads me to believe that they are :)",
      "MessageIndex": 5,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    },
    {
      "AuthorID": "Thinker13",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156121/profile",
      "Content": "Aug 7, 2012 11:00PM Thinker13 wrote: Oregongal, thank you for your reassurance on the ductogram.  I hope my procedure is as easy as yours was and that you are cancer free! Is papilomas the only B9 thing that would cause a dilated duct?  What type of cancer (if any) cause this?",
      "MessageIndex": 13,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791342",
      "Title": "Clustered Cysts and Dilated Duct...TRANSLATION please! Thinker13 mustlovepoodles"
    }
  ]
}