{
  "AuthorID": "Thisisbleak…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281251/profile",
  "Posts": [
    {
      "AuthorID": "Thisisbleak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281251/profile",
      "Content": "Nov 27, 2018 11:59AM Thisisbleak wrote: Hi Heather! I have a lumpectomy on Thursday, after finding a palpable mass (turned out to be two 1.8 cm tumors) that came back inconclusive on the biopsy. I saw that you went through almost the same thing, and wanted to ask if you mind sharing some more about what your \"trouble area\" presented as in imaging and biopsy. As for genetic testing- I would definitely suggest doing the full panel of tests. It gives you such a great insight in to your body and what things you may need to watch out for or be aware of, and if everything comes back negative you get some excellent happy news!",
      "MessageIndex": 5,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868533",
      "Title": "DCIS diagnosis almost 2 weeks ago Heather2018 alto"
    },
    {
      "AuthorID": "Thisisbleak…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/281251/profile",
      "Content": "Nov 27, 2018 02:59PM Thisisbleak wrote: gtgirl, mammograms after biopsy may be the routine, but I did not have one after my biopsy. It may not have been mentioned because it's not done by your radiologist. For what it's worth, my biopsy was a quick and easy procedure. Zero pain (other than the sting from the lidocaine to numb things up), and just a few dull aches over the next couple of days. My anxiety is not over the procedures though, just the outcome, exacerbated by all the waiting! Sending good vibes and blessings for y'alls biopsies and the results!",
      "MessageIndex": 17,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868421",
      "Title": "Questions about my report. Mamabear67 Mamabear67"
    }
  ]
}