{
  "AuthorID": "thradia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
  "Posts": [
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "May 24, 2012 11:06AM thradia wrote: Well finally got the call and I meet with the surgeon Tuesday next week!  That's pretty good for up here! lol  I expected to wait at least a couple weeks.. I guess my doctor putting it through as an \"Urgent Referral\" made the difference!  Now to wait for that :/ ",
      "MessageIndex": 18,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787728",
      "Title": "Core Needle Biopsy - What's it like? thradia Layla2525"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "May 19, 2012 01:06AM thradia wrote: Thanks ladies ! Doesn't sound too bad. :) You've relieved some of my anxiety about it!! I can't thank you enough",
      "MessageIndex": 3,
      "PostDate": "19/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787728",
      "Title": "Core Needle Biopsy - What's it like? thradia Layla2525"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "May 20, 2012 08:08PM thradia wrote: I apprieciate hearing the bad as well.  I realize that it could go either way.. hopefully I am a lucky one with little pain! The worst part about all this is that its a long weekend, so I won't hear anything about an appt until Tuesday at the earliest.  I hate the waiting! ",
      "MessageIndex": 12,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787728",
      "Title": "Core Needle Biopsy - What's it like? thradia Layla2525"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "thradia wrote: Well, my ultrasound results came back today.  They ruled out a cyst, but there is a mass that is unknown.  My doctor sent an urgent referral to the surgeon and said that he will probably do a core needle biopsy.  I should hear from them next week on when to come in.  So I've read online about the procedure.. but what are people's experiences with this procedure?  It sounds... ugh..not very cool! lol  I've had a punch biopsy before and I found it to be fine.    Just looking for some first hand stories about yours.   Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787728",
      "Title": "Core Needle Biopsy - What's it like? thradia Layla2525"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "thradia wrote: Hi ladies.. I was posting here last year and here I am back again.  After I was told that my lump was nothing to worry about, I tried to put all of it out of mind.  The surgeon told me to get it checked again after 6 months if I was still have problems.  Well the problems never really stopped and it took a turn for the worse in the last couple of weeks.  I am calling Monday to schedule an appointment.  When it first started last year, I was having shooting pains near the nipple and near the lymph nodes in my armpit, all on the left side. They found a lump, but felt it was nothing to be worried about. (I didn't have a biopsy or anything, just an ultrasound) I stll get the shooting pain from time to time, however my lymph nodes have swollen up and it is very tender to touch.  I can't even wear a normal bra because of the pain, I have been wearing a sports bra.  Other areas of my breast are tender as well, including the spot they found the lump.  I'm not sure how I feel about it yet.  I'm worried.. maybe it's lymphnoma, breast cancer.. maybe it's just an infection.  I am just at the point where I just want an answer, no matter what it is.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798469",
      "Title": "Back here again! thradia Linda-Ranching-in-the-mTns"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "thradia wrote: Im pretty much a lurker here.... I've been waiting a long time for this ultrasound and a little nervous . Hopefully nothin to be worried about but still nervous!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787178",
      "Title": "US tomorrow thradia thradia"
    },
    {
      "AuthorID": "thradia",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145916/profile",
      "Content": "May 9, 2012 04:15PM thradia wrote: Thanks! Just got back a while ago... they found \"something\".  She was concerned and asked me to wait while she consulted with the radiologist.  They were dicussing doing a biopsy right there, but in the end the radiologist decided that he would like to study the images better.   So, in about a week I'll find out what they found and what they want to do I guess.  The waiting kills me.  And i'll be honest, that was my big fear that they would find something odd enough that it alarmed someone.  I would have felt better with an.. \"ok your done go home\" LOL So now we wait!  She seemed to take the most pictures in two areas.. a part of the side of the breast and the nipple.  So I just don't know... ",
      "MessageIndex": 3,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787178",
      "Title": "US tomorrow thradia thradia"
    }
  ]
}