{
  "AuthorID": "ThreeC",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
  "Posts": [
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Apr 28, 2017 08:33PM ThreeC wrote: My initial dx was an \"atypical papilloma\". I woke up from a lumpectomy with a 3.8cm specimen with no clear margins and a new dx of DCIS. I had an MRI two days ago & now have a second \"spot\" on the left and a new \"spot\" on the right. Next week I have a bi-lateral ultrasound and a unilateral mammogram on the left. I'm praying the new spot on the right turns out to be nothing and I will have surgery on May 23 as tentatively scheduled. Breast Cancer does seem to involve a journey rather than an event. Wishing each of you the best outcome possible!",
      "MessageIndex": 41,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Jul 29, 2017 09:48PM ThreeC wrote: I am doing 8 sessions of acuboost followed by 27 Whole Breast sessions. The first four boosts were very, very painful. On Friday I had two different techs and the pain was negligible. I tried to figure out what the difference was but only felt like they didn't tighten the machine as much. Anyone else have very painful boostsessions? I never use the pain meds after surgery. I've never hurt this much before.",
      "MessageIndex": 90,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Aug 8, 2017 03:56AM ThreeC wrote: Just finished 8 boosts and had my second whole breast today. I used miaderm for a week before my first treatment to moisturize my skin. Then put it on immediately following each session and at bedtime. Then a cool shower in the am.. My skin looks good so far. The boosts were hard on me. They hurt, but I had just had two surgeries. The whole breast sessions are easier on me.10 down 25 to go!",
      "MessageIndex": 110,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Aug 11, 2017 04:44AM ThreeC wrote: Twelve down-23 Whole Breast to go. Forgot to mention that after the 8 Accuboosts the Accuboost company gave us gift bags. A lap blanket, a soft pink robe, a thermal mug and some lotion. It was a nice treat! The whole breast sessions are going easier. I am using Miaderm the minute my treatment is over and then either more Miaderm or aloe gel that I keep in the fridge. The cool gel is so refreshing. I have just a small amount of what looks like skin peeling after a sunburn No redness at all. The RO told me to lather the lotions way up under my armpit area. I didn't realize how far back the rads were going. There is a small group of women that are there everyday at the same time. The ice has broken and we are conversing a bit. It seems easier somehow, to chat here, than in person.",
      "MessageIndex": 119,
      "PostDate": "11/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Jul 24, 2017 07:43PM - edited Jul 26, 2017 07:20PM by ThreeC Had my first whole breast rad session today, followed by a practice boost session. The whole breast session was fine. The boost practice was the most painful experience yet including two surgeries. I wanted to slap the girl turning the vice and I am so non- aggressive it is not funny. I went home and slept for four hours. It will take a full dose of anxiety meds for me to sleep tonight and face that machine tomorrow. Praying for a different experience! Pleasant dreams to all tonight",
      "MessageIndex": 65,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Aug 21, 2017 06:48PM ThreeC wrote: Woke up this morning, brushed my teeth, combed my hair and more hair than ever was in the sink. Went for my rads and Dr appt. Felt all day like there were spider webs on my skin. Looked down at my IPad and saw hair all over it. I have not had chemo nor hormonal treatments yet. Just had two surgeries and am half-way through Rads. Anyone else have hair falling out due to radiation treatment s? I didn't expect this. I swear if there is a weird SE to anything my body will find it",
      "MessageIndex": 161,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Jul 21, 2017 09:58PM ThreeC wrote: I am starting 35 sessions of radiation on Monday. At my second mapping session today they gave me my schedule for the next 7 weeks. They are starting with one regular session, then eight boost sessions followed by the remaining regular sessions. Anyone else having all the boost sessions at the beginning or does this seem unusual",
      "MessageIndex": 51,
      "PostDate": "21/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/856335",
      "Title": "Starting Radiation July 2017 Castigame ML1209"
    },
    {
      "AuthorID": "ThreeC",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/251054/profile",
      "Content": "Jul 30, 2017 01:52PM ThreeC wrote: HeyJude, I had clips put in during biopsies and they were removed later during surgery. They were put in as Melissa stated to mark the areas of concern. Hope this helps you feel a little more comfortable",
      "MessageIndex": 3,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857446",
      "Title": "Has anyone had clip marker put in during biopsy? heyjude62 heyjude62"
    }
  ]
}