{
  "AuthorID": "thria157",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
  "Posts": [
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "Aug 7, 2018 05:51AM thria157 wrote: thanks for your response JFL - we did a few months ago but the CA15/3 was rising parry due to an internal inflammation that she had. One option I guess is to try again  Any other thoughts ?  Tb and so much",
      "MessageIndex": 10,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    },
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "thria157 wrote: Hi everyone, Thanks so much for all your help and support. I am writing on behalf of my mother that she has mastectomy in 2004 and met in bones in 2013. Since the she had a failed try with armidex then moved to xeloda for 2 years and the last year she is on falsodex and Ibrance 100mg because she cant take the 125 due to blood smear. Recently the CA 15.3 started rising again. The onc suggested to do a biopsy to see if the issue is due to a mutation or because falsodex or ibrance run out of gas. Personally I am very confused and I dont know how to help. There are so many combinations of 1. Ibrance and Femara 2. Ibrance and Aromasin 3. Afinitor and Aromasin - onc suggestion 4. Afinitor and falsodex is there any way that you can pick the one that could work ? are there any similar experiences ? Please help Thanks so much Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    },
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "Apr 16, 2018 03:44AM thria157 wrote: thanks for your response. From what i read online it looks like that A/A is performing as well as Ibrance and Flasodex or Ibrance and Aromasin. Whats the main criteria to chose either Afinitor or Ibrance you think? She just got her scans and there is no progression. the mets is only on bones. Looking forward to your response",
      "MessageIndex": 3,
      "PostDate": "16/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    },
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "Jun 20, 2018 08:33AM thria157 wrote: hi all. Yes the scans showed no progress. Apparently she had an internal inflammation in her body that caused the whole CA153 rise. After she removed this and being without ibrance for a month the ca153 went down 20%. We are still having issues with her RBC that fluctuating a lot. Any suggestions for this will be great.  Thanks so much all",
      "MessageIndex": 6,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    },
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "Aug 31, 2018 10:18AM thria157 wrote: still she can only take 2 weeks of ibrance 100mg can’t get into the 3rd due to low RBC The onc suggested to take some retacrit injections that include a hormone that stimulates the bone marrow and increases the RBC. The options out there about giving this to cancer patirents are different. What do you think ? Thanks",
      "MessageIndex": 11,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    },
    {
      "AuthorID": "thria157",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/255675/profile",
      "Content": "Aug 6, 2018 07:09AM thria157 wrote: hi again, Back on 100mg of Ibrance - it’s a struggle to compete the 3rd week due to low white and red cells again. The last 2 cycles has stopped after the 2nd week. The issue is that the CA15/3 increases from 668 to 698 due to this. It’s a minor increase but still increase. The doc suggested to be 2 weeks on - 1 week off Which means that in a months time she will get 3 weeks of medicine but not consecutive. I found this a bit strange because the ibrance dose management said to start again once the patient recovers - for which 1 week might not be enough Any thoughts ",
      "MessageIndex": 8,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/863797",
      "Title": "Before you go to chemo what to do ?? suggestions please thria157 thria157"
    }
  ]
}