{
  "AuthorID": "thsizit7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
  "Posts": [
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Jul 17, 2016 12:16PM thsizit7 wrote: Hi! Stage II March 2015 Stage IV August 2015- Lymphatic system I was actually Stage IV from day one.",
      "MessageIndex": 69,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 8, 2015 08:12PM thsizit7 wrote: I'm so sorry to here about so many being sick, hospitalized, and just having a bad time. I will pray for you all! Stephmoen - I also had a reaction to Taxotere the first time, had a throbbing pain start in my lower back that ran all the way up to my head, I buzzed nurses, before they got it unhooked my chest started feeling tight, getting short of breath,Three Drs and a several nurses came flying in like it was a code, my blood pressure and pulse had jumped sky high! they stopped the drip, started Benadryl, and it started slacking off immediatley. I was fine in just a few min. They gave me more steroids and Zantac in IV, waited about 20 min and I took the rest of the bag with no problem. From now on I will have to double up on the steroids the day before, morning of, and in the drip before chemo to tolerate it. I was afraid they would not give it to me again and change to something else, but they said the double steroids would take care of it. I want to take that combo of drugs, PHT because of the huge success rate. I can deal with steroids, it doesn't make me jittery just lots of energy...I think I will have a very clean house during this ordeal !!! I've had no problems with my port. Don't even realize it is there now. I go back next Tue to let my surgeon check it. Don't know if I will make it to my 2nd round before hair starts to come out... this morning when I combed through it strands of hair came out from the root! I can pull a strand here and there and it will just pop out...kind of freaky!!! If it continues like this I will call my hairdresser and up the date to get it shaved... I refuse to watch it fall out! I'm just taking one day at a time and will deal with whatever it brings. I get my strength and positive spirit from God. He deserves all the praise and glory! My husband is the absolute best, he goes to all Dr apps, anything associated with my situation, sees to my every need. I could not ask for a better caregiver. He is my soulmate. My family and friends are very supportive and this makes a huge difference, I am truly blessed. Hope everyone has a fabulous weekend and Mothers Day! Life is Good.   ",
      "MessageIndex": 1268,
      "PostDate": "08/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 19, 2015 10:36AM thsizit7 wrote: Stephmoen I am on my way to my 2/6 treatment today. I took 2 dex yesterday, 2 this morning, then they will double it in my IV. I will let you know how it goes. My reaction was a throbbing pain in my lower back that traveled all the way up my spine into my head about 20 to 30 min into infusion. By the time that got in the room which was quick! My blood pressure and pulse had jump sky high and I w as having tightening in my chest. I remained calm and as soon as they unhooked the drip and got the Benadryl in my vein it started slacking off. In a few min I was fine. It was really a strange sensation! Hope it doesn't happen again! I go in get bloodwork, see my Oncologist, then go for chemo all the same day. She gave me her cell number and told me to call anytime I have questions. I think that is the norm with this group. But I am truly blessed that my stepson is an Oncologist! He can't technically treat me, but he set me up with a dr in his group, she is wonderful, and so is he, of course my stepson had input on any decisions made, so I just call him instead of her if I have questions and she is fine with that! Imust say I do get a little \"Royal\" treatment there😉 PTL🙏 On the mosquito situation...my husband is one of those people they are drawn to! We can be sitting together outside and they don't touch me, but they will eat him alive! He says he has \"sweet meat\" LOL! I kept ice chips in my mouth the whole time I was getting chemo last time and I have had no mouth issues, so I am doing that again. Praying everything goes well today for me and all of you!😎 ",
      "MessageIndex": 1534,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Apr 29, 2015 04:17PM thsizit7 wrote: Sorry you are having a bad day, I'm just getting started so i'm sure I have some days like this coming...I'm grateful to have this forum to vent! The picture is beautiful! We went to GNP late Aug of last year. It was breathtakingly beautiful! We did the Red Bus Tour of Going to the Sun Road. It was amazing, would love to go back someday! Praying that tomorrow will be better for you.",
      "MessageIndex": 991,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 1, 2015 07:08PM thsizit7 wrote: Hi Everyone, didn't check in yesterday, was out on my usual Thur. escape. I felt great, still on steroid high I guess, ran errands and shopped all day. I've been taking the sleeping pill as suggested by my oncologist and have been sleeping like a baby. Woke up this morning with a slight Headache, which I never have normally, but advil made it go away. The steroids are gone so I sure miss that energy... got all kinds of put off projects done around the house! I almost hate to say it, (don't want to jinx myself) but so far I have had no side effects...thank you Jesus! I am going to just take one day at a time and make the best of what it brings. I have been staying hydrated, thank goodness I Iove water, and I'm trying to stick to my normal routine. Praying that tomorrow will be another good day. I go Monday and get my port, a little anxious, any input on this? Littleblueflowers l am loving your photos! Rocker wife your pics are great! fmmbw I too get my strength from God, and I thank him every day for blessing me with a positive attitude. He deserves all the praise and glory! Hoping everyone has a feel good, beautiful weekend!",
      "MessageIndex": 1091,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 9, 2015 01:17AM thsizit7 wrote: SueH58 - PHT is Perjeta, Herceptin, Taxotere It's my understanding that this combination has had a much greater success rate against HER2 coming back than some of the other regimens. The oncologist in my group conferred with other Drs throughout the country and they decided this would be the best regimen for my situation. I did a little research on my own and was excited with the statistics. As we all do, I just want to be cancer free and be able to go on with my life. I will do whatever it takes to reach that goal. Hope you have a great weekend! ",
      "MessageIndex": 1274,
      "PostDate": "09/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 15, 2015 11:09PM thsizit7 wrote: Hope everyone is doing well today! To all of you who have small children, teenagers, those of you who are still working...I can't even imagine...you are all SuperWomen in my eyes! Fran - you go on that girls trip and have a blast! You deserve it! My oncologist told me I could still drink my red wine, just not every day or too much! My pics...with my daughters on Mothers Day, my buzzed head, my Wig...I have had a hard time adding these pics. Hope they didn't post multiple times!😱  ",
      "MessageIndex": 1451,
      "PostDate": "15/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 19, 2015 01:40AM thsizit7 wrote: Hi all of you fabulous ladies! Addie- be sure to tell them immediately if you feel anything unusual, they will stop the infusion and take care of you! They gave me Benadryl, steroids and Zantac, waited about 20-30 min and I took the rest of th bag without a problem...hence the double steroid from now on! Kbeee- Ccount me in on the Virtual Piña Colada! Mysunshine- don't let this get Devil in BC form get the upper hand, I thought for me it would be depressing to watch my hair fall out! So I took control and buzzed it as soon as it started coming out, and it is the best thing I Have done for myself so far! As someone earlier posted...it's empowering! We have to stay ahead of this thing! Gkodad- I will be 64 in Aug so you are not the only One who has grandkids. My 4 are 6 to 16! And a step that is 21! I go for 2/6 tomorrow. Since I had the reaction to Taxotere last time I have to double my steroids. I took two today, will take Two in the morning and they will double what they give me in my drip before chemo! It is midnight here in Ms and I am wide awake! 5:00 a,m. will come too soon!!! I really will be bouncing off the walls after all the steroids tomorrow, but I guess that's a good thing, because a quick visit from my sister and brother, this Thur and Fri, who live in different states, is fast turning into a family reunion!!! Hopefully the energy will help me get everything ready for this growing event! Praying that everyone has a fabulous low SE day! ",
      "MessageIndex": 1528,
      "PostDate": "19/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Apr 26, 2015 11:03PM thsizit7 wrote: I can do all things through Christ who strengthens me... Well... add me to this journey please. I'm so thankful I found this site! My situation: I am 63 yrs old, have always been healthy as a horse, had my yearly mammogram in Feb and BAM...went for follow-up, and US, radiologist came in looked at screen, said he needed to do a biopsy, did it, and I left knowing I had cancer. I worked in US for 14 years so I knew what it looked like on screen. Got my results a week later and it was positive. I am blessed to have a stepson who is an oncologist. He got me in with a surgeon the next day. We scheduled a lumpectomy and sentinel node biopsy in 5 days. Had lumpectomy, the sentinel node was positive for cancer so he removed all the soft tissue under my arm. He also removed a couple of other suspicious looking areas in breast. Path report showed the tumor margins clear, one of 10 nodes removed positive, the suspicious areas turned out to be DCIS. I have HER2 and all my hormone receptors were positive. We decided to do chemo first, then do bilateral mastectomy, while remaining on Herceptin for a year then probably Femara for five years I had a PET Scan the next week and it showed no signs of cancer in bone or liver, but the internal mammary lymph node appeared to be lit up. So because of that my treatment plan was changed to add Perjeta. I have my first of six treatments of TPH on April 28th, two days from now, and will receive them at 3 wk intervals. I am very anxious, I think the anticipation, not knowing how my body will react, is the hardest thing for me right now. It's really scary to me to think about having \"poison\" injected in my body that could potentially damage my healthy organs!!! ...after chemo I will have another PET Scan to look at that IM node. It's possible I may have to have radiation, depending on what PET Scan shows at that time. God has blessed me with a happy, always positive, personality that is sometimes annoying to certain people. I have been asked many times in my life (sometimes begrudgingly) \"how can you be so happy all the time\" ? I have come to realize that it is a gift from God. My hope is that I can hang on to this positivity throughout this Cancer Journey. I am hoping that since I have always been so healthy otherwise that it will help me through the potential side effects??? Any input on that??? My Oncologist is a female and I love her! I told her up front that I wanted to know everything, no soft peddling, I can deal with facts. She answered all my \"girly\" questions without my even having to ask! She told me my hair is going to come out after the 2nd treatment, and wrote a prescription for a hair prosthesis and told me where to go to get the best custom wig, and to go there when I left her office, order it, so it would be ready when I need it. I have ordered it and will pick it up tomorrow. She was very thorough and informative and wrote prescriptions for nausea, sleep, etc. I have already talked to my hair dresser and set up a date to shave my head. I refuse to watch my hair fall out! I am already a hat girl, so I have plenty of hats, and I am trying to get creative with scarf tying. I have a wonderful husband who is very supportive, and I am blessed to be retired. I know that God is with me and he will see me through this. When I look back over my life, I think he has been preparing me for this diagnosis for a very long time. Sorry for being so long winded... I look forward to being a part of this group...learning, helping each other...together we can do this! I can see the light at the end of the tunnel...",
      "MessageIndex": 862,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Apr 29, 2015 11:31AM thsizit7 wrote: KBeee, thanks for the welcome, and I will try not to think of the chemo as poison anymore, you are right it is my ally! I had number 1/6 chemo treatments PHT yesterday and It went well. I had a reaction to the Taxotere so will have to double my steroids so I can tolerate it. Guess I will be blown up like a balloon with a moon face, but it thats what it takes, so be it! One of my Drs that came in when I had the reaction said with all the steroids they were putting in me yesterday,\" I would go home and walk up the walls and dance on the ceiling\" LOL I didn't quite do that, but I am still wired up today! I feel great, No sickness, diarrhea, nothing so far so I'm trying to get some put off projects done around the while I feel this good! Littleblueflowers, Love the pic! Hope everyone has a good day!  ",
      "MessageIndex": 979,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 12, 2015 10:58AM thsizit7 wrote: ERNurse21 - WOW you look great! Your wig looks very natural and the style suits your face. Love the pic with your girls, they are precious. I hope my wig will look that good on me! I go Thursday for my first fitting, can't wait! Praying that everyone has a wonderful low SE day!",
      "MessageIndex": 1358,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 13, 2015 01:05PM thsizit7 wrote: KBeee Love the picture with your daughter, you and your wig look great! I hope mine looks that good! I am so impressed with all these ladies wigs, they all look so natural, y'all are just a bunch of strong, good looking women! Most of you are younger than I am, not so sure I will look as good going commando, but I will have my wig, bangs, halos and lots of hats and scarves so I am ready. I'm going tomorrow to get my head buzzed, hair is starting to come out every time I brush through it. I go next Tue for 2/6 PHT treatments. MO says that since I have had literally no SE, other than hair loss with first treatment, that I should expect the same with 2nd. I hope she's right! Gotta run, I'm off to make another flower run, still have a few more empty pots and containers to fill. Trying to get my patios and decks done, in case the SE do creep in. Praying that you all have a low SE, happy day!",
      "MessageIndex": 1388,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Apr 29, 2015 03:38PM thsizit7 wrote: KBeee, thanks for the welcome, I will try not to think of the chemo as poison anymore, you are right it is my ally! I had number 1/6 chemo treatments PHT yesterday and It went well. I had a reaction to the Taxotere so will have to double my steroids so I can tolerate it. Guess I will be blown up like a balloon with a moon face, but it thats what it takes, so be it! One of my Drs that came in when I had the reaction said with all the steroids they were putting in me yesterday,\" I would go home and walk up the walls and dance on the ceiling\" LOL I didn't quite do that, but I am still wired up today! I feel great, No sickness, diarrhea, nothing so far so I'm trying to get some put off projects done around the while I feel this good! Littleblueflowers, Love the pic! Hope everyone has a good day!  ",
      "MessageIndex": 987,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 5, 2015 05:14PM thsizit7 wrote: Hi Everyone, Made my 5:45 am appt and got my port put in yesterday, it's a little sore but not as bad as I expected! No range of motion issues. I have to drive 112 miles to get to my Drs and chemo, so I slept all the way home and was sleepy the rest of the day! Don't know what they gave me, because when I had my lumpectomy, I was wired up the whole day and didn't sleep a wink! At my normal bedtime I took my sleeping pill and a pain pill and slept like a baby. Woke up this morning full of energy! I left the house and went on a hunt for plants, found what I was looking for and will get my handyman to plant them for me tomorrow! I can't believe I feel so good!!! God is sure blessing me each day. I'm about to go to my 10 year old grandson's ballgame and it's also his birthday, so my daughter is having a family party at our favorite local Mexican restaurant after the game. It's tradition since he was born on Cinco De Mayo! I am so thankful that the SE\"s have not happened yet! I'm just taking one day at a time... Happy Birthday Stephmoen! lovlilynn - Your daughter is precious and I'm so glad you let her support you in this way! and BTW my oncologist said it was ok to have a glass of wine occasionally. It's been a beautiful day here in Mississippi too! Hope everyone has a good night! ",
      "MessageIndex": 1208,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 11, 2015 03:36PM thsizit7 wrote: Hope everyone had a great Mothers Day! Mine was fabulous! Beachbum Thanks for the idea of the seat belt puppy for the port! I still have all the \"pound puppies and kitties\" from when my girls were little, I went and pulled out a pound kitty that looks like my cat \"MR Kitty\" and it works purrfectly (sorry : ))) ) I have had no issues with my power port at all so far, put in a week ago today, it's healing nicely and hasn't interfered with my sleep. This is day 13 post 1/6, I still have had no side effects at all. I feel great, perfectly normal, my energy level is still up, I feel great! I thank the lord for every day that I feel good, because I don't know if this will last. God never promised that life would be easy, just that he would be with us and help us through when it's not. I did keep ice chips in my mouth throughout the chemo, except when I had the reaction to Taxotere of course. One day I did have a sore on my tounge like what we always called a \"lie bump\" when I was a kid, but it was gone the next day. Don't know if it was related to chemo or just random. My oncologist put me on Valacyclovir daily because I have a place that breaks out on my hip (a type of herpes) when I am stressed. She said I didn't need to have to deal with it possibly breaking out while taking chemo, this could be helping keep away any mouth sores??? She also gave me Temazepam to take at night because she said a good nights sleep would be very important. I am a person who doesn't take anything unless it's absolutely necessary and I didn't want to take the sleeping pill... but it works, so I do, I sleep like a baby every night and wake up feeling great! She also did not start me out with the Neulasta shot, she wanted to wait and see if I would need it. My wig is in, I have an appt Thursday to get it cut into the style I want and the first fitting. The wig chick said until my hair was completly gone it would't fit right, that she would need to wait and do the final fitting around my ears then. My hair is not falling out, but more hair than usual comes out when I comb through it every day. Can't even imagine what I will look like bald!!! It won't be a pretty site...but I might enjoy not having to wash and dry my hair every day, once I get used to it! I have always envied men who look good bald, low maintenance! LOL Thank God I am already a hat girl, I have tons of hats, so no one will think anything about seeing me wearing one, it's already the norm. I have already ordered halos, and bangs, and I have lots of scarves, so I am ready. Beachbum, my theme from the very beginning of this ordeal is... \"I can see the light at the end of the tunnel\"  ",
      "MessageIndex": 1337,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/829470",
      "Title": "April 2015 Chemo Crew... Starting in April? Please join us! KBeee KBeee"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 24, 2016 11:28AM - edited May 24, 2016 11:29AM by thsizit7 Hi Ladies! I'm so glad I found this board! Tomorrow I will have my first dose of Kadcyla/TDM1. Up until this point on my journey with BC, I have had no side effects (except losing my hair) to speak of from my treatments, so I am a little anxious about this new drug...afraid my luck is running out...(on no SE\"s), I have so much planned for the summer! I don't have time to slow down!!! I have a trip planned with my daughter's family to Rivera Maya, Mexico in July. It's already paid for, plane tickets bought (non refundable). Do y'all think I will be able to go ??? I've been on Perjeta, Herceptin, and Anastrozole (added in Nov) since last August and have travelled around this country and Canada, been on 3 cruises, without any problems. My last Pet Scan showed some progression, so hence the Kadcyla. Have any of you been out of the country while taking this? I also have a trip planned next week to Gatlinburg for several days. My oncologist has always encouraged me to travel as much as possible, as long as I feel like it...I haven't let it slow me down yet! Reading how well some of you have done with this is very encouraging, I'm just kinda freaking out not knowing how I will react to this new drug! I had a reaction to Taxotere with my initial round of chemo, but was able to tolerate it with double steroids and pre-meds. The potential liver problems with this new drug have me the most worried, and the potential heart damage too of course, but I already get echocardiograms done on a regular basis, so far so good with that. Thanks so much for letting me vent my worries and frustrations, I'll let you know how I do with it. Thsizit7 \"it isn't your problems that define you, but how you react to them, and recover from them\" PTL",
      "MessageIndex": 513,
      "PostDate": "24/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 26, 2016 01:10AM - edited May 27, 2016 11:12AM by thsizit7",
      "MessageIndex": 518,
      "PostDate": "26/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 13, 2015 10:35AM thsizit7 wrote: Allyme- please don't just stop taking treatment until you have answers. You have a right to a copy of everything you have had done, reports, films, treatments etc. my Drs give them to me without having to ask, but if not, ASK! Take them to another oncologist and get a second opinion. Your life could depend on it! HER2 is a very aggressive cancer! You CAN be walking around with stage IV cancer and not know it! I have two friends who have died recently, both pictures of health!!! One went to the Dr thinking he had IBS because he had eaten some popcorn...he had stage IV pancreatic cancer and was dead 3 wks later! The other had been having constipation problems and went to Dr she had stage IV colon cancer that had spread to liver, lungs, pancreas, she died two months later! I hate to be so blunt and morbid...but this is a serious matter! I have another friend who was a picture of health, never been sick in her life! She was having stomach problems, went to Dr, she had a huge tumor in her abdomen that had attached to almost every organ in her body! They removed it and part of all of the organs it was attached to, she lives with a colostomy, now, and will take chemo the rest of her life, but she is doing great, looks great, they travel everywhere! That was 4 years ago! She is 58 now! I'm telling you all of this hoping you will get a second or even third opinion if that is what it takes. most people who take chemo or radiation feel much worse than before they were diagnosed, I think it's pretty much the norm! But it can prolong your life, time left on this earth to enjoy your family and friends. My theme from day one has been: \"I can see the light at the end of the tunnel\" I was so aggravated when they said I had to take chemo...I didn't want to have poison injected into my body that could damage my healthy cells...I have never been sick, I too am a picture of health! But I am a believer in God, and I truly believe that God is with me and he will see me through this. I have come to look at chemo as my ally, not my enemy. This will pass and I will be healthy again, I just have to go through some tough times to get there! Stand up for your rights, ask questions, demand explanations if necessary, pray and ask God to give you the strength and courage to get through this. this is YOUR life! Sending prayers up for you!",
      "MessageIndex": 17,
      "PostDate": "13/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831395",
      "Title": "Totally Confused! Allyme LindaE54"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 27, 2016 11:15AM thsizit7 wrote: opps deleted by mistake. I don\"t know what i'm doing wrong...I am trying to add my stage IV diagnosis and I can't seem to get it to take it. Any suggestions would be appreciated. Thanks",
      "MessageIndex": 519,
      "PostDate": "27/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Jul 26, 2016 03:04PM thsizit7 wrote: Denise, Do you have a port? I was told when I had mine implanted that they would last for years. Just wondered what your situation was since you have been on chemo so long. I guess all of us stage IV's will have to have some kind of treatment as long as we live unless they find a cure. Just wondering how long the ports last without complications... Oh and I wanted to ask if the PT is helping your arm? I think I made mine worse by trimming plants in the yard! I can't just sit still and do nothing when I see things that need attention! It's hard to slow down...",
      "MessageIndex": 581,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 31, 2016 10:43PM thsizit7 wrote: Thanks Denny! I have decided not to get my nails done.☹️ I soaked the solar ones off today and my hubby said he will do my pedicures! He did them while I was on Taxotere and did a good job too😃I never had a problem of lifting or color changing of my nails while taking it. I did keep clear polish on my fingers and my \"Cajun Shrimp\" red on my toes! No one told me not too!😳 Curious, why did you quit taking Kadcyla after 9 months, was it having a negative effect? How long were you off of it? My Dr at MDA said I would be on it until it quit working, like the Perjeta and Herceptin. I was hoping P&J would work longer than 9 months!😏 I'm worried that I will go through my options too fast... Thank you for answering, you are a huge inspiration to me! ",
      "MessageIndex": 523,
      "PostDate": "31/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Jul 25, 2016 01:57PM thsizit7 wrote: Hi Ladies, I have had 3 infusions of Kadcyla. I have chills, no fever, achy feeling in the evenings for about 3 days, and for the first time since I started chemo last March, I feel tired. This is a totally new feeling for me, I have always had tons of energy. Any suggestions on dealing with this? Would vitamin B shots help? Also, I have a few other questions... I am now having some joint and muscle pain, the bicep muscle in my dominate arm is very sore and tender to touch, has anyone else experienced this? I practically live outside in the sun and I do use sunscreen, but I have developed an itchy place on my arm, not really a rash, just itchy! I've been using cortisone cream, it helps but doesn't stop the itching...Any suggestions? I feel very fortunate to have had virtually no SE's until now, and I'm not complaining, just looking for answers. I have my next PET scan at MDA on Aug 5th, get results on Aug 8th to see if Kadcyla is working. Praying that it is! I am so thankful to have this site to go to. Thanks in advance for any advice you can give! ",
      "MessageIndex": 579,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Jan 10, 2016 06:19PM thsizit7 wrote: Hi Ladies, thanks for your replies! Bon - 8 years out is very encouraging! Wishing you many, many more! I do think the biopsy of R hilar lymph node changed my options...but I'm glad they did it. As my local oncologist, Specialist at MDA, and my breast surgeon all said...BMX and Rads would not change my situation...I would still have cancer, so why put myself through all of that. I trust them, and they believe they can manage it with chemo. So we will see. Congrats on your hair growth, you obviously have good hair for it to grow to the length you said it was! I hope you realize how fortunate you are! I find it so interesting that your hair changes from blonde to gray according to your nutrition! I've never heard of that... will have to google it when I get time!  Shutterbug - Sounds like your are another one blessed with good hair! Mine has always been fine and thin, and I couldn't stand it... but I would love to have my pitiful little hair back, I will never complain about it again! I never lost my nails either, but they were pretty sad looking by the end of Taxotere! They were very brittle and turning brown, but never lifted. I do take Biotin and Selenium and had for years before DX but while on the harsh stuff, Dr told me not to take any supplements, other than Centrum silver. I am back taking them now, and getting my nails done again. I had been getting solar nails for years and I missed them terribly while on the harsh stuff! Now I can throw on a blonde wig or hat (or both), my red lipstick, and with my toes and nails done, I feel like ME again!  sueopp - You are so right for reminding me that Perjeta and Herceptin don't rob us of our hair! That alone is a lot to be thankful for! I have adapted pretty well, but I do worry when I look in the mirror and see that it hasn't grown much...just wanted to know if anyone else had the same issue. I like your reference to this as \"Adventures in Cancer Land\"! LOL and Yes, we must keep on dancing! One of my motto's before all of this was \"I'm not going to let anything rain on MY parade\"...and that still stands...not even cancer! I haven't let it slow me down yet!  ccristee - Sounds like we are in the same boat...glad to know I'm not alone. I read an article yesterday about of all things, \"Castor Oil\" being good for re-growing hair after hair loss! I had always heard about taking it to clean out \"the other end\"!!! So, I hopped in my car and went to the local Dollar General and bought a bottle! The article said to massage a few drops into your scalp daily. Hey, I will try most anything once I massaged it in last night, it IS pretty oily, so I put a towel over my pillow... we will see what happens in the coming weeks! I have been a hat girl for about 20 years and I already had tons of them, so it comes natural for me to wear them! God knew I would need them one day, He truly is amazing! Just buy you some cute ones (if you don\"t already have some) and make a fashion statement! The little fedora's and floppy hats are actually in right now!  Praying that the future holds only good things for all of us, and thanks again for your replies, I feel better to know I'm not the only one! ",
      "MessageIndex": 4,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839708",
      "Title": "Perjeta, Herceptin, Anastrozole, indefinitely... thsizit7 Wiegp22"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "Jan 12, 2016 03:30AM thsizit7 wrote: Fitztwins - what an encouragement you are to me! I hope I will have many years ahead like you! Praying that they can keep us around until a cure is found!😊",
      "MessageIndex": 6,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839708",
      "Title": "Perjeta, Herceptin, Anastrozole, indefinitely... thsizit7 Wiegp22"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 25, 2016 12:17AM thsizit7 wrote: Denny, thank you so much for your reply and words of encouragement. Knowing you have survived 14 years gives me so much hope! You are a blessing to all of us who are fairly new to this BC world. \"Jesus Juice\" is what I've been calling my chemo, so I'm praying that this Kadcyla will have Jesus mixed all up in it! He is the ultimate healer! Thanks again  ",
      "MessageIndex": 515,
      "PostDate": "25/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 26, 2016 01:00AM - edited May 26, 2016 01:04AM by thsizit7 Well Ladies, I had my first infusion of Kadcyla today with no reaction PTL! It was just a long day because my clinic is 112 miles from my house, I had to see my Dr first, then they pushed it slow for 90 min, then had to wait 90 min for reaction time...strange that the reaction, if you have one, happens after the infusion!!! Now if The \"Jesus Juice\" will smite those pesky cancer cells and I can get by with few SE I will be so thankful!🙏 I had a funny thing happen that I will share with you today. There was a colorful little man named Mr Peebles in the waiting room today. We had met him a couple of visits ago. He sells boiled peanuts out of his truck and he loves to talk...he is a little hard of hearing so he talks loud! My husband BG is full of mischief, so he and another gentleman sitting close by got Mr Peebles wound up, the whole waiting room was rolling in the floor laughing. A little later when Bobby was going to get ice chips for me, he ran into the other gentleman who said hey! Come to my car I have something for you...he handed him a handmade doll with a note pinned to it's hand. He said give the one with green hair to your wife and here is one for you too, it was a \"Dammit Doll\"😂😂😂 I will try to attach a picture that will explain. I love how God sent these people to make us laugh when we really needed it! I will take this as a good sign!😎",
      "MessageIndex": 517,
      "PostDate": "26/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "May 30, 2016 10:21PM thsizit7 wrote: Hi Ladies, hope you all had a fabulous Memorial Day weekend! Qiestion...I have been getting Solar nails and pedicures while on Herceptin, Perjeta, anastrozole, but what about Kadcyla??? Is it safe? has anyone been getting them while taking this??? Well, I have had my first symptoms to speak of ever from my treatments (other than losing my hair)! Every afternoon around 5:00-6:00 o'clock, I get chills and An achy feeling all over, no fever at all! It's not bad, just annoying, makes me Feel tired and I don't have much appetite, but other than that I've done Fine so far! Anyone else had this? Hope Everyone is feeling fine! PTL🙏 He is so good😊 ",
      "MessageIndex": 520,
      "PostDate": "30/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "thsizit7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213384/profile",
      "Content": "thsizit7 wrote: Hi Ladies! I was diagnosed in March, 2015 as stage II grade 3 ER+PR+HER2+ breast cancer, I  had a lumpectomy and axillary lymph node removal and surgeon found DCIS also. Pet scan showed an internal mammory node lit up and a suspicious area in right Hilar region but they thought it was inflammation, and thought if it was anything the chemo would take care of it. Well, after chemo, the follow-up Pet scan showed IM node and RH node still slightly lit up. So I was told the next step was mastectomy, then radiation. My stepson is an oncologists and he pushed for me to have an EBUS Bronc of the node in R hilar region just to see if it was cancer. The Dr who was to do it didn't want to attempt it because it was so small and in a hard to reach area, he said there was only a 20% chance he could even get to it. But thank the Lord he was able to reach it and obtained a biopsy that showed breast cancer cells. So that changed everything! I am now stage IV, incurable... no mastectomy, no radiation.  I then went to MD Anderson (My stepson's suggestion) and they are telling me they hope to manage this like any others chronic illness, such as diabetes! I hope they are right!  Hence the regimen I am on. Anyone out there on this regimen? I'm wondering about hair growth. I had my last Perjeta, Herceptin and Taxotere in August 2015. Have been on Perjeta, Herceptin only since then until Nov when Dr added Anaztrozole to the mix. I am one of the fortunate ones who have never had side effects other than hair loss and change of taste. After I stopped the Taxotere, my hair started growing back and my taste came back, but it's been over 4 months now and my hair is only about two inches long! I just thought it would grow faster than that??? and it came back exactly like it was before...fine and thin, and same color. I have kept it blonde for the last 40 years (I am 64 now). Before color, I was always called a dishwater blonde and still am except a little gray around my temples. I would be interested to here from others about your hair growth! Looks like I will be wearing my wigs for a very long time!!! They actually look better than my real hair anyway!😉 Also my \"wig chick\" says you can color your hair when it gets 2 inches long...has anyone out there done that? Looking forward to hearing some of your experiences! Thanks in advance😊 \"I can see the light at the end of the tunnel\" Dx 3/11/2015, Left, Stage IIB, Grade 3, 2/11 nodes, ER+/PR+, HER2+ Surgery 3/17/2015 Lumpectomy: Left; Lymph node removal: Sentinel, Underarm/Axillary Chemotherapy 4/27/2015 Taxotere (docetaxel) Chemotherapy 4/28/2015 Other Dx 9/2015, IDC, Right, 2cm, Stage IV, metastasized to other, Grade 3, 2/11 nodes, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/839708",
      "Title": "Perjeta, Herceptin, Anastrozole, indefinitely... thsizit7 Wiegp22"
    }
  ]
}