{
  "AuthorID": "Tia123",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214107/profile",
  "Posts": [
    {
      "AuthorID": "Tia123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214107/profile",
      "Content": "Jun 16, 2015 09:11PM Tia123 wrote: today is day 15 after my first chemo treatment. What a roller coaster ride! The first couple of days were fine, then I battled nausea and diarrhea for days 3-6. I had a couple of good days then woke up with pain in my lower back. By day's end the pain was unbearable. I visited my MO the next day. He diagnosed what he believed was a severe UTI, but couldn't be positive because my white count was \"dangerously\" low. I am better now and finally had my port placed this morning. I was not prepared for my shoulder to hurt this bad!! My hairbrush is full of hair every time I use it, so I guess it's time to let my husband give me a buzz cut. Next treatment is on the 25th. I go once every 3 weeks for a total of 6 treatment (A, T, & C at the same time) followed by 33 radiation treatments. I hope things settle down...I can handle the nausea but I will be praying for no more infections! I have been on non stop antibiotics since May 4",
      "MessageIndex": 87,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    },
    {
      "AuthorID": "Tia123",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/214107/profile",
      "Content": "May 27, 2015 08:38PM Tia123 wrote: my start date is June 1, so it looks like I will be joining you all. I am very nervous. Surgery was difficult due to an infection I got while in the hospital. My first treatment will be given via regular IV because I cannot have the port put in until I have completed at least 6 weeks of antibiotics. Hopefully everything will go smoothly from here.",
      "MessageIndex": 12,
      "PostDate": "27/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/831849",
      "Title": "Chemo in June 2015 zzlady Catfurr"
    }
  ]
}