{
  "AuthorID": "tiffany0",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223594/profile",
  "Posts": [
    {
      "AuthorID": "tiffany0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223594/profile",
      "Content": "tiffany0 wrote: In the middle of my period I noticed a rash developing above my left breast, it had a burning sensation to it. My left breast is also has a slightly different shape than my right. Then I noticed my left areola was noticeably bigger than my right. I do have stretch marks on my breasts but they are becoming more prominent, raised and red on my left breasts. My armpit also hurts and the left of my left breast is darker than the rest of my breast, it kind of looks like a paint splash that's darker than my actual skin.I have been worrying nonstop about this and today I was inspecting my left breast to see if it's gotten any worse or better and I noticed that my pores are more open than usual, i'm so scared and i'm trying to look on the positive side, and I know its like impossible for someone my age to get inflammatory breast cancer but I feel like my symptoms are kind of close to it. I have spoken to my parents about it and they are carrying me to the doctor but I still want some opinions on this, thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836275",
      "Title": "Really Scared, I'm 14 tiffany0 9764"
    },
    {
      "AuthorID": "tiffany0",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/223594/profile",
      "Content": "Oct 30, 2015 06:13PM tiffany0 wrote: Dad took me to urgent care, they say that my armpit is a pulled muscle and the rash is just a reaction from this soap i was using. Guess I was overreacting about the other stuff since I don't know much about it. Will keep an eye on myself though just to make sure nothing gets worse and just gets better! Thanks :)",
      "MessageIndex": 3,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/836275",
      "Title": "Really Scared, I'm 14 tiffany0 9764"
    }
  ]
}