{
  "AuthorID": "TigerLily4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
  "Posts": [
    {
      "AuthorID": "TigerLily4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
      "Content": "Nov 6, 2008 11:36AM - edited Nov 6, 2008 11:42AM by TigerLily4 I realize this is probably going to sound stupid, but I didn't realize it until I asked the physicist yesterday.  The MammoSite treatment uses Iridium 192.  Traditional radiation uses a high intensity x-ray. It wouldn't have changed my mind about treatment, but did your doctors tell you this before treatment?  I guess I thought everyone got radiation treatment from radioactive materials.",
      "MessageIndex": 42,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "TigerLily4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
      "Content": "Nov 1, 2008 12:05PM TigerLily4 wrote: Am starting my MammoSite radiation Monday, November 3 so I'll be in this group, too.  Mine will be twice a day for five days, 9 am and 3 pm. Thanks for all the helpful thoughts.  I'm lucky to have some aloe plants so I'll plan to just use those leaves rather than trying out a gel. Susan",
      "MessageIndex": 22,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "TigerLily4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
      "Content": "Nov 3, 2008 03:51PM TigerLily4 wrote: Dee Mine is the internal radiation and so far no damage to the skin.  They wrapped up the balloon catheter in gauze, and I was able to wear a sports bra over it without problems.  So far no fatigue, but it's only the first day.  My rad onc thinks I won't have fatigue.  Guess we'll see how the week goes. Susan",
      "MessageIndex": 30,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723320",
      "Title": "November 2008 Rads Group HensonChi Ivy"
    },
    {
      "AuthorID": "TigerLily4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
      "Content": "Nov 1, 2008 03:55AM TigerLily4 wrote: Just like many of those above I have a surgeon, oncologist, and radiation oncologist.  Luckily, mine all work well together and have a lot of experience working together.  My onc and rad onc share a receptionist at the location I go to - I can also have my radiation treatments there.  If I needed chemo, it would also be at that same location.  I chose them partially because they are located only blocks from my house, but mostly because they all came highly recommenced from my internist and from a breast cancer survivor friend who was their patient. Susan",
      "MessageIndex": 9,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/648878",
      "Title": "oncologist? ma27 Seabee"
    },
    {
      "AuthorID": "TigerLily4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74066/profile",
      "Content": "Nov 6, 2008 02:39PM TigerLily4 wrote: My surgeon gave me a prescription for both darvocet and xanax (and I didn't need either of them); and every time I've been to my onc or rad onc, they've asked if I need pain medication.  It seems odd that your doctors wouldn't stay on top of that.  Be very assertive with your medical providers.  Pain will hinder the healing process, and there is no reason to be miserable.",
      "MessageIndex": 5,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723955",
      "Title": "Pain and how this was handled, NOT happy QueenK tigerlili001"
    }
  ]
}