{
  "AuthorID": "tightrope",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161634/profile",
  "Posts": [
    {
      "AuthorID": "tightrope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161634/profile",
      "Content": "tightrope wrote: I don't know what topic to be in!! Recently I was diagnosed with DCIS with possible micro-invasion. The first tumor they found is 4cms, attached to my chest wall in my left breast (I have another 4cm tumor laying right under that one that so far looks benign). that is the one that they found right away. There is another tumor they found on my MRI on my right breast now that looks abnormal and they are sending me for another biopsy this week on it. That one is 1.2 cms. All my lab reports say they believe that I have invasion into my axillary nodes on my left armpit. They tell me that they can't stage anything until I have surgery. I have asked about the lymph nodes multiple times and it seems like my Doctors just ignore that?? The other day they recommened that I have a bilateral mastecomy with immediate reconstruction. But if I have invasion....I can't have that, right?? I can't imagine WHY they would even consider trying to get a person's hopes up if there is no way it can happen or at least looks like there is a chance it won't?? Oh and the invasion appears to be high grade comedo type?? I am so confused. Can someone help me understand this? I have been dealing with this for 2 months now and still going to biopsies, I was diagnosed on the 27th of September. They have cancelled 7 appointments on me. Promised me one Doctor...the second visit he wasn't there and they slipped some moron in on me. I have no insurance so I am forced to go through the county. I feel like I am banging my head on a wall. “Through humor, you can soften some of the worst blows that life delivers. And once you find laughter, no matter how painful your situation might be, you can survive it.”-Bill Cosby Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797149",
      "Title": "So confused? tightrope tightrope"
    },
    {
      "AuthorID": "tightrope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161634/profile",
      "Content": "Dec 3, 2012 05:58PM tightrope wrote: thank you it'sjustme10!  Beesie: yes the paperwork for the biopsy says \"multiple foci of ductal carcinoma in situ including high grade comedo type microcalcifications are present\". they further added \"although no definate invasion can be seen, there are foci of infammatory cells present and microinvasion cannot be ruled out\" They mentioned that my lymphnodes looked to be calcified when I was in there. My armpit is hard as a rock anymore...they swell....but also the glands at my neck swells so badly that you can see them when I turn my head sideways.   (this is what started my search for a doctor as I have had thyroid cancer before all this and was scared it was related to that.) I have had two other reports saying the axillary nodes do not look good as well. The last being this from my MRI \"There are multiple abnormal appearing low-lying left axillary as well as left axillary lymph nodes.\" they had noticed part of them on my mammagram too.  As far as the BMX...I am good with it. My Aunt died in her early 40's from breast cancer (I got my dx the day before I turned 40). I don't know if its genetic or not but if it can lessen my chances of a hard fight down the road...then I am good with it. :) thank you for explaining all of this for me. ",
      "MessageIndex": 5,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797149",
      "Title": "So confused? tightrope tightrope"
    },
    {
      "AuthorID": "tightrope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161634/profile",
      "Content": "Dec 3, 2012 10:19AM tightrope wrote: oh yeah and its e/r and p/r neg. It feels like a rock in my breast...on both sides....but especially the left side. I also get rib pain that is terrible!!",
      "MessageIndex": 1,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/797149",
      "Title": "So confused? tightrope tightrope"
    }
  ]
}