{
  "AuthorID": "tilly3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168544/profile",
  "Posts": [{
    "AuthorID": "tilly3",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/168544/profile",
    "Content": "Jan 26, 2013 07:42PM tilly3 wrote: Hi liz, I am also new to the boards and recently had my first of 4 TC treatments.  I am 8 days out today and doing pretty well so far.  There have definitely been some annoying side effects but all in all I think this is a very doable treatments....which I am so very thankful for.  I am also a stay at home mom of 3 kids, twins daughters in the 6th grade and a little boy in kindergarten.  I was so worried about how I would manage all the things I do every day.  I prepared by making sure I had all the laundry caught up and the house as organized and clean as I could before treatment day.  This was tough because I had a double mastectomy on Dec. 27th and was still recovering.  I did my best and it all worked out.  I also had my husband set up his schedule to work at home for a few days the next week.  My treatment was on a Friday so that I had the weekend to rest without the morning school schedule.  As far as side effects, I only had slight nausea on day 2 and 3 but found if I kept something on my stomach I felt much better.  I felt pretty good on days 4 and 5.  I am getting the Neulasta shot the day after treatment and the worst of the side effects have been the bone pain from that.  That started on day 6 and was pretty bad for 3 days so far.  I did feel some relief today.  I was told to only take Tylenol and Clairitin.  There was a research study done recently showing that the antihistimine in the Clairitin gives relief and it did help me.  I have been able to function and take care of my family as usual but I have edited my daily routine significantly, resting when the kids are at school and only taking care of those chores that are absolutely necessary....laundry, dishes, tidying up.  I'm not pushing myself to take care of any major projects; they can wait until I am 100% again.  Just don't put a lot of pressure on yourself to be superwoman.  This is a time of healing and rejuvenation for you.  I have made sure to stay as active as I can and found that it helps with the bone pain to move around and to stretch whenever it gets bad.  I wish you the best of luck on Feb. 4th.  You will do great!!  Write back if you have any questions.  I am glad to share my experience. ",
    "MessageIndex": 37,
    "PostDate": "26/01/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/695768",
    "Title": "TC Chemo coming up-please share with me mikim auntienance"
  }]
}