{
  "AuthorID": "TillieMae",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51824/profile",
  "Posts": [
    {
      "AuthorID": "TillieMae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51824/profile",
      "Content": "Jun 19, 2008 09:54AM TillieMae wrote: Hello ladies, I signed onto these posting boards a year ago when I first had my bilat mast but was so out of it that today is the first day I'm actually using the site. I'm 52 next month & have not had any recon.   Now I have a slight lymphedema problem in my fingers (I lost 10 nodes on one side).  So I'm putting all my energies into feeling better & I have a fear that recon will be invasive & I don't want to complicate what my body is going thru.   On the other hand, not having recon is a whole trip in itself, especially in our world.  Seeing bra advertisments everywhere I turn is a nightmare for me. When my docs look at me strangely when I say no to recon I add 'well maybe later' because I get uncomfortable.  I really don't know if I'll ever consider recon but, right now I feel better just leaving things alone & seeing if I can accept my body as it is.  Also, when I look to consider recon, the info is a bit overwhelming to me with all the choices out there. What it comes down to is that I really don't know what to do. Someone mentioned tattoos.  Anyone choose that route?  I'm interested in info about it. Good luck to all you gals with whatever choices you make.  It's an individual choice & there's no right or wrong.  Whatever choice we make is the right choice at the time. Tilliemae",
      "MessageIndex": 29,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "TillieMae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51824/profile",
      "Content": "Jun 19, 2008 03:20PM TillieMae wrote: Hi Barbara & thanks for your response & info Yup, support is what I need.  There's support here at home, however, speaking to people on line & in person who have had similar experiences is a different kind of support. I tried going flat at one point.  My hair had barely begun to grow back at the time & I was way self-conscious.  I have some breast forms & they look natural in most of my clothes.  Now that I have some hair I'd like to try to go without the forms & see how I feel.  Right now, I'm not brave enough.  I greatly admire women that are.  Whatever the case, it's not about what we actually look like, it's all about whether we have a negative or a positive body image of ourselves.  I'm working on making mine more positive although I find it difficult. I'll be going on to your Breastfree site.  Thanks again.",
      "MessageIndex": 35,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "TillieMae",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/51824/profile",
      "Content": "Jun 19, 2008 02:56PM - edited Jun 19, 2008 03:20PM by TillieMae",
      "MessageIndex": 34,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    }
  ]
}