{
  "AuthorID": "Tillycat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
  "Posts": [
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 12, 2012 03:45PM Tillycat wrote: That's such great news :-) So glad it's working for you. Hope you get to hang out with reggie and stable boy for a long, long time Mx",
      "MessageIndex": 16,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789002",
      "Title": "Happy Tears Falling Falling! soleil505 Brendatrue"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Tillycat wrote: I've just come back from the local hospital (I gousually go to the Marsden in London but I go to the local one once a month for zometa) and I keep thinking about the really weird conversation that I had with the nurse there. I've never met her before and I think the fact that I didn't even know her made it even more strange. My liver function hasn't been good for ages.  It got better while I was having chemo but they've stopped chemo because I wasn't coping with the SE's and today blood tests showed it's got worse again.  I knew that this was likely to be the case as my eyes and skin have gone yellow, I'm quite itchy and more tired than before. (but still feeling better than when I was on chemo) The doctor suggested that I rang my main hospital and made an urgent appointment to see my oncologist, I did it while I was having my infusion and I'm seeing him next Tuesday.  After the doctor left the nurse came back in to take some more blood.  She asked me how I was and I said fine, then she laughed and said 'no I meant emotionally'.  I said well you know how it is, up and down. She then went on to say the following (it's not word for word because I was pretty shocked but it is what I heard) 'well I think things could go one of two ways, you are young and have a strong heart and kidneys that are working well so your body could compensate for your liver and you could go on for quite a while, but it will be very hard for you and you will have a lot of pain. Alternatively your liver could shut down completely and you will die very soon.  You might not be here by Christmas.  If you were in your 80's I would definitely think that it would be quick but because you are young it might go on for much longer (I think she may have said 'drag on') are you having counselling ? Do your children know what's happening? I looked at her and she looked very upset.  I was so shocked, I laughed and said 'well I wouldn't get to upset, at least it's not happening to you' I'm not sure she liked that because she said 'oh I'm not upset I've had to have this kind of conversation hundreds of times' (I think she missed the bit where she said 'whether they like it or not!!) Having come home and pondered on it I am now thinking how incredibly rude it was of her to decide to talk to me when I hadn't asked - I have a lovely team at the Marsden who answer all my questions and are always completely honest with me (+they have all my details to hand) my other thought, which might be a bit of an over-reaction but she did come across as a slightly mad nurse who might be willing to add something to my iv bag to shorten my suffering.  I don't think I want her anywhere near me again :-( Any thoughts anyone? Should I just ignore it or do you think I should mention it to someone, and if so, who? Cheers Tillycat Live and love each moment. Stage iv since 2009, liver, bone, lung, lymph and brain mets Dx IDC, Stage IV, Grade 3, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796077",
      "Title": "Is this nurse slightly crazy? Tillycat K-Lo"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Tillycat wrote: I've just come back from the local hospital (I gousually go to the Marsden in London but I go to the local one once a month for zometa) and I keep thinking about the really weird conversation that I had with the nurse there. I've never met her before and I think the fact that I didn't even know her made it even more strange. My liver function hasn't been good for ages.  It got better while I was having chemo but they've stopped chemo because I wasn't coping with the SE's and today blood tests showed it's got worse again.  I knew that this was likely to be the case as my eyes and skin have gone yellow, I'm quite itchy and more tired than before. (but still feeling better than when I was on chemo) The doctor suggested that I rang my main hospital and made an urgent appointment to see my oncologist, I did it while I was having my infusion and I'm seeing him next Tuesday.  After the doctor left the nurse came back in to take some more blood.  She asked me how I was and I said fine, then she laughed and said 'no I meant emotionally'.  I said well you know how it is, up and down. She then went on to say the following (it's not word for word because I was pretty shocked but it is what I heard) 'well I think things could go one of two ways, you are young and have a strong heart and kidneys that are working well so your body could compensate for your liver and you could go on for quite a while, but it will be very hard for you and you will have a lot of pain. Alternatively your liver could shut down completely and you will die very soon.  You might not be here by Christmas.  If you were in your 80's I would definitely think that it would be quick but because you are young it might go on for much longer (I think she may have said 'drag on') are you having counselling ? Do your children know what's happening? I looked at her and she looked very upset.  I was so shocked, I laughed and said 'well I wouldn't get to upset, at least it's not happening to you' I'm not sure she liked that because she said 'oh I'm not upset I've had to have this kind of conversation hundreds of times' (I think she missed the bit where she said 'whether they like it or not!!) Having come home and pondered on it I am now thinking how incredibly rude it was of her to decide to talk to me when I hadn't asked - I have a lovely team at the Marsden who answer all my questions and are always completely honest with me (+they have all my details to hand) my other thought, which might be a bit of an over-reaction but she did come across as a slightly mad nurse who might be willing to add something to my iv bag to shorten my suffering.  I don't think I want her anywhere near me again :-( Any thoughts anyone? Should I just ignore it or do you think I should mention it to someone, and if so, who? Cheers Tillycat Live and love each moment. Stage iv since 2009, liver, bone, lung, lymph and brain mets Dx IDC, Stage IV, Grade 3, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796077",
      "Title": "Is this nurse slightly crazy? Tillycat K-Lo"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Nov 8, 2012 03:11PM Tillycat wrote: Thank you everyone. I have gone from being shocked and upset to really cross. How many people has she said these kind of things to? It's awful to think what fear she could be spreading by having these sorts of 'conversations' with other patients. I am going to phone the treatment ward tomorrow and find out who is in charge then I might complain via email as it will mean I can compose what I want to say rather than just ramble on. Do you know almost the worst thing about it was I think she quite enjoyed telling me, it was almost like it was a bit of a bit of a power trip for her (don't think I'll mention that in the email though) Cheers Tilly",
      "MessageIndex": 14,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/796077",
      "Title": "Is this nurse slightly crazy? Tillycat K-Lo"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 13, 2012 03:07AM Tillycat wrote: Hi kita Such inspirational YouTube clips:-) I hope that your team find a treatment that works for you so that you can become NED and start to call yourself a survivor very soon. Hugs Mx",
      "MessageIndex": 8,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789019",
      "Title": "Some inspiration kita bhd1"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 18, 2012 09:59AM Tillycat wrote: Yes I was surprised to read about sheryl's 'benign' diagnosis It would be very sad if it was brain mets but it does seem to be a big coincidence Mx",
      "MessageIndex": 18,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788712",
      "Title": "Celebrities and BC smiley2 DivineMrsM"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Aug 28, 2012 04:59PM Tillycat wrote: My children are 25, 12 and 10 so I hope that they will remember me.  That makes my situation a bit different to yours. Anyhow this is what I have done/am doing ..... I thought that I would do a journal to leave for them to read but I have never done one before and to be honest I don't really think its my 'thing' when I read back what I had written it all sounded very stilted and contrived.  The same was true of the letters I started writing.  I think cards to be opened on special days have the potential to be a  bit weird and could make what should be a happy day much less so.  Also if my DH remarries (and I hope he does) will cards, notes, pressies etc put pressure on his new wife? I want to be remembered but I also want them all to move forward and live there lives in a healthy, positive way. I have put photo albums together for each of them, the albums are quite similar but there is an emphasis on each child in each one.  We have been doing them together and the kids have really enjoyed being involved.  They have even helped me with some of the captions under the photos.  I made sure that there were plenty of pages left at the end so that they could keep adding photos later. We also ended up printing and framing quite a lot of family photos (grandparents, great grandparents, aunts, uncles etc) and putting them up on the wall in the tv room - it has definitely been a source of conversation about our family tree.  I like the fact that this might make them feel like part of a bigger picture. Instead of a journal I have been trying to write some family stories down - each of their birth stories was an easy place to start for me. I have written stories about things that happened when they were younger but I have also written stories from when I was a child.  I am crocheting a throw for each of them.  It gives me something to do when I am having chemo and I find that crochet is very forgiving of mistakes (unlike knitting where all my mistakes stick out a mile)bi like the idea that they can use it to snuggle up in when it's cold and they are skinning out in front of the tv (or out in the garden in the summer here in the uk !) I know you're not a video person and I don't think I am either but I was thinking that I might do a little video clip of me reading one of the family stories to them.  I think it might be nice if they had something where they could hear my voice and see my mannerisms.   If I  try to do a 'i love you so much, I know you are going to grow into a wonderful person' type clip it will just end up being over indulgent and sentimental, which is so not me. I think that covers it :-) I am, of course hoping to have at least another 20 years so that I can turn my small throws into king size bedspreads and hopefully write stories about 'the day you started at university' Mxx",
      "MessageIndex": 15,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792649",
      "Title": "What should I be doing for my young children 4myangels momto2angels"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Tillycat wrote: I am tired, tired, tired My MIL has dementia and is in a care home.  My husband visits  her at the weekend  but wants me to go during the week.  Because I have brain mets I not allowed to drive so this involves me getting taxis.  The home is so hot and stuffy I sometimes feel like I'm going to pass out + so many of the residents there seem to have chest infections, they all cough a lot (I'm having chemo at the moment).  My MIL insists on kissing me, and I don't want to sound mean but her dementia is quite bad now and she seems to have a constantly runny nose which she rarely wipes :-((  I know that she would be horrified if she was aware of this but I think she's beyond that.  Everyone says how terrible it is for her but I sometimes look at her and think that if I could have 81 years of being sharp as a tack I would happily accept having 4 years of gradually loosing touch with reality (see I told you this was a rant - I know I sound really mean) My father has just finished treatment for prostate cancer and he keeps telling me that he 'knows how I feel because he's in the same boat'. His cancer seems to be all gone, I appreciate that you can never tell and it might come back but he is also 80 My mother insists that each treatment I have will be the one that works and says things like 'you'll be all better soon'. She doesn't drive and because my dads not been well he doesn't like to drive so now I have to get another taxi to go and visit them every week as well,  I get regular calls to arrange the day/time that I will be there,  which surprises me because quite frankly I think I am turning into such a mean spirited old bag I wouldn't want to spend a minute in my company,  I  do have 2 sisters and a brother but they have moved away so can only visit a couple of times a year.   So I get the joy of visiting to hear about how tough it is for my dad and how well I clearly am Finally I went and collected a new wig today.  I had it specially made and paid quite a lot for it it.  I decided that I wanted it because I am going to be having my 50th birthday party in 2 weeks time.  I have liver, lung, brain and bone mets.  My liver function isnt great and i am a bit jandiced  as i said i am currently on chemo so everything feels a bit tough.  However i thought 'ok I can do this' so I got a train and a taxi and travelled across London (the wig making place is about 2 hours away) Anyway when I got there it was fitted and then trimmed into a nice style.  I had to have this rediculous conversation with hairdresser which went along the lines of - are you having chemo at the moment? Yes, that's why I'm bald When will it be finished? Well it won't ever really finish because I have secondaries But when this chemo is finished will you be better? Err no not really This is a great wig it should last you several years if you treat it carefully  Oh well it might outlive me then (I think he finally stopped at that point and I was able to ask him about his holidays!!) Didn't exactly cheer me up, maybe other women like to talk about their treatments? Anyway at least the cut was good and I think the wig looks lovely.  So then I trek back across London and get home feeling utterly exhausted.  Then the final straw was when the woman who is looking after my younger children (10 & 12)  is standing in the kitchen, I walk in and say hello she turns to me and says 'oh you've got a new wig, I prefer the short one you had before'  ( I should point out that the previous one  was a very cheap, synthetic, barmaid blonde and cost about a tenth of this one ) I hadn't asked her opinion and to be honest I didn't really want it.  She has hair down to well past her waist which she is very proud of.  I said well that's a shame cos this one cost a lot more.  Then after she left she sent me a text which said 'sorry about the wig thing.  You always look lovely, I just preferred the shorter one on you'........  Grrr . I am probably expecting too much because this is the same woman who told my eldest daughter (who's 25 but still very scared about losing her mum) that she was glad she was able to help 'care for me' as her aunt had died of breast cancer and she felt she had learned a lot from the 'experience' I think we need a new childminder,  my husband says I should ignore her because she is reliable and we have so many hospital appointments we need someone to look ater the younger 2 children  I just want her to go away :-( Anyway can't sleep because of the dex.  Maybe things will seem better tomorrow Mx Live and love each moment. Stage iv since 2009, liver, bone, lung, lymph and brain mets Dx IDC, Stage IV, Grade 3, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792843",
      "Title": "Sorry - this is a rant Tillycat marywh"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Tillycat wrote: I am tired, tired, tired My MIL has dementia and is in a care home.  My husband visits  her at the weekend  but wants me to go during the week.  Because I have brain mets I not allowed to drive so this involves me getting taxis.  The home is so hot and stuffy I sometimes feel like I'm going to pass out + so many of the residents there seem to have chest infections, they all cough a lot (I'm having chemo at the moment).  My MIL insists on kissing me, and I don't want to sound mean but her dementia is quite bad now and she seems to have a constantly runny nose which she rarely wipes :-((  I know that she would be horrified if she was aware of this but I think she's beyond that.  Everyone says how terrible it is for her but I sometimes look at her and think that if I could have 81 years of being sharp as a tack I would happily accept having 4 years of gradually loosing touch with reality (see I told you this was a rant - I know I sound really mean) My father has just finished treatment for prostate cancer and he keeps telling me that he 'knows how I feel because he's in the same boat'. His cancer seems to be all gone, I appreciate that you can never tell and it might come back but he is also 80 My mother insists that each treatment I have will be the one that works and says things like 'you'll be all better soon'. She doesn't drive and because my dads not been well he doesn't like to drive so now I have to get another taxi to go and visit them every week as well,  I get regular calls to arrange the day/time that I will be there,  which surprises me because quite frankly I think I am turning into such a mean spirited old bag I wouldn't want to spend a minute in my company,  I  do have 2 sisters and a brother but they have moved away so can only visit a couple of times a year.   So I get the joy of visiting to hear about how tough it is for my dad and how well I clearly am Finally I went and collected a new wig today.  I had it specially made and paid quite a lot for it it.  I decided that I wanted it because I am going to be having my 50th birthday party in 2 weeks time.  I have liver, lung, brain and bone mets.  My liver function isnt great and i am a bit jandiced  as i said i am currently on chemo so everything feels a bit tough.  However i thought 'ok I can do this' so I got a train and a taxi and travelled across London (the wig making place is about 2 hours away) Anyway when I got there it was fitted and then trimmed into a nice style.  I had to have this rediculous conversation with hairdresser which went along the lines of - are you having chemo at the moment? Yes, that's why I'm bald When will it be finished? Well it won't ever really finish because I have secondaries But when this chemo is finished will you be better? Err no not really This is a great wig it should last you several years if you treat it carefully  Oh well it might outlive me then (I think he finally stopped at that point and I was able to ask him about his holidays!!) Didn't exactly cheer me up, maybe other women like to talk about their treatments? Anyway at least the cut was good and I think the wig looks lovely.  So then I trek back across London and get home feeling utterly exhausted.  Then the final straw was when the woman who is looking after my younger children (10 & 12)  is standing in the kitchen, I walk in and say hello she turns to me and says 'oh you've got a new wig, I prefer the short one you had before'  ( I should point out that the previous one  was a very cheap, synthetic, barmaid blonde and cost about a tenth of this one ) I hadn't asked her opinion and to be honest I didn't really want it.  She has hair down to well past her waist which she is very proud of.  I said well that's a shame cos this one cost a lot more.  Then after she left she sent me a text which said 'sorry about the wig thing.  You always look lovely, I just preferred the shorter one on you'........  Grrr . I am probably expecting too much because this is the same woman who told my eldest daughter (who's 25 but still very scared about losing her mum) that she was glad she was able to help 'care for me' as her aunt had died of breast cancer and she felt she had learned a lot from the 'experience' I think we need a new childminder,  my husband says I should ignore her because she is reliable and we have so many hospital appointments we need someone to look ater the younger 2 children  I just want her to go away :-( Anyway can't sleep because of the dex.  Maybe things will seem better tomorrow Mx Live and love each moment. Stage iv since 2009, liver, bone, lung, lymph and brain mets Dx IDC, Stage IV, Grade 3, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792843",
      "Title": "Sorry - this is a rant Tillycat marywh"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Aug 21, 2012 03:18AM Tillycat wrote: I watched 'Miranda' on DVD a while ago, uk series - really made me laugh Mx",
      "MessageIndex": 13,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792271",
      "Title": "Stupid bloody neuts... alesta29 Brendatrue"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Sep 13, 2012 09:52PM Tillycat wrote: Hi soleil Good luck for today. It seems daft to suggest that an allergy to one thing could mean an allergy to everything. I am allergic to metaclopramide (sp?) and codeine, does that mean I too might be allergic to all other drugs/chemos? That's just silly!! As far as the sirt procedure is concerned, it's been around for a long time for liver mets from colon cancers, it's only been in the last couple of years that they have been using it on liver mets from BC. I would be cautious about waiting to long before having a consultation about the procedure. If (or when) the mets start to affect liver function you may not be eligigable for treatment any more. Because it's quite hard on you liver everything has to be working well for them to be happy to proceed - I know this because at the moment they won't consider me because my liver function is not good enough - really wish I'd pushed for it a bit sooner :-( Mxx",
      "MessageIndex": 53,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793326",
      "Title": "Holding my breath and trying not to worry soleil505 soleil505"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 10, 2012 06:06AM Tillycat wrote: I also out here hoping that you get your biopsy soon and it turns out to be b9. I've had a number of scares with possible lung mets. The very first ones they found were from pneumonia that I had when I was a trainee teacher years ago. They found some more 'possible mets' that turned out to be from a more recent chest infection (those have pretty much disappeared. My favourite was the 'large shadow' they found at my local hospital this weekend - that was my implant from the reconstruction!!! I do have lung mets (diagnosed last year) but they have show the same pattern as the other mets, very small and scattered and fairly slow growing, my onc describes them as arriving in a 'shower', this is how they appeared and behaved each time. Hopefully the fact that this 5cm mass is so different means that it is something other than cancer. Mx",
      "MessageIndex": 15,
      "PostDate": "10/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788868",
      "Title": "5cm mass in lung!!! NOOO tammie Tweety2358"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Aug 17, 2012 08:38AM Tillycat wrote: I am so sad for you and your children.  There are probably no words that can make things easier for you or to help you deal with what has happened. I am glad that your children have such a loving father to be with them and care for them, they must miss her terribly as well.   They need you to be there for them.   You do need to look after them but you need to look after yourself too.  Do you have any other family who could come to visit and you would be comfortable spending some time with?  Are their any support groups you could go to?   You sound so sad (of course you are sad how could you not be) it makes me want to cry for you, it also makes me realise how my husband will feel when I am gone.  I don't want him to be lonely and sad in the evenings but I don't know how to plan to make it better for him. Please don't unsubscribe to this forum just yet - you could start a new thread in the stage iv or 'in memory' sections and introduce yourself,  I think you will get some caring, helpful responses.  They won't make the pain go away but you might find something for you in there Sending gentle hugs your way Mxx",
      "MessageIndex": 675,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Oct 7, 2012 03:49AM Tillycat wrote: Hi daughter Your mum may find that she is able to have a ct scan if she uses her morphine but asks the doctor to add in some Ativan or lorazepam (similar to Valium but much quicker to wear off). Sometimes just feeling calmer can help Tillycat",
      "MessageIndex": 828,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Sep 1, 2012 06:47PM Tillycat wrote: Thank you so much for all you lovely kind posts.  I knew you would understand. I felt better just for writing it all down I spoke to my DH today and told him how uncomfortable I felt about infection and visiting my MIL.  He suggested that I leave it until after I had finished chemo - I was a bit taken aback because I had assumed that it was really important to him,  shows that I should have talked about it before rather than just gone all martyrish about it  I am going to take your advice and be a bit firmer with my mum as well. I know she likes to see me because she worries about me but  I might suggest that I just go on my my week off from chemo ( which is every 4th week) As far as the child minder is concerned, the kids are back at school next week so I only need someone for pick ups or drop offs when I have hospital appointments.  I'm going to keep my eye out for someone else but I guess as long as she's not mean to the kids the best thing is to ignore her insensitive comments I am feeling much better even after only 24 hours, I think having lots of caring comments from you then talking to hubby and feeling like he was on my side has made a big difference Thank you again Melissa / tillycat xx",
      "MessageIndex": 23,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792843",
      "Title": "Sorry - this is a rant Tillycat marywh"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Oct 9, 2012 07:26PM Tillycat wrote: Yay! Well done you :-) Also great news about tumour markers Tillycat xx",
      "MessageIndex": 17,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794699",
      "Title": "Do not adjust your set - normal service is being resumed..... alesta29 lulubee"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 2, 2012 03:55PM Tillycat wrote: Oh karkar I am so sorry to hear that your cancer just keeps progressing despite all these Rotten treatments.  I have bone, liver lung and brain mets and I am plodding along living one day at a time.  I have quite young children so for me the longer I can be around the better - even if it means they only see me in bed or on the couch, i know a lot of mums who would feel the same way but i also know people who have all sorts of other things they want to live for, their oh's, family, friends, pets, or even (and perhaps most importantly) for themselves.  I don't think that the side effects from my various chemos have been as bad as yours.  You're not being a wimp.  Everyone responds differently and it sounds as if you have had some really tough times with chemo.  You don't say if your cancer is hormone sensitive - are there any hormonals that you can try?  They are sometimes gentler than chemo.   Alternatively  Xeloda (capecitabine)  is a chemo that some women find easier to deal with, especially if it is given at a lower dose. If you do decide to continue with more chemo then maybe you could speak to your team and be very clear about the SE's you are suffering from.  If they don't know the details it's hard for them to help.  Often there are things they can that can make a big difference, it's worth it to keep complaining until they sort it out.  Steroids might make you less tired, different anti nausea drugs can work better for different people,  vit b12 sometimes helps with neuropathy.   Some people find complementary treatments (reiki,  meditation, aromatherapy, homeopathy) really help with SE's - I have tried all of the above and they have all helped me at different times  :-) Finally lots of women in our situation take anti depressants.  I was really against the idea initially but I do think that if they enable me to enjoy the remainder of my life then, what the heck! Some use marijuana instead of conventional anti depressants but I'm afraid I have no idea how to get hold of that so its not an option for me! I know of a few people who have reached the end of the line with chemotherapy treatments and have decided to just have palliative care instead.  All of them knew that it was the end of the line for them.  For some it was after a few weeks for others it was months. Personally I do not know of anyone who has lived as long as 12 months after declining further treatment, although there are always stories of people who stop all treatment and live for many more years.   Everyone I know who chose the palliative care route was well cared for and did not feel significant pain.  They seemed to be able to get pleasure from their days, often small things, sitting in the garden,  visits from family and friends.  They were not generally able to get out and about much, take holidays or do trips but they seemed content to stay close to home. I hope that we will all know when enough is enough.  My palliative care nurse says that the most likely thing for me is that my liver function will get to bad for me to be able to have any more chemo.  In some ways I think that's good because it will take the decision out of my hands. Love Melissa ",
      "MessageIndex": 5,
      "PostDate": "02/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788494",
      "Title": "When to stop chemo? Karkar62 ma111"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Aug 23, 2012 08:30AM Tillycat wrote: Thank you for this post It sounds as if its been a tough but you did it :-) Makes me feel like I can and will keep going too Mx",
      "MessageIndex": 10,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792404",
      "Title": "It's my FIVE year metsiversary! 33skidoo Swannay"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 18, 2012 01:38PM Tillycat wrote: I would be a bit worried about a guinea pig as I have a friend who has had 3 and they all died quite young. I don't think they were I'll treated, they just don't always have long lives. Her kids were terribly upset. She now has a small dog (a bit like a pug ) it was an adult when she got it and it has fitted into the family really well. I think if you are worried about the puppy stage then an adult would be a good idea and if you are worried about steps then a smaller dog will be easier to carry. I never had dogs before but after my diagnosis of mets I asked my husband if we could get one (I'd always wanted one but there was always a good reason to wait). We got a small chocolate doodle. I know that he may out live me but I love him so much, he has added to all our lives in so many ways. He gets me out the house when I've got a bit of energy, sits by me when I am tired and keeps the kids company whenever they let him :-) Mx",
      "MessageIndex": 10,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/789258",
      "Title": "Help with getting a new pet crystalphm cowgal"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 4, 2012 02:03PM Tillycat wrote: I've always had cats but Tilly is the first cat that we got when my oldest daughter was little. Tilly has died of old age since, but the kids often used this name as their password for the children's websites they like - so it always makes me think of family when I see it. Melissa",
      "MessageIndex": 52,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788005",
      "Title": "Maybe I'm just nosey... LouiseBogle SuperFoob"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Jun 6, 2012 04:25PM Tillycat wrote: I once went 8 weeks between zometa infusions and felt that the pain was almost unbearable. My onc said that it was unlikely due to the missed infusion but I felt so much better after I finally had the dose I'd missed. I always make sure that I get it on time now. I sometimes get twinges a few days before my appointment- and it reminds me that I am due to go. My nurse tells me that quite a few women report pain before they are due for their next infusion. She says that no one really understands why it seems to happen. There haven't been any studies into it. So I have no proper data based info, only my experience but I would say yes it may well be simply lack of zometa Mx",
      "MessageIndex": 1,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/788696",
      "Title": "In serious pain/ Zometa question tammie ibcmets"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Aug 23, 2012 10:52AM Tillycat wrote: (((soleil))) Such rubbish news re progression. You only need one tx to work - then you can have weeks/months without worrying about your bucket list. Maybe the one for you will be the next one or the one after that. Your onc sounds like he still has a plan. You have always sounded like you get such pleasure from your business. I really enjoy reading your posts about it. Please don't rush into giving it all up just yet. Hugs Melissax",
      "MessageIndex": 34,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/792410",
      "Title": "scans not good ....progression. Guess I have to to plan Q soleil505 vickib"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Oct 8, 2012 02:09AM - edited Oct 8, 2012 02:10AM by Tillycat Hi lorieg I have also had shortness of breath from taxol. I was told that it was a common SE. After my last chemo the SOB got worse and worse, but I ignored it thinking that it was just part of the treatment. I started having pain in my ribs, which I initially put down to the bone mets, but eventually it got so bad that I phoned the hospital and they told me to come straight in (@5am) they did a CT scan and found 2 pulmonary embolisms (emboli?) only one was causing pain - apparently they don't always hurt. They larger one was the one that wasn't causing the pain but mainly responsible for the shortness of breath. I was told that as many as 1 in 10 cancer patients on chemo can have one. it probably is just a SE but maybe If your SOB gets worse you should be asking for an x ray/CT scan Tillycat",
      "MessageIndex": 7,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/794599",
      "Title": "Taxol and breathing lorieg lorieg"
    },
    {
      "AuthorID": "Tillycat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/152310/profile",
      "Content": "Tillycat wrote: Hmm Got all my results back for brain mets today ........ The biggest one in the cerebellum is growing again and there is quite a lot of swelling around it + I have 6 new small mets. The prof recommends retreating the big one and at the same time zapping the six smaller ones, so I am booked in for more gamma knife the week after next.   The problem with retreating an area that already has swelling is that the swelling often gets worse so I will be monitored closely for 3-6 months.  If swelling gets bad then it's off for surgery (craniotomy?) to relieve the oedema and hopefully get rid if the last yucky dead bits of the big tumour. Prof thinks we might as well try gamma knife on it as he wants to zap the little ones anyway.  I am all for avoiding brain surgery if I can :-} Pet scan showed 'not much activity' in the area where there is oedema.  'What does that mean?'  I said.  I't shows you aren't using that part of your brain' - well I could have told him that!! I stopped using most of my brain as soon as I had my oldest about 25 years ago!!! :-) (not that I begrudge her that) Mxx Live and love each moment. Stage iv since 2009, liver, bone, lung, lymph and brain mets Dx IDC, Stage IV, Grade 3, 0/16 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/789336",
      "Title": "Today's brain scans Tillycat Brendatrue"
    }
  ]
}