{
  "AuthorID": "Timbek2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
  "Posts": [
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Apr 26, 2013 05:50PM Timbek2 wrote: I had pet scan. It was an easy test. Also had breast MRI. That showed my lymph node. Also had muga. Twice. Totally not a big deal. Lay down and pretend you are on a beach somewhere. The testing phase is overwhelming but it's really not bad at all. Hang tough. We did it. So can u. Xo. Best wishes to u.",
      "MessageIndex": 3,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/803872",
      "Title": "PET Scan? BoatinGirl anneflorida"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Jun 19, 2013 11:43PM Timbek2 wrote: Just wanted to say that I'm sorry you have to join us. We have all been down the path and are here to tell about it. If God brings you to it He will bring you through it! It's a great opportunity to live your faith for your kids and watch it grow. He has carried me this past year. Hang in there! We are all here for you!!!!",
      "MessageIndex": 11,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/806411",
      "Title": "My daughters tears are killing me.... soccermomof4 lekker"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Sep 23, 2012 04:03PM Timbek2 wrote: I had my surgery August4th.  I was terrified beforehand as well.  I had never had any type of surgery prior and then had to be under for 6 hours with bilateral and immediate reconstruction.  I barely remember being in recovery and do remember seeing family in my room.  I stayed in the hospital 2 days.  Mainly had some nausea issues from anesthesia.  I have a sensitive tummy.  The first week home was roughest but every week I got stronger and felt better.  My drains came out in a week which was awesome.  You can do it!  It's  not fun but it is manageable and you are a strong woman.  Will be praying for a quick and seamless recovery.  God bless you! I got my path report later that week.    Becki ",
      "MessageIndex": 3,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/793947",
      "Title": "September 29th Surgery staystrong1 Leah_S"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Mar 1, 2014 11:00PM Timbek2 wrote: this was me at my last chemo 1/31/13 and then a year later!  Today I am at the gym several days a week and running around like a crazy mom of 3 again. I also take biotin I purchase at Costco specifically for hair n nails. The hair started as white fuzz then came in dark my natural color. Just wanted to encourage everyone that more hair is in your future!!  Hugs n strength! ",
      "MessageIndex": 20050,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Mar 18, 2013 08:17AM Timbek2 wrote: Hi. Wanted to wish you well. Similar diagnosis as yours. Finished chemo now plowing thru rads. I have kids your kids ages too. It's scary. No doubt about it. Just take it in chunks. You are thru surgery. Then you will conquer your chemo and then the rads. Its like artillery coaster ride and daunting from the start but you will be ok. Sending hugs n prayers your way. Sorry you have to join us. God bless you. Becki",
      "MessageIndex": 84,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/800669",
      "Title": "Stage 3? LKSHER LKSHER"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Mar 2, 2014 10:25AM Timbek2 wrote:  This pic shows me prior to having surgery/chemo/rads and then the second one is about 5 months after finishing chemo. Since it was summer I ditched the wig early. My husband encouraged me and said nobody knows what you've been through. It's so true!  My hair is very curly now and I have to straighten it. It wasn't before. I'm so sorry Septmom and every other woman who has to take this path!  But I am thankful to be here to reach out to others and celebrate each day that I get. There is hope!  Hang in there. :)",
      "MessageIndex": 20055,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Apr 1, 2013 11:14PM Timbek2 wrote: I'd like to jump in here. I'm on the downhill. 19/28. These last two weeks seem the toughest. I have my implants in so am afraid of the rads destroying them and needing further surgery. Today's rad got cancelled due to machine issues. His is the second cancelled. Anyone else have such problems. It's mentally exhausting and the fatigue is really setting in. Best of luck to everyone!",
      "MessageIndex": 51,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "May 25, 2013 10:56PM Timbek2 wrote: On my mammogram last year it showed micro calcifications which were not there from my baseline. After a diagnostic mammogram the radiologist recommended I have it biopsied. I believe 80% are benign at that stage. Don't assume the worst and keep us posted! Hugs!",
      "MessageIndex": 1,
      "PostDate": "25/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/805204",
      "Title": "Xtra pics at mammogram? cindee56 cindee56"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Apr 2, 2013 09:13PM Timbek2 wrote: Thankful machine worked today. Fatigue setting in this week. Nurse suggested Benadryl for itching. Only using miaderm and aloe. Skin pink and itchy. Just so ready to be done. Kids in spring break. Not having much fun. ;(",
      "MessageIndex": 63,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Feb 21, 2013 03:03PM Timbek2 wrote: Saying a prayer for you today Raineyb.  So sorry that you are going through this.  Just wanted to lend my support and for you to know that we care about you and your continued good health.  I have a 7 year old daughter so I understand about wanting to be here for her.  You are most likely going to find out that you are completely fine!  But in the event that there is something, you have caught it early and are young and can fight!  Please don't let fear keep you from finding out the results so that you can move forward.  God bless you today and always! Sending virtual hugs! Becki",
      "MessageIndex": 23,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Feb 22, 2013 10:59AM Timbek2 wrote: I had to come back and check and thankful for the great news!  Rejoicing with you!!!!  Celebrate life!  It's a gift! Becki :)",
      "MessageIndex": 35,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800712",
      "Title": "i have microcalcifications and I am sick with fear Raineyb Irishwfl"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Feb 14, 2013 07:58PM Timbek2 wrote: I will give my two cents worth.  I have not been tested but assume I have a genetic trait as I'm third generation BC.  I am 40.  I did BMX and while I wish I hadn't (since I miss the old me) know in my heart that this is what I had to do.  My 40 year old mammo found it and it had already spread to my lymph nodes.  If yours is not in your nodes, you will not have to expose yourself to radiation if you do BMX.  Also, you won't have to worry about it growing in the other breast and spreading to the nodes down the road.  So to me that alone is a good reason!  But it is a very huge and personal decision.  My youngest is 7 and i wanted to be as aggressive as I could do eliminate the risk of future reoccurance.  Best of luck in whatever decision you make! Becki :)",
      "MessageIndex": 3,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800483",
      "Title": "BRAC2+/DCIS not convinced to do BL Mastectomy Jojogal123 Aditi321"
    },
    {
      "AuthorID": "Timbek2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/159420/profile",
      "Content": "Nov 4, 2012 02:29AM Timbek2 wrote: Thank you for hope! Just diagnosed at 40. Looking forward to celebrating at 45! Celebrate you!! You deserve it! God bless!!!",
      "MessageIndex": 1,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/795888",
      "Title": "I turned 45 ! Karina kathleen1966"
    }
  ]
}