{
  "AuthorID": "Tinkerbell9…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
  "Posts": [
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Nov 4, 2009 07:16PM Tinkerbell99 wrote: ihatescreenames...i am so so sorry..hugs to u!!! Plez keep us posted!!! U r in the right place!!!",
      "MessageIndex": 20,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742981",
      "Title": "Anyone who had a similar situation can you share your story? ihatescreennames whatisthis"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Oct 30, 2009 03:22PM Tinkerbell99 wrote: hi, i am 47 yrs old & ever since i was 40 i have been going for mamos & each time they do an ultrasound too & they always find something.  i have had several lumptecnectomies & biposies.  They have been all \"benign\" but i do have high risk..i have abnormal cells & lots of density...this does NOT mean u'll get cancer, it just makes it high risk.  After dealing w/ this for so many yrs i have decided to have a masectomy.  I do not want cancer & i truly believe i will get it. please hang in there...many times the lumps are  benign & r cysts.  if i can be of any more help, let me know.",
      "MessageIndex": 13,
      "PostDate": "30/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742981",
      "Title": "Anyone who had a similar situation can you share your story? ihatescreennames whatisthis"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Nov 3, 2009 07:08PM Tinkerbell99 wrote: this is a great idea . how wonderful",
      "MessageIndex": 13,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742617",
      "Title": "Heart-Shaped Pillows choca1711 SLL101984"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 2, 2010 09:41PM Tinkerbell99 wrote: Hi again, went to 2nd opinion & i trust this dr...he agrees w/ my PS :( he doesnt think i have an infection, sometimes there is redness..maybe i a have small underling infection but at this time i have a few options..i can remove the implants now ...i can get another MRI w/ them taking a sample of fluid to make sure ..but he doesnt recomend it....i can try muscle relaxers & see if that helps if in amonth it odeant then take em out & wait 6 months to a yr b4 starting w/ TE. I am not a happy camper now..i feel like i am crazy...i wish i never did this surgery........so i may or may not have an app w/ my PS 2morow that was scheduled a while ago.......so i guess its a wait & c thing now ...unless anyone here has any recomendations.....but i doubt anyone here does. Has anyone here had  them taken out & started again or not & still had pain?  or thought abt it having the implants removed? thx for letting me share here..i am sitting here crying just thinking abt it all",
      "MessageIndex": 241,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 14, 2010 12:22PM Tinkerbell99 wrote: another article i found: has anyone ever heard of this injection & tried it? http://www.ncbi.nlm.nih.gov/pubmed/20085178 Altern Ther Health Med. 2010 Jan-Feb;16(1):54-9. A series of case reports: clinical evaluation of a complex homeopathic injection therapy in the management of pain in patients after breast cancer treatment. Orellana Alvarellos G, Ruiz de Viñaspre Alvear P, Kaszkin-Bettag M. Center of Obstetrics and Gynecology, Ginesia SA, Providencia, Santiago de Chile, Chile. OBJECTIVE: In breast cancer patients, posttreatment pain often appears after several months and strongly impairs health-related quality of life. Conventional methods of pain reduction are often ineffective. Injection therapy with Traumeel (Heel GmbH, Baden-Baden, Germany), a medication with analgesic properties used in homotoxicology for treatment of the pain associated with trauma as well as a mediator of inflammation, was proposed as an innovative approach for pain relief after breast cancer treatment. DESIGN: Nine patients, still suffering from a high level of pain after breast cancer therapy despite use of postoperative treatment with conventional analgesics, were invited to participate. A Traumeel and procaine injection was administered once a week for three to 10 sessions. The level of pain was assessed by a pain score and physical and psychological status by a questionnaire before and directly after injection and again at follow-up visits after 3 and 6 months. RESULTS: After the last injection, all patients experienced a marked reduction of their level of pain on average from 7.6 +/- 1.5 to 2.4 +/- 1.4 points on a scale from 1 to 10 points. After a followup observational phase of 3 and 6 months, pain score ratings increased slightly again in some patients but remained consistently low in others. In any case, the ratings of pain levels did not reach the values assessed before the start of Traumeel injection. Similarly, health-related quality of life improved with this injection therapy. The perception of pain relief with Traumeel injection was high in 8 of 9 patients, reflecting an overall perceived positive outcome and tolerability of this treatment. CONCLUSIONS: This case series represents a first encouraging approach to using this complex homeopathic injection for pain relief in breast cancer patients.",
      "MessageIndex": 296,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 14, 2010 12:49PM Tinkerbell99 wrote: Welcome To PainAid! Welcome to PainAid, the American Pain Foundation's interactive online community. You will need to register for a free login to use our chats and discussion boards. The require separate registrations and logins, but you may use the same username and password, if you'd like. Click here to register for chats. Click here to register for discussion boards. Here you'll find: Topics range from illness-specific pain, traditional and complementary treatments, to depression and family matters, to financial issues such as disability and workers compensation. This free service is an online forum for people living with pain, and their caregivers. It is staffed entirely by highly qualified volunteers with a range of backgrounds, all of whom either live with chronic pain or care for people who do. PainAid Mission Our mission is to provide both discussion boards and chat (or conference) rooms for the purpose of educating both those who live with chronic/acute pain and for those seeking information and first-hand accounts of what all who live with chronic pain must endure. Your peers provide support, information, and self-advocacy ideas. In addition, we have a growing group of healthcare professionals who have volunteered their time to respond to questions, provide general information, and identify where and how users may be able to locate more detailed answers. No PainAid staff person, including healthcare providers who treat pain, will offer medical or legal advice. Finally, the message board and chat rooms are also available for use as a source of camaraderie, making new friends, and establishing new connections with others you have met in the past. Navigating PainAid If this is your first visit to PainAid, please review our Guidelines and Disclaimers/Privacy Policies, which cover all the rules that apply while you are using this site. PLEASE read through it as you must accept all terms before beginning. Our schedule for our Conference Room chats describes the day and time of each scheduled chat. PainAid staff will moderate all scheduled chats. We also offer healthcare professional guest speaker groups throughout the week and special topic chats throughout the year. Please check the event calendar for a snapshot of the day's or month's chats. Our message boards include a wide range of specific forums with many sub-topics when appropriate. We devote discussion forums for each expert who interacts with PainAid visitors. Links will be found throughout PainAid to assist you in locating a specific resources. © 2002 - 2007 American Pain Foundation 201 North Charles Street, Suite 710, Baltimore, Maryland 21201-4111 A 501(c)3 nonprofit organization.",
      "MessageIndex": 297,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Apr 3, 2010 12:56PM Tinkerbell99 wrote: Hi ladies, so b4 i have my revison surgery i want the bestest of the articles to send to my Dr & send & give to other DR's about post pain. I know i have read a few..but can anyone want to stay overnight. suggest some that is hould send & give to my dr's. I also want to show my dr the anesthia article & how that has helped women have less pain...i told him i want it in the hospital (the surgery ) & i want to stay at leaST overnite & i want him to have the pain mang dr/nurses there on my case right AWAY!! This time i will be prepared!!! now i have been on robaxin & i dont feel much of a difference, does anyonehere know if flexeral is better? I also mentioned a whil back abt the anti inflamatory patch ...someone here said they uded it..do u know the name of the patch u  used? I am having trouble w/ my insurance comapany getting a pre authorization .. hugs to all!!",
      "MessageIndex": 354,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 1, 2010 07:04PM Tinkerbell99 wrote: hi again...wow me posting twice in 2 day ..but i am NOT Crazy after all!! i went to my PT & he wouldnt touch me..he sees redness & feels heat & feels that if he moves me arnd & there is an infection it could go into my blood stream. he is glad i am seeking a 2nd opinion....he is writng a letter to my PS & telling him this!! Yay i am not crazy..i know this may mean more hospitals, antibotics or even having the implants removed..but i am NOT crazy!!!  He thinks i shouldnt feel this kind of pain after feeling better...usually that wouldnt happen unless somethings wrong he also felt the PS should of given me something for my stomach for the antibiotics & maybe even muscle relaxers..he understands not pain med (which i understood too) but muscle relaxers....so we will c what happens tomorrow. Now my big question is i need more caRE do i stay w/ my 2nd opinion or go back to the one who did my surgery? any thoughts?",
      "MessageIndex": 232,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 4, 2010 05:30PM Tinkerbell99 wrote: hi everyone.....thank u for ur support..has anyone here ever considered having your implants removed? This would be my last resort..just curious... i think if we all continue here & maybe if there is a way to write to even OPRAH!!! We need to get the word out abt this. I know drs think we shouldnt have to much pain meds b/c of adddiction ..but let them live with this pain!!!!",
      "MessageIndex": 260,
      "PostDate": "04/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 13, 2010 01:19PM Tinkerbell99 wrote: quick update on me..saw PM dr & he gave me stronger f what i am taking now & not much help..:( we'll see whaT HAPPENES WHEN ALL this mositure leaves..my breast is swollen on the side that my arm when i type can feel it...does that happen to anyone else here? Even my \"good\" side has been bugging me & painful last nite... seeing PT 4 my shoulder blade b/c my breat stuff seems to be effecting it...:( it hurt like hell so between the  mositure & p/t yesterday I am in agony today...i am praying that once he can loosen up my hslder blade it will help my breast,. being back @ work is gr8 emotionally..physically not so sure   i'll keep u updated!!",
      "MessageIndex": 287,
      "PostDate": "13/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "May 12, 2010 09:30PM Tinkerbell99 wrote: a woman on another bd posted this & i am trying 2 help her..maybe someone can PM her!! Thx..also can someone please tell me where the survery is abt pain & MX Ter wrote: Hi its mid early may 2010 and I havent written in long time...well I did write, a long post, then poof It all went kurplunk!, so I gave up..and I now want to write about what is going on w/me now, as I am having tons of problems in my stomach, they have found tons of lymph nodes thru my gastronologist, and my onc, wasnt too happy, and normally i see him every 6 months for tons of test in tubes etc....he checked me out throughly, and somehow I can see and read his mind, as at the beginning I did not like him, then I spent alot of time thinking of what he has to deal with, from telling someone they have BC, to how many months if that they have left, no wonder he has so much on his mind... Please tell me where to post, as so many things and I dont know where to post as Im a stage 4, have had 2 masct's, one each year, from 04, and one in 05, then mets in 06, and now I have had these stomach problems in my lower R quadrant, I thought it might be my appendix, but after being passed around ffrom dr to dr, and test and test, im so sick of it, Im ready to actually give up, as i have no energy, lots of problems and past week the stomach pains since NOT appendix, are in my L side, like coming from my mets in hip. Im so sick and tired of trying to fight this battle, and I also as some of you know I have fibromyalgia, which is SO bad, even my onc mentioned as he looked at my feet and touched alot of areas, as my fibro is everywhere...plus I have RSD in my L foot, and I cant get around, let alone get to the grocery store, let alone cook...my stomach cant stand looking or smelling foods, I cry alot, and i was suppose to start H20 warm water therapy for my pains 3 X week..which each time Im suppose to go, something else takes its place.... I dont want to keep on going, though I finally got my son who is 28 and at home, he is a big help, as though he hasnt been able to talk about my cancer, but last week we got into a big whopping arguement, and I kind of won, as i told him I think he needs to know what is going on with me, he fought it, as he has led a hard lift, and now after many years of school, he got his certificate, and on that day he was laid off w/the rest of the guys...so he is trying to find any kind of work....he even brought home a dog, she is so sweet, she is a pitt bull, but I havent seen any bad things about her..she has been passed around from owner to owner, and here, we just love on her and she is so happy, she is a bit overweight, and loves this content home where no yelling etc takes place..she comes in my room to check on me...I wanted a dog but knew I couldnt take care of one, as I cant take care of myself...I have a mom who is in a rest home from a stroke, and it takes me having a half way good day, and tomorrow being Mothers Day I have to go..I use a walker, and have a wheel chair, as my ortho told me to have one, as he said \"remember, if you walk somewhere, remember you always have to turn around and come back. Please help me, as I really dont want to cont to go on w/these test or being told anything....I do take my cousin who is or was an RN as she has ?s for the doc, which is good as my brain is almost zilch...Im by myself, and feel so so alone.... Please tell me where to post this and other things that are on my mind ..Im putting it in my fav in my home site..but tell me where i should put it. thanks so much hugs Ter, and yes I have a new picture I stay in contact with a few by email from as it said i joined in 04, but I actualy did a few years prior to that... thanks and HUGS It's better to be effective than it is to be right.-",
      "MessageIndex": 402,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Jun 4, 2011 11:52AM Tinkerbell99 wrote: Hi everyone!! I know that even though I had a 1 step procedure & NOT exchange, which I'm starting to regret... I have a question. A yr & 1/2 ago I had the one step (this is where they put implants in u right away, no exchange, but not everyone is a canadaite & NOT every woman wants smaller foobs. So I've had many issues since then... Major pain.. Fat grafting (they take small amounts of fat cells from ur abdomen & insert it into ur \"cleavage\" area.) I had this done 2x b/c supposedly the bones r rubbing against my chest b/c I have no fat there. Well to say the least this hasn't been as successful as I'd prefer. My right foob is a little off to the side, but firm .... My left foob is soft (mushy..lol) & way off to the side. He supposedly fixed it 1x, but it didn't fix all the way b/c he didn't secure the side w/ allorderm. So here I am looking for my 3rd procedure since I had the implants. I want the left one moved over & \"secure\". But b4 I do this, I am thinking that maybe a larger implant would be better.So my question is: has Anyone here had implants (after their exchange) in a while & then had them removed & had larger implants put in BUT DIDN'T have drains? Please feel free to PM me or respond here!! Thx Tink",
      "MessageIndex": 683,
      "PostDate": "04/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Feb 25, 2010 06:12PM Tinkerbell99 wrote: may i ask a few questions...is anyone on this board having these \"pains\" just after a few minths or have most of u had ur MX done a while ago yr or more....? anyone on here had the 1 step & not the TE?",
      "MessageIndex": 221,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 17, 2010 11:02PM Tinkerbell99 wrote: UGH!!!! I hate when i get re-directed to another page & i am in the middle of writing here ..i lose it all!!!!  ANGEL: SINCE my surgery almost 3 months ago i have been nauseous  on & off more on then off....so i have learned to eat whole wheat toast (good fiber) drink.sip ginger ale.u shld drink reg if u need calories..i dont i could lose weight..its a wonder why i havent....but ginger ale really is the best..also yogurt & or jello helps me too..sometimes i start out nauseous & sometimes i start out hungry & then in th emiddle of eating i get nauseous...hope this helps a little too.. More to come in a minute i have to send this so i can read the last posts",
      "MessageIndex": 316,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 17, 2010 11:43PM Tinkerbell99 wrote: Hi again:  ESTEPP: TELL ME MORE ABT UR MEDICATIONS PLEZ!!  Flexural is that a sleep aid..i have such trouble sleeping b/c of the pain..when i lay down & turn over it hurts & especially when I GET UP FROM LAYING DOWN!!! i have to hold my rt breats basically underneath & get up slowly & sit for a min or 2 b4 standing upo b/c the pain is sooooooooo bad. I am going to p/t for my rt shoulder blade b/c its being effected from all this...its weird my right implant has always had a bump on the bottom of it, that i push in & pops right back out (i am assuming its the allorderm) but i noticed the bump is getting bigger,...doesnt hurt..i also notice that when i feel my Rt side swells up it feels like there are ripples in my skin..lol the swelling makes   it hurt but not the rippling..What excatly is Ultram? Is that like an anti-inflamorty or muscle relaxer?  LIPCHICK find another pain DR NOW!!! any pain dr that wont give u narcostics is an idiot..even my pain Dr said its really hard to become addicted to even percoset & i take to diff kinds now of oxycodone & oxycontintin (excuse my spelling).....wish it helped my shlr blade too..he also agrees that it only lasts 4 hrs..if ur in pain  & take pain meds then u wont get addicted..its when u take it & ur not in pain.....this of course is my own opinion :-)  Soccermom 5 yrs u have been on pain mang site? wow!! may i ask why... Fog ..how did u 1 day have no pain..how long did it or has it lasted? Happy St pattys Day..hope u all had a nice daY",
      "MessageIndex": 317,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "May 18, 2010 09:59PM Tinkerbell99 wrote: can someone please tell me where i find the questionaire ? also the articles abt the anesthesia block helping womam having  post surgery... can someone please send me that link again...i am having revisoin surgery for my left implant which shifted to the left on June 22..i want to send this article abt the anesthia to my PS.... thax ladies!!!",
      "MessageIndex": 407,
      "PostDate": "18/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Jul 24, 2010 10:43PM Tinkerbell99 wrote: Hi Again, Ok, I have been reading on both boards (1 step & pain) abt tingling & pain in arm(s) after MX.  Well after my BMX I didn't have that, I had major pain, but I just had my left implant fixed & since I  woke up from that surgery I have had pain/tingling, numbness & weakness down my left arm. I also have had major pain in my neck & back (upper). I have been thinking & figuring it's my herniated disks w/ new symptoms & just even went for an MRI.  (I get the results on Wed when I c the Neurologist) but have been wondering maybe its related to the surgery since several of you have complained abt similar pain...can anyone help me out if u have had it & what u did. I am in agony & basically have been taking so much pain pills...I don't know what else to do.  I have done 2 doses of steroids already & wow has my face blown up....now I am done w/ the steroids again & am in agony.  I read that some of u saw a neurologist.What did they do for u? Any pointers, tips anything would be great. Also, has anyone been on disability after u had a MX (w/out chemo or radiation)..if u have, wld u plez PM me if u don't mind me asking u a few questions...I do not plan on having to that, but after my bosses comment, I want  to b prepared for anything!! Thx & stay cool!! Fog, keep on trying w/ those articles..sooner or later they have to be published..thx for doing this Fog!!! Hugs to all Tink!!",
      "MessageIndex": 504,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Feb 23, 2010 02:48PM Tinkerbell99 wrote: hi everyone, i am new to this this thread . almost 2 months ago i had a PBMX w/ immediate reconstruction..since then, i have been in the hospital 2x b/c of infections. well infections r gone & i was starting to feel better & then all of a sudden i statred w/ pain again...i am seeking a 2nde opinion, gonna go to a pain mang dr & start P/T. I am an emotional wreck. My dr doesnt want to give me anything 4 the pain anymore..i called him up today & said its gonna be a feew weeks b4 they can c me..i aske dfor drugs we'll c..i am looking for any support i can get from anyone . My sons BM is this sat I cannot even begin to belive i am not going be an emotional wreck.any advice would be g8t",
      "MessageIndex": 211,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Feb 25, 2010 10:29AM Tinkerbell99 wrote: thank u all for u support& answers. I have an appt w/ my 2nd opinion on Tues.  It appears taht most of u r having pain down the road after ur (B)MX. I am only 2 months out & i started to feel better & then all of  a sudden i woke up in pain & its not getting any better, just worse. I have a lot of rippling on the rt side.  i was starting to be able to get put of bed w/out as much pain, i wasnt waking up so swollen or feeling swollen.  I have no idea if PT will help, but since some of u have done that, what do they do...do they massage or touch u?  Now w/ Pain mang..been there for my neckk so i know abt the steroids & nerve blk...never helped my neck just made things worse. I am hoping this PM dr will  better since they r requesting my records 1rst b4 they c me.  I will b seeing my 2nd opinion on tues who did my breast reduction & i loved him. He moved to Baltimore otherwise i would of had him do my BMX. if anyone here can explain how they do the nerve block & what medications if any helped w/ pain & swelling. MY PS will NOT give me anything this far out he said..what a bastard even though i am doing what he said to do.....i must  say that when it comes to fixinmg my left implant i may not go back to himb/c of this & just travel to Baltimore...not sure yet..wish there were better PS where i live",
      "MessageIndex": 218,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 2, 2010 09:41PM Tinkerbell99 wrote: Hi again, went to 2nd opinion & i trust this dr...he agrees w/ my PS :( he doesnt think i have an infection, sometimes there is redness..maybe i a have small underling infection but at this time i have a few options..i can remove the implants now ...i can get another MRI w/ them taking a sample of fluid to make sure ..but he doesnt recomend it....i can try muscle relaxers & see if that helps if in amonth it odeant then take em out & wait 6 months to a yr b4 starting w/ TE. I am not a happy camper now..i feel like i am crazy...i wish i never did this surgery........so i may or may not have an app w/ my PS 2morow that was scheduled a while ago.......so i guess its a wait & c thing now ...unless anyone here has any recomendations.....but i doubt anyone here does. Has anyone here had  them taken out & started again or not & still had pain?  or thought abt it having the implants removed? thx for letting me share here..i am sitting here crying just thinking abt it all",
      "MessageIndex": 242,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 10, 2010 09:36PM Tinkerbell99 wrote: Deborah, i am printing this article out NOW. Thank you!!! I have an appointment w/ a pain mang dr tomorrow..i got lucky b/c i called my BS & said i am in agony & i dont have an appt till next week & teh PS wont do naything..my BS is onmatrernty leave & her assisant called the PM dr & got me in 2morow morning..wouldnt that of been a better thing for my PS dr to do..i really need to re think when it comes time if i want him fixing my left side or do i travel to columbia to the guy who did mny breast reduction...welli have time..i'm also going to start makimng copies of thiese atrticles & giving it to my BS & PS!!! i cannot believe the pain i am in sometimes..cleavage area radiating up my chest & when my rt breast sweels the whole breast all around it throbs & goes right thru my back...anyone else here have these pains and/or really just on 1 side ?",
      "MessageIndex": 285,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 22, 2010 05:02PM Tinkerbell99 wrote: hi ladies, a co-worker of mine gave me a patch to try for my back which is effecting the pain in my breast. I have been having major pain in my shoulder blade on the same side as the pain in my breast.  The patch is Flurbiprofen(its an anti inflamortary drug that is Non steriod).  the company that makes it is  Teh Seng Pharmaceutical.  i did some research & it appears it good for ARTHRITIS & other stuff like that. It has NOT taken my pain away completley, but usimng the patch w/ my pain meds has made it tolerable.  My shoulder blade on sat didnt hurt at all after the second time using it. I have not tried it on the part of my breast that hurts, but it has reduced my pain in my breast thru using it on my shouolder blade. of course no of us can say this would help u, but hey i always feel anything is worth a try. i am going to make an appointment w/ my orthopedic dr too & see what is going on w/ my shoulder blade. PT is making it worse..so i will not go back until Fri & see how i am doing then with the use of this patch. I hope that someone here can find relief using this patch..if anyone else has anything that has made their pain a little bit more tolerable, please share",
      "MessageIndex": 322,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Apr 3, 2010 12:43PM Tinkerbell99 wrote: Hi everyone!! Ok now that i PM some of u... i hope, i can update pubically!!! i am better then i was a month ago thanks to time, going back to work & mainly medication. I am seeing a great Pain dr & he really understands my pain ....he is giving me stronger medication & is very kind. I wish more women that had pain like i do can see someone like him.  He doesnt ask for urine tests (even though i'd have no problems w/ that) he doesnt want to subject me to 20 million tests which most of them want to...i am very lucky.  now that things r calmer, i can expalin more abt my pain. 1rst the left side shifted a lot..we dont understand why, but supposedly it is not a big deal to fix. If it wasnt for all the problems i have had it would of been fixed a while ago.  My cleavage area is a BIG space ...& the BS took all my breast tissue out ( i guess u have breast tissue there too) & now i have skin rubbing against bone & this appears (which i have complained abt since day 1) to be my issues. So when i have my revison surgery my dr is going to get fat cells from my belly using a small needle & insert it into that area.  he can even do this in the office, but he feels since he is going to over fill me in the begining, it will be best to do this when we have the revison surgery. Many times he uses this for more cosmetic purposes then for medical purposes.  He tried to make me feel good by telling me if this works, he is going to write up an article abt this & have it published.  Hey if this helps me, maybe it can help other women too. My implants itself dont hurt.  i do have some swelling on the rt side, but that is more from my shoulder blade when it acts up , it effects my breast. When i tried PT for my shoulder blade, it made my breast unbearable & i had to take my medicine every 4 hrs!! i was seeing stars. I am back to work f/t b/c emotionally its the best, physcially it is very hard!!! Now my boss has increased my hrs 3 days a week for a 1/2 hr b/c we have more kids in the after school program. 1rst i am the only head teacher that has to work the after school program & 2nd she doesnt understand as the day goes on it gets harder & harder...many ppl think that b/c ur back to wk, ur fine...i am far from fine.my boss said come in a 1/2 hr later & that doesnt work either, b/c earlier in the day its easier, as the day goes on it gets harder. I wish ppl would understand this..& then i get thrown in my face that i got pd through out my time off. I am thankful for that...but i didnt ask to be pd & that was ur nice choice to pay me, but DONT throw it in my face!!! I hate a \"gift horse gift\"... i started to wear a bra for a short period of time & was so happy to take it off too!! But when i have my revison surgery i have to wear support, so i am trying to get used to wearing 1. Plus it does look a lot better!! I am a \"B\" cup now, so i was happy abt that.  when i look down @ my feet i c my feet!!! I know so many woman want to be bigger..i never wanted to..i always wanted to be small. I havent been a \"B\" since elementary school!!! lol I HOPE everyone is enjoying their holidays (if u celebrate holidays) ..this is another pet peeve of mine..that in stores & even dr's why do they automatically wish u a happy easter? Many ppl dont celebrate Easter...how abt have a nice day or good wkend..leave out the holidays ...or just say happy holidays!!lol take care all!! hugs!!",
      "MessageIndex": 353,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Jul 21, 2010 11:48PM Tinkerbell99 wrote: after phone calls & e- mails 2 my BS, i saw her today. She has ordered a MRI ..i go on Thursday & see her Monday...so the wait begins again..she thinks its fluid..not sure why..is it from the allorderm, the implant, lymph nodes..so even though i didnt have any lmph nodes removed..i guess my question is any thoughts why i have swelling & only on rt side? it gets warm when it swells, but not red...its not always either..but frequently....thx ladies",
      "MessageIndex": 498,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 2, 2010 09:42PM Tinkerbell99 wrote: Hi again, went to 2nd opinion & i trust this dr...he agrees w/ my PS :( he doesnt think i have an infection, sometimes there is redness..maybe i a have small underling infection but at this time i have a few options..i can remove the implants now ...i can get another MRI w/ them taking a sample of fluid to make sure ..but he doesnt recomend it....i can try muscle relaxers & see if that helps if in amonth it odeant then take em out & wait 6 months to a yr b4 starting w/ TE. I am not a happy camper now..i feel like i am crazy...i wish i never did this surgery........so i may or may not have an app w/ my PS 2morow that was scheduled a while ago.......so i guess its a wait & c thing now ...unless anyone here has any recomendations.....but i doubt anyone here does. Has anyone here had  them taken out & started again or not & still had pain?  or thought abt it having the implants removed? thx for letting me share here..i am sitting here crying just thinking abt it all",
      "MessageIndex": 243,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Mar 14, 2010 12:15PM Tinkerbell99 wrote: http://www.ncbi.nlm.nih.gov/pubmed/8880841 Pain after breast surgery: a survey of 282 women. Wallace MS, Wallace AM, Lee J, Dobke MK. Department of Anesthesiology, University of California at San Diego, USA. Breast surgery is a common procedure performed in women. Many women who undergo breast surgery suffer from ill-defined pain syndromes. Although there exists a few reports on the incidence of post mastectomy pain, there are no published reports on chronic pain after breast reconstruction. This investigation attempts to characterize the pain after four types of breast surgery: (1) mastectomy, (2) mastectomy with reconstruction, (3) cosmetic augmentation, and (4) breast reduction. A questionnaire was mailed to 479 women who underwent breast surgery at the University of California, San Diego Medical Center between January 1988 and December 1992. A second mailing was sent to women who did not respond to the first mailing. Women were divided into four groups; mastectomy, mastectomy with reconstruction, cosmetic augmentation, and breast reduction. In the mastectomy and mastectomy with reconstruction groups, only women who had a lumpectomy with axillary dissection, a modified radical mastectomy, or a radical mastectomy were used in the study. 59% of the women responded. The incidence of pain occurring at least one year after surgery in the mastectomy + reconstruction group (49%) was significantly higher than the mastectomy (31%) and breast reduction (22%) groups. Thirty-eight percent of the women with breast augmentation complained of pain. Women who had reconstruction using breast implants had a higher incidence of pain (53%) than those without (30%). The pain incidence in women who had reconstruction without implants was identical to women who had a mastectomy without reconstruction. There was no relationship between the use of silicone or saline implants and pain (22% and 33% respectively). However, the submuscular placement of the implants resulted in a significantly higher incidence of pain (50%) than the subglandular placement (21%). Of the women that reported pain, arm pain was significantly higher in the mastectomy and mastectomy + reconstruction group (56% and 42%, respectively) as compared to the breast reduction group (0%). Most patients reported intermittent pain in all groups. Of the women that reported pain, the mastectomy and mastectomy + reconstruction group had higher pain related to movement (41% and 42%, respectively) than the augmentation and breast reduction groups (15% and 9%, respectively). The peak pain intensity was significantly higher in the augmentation group as compared to the mastectomy group. Our incidence of post mastectomy pain is higher than most reports. The incidence of breast pain is highest in the mastectomy + reconstruction and augmentation groups which is assumed to be secondary to breast implants. Every effort should be made to achieve the best cosmetic result in breast reconstruction which in many cases justifies the use of breast implants. However, these women should be counseled on the possibility of developing chronic pain. PMID: 8880841 [PubMed - indexed for MEDLINE] Publication Types: MeSH Terms:",
      "MessageIndex": 295,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "Tinkerbell9…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/91189/profile",
      "Content": "Jul 24, 2010 10:25PM Tinkerbell99 wrote: Hi Ladies, Well what a fun time I had @ my MRI..NOT!!! The MRI was supposed to be a ½ hr, but instead it was an 1hr on that table & even though they have cushions, it hurts laying like that. After the MRI, they wanted to do an Ultrasound & I gotta tell you, the radiologist was a real jerk!!! I think he has a fetish w/ implants...he wanted to know why I was having this done. I said it was b/c I have been having swelling for several months now  & it's not getting any better, if anything, it swells more & gets hard.  If my implants were like this all the time, it wouldn't be so bad, b/c the right side fills a bra cup better & looks better...lol..it just feels weird & hurts @ times...so this radiologist  kept moving my implants & he asked why they were not even...he said my left one that I just had fixed is still to the side & basically b/c it looks \"lopsided\" (not the word he used, but it meant that) I am getting the feeling its swollen...UM.....NO!!!!!! I know the difference when something is swollen..he said my skin is NOT thickened so its not swollen....he kept moving both implants towards the middle...I came so close to saying something to him ....there was a woman in the room with us. I don't think he was doing it b/c he really has a fetish, but still..a little more sensitivity would have been nice. So he suggested I go back to my PS & my BS of course goes by what they say. So thank goodness there is no leak or any fluid..now just to figure out what is going on & what to do abt it...oh what fun more dr's!! Just what I need now @ wk..my boss said to me that if I have any more surgeries or have to keep going to the DR I wouldn't be able to work there..its so nice to have support. Think I like having these surgeries? Think I like being in pain & going to DR's? NO!! thx for listening..more to come !!! Tink xoxoxo",
      "MessageIndex": 503,
      "PostDate": "24/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}