{
  "AuthorID": "Tk3535",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212597/profile",
  "Posts": [{
    "AuthorID": "Tk3535",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212597/profile",
    "Content": "Tk3535 wrote: I am so glad I found this group!! I need advice and feedback!! I'm 35 and am considered high risk. My dad and his two sisters had BC and my moms sister died of breast cancer. I had a mamo a few years ago which came out clean. I went in on 2/21 for a mamo because my left breast had been hurting and I had a funny, heavy feeling in my armpit. I got a call 6 days later saying I needed to come back because they say a possible 3 vm focal asymmetrical density on my RIGHT side!!! Came back as indeterminate. I have kaiser which I hate!! My doc won't call back and I had no one to ask any questions!! I was also a bit worried because they said my breasts were heterogenously dense. I had my diagnostic mammogram and it came back as a 3.1 vm mass postieror depth in the one o'clock position. It showed up on both views and it didn't have fluid or look like a cy at and it wasn't round and smooth. The U.S. couldn't see it but the tech said it was a bit suspicious on the mamo and said not all masses show up on us ... The report still says indeterminate and pretty much nothing else!! I have a biopsy next week and an appointment with genetics counsler to see if I can have the gene test done and I sm requesting a MRI!! I feel so helpless and I have no one to ask!! I hate kaiser and feel trapped!! I feel like I have had to fight for them to take this serious due to my age and history!! No one has really explained what it is or what it could be... The tech said it looked really funny!!! I picked up the readings and my 6 year old could have described it better!! I want a second opinion but I'm trapped in the kaiser network!! This process has been three weeks of hell and by the time I'm done with the biopsy it will be over a month!! I am mentally exhausted!! Advice? Anyone else go through this?!? How do I push for what I need?! Since this mass is new and pretty decent size and is odd shaped what else could it be?! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "12/03/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829437",
    "Title": "35yo 3 cm found high risk and need help!! Tk3535 dstar"
  }]
}