{
  "AuthorID": "tkdmomyn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132891/profile",
  "Posts": [
    {
      "AuthorID": "tkdmomyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132891/profile",
      "Content": "Aug 5, 2011 02:43PM tkdmomyn wrote: Hi guys,  My name is Jessie and I am having a double mastectomy Monday without reconstruction. I just saw my surgeon yesterday and my surgery is in like 3 days. Not much time to freak out but I am reelling lol. I had a lumpectomy 6 years ago and there were some rogue cells. Now it is in both breasts and my bones. Any advice you guys have about what to take to the hospital etc. would be really appreciated.  My surgeon said if there are no complications I will come home Tuesday morning. Thanks in advance for any advice. ",
      "MessageIndex": 64,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "tkdmomyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132891/profile",
      "Content": "Aug 7, 2011 11:57AM tkdmomyn wrote: Hi guys. I hope everyone is doing well. It is hard to believe that in less than 24 hours I will be breastless for the first time in 31 years. I am getting really nervous and am dreading the npo after midnight since I don't think sleep will happen this night. Good luck everyone I hope everyone has a great day.",
      "MessageIndex": 79,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "tkdmomyn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132891/profile",
      "Content": "Aug 9, 2011 07:40AM tkdmomyn wrote: Hi girls. Well my surgery was sucessful. I was pretty out of it during the day yesterday but woke up last night. I am up walking around and doing ok. My chest is sore but not agonizing. All in all it wasn't as bad as I had imagined. Has anyone heard how lilylady and Rocky M. I hope they are doing well. Hi to our new sisters it is gonna be ok. Well gonna go for now I will check in later.",
      "MessageIndex": 101,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    }
  ]
}