{
  "AuthorID": "tkejwalker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224075/profile",
  "Posts": [
    {
      "AuthorID": "tkejwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224075/profile",
      "Content": "Nov 9, 2015 09:40AM tkejwalker wrote: The way it was explained to me it is a lumpectomy, they will be removing the lump and the margins around it. This is where I get confused, the doctors call it a lumpectomy, the internet calls it an excisional biopsy, still don't really understand what my options are and what to ask. ",
      "MessageIndex": 2,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/836591",
      "Title": "Options before diagnosis tkejwalker tkejwalker"
    },
    {
      "AuthorID": "tkejwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224075/profile",
      "Content": "Nov 17, 2015 07:22AM tkejwalker wrote: So tomorrow is the day. Yesterday they inserted a radioactive marker(seed) in the lump to make sure they can find the right area. Tomorrow they take it out. The doctor says they usually know when they can look at it what it is, but the pathology will be back on Friday. I know that is fairly quick, but it seems like forever. Like most, I am just looking forward to getting this out of my body and knowing what it is. Waiting for answers seems like the hardest part. Can't help but think about all the others who have gone through this and wish there was more I could do to help others. Friday can't come soon enough.",
      "MessageIndex": 4,
      "PostDate": "17/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/836591",
      "Title": "Options before diagnosis tkejwalker tkejwalker"
    },
    {
      "AuthorID": "tkejwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224075/profile",
      "Content": "tkejwalker wrote: I have a lump in my right breast that they performed a needle biopsy on three year ago and everything came back benign. However this years tests show the lump has grown and they are now suggesting a surgical biopsy to remove the entire lump and do a full biopsy. I have had very little luck finding information on options before diagnosis. This is technically a lumpectomy, but do I also have the option of a mastectomy? Everything I can find on lumpectomy is after cancer is diagnosed. I have a surgical consult tomorrow and I feel like I am walking in confused and uniformed. I have no idea what to ask. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/836591",
      "Title": "Options before diagnosis tkejwalker tkejwalker"
    },
    {
      "AuthorID": "tkejwalker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224075/profile",
      "Content": "Nov 30, 2015 03:17PM tkejwalker wrote: Sorry for the delayed response. Everything was good. It was a 1.8 cm Fibroadenoma. Had my surgical follow-up today and everything is healing well. She said there is nothing that makes them think my risk for cancer has increased. I do have to go back in 6 months for a mammogram, but it is just to set a new baseline since the tissue was removed. Thanks to all for the thoughts and well wishes. Also sending positive thoughts and prayers to all who are still waiting. Funny how a doctors appointment can turn into a perspective adjustment.",
      "MessageIndex": 7,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/836591",
      "Title": "Options before diagnosis tkejwalker tkejwalker"
    }
  ]
}