{
  "AuthorID": "tlfrank",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
  "Posts": [
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 1, 2017 11:53AM tlfrank wrote: I have very dense breast tissue so had a 3D mamo which showed a \"cluster\" of calcifications that was suspicious. Next I had a stereo-tactic biopsy done and the pathology from that reported Atypical Ductal Hyperplasia - bordering on Ductal Carcinoma in Situ. So I then had a lumpectomy done. Breast Specialists words were \"well, I'm really glad we did the lumpectomy because the pathology report from the biopsy wasn't telling us what was really going on.\" Turns out (at least at this point) that I have DCIS grade 3. I want to insist on an MRI because I'm scared there's more in there. Seems to me that all methods of testing have their weaknesses.",
      "MessageIndex": 14,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859768",
      "Title": "Anyone know what accuracy for 3D plus u/s? andia HoneyBadger47"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 16, 2017 11:03AM tlfrank wrote: If you're in Austin you can check to see if you quality for the MAP program.",
      "MessageIndex": 1,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/860196",
      "Title": "No health insurance, but bleeding. What are my options? Navidan Icietla"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "May 21, 2018 08:39AM tlfrank wrote: Very interesting Moth. Thank you for the link. I've been on Tamoxifen since January, so approaching the 6 month mark. According to that study, my levels might start to come down soon - fingers crossed that it's a simple as that.",
      "MessageIndex": 2,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864744",
      "Title": "Thyroid damaged by rads? tlfrank tlfrank"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Jun 2, 2018 06:28AM tlfrank wrote: I'm still struggling with mine - had to up the dose again and it's still not right. It's a terrible feeling isn't it? ",
      "MessageIndex": 4,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864744",
      "Title": "Thyroid damaged by rads? tlfrank tlfrank"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "tlfrank wrote: I've been on Levothyroxine since 2010 - prior to rads, only once has my medication been increased. Now 6 months post rads - dose increased 6 weeks ago. TSH was checked again and it was even higher. Now dose has been doubled with a re-check in 7 more weeks. I feel terrible and have all the symptoms imaginable. I can't help but think my thyroid got damaged during rads, even though the RO \"poo poo'd\" my question about covering the thyroid during rads. Anyone experience anything similar? Hormonal Therapy 1/15/2017 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Surgery 10/3/2017 Lumpectomy: Left Dx 10/9/2017, DCIS, Left, 2cm, Stage 0, Grade 3, ER+/PR+ Radiation Therapy 11/13/2017 Whole-breast: Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/864744",
      "Title": "Thyroid damaged by rads? tlfrank tlfrank"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Apr 12, 2018 12:44PM tlfrank wrote: I would push for an MRI to be sure that all of it was found before making any decisions. I did not get one and I can't shake the underlying fear that we've missed some. I opted for lumpectomy and radiation because I wasn't ready for the consequences of a BMX (total loss of sensation for one), when it doesn't remove the risk of recurrence any more than lumpectomy & RADS do. Now that I've done it, if it comes back, RADS is off the table and I have no idea what my options will be. BMX, keeps RADs in play in the event of a recurrence. Having said that, each of us has to make the decision that we feel will give us the most comfort. Best wishes to you on this difficult journey. You'll find tons of support and information here on these boards.",
      "MessageIndex": 2,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/863926",
      "Title": "Recent Diagnosis of DCIS sn75 Tess1962"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 1, 2017 08:12AM tlfrank wrote: Argggghhh - I hope to be starting in November too. However, waiting on genetics to determine if mastectomy is still on the table. So torn between just doing the rads and then IF it comes back do the mx.....or just do it and get it over with. Tick Tock - I've been waiting 3 weeks for my results.....waiting is playing so many tricks with my mind.",
      "MessageIndex": 11,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 7, 2017 06:19AM tlfrank wrote: Georgia1 - I'm doing my treatments as late in the day as possible for those exact reason. This way I can go home right after and rest if needed. I work in the dental hygiene department of a community college and I don't think I'll want to go back and deal with students or their patients when I start to feel the fatigue. AngeliaJL - I find it really interesting that some of us are face up and some are face down. I'm face up in a mold with my arms grabbing handles behind my head.",
      "MessageIndex": 94,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 8, 2017 01:31PM tlfrank wrote: I'm 54 - hence the no pregnancy test - however they did ask if it were possible. LOL No pulmonary function testing for me either",
      "MessageIndex": 103,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 07:15PM tlfrank wrote: First dose today - Anyone feel slightly nauseated after treatment? I also got an instant headache......Or was it just my nerves? 20 more to go.",
      "MessageIndex": 190,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 18, 2017 09:43AM tlfrank wrote: My RO is double dosing me Monday to make up some of the upcoming 4 day weekend....8:30am then 4:15 pm. Kind of apprehensive about getting zapped twice in one day but the good news is I'll finish one day earlier than I thought! So far (4 doses) minimal side effects. Pectoral muscle is sore from arms being overhead, kind of tired, but skin is still good.",
      "MessageIndex": 219,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 5, 2017 05:22AM tlfrank wrote: AngelaJL - I have a small open sore on my chest just above the breast and my armpit is getting there. I was prescribed silvadine today but haven't picked it up yet. I have two more full treatments and 5 boosts to go. I'm also experiencing fatigue.",
      "MessageIndex": 473,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 6, 2017 01:25PM tlfrank wrote: One of the lymph nodes in my armpit has become quite tender. Also, my pectoral muscle and breast are very achy. Any one else experiencing this? Today will be my last full breast treatment, will have 5 boosts beginning tomorrow. Eating protein at every meal, lathering on every substance known to man....trying to minimize these side effects but I feel like I'm starting to lose the battle.",
      "MessageIndex": 487,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 14, 2017 07:08AM tlfrank wrote: Finished my RADs yesterday! Yay.....It was difficult for me, and my skin is bad, especially in the armpit. I have blisters, and tremendous pain. RO said the skin will take around 3 weeks to begin healing, fatigue will continue for a few months and that my skin will be sensitive to the sun and wind (? - really?) for a year. I keep telling myself it could have been worse....Really happy to be moving on. Hormone meds are my next step....seeing the Dr Jan 8th. Good luck to us all.",
      "MessageIndex": 514,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 02:37PM tlfrank wrote: I'm about to begin this course of treatment too. Initially the RO said 33 doses, but then yesterday at my simulation I was told it would be 16 whole breast followed by 5 targeted right at the tumor site. Fingers crossed that I will have minimal side effects too",
      "MessageIndex": 14,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859951",
      "Title": "Canadian method (16 treatments) even after chemo Brightness456 runor"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 6, 2017 12:53PM tlfrank wrote: Linwentz, you're almost done? Are you experiencing any bad side effects? Thanksgiving and Christmas will slow me down a bit.....bummer to be doing this over the holidays. Oh well, what will be will be.",
      "MessageIndex": 76,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 8, 2017 06:12AM tlfrank wrote: IntegraGirl - ((hug)) you can do this. You are a person who just happens to have cancer and anyone who makes you feel otherwise is in the wrong line of work. Hang on, YOU GOT THIS! You have the support of everyone here.",
      "MessageIndex": 100,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 11:57AM tlfrank wrote: DodgersGirl - good to know about Aquaphor, I'll pick some up. Do you find it as greasy as everyone says it is? Best wishes for minimal side effects to us all.....",
      "MessageIndex": 173,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 27, 2017 02:54PM tlfrank wrote: I've got 8 down and 14 to go. Was happy to get 4 days off for Thanksgiving - I was getting pink and itchy on the chest. Best wishes for everyone to have a smooth treatment with minimal side effects.",
      "MessageIndex": 349,
      "PostDate": "27/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 28, 2017 08:35AM tlfrank wrote: I bought the calendula oil and the cream. I didn't know we shouldn't use the oil. I'm glad I haven't used it yet - was kind of saving it as a last resort. I've been putting the cream on 3 times a day, but maybe that's not enough....I'm pretty red and itchy and have a bumpy rash under the radiated breast and also between them. I'll try to up the protein intake - but I consume a fair amount daily.",
      "MessageIndex": 364,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 29, 2017 05:54PM tlfrank wrote: Today I crossed the hump. 11 down, 10 to go....5 more whole breast and 5 boosts. My skin is red, itchy and tender, I'm exhausted, have a rash under my boob and between my breasts and my armpit is raw. I'm trying a new soak that the RO gave me today called PEDiNOL along with Calendula Cream and silvadine...I'm sorry that my attitude is in the tank today. Reading all your positive comments is helping though - hope I don't bring anyone down.",
      "MessageIndex": 413,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 30, 2017 03:25PM tlfrank wrote: AlgelsGal57 - we're mostly on the same schedule, I'm also getting mapped today for the 5 boosts, but I'm having 16 regular treatments first, for a total of 21. I'm glad you're managing the side effects well.",
      "MessageIndex": 443,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 2, 2017 12:32PM tlfrank wrote: This is a good question. Hopefully someone with more experience will comment. I struggle with who to call for what issue right now. My insurance requires referrals for specialists. So I think she is being updated throughout this process, but at this point isn't calling the shots. I believe that my breast specialist then created the referral to the radiation oncologist, and the radiation oncologist passes progress notes to her? I know ultimately I will have to follow up with both of them every 6 months for 5 years - so they better be talking to each other. I'm also trying to keep copies of everything that I take with me to appointments just in case. I definitely don't want anything falling through the cracks.",
      "MessageIndex": 2,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859827",
      "Title": "Who is main Dr that gets updates from all others after surgery? Ellyn27 Ellyn27"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 1, 2017 04:16PM tlfrank wrote: Welp, got my genetics back and I don't have any mutations related to breast cancer, but no surprise that I do have one related to colon cancer (3 generations in a row perished from it) but that's another story for another day. So onward to radiation in November. We can do this!",
      "MessageIndex": 19,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 1, 2017 07:47PM - edited Nov 1, 2017 07:48PM by tlfrank Linwentz - I know what you mean about being appointment overwhelmed. I'm two months behind on my dental cleaning - Very bad since I'm the Admin for the dental hygiene department at the community college here! I also need to schedule with the dermatologist - (have had multiple basal cell carcinomas in the past). Facing having to take time off work every day for 6 weeks has made me put off these other two things. But you're right, we've got to do what we have to do. I have not faced multiple cancers at the same time, but with the little I know at the moment, I don't think your DCIS could have metastasized otherwise it wouldn't be DCIS anymore. Just a guess, but I'm sure some one else will respond who has more knowledge. Good Luck and hugs to you.",
      "MessageIndex": 23,
      "PostDate": "01/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 2, 2017 10:57AM tlfrank wrote: My RO said that the radiation may stop hair growth in the underarm. She also said that it was okay to shave only if it's comfortable to do so, I'm thinking an electric razor may work. As far as deodorant, also okay if applied several hours before or after TX if doing it in the AM - again as long as it's comfortable to do so - I'm thinking a natural product such as \"Toms\" in a rollon or spray vs. stick would be most comfortable. I was advised that if shaving and deodorant become to painful, carrying natural, fragrance free baby wipes might be a good idea to fight odor mid day. Calendula cream samples were given to me to try because I also have very sensitive skin. Another reccomendaton was to brew green tea and saturate cotton squares with it, and apply in the am, after TX and prior to bedtime. The tea is known to draw the heat out and minimize the burn. I'm interested to hear what others have been told on these topics.",
      "MessageIndex": 29,
      "PostDate": "02/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 3, 2017 11:39AM tlfrank wrote: Linwentz - My RO gave me the green tea instructions at my initial consult with her so I'm definitely giving it a go too. lifechoices2017 - My RO said as long as I apply it at least 4 hours prior to TX it would be okay as long as it's not uncomfortable to apply. She didn't specify a brand that was okay, so I assumed I wouldn't have to change mine - (Secret). If you're concerned about the aluminum content you could consider a natural brand such as Tom's of Maine.  ",
      "MessageIndex": 40,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 6, 2017 09:01AM - edited Nov 6, 2017 09:36AM by tlfrank Frankly some of the information I've read here has scared me silly. I too am an overpreparer, but in this case I think it may be a bad thing. I'd like to know what to expect, but some of the horror stories I've read about radiation has gotten under my skin. I'm going to my \"mapping\" appointment today and am supposed to start the treatments in the next week or so and I've got this sense of panic just under my skin.",
      "MessageIndex": 69,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 6, 2017 06:01PM tlfrank wrote: 53Nancy - I had the itchy rash too. I think it was an allergic reaction to one of the cleansers that was used on me. My Dr. put me on steriods for a few days and that cleared it right up.",
      "MessageIndex": 82,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 03:31PM tlfrank wrote: Sunnyjay - I haven't actually had a real treatment yet, my simulation run through was yesterday. Today (in about an hour - Yikes!) is my first real dose. I got extremely dizzy during my mapping session so yesterday at the simulation I did find, that if I closed my eyes and concentrated on breathing evenly I wasn't dizzy. ",
      "MessageIndex": 180,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Oct 25, 2017 09:44AM tlfrank wrote: Vodka and carmels - I absolutely relate to you. Was a rather heavy drinker pre-diagnosis, but have cut back to drinking only on the weekends. Everytime I pick up a drink I feel guilty - imagining the cancer cells having a party. Having said that - Now, I'm not sleeping well - waking about 4 times a night, and when I do sleep the dreams are terrible. So I called the Dr and now there is Xanex to try to sleep....which is worse? I have no idea. I feel like a walking zombie. Hang in there - one thing, one day at a time.",
      "MessageIndex": 4,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859652",
      "Title": "Vodka and camels Concerned4444 MTwoman"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 1, 2017 01:47PM tlfrank wrote: AngelsGal57 - I don't know what my HER status is. I don't think it's a typical test done on DCIS. It's not mentioned on any of my pathology reports.",
      "MessageIndex": 459,
      "PostDate": "01/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 07:44AM tlfrank wrote: My simulation was yesterday and my first treatment is today. The RO is going with 21 treatments at a higher dose. The first 16 will be whole breast and the last five will be zeroed in on the site where the tumor was. Anyone else on this type of schedule? I'm wondering if at a higher dose at each tx if the side effects show their ugly head faster and harder?",
      "MessageIndex": 166,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 11:49AM tlfrank wrote: AngelaJL - please keep me updated on how you are feeling/experiencing and I will do the same. Are you finding any particular products that ease the discomfort? I have calendula lotion and green tea to try.",
      "MessageIndex": 171,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 14, 2017 01:00PM tlfrank wrote: 53nancy - My RO gave me a sample of Calendula Cream - it's in a white tube with pink accents ...(figures. I'm starting to hate the color pink) , as well as a sample of a product called Miaderm. I have not tried either yet though, so cannot recommend one over the other.",
      "MessageIndex": 176,
      "PostDate": "14/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 21, 2017 08:00AM tlfrank wrote: Linwentz - I also have DCIS grade 3, but mine was 2.6 mm and ER/PR+, you'rs was a little bigger and negative, so maybe that is the reason for the different treatment length. As 53Nancy said, although the treatments are fewer, the rads dose at each treatment is higher. I'm 6 doses in, skin is already getting pink and have some irritation in my armpit....",
      "MessageIndex": 273,
      "PostDate": "21/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 6, 2017 12:28PM - edited Nov 6, 2017 12:33PM by tlfrank Welp, just finished the \"mapping\" session. Now I know what to expect - the machine is a lot bigger than I expected, and I didn't expect to be on my back, lying in a mold that was made today. First treatment is next Monday - 33 times Tick tock......going to tick the days off one at a time. One thing, one day at a time. Guess it's time to add to my \"stats below\"",
      "MessageIndex": 74,
      "PostDate": "06/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Nov 20, 2017 11:11AM tlfrank wrote: So, I made a really dumb mistake. I was trying to be healthier, so I bought this natural deodorant that doesn't contain aluminum. Well, it smells great, but it gave me a really bad rash in the left armpit. My skin was fine before I used it, but wow not now, it's totally raw. I sprayed Solarcaine on it and that helped temporarily. My RO's nurse gave me some hydrocortisone cream to try. Getting double dosed today. Had one at 8:30am and will go again this afternoon at 4:15.",
      "MessageIndex": 247,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 4, 2017 12:16PM tlfrank wrote: Georgia1 - my technicians have taken pictures of me twice. Once at the initial mapping session and once at the mapping session for the boost. They took mine while I was still lying on the table - and although this experience has made me loose most of my modesty, it was a little awkward feeling both times.",
      "MessageIndex": 470,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    },
    {
      "AuthorID": "tlfrank",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261601/profile",
      "Content": "Dec 6, 2017 01:58PM tlfrank wrote: EmmyEdward - I'm not doing a breath hold either, although I'm finding that I do it anyway out of sheer nerves.",
      "MessageIndex": 490,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/859784",
      "Title": "Starting Radiation November 2017 AngelaJL AngelsGal57"
    }
  ]
}