{
  "AuthorID": "tmac",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
  "Posts": [
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jul 24, 2008 02:59AM tmac wrote: Having the same procedures as you, I saw my PS one week after surgery for drain removal & to take off the wrap and padding, etc. and he examined me.  Saw my BS @ two weeks after my surgery, and won't need to see her again until Nov. (6 mos. post-op) bc all my paths came back clear, and no need for any further tx.  After the drain removal, I saw my PS about every 7-10 days for fills, photos or other issues for about 6 weeks.  Teresa",
      "MessageIndex": 7,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709549",
      "Title": "No doctor has seen me since hospital - normal? BustersMom curlieqs"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 28, 2008 03:28PM tmac wrote: True, alloderm is not FDA \"approved\" but LifeCell utilizes the standards put forth by the FDA in addition to the Amer. Assoc. of Tissue Banks.  The FDA has classified alloderm as banked human tissue.  So, even though it is not a drug, the FDA is aware and somewhat invested in what alloderm is and used for.  From my understanding & consults w/more than one PS, it is becoming standard practice to use alloderm or alloderm like materials in breast reconstruction.  Not all procedures/drugs are FDA approved out of the starting gate.  It takes time, data and experience to build the case for approval.  A side note, my hospital lists alloderm under a drug category in the billing process, which I found interesting.   My ins. co. initially denied my use, but told the PS office if the doc states it's medically necessary (bc of my size or other factors) and written up in the post op report, it will be covered.  So, now I'm challenging the $31K bill for my alloderm and my ins. provider wants nothing to do with it bc they've already paid the claim, so hands off as far as they're concerned, unbelievable.     I had a wonderful experience w/my PS and the use of alloderm.  I truly think my speedy and non-complication free recovery is attributed to the use of alloderm in my bm w/immediate reconstruct. procedure.  In saying that, however, everyone is different, in terms of their own cancer, their health factors, age, their PS/BS/oncologist, smoking vs. NS, so I'm always careful not to generalize things.  Decisions are individual, and should be made based on your individual needs and the experience of your doctors.    Teresa ",
      "MessageIndex": 22,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 19, 2008 03:34PM tmac wrote: Beth, This has been going on for a couple of weeks (getting an answer re:alloderm cost).  I've called Lifecell, they directed me to my PS, who I've yet to speak w/bc of vacations, etc.  I spoke again w/my ins. co. today, and they will not audit the claim bc of the set amt. in their contract w/ the hospital (the set amt. is the same regardless of $5 grand or $31 grand for alloderm).  I was hoping they could do the work for me, but it's a no-go.  My case mgr. at ins. co. can't do anything either.  I have yet another call into my PS office to speak w/my clinical nurse (also has been on vacation).  The hospital is reviewing the bill, but has yet to receive my med. records from the anal's of the hospital.  I'm meticulous (sp?) about this kind of stuff, but it's become another job.  Thursday mornings are my morning to be lazy, spend time w/my 3 yo, drink my coffee, read the paper, etc. But it's now my part-time job to make all my f/u phone calls. Phew, at least I'm at the tail-end of bills, etc.  Just the surgery/hosp. bill & PS bill yet.  Good news is that I've met my out of pocket max., so theorectically shouldn't be paying for anything else (incl. my exchange & nipples!).  Just had blood drawn for brca gene 1&2 test, and is also covered.  Sorry @ the rant girls, but we have enough to deal with, ya know? Feel good girls! Teresa    ",
      "MessageIndex": 11,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Sep 18, 2008 10:18AM tmac wrote: Cigna covered mine, to the tune of $31 K, after the urging of my PS bc medically appropriate & necessary.  I had mine approved before surgery.  When I received my itemized bill from the hosp. I was shocked re:alloderm charge.  I requested a review of the bill, and as it turns out the $31 K was correct.  Now I know why so many ins. co. deny (bottom line often is @ $). ",
      "MessageIndex": 40,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 18, 2008 09:34PM tmac wrote: My PS also used alloderm, successfully.  I will warn you that most ins. co. deny bc it is still considered experimental even though FDA approved.  Mine was denied prior to surgery, but my doc felt it medically necessary and wrote it up that way in the post-op report.  It was covered.  I'm now actually questioning the amt. the hospital billed me for, $31,000!!!  The bill is under review.  My ins. co. has already paid out their portion, but it substantially affects my responsiblity towards the bill.  I hope it's a mistake!  Good luck.  I really believe the use of alloderm affected my quick and complication-free recovery. Teresa",
      "MessageIndex": 6,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 20, 2008 02:22PM tmac wrote: Hi girls, I finally got some confirmation from my PS office yesterday that my alloderm charge is very wrong.  Apparently, the PS office has been receiving calls for a couple of weeks about unusual, inflated hosp. bills (all the same hosp.), and not just alloderm costs.  So, sounds like it's a system problem.  I'll post my actual cost when it's resolved.    Don't want anyone to get scared @ their alloderm costs!  Teresa  ",
      "MessageIndex": 13,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707522",
      "Title": "alloderm ocean_snow lvtwoqlt"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Oct 3, 2008 01:25PM tmac wrote: MIL was excused when just dx w/lymphoma.  But, for sure, they called her up the next year, and she was able to attend. ",
      "MessageIndex": 11,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722194",
      "Title": "Jury Duty? Are they kidding me?! ccarter48818 Skyrat"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Sep 9, 2008 03:11AM tmac wrote: Overnight for me, unbelievable, huh?  It depends on your state interms of length of stay insurance will cover.  NJ typically covers 24 hr. stay for BM and OP for sgle. mast., ofcourse if complications, more.  I have to say, I was shocked at length of stay, but ready to go home w/in 24 hrs.  I was up w/in 2 hrs. of surgery to use the bathroom, which was constant bc they were pumping me full of fluids!  But a good thing, to get me up and moving.  All I did once I got home was sleep and strip my drains, something I didn't really need to pay extra for at the hospital!   ",
      "MessageIndex": 4,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720834",
      "Title": "How Long in Hospital after Bi-Later with Reconstruction? Mocity mom_of_2"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "May 17, 2008 07:49AM tmac wrote: I'm in agreement too, at least after surgery.  I had a hysterectomy two years ago and learned my lesson re:narcotics/constipation, etc.  In prep for my bi-mast 3 wks. ago, I started colace as soon as my dr. okayed it.  I also drank a lot of water, increased my bran intake, well, you get the pix.  I figured the natural stuff couldn't hurt.  Walking I've heard is good, too, so I tried to take little walks around the neighborhood once my doc gave me the go ahead.  And, no constipation, at least not the level I experienced two years ago.  Good luck!    ",
      "MessageIndex": 9,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705111",
      "Title": "Before Surgery/Narcotics Stool Softeners ? Dejaboo ckr11100"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 20, 2008 09:39AM tmac wrote: Yes, do get a second opinion from a radiologist who specializes in mammos (to read your suspicious mammo) and another pathologist, preferably from a different facility than your original.  We learned the hard way.  When you see a BS, they will read your films & biopsy report.  They aren't as good at reading films as a radiologist.  Don't get me wrong, they're good, but radiologists specialize in reading films.  Our 4th (I know, overkill) BS consult had her radiologist read my mammo films, and she found more suspicious areas that other BS missed.  We were floored!  We didn't even think about second op. from radiologist and pathologists prior to that.  And we had no idea that each BS didn't consult w/a radiologist at time of our consult.  After the new sites were found, we had another op. from a pathologist, too.  The second radiologist findings lead to 2 more recommended biopsies.  So, even though 4 consults was a lot, thank goodness we went bc we would have never known @the other suspicious sites, thus impacting our tx. decisions.  Good luck! Teresa  ",
      "MessageIndex": 13,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707607",
      "Title": "Anyone ever think about getting a 2nd path opinion? BustersMom drcrisc"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "May 16, 2008 10:09AM tmac wrote: Hi Dawn, I completely relate to your situation.  I'm 40, 2 young children, DCIS dx after my baseline mammo.  Your decision has to be what's best for you & your family.  For me, I had time to research and doctor shop.  In situ is a good thing.  I, too, did not have a lump, only a cluster of cells, and had a choice btw lumpectomy/rad/tamoxifin or mastectomy.  My first BS consultation talked to me about \"quality of life\", for the rest of my life.  This stuck w/me thru out the other consultations, and helped in my decision making process.  One of the first things I did after my dx was educate myself.  This decreased my anxiety tremendously.  The unknown is what creates anxiety, so anyway to decrease the unknown is a good thing.  I wish you and your family the best.           ",
      "MessageIndex": 29,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705418",
      "Title": "5/9/08 date of my diagnosis Dawn08 Dawn08"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "May 13, 2008 09:34AM tmac wrote: I'm three weeks out from my bil-mast., and took my first bath last night.  Since I'm still healing, as you are too, I didn't let those areas soak in the water just to be safe.  All the same, I love baths, so it felt great to finally take one!!  If you've had no complications, you should be fine.  Can't hurt to call your PS.  Good luck!",
      "MessageIndex": 2,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/705463",
      "Title": "after surgery, when can I take a bath? kaye45 AnnNYC"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Oct 10, 2008 07:44AM tmac wrote: Again, sounds like a no-brainer for a BS to know that expanders have a metal port!!  I'd say it's lack of knowledge, not communication!  That goes for the MRI tech, too.  At least have the knowledge to ask about metal in your body, or was this info. on the paperwork you filled out before going into the MRI?? I'd be soo steamed, too.  Glad to hear the magnet worked, and hopefully little chance of a problem.  Best wishes in making your decision @keeping the xpander or having the MRI.  You'll do what's right for you.    Teresa",
      "MessageIndex": 22,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722355",
      "Title": "Shouldn't of had MRI w/ EXPANDER! LUVmy2girlZ Looneymom"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 20, 2008 03:24PM tmac wrote: Sorry, not sit ups, push ups!!  Obviously a difference. ",
      "MessageIndex": 5,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707741",
      "Title": "Mastectomy last Monday HisHealing tmac"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Nov 7, 2008 07:08PM tmac wrote: Bottom line, I had the option, but wanted to reduce my risk of recurrence as much as possible.  BM reduced my risk the most.  And, just as important, I considered my quality of life.  Didn't want to be looking over my shoulder for the rest of my life, waiting & wondering if/when BC would come back.  Now, I have a 2 % chance over my lifetime of a recurrence.  That's less than the general population are at risk for BC.  Teresa",
      "MessageIndex": 5,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724088",
      "Title": "For those who \"could\" have Lumpectomy.... why choose Mast? Estepp sbmolee"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Oct 6, 2008 03:54PM tmac wrote: Hi there, So sorry to hear about your experience.  I only know a little @expanders & MRI's.  My son had to go to the ER when I had my xpanders in, and he needed an xray.  I told them I had a metal port w/my xpanders and they said exposrue to xray was fine so long as I wasn't having rads (radiation is cumulative in our bodies, so exposure no matter what it is, accumulates).  I was told MRI's, no way, bc of the magnets w/MRI's.  My PS confirmed it.  I have no idea about any other risks due to exposure.  I think the main concern is the MRI equipment can be drawn (like a magnet) to metal.  I heard a weird story several yrs. ago @ someone being killed in an MRI room bc a metal oxygen tank (which should have never been in the room) flew across the room and hit the person (magnetic force).  Now, I don't know how accurate the story, but that's what I recall.  Have you called your PS?  I think your PS, had he known about the MRI, would have said no.  I don't know about a card for expanders, but I received my card & warrenty info. for my perm. implants (maybe that's what they meant?) after my xchange surgery.   If this happened today, try and relax (easy for me to say), and hold off until tomorrow or when you are ready to call your docs.  Certainly, everyone needs to know what happened.  Keep your chin up, and good luck. Teresa",
      "MessageIndex": 1,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722355",
      "Title": "Shouldn't of had MRI w/ EXPANDER! LUVmy2girlZ Looneymom"
    },
    {
      "AuthorID": "tmac",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66702/profile",
      "Content": "Jun 20, 2008 03:23PM tmac wrote: I know the 'continued tissue expander pain' thread can be a little discouraging for some, but I too, had a positive experience having a bm w/tissue expanders.  It's been almost 2 mos., and I couldn't feel better.  After the surgery I never felt pain, but was extremely sore.  I compared it to doing 1,000 sit ups!  I was back to work after 3 wks. at my desk job, one day a week.  I was driving in 2 wks.  My drains were out one week from surgery, and I was off the percoset by then, too.  Every now and then for the second & third week I would take valium for muscle spasms as needed.  I saved most of my valium for my fills, one before a fill and 2 after at bedtime (approved by my PS).  The valium before was for my nerves, LOL, and the 2 at bedtime were to help me sleep comfortably thru the night.  I am very fortunate in that my surgery was my tx.  I have my exchange the first week of August, and will have my nipples done by the end of the year.  So, for me, the worst is over.  But I've found that emotionally it's hitting a little harder than I expected.  I count my blessings everyday, and keep all of you strong women in my thoughts.  It's good to hear positive experiences, too.  Thanks for sharing. Feel good, Teresa",
      "MessageIndex": 4,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707741",
      "Title": "Mastectomy last Monday HisHealing tmac"
    }
  ]
}