{
  "AuthorID": "tnd22",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
  "Posts": [
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Apr 29, 2017 08:20PM tnd22 wrote: I've also written on the April thread. How long do most PS take between the original cancer surgery and the reconstruction for DIEP/fat transfer? My surgeon said surgery wouldn't accept it before 90 days after the first surgery, wonder what other's experiences are. My surgery was April 11, BMX, and he can't do reconstruction until Sept 18. Also, I wanted to get a reduection from a size DDD cup to a C. I think my TE are a good size now and he wanted to fill it more; I don't know whether or let to let him, if I\"ll be too big.",
      "MessageIndex": 870,
      "PostDate": "29/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Aug 1, 2017 05:43PM tnd22 wrote: Lisbeth- I'm going to jump on the Call you doctor train, too! And that's all about that. EastCoast- my PS said to quit the Armidex, which surprised my MO, because that does not have a risk of blood clots. Tamoxifen does, though, so I can see getting off that before surgery.",
      "MessageIndex": 1008,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "May 1, 2017 02:57PM tnd22 wrote: Scottiemom11- how do you feel about having the silicone implants? I notice you've already had them redone once. Wondering if that would be easier, even though I am talking about the DIEP. I don't need chemo or radiation, I just want it done.",
      "MessageIndex": 875,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Aug 22, 2017 06:13PM tnd22 wrote: LisBethS my MO didn't say anything about aluminum containing anti-perspirants but I've always been wary of them (and lots of those give me a rash). Yes, I tried Tom's but it doesn't work very well. Recently switched to Native which is anti-aluminum and anti-paraben and so far it is working better. and I've been working out more. Thing is, it's for women and has very girl scents, and I'm not sure it would work on a teenage boy. It's a little expensive, too. But you could try it or read about it for yourself.",
      "MessageIndex": 1017,
      "PostDate": "22/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/852338",
      "Title": "March 2017 Surgery plantchild Molly50"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Apr 22, 2017 07:02PM tnd22 wrote: Alright, I don't know who will see this thread, since the beginning is old, but I'm going to add my two cents- because I am a Nuclear Tech who has done this poor thing to numerous ladies and had it done myself 2 weeks ago the night before my surgery. Technically, this is not a \"dye\", as it's not a contrast or anything else. It's a radioactive isotope with a very very small amount of radioactivity, as others have said, to detect the lymph nodes that are first feed by that area. The injections are a tiny needle and it goes into the skin layer. Our goal was to cause a \"bump\",or wheal, then we know it's done correctly. And I know it hurts. It depends on your pain tolerance for how much. It's like getting a TB shot- those are in the skin layer also, and are supposed to be a bump as well, but that's on your arm, not the sensitive breast. The doctors I used to work with (the last one I've done was probably in 2011) used to say they could give you a numbing shot first, but either way you'd get a shot that you would feel. It only lasts a couple minutes. And this does not cause the blue pee others talk about, that's the blue dye the doctor injects after you are out. Sometimes imaging is done, and yes, you have to wait for the isotope to get to the nodes. Nuclear Medicine is imaging based on physiology, not anatomy, so it takes time to see how the body is working. The majority of the radioactivity is done before the surgery, leaving the nodes lit up so the doctor can find them. It is so worth it to get only a few lymph nodes taken out rather than a lot and leaving lymphadema problems the entire rest of your life. As for my personal experience on the other end- Lidocaine cream!!!! As one said, I smeared it all over my breast about 2 hrs before the procedure and covered it with saran wrap. Worked like a charm, didn't feel a thing. I'm not sure why the doctors at my institution didn't use it, maybe it wasn't out yet? My recommendation is to get some if at all possible. It is just an injection. OK, as many as 4, but not worth putting someone out for. ",
      "MessageIndex": 65,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Jun 19, 2017 04:34PM tnd22 wrote: To SweetLaughter- not sure what you mean by the injection broke, I guess those were the tech's words to make you understand the situation. I would guess she missed the skin and it got on top instead of under the skin. Doesn't happen often. Very, very small amount of radiation so nothing to worry about. But contamination on the skin could make finding the stuff inside harder. It's been week so it is long gone, nothing to worry about.",
      "MessageIndex": 81,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746169",
      "Title": "Nuclear Injection pre-surgery pagowens Accepted2018"
    },
    {
      "AuthorID": "tnd22",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/249774/profile",
      "Content": "Jul 29, 2017 09:48PM tnd22 wrote: gracie22- just read your list of questions and stuff, those are great. Wish someone had told me those in April before my surgery, but I made the decision to have a BMX and think that was the right decision.",
      "MessageIndex": 12,
      "PostDate": "29/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/851159",
      "Title": "Double MX Panic Cocolu tnd22"
    }
  ]
}