{
  "AuthorID": "TNNurse",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
  "Posts": [
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 3, 2013 07:09PM TNNurse wrote: October brings my birthday soon.....a little closer to retirement....  It also brings breast cancer awareness month.  Am I the only one that is aggravated by this??  I personally do not need any awareness.  I am living with awareness.  The survivors around here who are all gung ho are fortunate.  They are the ones who had surgery, immediate reconstruction...no chemo....no radiation.  They feel good, have few issues and are out rallying pinkness.   Am I bitter?  Oh, yes.  For them the tough part is over.  For us........it apparently never ends.   So excuse me if I am not wearing pink, having gatherings and sharing.   I just have to focus on getting through every day.  I am already real damn aware.",
      "MessageIndex": 10,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/811574",
      "Title": "Hello Fall! Lainey64 TNNurse"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 7, 2012 06:56PM TNNurse wrote: This is my first post.  I finished my chemo Aug 27.  I was on Adriamycin/Cytoxan/Taxotere.  I do not think my hair has grown at all...anywhere.  I will be 63 next week and my hair was mostly white.  I used to have \"premature white hair\" because it started changing color when I was in my late  20s.  At my age it is no longer premature.  I have never colored it.  At this point I just want to see some hair growth.  I do not care what color. It can be dark and curly. I just want it to start growing.   My wig is very good and many people think that it is my hair just styled differently when they first see me.   I hate the wig, it is hot and itchy and when people hug me I am afraid it will shift around. I have read many posts on here and they have given me hope, but I am getting frustrated.  I guess I better start looking for some warmer hats because I am thinking I will not be getting hair for Christmas. ",
      "MessageIndex": 17778,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 23, 2012 05:23PM TNNurse wrote: I have hair.  You have to get in the right light to see it.   It is white and amazingly soft.  I cannot measure the length, because it is still too short for that  But the point is I have hair.  ",
      "MessageIndex": 17893,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Jan 26, 2013 03:21PM TNNurse wrote: butterfly 14, I know just how you feel.  I wanted hair growth and I wanted it earlier than it did. I am not ready to go many places without my wig.  Others think it is enough coverage but I don't.  I take it off when I get to yoga, to my counselor and to my doctors.  If you read about others hair growth on this site you will learn there are many possibilities. Colors, texture and growth rate vary a lot.  Many people are in a hurry to get rid of white hair.  I had white hair before it came out, before that it was auburn.  Some of the new stuff is white but also a lot of dark grey.  I have never had grey hair, it is strange.  Mine is not curly like many report, but it has come in with growth in many directions.  By the way, my last chemo dose was August 27 and I began to believe it would never grow.  Take some slow deep breaths and try to relax.",
      "MessageIndex": 18588,
      "PostDate": "26/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 7, 2012 09:54PM TNNurse wrote: AEM47, thanks for your encouraging words.  I did not think I would be so anxious about my hair.  But it turns out that I  am.  I thought that I wanted my tastebuds most and am happy to taste food again, but now I want to look like myself.  rn4babies, I am hoping for similar results.  Many animals grow thicker hair as winter approaches, maybe we will, too.  I am encouraged by your results. ",
      "MessageIndex": 17781,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 11, 2012 04:40PM TNNurse wrote: shockd, I am with you, if I had not found this I would be inconsolable.  My hair has not started to grow and now almost six weeks PFC, my eyebrows are coming out.  I have used a gel that was supposed to help from losing brows and lashes religiously and been so happy...and now even with continued use...one brow is almost gone and the other thinned a lot.  The fact that others have had such a variety of results does bring me hope.  I am now getting daily radiation treatments which are supposed to make me tired after a few weeks and maybe cause some skin issues.  I have very fair easily suburned skin.  There was a point during chemo when I really did wonder if my body could take more doses and my body and I made it through.  I guess now my emotions will get through this part, but it is a struggle.  Reading other people's stories really does help.",
      "MessageIndex": 17810,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Feb 14, 2013 07:45PM TNNurse wrote: No question here is stupid. I think I tried several things on my bald head....shampoo, body soap...whatever feels good.  It is skin..protect it from the sun! A few other points.  I quit wearing my wig to work this week ( I am a hospital nurse).  My hair is grey and white.  It is still very short.  Someone told me I looked like Judi Dench ( the actress ), I am 63, it made my day, week, month, year. For most of my adult life I have worn size 12 or 14 pants...yes I am short and wieighed too much.  Today, I bought a pair of size 6 pants.  I giggled and laughed.  Chemo for me was a very effective weight loss plan, I do not recommend it, though. Inthe wind: If indeed the poor info you got was from a nurse (LPN, RN or NP), that is inexcusable.  Actually it was any office person, it is inexcusable.  I have been an RN for 35 years and a breast cancer patient for about a year.  All patient deserve and require accurate info and concern, but cancer patients do require extra attention.  If your doctor does not understand that, you can send me his information and I will gladly explain to him. This site has been such a huge help for me. Thanks to every one of you.  I hope my comments help someone, too.",
      "MessageIndex": 18764,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Nov 9, 2012 08:27PM TNNurse wrote: My synthetic wig has been great.  Lots of people think it is my hair, just a different style.  Human hair wigs have to be \"styled\", synthetic ones are less work.",
      "MessageIndex": 18028,
      "PostDate": "09/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Feb 8, 2013 09:43PM - edited Feb 8, 2013 09:45PM by TNNurse IntheWind, Well, that is quite a question.  From your photo, you appear pretty young and you have children.  I did not have  your type of cancer, I am 63 dx last year.  I do not have children.  I had a single mastectomy and had one positive lymph node.  After surgery, I had chemo.  I will not lie, it was awful.  I started in late May and finished the end of August.  I lost my hair, I had no appetite, no tastebuds and horrible diarrhea.  I did not vomit more than 2 or 3 times.  I lost weight which was OK, I had it to lose.  After that and six weeks of \"rest\", I had 33 radiation treatments.  They were Mon-Fri until done.  I had some skin \"burn\" but my doc gave me a couple of things that really helped.  Both chemo and radiation make you tired....very, very tired.   I had beautiful white hair ( my favorite thing about myself), it was tough to lose.  I have a great wig and many people did not know it was a wig.  Today I went out into the world, well the grocery store, without the wig. My hair is coming back, white and several shades or grey....never been grey before, but it is still pretty short. I am alive.  I made it through.  I had a lot of support and amazing offers of help. If it reoccurs, I might not take chemo again, but I do not regret that I had it.  If your docs give you good chances, a year without hair or eyelashes or eyebrows is certainly worth it to me. I wish you well and hope you make the decision that is best for you.",
      "MessageIndex": 18688,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Nov 20, 2012 05:40PM TNNurse wrote: I have hair...not enough to quit the wig or hat.  My hair was mostly white before.  The front is very white, but the back is much darker..I may look like a skunk when it gets longer.  My eyebrows are back and are going to need professional help, they are too thick.  Lashes are coming back in. I had my last radiation treatment today and am dealing with skin problems and general fatigue.  So glad that is over.  Thanksgiving will give me the chance to look back at how much help and support I have had. I hope all of you will be able to count your blessings as well.",
      "MessageIndex": 18120,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 8, 2012 09:25AM TNNurse wrote: Carrol2, wow, you look great. This is encouraging.  It is better than just looking at yourself in a mirror.  Unlike many on here, I will be content with my white hair to return.  I think I would be happy with any color hair.  Thanks for your help",
      "MessageIndex": 17783,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Feb 9, 2013 12:53PM TNNurse wrote: My surgeon told me that he had not yet been able to understand that some women had a harder time losing their hair than losing their breasts.  I told him that a least part of it was that you can hide the loss of breasts but it is harder to conceal the hair loss.  Also. I am much more concerned about how my face and hair look than my breast appearance.  Of course I am in my 60s, so I did care more when Iwas younger. My hair has always been my best feature...it was short and light red as a child, long and auburn in my late teens and early twenties.  It began to turn white through my 30s and 40s.  When I started chemo it was chin length and white, I received compliments almost every day.  It is now white and light and dark grey, it is also very short, but finally covers my head.  I did cry the day it started coming out, we had a plan.  I pullled it out until that quit, my husband buzzed the rest until our friend came to relieve him.  I had my wig and hats.  I went out right after and played golf to distract myself.",
      "MessageIndex": 18692,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Nov 2, 2012 08:26PM TNNurse wrote: I still hate my wig..but I get compliments on it every time I wear it.  I usually wear it when I go to work or tests because I work at the hospital where I am getting radiation.  I wear hats or scarves to just go to the grocery store.  At home I wear nothing..on my head..it was a HOT summer.  I started chemo in May and finished in August.  Generally I found anything on  my head was hot and itchy.  It is really itchy now that I have hair coming back..it is too short to measure and it is white.  I had never colored my hair and I used to say I was prematurely white, but now I am 63 and it is just white.  The guy who ordered my wig saw my hair before and he did an amazing job matching it.  I told him I wanted to look like me and many people just say they like my new style.  With the weather getting cooler, I need to find snuggly things to wear....it will be quite a time before I go topless.  You can get through this part, it helped to read others hair problems on here. We are all pretty tough.  For me chemo was the worst part, if I can do that I can get through this hair stuff.",
      "MessageIndex": 17977,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Aug 4, 2013 11:47AM TNNurse wrote: My hair was my favorite part of me.  I had a wig ordered that matched it pretty well and I wore it wherever it mattered to look like me....work..etc.  Otherwise, a hat, cap or scarf or nothing at home.  Wigs are HOT.  I cried and mourned for my hair....but it is back.   I made it through and so will you.  You can cry, get mad and pout whatever you want to get through it....and you will.  All of those who have been where you are really do understand.  We cannot take away what you are feeling but we can let you know that you will get through it as we did.   You will certainly be in my thoughts.",
      "MessageIndex": 19424,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Mar 3, 2013 09:42PM TNNurse wrote: I stopped wearing my wig a little past 5 months final chemo.  I had stopped wearing it everywhere but work for awhile.  I did wear scarves or hats but mostly for warmth.  The first day at work (a hospital) some asked why I cut my hair but they were mostly newer employees who had only seen the wig and not my hair.  I was cold all day but the wig was beginning to slip around on my hair and I did not want that look. Most of my coworkers think I should keep it very short, but I doubt that I will ever cut it this short again.  We shall see. I have kept my wig so far but plan on letting it go soon.  There is one scarf like hat that was apparently a security cover that is still here.  The rest of the caps and scarves have been donated.  The wig will go to the same place. I am grateful for my wig, it got me through a lot.  The guy who ordered it for me saw my hair before any came out and his mother and aunt both had breast cancer and he is dedicated to making patient's happy with their wigs. This is a hard journey, I hope it is better for each of you soon.",
      "MessageIndex": 18926,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Oct 18, 2014 09:51PM TNNurse wrote: Please check www.lymphedematreatmentact.org  there is a bill soon to go before Congress about Medicare and compression garments.  They are not currently covered.  Please contact  your Representative and encourage him or her to support it.  I turned 65 this year and am still covered under my husband's insurance until he retires next year.  The insurance currently covers 80%.  Medicare covers Viagra and other such drugs.  I do not believe they are crucial to health as lymphedema treatment.",
      "MessageIndex": 3,
      "PostDate": "18/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/825032",
      "Title": "Medicre bhd1 TNNurse"
    },
    {
      "AuthorID": "TNNurse",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161458/profile",
      "Content": "Jun 18, 2016 03:47PM TNNurse wrote: I do not wear rings on my affected side. Since being on Arimidex my joints are bigger and I wear my wedding ring on a chain around my neck. My 20th anniversary ring was a larger size and still fits my left hand.",
      "MessageIndex": 15,
      "PostDate": "18/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/845227",
      "Title": "How many still wear their rings on affected side? rvgirl2016 paintThesky"
    }
  ]
}