{
  "AuthorID": "Toastiecat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158133/profile",
  "Posts": [
    {
      "AuthorID": "Toastiecat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158133/profile",
      "Content": "May 5, 2015 04:44PM Toastiecat wrote: I met the founder at the Young Survival Coalition conference in March, and I believe she said she is working on a line that can be used with prosthetics. She super nice, and I'm sure would respond if you messaged her on social media.",
      "MessageIndex": 2,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/830981",
      "Title": "AnaOno bras caaclark Flounder"
    },
    {
      "AuthorID": "Toastiecat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158133/profile",
      "Content": "Toastiecat wrote: Hi everyone, I'm struggling a bit with a chemo decision, and would love to hear your thoughts. I'm er/pr -, her2 +. My initial path report showed one 4mm focus of IDC. More slides were ordered, and the pathologist found at least 9 additional foci, ranging from less than 1 mm to 3 mm. Based on this new info, my onc definitely wants me to do chemo and herceptin, even though it's not in the guidelines. My onc likes weekly taxol herceptin for me, as does my 2nd opinion onc at dana farber. This is what both were suggesting before the revised pathology, and they still recommend it. My onc here put the question to a group of other colleagues, the majority of whom thought I should be given something more aggressive (AC or TC) than just the taxol. I've never met these doctors, so I don't have any opinion on them. I do really like my current onc and the one at dana farber. It's a tough decision, because studies with people with tumors my size are hard to find, so I can't point to something and say this will give me xx% chance. All along my feeling has been to be as aggressive as possible, but some of the long term side effects of AC and TC scare me a bit, especiallyif I don't really know if and how much more effective they can be. Though I had a mastectomy, they weren't able to get clean margins so I will have radiation. What would you do in my shoes? Thanks in advance for your thoughts... rtonj.blogspot.com Dx 7/23/2012, DCIS, 6cm+ Dx 7/23/2012, IDC, <1cm, Stage IA, Grade 3, 0/8 nodes, ER-/PR-, HER2+ Surgery 8/1/2012 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy 9/20/2012 Herceptin (trastuzumab) Chemotherapy 9/20/2012 Taxol (paclitaxel) Surgery 12/16/2012 Reconstruction (left): Tissue expander placement Radiation Therapy 1/1/2013 Breast Surgery 6/1/2013 Reconstruction (left); Reconstruction (right) Surgery 7/2/2013 Reconstruction (left) Surgery 8/2/2013 Reconstruction (left) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793665",
      "Title": "Weekly taxol vs. AC or TC. What would you choose? Toastiecat Toastiecat"
    },
    {
      "AuthorID": "Toastiecat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158133/profile",
      "Content": "Sep 8, 2014 03:27PM Toastiecat wrote: Have you tried the tiny straightener? I used one, and the difference was huge. My hair, like yours, was super straight before -- and now finally is again! Your length is about on par with where mine was 10 months out. Also, getting it shaped by a pro really helps.  Here's the straightener: http://www.sephora.com/mighty-mini-ceramic-styler-P379305",
      "MessageIndex": 3,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824280",
      "Title": "chemo curls lexie2002 Cream52"
    },
    {
      "AuthorID": "Toastiecat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158133/profile",
      "Content": "Sep 19, 2012 06:16PM Toastiecat wrote: MW, thank you so much for your reply. You're right, taxol is very powerful...it's easy to forget that in the grand scheme of things. Somewhere in the back of my mind I still have that teenage thought - the more it hurts, the more it's working! (When I was first having that though, I was concerned about pimple cream!) After speaking more with my doctors and reading more studies, I've decided to stick with the weekly taxol.  Thanks so much again! xoxo",
      "MessageIndex": 2,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793665",
      "Title": "Weekly taxol vs. AC or TC. What would you choose? Toastiecat Toastiecat"
    }
  ]
}