{
  "AuthorID": "tobo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96682/profile",
  "Posts": [
    {
      "AuthorID": "tobo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96682/profile",
      "Content": "tobo wrote: My primary physician sent me a copy of my mammogram results.  I have to go back for more films and a possible ultrasound.  It said there is a 1.5 cm area of nodular asymmetry more pronounced in the right breast on one view but difficult to locate on another view.  I am freaking out.  Is a nodular asymmetry another word for tumor?  I can't get in until February 9th?  Anybody else get this diagonsis? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/747583",
      "Title": "Nodular Asymmetry tobo ttzohos"
    },
    {
      "AuthorID": "tobo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96682/profile",
      "Content": "tobo wrote: Need some advice.  I'm 47 and have been called back from screening mammograms pretty much every year for the past 7 years.  After the diagnostic mammogram, I have been told I have very dense breast with cysts.  This year they found some very small calcifications and feel comfortable with waiting to give me another mammogram in 6 months.  I suffer from anxiety problems and I told them these call backs every year is very stressful.  They said they would be happy to do a biospy if it will help my anxiety.  Now I don't know what to do - should I wait six months for another mammogram or do a biopsy.  Would waiting six months put me at risk if it is something? Besides suffering from anxiety, I also have a really hard time making a decision and need to talk this out with someone.  Thanks! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800167",
      "Title": "To biopsy or not? tobo april485"
    }
  ]
}