{
  "AuthorID": "tomatojuice",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
  "Posts": [
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 26, 2008 12:29PM tomatojuice wrote: Hi Binney. No she did not do MLD before wrapping my arm. She spent all of a half hour with me, and just wrapped my arm.While doing the wrapping she commented \" I can never understand what it is that makes women so upset about this\". I couldn't reply, because I felt like I was having a nervous breakdown, while watching her wrap my arm, and also trying to figure how I was going to do this. When I woke up this morning, my hand was hurting. In any case I was able to shower half hazardly.After rads I searched for a drugstore that had 1 inch gauze to wrap my hand. Seems they only sell 2 inch. I would have to probably go to the surgical store for the 1 inch. But I am too tired to travel anymore today. Had to take off the wrapping when I got home to apply ointment to the rash. Can I use the 2 inch gauze to wrap my hand? She is not seeing me until next friday. She also told me to go tuesday and buy the sleeve and glove.She is the one and only therapist at my hospital, that takes my insurance There is also this tape she used to tape the bandage that looks like ace bandage, but isn't. I can't figure out what kind of tape it is, or if it matters?.",
      "MessageIndex": 2,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721799",
      "Title": "Arm Wrapped Today-First Time tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Hi Binney and otter and anyone I may have forgotten.What a pain in the butt, this is. Le therapist showed me how to do it,and gave me an instructional sheet.Honestly though I don't feel as though I am going to be able to do this. Saw a dermotologist yesterday, who said it was okay to wrap over the rash I have. The dermo also gave me a new ointment. I'm going to sleep with this tonight, and go to rads in the morning. Then when I get home I will remove it, because I have to put the ointment on the rash. Then I guess if its still swollen, I will try to wrap it. When I first got home I put two plastic bags over it-did my dishes and cooked dinner. Amazed that I was able to get everthing done. Every morning I take a shower. I plan to try and cover it in plastic tomorrow morning. What a big pain in the butt! Glad something is getting done though. Le said I have a mild case.Need to buy a sleeve, can't wait for my insurance. Tuesday I will get the sleeve and glove. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721799",
      "Title": "Arm Wrapped Today-First Time tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 26, 2008 03:41PM tomatojuice wrote: Thanks so much jinky. I was just on my way out.I was going to pick up another 2 inch, and try wrapping tonight. Hugs to you",
      "MessageIndex": 4,
      "PostDate": "26/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721799",
      "Title": "Arm Wrapped Today-First Time tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 13, 2015 03:58AM tomatojuice wrote: Is there anyone with similar aches and pains? I feel so isolated with this. Can someone provide some kind of feedback. Thank you ",
      "MessageIndex": 1,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832566",
      "Title": "Pain or aching under arm and when bending elbow tomatojuice paintThesky"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Live in Ny, no therapist, no sleeve , no gauntlet. In 2009 I had a therapist, a sleeve. All of a sudden as of last year my insurance does not cover any of these things. My old sleeve is not the right size and actually caused swelling when I tried to wear it. Had an infection last august that came on with a lot of pain in my entire arm, followed by a rash that traveled very fast. Had to go to the ER, where all staph infections, including lymphedema, are treated as if you had Mersa, until blood work comes back in 2 days.So I was given a new and powerful antibiotic, that made me nausea for a week. This whole event could have been averted , but the physical therapist at my hospital was inept. The hospital I go to touts be the best in the nation, but they no longer have a lymphedema specialist.In any case my old sleeve and glove no longer fit. I have searched the city to no avail to find a specialist that takes my insurance. I wear rubber gloves when i do dishes, and clean. I do lymph drainage that I learned when my insurance did cover a therapist. The thing is, this past 2 weeks I suddenly have discomfort under my arm, and in the outside bend of my elbow. I feel it everyday, just bringing a cup of water up to my lips. Sort of feels like mild cording(I had cording, a few years after surgery). Does anyone know why all of a sudden I feel this. Is it normal for lymphedema? Could there be an infection going on, without the rash? I have a emergency supply of antibiotics. Do not want to go to ER again. I have found Lymphedema life(as I am sure many do)and all the do's and don'ts difficult to adhere to. But I try. to not carry anything more than 10lbs, to not rub and scrub in my kitchen. As I write I realize I also have pain in my upper back, a kind of pulling, and this is not new. It started years ago. I am supposed to visit my daughter in Hawaii in beginning of July. Last 3 times I flew there without sleeve(no problem)But, I am concerned because the last infection was much worse than the others, I have had over the years. And now this aching pulling under my arm, in my back, and my elbow has me concerned. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832566",
      "Title": "Pain or aching under arm and when bending elbow tomatojuice paintThesky"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 15, 2015 11:22PM tomatojuice wrote: Hi tomboy and kareenie...I found a compression top, been wearing it, and being careful. Starting to feel a little better. Been looking ito pyrchasing a compression bra, like wearease, or the slimmer, and tanks. Anyone have any opinions on a good product. I realize that I have truncal lymphedema mostly. Thank you again I will look into the out of network insurance. I have done that once before with different doctor. Life is good until it isn't. So much on my mind right now.",
      "MessageIndex": 7,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832566",
      "Title": "Pain or aching under arm and when bending elbow tomatojuice paintThesky"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 14, 2015 07:16AM tomatojuice wrote: Hi Tomboy,I just wanted to thank you for responding. You have no idea how good it made me feel to hear from someone. Although it saddens me that there are others who also feel these pains. Thank you for your kindness and response. I will remember to keep you in my thoughts and prayers. I read online today that the humidity and heat can cause LE to flare. Taking extra showers may help.",
      "MessageIndex": 4,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/832566",
      "Title": "Pain or aching under arm and when bending elbow tomatojuice paintThesky"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I know this is kinda minor, but was wondering if aanyone lost there eyelashes from chemo. I finished chemo in August, but I just now noticed my eyelashes don't curl up, they point down.They look real weird.I have always had very blonde, almost albino like eyebrows and lashes, so I guess thats why I didn't really notice til today.Will they go back to normal? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722143",
      "Title": "Eyelashes tomatojuice ksmerrill"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I am convinced that nooneI g really knows anything for sure about lymphadema. I finished rads and chemo back in sept. 08. I have one more herceptin treatment. About two months ago broke out in a rash on my side. Attributed it to the herceptin(doctors did too). Today I broke out in an even redder rash, sort of spotted with maybe small amt of raised bumps on my inner arm. I looked real good in the mirror-I also have a few red bumps right under my arm, in my arm pit, and a light rash that travels down to the one on my side.This is not from herceptin! I am scared. I have a bottle of Ciprofloxacin in my medicine cabinet. I had demanded the doctor provide me with an emergency antibiotic, because I have had past problems with rashes. I am going to take it. Hope it works. I have no cuts on my hands or arm. My arm always mildy hurts me..all the time...but I figured this is normal.I am sorry, but I have to vent...always knew having lymph nodes removed would really be the worst of it. Now I get to worry about dying from blood poisoning from some bacterail infection. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733009",
      "Title": "Rash has me worried tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I have had seven rads so far. Everthing is pretty good so far.  Except today I noticed a little rib pain. Has anyone else had this? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721487",
      "Title": "Radiation and Rib Pain tomatojuice BarbW"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Had TCH April 23. Did anyone ever experience like shoulder pain. It runs across the top of my shoulders(on like my back)and neck area. It is sensitive to touch.Could this be just bone pain? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704657",
      "Title": "shoulder pain tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Surgery on tuesday Mar 25th. right total masectomy. Read that her+er-pr- can mean a poor prognosis. Don't know if its in my nodes. Can't stop thinking about it. I am scared. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/702617",
      "Title": "Her + er-pr- anyone else tomatojuice Shirlann"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Is this the normal regimen for TCH. Has anyone recieved it this way? Trying to make a decision between ACTH and TCH. Sort of need to know by tomorrow.Is TCH given in 6 cycles? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704181",
      "Title": "6 cycles of TCH tomatojuice esper"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Feb 23, 2009 05:22PM tomatojuice wrote: Hi evryone. Thanks for replying to my post. My dr. called today. First she told me about my echo-she said it was great-the herceptin not effecting it. So I'm good to go on march 4th for herceptin # 15. She did say something about my heart-an artery that has a little plk buildup, that I should exercise and eat better. I already am exercising my butt off-because I have osteopenia. I asked about the ct scan. She said there is no cancer found in my liver. Whoopy I felt great. Then she added that they did see some little things. They think they are probably little cyst. My dr. totally creeps me out. We do not have a good relationship. Anyway she is a fellow or something, and not a real doctor. She'es leaving in May. Then I get a new fellow.Anyway she can't figure why my alp is elvated.So she's not convinced with the results of the ct scan, because she's scheduling me for an ultrasound. Oh well! Also they found a cyst on my ovary. So I have to see a gynecologist. I take klonipin to sleep. Have been since chemo started. I read that it can raise your alp. So I have decided to go off it. Actually my gut tells me that it is the herceptin that is elavating my alp.I'm feeling better though. Just hearing those words-no cancer in your liver. My sister passed away from breast cancer in 2003. I remember how it spread from one organ to the other very quickly.Within a year of diagnoses she was in crippling pain. What a sweet heart she was though, she lived (even in pain) joyfully to the end.",
      "MessageIndex": 5,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729510",
      "Title": "Worried about C-Scan Results tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Feb 23, 2009 06:13AM tomatojuice wrote: thanks sue.... hopefully I get results today. I had the scan on friday.",
      "MessageIndex": 2,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729510",
      "Title": "Worried about C-Scan Results tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Feb 26, 2009 06:05AM tomatojuice wrote: Hi Tender ...Nice to hear from you. Yes I have had a bone scan. Something lit up in my neck.But I knew it was from a car accident many years ago. Even so I had an MRI to confirm it. So my bones are okay. The miscommunication with my dr. is not because she is a fellow. The dr. I had before her was wonderful. I'll be getting a new one in May.They can't figure out why my alp levels are elevated. It must be medication related. Normal for me is between 85-95. They have been running about 120 all through chemo and herceptin.My real worries, right now, is the cyst on my ovaries.I see a gyncologist on Mar 13. Oh well I have lots to keep me busy, so really the time spent pondering over what will be is limited, thankfully. Take -have great day",
      "MessageIndex": 9,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729510",
      "Title": "Worried about C-Scan Results tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Feb 26, 2009 03:13PM tomatojuice wrote: Hi helena...sorry for not answering your question sooner. Yes I had the brac test. It came back negative. I was very surprised, because not just one, but two of my sisters had breast cancer. One passed awy. The other is an 8 year survivor.",
      "MessageIndex": 12,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729510",
      "Title": "Worried about C-Scan Results tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I have had elevated alkaline phosphotase levels for a year now, ever since beginning chemo. So my doctor sent me for a cat to see what the problem is. I am so worried about the cancer spreading to my liver.I get the results hopefully on monday. Has anyone else experienced problems with liver enzyme levels from chemo or herceptin? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/729510",
      "Title": "Worried about C-Scan Results tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 2, 2008 07:46PM tomatojuice wrote: I am 6 months post op. Two months ago I developed pain and cording in my arm. I had 18 nodes removed. Are you seeing a physical therapist for your arm. Might be a good idea to get in touch with a therapist, because of the swelling. Also  you should find a LANA certified therapist, because having 19 nodes removed means you are at risk of developing lymphadema. Hopefully that is not the case, but to be on the safe side, you should have your arm checked. Also there are exercises(stretches) that you should be doing post-op. A LE therapist can advise you about certain exercises, and also simple life long protective measures to help prevent swelling or infection.",
      "MessageIndex": 3,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720532",
      "Title": "arm pain Deedee79 Binney4"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Was told by Onc today that I have a little lymphedema in my arm. He is going to refer me to a therapist. Just wondering if everyone gets it. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/706356",
      "Title": "Does everyone get lymphedema after a lot of nodes removed? tomatojuice bomber410"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 5, 2008 08:37AM tomatojuice wrote: Thanks evryone for your replys. They really helped me to get things moving. I also want to get things over with soon as possible. Also all through chemo I have had no problems with my blood counts. I did some reading about rads and found out about simulation etc, So realizing it takes time just to set up-I rescheduled my appt to 8 days after my last chemo. So I will see the rad onc on the 14th, instead of the 22nd and I feel so much more comfortable with that. Hugs and gratitude to all.",
      "MessageIndex": 5,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719011",
      "Title": "When To Start Radiation tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Was wondering how soon after finishing chemo is it usual to start radiation?I am having final chemo aug 6th. Have a consultation with radiologist on aug 22nd. Was wondering if it would be wise to try and see her sooner? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719011",
      "Title": "When To Start Radiation tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 10, 2008 10:55AM tomatojuice wrote: Got my appt. moved up again to the 10th-tomorrow. Feel good about it-really want to just keep moving along. Although my wbc (neutriphils) were kind of low this time. I did get the neulasta  shot. Hopefullly they will go up. I can feel it too. I am much slower moving around than I was any of the other chemos.A little concerned about riding the bus tomorrow, and just going into the hospital to see the rads onc.",
      "MessageIndex": 8,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719011",
      "Title": "When To Start Radiation tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 2, 2008 01:23PM tomatojuice wrote: Been taking klonopin .5mg since my diagnoses this past February. Helps me fall right to sleep at night.Only problem is, its addictive. I'm now up to 1mg. nightly. I have taken this before in my life, so I know that you cannot just stop taking. You have to cut  back very slowly. I plan on cutting back, soon as all my treatments are over.",
      "MessageIndex": 5,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/720447",
      "Title": "Anyone out there taking anti-anxiety meds? Wink PugMum"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Was just wondering if anyone else has a similar experience. I am only 2 weeks post-op masectomy and ALND. When I awake in the morning, my arm and incision area feels pretty good, but as the day progresses, I notice it becomes stiffer and slightly swollen and sore.By the time I go to bed at night its pretty uncomfortable. I sleep with it raised on a hard pillow. Next morning it starts all over again.I have spoken with quite a few women here, who say that this does get better. I have been doing the exercises, but slowly, probably only once or twice a day. I have so many other stressers going on in my life right now, I guess I just need to hear from someone. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703510",
      "Title": "Night swelling in arm tomatojuice otter"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: just finished wrapping my arm for the second time this weekend. Last night ripped off the first onr, because the rash underneath was itching so much. Just finished another wrap.My fingers look a little pinker than my other hand.Also noticed I only wrapped just below the knuckles.How do you know if maybe you've done it too tight.I can bend my fingers and my wrist,and elbow. Want to keep this one on through the night, and maybe all of tomorrow.When I was wrapping, I felt very lonely, because I know if one of my children were here they would help. This ain't easy. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721939",
      "Title": "Wrapping-how if know if you did it right? tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 28, 2008 04:52PM tomatojuice wrote: Thanks so much     binney and footprintsangel .Really needed support with this one. Although things are a bit arkward-it does feel good(an accomplishment of sorts)to have done it.Yes we can win Debbie",
      "MessageIndex": 3,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721939",
      "Title": "Wrapping-how if know if you did it right? tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 11, 2008 09:31AM tomatojuice wrote: Hi sandy Thank you for your kind words. This morning I go for treatment #1. The tech is a nice enough guy. I will deal. The ceiling where I'm at is also attractive. Its a sky full of stars, like the milky way. Before my dx I was moving right along in a very creative way. Drawing and sketching. Was even planning to maybe start an etsy.com site, with some prints of my drawings. Since diagnoses I have not picked up a pen or pencil. I can't seem to get back to that place inside, that allows me to think creatively. I am homesick for my life. I love to go to etsy and look at the things people sew. Dolls and felting, and quilts. This desease takes up alot of my time. Like it has become my project. The only real respite I get is through walk aerobics,which I do pretty much everyday. I also work two, sometimes three days a week cooking and cleaning.My daughter lives half way around the world. She came home for the first two months of my chemo.",
      "MessageIndex": 5,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720988",
      "Title": "Rads started today tomatojuice Linalee"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 10, 2008 11:08PM tomatojuice wrote: Hey Earl I have to say your statement about the gay radiologist made me laugh out loud. I don't know why. I also had a gay chemo nurse, who I really liked alot. He was so sensitive and caring, and he told me I was one of his best patients.Thanks redheadace for your well wishes. The same to you also.",
      "MessageIndex": 3,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720988",
      "Title": "Rads started today tomatojuice Linalee"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "May 27, 2008 10:05PM tomatojuice wrote: I'm doing TCH. It's taxotere, carboplatin and herceptin every 3 weeks. My third is on June 4th. The first and second treatment were pretty much the same for me. I also get a nuelasta shot  the day after the chemo. For me I have felt pretty much okay, til about the third day-then I got a little emotional, and felt kinda wired. I think the steroids made me feel that way. Also had a metal taste that lasted for a couple of days.I did not have any nausea. They put zofran in the I.V. to prevent this. My Onc also gave me a script for phenergan, but fortunately I have not had to use it. Around day 10 I had a mild case of diarrhea in the mornings for a couple of days. By around day 12 I usually feel great. The third week is great. Its like a little vacation before the next treatment. All in all Its way better than I expected. So I'm hoping the next 4 treatments is more of the same. Because it is just so doable. I have also been able to carry on as usual throughout the first two treatments -shopping, walking around the city. Doing my part time job. Even exercising-walk eorobics, and a bit on the treadmill. I know evryones different, but I think with the antiemetics and the steroids that chemo se's are not as bad as they were years ago. Hopefully, and probably it will be okay for you to.",
      "MessageIndex": 1,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706285",
      "Title": "Taxotere & Carboplatin Vicki5 chumfry"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Can anyone share with me their experiences with this drug. Dr. at my hospital is really pushing me to have it. I am post-menopausal. Have't seen any studies for women in my category. But I think there are some ongoing. Anyway, it would be twice a year for three years. I do have osteoporosis. But she says it will help stop the cancer from coming back. The side effect of jaw necrosis scares me, because I have problems with ny teeth right now. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723696",
      "Title": "Zometa anyone? tomatojuice GrammyNancy"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "May 17, 2008 07:17PM tomatojuice wrote: Thanks so much Tender. I will probably take one tonight.",
      "MessageIndex": 3,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705712",
      "Title": "2nd chemo-nuelasta aches? tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Had 2nd TCH May 14. Feel kinda achy. All I really have in the house to take is Tylenol/wBenydral, and some herbal arnica.Get really scared after chemo. I have always been a  nervous wreck kind of person.Just know I might need to take something in order to sleep tonight. Don't want to start calling doctors, etc. I have seen posted on here that claritan works, but I don't have any. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/705712",
      "Title": "2nd chemo-nuelasta aches? tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 22, 2008 07:25AM - edited Sep 22, 2008 08:08AM by tomatojuice Hi Kathi, Just got up, really not awake. Rads #8 this morning. Glanced at your blog, love love love it. Your photos of the trees were soooo beautiful. Can't wait to check out the whole blog,later. Hugs     The sci-fi feeling is exactly how I always feel when I'm there. But my rads tech (the one who is so so gorgeous)turned out to also be so so cool(or hot-pun). When he finishes setting the machine, he says\"Lets Fly\". ",
      "MessageIndex": 8,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720988",
      "Title": "Rads started today tomatojuice Linalee"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Went for filming today. Lasted about thirty minutes. I hated it. The radiologist was so young. He looked like someone you would see surfing in Hawai. He was so young. He was friendly and nice and all. I just felt so humiliated lying there half naked, a wreck of a near 60 year old boob that nursed two chidren. Well thats my hangup, I guess. Rads for me is sort of creepy. It scares me alot. When I got home tonight I drank two glasses of wine, and I never drink. Tomorrow I begin the first of 29 days. Its all good though, I know it is. I will have done everything I can to stick around a bit longer hopefully. I am also doing herceptin evy 3wks for a year. I have to say though, I'm so glad its finally under way. But I have some swelling in my hand already, and the threat of lymphadema looms. As soon as I'm well enough, I am going to have the other breast removed. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720988",
      "Title": "Rads started today tomatojuice Linalee"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: had 3rd chemo TCH yesterday-and nuelasta shot today. I just want to eat constantly. Here it is 11 p.m. at night and all I can think of is making some sort of sandwich or something. Does this happen to anyone else? I do not normally ever eat past 7 p.m., as I feel it is unhealthy. Could it be the steroids? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706831",
      "Title": "Ravenous hunger after chemo tomatojuice LoriFL"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 22, 2008 01:34PM tomatojuice wrote: midsum I never really did find out yet what the bolus is. I get mon,wed and friday. They put this yellow bubble wrap looking mat on top of my chest, and then I think I get a bigger dose than on the other days. Today was #8, and so far my skin is fine. I use the cream they gave me aloe gel 100 0/0. I was really freaked out in the beginning-thinking about how I was being fried, feeling like I was on an alien spaceship Etc. But I have relaxed alot. The technicians at my hospital, and the nurses and doctors are so friendly and nice. Now I lay there and think of good things. The ceiling is wallpapered like the night sky, so mostly I think of what its like to really be on the top of some mt. looking at the real milky way.",
      "MessageIndex": 266,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 11, 2008 01:35PM tomatojuice wrote: Gee Kristyann I sure hope I didn't scare you, being you will start next week. Most people here describe rads as a walk in the park compared to chemo. And it is really easy. I am just a nervous wreck kind of person, have always been that way. I think dealing with this for 7 months now is getting to me. Thats why for the first time since dx I'm looking for some help.I also was offered an anti-depressant, but turned it down. Today was my 1st day of rads, I know I will feel better about it tomorrow. Doing something you enjoy is a key factor. You will do fine.",
      "MessageIndex": 141,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 13, 2008 01:17AM tomatojuice wrote: Anyone have trouble sleeping since having rads? Had to take exrta meds tonight. Just can't sleep.",
      "MessageIndex": 162,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 11, 2008 01:03PM - edited Sep 11, 2008 01:04PM by tomatojuice Just back from my first of 29 rads. I told the tech I hated it. Also told him I thought I could smell it. He asked me what it smelled like, and I said burning flesh. He said no way. I don't think it is really possible that I smelled it. Definately must be pychological. After I left I walked over to Sloan Memorial kettering seeking breast cancer support services. I couldn't find the right building, so I will go back tomorrow. I know its fast, and it doesn't hurt,but wow it really bothers me. I hate it so much. The tech did tell me though that I was an easy patient. When I was finished I just wanted to run out of there. Hoping it gets easier !",
      "MessageIndex": 139,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 29, 2008 06:30PM tomatojuice wrote: Hi everyone. Had simulation done on Aug. 19th. They said they would call me to start in about two weeks. Maybe the week of Sept. 8. Want to get going with it. Still have to do herceptin every 3 weeks for a year. Had 1st herceptin treatment this past wed. Bought some aloe vera cream in the health food store. Its 84% aloe. Been using just to prepare for rads,but I don't really like it. Its so greasy. Going to be looking into other creams-maybe calendular or the acuaphor.",
      "MessageIndex": 26,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 11, 2008 03:21PM tomatojuice wrote: Hi Roberta I had alot of dry mouth from chemo. I found sucking on peppermints really helped alot. You know like the ones that come in little tins(deltoids, or neumans own organics).",
      "MessageIndex": 144,
      "PostDate": "11/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 12, 2008 07:21PM tomatojuice wrote: Had rads #2 today. Everything went well. I guess I was just fearfull of the unknown the first day. Today it was just fine. Very easy. All you have to do is ly still for about 10 or 15 min. They told me today that evy mon,wed and friday I will be getting a bolus. They put something over my chest area, and then it seemed like they gave me an extra dose of rads. Did anyone else have this, or know what it is?",
      "MessageIndex": 157,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 12, 2014 06:14PM - edited Sep 12, 2014 08:28PM by tomatojuice This is the only place I get real understanding. Thanks to all ..aaah its a damn shame, but a blessing too, for all of us that we support each other!",
      "MessageIndex": 13,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/824477",
      "Title": "Clindomyacin question: please help! tomatojuice Luvmydobies"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I have a fever and watery eyes. My most recent infection started in the same way. I realize having had 3 infections this year that I need to see an infectious desease doctor. But in the meantime If another infection comes on fast this weekend i don;t want to end up in the ER. I do have a prescription for clindomyacin. Has anyone ever taken this. I heard it can cause associated diarrhea more so than others. Please respond very worried! Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/824477",
      "Title": "Clindomyacin question: please help! tomatojuice Luvmydobies"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 12, 2014 03:38PM tomatojuice wrote: Thank you all for posting. still not feeling 100% today. Eyes still a little watery. Have to believe its just a cold. My hand a little swollen. Going to a outpatient clinic today for LE, see if they will take me,or at least give me an appt. Had my oncologist fax over referral. The weekend is approaching, and my doctor is not in today, and all I have is script for Clindomyacin. Cannot reach any DRs. on weekend, so ER would be second alternative. I also fear C.diff, as my doctor explained it to me. The antibiotic I just finished, ZYVOX also causes C. diff and even blindness if taken for more than 28days. I took it for 7. On last day had one bad watery diarrhea and thats it. I have been on Probiotics(RAW VEGAN)for many months before  all this, so I think it helped. Have read different opinions about staying on probiotics while on antibiotic therapy. I actually went off for the 7 days, then resumed at the end of treatment. Sorry to anyone who has had to deal with c.diff. very scary, but it is a risk I will have to take. This last infection spread lightning fast. Thank you everyone!",
      "MessageIndex": 10,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/824477",
      "Title": "Clindomyacin question: please help! tomatojuice Luvmydobies"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Am I the only breast cancer patient with mild lymphadema, that is plagued with rashes. I just finished 10 days of ciprofloxan yesterday. Now today, I see another flare up of a rash on my arm. This will be my fourth rash since surgery. Is there anyone who knows, or has had a similar experience? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/733802",
      "Title": "RASH Anyone? tomatojuice sushanna1"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 17, 2008 11:02PM - edited Aug 17, 2008 11:04PM by tomatojuice Hi Tender Thank you for you for keeping me in mind. I have been on the keflex three days now, and the red streaks are still on my arm. They have not gotten any worse, but they have also not gotten very much better.I am concerned. Will be calling my onc tomorrow morning. Tuesday is simulation day for me with rads. Wednesday I am having a ultra sound of my arm to look for blood clots. Thursday will be the last day on the keflex.My hand is still swollen more than usual. I was told while there is an infection, no exercise, and no massage. Basically just been keeping arm raised up on pillows for intervals of 45mins.",
      "MessageIndex": 12,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Having simulation for radiation on Tuesday.Presently have infection and swelling in arm and hand(lymphadema). Was wondering if the tattoos they put on you could be harmful to the lymphedema?( since from what I hear threy are small pin pricks with ink). Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719638",
      "Title": "Simulation & Lymphadema tomatojuice LorenaB"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 16, 2008 09:40AM - edited Aug 16, 2008 09:43AM by tomatojuice Made it in to the onc yesterday. Her and some other doctors looked at my arm. Said they thought it may be an infection and that I should start on some Cephalexin(antibiotic). And if that does not clear it up that I should get an ulltra sound to check for blood clots. So I suggested why wait for the ultrasound since this problem has been aroun since chemo#3.Started the cehalexin yesterday. Ultrasound on Monday. They asked if I had a sleeve-which I don't .I have a prescription for itbut have not filled it.They said to really limit the use of my arm. Went a concert outdoors at Licoln center last night. It was elctronic dance music combined with the Joshua light show from the 60s.It was great,but I kept noticing the swelling in my hand. This morning I woke up, and its more swollen than last night.I am scared and depresed about it.I tried callling the le therapist , but she never called back. Its the weekend now and I don't kow whatelse to do. But I am worried.They told me to continue with le exercise,but don't overdo anything. Now I am unsure exactly what to do. Rover I canot really explain cording, eexcept that it looks like cords running down your arm(maybe look up Axillary web syndrome) and that should explain it. I am sure someone else on her can explain better.",
      "MessageIndex": 8,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 7, 2008 04:51PM tomatojuice wrote: Had my 3 rd chemo TCH on jun 4th. Everything is all aches and pains for me on the 3rd day after. Today my port hurts, under my arm, and my breast scar is even real sensitive. Thankfully only minor nausea in the morning.Went alone for this treatment, as my wonderful daughter had to return home, after being with me for more than a month. My son did insist on picking me up though. Have to admit that there is so much more anxiety, when you are alone. Being at chemo wasn't so bad-the nurses are so nice, but having to put my head down on the pillow that night to go to sleep-I felt so anxious-just the thought of all these crazy drugs inside me. Its scary sometimes.I know I need to find some distraction, just haven't figured it out yet. Have never minded being alone, til now-now I really relish being with family. Thankfully my brother and nephew are coming over tomorrow. Dreading the next three chemos already.Its a bad day for me-probably will feel better tomorrow and be more positive. Its that nuelasta shot and the steroids.",
      "MessageIndex": 765,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 8, 2008 10:35PM tomatojuice wrote: Hi everyone. Roxi Thank you for your kind and sensible words. They are so true. Rock I really appreciated your comment about frieda kahlo-art is what I do. Although I have not picked up a pencil or brush since my diagnoses.",
      "MessageIndex": 779,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Today my arm developed red streaks running down where the cords run. It hurts like hell. Did this ever happen to anyone? My last chemo was aug. 6th. The arm is driving me crazy. It was healling before the last chemo. I felt good about that, because I'm starting rads the end of the month-and I was hoping to start with a good arm. One night about two months ago, I awoke in the middle of the night-I moved my arm in some strange way that the pain woke me. In the morning there were two bruises under my upper arm. Has that ever happened to anyone?Does anyone besides me and otter think its caused by the taxotere?My sister passed from this in 2003. I remember so vividly the constant problems she experienced with her arm right from the beginning, she relied alot , maybe too much on vicodin. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: have splotch of red on my stomach. This is the second time. Had it last year also. Started lymph massage with therapist in the truncal area, and it reappeared. Been on keflex 10 days and its still there . Very worried. It doesn.t seem to be going away. Have five more days of keflex. Also have doctors appt on the 19th. This is freaking me out. Anyone with similar problems. I know that the doctors will not know what to do, because they didn't the last time. They said they didn't know what it was, and sent me to dermatology. The derms biopsied it. They also didn't know. I know its an infection. The first day I took the keflex, the antibiotic cused it to go through some color changes, but themn it went right back to the way it was the next day. Help! Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790432",
      "Title": "truncal lymphadema infection tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 7, 2008 05:25PM tomatojuice wrote: hi eddie I don't really have anyone to ask. Oh well! As far far as the shave thing. My hair started coming out in clumps 3 weeks ago.There are just some scraggy strands left. Don't know why, but I just decided to leave it. My hair has always been fine,but even so when it started coming out like that-I was a wreck. Now it seems real simple. I have a bunch of pretty scarves-throw one on-and I'm good to go. Also www.heavenly hats sent me some beautiful brand new beanies for the fall and winter.(FREE) They are great-there all kangol hats.They made me so happy-I sent them a donation, and plan on sending another. I got them yesterday. Trying them on was the best part of my day today.Sure are some wonderful people out there.",
      "MessageIndex": 767,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 7, 2008 06:22PM tomatojuice wrote: Hi rockthebald I know what you mean about a little treat before chemo. Before my second chemo, my son and daughter and I went hiking in the catskills,we actually saw a bear in the woods, and had a campfire. It was so great. My daughter lives in hawai. I was planning a trip there-I'm still planning it.I do actually get out. I am an avid walker. The day after chemo-walked all around the village-bought some scarves on 8th st.Took myself out to dinner of sorts-a favorite pizza place by NYU. Its just that 3rd or 4th day.",
      "MessageIndex": 770,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 27, 2008 11:39AM tomatojuice wrote: Don't always post on here. Don't really know everyone, but would like to. Some of the names though are very familiar from other areas. Well yesterday was chemo #4. Doin fine so far. My Onc left to take up private practice in California. Will miss him, great guy, gentle, loving and funny.He told me to cut back on my steroids. Usually take one day before and day after. He said I don't need it. So I didn't take it today. So far so good. Two more trips and then rads.",
      "MessageIndex": 1105,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 28, 2008 04:00AM tomatojuice wrote: chemo#4 Nuelasta shot yesterday. Pains and aches all over-slight nausea. Can't seem to distract myself with anything.Having difficulty just getting past this day. Can't wait for tomorrow. Want to go out and walk around. Just feeling too sick.",
      "MessageIndex": 1111,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 7, 2008 10:26PM tomatojuice wrote: everything sucks. my arm is not healed from the axillary disection-I often think of myself as a paper doll-there is something under my armpit-it feels like someone took a thumbtack and stuck it there to keep it together. My breast area often feels like its being stretched to the limit.The metal taste sucks. Just think 3 more of these treatments, then they will radiate my arm and breast. Whats wrong with me? My baby sister died from this, and I can't remember her ever complaining.I miss her so much. Having this G........desease just makes me miss her more.",
      "MessageIndex": 773,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "May 13, 2008 11:59PM - edited May 14, 2008 12:00AM by tomatojuice Hi everyone Robink -please add me to your list.Would love to join this group. I started chemo(TCH) on April 23. My second treatment is tomorrow May 14. First one went pretty well. No nausea, no diarrhea, no constpation. Day 4-metallic taste-lasted a few days. . Day 7 -got a cold(runny nose)for 6 days. Also small rash on my face. All in all not too bad. Hoping the second will be pretty much the same.",
      "MessageIndex": 245,
      "PostDate": "13/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 21, 2008 12:31AM tomatojuice wrote: Thanks Tender and Binney. I called my onc, he thinks maybe it might be a little swelling from the taxotere. He mentioned exercising it a little more than usual. I did ice it yesterday for only five minutes at a time, and did extra crawling figers up the wall, and angel wings on the floor.I think it feels a tiny bit better. Thank you both so much for your help. Just wish this wasn't happening right before my next chemo.Having the cancer is one thing-at least for the most part everyone seems to know and even understand that women get breast cancer, and go bald, have masectomys etc. But lymphodema - whats that? Its the extra painful sidekick!",
      "MessageIndex": 3,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707742",
      "Title": "Banged my hand-now whole arm hurts? tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I have two red lesions on my elbow. They have been there about two months. I just thought maybe it was some kind of rash. They itch a little. I finished breast cancer treatment a few months ago. Now I am wondering if this is skin cancer. I have an appt with my medical doctor this friday. I don't know if he will be able to say what it is. I have an appt. with the dermatologist next friday. But, I am freaking out. Next friday seems like forever right now. Does anyone know anything about breast cancer metasticising to the skin? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740193",
      "Title": "Metastatic skin cancer after breast cancer tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 12, 2009 12:41PM tomatojuice wrote: Hi Leaf... Thanks for the info. The site was actually the most informative that I have seen. It was very technical though. Seemed more geared to doctors or med students. But that was okay. There were lots of pictures. I went through them all looking for a match. Waiting makes you nuts. On the surface I continue to be me, but inside worrying makes me sad(predicting the outcome before it happens).I cried when they told me I needed the biopsy, and I am waking and going through the day with a sort of sadness in my stomach.",
      "MessageIndex": 4,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740193",
      "Title": "Metastatic skin cancer after breast cancer tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Will be starting chemo April 23. Dx 2/26/08 IDC<2.7cm,stage IIb, 3/18nodes, er-pr-her+ Oncologist strongly reccomended DD ACTH. Having a ECHO and a port put in on friday. He also left it up to me, if I wanted to have TCH. And, also offered me to be in a trial that uses ACTH in different dosing patterns. There are four arms to the trial-a computer chooses which one you will be in. I do not think I will choose the trial. I am really leaning towards the DD ACTH. I am afraid of what I have heard and read about the possible effect on the heart. At the same time I am really afraid of this cancer. My baby sister passed from it in 2003. Would really appreciate hearing from other women, who have successfully completed DD ACTH. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704118",
      "Title": "Chemo decision-overwhelming tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 18, 2008 09:19PM tomatojuice wrote: Hi I am exactly three weeks post op right masectomy. Also had axillary disection. My arm was sore for the first two weeks all the way to my wrist. Amazingly, all the soreness up to my elbow went away about 1 week ago. The upper under part of my arm is still a bit sore. But my range of motion is coming back. But yes the site where the drains were are still tender, and also beneath them-down to my ribs. There is also a tiny bit of swelling there.",
      "MessageIndex": 4,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704139",
      "Title": "Sore rib siona siona"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 11, 2008 06:00AM - edited Aug 11, 2008 06:01AM by tomatojuice hi ellen. The american cancer society sent me 6 bras and a breast form for free. Two of the bras were new. The others were used, but were cleaned. I am living on a very limited income, and could never afford masectomy bras. Anyhow, if you don't mind slighty used, you can call them at 1-800-221-2141, and tell them your predicament.",
      "MessageIndex": 5,
      "PostDate": "11/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/719215",
      "Title": "Cheap mastectomy bras? Elliemae32 djb1960"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: woke up so nausea! two days after neulasta shot . Chemo 4 on the 25th. Afraid to take the phenergen that the onc gave me. Has anyone else had any experience with it for nausea? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708213",
      "Title": "phenergen - please help tomatojuice catlover44"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 17, 2008 08:48AM - edited Apr 17, 2008 08:49AM by tomatojuice Hi! Starting chemo April 23. Having an ECHO today. Port on Friday. My oncologist reccomended strongly that I do DD ACTH.But left the decision up to me, if I wanted to do TCH. He felt it would be better to attack it aggressively, since one of the three nodes involeved had branches coming out. He also said I will probably have radiation at the end of chemo. I am really scared, mostly of the prospect of possible heart SE from the Adriamyiacin. He did say that most of the women who did get heart se in the studies were over 60. Well I am 58, pretty close. Well looking forward to hearing from others experience with chemo. Love love this site. It has carried me from the very beginning of this journey. Just wondering whats it like to have the port put in?                                                                                              DX 2/26/08 IDC, 2.7cm,stage IIb, 3/18 nodes,er-pr-her+",
      "MessageIndex": 266,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 27, 2008 03:12PM tomatojuice wrote: Anyone having problems with constipation? you might want to try \" Multi-Fiber\" by Natures Scent.You get them in the health food store, and some pharmacys. When I had my surgery I had four days of constipation. Colace did not work for me. The nurse even gave me a suppository that I had a bit of a bad reaction to. The fiber tablets work great. My son turned me on to them-he takes them on occasion for constipation. I was constipated yesterday-took just one of these tab. last night, and this morning I'm fine.",
      "MessageIndex": 512,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: My arm has been hurt for the past three days. Been trying to figure out why It is the arm that had the axillary disection. Since surgery it has been healing pretty well-with the exercise and all. 3 days ago it started feeling like it did right after the surgery. Hurting all the way down to the wrist-having trouble raising it. Was thinking maybe it was the chemo(taxatere).Today I remembered that I had banged my little finger into something in the kitchen last week(I can't even rember what). But even today my finger still feels bruised. Could this cause a problem for the arm? Won't see LE therapist til july 9. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707742",
      "Title": "Banged my hand-now whole arm hurts? tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 14, 2008 07:42PM tomatojuice wrote: Hi otter ,susan and Tender! I just got in from long difficult day. I work part time, cooking and cleaning for someone. Keeps me busy at least two days every week. The people I work for also thought I should get to the doctor. Just called the doctor on call at my hospital-he didn't know what cording was -and he said to put warm compresses on it and some tylenol. He said I would probably be fine until tomorrow morning. Tomorrow I will call my doctor first thing. I'm so creeped out. Was celebrating today, because today is my first day out since chemo#6. Been pretty sick and weak every day since.My blood counts are the lowest that they have been.Oh man I hope its not cellulitis!My stomach is still all messed up, and my gums hurt around my bottom teeth, especially one tooth. It looks like the gum is receding down away from the tooth. I wear a partial denture on the bottom, but I have not been wearing it-hoping the tooth will heal.Thank you all so much-don't know what I would do without you-my sisters-maybe I would have put off calling the doctor?",
      "MessageIndex": 4,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 14, 2008 09:24PM tomatojuice wrote: Hi LoriFL Yes I do have a port, but its on the opposite site. I was thinking that it might be some kind of neuropathy, only because the same pain, in the same area happened after two different chemo treatments. But this time there are two red sort of stripes that run through the cording in my elbow. They are about two and three inches long. Do you think you could tell me how this could be related to having a port, I would appreciate it. I am definately going to get in to see my oncologist tomorrow first thing.",
      "MessageIndex": 6,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 16, 2008 12:26PM tomatojuice wrote: Hi Tender. The bruising and bueishness happened about two months ago. It was on the under side of upper arm.  When it happened, it woke me in the middle of the night(the Pain). In the morning the bruising was there. But they went away within days. What I have now are red streaks that run don my arm-from elbow down about 3 inches long. This really all happens fast. My hand was pretty swollen this morning when I woke up. Was hard to make a fist. It has come down a little. I found out from the surgical druggist where I need to go that the person I need to see about a sleeve and glove will not be in til Monday. My insurance will probably cover it, but it will take about two weeks to get it.The le specialist I saw after chemo #3, made me feel as though ther was no rush to get the sleeve. I tried to reach her yesterday, she didn't call back. I remember now she told me she only works part time.I am really not comfortable with her. But I don't know what I can do about that. My insurance is specific to only my hospital. Anything I need, I have to have done there.For me to request another therapist would be very arkward.I have good doctors. My rad onc in great. So far she is the only one that from the beginning I have not been comfortable with. I am sorry about going on and on. My feelings about her could just be-that from the very moment of diagnosis with bc I have thought of the possibility of getting lymphadema. I will probably spend the weekend with my arm raised  up on pillows-just sitting around. I am a little freaked because I cannot do my exercises. Exercising keeps me sane. I am in shock that my hand is swollen.Like everyone else I will learn to deal, but right now my coping mechanisms are dwindling.",
      "MessageIndex": 10,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719498",
      "Title": "My arm-my arm- always something new tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 23, 2008 11:00PM tomatojuice wrote: had 1st TCH today. Feeling good so far. Was so sick yesterday after bad reaction to anesthesia(when I got the port). Threw up all the way home(also had a large headache)-when I got to my front steps-puked all over the place in front of my neighbors. It was so awful-really never thought I'd make it to chemo. But my daughter made me some fresh ginger tea-and it worked like a charm Took away the nausea. Then I took some benydyl and a sleep aid. Conked out, slept 9 hr. - woke -felt great-went to chemo.Just so glad I didn't have to delay it. Tomorrow I go to get the neulasta shot.",
      "MessageIndex": 426,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 27, 2008 03:45PM tomatojuice wrote: thanks otter for the good info. Boy you sure seem right on top of things. Good to know about the tylenol and neutrifils. I did though take the tylenol w/benedryl last night-had to get to sleep. Also last night I started to have (I guess what is)some bone pain. I still have it this morning.Its like a sore feeling across my shoulders and a bit down my spine-sensitive to touch even.And sporadic little aches in my upper leg. But nothing that I need pain management for. And today the metallic taste that I had a lot of yesterday is mostly gone(Yay).It's very easy to become anxious about the se's, at the same time trying to be cautious.Sort of feeling a little nausea-trying not to take a phenergen just yet. Today is the fifth day-overall not that bad. Just anxious-keep thinkning about the buildup of all these treatments. Guess I'm not having a very good morning.Sorry to anyone out there.Know it can't really be good for anyone-except that we are being treated.",
      "MessageIndex": 514,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Oct 2, 2008 06:57AM tomatojuice wrote: Hi OneBadBoob-Jane    Would it be possible for you to say which hospital it is in nyc? I live here. Have been living on a limited income for some time. This has certainly sparked my curiosity. I am supposed to go to today to pay out of pocket for a sleeve and glove. It is going to be a real set back for me. But LE therapist feels I cannot wait for my insurance to decide(which will be about 1 month).If you want to, you can e-mail me. Thanks and hugs!",
      "MessageIndex": 12,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/721989",
      "Title": "What's up with insurance coverage for LE garments? otter DoreenF"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 2, 2008 10:13PM tomatojuice wrote: I had masectomy on Mar 25th. Saw my surgeon on 31st. But have still not gotten the full pathology report. Called my Oncologist, who is going on vacation next week.Actually called him 3 times. The secretery told me to quit calling,that he has my message and will call me when he gets the report.The whole thing has me a little freaked, because I really want to(hopefully)be told the results in person-not over the phone.                                            DX 2/26/08 IDC , 2.7cm, er-pr- her+",
      "MessageIndex": 13,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/703183",
      "Title": "Climbing the walls...Pathology How Long?? crazydaisy beergirl"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I saw Cristina Applegate on the Larry King Show the other night. For some reason she was chosen to speak on their special for HEROES. I really don't know why she was chosen. She made a statement that upset me very much. I just finished 35 rads treatments a month ago. I have to say I feel great. I feel healthy, can run up my 5 flights of stairs , if I need to. But I do feel a pychological tiredness, a feeling like I need to rest after this whole ordeal.She said something like rads was suggested for her, but she turned it down, because she couldn't deal with putting this awful stuff in her body. Well you know what there are those of us still alive because we had rads, and we don't need to be reminded of how bad it is. Or for that matter those who may need it, do not need to be frightened. She attributed her positive attitude, to going to some church. I was positive before cance, and am still positive, and I never go to church. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I saw Cristina Applegate on the Larry King Show the other night. For some reason she was chosen to speak on their special for HEROES. I really don't know why she was chosen. She made a statement that upset me very much. I just finished 35 rads treatments a month ago. I have to say I feel great. I feel healthy, can run up my 5 flights of stairs , if I need to. But I do feel a pychological tiredness, a feeling like I need to rest after this whole ordeal.She said something like rads was suggested for her, but she turned it down, because she couldn't deal with putting this awful stuff in her body. Well you know what there are those of us still alive because we had rads, and we don't need to be reminded of how bad it is. Or for that matter those who may need it, do not need to be frightened. She attributed her positive attitude, to going to some church. I was positive before cance, and am still positive, and I never go to church. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/725120",
      "Title": "Christina Applegate and radiation tomatojuice deadlanguages"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 28, 2008 01:51PM tomatojuice wrote: Thanks everyone for your post.I did take the phenergen at around 8:00 am. Slept til noon, and still feeling slightly nausea -had some toast and juice-then took another one a few minutes ago. I was so sick this morning-my first time being that nausea from the chemo. The reason I hesitated taking it-is that I always get real paranoid about possible different drug reactions. I went to the phenergen site, and there were all these side effects. I really needed to hear from you wonderful people. I am alone and I guess I needed to be reassured. Love and hugs to all of you.",
      "MessageIndex": 5,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708213",
      "Title": "phenergen - please help tomatojuice catlover44"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: It has been two months for me.Still doing the exercises. Have gotten back most of range of motion, but not all. Does it ever really heal, or get back to feeling normal again? Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706075",
      "Title": "How long to heal after masectomy & axillary dissection tomatojuice Lolita"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 20, 2008 04:30AM tomatojuice wrote: hi everyone  ellinore, my baby sister passed at age 50 in 2003-she lived 4yrs after her dx. I am being treated at the same hospital.Almost had the same surgeon.She lived with me during her treatments. I wear her pin\"Partnership for Survival\". Sometimes I think I have to win this, because she didn't. Having a port put in on Tuesday. Supposed to start chemo on Wed. the 23rd. Don't know yet, if it will be ACTH, or TCH. Things seem to be moving a little too fast for me right now. At the same time,looking to get on with it, so I can go back to doing the simple stuff I love to do.",
      "MessageIndex": 315,
      "PostDate": "20/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 23, 2008 03:35AM tomatojuice wrote: Supposed to start chemo tomorrow 10 oclock. Had a port put in today, and got so sick from it.Evidently I am one of the two people evr to get so sick, or they gave me a little too much anesthic. Threw up all the way home, nausea and sick all day-headache too. Took the steroids and nausea drugs, about an hour ago. What an awful day. My family(everyone ) wants me to try and make it there tomorrow. Hope I get a good nights sleeep. Hugs to everyone",
      "MessageIndex": 398,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 24, 2008 06:45PM tomatojuice wrote: Hi chemo girls in april. Had my neulasta shot today after my first TCH yesterday. Nothing to the shot-hardly felt it. Just an injection-like a flu shot. Didn't hurt at all. So far feeling pretty good.",
      "MessageIndex": 461,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jul 13, 2012 12:56AM tomatojuice wrote: Thank you Binney for always being there when needed. I will consult with my therapist tomorrow. I already feel more relaxed. Have a wonderful weekend!",
      "MessageIndex": 2,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790432",
      "Title": "truncal lymphadema infection tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 21, 2012 08:25AM tomatojuice wrote: Hi Binney and everyone....Turns out that the red looking rash on my stomach, isn't lymphadema after all. I have had it for over a year, and numerous doctors have looked at it(saying they know not what it is). But I have been persistent. It has been treated with Keflex twice in the past year and 1/2. Still there. So I decided to go back to my dermatologist. I go to a clioinic, so the initial Dr. that checked it out, gave the same diagnosis. But he then brought in his superior to have a look. A very old Asian Dr. (dermatologist- oncologist). He examined me and had no trouble finding what it was. He said I have a Lipoma(a fatty tissur tumor, thats usually benign). He felt it, and had the other doctor feel it. I am a little more freaked out. Usually doesn't mean never. I have been watching the rt. side of my stomach grow bigger than the left for a year now. The last thing the doctor told me is it is going to get bigger. Somehow I keep thinking it has something to do with my surgery, because it sits right below where my breat was removed. I am seeing my oncologist this friday. I want to have an MRI. To find out its size, how big it will get, can I have it removed, and is there any possibility of it being cancer. I have read online where swollen lymph nodes were mistaken for Lipomas and where other types of tumors were also mistaken by just touch. Well thanks everyone for your feedback, on everything.",
      "MessageIndex": 3,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/790432",
      "Title": "truncal lymphadema infection tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 24, 2008 10:25AM tomatojuice wrote: yes I am . Had my 1st chemo today",
      "MessageIndex": 6,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/701143",
      "Title": "Taxol Side Effects Dragonfly92127 shelloz1"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Doctors secretery called today, to tell me to come in tomorrow. She didn't say why! I had a pet/ct done on March 30th. There was some tiny spot they saw on my liver dring a ct. Now I am so worried. I won't be able to even sleep tonight, let alone do everything today that I had planned. Why couldn't she herself had callled, and just tell me what its about. I callled back, and asked to have her call me. So sorry for ranting, I'm just a nervous wreck. My loving younger sister passed from this insidious desease. We lived together, and I watched her cancer spread from bones to liver, to stomach over 4 years. It was awful.My older sister caught really early, she is a nine year survivor. I thought maybe I beat it too. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/751547",
      "Title": "Pet/ct scan results tomatojuice flash"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: A couple of times, as today-I have a pooling of fluid right above the two middle fingers. Although the wrapping does bring down the swelling, this area concerns me. I think maybe it happens when the le therapist wraps me, because when I wrap, I wrap the fingers in a different order(according to the binneys descrption-how to wrap). Can't wait for glove and sleeve to come in. Le therapist says I will be able to stop wrapping and wear them. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/722266",
      "Title": "Pooling of fluid on top of hand after wrapping tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 21, 2008 02:03AM tomatojuice wrote: I had a right masectomy. I found bathing and showering right after surgery difficult, mostly because of the axillary disection. I couldn't stand to touch under my arm at all, let alone with a face rag. I bought a bath and shower gel. There are many different brands to be found in most drug stores. But I like Avalon Organics mostly found in health food stores. It says right on the bottle gentle cleansing, and that it truely is. It lathers up real nice-you don't need a cloth. Comes in many different scents-I like the rosemary. Its so refreshing-even still 3 months post op -its the only soap I can stand under my arm.",
      "MessageIndex": 3,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706721",
      "Title": "Toilet Items suggestions for after surgery Young79 Iamblessed"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 27, 2008 04:21AM tomatojuice wrote: Does anyone know if benydryl headache medication is safe to take while on chemo. I get barometric pressure headaches, and also the pollen count is high tonight. So I wanted to take two of these-which is what I normally do-they also help me to get to sleep.I feel so afraid to add any other drugs into my body. Had 1st chemo 23rd of april. Today I feel like I swollowed a plutonium plant. The metal taste in my mouth (yuk). But it really is a lot more tolerable than I thought it would be. I don't have any nausea. I find myself constanstly stuffing food in my mouth to be rid of the metal taste.",
      "MessageIndex": 508,
      "PostDate": "27/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702904",
      "Title": "Starting chemo in April haykat57 angie27"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 1, 2008 09:58AM tomatojuice wrote: Binney I just wanted to add that I am not sure what topical benedryl is, but I will look for it today at the pharmacy, and try it. Also thank you so much, and many hugs to you. Hope you get a well deserved rest after your trip. You are so helpful to many on these boards.",
      "MessageIndex": 7,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720011",
      "Title": "Lymphadema infection in arm tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Nov 19, 2008 12:21AM tomatojuice wrote: I finished rads about three weeks ago(35), and have lost 12 lbs. It is definately a welcomed loss for me. I gained 15 lbs. during chemo. I tend to eat alot when I am scared. Chemo scared me. Also the metallic taste in my mouth, made me me want to always be eating something to mask the taste. I probably eat half what I ate during chemo. I didn't intentionally try to lose the weight though. It just happened naturally after rads.",
      "MessageIndex": 9,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724590",
      "Title": "Loss of Appetite Jo_Ann_K Jo_Ann_K"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: feel really awful today. nuelasta shot yesterday. My oncologist told me to stop taking the decadron. So I didn't take the day after pill. Could this be why the nuelasta shot is bothering more than all the other 3 chemos?This was my 4th. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708190",
      "Title": "neulasta pain tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Mar 23, 2008 09:36AM tomatojuice wrote: Thanks iodine, especially for \"Be Not Afraid\". Loved pope John Paul. Went to see him in Central park when He came to New york.",
      "MessageIndex": 3,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702695",
      "Title": "What to do with denture before surgery tomatojuice iodine"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jul 26, 2010 11:23AM tomatojuice wrote: You sound amazing! What an inspiration to the little ones. I say go for it. I have lymphadema in my rt. arm. I do everything I always did and more. Run,jump, bicycle, carry heavy packages etc. I have had 2 infections in the arm, but both were cleared up right away with antibiotics. So what. Mine gets achy once and awhile too. I am planning a trip to Hawai to visit my children in a few months. The plane from L.A. to Maui is about 11 hours. I am definately going.",
      "MessageIndex": 24,
      "PostDate": "26/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/755679",
      "Title": "Skydiving? Am I putting myself at huge risk? lorieg kira"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 18, 2008 01:25PM - edited Apr 18, 2008 01:26PM by tomatojuice Hi cathy-ca Thank you so much.Your comment is helping me to decide. You have put it into to words, so well.This is exactly what I have been thinking, especially after reading today \"breastcancerupdate\" Dr. Stephen Jones, Mar 2008-after 7 yr. followup of the san antonio trial-they found chance of dying w/TC is 31% less than w/AC,w/wo node involvement. They mentioned something about a hazard ratio of .69 (don't know what that means). Having my son take a look at this. I wrote your words down verbatim to read to my son, and maybe Onc-because I feel the same way. Thank you so much for responding. I am almost feeling the weight lifting, as I edge towards this decision. My first chemo treatment is scheduled for April 23.",
      "MessageIndex": 3,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704202",
      "Title": "Any other woman w/node involvement choose TCH tomatojuice Cathy-CA"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 11, 2009 03:27PM tomatojuice wrote: The dermotologist biopsied the lesions today. I will know in about a week.Feeling very strange.",
      "MessageIndex": 2,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740193",
      "Title": "Metastatic skin cancer after breast cancer tomatojuice tomatojuice"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Oct 5, 2008 07:53PM tomatojuice wrote: Thanks Susanna and Spunkygirl. Otter I also have it between the index finger and base of the thumb. I can't wait til the sleeve and glove come in-maybe two weeks. If what you mean by a full glove, is the one with the fingers-I'm pretty sure I was measured for it. Hoping it will help. Will definately ask my LE about the KT pocket glove. Thank you again. This stuff can be so stressful, but keep looking on the bright side, it's still there.",
      "MessageIndex": 4,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/722266",
      "Title": "Pooling of fluid on top of hand after wrapping tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Oct 5, 2008 08:27PM tomatojuice wrote: Hi Kira Thank for sharing. Sorry you are having the hand swelling also. I have no idea what kind of sleeve and gauntlet I'm getting. I only know its custom and my insurance is paying for it. When I go to the jovipak and Solarus sites, I find it very frustrating that nothing is priced. You know its like, well can I even afford any of this.?",
      "MessageIndex": 6,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/722266",
      "Title": "Pooling of fluid on top of hand after wrapping tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I am 58. DX IDC stage 2B, 2.7cm, er-pr-her+, 3/18nodes. Having a hard time deciding between TCH &ACTH. Starting chemo next week. Really want to do the TCH. If there are any women who have similiar diagnosis who are doing TCH, please respond. Desperate to hear from you.I have read all the articles, especially the most recent from \"Breast Cancer Update-Dr.Jones, Mar 2008\" This one is really making me have second thoughts about the ACTH, but I am not good with statistics and math. Really don't fully get it. But it seems as though the overall outcome of survival is better with TCH, with or without node involvement. I think I'm going nuts-keep thinking with two you get eggroll. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704202",
      "Title": "Any other woman w/node involvement choose TCH tomatojuice Cathy-CA"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Apr 18, 2008 03:14PM tomatojuice wrote: Just spoke to my Oncologist, and sort of feel like I'm back at square one. He said that he met today with six specialist, and all but one felt I should have the ACTH. The \"One \" only gives his patients TCH. Well I'm scheduled for a port on Tuesday. I will speak again to my onc on Monday. Have the whole weekend to spas out about all this.On Monday I'm going to ask him if I can speak to the One who only uses TCH. Would really love to hear his side.",
      "MessageIndex": 4,
      "PostDate": "18/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704202",
      "Title": "Any other woman w/node involvement choose TCH tomatojuice Cathy-CA"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Was diagnosed with infection in my arm 10 days ago. Given keflex 500mg 2xday. Had swelling in hand throughout this time. Was advised not to exercise and to limit the use of arm. The swelling in my hand did go alot, but I think this was due to keeping it raised most days up on pillows for 45min intervals. I have another two days of keflex left. My doctor looked at the arm two days ago. She said she believes the infection is gone. I do have very pinkish skin to begin with, but I still see the infection on my arm. Yes it has faded, but it is still there. I am scheduled to have a herceptin treatment this wed.-am also concerned about being on antibiotica and getting hercptin. My doctor is has not finished her fellowship yet-I am not sure if she really knows what she is looking at. Also I had a problem getting in to see her on friday(she didn't return my call). Had a total meltdown with her sec, and a partial meltdown with her-when I did see her. I don't know why she is saying the infection is gone. I still see it.Very worried. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720011",
      "Title": "Lymphadema infection in arm tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "May 16, 2008 03:03PM - edited May 16, 2008 03:04PM by tomatojuice Hi I had a right masectomy. I am 58, divorced, very happily single, not looking at all.When I told the surgeon that I wanted a bilateral, she discouraged me,and urged me to see a plastic surgeon about reconstruction. She mentioned something about a big scar across my chest. So I proceeded to the plastic surgeon.From the minute he touched me and explained the possibilities-I knew immediately that I wanted none of it. I wanted to run out of his office. He was immensely insensitive, also. He said, step into my lab, and took a picture of me naked. Then he literally grabbed and pinched my stomach, and said I had enough fat for a diep, or something. I had to remind him that it was me he was pinching. The whole experience is one I definately want to forget.But it wasn't just his manner that made me decide against reconstruction. I am sure there are good plastic surgeons around. I just didn't want the extra pain, or possible se's. I didn't relish the idea of being asymetrical.But now it doesn't bother me at all. I have been fitted for a lightweight prothesis.But for some reason I prefer the little puff that the breast cancer society gave me in the hospital. I really like it, it feels like a soft little cushion to lean on, and looks great.Sometimes I do get nervous though about still having my other breast, so maybe somewhere down the road I will have another masectomy.",
      "MessageIndex": 19,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/705567",
      "Title": "reconstruction or not ????? vivianu spar2"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Sep 1, 2008 09:12AM - edited Sep 1, 2008 09:47AM by tomatojuice Oh Binney how so very kind of you to think of me at this big event for LE. I am grateful to you, as I have noticed my stress levels have definately increased due to the infection. I still have redness, no new spread. ITs just that it all seems very strange to me, because the redness emanates from the crux of my elbow, where the cords are very visible. Also it hurts to the touch in this area. My LE therapist suggested that I resume my stretching exercises and also to keep my arm raised on the pillows. I do the exercise to the point of resitance-but I keep somehow thinking(Is this maybe making things worse?). The LE therapist never did teach me the massage. I saw her twice. And I do not have a sleeve and glove yet. I went to be fitted, but they would not fit me while I had the infection. Then they gave me a lenghthy letter for my insurance, which I am waiting for my doctor to do for me. On Tuesday I have some phone calls to make-doctor & LE therapist.I do not have fever or warmth. All of this is happening when I am about to begin radiation treatment. Even though I have already done simulation, my team of doctors decided to get together to decide if I need it or not. There consensis was that I did, because I have an extranodal extension. Waiting for them to call me, I thought my head would explode. Thankfully though they did call on Friday before this long weeken. And I was able to relax some.I work part time(2-3days wk).I can't imagine what this like for women with children, and full time jobs, or who have to travel far to their hospitals. I woke up this morning feeling so emotionally drained, thinking that I need to do something to counter it. What that is I don't know. Just can't wait to be finished .",
      "MessageIndex": 6,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720011",
      "Title": "Lymphadema infection in arm tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 25, 2008 10:26PM tomatojuice wrote: Thanks Binney. Very helpful info. I am going to try to get second opinion.Don't really understand second part of quote. Will have to reread it and try to figure it out. In the meantime I do still have the redness, and have finished the antibiotics. Hope all is well with you.",
      "MessageIndex": 2,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720011",
      "Title": "Lymphadema infection in arm tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Aug 28, 2008 04:59PM tomatojuice wrote: Hi Binney I got a second opinion, but I don't really feel comfortable with it. The doctor said that the redness sometimes remains for awhile. I just don't think he knows what he's looking at. Why are there no doctors who specifically treat lymphatic problems? Its driving me nuts. The infection and redness ran along the cords in my arm that hurt so much. Nothing seems resolved for me. I still have the pain and the redness.Really have't figured out what to do next, because I am having many other problems with my new oncologist.",
      "MessageIndex": 4,
      "PostDate": "28/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/720011",
      "Title": "Lymphadema infection in arm tomatojuice Binney4"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Begin chemo today. Had a very bad incident with port insertion. Sick all day yesterady. My daughter made me a tea -with ginger pieces in it. Amazingly it stopped my nausea, and I was able to sleep last night. But before going to bed I took the Phenergen prescribed by Dr. Does anyone know what the best anti nausea drugs are. Or what is usually prescribed. And do they usually i.v something into the mix? I know this is a lot of ?. Thank you. Just want to try avoiding another day like yesterday. I was given a little too much anesthic, or I have some kind of sensitivity to it. They said I was only second person to react this way getting a port. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704437",
      "Title": "ant-nausea drugs foe THC tomatojuice mary6204"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: I wear a partial top front denture. Never let anyone see me without it. Extremely self concious about it. Well I'm gonna have to give it up before surgery. Don't know if the hospital will be able to keep it safe for me-til after, or if my son should take it and then bring it back to me later. I did have a thyroid surgery a few years ago, and they did keep it safe. Missing teeth, now a breast, and lost quite a bit of hair during menopause. I'm going to pieces. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702695",
      "Title": "What to do with denture before surgery tomatojuice iodine"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Had chemo # 4 today. Wet my pants on the way home. It just keeps leaking out as I walk. Still leaking tonight. Same thing happened after chemo # 2 and # 3. Oncologist thinks nothing of it. Attributes it to taking in so many fluids. Was wondering if anyone else had this wonderful experience. Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708041",
      "Title": "Leaking urine after chemo tomatojuice NancyD"
    },
    {
      "AuthorID": "tomatojuice…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "Jun 26, 2008 09:26AM tomatojuice wrote: Hi chumphy thanks for your reply. I don't really leak continually. I walk home, about 20 city blocks after chemo. On the way home it leaks out. I am not soaking wet. But enough to want to get home and change. Then it stops.And this has happened after last three chemos. Have two more to go. Before chemo, if I sneezed, or got a sudden scare or something, I would leak a little. Maybe my bladder isn't all that strong. I am post menopausal. Since its not happening today or during the night, I'm not going to worry anymore.",
      "MessageIndex": 2,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708041",
      "Title": "Leaking urine after chemo tomatojuice NancyD"
    },
    {
      "AuthorID": "tomatojuice",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/63791/profile",
      "Content": "tomatojuice wrote: Trying to figure out when chemo will most likely start for me.My surgery is Mar 25th. All my  Oncologist told me was -it will probably take about 4 months and I will need herceptin. I think he mentioned I should call him about two weeks after the surgery. Really need to figure it out(approximately). Dx 2/26/2008, IDC, 2cm, Stage IIB, Grade 3, 3/18 nodes, ER-/PR-, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/702702",
      "Title": "How soon after surgery does chemo start tomatojuice Dragonfly92127"
    }
  ]
}