{
  "AuthorID": "TooQuiet",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250526/profile",
  "Posts": [
    {
      "AuthorID": "TooQuiet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250526/profile",
      "Content": "May 20, 2017 08:34AM TooQuiet wrote: lovepugs77, YES! I've had two Taxol + Herceptin infusions, and I'm so hungry the day after! I also have lots of energy for the next two days, and then I hit a wall. It must be the steroids. I am definitely thankful for those two high-energy days, though!",
      "MessageIndex": 275,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    },
    {
      "AuthorID": "TooQuiet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250526/profile",
      "Content": "Jul 27, 2017 01:37PM TooQuiet wrote: Diagnosed at age 44. Found a lump on Christmas Eve, 2016.",
      "MessageIndex": 762,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "TooQuiet",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/250526/profile",
      "Content": "Apr 27, 2017 08:33PM TooQuiet wrote: I start May 9 with 12 weeks of Taxol + Herceptin. I went for an infusion teaching session on Tuesday, one-on-one with a nurse to learn about the process and the side-effects and tour the facility. As others have mentioned, I'm worried about the potential neuropathy. My mother is an ovarian cancer survivor (it's been 11 years since her diagnosis), and she had Taxol as part of her very aggressive treatment. It left her with permanent nerve damage in her hands and feet. My MO says her dose was probably higher than mine will be, and taking Vitamin B-6 might help. I'm hopeful! This is really the only side-effect I'm afraid of. I'm going to shave my head as soon as my hair starts thinning, maybe even before. No sense in dragging it out. Best wishes to you all!",
      "MessageIndex": 45,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/854382",
      "Title": "Starting Chemo May 2017 ParakeetsRule notanisland"
    }
  ]
}