{
  "AuthorID": "Topperfan5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231799/profile",
  "Posts": [{
    "AuthorID": "Topperfan5",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231799/profile",
    "Content": "Jun 1, 2016 12:48PM Topperfan5 wrote: Thank you for this list. I have made it through my first chemo and was nauseated for the first 5 days regardless if I took zofran or nah. It was not horrible, but just enough to be uncomfortable. I only got physically sick the last day and actually felt 100% better afterwards. Nothing smelled good, so I avoided foods with smells. Smelling proteins cook made my stomach do flips. Drinking coffee was a no go the first 5 days. It just didn't taste good. I keep vanilla and chocolate pudding cups available along with fruit cups. Lipton Chicken soup was my meal most of the time for the first 5 days.. There is just something about that soup that always makes me feel better. It is my \"Im sick\" food. I even told my husband when we got married that if I ever got sick Lipton chicken soup is the only thing I want. When Chemo started he got my daughter to go buy 4 boxes.lol. Constipation and heartburn were constant companions. I tried milk of magnesia for the constipation and it was all i could do to not get physically sick. Actually threw the bottle in the garbage quickly. Im gonna talk to chemo dr to see what stool softeners will be good and start those a few days before my next chemo. Reloads helped with the heartburn. Now that I am past my 5 days, I keep pita chips handy to snack on so my stomach is never empty. Fresh fruits and veggies are a must. Im back to eating a little protein, but not much. Meats just aren't appealing. I am back to cooking and it feels great. My husband and daughter both are pretty good cooks so they will take over cooking during the \"chemo 5.\"   ",
    "MessageIndex": 1758,
    "PostDate": "01/06/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
    "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
  }]
}