{
  "AuthorID": "totaldo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
  "Posts": [
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "totaldo wrote: Hi,  Jude here. Is there anyone out there who has been diagnosed with Infiltrating Ductla Carcinoma? Stage II (no lymps affected) size 3.1cm  I have been told best to have a lumpectomy, then followed by chemo and radiation.  I really do not want to do chemo, but because I am 45 and still fertile they want me to do chemo.  The side affects sound worse than the cancer.  My friends have gone through it and it was hell for them.  My cousin is just having radiation and doing really well. Would love some wise words of wisdom from those been before? I am 45 Dx 5/29/2008, IDC, <1cm, Stage II, Grade 1, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 21, 2008 06:28PM totaldo wrote: Hello Michele, Thanks you so much for reaching out to me.  You have no idea how l long to hear from women who have been before me. I have been very active since finding out about my condition. My trainer's wife went through it as well and she was determined to find other alternatives as well.  I want more of a personal diagnosis and treatment as I am sure we all do. I have found some very good news, a company out of Northern California called genomic health run a test also on the tumor (test called ONCOTYPE DX), it is covered by most health insurances and approved by the medical board.  This is available if your lymph nodes have not been affected. I am pushing my surgeon to approve this further testing.  It does two things, tests for further likely hood of contracting cancer and secondly puts you in  0 - 100 bracket to see if in fact chemo is necessary.  I am going to do this, if then they find I need to do chemo I will but if not NO WAY.  Your right I have options at this point and will seek them out.  h they then recommend chemo, I will do it.  But for right now, I am out there seeing what else can be done. Thank you form the bottom of my heart.  Good health! Much love and good blessing's to you for a grand life ahead. Jude",
      "MessageIndex": 7,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 21, 2008 06:36PM totaldo wrote: Hi Amann, I am so sorry you are in the space of decisions of will I or won't I. I am very strong willed and sometimes a good thing and other times not. I have to know in my heart of hearts if I do something I will be okay with that decision.  That is why I am insisting that my surgeon sends my tumor tissue to this company that do further testing that clarifies actually going ahead with chemo or not. (test called ONCOTYPE DX) I don't want to do chemo just as a safe guard.  I do not want my quality of life to be ill for days, I have been too healthy and happy and this will not stand in my way.  I am not sure if I am the one to give advise in your situation but all I can say is do what is in your heart.  I have an international business and take risks on a daily basis.  What ever decision I make I am responsible.  I am responsible now for my cancer and if I need to seek further information I will do everything in my power.  In the short period of time I have know about my condition I have challenged my doctors.  Probably known as a pain in the butt...but my life and I am fighting for it come hell or high water. Be strong, be happy and do what is in your hear and not out of fear. Sending you big love Keep in touch Jude",
      "MessageIndex": 8,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 21, 2008 06:43PM totaldo wrote: My book keeper back in Australia also had BC has gone through Lumpectomy, chemo and now radiation. She is a great girl and has recommended I read - Professor Jane Plants book -     Your life in your hands. Has anyone read it?  Also has anyone gone further and instead of chemo and radiation done alternative therapies?  Jude",
      "MessageIndex": 10,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 22, 2008 11:43AM totaldo wrote: Artsee, Thanks for the information it certainly helps me to find out what decisions women have made. I am a little confussed as the mass that the tumor is encased in is 3cm but the actual size of the tumor itself is 6mm. I am not sure what is relevant and what isnt. Would like to know what side effects you had from chemo.  Everyone says you just get through it but for the first time in my life I am asking questions and would like to be fully aware of things that I need to look out for it I do chemo. I know there is may types and this is never a easy topic. I know we are all so different and different things work for some and not for others. Thanks you so much and rapid healing for you! Jude",
      "MessageIndex": 21,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 19, 2008 10:04PM totaldo wrote: Thanks for reaching out Pam. I am from Australia so feel even further way from family and friends right now. My book keeper I had back there has also just gone through chemo and had a lumpectomy, she said the same thing about a safe guard. I am such a spirited person and am scared this will change me and my lust for life.  I am newly engaged and fearful of what this will do to our intimacy. ",
      "MessageIndex": 2,
      "PostDate": "19/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 22, 2008 07:31AM totaldo wrote: Thank you all for you comments.  My head is still spinning. They told me my mass was 3cm but the actual tumor is 6mm. They also told me it is non active and has been with me most of my life and slow growing. I will try the oncotype test and make a decision from there. I have not ruled out chemo but I am sure as you all would have if there was a chance to get more information on your cancer you would have.  I just want to be fully aware of what I am getting into. Thanks Jude",
      "MessageIndex": 17,
      "PostDate": "22/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "Jun 21, 2008 06:38PM totaldo wrote: Hello Jezza, Thank you so much for the link to the Aussi site, I certainly will be part of that as I know what wonderful support these sites can be. Blessings to you and healthy happy days.. Jude",
      "MessageIndex": 9,
      "PostDate": "21/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707657",
      "Title": "Lumpectomy/Chemo and Radiation...HELP totaldo artsee"
    },
    {
      "AuthorID": "totaldo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67442/profile",
      "Content": "May 31, 2008 01:05AM totaldo wrote: I have a BIRADS 5, (and my lucky number, hoping so this time) I have all the symptoms of FIBROADENOMA so fingers crossed that is what it is and not breast cancer. But being rated a 5 makes me really nervous.  Big needle to see what it is Wednesday. Has anyone had a high rating and been Firbroadenoma? Thx Jude",
      "MessageIndex": 10,
      "PostDate": "31/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704709",
      "Title": "BIRAD kathy46 Donna1843"
    }
  ]
}