{
  "AuthorID": "toxcheep",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
  "Posts": [
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Sep 17, 2011 07:04PM toxcheep wrote: Add me to the list.  My mastectomy was Aug. 30, 2011.  I had SNB, with one positive node.  Will begin chemo in October.",
      "MessageIndex": 623,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Sep 17, 2011 07:21PM toxcheep wrote: Hi JanaJ.  My surgery was the day before yours and my drain tube is still in.  Earlier this week it clogged and backed up and my whole system went into shock, with uncontrollable chills, fever of about 101, and tremendous pain in the entire surgical site, along with back spasms.  I had no idea what was wrong, but saw the dr. next day and they explained the problem.  Needless to say, I'm leery of the drain tube now and just wish I could get to the point where they take it out.  Also found out that antibiotics are routinely prescribed post-surgery, but in my case they forgot.  So it has taken this entire week to almost return to my level of health with the aid of the antibiotics that I'm now taking.  All I had was a SNB, but my arm hurts all the time, it seems.  I can raise it enough to brush my hair, but it is always an effort with a stretching type of pain.  I try to use that arm for normal things like pushing open doors and pouring water from a full pitcher.  Hopefully, using it will help in its recovery.  With chemo lurking about three weeks from now, I feel somewhat depressed.  I wonder if I should start that process when I don't yet feel \"good\".  Why does chemo have to follow so quickly after surgery?  Wouldn't chemo starting in a couple of months be just as effective?  My tumor was about 2.6 cms., so it's pretty certain that with a mastectomy, the margins were clear.",
      "MessageIndex": 624,
      "PostDate": "17/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772111",
      "Title": "August 2011 Surgery Group blondelawyer Joan811"
    },
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Jan 28, 2013 02:44PM toxcheep wrote: I had it, too.  It's lymphatic cording.  I insisted that my Dr. order PT for me so that I could loosen that cord up and raise my arm high enough to serve a tennis ball.  It worked well and the cord disappeared.  I also had a massage therapist who understood all about \"cording\" and gently massaged it away during our sessions.  I strongly recommend PT and massage therapy for this problem.  Good luck!",
      "MessageIndex": 19,
      "PostDate": "28/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797672",
      "Title": "sentinal node dissection/pain lump..help! jabal shianne29"
    },
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Jan 27, 2013 09:39PM toxcheep wrote: I had a lift on my healthy breast and had a reduction, too, so that it would match up with the reconstructed breast.  Love it.  I look better than I did before the mastectomy! Also, please note that you don't have to have a nipple added to your reconstructed breast unless your significant other requires it.  I bought my \"headlight\" and just stick it on whenever I wear a tight shirt for tennis or something.  Works like a charm. Bought it at the plastic surgeon's office and they're also available at some mastectomy supply stores.",
      "MessageIndex": 12,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/798617",
      "Title": "Anyone have a lift on their healthy breast mrenee68 Kay_G"
    },
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Sep 9, 2011 10:40PM toxcheep wrote: My surgery was a mastectomy (MRM) and it was on 8/30.  As of yesterday, I have been dealing with constant nerve pain in my armpit and at the surgical drain site, and my skin is very hypersensitive.  If anything touches me in that general area, even on my back, I cringe.  Hopefully, this goes away.  But I can identify with all that you described.  Is \"nerve-wracking\" a good description?",
      "MessageIndex": 6,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771210",
      "Title": "hypersensitive skin post-lumpectomy geiru2011 Flamingo305"
    },
    {
      "AuthorID": "toxcheep",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135867/profile",
      "Content": "Sep 9, 2011 09:54PM toxcheep wrote: I had a \"sentinel node biopsy\" done.  The procedure was explained so logically:  inject some dye and some radioactive particles which then drain into the sentinel nodes and the surgeon can discover which these are by using a little geiger counter type gismo.  Hello!  Time to wake up!  What they are neglecting to say is that it will take about 4 injections of about 5 seconds each with a stinging substance and that the injections will be right into your areola (nipple area!) and that you will want to scream your head off because a numbing agent of any kind might skew the test results.  In my opinion, the mastectomy was a piece of cake in comparison to the SNB prep.  I'd like to see how men would take injections like that into their scrotums.  I'll bet we'd discover a topical numbing agent real soon!",
      "MessageIndex": 22,
      "PostDate": "09/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/772904",
      "Title": "Axillary node dissection artiecat KatheW"
    }
  ]
}