{
  "AuthorID": "tracyanne",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
  "Posts": [
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 28, 2009 09:26AM tracyanne wrote: My appointment with the BS went well.  I thought he would want to hear about my bad experience, and I was right.  He said that after talking with me, he sees there is a need to make a discussion of pain management a routine part of a preo-op visit and to emphasize at that time that he considers pain to be an emergency and wants a phone call at any time of night so he can respond to it. What I especially like is that he said it was not my responsibility to make the call or even to tell the nurse that yes, I want her to make the call.  He said her job is to identify problems and pursue solutions--with emphasis on pursue.  He agreed with me that the patient, exhausted and vulnerable emotionally and physically, should not be asked \"do you want me to get the doctor on the phone?\" or \"do you want me to get a doctor in here to adjust the pump?\"  The nurse should act in the best interest of the patient. He also said that he, like all the other surgeons, had a pain protocol on file there that includes options such as percocet and demerol.  Yes, the original orders were for Darvocet and the numbing pump, but that there were options available for the nurse to pursue.  I made a point about the Darvocet--saying that I took from that a message that I shouldn't need anything stronger and that it would be weak of me to ask.  He said no, that is not the case at all...that pain management is an individual thing and that he failed to communicate with me that he understands different people experience pain differently, that I had options and that I was to call if I was in pain...reaffirmed that he will make that a point of discussion at every pre-op appointment he has from now on. What made him angry is when I told him that the nurse, in an effort to assuage her anxiety about how to handle my pain, explained to me why she felt she couldn't do anything.  She told my husband and me that even if we were to call, \"they\" meaning doctors, I guess, couldn't give me anything stronger because of the On Q pump delivering medicine...that the combination of that medicine with strong narcotic pain medicine could lead to respiratory distress so \"they\" had to be very careful about mixing those medicines. My BS said not only was she out of line, but she was wrong.  That was not accurate.  I suggested to him that from my experience and from what I've read here, that some nurses mistakenly think the On Q pump delivers pain medicine, like a morphine pump, and it does not. He apologized for my bad experience and said he would be contacting the nursing supervisor to clarify protocol and expectations, and he gave me a phone number for the floor to call and get a name and address for a letter of complaint and asked that his office be copied on that letter so he will have in writing what happened.  Said I was to call him if I had any trouble at all getting the name and address from the nursing station--that he would wants to facilitate that if there is any hesitation on their part. All in all, I still feel the Darvocet plus On-Q pump was not sufficient for me or any woman.  I do somehow feel better knowing there was written protocol for increasingly strong narcotic pain medicine...to me, that is an acknowlegement that he knows the surgery can be extremely painful for many women.  I do wish I had had the guts to say something more along the lines of \"WTF were you thinking?\" about the Darvocet, but I am happy enough with this outcome. It was validating to hear him say pain is an emergency, and to say that he will have that in the future, he will havve that discussion with patients prior to surgery.",
      "MessageIndex": 13,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 3, 2009 04:47AM tracyanne wrote: Dana, you were expected to move from morphine to Darvocet--what a ridiculous leap!  There must be four levels of pain relief (at least) between those two.  I woke up in recovery with hydromorphone (Dilaudid), which the nurse said was stronger than morphine, and then was switched hours later to Darvocet and a numbing pump.  Well, that numbing pump numbed the breast, but not the muscle and tissue around it--which had been cut and sutured to hold the alloderm pocket of my immediate reconstruction.  Like someone said here, it felt like I'd been kicked by a horse--and I've owned four horses in my life, so I know what I'm talking about. You had what legislators are calling a \"drive-through mastectomy\" and I'm so sorry such a major operation (and it is major...no matter what the doctors say...it is emotionally/physically major) was performed and then you were expected to manage your own care so immediately afterwards.",
      "MessageIndex": 20,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "tracyanne wrote: I am five weeks post-op, unilateral mastectomy with immediate reconstruction. I've been having trouble getting hold of a flood of emotion coming over me as I remember that night in the hospital and the ordeal of the pain at 3:00 a.m.  My BS had left orders for Darvocet and the On-Q numbing pump.  His orders allowed for the pump to be set at a 6 if needed (it was then set at 4) but the nurses said they were not allowed to unlock it and move the dial even if that's what the orders allowed--that they would have to get a doctor up there to do it and place a call to my surgeon. I was crying and crying, not because I was in agony--I was not--but because I was in bad pain and didn't think I should have to be.  I'd just had a mastectomy for god sake...why was I expected to be a stoic about all this and tolerate physical pain as well as emotional?  Darvocet?  I was given that after a surgical biopsy the year before. So, in recovery, a morphine drip, but then nothing but Darvocet and an On-Q at level 4 that same night.  Would love to hear from others, as I am so distraught remembering that feeling of helplessness and of guilt for somehow being weak and wanting drugs that I am planning to discuss it with my BS when I see him next.  I felt like I was left to hurt, left to just get over it and be strong at a time when I was so vulnerable physically and emotionally. Please, give me some perspective...what were you prescribed in the hospital for pain after mastectomy? Unilat MX for extensive DCIS, alloderm one-step immediate reconstruction with silicon implant Dx 7/2009, DCIS, 5cm, Stage 0, Grade 2, 0/1 nodes, ER+/PR+ Surgery 8/18/2009 Mastectomy: Right; Reconstruction (right) Radiation Therapy 10/18/2009 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 27, 2009 12:02PM tracyanne wrote: I definitely will tell my surgeon about the nurse's statement about not being \"allowed\" to physically change it, and my guess is he will be indignant about that and clarify with the hospital what should be done.  I wasn't sure I would have the guts to talk with him about the Darvocet, but you know, this thing keeps coming back to me and leaving me weepy, so I have to talk it through with him. I like him in sooo many ways.  The day he called with the diagnosis was a Friday, and he gave me his pager number because he wanted to be available to me over the weekend if I needed to talk further, saying he knew this was a shock and a hard thing to absorb.  There is so much to appreciate about his management of my case-- but I do think there are doctors out there who are so suspicious or scared of narcotic dependency that they withhold...thinking it's for the patient's own good.  I've also thought maybe he's heard many women, like many here, who say mastectomy isn't as painful as feared.  My answer to that is, I agree that it is not agonizing pain--not exteme pain--but it is PAIN at a time when we are soooo worn out and afraid and weak anyway!  Why have to endure that too? Thank you for responding and validating...keep it coming, ladies--I'd love to know your experiences.  I see my surgeon tomorrow.",
      "MessageIndex": 3,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 27, 2009 01:03PM tracyanne wrote: Roseg--I did have immediate reconstruction at time of mastectomy.  An alloderm pocket was inserted into chest muscle, which had been cut to receive it, and the pocket was \"anchored\" with stitches there and in the lining of the top ribs; then the pocket had my silicon implant inserted and my breast skin was stitched closed over the whole thing.  So, I have no nipple and a very neat thin 2 \" or so line across where it used to be. One possibility is that my BS didn't know that my PS would be cutting muscle and stitching to that rib lining...my understanding is my one-step alloderm recon is still considered pretty new.  To my PS's credit, when he came to see me at 7:00 a.m. he whipped out that prescription pad and gave me soma, hydrocodone, and sleeping pills in addition to an antibiotic.  I do take responsibility for not telling the nurse yes, get that surgeon on the phone and yes get a doctor up here.  I had already had him called at 11:00 because swelling was increasing rapidly and was very hard to the touch--didn't want to be a \"bad\" patient and call again at 3:00 a.m.  My choice not to be a complainer...I'm so easygoing, calm, capable...you know the image we have of ourselves.  Surgeon had told me at times of biopsies (two in one year, second one positive) that I was an excellent patient, and I know the people-pleaser in me wanted to continue to be that excellent patient. I know this--as a mom, I would have had the doctor on that phone so fast if it were my daughter there.  As a patient, I didn't have that advocacy for myself like I would for my child. ",
      "MessageIndex": 8,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 3, 2009 04:59AM tracyanne wrote: Questions to ask surgeon(s) before surgery: What will I be given in recovery for pain? What will I be given in the hospital overnight for pain?  If the pain becomes severe during the night, will orders have been left for something stronger, or should the nurse call you directly?  I will be asked to rate my pain on a scale of 1-10...what level on that scale do you expect my pain medicine should place me ideally...and what level do you feel warrants a phone call? How much will the On-Q pump numbing agent be expected to take the place of pain medicine?  Will the nurses be familiar with the difference between the numbing pump and the pain medicine? What will I be given at home for pain? I have two surgeons--you and my plastic surgeon--who will both be operating that day.  Which one of you will be leaving the medication orders after surgery?  Have you communicated with each other about what the reconstructive surgery entails and how much that may contribute to post-op pain? (My surgery was a not-yet-common reconstruction, and I don't think my BS knew how much cutting and suturing it would involve.) Anyone else have any suggested questions?  Maybe we can help other women by posting them here.",
      "MessageIndex": 21,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 28, 2009 09:14AM tracyanne wrote: If anyone else was prescribed Darvocet for hospital pain management after mastectomy and reconstruction, I would love to hear from you...I'm still very emotional over my experience and pondering what to do next.  As much as I hate to, I may call my surgeon to ask more targeted questions, specifically why I had a hydromorphone drip in recovery but was switched to Darvocet just a few hours later?  Which is it--I was in enough pain to warrant hydromorphone or in so little pain all I needed was Darvocet? God, I hate it that I still cry over this. ",
      "MessageIndex": 25,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741061",
      "Title": "Pain medicine for mastectomy--survey tracyanne tracyanne"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 17, 2009 05:56PM tracyanne wrote: I definitely have some nausea the first day or two of the week...I think because I've gone the two days of the weekend without. Thought I had to be imagining it or that it was psychosomatic the first time, but it was back the next Monday...so yeah, it's for real. By Thu I'm feeling calm again and eating normally...even snacking and hitting the Halloween candy! Colette, sounds like you deserve a treat for yourself.  Pamper yourself...be easy with yourself.  You are hurting, inside and out.  One thing that has helped me is to consciously think \"I won't think, anaylze, decide anything today...I'll just feel.  Feel bad, feel sorry for myself, feel tired...just feel.  Thinking/anayzing/deciding anything can wait for when I'm clear-headed.\" Hugs to you. ",
      "MessageIndex": 5,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/741882",
      "Title": "Nausea and dizziness from day 1? Colette37 lynrose"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 15, 2009 07:05PM tracyanne wrote: Hi Brady-- I would just like to second what J414 wrote...early detection is key, and even if it is not benign, there will be action that can be taken to protect you.  In my case, the lump that my breast surgeon said was almost certainly a fibroadenoma did turn out to be DCIS, or ductal carcinoma in situ.  He conceded that he was really surprised because it just looked and felt benign.  So, yes, it was cancer, but a cancer which was highly treatable and which final pathology confirmed had not spread beyond the ducts (no chemotherapy needed, no reason to think it had invaded any other part of my body). The waiting is hard, and the percentages can give some comfort but the fear is always there that we are somehow in that other 20%.  It's okay to take a realistic look at that possibility and prepare yourself with the knowledge that a diagnosis is followed by a plan of action, and that there will be a team of people dedicated to watching out for you and taking all the steps necessary to cure you.  You will not be alone, even if the news is not what you hope to hear. (((Hugs ))) ",
      "MessageIndex": 7,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740418",
      "Title": "Just had biopsy done this morning - am PETRIFIED brady0819 brady0819"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 16, 2009 05:21PM tracyanne wrote: Brady, if searching and searching helps you get through this, then that's something.  That searching can lead to increased fear, but it also leads to further education.  You are learning, and there's nothing wrong with that.  Twelve months ago, when I searched and searched as I waited and waited, I got a benign result but was grateful for my increased understanding.  This year, well, I wasn't so panicked when I went through it again, and even with the finding of DCIS, I knew my way around the subject and felt better able to deal with it than I might have otherwise. Don't know how this applies to you, but my surgeon said a horizontal oval is less worrisome than a vertical one...?  I think the definitions of what is smooth and what is irregular are fairly subjective, as my radiologist and my surgeon disagreed as to whether mine had smooth or irregular borders. Hang in there...Friday is just a day away.",
      "MessageIndex": 14,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/740418",
      "Title": "Just had biopsy done this morning - am PETRIFIED brady0819 brady0819"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 12, 2009 09:24PM tracyanne wrote: Deb, my oncologist wants me to start Tamoxifen after rads because it is an effective drug...can put any lingering cancer cells in a sort of sleeper mode and we don't want that...want to keep 'em alive and kicking so the radiation can \"see\" them and kill them.  That's her take on it--I know some other oncologists feel it doesn't make a difference. PauldingMom, your discomfort at the woman's sudden exposure is understandable.  Maybe she has had to show her chest to so many practitioners and techs she is just completely comfortable with it but that's no reason to assume everyone else is comfortable seeing it, bc survivor or not.  I've been careful not to look up too many photos on the web--just don't want to risk seeing the not-so-good outcomes.  As much as I think she was out of line, stilll my heart goes out to her--to anyone who has to endure such complications in an already difficult situation like cancer. Brookside, I'm so happy to hear that upbeat tone in your voice about the medical bills!  I've thought about you off and on, and I don't know you, but I felt worried for you and how you would cope with recovery under such financial distress.  Good to hear you sounding better. ",
      "MessageIndex": 210,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 6, 2009 06:53PM tracyanne wrote: About that 30% negative vs. 70% positive...I like what someone said here on another thread about how her well-meaning friends and family didn't want her to think about the 30%...that the 70% chance of a good outcome was so much greater than the possibility of a bad one!  Why should she worry about the 30%? Her response to them:  \"If I told you that airplane you were about to get on had a 30% chance of mechanical failure, would you still get on it?\"  Of course, the answer is no...suddenly 30% seems like a signigicant number after all!",
      "MessageIndex": 151,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 25, 2009 07:42AM tracyanne wrote: Linn, thanks for the tips on green tea...yes, the Lipton drink my husband brought home for me does list the corn syrup as the second or third ingredient!  There is another brand I bought once that wasn't so soda-like; will have to go to the grocery store myself and read labels.  I like the idea of adding my own flavoring, like the cherry you mentioned.  I wonder if green tea pills are effective replacements? Finished radiation yesterday.  The girls gave me a confetti shower when it was over, and the doc gave me a plaque with a John Wayne quote:  courage is being scared to death but saddling up anyway...I like it coming from him because he's a somewhat of a cowboy himself.  He typically wears this boots/jeans/Hawaiian shirt combo that is quite un-doctorish :- )  Read on his bio that he started as a medic in the army, doing several tours in Vietnam.  Interesting. So, back in three weeks for a follow-up, meanwhile continue the domobro soaks and aloe as the skin heals.  I see the onco on Dec. 1, and she said earlier she'd be ordering a baseline mammo of the irradiated breast.  I know not all oncologists continue mammography after mastectomy, but I'm glad she does. Happy Thanksgiving to all!",
      "MessageIndex": 545,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 8, 2009 09:41AM tracyanne wrote: Saw the rad onco just now about  the rash.  The nurse was sure surprised when she saw the rash went all the way down to my wrist on the inside of that arm!  Then the doc came in and his eyebrows went up, too...said that he hadn't ever seen a radiation-related rash travel so far and that he doubted this one was a result of radiation...but he gave me a prescription for a course of steroids.  If that doesn't clear it up, I\"m to see my GP for the next step.  Said that rashes were often a mystery...hard to pinpoint as to cause...but that we could at least treat it even if we don't know what's causing it. It's itchy and uncomfortable, but not painful.  Hope the steroids work quickly!",
      "MessageIndex": 588,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 23, 2009 04:52PM tracyanne wrote: Well, the rash is under control now but most definitely still there, less on my arms and face but more on my legs....will have a skin biopsy done after the holidays if it doesn't go away.  Benadryl, antibiotics, and a steroid cream are the treatment until the mystery is solved.  I'm starting to think it's tamoxifen my body doesn't like...but the docs say tamoxifen doesn't cause skin side effects.  We'll see...at least I no longer feel like it's a dangerous development.  Merry Christmas and a Happy New Year to all...a healthy, healing new year.",
      "MessageIndex": 605,
      "PostDate": "23/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Sep 15, 2009 03:00PM tracyanne wrote: Tracy here, I'll join y'all.  Just set my initial radiation appointment (the one that includes the ct scan and is supposed to take a long time) for Oct. 1.  Would have been this week, but I developed a seroma that had to heal first. In August I had a right mastectomy for extensive DCIS.  For various reasons, my chances for discovery of invasion at time of mastectomy were as high as 30%, but final pathology says no invasion, so no chemotherapy.  However, my case did go to a tumor board because two foci of cancer were 0.1 mm from the chest muscle at the bottom of the breast, and I had similarly close margins at the chest wall and breast skin.  Apparently the lower half of my breast was filled with the stuff. Unanimous decision of the tumor board is that I should have radiation followed by five years of Tamoxifen, so here I am...glad for the extra precaution, but of course anxious about side effects short term and long term.  Better to be cautious, of course, esp. now that I have learned no mastectomy specimen can be one hundred per cent examined under the microscope simply because it would be such an exhaustive process.  The tissue is blocked, then sliced, then placed on slides, but the slicing simply cannot be as thin as the cancer cells so there is always that chance of something being missed.  Comforting, huh? In answer to the question about morning or evening, I've been told by two co-workers who have gone through it that the machines do go down periodically, and that results in delays...they tend to develop such problems later in the day after running hour after hour.  I was encouraged to choose morning if timing was critical--less chance of being stuck in the waiting room for an extra thiry minutes to an hour or more.  We're teachers, and the fact that in my case students will be in the classroom waiting for me at 9: 27 each day makes it all the more important that the treatments happen on time.  Could go after 4:00 when machine delays wouldn't affect work, but oh my, the difference in fighting traffic at that hour is huge where I live.  Talk about delays! So, radiation in two weeks.  Sorry we all have to do this, but glad to have the good company :- )",
      "MessageIndex": 23,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 5, 2009 07:39PM tracyanne wrote: My radiation is because my DCIS was extensive and so close to chest wall, to chest muscle where breast meets ribs, and to skin.  Even with mastectomy, that chest muscle margin was only one tenth of a mm...rad onc said he'd be giving extra attention to that area.  I can't imagine what 0.1 mm looks like, but I guess under a microscope it's measurable. Had first treatment today, and was surprised at how emotional I felt.  Comes on suddenly, I find.  This morning it was when I was shown into the dressing area and handed the gown, How many times have we all changed from clothes to gowns in the past few months?!  Blinked away a tear or two, wondering where they came from. Then was surprised that I was actually alone in the room for the five to ten minute treatment. Not like mammography where the tech stays in the room.  The computer does all the moving and positioning, and the techs leave to watch on monitors...it was just the weirdest, loneliest feeling.  I hope I get used to that soon.  It was nice that a beautiful mural was painted on the ceiling :- )",
      "MessageIndex": 135,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 4, 2009 01:25AM tracyanne wrote: Anyone else having deep breast pain?  I'm on day 20 of 33, and the rad onco said it's irritation from the chest wall radiation...take ibuprofen.  Sigh.  I'm so sick of taking tylenol and ibuprofen...I think it's contributing to that queasiness I feel off and on now. So, the breast hurts and often that extends to armpit and down my arm.  Stopped wearing my regular bra because it pressed against that outside swelling...glad I saved my post-surgery cotton \"bra\" and am using that now.  Have to dress in layers because the natural breast doesn't quite sit the same in that bra now... I sure am tired of hurting.  Seems like that breast has caused me pain in some way or another, one degree or another, since the late July biopsy.",
      "MessageIndex": 391,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 27, 2009 06:30AM tracyanne wrote: Kime, glad you like the John Wayne :- )  As far as healing goes, the skin over my rib just under my breast is more purple-red than ever.  I knew it would continue to darken even after treatments ended, and yeah, it's darker and it hurts worse.  Starting to peel and feels like it's going to crack open despite creams.  Ouch.  Thankful I don't have to go in for any more treatments because I think it's had all it can take. The itching has intensified, too...watched the Texas game with an icepack there and that seemed to help.  Was looking forward to wearing a bra again when going back to work Monday, but looks like I may still have to camouflage the asymmetry between the natural breast and this one by continuing to dress in layers.",
      "MessageIndex": 550,
      "PostDate": "27/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 11, 2009 09:16AM tracyanne wrote: Dsgirl, I know what you mean about holding your breath like something awful is going to happen.  Treatment doesn't hurt physically, but we know in our heads that radiation is a bad thing in most situations, and it is awful that we have to expose ourselves to it.  I find myself kind of holding my breath too, or rather searching for a relaxed, normal breathing and having trouble finding it!  I feel a dread of the buzzing sound that means the beams are hitting...and does anyone else notice the faintest smell?  like a change in the feel/smell of the air?  Are y'all experiencing change of appetite?",
      "MessageIndex": 192,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 11, 2009 01:03AM tracyanne wrote: Liz, found out today that I start boosts tomorrow, too.  Wasn't expecting that...will have to ask the radiation oncologist about it tomorrow at my weekly check-in.  He hadn't mentioned that in discussing my treatment plan at the beginning. I too am just plain not feeling well, especially toward the end of the week.  My reconstructed breast hurts badly at the side--maybe in part because the fluid build up doesn't have natural breast tissue to help it absorb back into the body as quickly.  Also have nausea that comes on strong, though as I think I've said before it may be due to all the ibuprofen I'm taking for the swelling pain and deep breast pain.  After nothing but 7up and crackers since noon last Wednesday, I still vomited on Thursday morning after taking my multivitamin.  My poor stomach didn't like that at all. I wonder what we can expect as far as different/increased side effects from the boosts?  Guess I'll see starting tomorrow.",
      "MessageIndex": 451,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 22, 2009 08:57AM tracyanne wrote: Two boosts left for me.  My rad onco said the dose is the same, just that the fielf is narrower, so I do think our tiredness is a result of the accumulation of radiation and not just the boosts.  The pain of the rib cartilage inflammation is controlled well by the hydrocodone, but the skin pain sure is intensifying. I can't see blisters per se, but I do see little red bumps now on the red skin at the fold under the breast.  Keeping up with the soaks and the cream, but ouch, ouch, ouch is right.  Vtmom, the shot glass image brought a smile to my face--how creative of you!  I wonder if tamoxifen's effectiveness is in part based on just how ER positive a cancer is.  Mine was 90% ER positive.  I've decided to try it, and figure I can stop if the side effects become bad.  I fear weight gain the most.  I worked very hard to lose an extra 40 pounds before this cancer thing came along and I would feel so discouraged to have it come back. I too plan to adopt more healthy habits.  I've never been a tea drinker, but I have found through trial and error a green tea drink that I like...it's green tea with raspberry, sold pre-packaged in the same aisle as the ocean spray cranberry juice, V-8, and such.  I also have been eating more green veggies and fresh fruit.  I quit going to the gym three weeks ago--just too fatigued and sore, and didn't want to expose myself to the flu virus any more than being a schoolteacher already exposes me!  Will start again soon after radiation ends on Tuesday. I hope this poor skin regains some softness.  It feels like elephant-hide leather now.  Not like my skin at all.",
      "MessageIndex": 523,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 6, 2009 10:54AM tracyanne wrote: Hmmm...so now the bumpy rash on my right breast has spread all the way down the inside of my right arm.  I liked the advice here of just not using any special cream or soap on the breast, and the rash actually started looking a lot better, but this morning it's back and travels from armpit to wrist on that side. I'll call the rad onco in the morning...wonder if it's anything to worry about?  Any of you heard of or had similar experience?",
      "MessageIndex": 586,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 7, 2009 07:46PM tracyanne wrote: Thank you, too, Lynnmarie, for posting about your tears.  I do think the emotion has something to do with the vulmerability of being alone, bared, arms up and having to hold still...and yes, the ties across the feet.  My third day today, and I felt a little better about it all...but I can tell I will still have my moments when it feels sad and lonely.  Maybe it 's also knowing the kind techs are indeed watching, but on a monitor...watching me lay there in that position?  Just so surreal. I think that's right about in cases of masectomy there is more burning because the skin is targeted.  Clarified that with my rad onco today.  He said that my skin will turn a deep, dusky red...and that in fact, if the skin changes didn't happen fast enough, he will be putting that gummy-like layer over my breast every session instead of every other one so as to focus the radiation all the more.  Emphasized that his goal is to prevent recurrence, and my vulnerable areas are incision, skin, and chest wall-so that's what he's targeting.  I think that's why he said that in my case, I could use any one of the top twenty creams on the market for softness...that it didn't matter which one...because I was going to burn anyway.  On purpose. Day 3, and I'm pink already.  Jeez.",
      "MessageIndex": 161,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Oct 21, 2009 09:45PM tracyanne wrote: Linda and VTMom, I asked my radiologist today about pain at the outside of my breast.  He said that radiation causes a build up of fluid, and that many women develp a ridge of fluid build up at the outside and, in larger breasted women, at the underside of the breast.  Said the underwire of my bra was pressing up against that fluid build up, making it worse...how nice it was to have my complaint of pain validated!  No hemming or hawing, just \"yes, I believe that you are in pain and here is why.\" As of the past few hours, pain down my right arm, too...and I bet it's related. I asked about radiation and moles, as I have many and have had many biopsied over the years for suspicious changes.  He said that flat moles will often develop a sort of black powdery-ness over them, but that it flakes off a few weeks after radiation.  Lovely.",
      "MessageIndex": 272,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Nov 18, 2009 07:14PM tracyanne wrote: Liz, I too am having bad pain at the rib under the breast, and my radiologist explained it to me today.  He brought out his anatomy book and showed me how each rib is half cartilage and half bone (the outer half is bone, the inner half toward the heart is cartilage).  Those two \"halves\" have a joint of cartilage connecting them, and it is that joint that gets inflamed with radiation treatments.  That's why the pain is so easy to point to...it's not a generalized soreness but a real \"spot\" of very bad pain. He's having me take 400 mg of ibuprofen three times a day to reduce the inflammation, and he gave me hydrocodone for the pain.  He also told me that it would get worse before it got better.  I was saying how glad I was I had only four boosts left and was done, and he didn't want me to get my hopes up that I'd be pain free after Tuesday. I was given the domobro (sp?) stuff today too...soak four times a day for fifteen minutes using a washcloth.  The package says it's aluminum acetate.  Aluminum!  So strange, all this radiation stuff.  The pain under my arm is bad, too.  The burn there is a deep purple and feels like it goes so deep.  No peeling for me yet, just the red/purple burn square getting darker every day.  Nausea continues off and on...lots of crackers and 7 up lunches for me lately.",
      "MessageIndex": 501,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 1, 2009 06:31PM tracyanne wrote: Kime--I'm breaking out with a rash now, too...started four days after rads ended and now at six days post-rads it's worse.  Red, raised bumps all over the radiation field...like pimples but don't seem to be fluid-filled.  During today's routine follow-up with my medical oncologist, she looked at it and said she thinks it's radiation related and not from starting tamoxifen.  She said she wants me to call my rad onco if it gets worse over the next two days. Mystery rash...at least it doesn't itch too much.  Yet.",
      "MessageIndex": 571,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 10, 2009 04:21PM tracyanne wrote: Kime, the steroids are a six-day pack of pills.  Started yesterday morning.  Was much more comfortable this afternoon as far as itching...though the rash is still definitely there!  Am using caladryl and cortisone cream, too.  What did your doc say?",
      "MessageIndex": 594,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    },
    {
      "AuthorID": "tracyanne",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/88507/profile",
      "Content": "Dec 17, 2009 07:17AM tracyanne wrote: Well, this rash thing is getting more serious.  My GP says it is either a staph or strep infection in the skin, and it's still traveling.  He started me on three antibiotics yesterday, but I'm calling him this morning because it has now spread up my neck and over my face...he said if it gets much more advanced, I may need hospitalization and IV antibiotics.  He said that surgery and radiation compromised my lymphatic system--and that you don;t have to develop lymphedema to have serious issues with lymph drainage.  No telling where the original bacteria came from, but whatever it was, my body couldn't manage the common little infection and so now I have a not so common big infection. So, the rad onc is right that this is not a \"radiation rash\" but my doc thinks that radiation definitely complicated it.  Am seeing a dermatologist later this morning and putting a call into my GP about the spread to the face...yikes.",
      "MessageIndex": 601,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/739585",
      "Title": "October Rads. 2009 PauldingMom linn56"
    }
  ]
}