{
  "AuthorID": "traceyz",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
  "Posts": [
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Aug 8, 2010 10:08PM traceyz wrote: YES! YOU MAY HAVE A BENIGN TUMOR ON YOUR PITUITARY GLAND. I HAD A CONDITION CALLED PROLACTINOMA. ITS TOTALLY NON CANCEROUS. WAY BEFORE I WAS DIAGNOSED WITH BREAST CANCER MY GYNO DID A FULL HORMONE PANEL ON ME. MY PROLACTIN LEVEL WAS HIGH AND SHE TOLD ME THAT I PROBABLY HAD A BENIGN PITUITARY TUMOR. WELL SURE ENOUGH I WAS REFERRED TO AN ENDOCRINOLOGIST, HE RAN A SCAN OF MY BRAIN AND I DID INDEED HAVE A SMALL TUMOR ON MY PITUITARY. PITUITARY TUMORS ARE TOTALLY NONCANCEROUS!! I TOOK MEDICINE ONCE A WEEK AND THE TUMOR IS GONE AND I AM GOOD TO GO!! SO SEE NO WORRIES! IF YOU HAVE TIME GOOGLE PITUITARY TUMORS AND YOU WILL SEE THEY ARE THE CAUSE OF A FEW CONDITIONS AND THANK GOODNESS NONE OF THEM ARE CANCEROUS, PM ME IF YOU HAVE QUESTIONS. TRACEY",
      "MessageIndex": 1,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756524",
      "Title": "Pituitory Gland??? kdrez kdrez"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Aug 9, 2010 09:09PM traceyz wrote: YOU LADIES ARE SO SWEET! IM JUST GLAD GOD LED ME TO EASE YOUR MIND. LET ME KNOW WHAT YOUR ENDO DOC SAYS! AND ABOVE ALL REMEMBER NONCANCEROUS! I PROMISE! TRACEY",
      "MessageIndex": 4,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/756524",
      "Title": "Pituitory Gland??? kdrez kdrez"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Sep 2, 2008 04:27PM traceyz wrote: Hi I was told that the stretches really do help. I will be having radiation in November. So please let us know how you are doin.",
      "MessageIndex": 3,
      "PostDate": "02/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720203",
      "Title": "Chest Muscle Tight after rads Liz08 Liz08"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Aug 8, 2010 01:50AM traceyz wrote: Hi Jeanne, I CAN SAY THAT HALF WAY THROUGH TREATMENT THE SIZE OF MY TUMOR HAD NOT CHANGED AT ALL!! EVEN AT THE END OF TREATMENT I COULD STILL FEEL IT. YET BY THE TIME I HAD THE SURGERY IT WAS COMPLETELY GONE. SO I THINK SOMETIMES IT JUST TAKES A WHILE FOR THE CHEMO TO WEAR DOWN THE TUMOR. MY DOCTOR SAID THEY WERE MORE CONCERNED THAT THE CHEMO WAS ATTACKING POSSIBLE STRAY CELLS. IF YOU ARE REALLY CONCERNED YOU COULD TRY AND HAVE YOUR APT MOVED UP OR HAVE THE DOCTOR ON CALL PAGED AND ASK HIS THOUGHTS. PEACE OF MIND IS REALLY IMPORTANT. HOPE THIS HELPED. TAKE CARE. TRACEY",
      "MessageIndex": 2,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/756483",
      "Title": "Scared and Worried jeanne46 Lynn1"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 10, 2010 07:56PM - edited Feb 11, 2010 12:27PM by traceyz HELLO LADIES! MY NAME IS TRACEY AND I WAS DX IN APRIL OF 2008. I WAS 40 YRS OLD AT THE TIME. I FELT SOMEHING, HAD IT CHECKED AND IT CAME BACK POSITIVE FOR BC. MY TUMOR WAS 2.9 CM WITH 1 POSITIVE NODE. AFTER CHEMO THEY REMOVED 7 NODES AND OUT OF THE 7 I HAD 1 NODE WITH A FEW DEAD A TYPICAL CELLS IN IT. MY TREATMENT WAS ADRIAMYACIN CYTOXEN, THEN TAXOTERE AND A YEAR OF HERCEPTIN AND NOW TAMOXIFEN. I HAD SURGERY AFTER CHEMO. A DOUBLE MASTECTOMY WITH EXPANDERS. GEEEEEZZ...ITS A LONG ROAD!! SO GLAD THIS THREAD IS HERE. ALSO LADIES IF YOU ALL ARE INTERESTED GO TO THE GET TOGETHERS FORUM AND CHECK OUT THE 2ND TA TAS SISTERHOOD REUNION IN VEGAS. WE DID IT LAST YEAR AND ARE GONNA DO IT AGAIN THIS YEAR. IT WAS A BLAST!!!!! AGAIN THANKS FOR THIS THREAD! GLAD I FOUND YOU!! TRACEY",
      "MessageIndex": 458,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 12, 2010 11:12PM traceyz wrote: HELLO WARRIOR! LAST YEAR I WOULD SAY THAT ALL TOGETHER I THINK THERE WERE CLOSE TO 30 OF US THAT WENT TO VEGAS.IN FACT MY PROFILE PIC WAS TAKEN WITH A FEW OF THE LADIES IN VEGAS. IM THE CHOCOLATE ONE. LOL!! IT WAS SOOOOOOOOOO MUCH FUN!! WE STAYED AT THE MIRAGE RIGHT ON THE STRIP. I AM SENDING PRAYERS YOUR WAY ABOUT THE JOB SITUATION! HEY I SEE YOU WERE HER2+. HAVE YOU HEARD ABOUT THE NERANTINIB TRIAL?? IT IS AN ORAL PILL TO BE TAKEN FOR A YEAR. THERE IS A THREAD HERE ABOUT IT. I AM WAITING FOR IT TO OPEN BACK UP. IF YOU HAVENT DONE SO, CHECK IT OUT. HAVE A GREAT WEEKEND LADIES!!!",
      "MessageIndex": 471,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 11, 2010 12:29PM traceyz wrote: HEY LADIES THANKS FOR THE WARM WELCOME!!! RENEE THE TRIP TO VEGAS IS OCT 1-OCT 4!",
      "MessageIndex": 464,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 21, 2010 10:53PM - edited Feb 21, 2010 10:57PM by traceyz HELLO TRIGEEK AND GINA, SORRY YOU HAD TO JOIN OUR THREAD! BUT IM HERE TO TELL YA YOU WILL GET THROUGH THIS!! IM NOT GONNA LIE TO YOU IT IS A LONG JOURNEY BUT YOU LEARN SO MUCH ALONG THE WAY. THE BONDS THAT YOU WILL MAKE AND THE GOODNESS THAT YOU WILL SEE IN PEOPLE IS AMAZING!! I LOOKED AT CHEMO AS A \"CLEANSING.\" NOW DONT GET ME WRONG I WAS NOT BOUNCING OFF THE WALLS WITH EXCITEMENT ON CHEMO DAY. BUT IT HELPS IF YOU REALIZE THAT IT IS PART THE WEAPONS USED IN THE FIGHT BACK TO GOOD HEALTH. LISTEN TO YOUR BODY. GET REST, TRY TO STAY HYDRATED, AND DONT PUSH YOURSELF TOO HARD. WE ARE ALL HERE TO HELP YOU ALONG THE WAY. THIS TRULY IS A SISTERHOOD! AND WE ARE ALL HERE FOR YOU. OUR HANDS ARE EXTENDED TO YOU JUST AS THEY WERE FOR US! GOD BLESS YOU BOTH, TRACEY",
      "MessageIndex": 500,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 23, 2010 10:07AM - edited Feb 23, 2010 11:25AM by traceyz HEY CHINUP! MY STORY WAS MUCH LIKE YOURS. I HAD 1 POSITIVE NODE AND I WENT TO GET AN OPINION FROM A LOCAL RADIAITION DOCTOR WHO TOLD ME THAT WITH THAT 1 POSITIVE NODE AND A 2.9 CM TUMOR I MUST HAVE RADIATION,SO I WENT TO ANOTHER DOC WHO SAID, LIKE YOU I WAS IN A \"GREY AREA.\" BUT THAT DOC HAD THE SENSE TO SEND ME TO AN INTERNATIONALLY KNOWN RADIATION DOC WHO ACTUALLY TEACHES AND HELPS WRITE JOURNALS. SO I DROVE TO RICHMOND AND HE REVIEWED ALL OF MY INFO. HE TOLD ME THAT DOING RADIATION WOULD GIVE ME A LESS THAN 1% BENEFIT IN SURVIVAL. HE BASICALLY SAID THAT SINCE I HAD A COMPLETE RESPONSE TO CHEMO AND ALL NODES WERE NEG AFTER CHEMO THAT DOING RADIATION WOULD DO MORE HARM THAN GOOD (LONG TERM SE/RECON ISSUES). SO AFTER BEING IN HIS OFFICE FOR MORE THAN AN HOUR I DECIDED NOT TO DO RADS. I THINK ABOUT IT SOMETIMES BUT I DO NOT REGRET NOT DOING THEM. I KNOW FOR MANY WOMEN ITS A NO BRAINER, RADS IS A GOOD CHOICE BUT FOR THOSE OF US IN THE \"GREY\" AREA IT CAN BE A STRUGGLE TO MAKE THE DECISION. IM GLAD YOU MADE A DECISION SO NOW JUST KEEP IT MOVIN GIRL WITH NO REGRETS!! I HOPE THIS HELPED. MOUSE, I HAD AN ULTRA SOUND AND THAT IS WHEN THE RADIOLOGIST SAW 1 NODE THAT WAS SLIGHTLY DIFFERENT FROM THE REST. THEY DID A BIOPSY OF THAT NODE AND IT HAD CANCER CELLS IN IT. SHE SAID THE REST OF THEM \"LOOKED\" NORMAL. SHE SAID THAT POSITIVE NODES WILL OFTEN LOOK FULLER OR CLUSTERED. SO WITH THAT I HAD CHEMO. AFTER CHEMO I HAD THE SURGERY AND OUT OF 7 NODES REMOVED ALL WERE NEGATIVE AND THAT 1 NODE HAD MICRO DEAD ATYPICAL CELLS IN IT WHICH STRONGLY SUPPORTED THAT THERE WAS ONLY 1 NODE INVOLVED. TALK WITH YOUR DOCTORS AND SEE WHATS GOING ON AFTER CHEMO. THEN DECIDE WHAT THE BEST THING IS FOR YOU. BEST OF LUCK TO YOU! TRACEY",
      "MessageIndex": 512,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 23, 2010 11:46AM traceyz wrote: HEY CHINUP, I DONT KNOW WHY MY DX DIDNT SHOW ON MY LAST POST BUT I WAS DX IN APRIL OF 2008. AND I UNDERSTAND TOTALLY WHAT YOU ARE GOING THROUGH. LIKE I SAID BEFORE SOME ACTUALLY DO NEED RADS, BUT SOME DONT, ITS NOT A ONE SIZE FITS ALL KINDA THING. AS LONG AS YOUR DOCS ARE BEHIND YOU, STAND STRONG ON THE CHOICES YOU HAVE MADE AND DONT LOOK BACK! YOU WILL ONLY TORTURE YOURSELF IF YOU DO. HUGS! TRACEY",
      "MessageIndex": 515,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 14, 2010 12:21AM traceyz wrote: YES INDEED LILAH!! IT IS AN ORAL THERAPY THAT HAS SHOWN ALOT OF PROMISE FOR HER2+ WOMEN. YOU TAKE IT FOR A YEAR. THERE IS INFO ON IT WITHIN THIS WEBSITE. I AM HOPING TO BE ON IT BY NEXT MONTH....FINGERS CROSSED!! I HEAR IF YOU GET THE REAL PILL AND NOT THE FAKE ONE THE SIDE EFFECTS ARE WEIGHT LOSS AND DIARRHEA. THERE IS AN ACTIVE THREAD ON IT HERE SO CHECK IT OUT. CANT WAIT TO MEET YOU IN VEGAS LILAH! IM SOOOOOO GLAD YOU ARE JOINING US!!!!",
      "MessageIndex": 473,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 15, 2010 09:37PM - edited Feb 15, 2010 10:15PM by traceyz WEETY, GIRL IM WITH YA ON THE WORRY!! ITS LIKE I TRY SO HARD TO STAY POSITIVE AND I KEEP HEARING MY DOCTOR SAY \"TRACEY YOU HAD A TOTAL RESPONSE TO CHEMO!\" I CAN ALSO HEAR MY DOCTOR TELLING ME THAT HER+ IS NOT THE MOST AGRESSIVE BECAUSE HERCEPTIN NOW LEVELS THE PLAYING FIELD. BUT ITS HARD!! SOMETIMES THE MIND CAN BE OUR WORST ENEMY. EVERYONE KEEPS TELLING ME THAT IF YOU KEEP THINKING THAT ITS GONNA COME BACK THEN IT WILL!! BUT IM LIKE HOW DO I STOP JUMPING TO CONCLUSION AT EVERY LITTLE PAIN!!??? UGGGHHHH!!! SO EVERYDAY I FIGHT TO TRY AND STAY POSITIVE, I AM HOPING THAT I CAN TRAIN MY MIND AND EVENTUALLY POSITIVE THOUGHTS WILL JUST COME NATURAL! DOES THAT MAKE SENSE?? LILAH, WHEN I FINISHED HERCEPTIN LAST SUMMER I WAS SOOOOOO DEPRESSED!! I FELT LIKE A SITTING DUCK! IN FACT I BEGGED MY ONC TO LET ME STAY ON IT FOR ANOTHER YEAR! SHE SAID ABSOLUTELY NOT! SHE EXPLAINED THAT HERCEPTIN IS NOT MEANT TO BE A LONGTERM MAINTENANCE DRUG FOR EARLY STAGE BC. IT IS JUST SUPPOSE TO KNOCK OUT STRAY CELLS THAT CHEMO MAY HAVE LEFT BEHIND AND BEING ON IT FOR A YEAR IS GOOD ENOUGH. ITS A STRUGGLE TO BELIEVE THAT BUT I AM DOING THE BEST THAT I CAN! THATS WHY THESE BOARDS ARE SO IMPORTANT! SISTERHOOD IS AMAZING!! IT IS HEALING!!! DID YOU HAVE RADIATION?? I DID NOT. I WENT TO A INTERNATIONALLY KNOWN RADIATION DOC TO GET A 3RD OPINION AND HE FELT THAT SINCE I HAD RESPONDED SO WELL TO CHEMO AND I ONLY HAD 1 NODE INVOLVED THAT IT WOULD ONLY IMPROVE MY SURVIVAL RATE BY LESS THAN 1%. AND WITH THAT HE RECOMMENDED THAT I NOT HAVE RADIATION. SO I DID NOT. AND I CONTINUE TO 2ND GUESS MYSELF ON THAT DECISION. BUT HEY YOU CANT LOOK BACK RIGHT!? ANYHOW I KNOW I SOUND LIKE A CRAZY BAG LADY RIGHT NOW BUT I SAY AAAAALLLLLLL OF THAT TO SAY THAT I AM SO MUCH BETTER MENTALLY THAN I WAS WHEN I 1ST FINISHED HERCEPTIN!! YOU MAY FEEL A LITTLE EMPTY WHEN YOU FINSH HERCEPTIN BUT IT WILL GET BETTER. OKAY I AM DONE RAMBELING! LOL.....THANKS FOR LISTENING LADIES!!! WARRIOIR, THANKS AGAIN FOR SUCH A GREAT THREAD! GOOD NIGHT LADIES! TRACEY",
      "MessageIndex": 479,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 23, 2010 03:37PM traceyz wrote: CHINUP, IM GLAD YOU ARE SOLID AND HAPPY WITH YOUR CHOICE. THEY REALLY DIDNT HAVE A NEED TO TEST YOUR NODES AGAIN AFTER BECAUSE THEY TOOK 14 AND THEY ALREADY KNEW THEY HAD REMOVED THE CANCER (3 NODES)  AND THE REST WERE CLEAN. SO THE CANCER WAS REMOVED AND 14 IS PLENTY TO FEEL GOOD ABOUT. THE RADS DOC I WENT TO EVEN TOLD ME THAT THE 7 I HAD REMOVED WAS PLENTY. IM NO DOCTOR BUT I THINK 14 IS A GOOD NUMBER. HAVE A GREAT DAY!",
      "MessageIndex": 517,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 25, 2010 01:36PM traceyz wrote: AWESOME AWESOME AWESOME!!!! YOU HAVE MADE US PROUD!!!! TRACEY",
      "MessageIndex": 529,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Feb 17, 2010 10:27AM traceyz wrote:",
      "MessageIndex": 482,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Sep 6, 2011 12:00AM traceyz wrote: Hi Ladies! Havent been on this thread in a LONG time! Hope you all are good! Dixie baby, You are gonna be fine. Get your opinions, think things through, and know that we are all here for you. You my dear are gonna be fine I just know it!",
      "MessageIndex": 1367,
      "PostDate": "06/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/145/topics/743397",
      "Title": "Stage II w/Lymph Node Involvement Warrior517 Moderators"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Jan 12, 2009 05:16PM - edited Jan 12, 2009 05:17PM by traceyz Hi Jancie and Kim, As you ladies have discovered you are NOT ALONE!! I was dx in April of 08 and I was DEVASTATED!!!!! I felt like my whole world had fallen down around me. Here I was a runner, fitness instructor, flight attendant living my life happy and healthy. Then out of nowhere a lump in my breast turned out to be breast cancer. WHAT??!!!! I had NOOOOO idea how I was gonna get through it and I remember when the radiologist said that I would most definately have to get chemo, I remember I started to weep. It was aweful. I prayed constantly and leaned on my new sisters. I went through 4 dose dense chemo regiments every other week, then later the last 4 rounds of a different chemo once every 3 wks. Yes my hair fell out and sometimes I really didn't feel too swift. I had days when I would feel mentally stable and days when I would cry my eyes out! After chemo I had surgery. I opted for a bilateral w/ immediate recon and am in the process of finishing up my expansion. I had such a good response to chemo that I was advised by a nationally renowned rads speacialist at MCV that I would not need rads. In April my PS will remove these expanders and put the permanent implants in. Ladies I say ALL of that to say that like all the rest of us here, you will get through it. I never could have imagined getting through this journey, but im doing it, and you will to. There will be tears, but after it's all said and done they turn into tears of joy. This is an AMAZING sisterhood. We had hands extended to us and now we extend our hands to you, and believe it or not you will soon extend your hand to someone in your shoes. You are gonna be fine, you are gonna make it! And your sisters will be here for you to make sure that you have the support you need when you need it. Lean on us, we are here for you. This to shall pass. I promise! Tracey",
      "MessageIndex": 49,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726815",
      "Title": "I am scared -just diagnosed jancie traceyz"
    },
    {
      "AuthorID": "traceyz",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66286/profile",
      "Content": "Sep 27, 2008 05:13AM traceyz wrote: Tera, I have already prayed for you and I know you are gonna be fine no matter what. With that said please keep in mind that the odds are in your favor. Most breast issues turn out to be benign, so I have this great feeling that you are fine. Take a deep breath and know that we are here for you no matter what the outcome. Tracey",
      "MessageIndex": 8,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/721769",
      "Title": "SCARED TO DEATH!!! teralutt0805 teralutt0805"
    }
  ]
}