{
  "AuthorID": "Traej",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289392/profile",
  "Posts": [
    {
      "AuthorID": "Traej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289392/profile",
      "Content": "May 23, 2019 10:03PM Traej wrote: Update: mammogram and ultrasound showed the lumps were simple cysts! I am relieved though I don’t like the idea of them being there. I got the all clear at the centerbut my dr called this afternoon with the report to let me know that a cyst had grown. It is a benign looking cyst. I asked if I should be concerned and he said that I could call a breast surgeon if it bracken bothersome or worrisome. I told him everything worries me lol. So I’m not sure what I should do. For now I will just take a deep breathe!",
      "MessageIndex": 7,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    },
    {
      "AuthorID": "Traej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289392/profile",
      "Content": "May 23, 2019 02:37AM Traej wrote: thank you so much",
      "MessageIndex": 5,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    },
    {
      "AuthorID": "Traej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289392/profile",
      "Content": "May 23, 2019 02:38AM Traej wrote: I do feel like the lumps show up over night. One time I feel an area and it’s fine and the next it feels like a large lump has appeared. Ugh!!",
      "MessageIndex": 6,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    },
    {
      "AuthorID": "Traej",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/289392/profile",
      "Content": "Traej wrote: I am 45, have a long history of breast cancer in fam. Including mom. Mutation negative. I have multiple cysts in my breasts and have had a couple of biopsies. Also had a fibroadenoma. I was due for yearly mammo in December and never got to it. Due for screening mri in June. Was doing a breast exam. I haven’t done one in a long time and felt a lump. That lump seems to be smaller but found a much bigger lump shortly thereafter. I have been waiting about two weeks for diagnostic mammo. That is tomorrow. I keep feeling this lump. I kind of feel like I need to chase it when feeling for it but it is big. And my breast feels weird. Kind of heavy. I am so anxious and scared. I am so mad at myself for not going to get my Mammo in dec. thank you for listening Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871672",
      "Title": "Another scared and worried here Traej Salamandra"
    }
  ]
}