{
  "AuthorID": "Tramyar",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269819/profile",
  "Posts": [
    {
      "AuthorID": "Tramyar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269819/profile",
      "Content": "Tramyar wrote: hi good day everyone beautiful mom's! Im not old, but why i am here? I just found this forum searchibg all over the internet, overnight , i cant sleep im confused. I am 25 years old and i love my mother, last year june, my mother she found out that there is something unusual feeling on her breast.. Its like a small bump. She told thia to us and we told her to go to a good hospital for checkup. She went and they scheduled for her mammogram, they saw that there is ome tumor on her left breast and small cyst on her right breast which ia not cancerous from what i know. For the tumor it is very solid and the doctor told us that there is posaibility it can be cancerous because of what it looks. And now im confused and scared, im not scared because if she will get breast cancer if its the finding once she will arrange for biopsy. What i am getting scared is she cannot handle the operation once the doctor said she needs operation to get rid off the tumor. My mother is having a serious heart problem since she was a kid. And it became more severe now when she got older. She is now 59, i want the tumor to be removed if its cancerous but im afraid if she cannot handle the operation, because what doctor said she will need to be injected with general aenestesia. Please if there is anyone who has any experience on what my problem is please send me any message or comment here. Godbless to all the mothers here and thank you for the love. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862893",
      "Title": "My mom has heart failure, is she can handle the surgery? Tramyar mustlovepoodles"
    },
    {
      "AuthorID": "Tramyar",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269819/profile",
      "Content": "May 9, 2018 10:31PM Tramyar wrote: hi ... My mom already had core biopsy They found out that she is having cancer. So we are all sad and afraid. But what we are wondring is they dont know what stage. They telling to my mom have a surgery first then we can tell you what stage. Second the problem is she went to cardio and all test for her clearance for operation and they saw some issues on her heart. ",
      "MessageIndex": 2,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/862893",
      "Title": "My mom has heart failure, is she can handle the surgery? Tramyar mustlovepoodles"
    }
  ]
}