{
  "AuthorID": "Trekgirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205583/profile",
  "Posts": [
    {
      "AuthorID": "Trekgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205583/profile",
      "Content": "Oct 3, 2014 03:52AM Trekgirl wrote: Had 1st visit with my MO. I start my chemo on 10/8 with Cytoxan/Taxotere, 6 rounds then a month off then 6 weeks of rads.  Then he proceeded to tell me that in one of the scans a \"possible\" spot was noticed on my liver. I go Sat. for a ct scan of my abdomen. He seemed to act like it was no big deal and that it was a standard thing and prob nothing. Not sure if that was true or if I just saw his poker face. I also wonder why my surgeon didn't tell about this at my last visit. Tomorrow I have an appt. with a nurse to go over the treatment plan and get some helpful hints. Should be about 2 hours. Also have to stop and pick up the drink stuff for the ct scan. I still can't believe all of this.",
      "MessageIndex": 94,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Trekgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205583/profile",
      "Content": "Oct 9, 2014 02:58AM Trekgirl wrote: Hi everyone I had my 1st chemo round today. I handled it all quite well really. Found out the spot on my liver is just a small cyst, Dr. said leave it there it's harmless, works for me. I think I'm getting a little foggy, either that or I'm just tired. Go back in 10 days for blood work. Is there anything pre-emptive to avoid that neulasta shot? It seems that most people have more of a reaction to that than anything else. This site is great! Time to go American Horror Story premiere is coming on! Stay strong everyone! Hugs to all <3",
      "MessageIndex": 162,
      "PostDate": "09/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Trekgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205583/profile",
      "Content": "Oct 4, 2014 04:03AM Trekgirl wrote: Thanks to all for your show of support. This place is saving my insurance co. money in therapy fees :) . I'll worry about the liver issue if it becomes an issue.  One thing that I've noticed going thru these posts is that most of the people out there that are diagnosed like me, Stage IIA, Grade 3 have had mastectomies. I'm a little concerned that my dr's weren't aggressive enough? I know you don't get the real staging until after surgery but I did ask if in hind sight I should have had that done my MO said no. Another thing is no one has mentioned to me Neulasta or Claritin like a lot of you posted. Does that get sprung on you at your 1st session or something?",
      "MessageIndex": 105,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    },
    {
      "AuthorID": "Trekgirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/205583/profile",
      "Content": "Oct 2, 2014 06:04AM Trekgirl wrote: This is my 1st time posting. I see my oncologist for the 1st time tomorrow, that's when I find out if chemo (I believe that will be a yes) and what drugs will be used. My husband passed away June 19th after being sick for only 24 days. This whole summer was a nightmare and I am so glad it's over.  My husband dying and me having bc seems so surreal. I feel like I'm in someone else's nightmare. My lumpectomy was on Aug. 26 so I would think that they're going to start things moving pretty quickly now. Will stop by tomorrow and update. This site has made things easier. Thanks to all of you.",
      "MessageIndex": 81,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    }
  ]
}