{
  "AuthorID": "Treso",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
  "Posts": [
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 2, 2012 10:24PM Treso wrote: Hi.  It is so difficult to watch someone go through this, especially someone you love so much.  My mom is 92 and I just love her to pieces.  It hurts me to have to watch her watch me go through this, although, I have been one of the lucky ones so far in that I tolerate things fairly well.  I can't tell you if 70 is high for your mom since there is nothing to compare it to.  I can suggest, though, that you check out Marybe's thread called \"Between the devil (the red one) and the deep blue sea\".  She is quite an inspiration to us.  Her markers have been in the 7,000s.  She is on a new chemo for her and they are coming down.  In comparison, when I had progression, mine went to 160 (the CA15.3) while I was doing Faslodex.  After 6 1/2 months of chemo, mine is now 31 (as of 1/14/12).  We are all such individuals, what might be high for one may be normal for another. Thank you for your prayers for us.  I wish the best of outcomes for your mom with her PET Scan.  Whatever it may be, it sounds like she has some wonderful support in you.  Now, I have to go bake a cake for a friend's birthday! Theresa",
      "MessageIndex": 2,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782086",
      "Title": "HELP ME STOP CRYING!!!!!! ILOVEMYMOTHER sincitydealer"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Aug 3, 2011 10:12PM Treso wrote: Lynn1: I'm telling you, it hurts! Treso",
      "MessageIndex": 27,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772501",
      "Title": "Runny Nose -- Rant!! Lynn1 Lynn1"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Aug 2, 2011 11:12PM Treso wrote: Ah, what fun!  I also have a runny nose and watery eyes from Xeloda and/or Taxotere.  I also had it in 2008 with Taxol.  To add to my fun, my nose sprouts blood at the most inopportune times I've also had the nose sore - I use vaseline for those).  Luckily, it is not every cycle, every day.  Mine gets better with time.  I take so many other drugs for side effects, I never thought of taking allergy meds.  Sorry I have no solution for you.  Just wanted to commiserate and confirm that it is the chemo. Treso",
      "MessageIndex": 24,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772501",
      "Title": "Runny Nose -- Rant!! Lynn1 Lynn1"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 11, 2011 08:33PM Treso wrote: scrap2book:  Do you have any side effects from Zometa?  Sometimes, I sail through but, sometimes I feel like I have a mild flu and then, other times, I am sooooo tired for 2 or 3 days, I could cry.  I have fallen asleep in the middle of a coworker's/friend's sentence and started to dream.  Woke up answering her question with information from my dream.  Luckily, she's got a great sense of humor!  But, sometimes (and this happens throughout the month), I struggle to stay awake while driving, any time of the day or night.  Last month, I had terrible jaw pain for three days.  My onc cut the dose in January and my jaw feels better, although, I'm aware of my jaw (I guess that's the symptom before pain) and sometimes have some slight discomfort.  I take nothing, tylenol, aleve or percoset during the day, depending my pain.  I take Percoset and Xanax at night for pain and sleep.  I know how you feel about turning off the brain!  Lately, I've been thinking that a new mattress may help (with sleep, not brain).  I know insomnia is a side effect of Faslodex, Zometa AND menopause.  Don't think we're going to win, here.  I have a script for Ambien but hesitate taking it. How long have you been on this treatment?  It's so good to talk to people in such similar situations.  Oops, I think it's time to take an anti nausea to counter the percoset.  This is such fun!",
      "MessageIndex": 36,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764651",
      "Title": "Yesterday I ranted, today I got a miracle... Lowrider54 Lowrider54"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 11, 2011 08:19PM Treso wrote: Lowrider:  Thanks so much for your quick reply.  Was there any particular reason your onc chose Aredia over Zometa?  I was originally supposed to do chemo (Gemzar) and Zometa but my onc wanted to give the Faslodex a try and save the big guns for later.  Soooo glad we did. So sorry about your disc issues.  I have/had a herniated disc which has mended (or I just tolerate it, hmm) on its own.  I did a lot of anti inflammatories, pain meds and babying my back while I was going through it.  Lucky me who had one of my flare ups during my radiation stint.  Those tables are super comfy.  Made me forget my diagnosis for a minute or two, though. So far, I've joined a club for which I didn't want to be a member and now I'm on a cruise that I don't remember looking forward to.  Back when I was Stage III (ah, the good times), one of the women in my group exclaimed how she felt as though her BC was a gift from God.  When someone is voicing an opinion, especially one helping that person get through something awful, I like to keep my opinions to myself.  Except for this time.  If this is a gift, I'd like to return it, please.  Wouldn't even bother regifting (there just isn't anyone I'd do that to). I sure hope the accupunture works for you.  You sound like you need a break (definately no pun intended). Hugs right back at ya...Treso",
      "MessageIndex": 34,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764651",
      "Title": "Yesterday I ranted, today I got a miracle... Lowrider54 Lowrider54"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 10, 2011 09:17PM Treso wrote: Lowrider (or anyone with a similar experience!): I was diagnosed with a recurrence of bone mets in August 2010.  I am getting monthly shots of Faslodex and an infusion of Zometa and have only one spot left right now at T7.  I have asked my onc why the continued pain and it is, of course, damage having been done to the bones.  My pain is mostly at night while I'm in bed.  I find myself moaning and groaning attempting to turn over or lay on my back (which is distiburbing to me because I have a pretty high threshhold for pain).  I see from your post that you have trouble getting up in the morning and, it looks like you have disc issues but I wondered if you experienced any pain during the night due to the bone mets?  Does anyone else experience this?  Do you know of the reason(s) why this nighttime pain?  Pardon if you've discussed this before.  I'm fairly new to the site.  I joined in October but haven't been too active until now.  This is such a WONDERFUL site.  I go to a support group but no one has bone mets and I have no one to commiserate with!",
      "MessageIndex": 28,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764651",
      "Title": "Yesterday I ranted, today I got a miracle... Lowrider54 Lowrider54"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 10, 2011 07:29PM Treso wrote: H Bruburn: My initial diagnosis was June 2008, Stage III, 5/15 + nodes.  I opted for a bilateral mastectomy (CA in only left breast) with DIEP Flap reconstruction and never looked back even though I was diagnosed with a reccurence to my bones one week after your diagnosis.  I had a salpingo oophorectomy in September 2011.  My scans are every three months which seems pretty common.  Last night at my support group, one of the women asked me if I get tired of all the treatments and surgeries.  My response was \"absolutely not!\".  Bring it in...the more aggressive, the better.  I plan on sticking around a looooong time.  After being diagnosed with extensive bone mets, I have only one left on my spine.  I know about being terrified, too (don't we all?).  I was waiting for the other shoe to drop and it did.  My thoughts are with you... ",
      "MessageIndex": 12,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764582",
      "Title": "7 A/Cs - now Femara and possible mastectomy Bruburn Treso"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Sep 20, 2011 11:35PM Treso wrote: Chickadee:  I was in excruciating pain after the dx of my bone mets (T7, L3, L4, ribs, femurs, scapulas, humerus, pelvis and probably some others I'm forgetting...).  I used the patch (in a baby dose my onc tells me!) which helped, doubled the dose and had bad side effects.  I also have severe motion sickness problems which has been difficult over the years for pain meds.  I tried percoset which I was not able to take in prior years but am able to now.  Who know why?  That is what ended up controlling the pain and what I still use.  After a couple different treatments, my spinal mets have reduced by half and I am in control of the pain.  It took months but, I know how you feel about fearing never to be out of pain again.  I can tell you that it does happen.  It did for me.  There can be light at the end of the tunnel (hey, not that tunnel - get out of there!...just my little response to the uncomfortable turn of the thread earlier). The other feeling I can identify with is being incapacited and needing help.  I have done everything myself for so many years and have been so independent, I just hate having to get help.  It frustrates the heck out of me.  I live alone so, I have to go one step further and ask for family or friends to come over to help me.  Luckily, that hasn't happened too much! Here's to pain control and good results on your scan.  I'll be thinking of you. Treso",
      "MessageIndex": 33,
      "PostDate": "20/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/774448",
      "Title": "Insenitive, thoughtless, dumb....... Chickadee 1Athena1"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Aug 3, 2011 03:11AM Treso wrote: Kathy: I was dx with bone mets in 8/10 and did Faslodex until dx with liver mets in 4/11.  I am on Xeloda and Taxotere and have responded really well.  The PET couldn't pick up the liver lesion and the mets on my spine have reduced by half.  I was told today that my HGB is too low and will need to get shots of Aranesp.  I read up on it and it really scared me, especially the part about tumor progression.  So, I feel like I should refuse the drug because I'm responding so well to the chemo.  I know this isn't exactly your circumstance but I felt like it paralleled it a bit. So, did you stop the Epogen? Treso",
      "MessageIndex": 6,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770891",
      "Title": "Epogen (anemia drug) quandray Kathy36 Treso"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Sep 10, 2011 03:09AM Treso wrote: Well, luckily, my hgb came back up so, I don't have to deal with it right now.  My onc tells me that problems occurred when it was used over-used and hgb went up to 14 or higher.  Thank goodness for my chemo free week every three weeks!",
      "MessageIndex": 10,
      "PostDate": "10/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770891",
      "Title": "Epogen (anemia drug) quandray Kathy36 Treso"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 6, 2011 03:20AM Treso wrote: I had a skin-sparing bilateral mastectomy (BC in only the left breast but wasn't waiting around for a reoccurence in the right) in January 2009.  I had DIEP Flap Reconstruction surgery in December 2010.  I couldn't be happier with the results.  I am so glad I did what I did.  Good luck and good thoughts to you...",
      "MessageIndex": 70,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/763618",
      "Title": "February 2011 Mastectomy texasrose361 TinaT"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 2, 2012 11:45PM Treso wrote: Amy:  I don't know the size or location of your liver tumors and I know were are all different but, there are so many chemos out there and options beyond chemo.  I agree with the ladies here that a second opinion is in order.  A friend of my has had liver surgery, chemo injected directly into her liver and radioactive isotopes implanted in her liver (to name some other options).  I don't know what options would be apropriate for you but, I can't believe that there are only two chemos for you and the only thing left is a clinical trial.  I have mets to my bones and liver.  A combination of Xeloda and Taxotere did a nice job on them; the liver lesion is undetectable and all but three remain on my spine.  I understand about your hair.  Mine is coming back in for the second time.  My hair used to be my identity; but it's so unimportant to me now.  I figure it'll always grow back; my life will not.  I hope you get a second opinion; we want you here on the boards for a long time. Whatever decision you make, my thoughts and prayers are with you. Theresa",
      "MessageIndex": 18,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782064",
      "Title": "Stopping treatment & need feedback ameliak CoolBreeze"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Feb 2, 2012 09:31PM Treso wrote: Hi.  I'm Theresa (Treso-a nickname from my teenage years).  I'm 52, single (11 year relationship-love of my life-but, apparently not his and only took me a decade to get past it - oh wait, what's the name of this thread?), no children but 2 wonderful nephews and 4 fabulous nieces (1 of whom we lost to leukemia when she was 12), an absolutely fantastic, loving family and inumerable friends who are incredibly supportive and I love dearly.  My sister has been my lifeline.  My Stage III dx came when I was 49 (6/08).  I had chemo, BMX (only one breast affected but I like feeling like I have control), rads, DIEP recon, took tamox and went back to work in 4/09 and got on with the business of living.  In 8/10 was dx with mets to bones (oh, so many).  I had an oophorectomy and did faslodex and zometa until a scan showed a lesion on my liver in 4/11.  Starting in the beginning of 5/11, I did Xeloda and Taxotere.  My 6/11 scan couldn't detect the liver lesion and only 3 on my spine remained active but reduced by 1/2.  My 9/11 (yikes) scan was stable.  I finished chemo in mid 11/11.  My 12/11 was stable.  I get zometa every other month and bloodwork every month (at my suggestion, uh, insistence). I can't remember how I found this site.  So, I'm left with 2 (3, really) questions.  Is it menopause, chemo, age or the 70s that took my memory and how does a 52 year old Stage IV BC Sister find a date?  And, finally, do I really have to go back to work?",
      "MessageIndex": 51,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781871",
      "Title": "...And you are? EnglishMajor keepingon"
    },
    {
      "AuthorID": "Treso",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/110993/profile",
      "Content": "Treso wrote: Hi All: Is anyone planning on attending the LBBC Conference on Metastatic Breast Cancer in Philadelphia next weekend (April 30 - May1)?  Treso (Pardon me if this has already been discussed-sometimes I get overwhelmed sifting through all of the messages.  I want to read them all but, there just isn't enough time in the day.  I have to go to work!) Never cook bacon naked... Dx 6/23/2008, ILC, 2cm, Stage IV, 5/15 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768079",
      "Title": "Conference Treso EnglishMajor"
    }
  ]
}