{
  "AuthorID": "trial2me",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166716/profile",
  "Posts": [
    {
      "AuthorID": "trial2me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166716/profile",
      "Content": "Jan 7, 2013 09:03AM trial2me wrote: Thank you all for such positive and helpful replies. It is very encouraging to hear that life after can be good if precautions are taken and due care is provided. Most of the battle is fought in the mind, so thank you so much. The treatment plan is being made, so I will keep updating as things move along. Hopefully, there will be a positive response to the plan.",
      "MessageIndex": 7,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798175",
      "Title": "Diagnosed Stage IV trial2me trial2me"
    },
    {
      "AuthorID": "trial2me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166716/profile",
      "Content": "trial2me wrote: My sister-in-law has just been diagnosed with Stage IV Breast Cancer and my brother and whole family is in shock. She was diagnosed with cancer two weeks back and just now after further test results came, we got to know it is Stage IV. Due to the severity and some early research we were thinking of enrolling into clinical trials, but we have a lot of questions that we hope to get some answers. I am sharing the patient history first: 1. Age: 38 2. One child born 5 years ago. 3.  Ethnicity: Chinese 4. Family history of breast cancer 5. Canadian based in Vancouver The cancer has spread into the lungs and is present in lymph. Proposed method is to do chemo first and then surgery. Awaiting more test results for bones and doctor will create a treatment plan after 10 days (Jan 7th 2012) Questions: 1. Country/Place with the most advanced treatment? 2. Should we enroll in Clinical trials? Country with good clinical trials. 3. We have Canadian health insruance with extended benefits that cover some of the advanced more costly drugs. If we move to another country (such as US) will we be allowed to get health insruance? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798175",
      "Title": "Diagnosed Stage IV trial2me trial2me"
    }
  ]
}