{
  "AuthorID": "Tricia81",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
  "Posts": [
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 6, 2013 01:21AM Tricia81 wrote: Hi ladies! I just came home from getting a second opinion for a MO. I really like him and now feel more comfortable with my decision to go with TCH rather than AC-TH. I will start tx on April 12. I do have a question though after reading some of the posts. What is a Neulasta shot? This wasn't brought up in either of my consultations. Is this pretty standard for anyone getting TCH? Thanks ahead of time for any feedback.",
      "MessageIndex": 107,
      "PostDate": "06/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 23, 2013 11:19AM Tricia81 wrote: Thanks Speedy4! I'll definitely tell my MO about it. It is painful! Especially the ones on my forehead and shoulders.",
      "MessageIndex": 521,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "May 1, 2013 07:12PM Tricia81 wrote: Thanks Ladies for all your encouragement and prayers! I'm getting released from the hospital today. My WBC was only at 240 and my MO orginaly said he wanted it at 500 before discharging me but I begged and pleaded with him this morning and he finally gave in. So I'M GOING HOME! I know it was only four days but I was starting to get depressed. I mean the entire time I was here was like a constant reminder that I have cancer. At least at home Im distracted and can live a semi normal life. And Im just not use to sitting around all day. I'm a mom of two young girls, ages 4 and 2. So they keep me very busy. And I'm just not good at \"taking it easy.\" Plus we don't have cable at home and Im not a fan of daytime tv. So I was going stir crazy here. Anyway I can't wait to go home hug my girls, take a long shower and wash my hair....oh that was another thing Im 12 days post my first treatment and haven't lost an hair yet, so the entire time I'm in the hospital, I'm praying my hair doesn't start to fall out until I get home lol. Anyway, enough about me. All of you beautiful ladies getting chemo this week will be in my thoughts and prayers. Have a good Wednesday everyone!",
      "MessageIndex": 689,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "May 11, 2013 02:14AM Tricia81 wrote: I have about taking the Claritin before the Neaupogen injections. If Im taking my injection at 4:30pm what time should I take the Claritin? In other words how long should I want to take the injection after Itake the Claritin? I tried asking my Oncologist but he acted like he never heard about taking Clartin to reduce side effects of the Neupogen shots. He said I can go ahead and try it but he doesn't have any information on it.",
      "MessageIndex": 864,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Mar 30, 2013 11:59PM Tricia81 wrote: Hi Everyone! I will be starting Chemo on April 12. I'm meeting with a second MO on April 5th. The first MO is having me decided between two treatment options: AC x4 and THx 4 or TCHx6. His words to me were \"Both treatments are just as effective but AC is more agressive. I personally would go with AC and TH but it is a personal decision that you have to make.\" To top it off the Oncologist Case Manager that I was suppose to meet with before my treatment started is on vacation and won't be back until April 15, so instead of getting an in depth explaination on what to expect on the first day of treatment I got a nice short email that said to dress warm, eat a good breakfast, and bring snacks since the chemo room does not provide food. Nice! Hopefully I will get more information from the second MO and he can shed more light on the differences between the two treatments. Otherwise I feel like I'm pulling at straws here. Anyway can't way to meet more of you ladies so we can compare notes and support eachother. ",
      "MessageIndex": 57,
      "PostDate": "30/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 23, 2013 12:22AM Tricia81 wrote: I'm four days out from my first treatment. I've have very little side effects. Some fatigue. A little nausea. My mouth is sore but it's tolerable. However I did break out all over my chest, shoulders, upper back and face. Has anyone else experienced this? If so is there anything your doing to treat the acne? Or do I just have to relive puberty all over again? :) I hate to complain about something so vain especially bc I will take this over more serious side effects but I was just curious if anyone has had this happen to them?",
      "MessageIndex": 504,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 12, 2013 08:12PM Tricia81 wrote: I'm so disappointed right now. I went in for my first chemo treatment this morning and my MO told me that a spot showed up on my liver in the CAT Scan. It's 17mm. So I have to have an MRI later this afternoon to see if the MRI can tell us if it's bein or not. I was feelin so prepared for my chemo and was in such good spirits. Now Im sick to my stomach! I'm praying that this is just one small snag in the road and the spot is nothing. I don't think I can handle more bad news.",
      "MessageIndex": 230,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 16, 2013 04:30PM Tricia81 wrote: Hi Ladies! My MO called yesterday and my MRI results showed that the tumor on my liver is beign! Praise The Lord! So we are back in to chemo on Friday. Hang in there ladies. We will get through this. My thoughts and prayers are with everyone starting tx today.",
      "MessageIndex": 346,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 19, 2013 07:34AM Tricia81 wrote: Start my chemo bright and early tomorrow morning. My MO had me start taking Decadron (sp?) today. Haven't had any SE yet. Im already on a head start with the stool sofferens... that is the last thing I want to deal with! I'm surprisingly not too anxious about tomorrow. Maybe because of the false alarm last week. I hope I handle the first treatment like you PamelaKay and Retta175. I'm a stay at home mom of two precious girls (4 and 2). I'm hoping to give them as much normalcy as possible. They are definitely my inspiration! Well I'm going to try and see if I can get some sleep. My thoughts and prayers are with you all!",
      "MessageIndex": 422,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "May 9, 2013 07:12AM Tricia81 wrote: 18 was my magic number. Yesterday was 18 days after my first tx and when my husband came home from work I told him it was time I get out his razor. It was such a relief! My girls took it really well too (I wasn't sure how they would react since they are only 4 and 2). Anyway Im actually pretty happy how it turned out. My second tx is Friday. Just as I'm gettig my taste buds back. I'm getting a little nervous. The side effects were not too bad from first tx but I've heard they get worse each time. We shall see.",
      "MessageIndex": 844,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 29, 2013 07:45PM Tricia81 wrote: My daughter caught a cold at school. Needless to say it got passed around the whole family including me. I had to go to ER yesterday bc my temp was 101.2. The ended up admitting me. I was hoping they would discharge me today, but they are keeping me at least another night. My MO came to my room this morning and said that from now on I'll be getting the shots after chemo. Not what I wanted to hear! I've heard so many bad things about the side effects. Anyway sorry for complaining. I just want to go home! Actually I want life to return to normal. I miss normal!",
      "MessageIndex": 656,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "Apr 20, 2013 06:10AM Tricia81 wrote: Just finished my firs chemo infusion. Although the day was long (8 hours total, that included meeting with MO first, a short teaching by the oncology case worker, and then the rest of the day was in the chemo chair). The day went very smoothly and surprisingly the time passed quickly. I'm home now and feel just fine. We'll see how long it takes before the SE kick in.",
      "MessageIndex": 442,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "Tricia81",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/171261/profile",
      "Content": "May 11, 2013 03:14AM Tricia81 wrote: Great thanks Ladies!",
      "MessageIndex": 867,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    }
  ]
}