{
  "AuthorID": "trinigirl50…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231238/profile",
  "Posts": [
    {
      "AuthorID": "trinigirl50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231238/profile",
      "Content": "Apr 18, 2018 04:08PM trinigirl50 wrote: ER100% PR- . Three years NED. ",
      "MessageIndex": 75,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/834067",
      "Title": "What percentage ER+ and how many years NED? TectonicShift GraceB1"
    },
    {
      "AuthorID": "trinigirl50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231238/profile",
      "Content": "Feb 7, 2019 06:25AM trinigirl50 wrote: I had a rash on an off for awhile after my treatment. Little red spots. They came and went on my chest, then sometimes on my face and feet. Eventually they went away. Every now and again they pop up. I went to a Dermatologist (Dr), gave me a cream (mild antibiotic I think). I still get the occasional red dot now and again. Wasn't IBC or anything like that. Never got a real diagnosis of what it was.",
      "MessageIndex": 4750,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "trinigirl50…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/231238/profile",
      "Content": "Jan 31, 2019 02:23PM trinigirl50 wrote: Hi Kec1972 I had 25 rads left breast (whole breast and armpit). My breast was fine for first two weeks. Third week it went red, fourth and fifth week it went deep mahogany brown. I was not in pain, and I used special radiation cream (can't remember name) after every session immediately, and then again at night. I was careful to only use water (no soap) on the area, and to gently pat it dry. No bras either, nothing that would irritate the area. Unfortunately my skin did react, in that it tightened significantly, so that my left breast is quite a bit higher than my right. My skin mainly went back to normal colour but with small patches of darker pigment. I also have small patchwork of red capillary looking marks underneath the breast. My doctor says that is due to radiation. None of these marks or slight discolouring are particularly noticeable. But my skin is tight and my breast is harder than my other non radiated breast. Not trying to frighten you but the tightening is a possibility. Having said that, my friend did same treatment as I did and 9 years later has absolutely no signs that she ever did radiation. Neither of us suffer from any breathing issues or heart problems.",
      "MessageIndex": 24,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869415",
      "Title": "Anyone on Here a few years out from doing Radiation treatments? kec1972 ruthbru"
    }
  ]
}