{
  "AuthorID": "TripleP",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213589/profile",
  "Posts": [
    {
      "AuthorID": "TripleP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213589/profile",
      "Content": "Mar 3, 2016 09:10PM TripleP wrote: Have no help or response for you, and actually wanted to pick your brain. I think you said your truncated lymphedema started under your arm. I have made several plane trips lately and recently came home sick and have been pretty sedentary for the last 2 1/2 weeks. The other day I noticed that my under arm and side on the surgery/radiation side was kind of puffy. Additionally my favorite bra was fitting tight so I switched to my loosest one. Is this how yours first started? There is no pain to speak of just a bit of discomfort. I did not know that LE could be truncal. When I read a post about it, I wondered if that is what is going on with me. Sure would appreciate your input",
      "MessageIndex": 1,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841124",
      "Title": "Truncal LE spreading to other side. paintThesky Binney4"
    },
    {
      "AuthorID": "TripleP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213589/profile",
      "Content": "Mar 3, 2016 10:40PM - edited Mar 3, 2016 10:40PM by TripleP glennie19, thanks for responding! I did call my radiologist and made an appointment for next week. I was just hoping I was not imagining things. You have reinforced my view that I should get this checked out. Thanks again for the reply",
      "MessageIndex": 3,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/841124",
      "Title": "Truncal LE spreading to other side. paintThesky Binney4"
    },
    {
      "AuthorID": "TripleP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213589/profile",
      "Content": "Apr 3, 2015 10:34PM TripleP wrote: I had a breast exam at doctors in late Nov. And she felt nothing nor did I but a mammogram in Dec, another in January found what was thought to be a small tumor. But after MRI it was found to be much larger like yours and another tumor was found in the same breast. I started chemo right away so first treatment was Feb. 12th. I'm scared, too",
      "MessageIndex": 2,
      "PostDate": "03/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/829765",
      "Title": "Really scared MOA lrjleyba"
    },
    {
      "AuthorID": "TripleP",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213589/profile",
      "Content": "Mar 2, 2016 03:08PM TripleP wrote: Question for those who have mets to bones. I took Herceptin until the end of January and gave been on Arimidex since last fall. I have had a terrible time with my hands, not being able to make a fist, trigger fingers, pain, stiffness since I started Arimidex. I am sure this is either due to the Herceptin and Arimidex. But in mid December a new pain started in my wrist and lower arm. The doctor thinks this is due to the Arimidex and I certainly hope it is. However, I was wondering if bone mets can start in a joint and what it feels like. This is a pretty sharp pain that is aggravated by movement",
      "MessageIndex": 3382,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}