{
  "AuthorID": "TriplePositiveP",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220956/profile",
  "Posts": [{
    "AuthorID": "TriplePositiveP",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/220956/profile",
    "Content": "TriplePositiveP wrote: I am scheduled for a lumpectomy/oncoplasty Monday Feb 1st, following neoadjuvant chemo that ended 12/29/15. I had a rough time during chemo (vomiting was the worst SE) then was hospitalized last weekend with an infection, so I am just now starting to think about surgery. Surgery will involve lift and reduction of non-cancerous breast and repositioning of remaining breast tissue in cancerous breast after lumpectmy. They cannot estimate post-surgery size, so not sure how to shop for a front-closure sports bra that does NOT compress. What height wedge should I purchase for post-surgery reclining/sleeping? 12 inches? Is a neck pillow helpful and if so, what style works best? Regular pillows under each arm? Had a pre-surgery appt to see drains, still not sure I understand how best to position them while sleeping to avoid a pinching feeling. Nurse said they were hoping to have a \"belt\" by the time of my surgery, but if they don't what should I look for on amazon? Are there photos on this website of post-surgical aids? Realize that I have no button front tops except for a few flannel PJ tops. It sounds like there is The potential for messy leakage that makes having more than 2 tops a requirement, yes? Long sleeves or short sleeves? Fabric? (Have read that silky makes movement easier, but sounds so cold). Thanks in advance. I am not accustomed to feeling this unprepared for anything. P.S. I could not find a way to make my dx & treatments visible to members only. It looks like there is no option for that with signature either. I am triple positive, dx july 29 2015 Left, IDC 2cm grade 3 Left, DCIS 4cm grade 3 TCHP neoadjuvant 09/14/15 - 12/29/15 (herceptin only started 01/20/16) Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "26/01/2016",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/840716",
    "Title": "What size wedge for post-surgery sleeping TriplePositiveP rainnyc"
  }]
}