{
  "AuthorID": "Trisha45",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179951/profile",
  "Posts": [
    {
      "AuthorID": "Trisha45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179951/profile",
      "Content": "May 28, 2013 02:19AM Trisha45 wrote: Having my biopsy tomorrow - seems like the wait has been forever, although it's only been a few days. I've cut my hand, stubbed my toes, dropped things, gotten dates wrong........I've made it a point to stay away from my bank account...lol. I know that I could very well be in the 20% benign, but feel like I have so many factors against me especially since reading my radiology report. That word pleomorphic really isa scary one. Wilson and Moons...my thoughts are with you! Hoping for good results. I've spent the past few days on google - this is the only \"positive\" site I have found. Wish I could reach out and hug each and everyone for the kind words you have shared to people in need. Sometimes, that's all that's needed - someone to listen who has gone thorugh this. Long day of work today and then I'll finally be able to start the process. Wondering if they will be able to give meANY information tomorrow? Take care ladies... (and gents)....",
      "MessageIndex": 20,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805178",
      "Title": "just a shout out to everyone waiting over this long weekend - debmc1958 anastaisa99"
    },
    {
      "AuthorID": "Trisha45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179951/profile",
      "Content": "May 30, 2013 02:55AM Trisha45 wrote: Thanks for listening and for caring, Deb. Today I should be getting my biopsy results, late afternoon. I'm incredibly sore and quite nauseaus. My biopsy was incredibly painful on my left side, not so bad on my right side (even though 2 biopsies were done on the right). I don't know how I'm going to work today, feel overwhelemed and sick to my stomach. I have kind of a physical job (lunchlady at a high school) and all I want to do is lay down. The surgeon told me that I fell into the gray area and he said he would consider this 50/50 (I like the 80/20 better). This has been one of the hardest weeks of my life. I've found my self with many emotions - obviously anxious and scared, but then disappointed with myself for feeling that way when there are so many who are going through so much more. For anyone reading this, know that I'm thinking about all of those who are going through what I am, and more. I have a whole new perspective on breast cancer that I didn't before. Thanks for listening......",
      "MessageIndex": 26,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805178",
      "Title": "just a shout out to everyone waiting over this long weekend - debmc1958 anastaisa99"
    },
    {
      "AuthorID": "Trisha45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179951/profile",
      "Content": "Trisha45 wrote: I had my biopsy today in both breasts, 3 different areas. Iwill be hearing tomorrow the results and am so worried. My doctor told me that his impressions were 50/50 malignant/benign. He was very honest with me and told me I fell into the gray area. I had 3 areas of pleomorphic microcalcifications, bi-rad 4. The biopsy itself was a bit more painful than I expected it, especially on my left side . Anyway, all the best for those of you going through the same thing as me.....as well as any other treatment, diagnossis, testing, etc. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805384",
      "Title": "Had biopsy today... Trisha45 ArizonaGirl1972"
    },
    {
      "AuthorID": "Trisha45",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/179951/profile",
      "Content": "May 30, 2013 05:02AM Trisha45 wrote: Hi Melissa - I will find out my results today, late afternoon, or early tomorrow. I had a horrible night with pain and nausea. Feeling overwhelmed. Thanks for listening......and I really do mean thank you. I truly need to be here with women that have gone through the wait, diagnosis, etc - to have someone know how i'm feeling.",
      "MessageIndex": 3,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/805384",
      "Title": "Had biopsy today... Trisha45 ArizonaGirl1972"
    }
  ]
}