{
  "AuthorID": "triviamom2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87770/profile",
  "Posts": [
    {
      "AuthorID": "triviamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87770/profile",
      "Content": "Aug 10, 2009 05:04PM triviamom2 wrote: My doctor also told me it was found along the chest wall with some microcalcs.  Will an ultrasound be able to tell if it needs to be biopsied with it being where it is?  Thanks!",
      "MessageIndex": 1,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/738718",
      "Title": "7 mm nodule found on mri, now ultrasound... triviamom2 MTwoman"
    },
    {
      "AuthorID": "triviamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87770/profile",
      "Content": "triviamom2 wrote: Hello everyone, I have been lurking for about a week here and want to vent.  Here is my history:  have been going for yearly mammos since I was 30 due to maternal grandmother with bc.  I am now 39 and went last week and microcals were found on my right breast.  My gyn sent me for a  MRI of both breasts and just got a call today that the MRI shows that the breast with the microcalcs is fine, but the other breast has a 7 mm lateral nodule that needs further evaluation with an ultrasound, so that is scheduled for Friday. I am going crazy here!  This waiting is awful, I wish they would just schedule a biopsy so I will know one way or another.  Another thing is that I am so surprised that the breast we were originally worried about is fine and now it is the other one that has the nodule....... Thanks for listening!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/738718",
      "Title": "7 mm nodule found on mri, now ultrasound... triviamom2 MTwoman"
    },
    {
      "AuthorID": "triviamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/87770/profile",
      "Content": "Aug 15, 2009 11:52AM triviamom2 wrote: Well, I had the ultrasound yesterday and the tech and dr used my MRI as a guide to see what the mass was and both decided it was a 7mm lymph node.  The MRI had also said I had enlarged lymph nodes in my armpit, but I guess that they didn't think this was anything significant. My worry is that I hope they didn't miss anything.  She only did the ultrasound on one part of my breast and said that she and the doc said that was 100% the mass they were wanting to loook at.  I am also still worried about the microcalcifications they found in the other breast.  I know I should just quit worrying and celebrate the results, but I still have this feeling.... I go for follow-up in six months for a mammo. ",
      "MessageIndex": 4,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/738718",
      "Title": "7 mm nodule found on mri, now ultrasound... triviamom2 MTwoman"
    }
  ]
}