{
  "AuthorID": "trixiegram",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
  "Posts": [
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "trixiegram wrote: Hi Ladies, I haven't posted in a long time.  But after all the info, help and encouragement I have received from others here on the boards, thought it time I give back in kind.  I go in next week for surgery on my LE arm - torn rotaor cuff and bone spur.  I have put off this surgery because of the LE complications we all fear that could arise from such procedures.   But the pain has now trumped that fear and dictates the surgery.    I'm not posting to garner sympathy - I know there is going to be Boo Coo's of pain involved - been there , done that on my right arm.  But I'm confident I will do ok.  The results have to be better than what I've been enduring up to now!    I actually thought this experience might help others -be it what to expect, what maybe to do or not to do, options, etc...   Anyway, I thought I'd post what happens after I have the surgery and hopefully, some may garner some useful info from all of this. I offer no promises just possible hope.   I also wanted to tell you that I have been using the Flexitouch and between it and wearing my Jovi sleeve 24/7, I have been able to keep my swelling down to a manageble amount. I am only allowed so many PT treatments a year, so the Jovi and Flexitouch have helped my plight tremendously.  Especially since my day sleeve no longer fits right and until I have my surgery and get my arm down to whatever it is going to eventually be, there is no use in trying to get another daytime sleeve.   After reading on here, that Flexitouch was changing the system, I called and asked about the changes.  The one I spoke with, said there are changes in the planning stage but he wasn't sure exactly how they would mesh with the units already out there.  The garment part can be added to as far as extentions or you can replace them all together.   But as for the mechcanical/motor part - he didn't know how or if that would change - as far as being able to use the same garments/and their connecting hoses, on the new version of the Flexitouch.  He said I'd have to call and check back periodically to find out how this is going to end up. Well.  I have the surgery next week and it will take at leastanother week to get thru the worst of the pain, so you probably won't see me post until after then.   Best to You All, Niki Your life can be a parade. Just watch out for the elephants bringing up the rear! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/719850",
      "Title": "Surgery on LE arm & Flexitouch info trixiegram trixiegram"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Aug 29, 2008 08:43AM - edited Aug 29, 2008 08:47AM by trixiegram",
      "MessageIndex": 2,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/719850",
      "Title": "Surgery on LE arm & Flexitouch info trixiegram trixiegram"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "trixiegram wrote: Hi All, I haven't been on much lately but told Binney, that I would post info about another brand of LE sleeve I had been told about where I go for PT. It is called Farrow Wrap. I called and spoke to the a very pleasant lady named Melissa, who is the Director of Information, for their company. I had gone to their website - Farrow Medical.com - it is not best I have been to as far as ease of navigating - and didn't see anything about the sleeve part. But after speaking with Melissa, I was told if you click on the \"How to Measure \" on left, under menu section - then click on \"Farrow Catalog\", under the Video box, it will show pics of the leg, foot and arm compression garments. I looked and it shows one pic of the sleeve but wasn't helpful. All you get is one pic - no real info about the arm sleeve. Melissa told me that while it is a good product, it is hard to put on by yourself - you need someone to help you, in order to get it right tightness uniformly. So that let me know it wasn't something I wanted to pursue. But she told me something I thought might be of interest to some on here, in case you or a loved one had LE in your legs. She said their leg and foot wraps (also velcro fastened ) were extremely good and customer friendly. But what I really found to be great - under their company's Pediatric Section, they will furnish, free of charge ( except for shipping cost ), two leg garments a year, to any child, twelve or under - not just in U.S. - but about anywhere in the world. So if you know of anyone who has a child in need, twelve or under, you might want to check this out. If you want to check this out further - Melissa Adams, can be reached at 877 - 417 - 5187 - ext. 301 . I am not promoting anything - just passing on info. I know nothing about this company or their garments, other than what I read on their website or what Melissa told me. I am online seldom and am still doing a lot of PT - so still won't be on boards much - and not able to keep up on my friends here - but hope all of you are doing well. Niki Your life can be a parade. Just watch out for the elephants bringing up the rear! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/610665",
      "Title": "Another brand of compression sleeve trixiegram trixiegram"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Jul 19, 2006 12:55PM trixiegram wrote:",
      "MessageIndex": 2,
      "PostDate": "19/07/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/372776",
      "Title": "To our resident nurses here trixiegram sccruiser"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "trixiegram wrote: I am going in for surgery next week and have already spoken to my dr. about fact that he can't use my LE arm for blood pressure or IV's, etc... They are operating on other shoulder so are going to use foot to do IV. I had this done when I had second breast surgery, as they blew all the veins in my right arm. Quite frankly, it hurt like hell when they did it. My question is this: Is this common for it to hurt so much or was the guy who did mine, just not very good at it. I so dread it. I know - am being a big baby! But every since the surgery where they gouged me ten times before doing the foot and then all the times I was gouged during chemo and other tests (I have really small and lousy veins), I have developed real aversion to needles. Never used to bother me but really do now. Any suggestions. I know to drink lots of water, eat sodium type meal the nite before, etc... Just looking for something to keep me from freaking so much over the foot IV thing. Again, know I am being a big ole wuss! Go figure, I have faced down snakes and guns but this turns me to jelly, just thinking about it! Niki Your life can be a parade. Just watch out for the elephants bringing up the rear! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/372776",
      "Title": "To our resident nurses here trixiegram sccruiser"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Jul 1, 2008 03:10PM trixiegram wrote: Kari, I have been gone from this board a long time but received an email about you and so here I am.  Sad and angry that this is happening to you.    I can't begin to imagine how hard it must be for you and your family.   You are such a beacon to so many here on this board;  and true to form, you continue to shine -  in spirit, character, strength and grace.   Like so many others here, I too, rail against the injustice of all you have had to endure already - now this!   There aren't enough words to describe how much this all stinks!    You have always been a fighter - my heart wants to believe that you will rally back from this too.  So, I add my prayers to so many others here.    I believe in miracles and Darlin', with so many praying for you, I can see it happening.  You are a force to be reckoned with, so not counting you out.   You and your family are in my prayers. Niki",
      "MessageIndex": 99,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708158",
      "Title": "Very bad report KariLynn roseg"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Jul 20, 2006 07:27AM trixiegram wrote:",
      "MessageIndex": 5,
      "PostDate": "20/07/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/372776",
      "Title": "To our resident nurses here trixiegram sccruiser"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Sep 25, 2007 06:23PM trixiegram wrote: First - Thank you Geeta, for posting the pictures below.  Shelli's spirit and grace always illuminated her beauty from within - and magnified her outward beauty too.  Both show in the pictures you posted.  So does yours. I have been off the boards for a long time now, fighting my own physical demons.  I came back to checkup on friends like Shelli.  The last time I was here, Shelli was joyously getting ready for the family Disney cruise.  I logged on here last night and read she was now gone from us.  It has taken me until now to respond because of the tears and sadness that overtook me.  As I write this, the tears still flow and the sadness hurts my heart - but I had to come back and add my tribute to her and condolences to her family.  Mine will be but a pebble added to the mountain of others already expressed.  Shelli was and always will be, a beacon of light and inspiration to all who knew her - on the boards and in her personal life.  No matter what was going on in her life, no matter what battles she was currently engaged, Shelli always had a kind word for others.  Like Stacey (Sunshine), Shelli cared about others and offerred an ear to your problems, a shoulder or a hug.  I never had the privilege of meeting Shelli in person - a regret and loss on my part.  Goodbye Sweet Shelli.   You will be forever missed and remembered by all who knew and loved you.  The sorrow tempered only by the knowledge you are no longer in pain.  You fought for so long, you deserve a restful peace now.  You are Heavens gain and most certainly everyone else's loss. With Love & Friendship, Niki",
      "MessageIndex": 125,
      "PostDate": "25/09/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/692418",
      "Title": "Shelli is an angel geeta75 Sige"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "trixiegram wrote: Sorry to have taken so long to get back to you on this. This is my second attempt to write this. First one disappeared when I tried to post it AAAARRRRGH! Hopefully I will remember to copy it before I try to post it this time. Anyway, here goes. Please remember, everyone has different results with meds, treatments, etc... This is just how my experience has been, thus far. There are pros and cons. Cons & tips: I compare it to wresling, one - handed, a toothless alligator and then wearing a tight fitting coat indoors. Slippery and frustrating to get on and hot to wear. It isn't anywhere as easy as implied in their video, to get on by yourself. Heck - even with Tommie's help, it was a struggle. but after awhile, I have learned ins and outs and though still a struggle, I can get it on by myself. It is hot - maybe just because I still have hot flashes but I think it is partly because of both. Because of difficulty in getting into it and the duration time of using it - I suggest you do anything such as, letting dogs in and out or going to bathroom, before donning the sleeve and stomach vest. The stimulation you feel from the pumps inflating and deflating, will make your bladder cry for relief. Take it from me, it is a bummer having to unhook and wiggle out of and then back into everything again. Plus, although it has a \"pause\" button, it is only good for a short time before you have to start all over again. Not enough time to go, and get back into everything again before your time runs out. You will want to have your pillows arranged, a phone within easy reach, any remotes, etc.... Once you lay down, that's it. If you are lucky, nothing pops loose when you lay down. Also, you will want to have the hoses already connected before putting on the garments - ten hands would be wonderful - only one hand is a real bear! I also turn the \"on\" button in the back too before laying down. Hard to reach otherwise. There is a \"cleansing \" cycle which takes a over an hour. Since my arm is swollen and I can't do regular massage - I also use second cycle, which works mostly on my arm drainage - it also takes over an hour. All in all - about two and a half hours actual massage/drainage time spent in garments. That doesn't count getting into the thing. I have learned to ignore the doorbell when hooked up. After going thru both cycles and taking off the garments, my arm is smaller. But there are lumpy places. I spoke to my LE therapist. She said this is because the fluid is drained off more than regular massage would do in one session and the lumpy parts are where the proteins have built up. I didn't see that part when doing regular massage because the overall lessening of swelling, was more gradual. She showed me how to massage the lumpy parts down. The fluid returns in the course of the day, as it did after doing regular massage. But hopefully, the Flexitouch will eventually acheive the same result as the regular massage did, over time and the swelling will go away and I can just worry about maintaining. My arm is better. Pros: It is so relaxing, I always fall asleep unless I am watching TV. Tried reading but always fall alseep and usually drop the book and can't reach it. It doesn't hurt in anyway - just so you know. As with everything else in dealing with BC or LE - nothing easy. It is a royal pain in the arse - the time and effort one has to use in wrapping, massage, etc.... It is an unwanted intrusion in my life. But the alternatives are worse, so I do it - we all do. This one is best alternative for me - at least for now. With neropathy in both hands and still having weak right arm from torn rotator cuff - not much choice. Will probably keep using it after right arm healed. Hope to reduce swelling and be able to maintain with the Flexitouch. Will try and keep you updated as time and I progress. As I said, everyone is different. I remember reading where some said this didn't work for them. Hope I have given info that will help. Feel free to ask questions. I don't go on boards as often as I once did but I try and check here at least once a week. I lurk more than post but will be glad to answer any thing I can. Alligator Wrester Champion! Niki Your life can be a parade. Just watch out for the elephants bringing up the rear! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/10/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/452869",
      "Title": "Newest Report on Flexitouch trixiegram txred9876"
    },
    {
      "AuthorID": "trixiegram",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/3016/profile",
      "Content": "Jul 5, 2008 07:47AM trixiegram wrote: Never is the horror of this disease more pronounced than when another is taken.    My heart goes out to Kari's family, as I keep her and them in my prayers.    May you find solace in the knowledge she was so loved by so many.  Kari, you are missed already.  But never forgotten. Niki ",
      "MessageIndex": 126,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708474",
      "Title": "Kari is our latest Angel djd Rocktobermom"
    }
  ]
}