{
  "AuthorID": "troyryans",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
  "Posts": [
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "Jun 18, 2017 11:27PM troyryans wrote: Jumping in a bit late, hoping everyone is recovering well from surgery. I had BMX on May 11 with expanders and nipple sparing. IDC 2cm 0/6 nodes, ADH LH, CHEK2+, ER/PR+, HER2-. Recovery has gone ok, now 5 weeks out, except for tearing tendon stitches on right side which has hindered movement on that side. Still unable to sleep in a bed, having to resort to a chair and ottoman. Still burning sensation on upper chest, most nights I have an ice pack on for a bit. Have any of you returned to work?? I have to report back tomorrow and that includes driving to and from the office. Employer is not too forgiving to be off any longer after 5 weeks (FMLA does not apply-under 50 employees), and I still need at least one more surgery this year. Praying I can get through this week",
      "MessageIndex": 340,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "Jun 20, 2017 09:08AM troyryans wrote: MamaOz, the FMLA only applies to companies with over 50 employees, we have less than 10. My employer could let me go with no reason during the medical leave and cancel the insurance, which would leave me high and dry. So, I am at his mercy for the most part. My surgery was on May 11th, and he wanted me back by May 30th - I know, difficult to believe. To get five weeks off was a gift, let me tell you. I don't even know how I will get the time off for reconstruction, but will cross that bridge when I get there. It was difficult to work the day. Painful to drive 30 minutes, even with a pillow. The motion of moving my neck and where I held my hands on the steering wheel put a lot of strain on my upper chest - you really don't think about the muscles you need to drive with until after surgery, let me tell you. Sitting at my desk and working on the computer was ok, but found by 3p that I was hitting the wall. Went home and promptly fell asleep (which explains my very early morning post). Besides the physical side, I found mentally I am just not there....the work didn't interest me at all and I could feel the stress climbing up just like I had before I left for surgery. I believe I have some deep thinking to do for the next steps in my career and moving forward. I pretty much knew this before the surgery, but needed to focus on the health aspect first. Thanks for the response - I will tell everyone to NOT rush going back to work. My situation is different in that I am concerned I could lose my job if not there, but if you have the opportunity to stay at home and recuperate, do it as long as you can. Kathy",
      "MessageIndex": 353,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/854047",
      "Title": "May 2017 Surgery Group DizzyGirl MamaOz"
    },
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "Dec 28, 2017 11:30PM troyryans wrote: Jumping back into this message thread as a follow up....invasive ductal carcinoma was confirmed and I had both breasts removed in early May, with nipple sparing. Six nodes were taken, all negative. However, I did test positive for the CHEK2 genetic marker. Oncotype results came back at 18, and a decision was made to bypass chemo (would reduce recurrence rate by 1%) and move straight to Letrozole for 10 years. I did develop a slight case of lymphedema in the right arm, which was caught early at physical therapy as I worked to regain full use of my arms. Reconstruction was in October, and I am now recovering from that. Insomnia appears to be a side effect of late, hence the reason for being up so late/early. Progressing nicely, but the Letrozole is kicking my butt - the muscle aches and pains are horrible. I don't want to go off the med - not sure how to stop feeling like I am 100 years old at this point. Working now on diet and healthy living, it is one day at a time. I'm hoping this finds all of you doing well and on the road to recovery.",
      "MessageIndex": 6,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853484",
      "Title": "Waiting for Results....Again troyryans troyryans"
    },
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "Mar 17, 2017 02:14PM troyryans wrote: Thank you MTwoman and wallan. Unfortunately I received news yesterday afternoon that BC is confirmed. I am awaiting the pathology reports, and have an appointment with the breast surgeon at 6:30a Monday to discuss next steps. My head is spinning a bit, but truly had a sense last week that I would hear the same diagnosis. Will use the Community boards this weekend to gather information and of course great support. One day at a time.",
      "MessageIndex": 3,
      "PostDate": "17/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853484",
      "Title": "Waiting for Results....Again troyryans troyryans"
    },
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "troyryans wrote: Jumping back into the Community after being off for almost 7years. I am now awaiting results for a core biopsy on the right breast after having relatively clean reports for quite some time. Bit of history - I was diagnosed with ADH in my right breast in 2006, had two surgical biopsies to remove microcalcifications, and a third surgery on the left to remove a fibroadenoma. I have had DNA testing (negative) but was told by geneticist that he felt our family carried a strain of cancer as of yet unidentified. All of my family members who have passed have done so because of cancer. My grandmother, her sister, my aunt and a cousin have all had breast cancer, all diagnosed between the age of 35-50. I took Tamoxifen for 3 years of the 5 year cycle, and had a complete hysterectomy in 2007 to prevent estrogen production. A month ago I noticed two small indentations on the right breast when I would lift my arm. A mammogram, ultrasound, and core biopsy later I am again in a waiting position for results. This feels different than all the rest, for some reason. The biopsy was extremely painful, which is unusual for me, to the point of me coming off the table, and the indentations have me worried. I should have results tomorrow or Monday, and I know I will face head on what may be in front of me. Just wanted to reach out, put myself back on the boards and touch base with people. Praying for all who are on the boards and suffering through this nasty disease. Kath Kathy :) Dx 3/16/2017, IDC, Right, 2cm, Stage IB, Grade 1, 0/6 nodes, ER+/PR+, HER2- Surgery 5/10/2017 Lymph node removal: Right; Mastectomy: Left, Right; Reconstruction (left): Nipple reconstruction, Silicone implant, Tissue expander placement; Reconstruction (right): Fat grafting, Nipple reconstruction, Silicone implant, Tissue expander placement Hormonal Therapy 6/23/2017 Femara (letrozole) Hormonal Therapy Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853484",
      "Title": "Waiting for Results....Again troyryans troyryans"
    },
    {
      "AuthorID": "troyryans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/98671/profile",
      "Content": "Mar 10, 2010 09:11PM troyryans wrote: Just jumping in a bit late on this trail, but wanted to touch on the SE of tamoxifen from my personal experience...first off, I was diagnosed in 2004 with ADH in my right breast, have a very strong family history of BC, have a lifetime risk factor of 28%, am BRCA 1/2 negative, have MRIs and mammograms alternating every six months, had a preventative TAH/BSO hysterectomy in 2007, and was on tamoxifen for three years prior to my hysterectomy. It was only after my body stopped producing the boatloads of estrogen I was so richly blessed with that I was able to come off tamox. For me the initial SE were leg cramps at bedtime, night sweats and hot flashes. After approximately 4-6 months the leg cramps subsided, followed by the night sweats. The hot flashes continued throughout the three years, but gradually decreased to the point I barely noticed them unless I was in a stressful situation. I did not gain weight while on tamoxifen, as a matter of fact, I lost weight. Since 2004 I have had numerous biopsies and a total of three surgeries. Both my breasts are scarred, but still intact. Unfortunately after my MRI a day ago I got the dreaded phone call from my BS that there is \"something suspicious\" going on, so I am now scheduled for a mammogram, followed by an ultrasound and biopsy this coming Monday morning. They are moving fast, which I am grateful for. Although I have been through this a number of times, I still hold my breathe. Anyway, taking tamoxifen is a personal decision for high-risk patients, IMHO. As leaf indicates, you can stop taking them if you don't like them. Please remember that the key to everything is being extremely diligent by doing self-exams, being aware of your body and listening to it, not missing appointments and check-ups, and being routinely tested on a regular basis. While the ADH was detected through a stereotactic core biopsy, my lumps were detected by self-exams every single time, including one that I did just one month after a routine mammo that never picked anything up. Proactive is the word.",
      "MessageIndex": 3,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/748410",
      "Title": "atypical lobular hyperplasia-tamoxifen Myshell vmudrow"
    }
  ]
}