{
  "AuthorID": "tshire",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
  "Posts": [
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: Hi Ladies, Looking for some advice. I am 31 (32 in September) and was diagnosed with IDC in June after I found the lump myself with a self exam. Ultrasound biopsy confirmed with a 1 cm estimate, MRI confirmed 1.3 cm, with no other activity in either breast. I had a lumpectomy in July, but that left behind some intermediate grade DCIS in one margin and I had a re-excision 2 weeks later (Monday 7/27) with completely clear margins. (Tangential, but in my original path report the pathologist measured my tumor as 2.6 cm. My surgeon didn't seem to think this was suspicious, but I did because the imaging was apparently so far off. So I pestered my exasperated surgeon into calling the lab to double check, and she did even while telling me I was being paranoid. Guess what? I was right. The MRI was exactly correct at 1.3 cm). So I had the Oncotype test done- I got 20. 13% distant recurrence risk with Tamoxifen only. I can't tell very much from the graph on the second page, but it looks like I have around a 4% risk reduction with chemo. Is it worth it? Here are my stats: -3 sentinal nodes negative -1.3 cm tumor -no LVI -Grade 1 (tubule 2, nuclear 2, mitosis 1) -98% ER + / 83% PR + / HER2- (all confirmed as strong on Oncotype) -no necrosis -Ki67 34% (biopsy) -tested negative for all breast cancer genes that Ambry Breast Next panel tests for: http://www.ambrygen.com/tests/breastnext -paternal grandmother died of metastatic breast cancer, dx age 69 (she is the only 1 family member with any type of cancer in 4 generations of either side of my family) I know there's no crystal ball, and I do plan to get many opinions, and go to MD Anderson to review my pathology and get a consult. But any advice from women who have made this difficult choice would be appreciated. Thanks, Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 3, 2015 10:20AM tshire wrote: Yes, I am negative for all the breast cancer genes I was tested for. I had the Oncotype test done- I got 20. 13% distant recurrence risk with 5 years of Tamoxifen only. The 4% is the possible benefit of chemo, lowering my overall risk to around 9%. At least that's what I interpret from the graph. I have yet to be able to get my MO to call me back to make an appointment to talk about it. I'm also still waiting on the Mammaprint test.",
      "MessageIndex": 12,
      "PostDate": "03/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 14, 2015 10:28AM - edited Aug 14, 2015 12:30PM by tshire My ongoing cancer drama continues: I went to see MO #2 yesterday who could not explain the discrepancy between my high Ki67 and low mitosis rate at all. She said she'd never seen a high Ki67 with a mitotic index 1, grade 1 tumor before. She said she had no idea why this was happening, except that she was glad that MD Anderson is re-doing my pathology. She did say that theoretically/ideally the Oncotype would also be taking any tumor-suppressing genes into account when coming up with the score. One interesting thing to come out of yesterday's meeting with her is that she does not agree with MO #1 about doubling my risk based on age. She said that is an \"old\" way of thinking not based on data, and that she knows MO #1, that they trained together at MD Anderson, and knows she likes to treat very aggressively. She actually called the pathologist from Oncotype/Genomic Health and discussed that with him in front of me, and he agreed that doubling the risk is unnecessary, and not based on any data he is aware of. He did point out that 70% of the women in the Oncotype studies were postmenopausal, and the 30% premenopausal tended to skew towards higher Oncotypes, but it wasn't statistically significant. She said she believes my absolute benefit is about 3% from chemotherapy, but that it is not statistically significant enough to offer any definite recommendations. She said any statistics we could look at would be colored by the fact that my particular case is unlike 99% of the women studied. I asked her on a scale of 1-10 (10 being DEF CHEMO) what I would be, and she said a 6. She said this particular course of chemo would have no long term side effects and relatively tolerable short term side effects. So technically the small benefit of chemo might outweigh the even smaller risk of chemo. She said it's a personal decision for me to make. I'm just like, what the hell? You're the doctor! I didn't go to medical school and I'm the one to have to make decisions about whether to put poison in my body or not?! All of these statistics are hard for me to swallow considering according to the Gail Model I had a .28% risk of getting BC between the ages of 35-40. :/ Finally she said I should wait for Mammaprint and the pathology re-do and come talk to her again before we make any decisions. And then she said if I'm going to do chemo I need to start by the first or second week of September. :( She also suggested that MD Anderson might want to \"study\" me. That sounds like something I'd rather not do.",
      "MessageIndex": 36,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 5, 2015 02:58PM tshire wrote: So I talked to the breast cancer specializing MO yesterday with my mom and fiance (did I mention I am getting married in March? I was diagnosed 5 months after getting engaged). She said in her opinion I should do 4 rounds of TC, almost solely because of my age (and a little because of my Oncotype score being intermediate/the Ki67). She said that all my cancer characteristics are favorable- for a 60 year old. She said a 31 year old woman needs to double her risk factor, so instead of a 13% risk of recurrence that Oncotype calculated for me, it's closer to a 26% recurrence without chemotherapy. She thinks I'd get closer to a 10% benefit from chemo instead of 4-5%. However, she says my case is unusual and rare enough (for my age) to present to a \"Tumor Board\"- a consortium of oncologists who will meet to particularly discuss my case and opinions on my treatment. This will be sometime next week. One odd thing she said is that she would not recommend ovarian suppression +AI for me- she said the SOFT trial showed that this only benefited young women in later stages (II+) of BC. I just read the entire study publication and I don't see that indication anywhere. She \"only\" recommended 5 years of Tamoxifen + 4 rounds of TC chemo and rads for me. She scared me sufficiently though that I'm probably doing to follow through with chemo if the other MOs agree. I'm going to try cold caps- I love my red hair, it's actually a major part of me, and I would be so devastated to be bald or need a wig at my wedding. She even told me it might not grow back red but brown!! I know that's just vanity but it's so sad for me to think about. The one day of my life I should feel the most beautiful. I'm scared of the other side effects too- losing my nails, feeling sick all the time, neuropathy, and oh yeah the 1% risk of leukemia!!! Oh Lord, show me the way.",
      "MessageIndex": 19,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 6, 2015 02:52PM tshire wrote: Annie, unfortunately no, my insurance does not cover fertility preservation. I am currently applying with LiveStrong and another local program for help with the costs. The \"nice\" thing about Triple Neg BC is that it is not affected by hormones, so unless chemo destroyed her ovaries she would not need to worry about embryo preservation. I am VERY hormone sensitive so I'm going to have to wait at least until I am at least 37 (5 years of hormonal treatments) before I can even think about becoming pregnant. And my preservation treatment is slightly risky, since I will be receiving fertility drugs- the doctor has to be very careful in dosage and will need to monitor my estrogen levels closely and quickly bring them down with Femara after harvesting (aka yet another surgery). My poor arm is already all bruised up from all the needle sticks since they can't use the other due to risk of LE. All this in the next few weeks!! I am so scared. I thought the fear would get better but it's just a different kind now. Englishmummy... re: Mammaprint-oh God I have no idea. I am really hoping MD Anderson can help me make a good decision if that happens. That would just be the crap icing on the shit cake, pardon my language. I'm meeting with another MO next week who is affiliated with a different treatment center \"chain\" to get her opinion as well. I want to get at least 3 opinions, plus the tumor board input. 39, can you send me the studies you've found with age as an independent prognostic factor? I'd really appreciate seeing them. I'd like to show them to my family. They are against me doing chemo. I sent my mom the SOFT trial publication and she immediately quoted from the study \"Most recurrences occurred in patients who had received prior chemotherapy\" which implies that she thinks chemo might CAUSE recurrence. She really doesn't think chemo affects grade 1 cancers, and would be more toxic than beneficial to me. (She is a very smart OR nurse with extensive medical knowledge, so I value her opinion, but she's not an oncologist). My dad is vehemently against me getting any treatments at all beyond surgery, and thinks a macrobiotic diet will cure me (no). I know both will support my choice if it is chemo eventually because they love me. It just makes this decision harder because I feel like I'd be scaring/disappointing them. If I was Oncotype under 15, with a much lower Ki67 score, I'd definitely be in the no chemo camp. But the high Ki67 is the most disturbing part to me. MO #1 said 90% of women have a Ki67 under 10% (seems like a strange claim, maybe she meant 90% of ER+? or grade 1?) She also said most women with a mitotic index of 1 have no mitotic features seen, I had <5 seen on biopsy and <1 seen on surgical specimen. Still considered grade 1 both times. But she said that's a sign of proliferation. Of course, now I have had some lower back pain on my right side for the past 3 days or so and I am freaking out about mets. I guess if it's still there at my next MO #2 appointment next week I will ask about it. I was never offered any body or bone scans. It's definitely a new thing, I've never really experienced back pain before. My legs and gluts are also sore though, so that makes me feel better. I've been working out like a fiend trying to punch this monster in the face.",
      "MessageIndex": 33,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 3, 2015 08:59AM tshire wrote: oneday, what was your chemo experience like? I'd probably have the same regimen if I go that way. ",
      "MessageIndex": 9,
      "PostDate": "03/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 5, 2015 10:42PM tshire wrote: 39, Thanks for your prayers. I need them right now. Luckily, the wedding is pretty much already planned (I am innately Type A). Unluckily, we have already put down $10,000 in deposits for it, so the date can't be delayed. :/ The fertility thing is so damn hard. I sort of wonder if I should even pass down my genes if they gave me cancer at 31. They suck PS I've enjoyed your blog immensely. I think we'd be friends even without craptacular cancers. ",
      "MessageIndex": 23,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 31, 2015 01:45PM tshire wrote: Thanks 39. If you don't mind me asking, what was your Ocncotype and Ki67 score?",
      "MessageIndex": 2,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: Hi Ladies, Looking for some advice. I am 31 (32 in September) and was diagnosed with IDC in June after I found the lump myself with a self exam. Ultrasound biopsy confirmed with a 1 cm estimate, MRI confirmed 1.3 cm, with no other activity in either breast. I had a lumpectomy in July, but that left behind some intermediate grade DCIS in one margin and I had a re-excision 2 weeks later (Monday 7/27) with completely clear margins. (Tangential, but in my original path report the pathologist measured my tumor as 2.6 cm. My surgeon didn't seem to think this was suspicious, but I did because the imaging was apparently so far off. So I pestered my exasperated surgeon into calling the lab to double check, and she did even while telling me I was being paranoid. Guess what? I was right. The MRI was exactly correct at 1.3 cm). So I had the Oncotype test done- I got 20. 13% distant recurrence risk with Tamoxifen only. I can't tell very much from the graph on the second page, but it looks like I have around a 4% risk reduction with chemo. Is it worth it? Here are my stats: -3 sentinal nodes negative -1.3 cm tumor -no LVI -Grade 1 (tubule 2, nuclear 2, mitosis 1) -98% ER + / 83% PR + / HER2- (all confirmed as strong on Oncotype) -no necrosis -Ki67 34% (biopsy) -tested negative for all breast cancer genes that Ambry Breast Next panel tests for: http://www.ambrygen.com/tests/breastnext -paternal grandmother died of metastatic breast cancer, dx age 69 (she is the only 1 family member with any type of cancer in 4 generations of either side of my family) I know there's no crystal ball, and I do plan to get many opinions, and go to MD Anderson to review my pathology and get a consult. But any advice from women who have made this difficult choice would be appreciated. Thanks, Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 14, 2015 01:35PM - edited Aug 14, 2015 02:23PM by tshire Well, surgeon just called- Mammaprint came back high risk. 22% of distant recurrence with no therapy. Luminal B. I guess that clinches it. Damn. I'm having a hard time right now.",
      "MessageIndex": 39,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 29, 2015 01:16PM - edited Jun 29, 2015 01:17PM by tshire I've had lifelong asthma. It mostly flares up whenever I have a cold or flu; I don't take the inhaler that often. I have a lumpectomy/SNB scheduled for July 13th. There are so many \"what ifs\" I just want to have all the information from final pathology to decide on treatment. I am reserving the possibility of mastectomy instead of radiation after I have all the facts- I just want to be sure my nodes are clear, because if they're not I'll need radiation anyway and I'd rather not irradiate my chest wall if avoidable. But I am open to conserving my breast with radiation too, my doctors all insist it's so very safe. No one mentioned my ticking the \"asthma\" box on the form with \"other medical conditions.\" Reading this thread scares me, my lungs are already fragile.",
      "MessageIndex": 16,
      "PostDate": "29/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/832938",
      "Title": "Lung damage nearly 3 years after radiation finished? Lily55 Martini"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 19, 2015 04:27PM tshire wrote: I think I am leaning toward implants right now because I want to avoid as many complications as possible. Grammakathy, if you don't mind me asking, why did you need 3 separate surgeries for implants?",
      "MessageIndex": 4,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 21, 2015 08:38PM tshire wrote: I am now considering just a single mastectomy, pending results from a breast MRI I'll have on Tuesday. If there's DCIS or any other issues lurking in the other breast, I'll take that one off too. i see what you mean about dealing with it incrementally. I'm really scared of just a lumpectomy. I also really don't want to have to do radiation. But if it's in my nodes, you're right, I'll have to do it anyway.",
      "MessageIndex": 16,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I am trying to figure out what I want to do. I just met with my breast surgeon yesterday. I am 31 years old and this is my first (and prayers to God) only battle with BC. My first inclination is to get a double mastectomy with reconstruction. My surgeon said she supported my decision. I know the survival rates are the same, but the recurrence rates are less. I know not THAT much less, but the type of cancer I have (grade 1, mitotic rate 1) I probably wouldn't respond to chemo or radiation as well and I'm worried about what else might be left in there if we don't take everything. And honestly, even if I had a lumpectomy I would still be disfigured and need reconstruction because of how close the tumor is to my nipple. I know with a lumpectomy I would spend the rest of my life worrying too, because I have an anxious personality and a cancer that is so slow and hard to kill (?). So basically I am wondering what kind of surgery to have. What are your experiences with the different BMX experiences? I know I want to do some kind of reconstruction. Did you do implants? What kind? How did that go? Did you do the surgery where they remove abdominal fat? How did that go? Do you regret your decisions at all? Were there lymphedema complications, even if they didn't take many nodes? I know that's a lot of questions. I haven't been able to find a plastic surgeon yet who will take my insurance and my surgeon says I need to make a decision in the next week. Thanks, Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 19, 2015 05:38PM tshire wrote: Thanks Elaine. My breast surgeon did say I would lose the nipple with lumpectomy. My tumor is practically in my areola. It's a hard decision, believe me. Everyone keeps telling me it's nice to \"have options.\" That's true I guess...",
      "MessageIndex": 6,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 19, 2015 07:07PM tshire wrote: Did anyone have issues with lymphedema after mastectomy, even if they only took out the standard 1-3 nodes?",
      "MessageIndex": 9,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/832716",
      "Title": "difficult decisions- types of BMX surgery, experiences tshire MsVeryDenseBreasts"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 14, 2015 12:50PM - edited Aug 14, 2015 12:51PM by tshire Hi Marie, I did have an initial scare- the lab measured my tumor after surgery and told me I was Stage 2a, instead of Stage 1a as had been measured on ultrasound and MRI. I begged my surgeon to ask them to double check, she did to \"humor me,\" and they had made a mistake! They accidentally measured the entire specimen, not just the tumor. Turns out the MRI was exactly correct- the tumor was 1.3! (Moral of the story- if something seems wonky, get them to double check, even if they act like you are crazy). The only other surprise was that I had some associated DCIS, which my surgeon said was focal to the tumor and very common. So I had to do a re-excision but that took care of it. All other pathology was the same as biopsy.",
      "MessageIndex": 19,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/834073",
      "Title": "I am panicking! Changes in diagnosis?? MarieTherese BarredOwl"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 26, 2015 05:13PM - edited Aug 26, 2015 05:21PM by tshire I guess I don't understand. Why would I do a treatment when the risks outweigh the benefits, statistically? The risk of leukemia is 1%, and cardiac toxicity depends on the dose but is usually cited as 2-5%. If I'm getting <1-1% benefit from doing that regimen, how is that beneficial? I don't want to die of BC but I don't want to die of late onset leukemia or have a heart attack at 45 like my grandfather did either! Even if my heart is healthy now, the damage is cumulative and long lasting. Especially since I'm also doing rads. One thing I took from that meeting was that I was on the fence about doing chemo at all, and he convinced me to at least go with MO#1's recommendation. But he directly told me I am not a \"high risk\" patient! In fact both MO #1 and #2 told me they would not even consider recommending AC for me... and they both did their fellowship at MD Anderson! Confusing!",
      "MessageIndex": 8,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 10:04PM tshire wrote: It's not just because I don't feel like doing more chemo or I'm being a wuss. I have serious concerns about the additional toxicity and long-term effects of this regimen, especially to my heart. From the study SpecialK posted: \"At a median of 7 years follow-up, the difference in DFS between TC and AC was significant (81% TC v 75% AC; P = .033; hazard ratio [HR], 0.74; 95% CI 0.56 to 0.98) as was OS (87% TC v 82% AC; P = .032; HR, 0.69; 95% CI, 0.50 to 0.97). TC was superior in older patients as well as younger patients.\" \"There were three late deaths without relapse, probably related to treatment, and all occurred in the AC group: a 45-year-old woman died of cardiomyopathy and congestive heart failure, and two older women died of complications related to myelodysplasia and myelofibrosis, respectively. One more patient died of acute leukemia 10 years after AC.\" Another discussion of this is here: http://www.breastcancerdeadline2020.org/breast-can... So far, everyone who has responded has had a higher grade, or node involvement, or later stage, or a bigger tumor than I had. Like I said, if I had any of these high-risk characteristics, I would probably agree that the benefits outweighed the risks. But I don't and I don't believe they're worth the major potential health risks for the max 1% advantage I was quoted. This is one decision I'm not agonizing over.",
      "MessageIndex": 23,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 14, 2015 12:49PM tshire wrote: Hi Cinderella, yes very helpful, thank you! Do you know what the risk from MDS is with the TC regimen? This seems to indicate that Cytoxan is one of the worst for leukemias: http://www.cancer.org/acs/groups/cid/documents/web... Also, does radiation after lumpectomy reach the bone marrow? I was told that rads after lumpectomy on my right side would only hit the breast, no vital organs. I didn't think to ask about bones!",
      "MessageIndex": 32,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 26, 2015 08:33PM tshire wrote: Thanks for the study link SpecialK! Good information! YoungTurk, MO#1 did mention that Oncotype didn't use many young women in its study population and therefore I should be wary of its reports (she did say there were SOME, just not as many). She is the one who recommended TC. I understand that I will need to do something about the estrogen- I plan to be on hormonal therapy for 10 years, either 10 years of Tamoxifen or 5 Tamoxifen/5 OS + AI. It's probably too early to consider ovary removal. I froze embryos earlier this week and I'd like to get pregnant in 5 years after treatment, hopefully.",
      "MessageIndex": 15,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 1, 2015 10:08PM - edited Sep 1, 2015 10:14PM by tshire Grey, if you're worried about AC have you considered trying TC instead? Or even CMF? It would be better than nothing, and the regimen would be shorter on TC or the side effects \"softer\" on the CMF. You don't lose your hair on CMF. And if you cold cap most women have good success keeping their hair on TC. You should probably do some type of chemo since you are Luminal B, grade 2, stage 2, and node positive.",
      "MessageIndex": 26,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: Hi all, I am 31, ER 98%+ PR 83%+ HER2-. Stage 1A grade 1 (confirmed by 3 pathologists). Completely negative nodes. Clear margins. No LVI. No genetic mutations. Tumor was 1.3cm. Oncotype 20, \"High Risk\" Luminal B on Mammaprint (but on cusp of \"high risk\" scale). After getting 2 opinions from oncologists here in Austin (#1- definitely do 4 rounds of TC, #2- maybe do 4 rounds of TC, comfortable with only HT), I went to MD Anderson for my last opinion. I was told that because I am young and healthy I should do DOSE DENSE AC+T!!! I couldn't believe it. That's what you give to Stage 3+, triple negative, or inflammatory breast cancer! I asked him what my total benefit from chemo would be. He said between 3-5%. I said what would the total benefit of AC+T vs. TC be? He said <1-1%. Are you kidding?! The risk of leukemia from that regimen is 1%! The risk of cardiac toxicity is at least that as well! And while I don't have a strong family history for cancer, I DO have a strong family history for heart disease! I refused and told him I would agree to do the TC but not the DD AC+T. He said that would be fine. He also said he would NOT recommend for me to start ovarian suppression after chemo, in direct contrast to the SOFT trial results, because THAT would be too hard on my body. (???) It is upsetting because MD Anderson is supposed to be one of the leading cancer centers in the country. I was warned that they like to be aggressive but I had no idea HOW aggressive. Giving me DD AC+T just seems nuts to me. It makes me think they don't care if you drop dead of the side effects as long as you don't die of the original cancer and can be counted as a \"success\" in their survival statistics. Does anyone else think this is totally crazy?? Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 26, 2015 03:54PM tshire wrote: Leigh, did they give you benefit stats in %, like they did for me? Would you have done the DD AC+T for a 1% benefit?",
      "MessageIndex": 2,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 26, 2015 05:41PM - edited Aug 26, 2015 05:44PM by tshire Yes, with positive nodes, later stage, bigger tumor, LVI, and/or grade 3 I'd probably want to hit hard too and take my chances with the side effects. In that case the benefits would certainly outweigh the risks. But clinically I'm about as low risk as they come and I will do some chemo and HT to get that risk down further. On the flip side of the coin, I also have much longer to reap the negative side effects. Apparently sometimes congestive heart failure after AC+T doesn't appear for 20-30 years after treatment! Leukemia can take 1-5 years. YoungTurk, the lifemath tool showed that I have a 6.1% risk of death after 15 years with no adjuvant therapy at all. With Tamoxifen, it drops to 4.1%. With Tamoxifen and CMF, it drops to 2.9%. There is no option for TCx4 as far as I can tell, but I'm told it's in between CMF and AC+T in intensity and effectiveness. Dose dense AC+T drops that down to 1.9%. Like he said, probably a <1%-1% difference. I'm not sure how accurate this is in gauging risk since it does not factor in the genetics from Oncotype, but it does show how the risk would drop relatively well and aligns with what he told me. I'm strongly ER/PR+ and he told me I could expect a good response from the HT. I'd be interested to find anyone with a very similar diagnosis to me and see what they decided....",
      "MessageIndex": 10,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 2, 2015 01:13AM - edited Sep 2, 2015 01:17AM by tshire Did you get the Mammaprint test that told you Luminal A? If not you are most likely Luminal B, because Luminal A almost always has high PR+. Being PR- or weak PR is a bad prognostic factor and usually indicates Luminal B. Remember that you are the one in the drivers seat. Iits your body and life. If you feel that strongly about not doing AC and your MO won't listen find another one who will. Thanks for the hair compliment! I will be cold capping so I can keep my hair hopefully for my wedding in March",
      "MessageIndex": 27,
      "PostDate": "02/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 19, 2016 06:22PM tshire wrote: Gotta say, this study really reassured me in my decision to do TC for ER+, node neg BC: www.breastcancer.org/research-...",
      "MessageIndex": 34,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Dec 15, 2015 04:56PM tshire wrote: I'm in- simulation this Friday and rads start sometime after Christmas, date TBD",
      "MessageIndex": 211,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 7, 2016 03:57AM tshire wrote: Thanks! Glad it's not me being crazy or something bad going on. They're not often but I was hoping I'd have a little more time before side effects kicked in! So far the breast itself looks normal though.",
      "MessageIndex": 435,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Dec 26, 2015 05:04PM tshire wrote: First treatment 12/30, 33 treatments should be over on Feb. 15th!",
      "MessageIndex": 289,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 8, 2016 03:05AM tshire wrote: I'm using Miaderm as well. So far so good, but I can't stand the smell! I don't know why but it bugs me so much. So I trade that off with Aloe Moisturizing Gel from Trader Joe's, which I love. Marijen, I hadn't heard of bone cancer, but I did know about the small risk of a sarcoma. Bone cancer was never mentioned, probably because in my case they're only radiating soft breast tissue. My RO explained that the <1% risk of a sarcoma was very worth it weighed against the much higher risk of a BC recurrence. Everything in this \"journey\" is a risk-benefit balance.",
      "MessageIndex": 451,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Mar 28, 2017 08:58PM tshire wrote: Hi butterfly- I read it, what was the major takeaway you got? I was in the same boat with low clinical/high genomic risk. My takeaway was that the discordant groups had approximately the same level of risk, better than high/high but worse than low/low.",
      "MessageIndex": 63,
      "PostDate": "28/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 1, 2017 03:05PM tshire wrote: Hi Luv, I had a very similar case to yours, except for the age difference. I ended up doing 4 rounds of Taxotere/Cytoxan and found it very tolerable. I cold capped and kept about 80% of my hair. It's a hard decision, especially for those of us who chemo would only help 1-2 percentage points. But for how tolerable it was for those percentage points I still think doing chemo was worth it. I have no regrets.",
      "MessageIndex": 78,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: Hi all, I am 31, ER 98%+ PR 83%+ HER2-. Stage 1A grade 1 (confirmed by 3 pathologists). Completely negative nodes. Clear margins. No LVI. No genetic mutations. Tumor was 1.3cm. Oncotype 20, \"High Risk\" Luminal B on Mammaprint (but on cusp of \"high risk\" scale). After getting 2 opinions from oncologists here in Austin (#1- definitely do 4 rounds of TC, #2- maybe do 4 rounds of TC, comfortable with only HT), I went to MD Anderson for my last opinion. I was told that because I am young and healthy I should do DOSE DENSE AC+T!!! I couldn't believe it. That's what you give to Stage 3+, triple negative, or inflammatory breast cancer! I asked him what my total benefit from chemo would be. He said between 3-5%. I said what would the total benefit of AC+T vs. TC be? He said <1-1%. Are you kidding?! The risk of leukemia from that regimen is 1%! The risk of cardiac toxicity is at least that as well! And while I don't have a strong family history for cancer, I DO have a strong family history for heart disease! I refused and told him I would agree to do the TC but not the DD AC+T. He said that would be fine. He also said he would NOT recommend for me to start ovarian suppression after chemo, in direct contrast to the SOFT trial results, because THAT would be too hard on my body. (???) It is upsetting because MD Anderson is supposed to be one of the leading cancer centers in the country. I was warned that they like to be aggressive but I had no idea HOW aggressive. Giving me DD AC+T just seems nuts to me. It makes me think they don't care if you drop dead of the side effects as long as you don't die of the original cancer and can be counted as a \"success\" in their survival statistics. Does anyone else think this is totally crazy?? Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 26, 2015 09:44PM tshire wrote: SpecialK, it's interesting, I just realized that the author is from Texas Oncology- as is MO#1 who recommended TC!",
      "MessageIndex": 16,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 2, 2015 01:29AM tshire wrote: Hmm interesting. None of my path reports had that, I had to get Mammaprint done to tell me that because I was strong PR+.What was your Ki67? Well my understanding is that anything ER+ is better than ER- because there are treatments and it's generally not as aggressive. Luminal B has the second best prognosis after Luminal A, to put it another way.",
      "MessageIndex": 28,
      "PostDate": "02/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/834551",
      "Title": "DOSE DENSE AC+T recommendation?? tshire tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 30, 2016 06:52AM tshire wrote: Starting to get a burn, mostly under my arm. I guess I forgot to put the cream all the way over there, because they weren't radiating my nodes. But apparently breast tissue is under the arm as well. D'oh. It's tight and leathery and looks like a bad sunburn. :( RO just said to keep putting Miaderm on 2x a day. I'm also putting on the Trader Joe's aloe gel and coconut oil. Other than that the rest of the breast looks ok. I hope it doesn't get a whole lot worse, I have 1 more week of whole breast rads and then a week of boosts.",
      "MessageIndex": 954,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 23, 2016 09:45AM tshire wrote: treatment #17 today and just now starting to show a bit of pink. Some nipple pain too. But that's about it. Halfway done woohoo",
      "MessageIndex": 825,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Dec 30, 2015 11:20AM tshire wrote: Starting my first treatment today... nervous. I picked up the aloe gel from Trader Joe's as well as Miaderm. Should I alternate their use morning and night, or is there a better way? Wish me and my lily white skin luck!",
      "MessageIndex": 326,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 6, 2016 02:52PM tshire wrote: just had treatment 4 today. Does anyone else feel occasionally twinges of pain in the radiated breast? Or is it my imagination",
      "MessageIndex": 428,
      "PostDate": "06/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I'm 31 and I was just diagnosed. I don't have much information yet because my doctor called me on Friday afternoon with the news of IDC and now it's the weekend. The small comfort I can take is that my lymph nodes were clear on ultrasound, it's grade 1, and the tumor was only 1 cm (on ultrasound). The mammogram didn't even see it. My doctor is referring me to a breast surgeon. I don't know what to do, how to prepare. Do I need a second opinion? What questions do I ask? I'm so scared and I feel so alone, none of my friends have ever had breast cancer. Please help, and please pray for me. I was planning my wedding for next spring when I found the lump. I wanted to have a baby in 2017. Now I don't know if I'll be able to have any of that. I feel like God isn't listening to me, doesn't care about me. I'm so lost. Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 17, 2015 01:26PM tshire wrote: No, still no results on that. Should come in today or tomorrow.",
      "MessageIndex": 35,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 18, 2015 06:31PM tshire wrote: Update: ER+ 98%, PR+83%, HER2-. Good news I guess, except I will be going into menopause at 31. :( Other bad news was that my Ki67 score was 34%, high. My mitotic rate was 1, grade 1 overall, so I am super confused about that. My MO said that was unusual but she makes the chemo call on the Oncotype score though, and Ki67 is a big factor in that. I was really REALLY hoping to avoid chemo. Of course I want to live so I'll take it if they tell me to. I guess I am vain, I just really wanted to look beautiful on my wedding day in 9 months.",
      "MessageIndex": 40,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 2, 2015 08:37AM - edited Jul 2, 2015 08:38AM by tshire Yes, no nodes on MRI is very good news. I pray to God they stay clear for the surgery. Please keep praying for me, if you can. This morning I woke up and I thought it was a bad dream, then I realized it wasn't. That's so hard.",
      "MessageIndex": 55,
      "PostDate": "02/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 9, 2015 11:51AM tshire wrote: This is probably crazy, but I just had a terrible thought.... what if the distortion seen in the other breast on the ultrasound is ILC? And the MRI missed it? Is that possible? Pre-op tomorrow. I'll ask the surgeon then. Scared.",
      "MessageIndex": 59,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 9, 2015 04:03PM - edited Jul 9, 2015 04:07PM by tshire I know. It's just so hard not to go there. I want to be cautious and vigilant and advocate for my health. I just don't know what to do besides prophylactic MX if an MRI didn't see it... I guess there's nothing else to do.",
      "MessageIndex": 63,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 7, 2015 01:28PM tshire wrote: Well, the first oncologist I talked to wants me to do chemo- 4 rounds of TC. Mostly because of my age, some because of my Ki67 being high for grade 1, and my 20 Oncotype. But she also wants to present my case to a tumor board, because I am so damn special and unusual. :/",
      "MessageIndex": 94,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 7, 2015 02:36PM tshire wrote: The Ki67 was from my biopsy sample. :/ Nope, no LVI seen. No necrosis. Well differentiated tumor. <1 mitosis seen per 10 HPF, which I thought was good, but then she said most grade 1 tumors have NO mitosis seen. She said that combined with the Ki67 indicates proliferation, and that's what the Oncotype reflects. Yes, I'm going to another MO next week, plus I am going to MD Anderson in Houston as soon as they call me back with an appointment date. I'm interested in finding out what the tumor board says too. My surgeon also ordered the Mammaprint test.",
      "MessageIndex": 96,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jan 7, 2016 11:37AM tshire wrote: I had a lumpectomy- twice actually- and no drains.",
      "MessageIndex": 1,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839648",
      "Title": "Drains with lumpectomy? fidget fidget"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Mar 29, 2017 08:59AM tshire wrote: I'm glad I could help with that! What decisions did you come to?",
      "MessageIndex": 65,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 30, 2015 09:51PM tshire wrote: \"The number is a value on a scale from -1.0 to +1.0 reflecting the correlation of the patient's expression profile to that of a low risk template profile.\" So am I right in hypothesizing that my -.115 number means I am less similar to the 'high risk' template than most people, but still similar enough to be called high risk? Or am I still missing something?",
      "MessageIndex": 13,
      "PostDate": "30/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 12:26PM tshire wrote: Thanks for pointing out Table 10. It looks like the cutoff for Mammaprint FFPE (mine) is -0.0575 to 0.0. So yes, outside of it. But closer than say, Mel. It's confusing that the test lumps women into the \"high risk\" even with very different characteristics. Am I really supposed to assume that a grade 1, 1 cm ER/PR+ tumor and a grade 3, 2 cm, triple negative tumor have the same statistical level of risk?",
      "MessageIndex": 26,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Sep 4, 2015 04:27PM tshire wrote: Yes, thanks!",
      "MessageIndex": 30,
      "PostDate": "04/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 7, 2015 05:03PM tshire wrote: I'm 31. I'll be 32 in September.",
      "MessageIndex": 480,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Feb 9, 2016 07:15AM tshire wrote: I was told that TC is the standard chemo for node-negative patients. I tolerated my 4 rounds quite well.",
      "MessageIndex": 9,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/841022",
      "Title": "TC vs. ACT in young women...looking for my best options! Csum81 tshire"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I know there isn't a score in the same way as Oncotype, but there is a scale of risk on the summary page of the Mammaprint report. Mine came back as high risk Luminal B, but my degree of high risk seems small at -.115. The sample report online gives a risk of Luminal B at -.35, much higher Can anyone fish out their report and share with me? Thanks! Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I know there isn't a score in the same way as Oncotype, but there is a scale of risk on the summary page of the Mammaprint report. Mine came back as high risk Luminal B, but my degree of high risk seems small at -.115. The sample report online gives a risk of Luminal B at -.35, much higher Can anyone fish out their report and share with me? Thanks! Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 11:41AM tshire wrote: Thanks Barred and Mel. So it's a degree of how similar you are to the \"low risk\" template then. \"Within the \"High Risk\" category, I am not aware of any data or evidence that establishes differences between the risks associated with different index values that fall within the high risk range\" It would be an interesting study to look at the differences though wouldn't it? I was hoping I could get enough responses on here to do a very informal non-scientific comparison of the Mammaprint \"score\" to other measurable characteristics such as grade and Oncotype. For instance, Mel is much further to the left on the high risk scale, which correlates to her Grade 3, even though we are both ER/PR+ and apparently Luminal B, while I am much closer to 0 with my Grade 1. Does that mean I am more similar to a low-risk person than I am to Mel, since I am much closer to 0 than she is and therefore more like the template? No I was not told I was borderline- I'd love to know the borderline cutoff \"score\" however.",
      "MessageIndex": 16,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 11:52AM tshire wrote: I'm aware that there isn't any data on the idea. I was interested in informally gathering some by comparing fellow survivor \"scores\" to their other less ambiguous tumor characteristics. It seems like a reasonable hypothesis. My MO said it doesn't matter because it doesn't affect treatment decisions. True. But she didn't know anything about what the \"score\" meant- and didn't say anything about a template. That's why I come here, to dig a little deeper.",
      "MessageIndex": 18,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 11:56AM tshire wrote: Mel, it may have also been because you are Grade 3. Fast dividing cancers tend to respond well to the chemo drugs, better than slower dividing (grade 1). I was given a 3-5% benefit from chemo. My MO said chemo would work but not to the same extent if it were a Grade 3. Did you also do Oncotype?",
      "MessageIndex": 21,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 31, 2015 11:59AM tshire wrote: Thanks for your valuable research BarredOwl! You are a great resource.",
      "MessageIndex": 23,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 28, 2015 11:17AM tshire wrote: Yes, exactly what BarredOwl said. mysunshine, If you look at your report, on the first page the first box has a red and green bar- here's an example: http://www.agendia.com/media/24Feb15_High-Risk-Lum.... On the bar, there is another box which points to the bar and says \"High Risk\" and then a number. The sample says \"-.350.\" My report says \"-.115\". I was just wondering what that meant, and the implications (if any). My oncologist said it didn't matter, but if it doesn't matter why offer that information at all? Also, BarredOwl I think you're right- the footnote 1 refers to to the percentage of risk for everyone with a high score, not the individualized \"score\" shown on the bar. I have no idea where they get that number.",
      "MessageIndex": 5,
      "PostDate": "28/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I know there isn't a score in the same way as Oncotype, but there is a scale of risk on the summary page of the Mammaprint report. Mine came back as high risk Luminal B, but my degree of high risk seems small at -.115. The sample report online gives a risk of Luminal B at -.35, much higher Can anyone fish out their report and share with me? Thanks! Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: Hi. I'm 31 years old. About 3-4 weeks ago I was doing a BSE and I found... not really a lump exactly, more of a ropey, rubbery sort of thing, maybe 1 inch long, right across the top of my right areola. It was easiest to feel standing up, harder to feel laying down. My breasts were swollen and tender at that time (they usually are about 2 weeks before my period) so I waited a week before going to see my GP. It definitely seemed smaller (I think?) when I went to see the GP, but she said she could feel it (she called it a ridge) and she also found another one in my left breast that I hadn't (I still can't really find it myself). She said it was probably \"fibrocystic changes\" but to be on the safe side scheduled me for an ultrasound and mammogram a week later after my period. Thursday 6/4 I had the ultrasound first. They looked at my right breast and lymph nodes only. The tech took the results to the radiologist, then came back and said he needed a mammogram. I had the mammogram then waited about 15 minutes for the radiologist to come out and talk to me. Of course I was bawling the whole time. The radiologist was short and direct- he said he wanted to schedule a biopsy. I asked if he thought it was cancer; he said 90% of cases like mine were \"fibrosis\"- he said \"fibrocystic changes\" were fibro- and cystic- and not necessarily both. He said it was definitely a solid mass, but he was surprised I could feel it because it was so small. He said that 10% chance means he can't just sent me away, that we need to know. Then he shook my hand and left. I was in such a daze I didn't really ask any good questions. He didn't say anything about BI-RADS, or characteristics on the imaging, or show me the imaging, or mention my lymph nodes he looked at, or anything. I don't know if that's a good or bad thing. My biopsy is scheduled for tomorrow 6/9. I am scared out of my mind. I just got engaged and set our wedding date for March. I keep having these horrible thoughts that I caused this by being too happy.That I'm being punished somehow. That I'll never get to have our wedding. My GP gave me Ativan to sleep, but I'm so terrified and I keep poking at prodding at the ropey thing and now it hurts. I can feel the characteristics- if i push down on it it sort of moves out of the way of my finger, but I can't push it off into another direction, it blends into the surrounding tissue at the sides. I don't know if this is what they mean by \"moveable.\" It's firm, but I don't know if it's \"firm\" enough to imply cancerous. I feel so desperate and afraid. Would he say the 90% if he didn't mean it? Would he have talked to me if he found \"bad things\" on the imaging? Please help. :( Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832445",
      "Title": "31 years old... waiting for a biopsy tomorrow, scared tshire inks"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 9, 2015 07:00PM tshire wrote: I had the biopsy today. Hurt like hell. It was another radiologist who performed it. She was a lot more despairing than the first radiologist who wrote my report. She said it's \"taller rather than wide\" in a teardrop shape and showed me the report. It says: \"Ultrasound identifies the presence of a 1cm poorly marginated hypoechoic mass. Indeterminate morphology.\" \"Diagnostic mammogram demonstrates heterogeneously dense tissue. No conspicuous masses or microcalcifications seen.\" BI-RADS- 4 Suspicious abnormality She said these findings make her very suspicious. I asked her if she ever sees ultrasound images like mine that turn out to be benign and she said \"occasionally.\" That's definitely not the 90% figure the first radiologist told me. She did say they saw nothing suspicious in my lymph nodes or mammogram. If I'd had only a screening mammo they would have missed it entirely. Poorly marginated, taller than wide, indeterminate morphology all sound bad. I'm so scared. They said I'll know Thursday or Friday... Thanks for all the support during this trying time.",
      "MessageIndex": 5,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832445",
      "Title": "31 years old... waiting for a biopsy tomorrow, scared tshire inks"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 13, 2015 09:23AM - edited Jun 13, 2015 09:24AM by tshire To my great dismay and shock I am joining the club. I have a grade 1 IDC. It was 1cm on ultrasound. I don't know any more than that now. My doctor just referred me to a breast surgeon I'll meet Monday or Tuesday. I have no idea what comes next. My lymph nodes looked clear on ultrasound. Please pray that it is stage 1 with me.",
      "MessageIndex": 8,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/832445",
      "Title": "31 years old... waiting for a biopsy tomorrow, scared tshire inks"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 24, 2015 11:22AM - edited Jun 24, 2015 11:24AM by tshire Thank you for you kind words, thoughts, and prayers ladies! I'm so happy to report they found NOTHING ELSE anywhere- including lymph nodes! They said NO LYMPH NODE involvement seen. They're still going to do the sentinal node biopsy to make sure nothing microscopic is in there, but right now there are no tumors visible anywhere besides the spot they already knew about! And that spot is about the same size as before, my doctor said the .3mm increase is probably due to the biopsy/swelling/scarring. This \"journey\" is more like a roller coaster ride of emotions!! I still have the small tumor on the right but I'm so RELIEVED it's nowhere else! Thank you all so much, will keep y'all updated! Have a consultation with MD Anderson coming up next week, then we'll set the date for surgery. Tiffany",
      "MessageIndex": 48,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 1, 2015 02:16PM - edited Jul 1, 2015 02:32PM by tshire No not offended, I totally agree I am much too young. None of my friends have ever had breast cancer. The one friend I had with cancer is dead. One friend, trying to be helpful I guess, sent me an \"inspirational\" book about breast cancer from the mid-90s where the woman died in the end. That didn't help. The support groups for young women seem to be mostly for women with the genetic mutations. I still feel very alone. I still cry every day. I don't know if this will ever stop. It has to, right? Sometimes this board scares me, especially when I see older posts and look at the Dx signature line for the posters and realize it came back for them, often much worse. Or that it seemed not too bad at first but then.... Sometimes it helps, like your posts, Tomboy. That Leonard Cohen quote really spoke to me. I had already planned to walk down the aisle to \"Hallelujah,\" and now it seems even more fitting. https://www.youtube.com/watch?v=Q-jMGvvMoAg I have always been such a control freak, and now I realize that I have no control. I guess I never really had any.",
      "MessageIndex": 53,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I'm 31 and I was just diagnosed. I don't have much information yet because my doctor called me on Friday afternoon with the news of IDC and now it's the weekend. The small comfort I can take is that my lymph nodes were clear on ultrasound, it's grade 1, and the tumor was only 1 cm (on ultrasound). The mammogram didn't even see it. My doctor is referring me to a breast surgeon. I don't know what to do, how to prepare. Do I need a second opinion? What questions do I ask? I'm so scared and I feel so alone, none of my friends have ever had breast cancer. Please help, and please pray for me. I was planning my wedding for next spring when I found the lump. I wanted to have a baby in 2017. Now I don't know if I'll be able to have any of that. I feel like God isn't listening to me, doesn't care about me. I'm so lost. Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 20, 2015 05:13PM tshire wrote: Well, there was bad news and good news. Good news: NO NODE involvement! Surgeon did a SNB with 3 nodes and all were negative. NO LVI! Still grade 1! Mitosis rate still 1, less than 1 mitotic feature per 10 HPF. All margins for invasive cancer were negative. Breast looks fine and is healing nicely. Bad news: Somehow between the MRI and the surgery, the tumor became 2.6 cm (literally twice the size the MRI saw- 1.3). That puts me into Stage IIA (!!!!) This is to me an odd finding because on the path report it reads \"Specimen marked on the anterior aspect by an irregularly-shaped to crescent-shaped portion of skin, measuring 2.6 x 1.6 cm. Initial sections of the specimen show a tan ovoid, grossly circumscribed mass in the central aspect of the specimen. The mass is 26 x 16 x 10 mm.\" Does this strike anyone else as odd? That the crescent shaped skin and the ovoid mass are exactly the same size? Also I've never heard of an MRI reading being that far off. I called the surgeon about it, I'm waiting for a call back. I might also call the pathology lab and ask them to double check on that measurement. Maybe also get a second opinion. Other bad news is that there was mixed type intermediate grade DCIS in the specimen, and one spot of DCIS on the inferior medial margin, which means I need another surgery to remove it. That's scheduled for Monday. Waiting on Oncotype score.",
      "MessageIndex": 75,
      "PostDate": "20/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 3, 2015 12:55PM tshire wrote: Tomboy, yeah it seems like there isn't a really distinct definition. Some studies use Ki67 10-35% as the cutoff, some use ER/PR%, some use mitosis rate, some use grade, some use whether or not you're HER2+ to differentiate. So I don't know. In my case, 2 different pathologists gave me a 1 mitosis rate, with less than 1 mitosis per 10 HPF. But my Ki67 was 34%. I did ask a PhD molecular biologist why a Ki67 could be high while an observed mitosis rate could be low. He said there are many regulators of mitosis in the cell that control certain checkpoints that allow the phases of cell division to proceed. You may have one marker that says \"ok, go\" and that leads to Ki67 expression. But another checkpoint protein might say \"stop\", and then mitosis, despite Ki67 being high, does not progress. He says that in most cases the Ki67 correlates to the mitotic rate. But in your case, when they've actually seen the absence of mitosis under the microscope, and the Ki67 is the oddball result, it doesn't correlate. So it's perfectly reasonable that they will be different. So he says Ki67 is a valuable data point, but it doesn't negate the fact that pathology shows that the cells are not actually dividing.",
      "MessageIndex": 91,
      "PostDate": "03/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I'm 31 and I was just diagnosed. I don't have much information yet because my doctor called me on Friday afternoon with the news of IDC and now it's the weekend. The small comfort I can take is that my lymph nodes were clear on ultrasound, it's grade 1, and the tumor was only 1 cm (on ultrasound). The mammogram didn't even see it. My doctor is referring me to a breast surgeon. I don't know what to do, how to prepare. Do I need a second opinion? What questions do I ask? I'm so scared and I feel so alone, none of my friends have ever had breast cancer. Please help, and please pray for me. I was planning my wedding for next spring when I found the lump. I wanted to have a baby in 2017. Now I don't know if I'll be able to have any of that. I feel like God isn't listening to me, doesn't care about me. I'm so lost. Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 16, 2015 08:50AM tshire wrote: Thanks DaisyQ. No, I don't have the full report yet. All I know is grade 1, IDC from the biopsy. The 1cm is from the ultrasound and clear nodes are from the ultrasound too. My doctor said the rest (receptor status, etc) can take time to process. I live in Austin, Texas so I'm about 2-3 hours from MD Anderson in Houston. I could go there I guess but I don't know anyone who lives there who I could stay with. Maybe I should just go there anyway? I have an appointment with a breast surgeon here in Austin for Wednesday morning. I want to at least get a handle on what I am dealing with. My fiance has to work and he can't come with me. I'm installing a recorder on my phone. We are going to need the banked sick time. :( I have already chosen a double mastectomy, I think. Survival rates may not be different than lumpectomy/radiation, but recurrence rates are lower. I also really want to avoid radiation; my grandmother had BC in the 70s and they treated her with radiation, then about 20 years later it came back as lung cancer, probably caused by the radiation and she died. Of course, she was in her 50s when she first got it, and passed away just before her 75th birthday. I'll feel lucky if I live that long. My doctor prescribed Xanax, I need to pick it up today after work. ",
      "MessageIndex": 15,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 17, 2015 12:28PM - edited Jun 17, 2015 01:48PM by tshire Justmaximom, don't worry I have been in therapy since his death. It was very traumatic for me. I tried so hard to help him, I organized benefit concerts and raffle nights getting donations from local businesses and raised $6,000 in two days for his care because he was uninsured. He passed away only 6 weeks after his diagnosis. I always wished I could have done more to help him. I miss him so much, especially now. Needless to say, I do have anxiety issues which have been greatly heightened since this diagnosis, and the Xanax prescribed is helping me. I spoke with my breast surgeon this morning too, and she is trying to get me into a conference (medical oncologist, radiation oncologist, and genetic counselor) tomorrow afternoon. If not then, Tuesday. She had very good news for me- NO evidence of lymphovascular invasion. Nottingham score 5, tubule score 2, nuclear score 2, mitotic rate score 1. Still no news on receptors and Ki67. It had a long explanation of the microscopic examination but I didn't really understand it and my doctor said they're just stating their findings of how they came to their conclusions. I did notice \"no significant inflammatory population identified\" \"no necrosis seen\" and \"showing only mild nuclear enlargement and hyperchromasia.\" Also \"the infiltrative-appearing glands show no p63, CK5/6-positive myoephithelial cells.\" If anyone knows what this means I'd love more info. She said my case is \"cut and dry\" and \"not an emergency.\" She says she has no reason right now to think I will need chemo. She supports my inclination for a double mastectomy. Feeling so relieved. I know I'm not out of the woods yet, but I feel like I can see some light. Thank you all so much, Tiffany",
      "MessageIndex": 33,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I'm 31 and I was just diagnosed. I don't have much information yet because my doctor called me on Friday afternoon with the news of IDC and now it's the weekend. The small comfort I can take is that my lymph nodes were clear on ultrasound, it's grade 1, and the tumor was only 1 cm (on ultrasound). The mammogram didn't even see it. My doctor is referring me to a breast surgeon. I don't know what to do, how to prepare. Do I need a second opinion? What questions do I ask? I'm so scared and I feel so alone, none of my friends have ever had breast cancer. Please help, and please pray for me. I was planning my wedding for next spring when I found the lump. I wanted to have a baby in 2017. Now I don't know if I'll be able to have any of that. I feel like God isn't listening to me, doesn't care about me. I'm so lost. Tiffany Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 15, 2015 04:24PM tshire wrote: I feel like I am drowning. I can't stop crying. I read online that if the cancer is very close to your nipple (mine is in my areola) it can skip going to your axilla lymph nodes and go straight to your inner mammary nodes and that's an immediate stage 3. I feel like I am going to die. I am only 31. I don't want to die. Please help me.",
      "MessageIndex": 7,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 16, 2015 11:47AM tshire wrote: I know. I feel so sorry for myself. I feel like God is punishing me and I don't know why. My wedding is in 9 months and we already put down $10,000 in deposits. I ordered my beautiful wedding dress already. I can only see myself as being bald and scarred in it, if alive at all. I always thought I wanted a family but now I feel cursed. I feel like my young healthy fiance deserves someone healthy who can give him a healthy baby, not predisposed to cancer. He told me he'd love me no matter what, boobs or no boobs, kids or no kids. I hate myself for doing this to him. I love him so much, I don't want to hurt him. I'm having such a hard time right now. I know you're all trying to help, I appreciate that so much. I need to get on the Xanax tonight.",
      "MessageIndex": 19,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 16, 2015 05:52PM tshire wrote: I forgot to reply but yes I did find the lump- my doctor didn't find it when she did her exam but I insisted I could feel it. She scheduled a mammo but assured me it was just to ease my mind. The mammogram was clear, no microcalcufications or masses seen. But I was sure I felt something and asked for an ultrasound, and that's when they found it. I have been a hypochondriac since 2012 when one of my best friends, Ryan, died of stage 4 cancer that had metastisized to his spine 6 weeks after his diagnosis. He was uninsured at 27 years old and didn't go to a doctor until it was much too late. I feel like maybe he is still watching over me. I pray that he and my grandma both are.",
      "MessageIndex": 23,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 16, 2015 06:02PM tshire wrote: I'll be sure to talk to my doctor and get the stats. I just really, REALLY don't want this to ever come back, and I'm willing to sacrifice my boobs for a long and worry free life. I hopefully have another 50-60 years ahead! I'm willing to sacrifice almost anything for that.",
      "MessageIndex": 26,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 23, 2015 08:53AM tshire wrote: Another update- I went to a new breast surgeon yesterday and she did an ultrasound on my left breast- something no one had done before! Only mammogram, which showed up clear in both breasts. Ha. She found \"something.\" Distortion, she said. I'm getting an MRI today, but I imagine if it's picked up on ultrasound it'll be picked up there too. If it's another cancer I don't think I can handle it. Please pray for me.",
      "MessageIndex": 43,
      "PostDate": "23/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 10, 2015 03:40PM tshire wrote: 55sunshine, I also became vegan! I used to only a vegetarian (lifelong). Now I've also cut out dairy, sugar, processed carbs, alcohol, and soy isolate. Everything organic. Can't hurt right? Thank you everyone for your support through the worst time in my life. I will update with more information after surgery.",
      "MessageIndex": 66,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 10, 2015 05:01PM tshire wrote: Wow, they found DCIS by palpating your armpit?? I found mine on my own, and I palpated it quite a bit because sometimes I couldn't find it and I thought it had gone away. I went to the Dr. after 2 weeks, and she scheduled me for a mammo a week later because she didn't think it was anything serious, and then the mammo was clean, and then the ultrasound found it. God I have never been so scared.",
      "MessageIndex": 68,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 31, 2015 09:41AM tshire wrote: Thank you so much for your support and prayers Tomboy!! I plan to also go to MD Anderson in Houston, hopefully they can help with the decision. I wish the Oncotype score gave more predictive information for AIs + ovarian suppression, not just Tamoxifen. I would be on Cloud 9 if it wasn't for that pesky Ki67 34% and Oncotype 20. ",
      "MessageIndex": 85,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 1, 2015 08:39AM tshire wrote: Update: Lumpectomy scheduled for 7/13. Also got my genetic results back- negative on all the \"big 5\" for BC in young women: BRCA1, BRCA2, CDH1, PTEN, and TP53. So I guess this is just some freak thing that happened to me. Or I guess it could have been the 10 years of birth control pills I was on, or my love of estrogen-rich dairy, or the extra 20lbs I never lost after college, or that I didn't exercise every day. Or I'm just incredibly unlucky. I just can't believe it happened at 31.",
      "MessageIndex": 51,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 30, 2015 11:47AM tshire wrote: Finding out about my Oncotype today at 1:30 CST, as well as whether the last surgery got out all the DCIS. Prayers for me please. I don't know how to stop being so scared.",
      "MessageIndex": 78,
      "PostDate": "30/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 31, 2015 03:39PM tshire wrote: Grade 1 actually. I was just reading about how my tumor could be considered \"Luminal B\" since it has the 34% Ki67, which is a type with a worse prognosis than Luminal A. But all of my doctors seem very confused about why I have such a high Ki67 in the first place. ",
      "MessageIndex": 88,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "tshire wrote: I know there isn't a score in the same way as Oncotype, but there is a scale of risk on the summary page of the Mammaprint report. Mine came back as high risk Luminal B, but my degree of high risk seems small at -.115. The sample report online gives a risk of Luminal B at -.35, much higher Can anyone fish out their report and share with me? Thanks! Tiffany, dx age 31. Neg for all breast cancer genes tested. Oncotype 20. Ki67 34%. Saved my hair with Penguin Cold Caps! Dx 6/12/2015, IDC, Right, 1cm, Stage IA, Grade 1, 0/3 nodes, ER+/PR+, HER2- (FISH) Surgery 7/13/2015 Lumpectomy: Right Dx 7/16/2015, DCIS, Right, Stage 0, Grade 2 Surgery 7/25/2015 Lumpectomy: Right Chemotherapy 9/30/2015 Cytoxan (cyclophosphamide), Taxotere (docetaxel) Radiation Therapy 12/29/2015 Whole-breast: Breast Hormonal Therapy 3/10/2016 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/834508",
      "Title": "\"High Risk\" Mammaprint Luminal Bs- what was your 'score'? tshire Meow13"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jul 30, 2015 08:28PM tshire wrote: You guys are really the best. I got mostly good news today. First, they got it all out! No more DCIS or abnormailities. Clean margins. No more surgery for me. And amazingly, there was a lab error on the original pathology- tumor was 1.3cm NOT 2.6, which puts me squarely into Stage 1A. I'm so glad I pestered my surgeon into re-checking with the lab. They accidentally measured the entire specimen, not just the tumor. I feel like they owe me flowers or something for the week of shock and despair when they originally staged me as 2a. My Oncotype score was 20. Low-intermediate. My surgeon said with that score and other favorable characteristics she would not recommend chemo. But of course I'm going to be getting several MO opinions on this. She also ordered the Mammaprint test, so waiting on that. Plus I am negative for all 17 of the breast cancer genes I was tested for (Ambry BreastNext panel). Probably a subject for another thread, but y'all have been with me the whole time. With grade 1, less than 1 mitosis per 10HPF, no LVI, no nodes, Stage 1A, 98% ER/83% PR + and HER2 neg, but Oncotype 20 and Ki67 34%, would you do chemo? Oncotype said I had a 13% chance of distant recurrence over 10 years with Tamoxifen only. But I plan to ask for ovarian suppression and an AI plus Boniva for the first 3 years and switch to Tamoxifen for another 2. Then have a baby and do Tamoxifen for another 5 years. What do y'all think? I really don't want to take unnecessary chances with my health as far as the cancer goes, but the long term affects of chemo scare the crap out of me.",
      "MessageIndex": 83,
      "PostDate": "30/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Aug 14, 2015 04:24PM tshire wrote: Well, surgeon just called- Mammaprint came back high risk. 22% of distant recurrence with no therapy. Luminal B. I guess that clinches it. Damn. I'm having a hard time right now.",
      "MessageIndex": 98,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 15, 2015 04:58PM tshire wrote: Thank you... I go through freak-outs. It has been 3 days since diagnosis, sometimes I can smile and act normally but I am usually crying. The breast surgeon my doctor referred me to hasn't returned my calls. I try to keep in mind that it is so small and grade 1 and that I am relatively \"fortunate.\" But I am so afraid, God I am afraid.",
      "MessageIndex": 9,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    },
    {
      "AuthorID": "tshire",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216833/profile",
      "Content": "Jun 16, 2015 05:57PM tshire wrote: Thank you Tomboy that was inspirational.",
      "MessageIndex": 25,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832582",
      "Title": "so lost, need help with my new diagnosis tshire SlowDeepBreaths"
    }
  ]
}