{
  "AuthorID": "TSmith",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
  "Posts": [
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "TSmith wrote: I start chemo 4/23/09. I'll be doing 8 rounds of the drugs that start with A and C followed by 12 rounds of Taxol. I'm also going to be in the Avastin study. 20% get placebo, and then there are 2 arms who get the Avastin. So not sure what I will be in but the director said if I have nose bleeds then I'll probably be getting Avastin rather than placebo. Is there a list on the forums for side effects for each drug. Also is there a list of things I should do during the chemo session to prevent the side effects with each drug. And prescriptions I can ask for so we can have them at home in case they are needed. Dx 10/28/08, IDC, Double Mastectomy 1/20/09, 6cm, Stage III, Grade 3, 1/6 nodes, ER-/PR-, HER2-, A/C Chemo 4/23/09, Taxol Chemo 7/9/09 16 weeks. Dx 11/20/2008, IDC, Left, 4cm, Stage IIIC, Grade 3, 1/6 nodes, ER-/PR-, HER2- Chemotherapy 4/23/2009 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/732790",
      "Title": "Side effects list for chemo drugs TSmith Estepp"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Apr 22, 2009 11:52AM TSmith wrote: I'm just taking hubby with me.  He's the forever optimist. He's my positive thinker. Our daughters will be staying at home for the first treatment. I'll see how that goes before I take them along.  My thoughts and prayers are with each and every one of you ladies on here. I hope I am half as strong as the lot of you. Tonya",
      "MessageIndex": 400,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Oct 5, 2009 05:27PM TSmith wrote: I finally finished chemo - I'm so happy to be done! Weekly Taxol seemed to take forever to end.The nurses gave me a Certificate of Courage that they all signed. Funny, I don't feel very courageous now. I keep reminding myself - Baby steps. Off to bed now, hoping the fatigue is not so bad tomorrow so I can catch up on posts.",
      "MessageIndex": 1486,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Aug 19, 2009 02:06PM TSmith wrote: Congratulations to all those who have finished their chemo regimens. It must have felt great walking out of there _for the last time! I just completed #6 of 12 weekly Taxol. 6 more to go. Its getting to the point where I have to talk myself into going. I don't want to go and I feel like a 2 year old throwing a fit but its true. I am so exhausted, no energy, periphial nueropathy in my hands and feet, along with instant bouts of crying for no reason at all (and I am on 75 mg of effexor xr) and am not sleeping more than 3.5-4 hours a night. I feel as bad as I look and today as I sit here I am not sure how I am going to get through the last 6 and still come out on the other side chemo. Tonya",
      "MessageIndex": 1255,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Apr 2, 2009 02:24PM TSmith wrote:",
      "MessageIndex": 110,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Apr 22, 2009 10:42AM TSmith wrote: My first day of chemo is tomorrow. I'm scared. My nerves are shot. I'm jacked up one minute and crying the next. I'm a freakin mess! I'll be glad when tomorrow is over.",
      "MessageIndex": 398,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Jul 15, 2009 12:35PM TSmith wrote: I'm planning on sticking around too. Although I have not felt well enough to be on-line most days, when I am able to, this is the first place I come. The support and guidance has been a Godsend for me. I had Taxol #1 of 12 on 7/9. I had myself so worked up, I really thought I was going to be sick LOL I had just a small reaction, and the nurse stopped the flow for 5 minutes and resumed.  As far as side effects go for this, I've had bone pain, and extreme fatigue(this I didn't expect so soon.) I've napped every single day since the 9th and still am tired throughout the day. Today, I don't feel like myself, I feel hot and flushed from the chest up. I've been taking my temp every hour and I don't have one.  With the A/C I had to have the Nuelasta shot but onc. said I would not need with Taxol even though I requested it. I hope my counts are good on Friday. I'll be upset if chemo is delayed (NEVER THOUGHT I WOULD SAY THAT!!!!!!!) But now that I have started treatment I cannot wait for it to be over, kwim? Here's wishing you all are doing good :) Tonya",
      "MessageIndex": 1034,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Jul 11, 2016 06:08PM TSmith wrote: Amy I'm very sorry to read about your husbands daughter. A parent should never have to bury a child.  It's been a long time since I've come here. I'm raising my three grandchildren ages 4.5, 3, and 2, for the last couple of years. Im exhausted most days.  Hope to be more active if I can stay awake after kids go to bed lol ",
      "MessageIndex": 5307,
      "PostDate": "11/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Apr 16, 2009 09:54AM TSmith wrote: I finally have my first chemo scheduled for April 23 - 1 week from today. I had my chemo port surgery on 4/9 and ended up with an allergic reaction to the betadyne they used. I still have one heck of a rash.",
      "MessageIndex": 302,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    },
    {
      "AuthorID": "TSmith",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80346/profile",
      "Content": "Jul 8, 2009 08:42AM TSmith wrote: Our group has been really quiet. I hope everyone is doing okay.  I haven't posted in a while. Getting through A/C took all the energy I had. Ended up in the hospital after #2 with pnuemonia in both lungs and a huge blood clot in my right lung. I'm giving myself Lovenox shots in my belly 2x a day.  I feel like crap all the time. Pain in the right lung and muscle spasms in the shoulder from the blood clot, belly sore from all the shots, not to mention black and blue and purple and green from all the bruising, hands and feet peeling (not sure why and wonder if the ped-egg would help this) I can't sleep, effexor xr is no longer helping with my mood, and I am sick and tired of being sick and tired. BUT I am so glad A/C is over. I start Taxol ( 12 weekly doses) tomorrow and am a little worried but am hoping it is better than my last rounds.  I've still got to run and get Clariton and L-glutamine. I've also got to get some eye drops as most of my eyelashes are gone and my eyes are either burning or they are itchy and watery. Any recommendations? Tonya",
      "MessageIndex": 1003,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730926",
      "Title": "Starting Chemo April 2009 tulipbebe MissouriCatLady"
    }
  ]
}