{
  "AuthorID": "TSollen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
  "Posts": [
    {
      "AuthorID": "TSollen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
      "Content": "Feb 2, 2008 03:10AM - edited Feb 2, 2008 03:19AM by TSollen Diane, You are not alone.  I had a very strong meltdown the first time I saw myself in the mirror as I was about to take my first shower.  I was not prepared for the sight.  I lost it.  When I went into the PS's office for my appointment post-op I lost it again.  That is when they prescribed me an anti-anxiety pill.  It has helped but I still have my moments.  I'm told this is normal.  Don't be afraid to ask for something. What I'm not used to is the lack of energy.  My insurance company says I'm to return to work on Feb 7th, but there is no way I can last a day yet.  I have had reconstruction only to have them go in and undo it on Jan. 28th so now I'm recovering from that surgery too. I have to meet with my plastic surgeon on Tuesday and hopefully he can tell me how long this recovery is expected to last at least when my energy will return.",
      "MessageIndex": 11,
      "PostDate": "02/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699603",
      "Title": "post mast meltdown DianeNMil lvtwoqlt"
    },
    {
      "AuthorID": "TSollen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
      "Content": "Jan 27, 2008 11:40PM - edited Jan 27, 2008 11:43PM by TSollen I have surgery again tomorrow to have the dead skin cut off and the tissue expanders taken out so I can heal and start over on reconstruction.  I'm nervous. On a good note, it looks like at least 3 of my 4 drains will be taken out at the surgery!",
      "MessageIndex": 22,
      "PostDate": "27/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698899",
      "Title": "3 days post bilat with recon twogirls twogirls"
    },
    {
      "AuthorID": "TSollen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
      "Content": "Jan 29, 2008 09:29AM TSollen wrote: Hi everyone.  I has my surgery yesterday and the PS took the tissue expanders out and cut all of the dead skin off.  He took all four drainage tubes out but put two new ones back in my chest. I now have to completely heal then go back in for the tissue expanders to be placed back in.  I think this will happen in a few weeks. Has anyone else had this complication?  Now I'm also wondering how the expanders are going to feel the second time around.  My PS said this complication has changed our reconstruction plans but we still have to discuss all options. I have to say, I feel alot better today with the dead tissue gone and the expanders out.",
      "MessageIndex": 29,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698899",
      "Title": "3 days post bilat with recon twogirls twogirls"
    },
    {
      "AuthorID": "TSollen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
      "Content": "Jan 20, 2008 09:40PM TSollen wrote: I had bilat mast with reconstruction on Jan 11th.  I decided today that I would feel much better without these 4 tubes in me.  I've got two in my back and two in my chest.  Makes it impossible to get comfortable.  First pain med I was on didn't work well, so I spent the majority of the first week in pain.  Plus my stomach area is extremely swollen. Any suggestions? I've resorted to those house dresses in the lingere dept at walmart and pin the bulbs to the inside of it.",
      "MessageIndex": 3,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698899",
      "Title": "3 days post bilat with recon twogirls twogirls"
    },
    {
      "AuthorID": "TSollen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/61009/profile",
      "Content": "Jan 25, 2008 03:43PM - edited Jan 25, 2008 03:46PM by TSollen Well, I saw my plastic surgeon on Tuesday and I still have all four drains in.  Double mastectomy with Reconstruction was on 1/11.  When I saw the PS on Tuesday, he has decided not enough of my old breast skin is going to live, so Monday, I go back in for surgery to have the dead skin removed and this means we have to take the tissue expanders out.  I have to heal and we get to start all over.  Once I heal, then he will do a surgery to put them back in so we can begin again.  I am hoping to have most of the drains out on Monday during surgery though.  I still have one that I'm hoping gets to the right numbers by Monday but am pretty sure the other three will be there. I need to meet with general surgeon and onocologist but am having to put those on hold until after this next surgery.",
      "MessageIndex": 15,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698899",
      "Title": "3 days post bilat with recon twogirls twogirls"
    }
  ]
}