{
  "AuthorID": "ttsd",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72193/profile",
  "Posts": [
    {
      "AuthorID": "ttsd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72193/profile",
      "Content": "Oct 7, 2008 07:57PM ttsd wrote: I am going through the exact same thing.  I have an MRI scheduled for 10/14 to make sure nothing else fishy is going on and then I go in for the wire procedure to remove the ADH, barring unforeseen.  Good news for you....keep your fingers crossed for me!",
      "MessageIndex": 18,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "ttsd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72193/profile",
      "Content": "Oct 22, 2008 02:36PM ttsd wrote: Finally, I got the results of my MRI 10/14 and I have to get more mammos and ultrasound on BOTH breasts (the previous dx was ADH in the left).  Another snafu, they faxed the results to my PC, not my GYN and no one called me so I called the breast center who advised me and I made an appointement.  This is the 3-4th communication nightmare with the Sally Jobe Brest center.  I am at wits end; scheduled for more on 10/24.  I am hoping I get the same results as Amy after an exision, date TBD. I have been breaking out in hives due to nerves, I think and can't  sleep.  My twins are nine and this is really detracting from quality time with them and my husband.  I so long for the days when I only saw a GYN once a year, whether I needed it or not.  Our medical system is a nightmare and I really thought breast specialists would be more sensitive to their patients HELP!.",
      "MessageIndex": 41,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722198",
      "Title": "HELP NEEDED...Microcalcifications- biopsy coming up busymomof4 leaf"
    },
    {
      "AuthorID": "ttsd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72193/profile",
      "Content": "ttsd wrote: After an bad mammo showing microcalcifications and a followup biopsy showing atypical ductal hyperplasia microalcifications, I received a call yeaterday from my PCP that they were notified form the imaging breast center that my mammo report was normal.  Since I have an MRI  and a surgeon appointment scheduled for next week, this was a shocker.  Turns out the imaging office faxed my 07 report to my PCP in error when they meant to fax my 07 and 08 reports to the surgeon. Don't you think they would be a little more concientious?  Of course I grilled my PCP and they figured out it was the 07 report,but they were in the dark. It scares me that they are all so incompetent.  HOW DO YOU FIND A GOOD DR./SURGEON/RADIOLOGIST? This follows an appointment for a biopsy where they made me wait an hour and I walked out and then an MRI where they had the name of my dr. screwed up so they couldn't get insurance cert.  This was a big deal as I want sedation for claustaphobia and my husband took off work to drive me. This is just too overwhelming while I am moving my mom to an NH and parenting my 9 year old twins.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/722252",
      "Title": "Bizzarro/just venting ttsd leaf"
    },
    {
      "AuthorID": "ttsd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/72193/profile",
      "Content": "ttsd wrote: I was diagnosed with ADH after a fishy mamogram in July with microcalcifications and then a mammotome; then advised to get an MRI and consult surgeons.  The surgeon says I have to get an incision to remove the duct with ADH on my left breast at the very least and have an MRI and Mammo fpor the rest of my life.  I had the recommended  MRI and now they want me back for more mammos and ultrasounds on both breasts.  I have that scheduled this Friday.  This has been a very LONG, grueling process that began in July.  Has anyone else experinced this kind of delay? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723106",
      "Title": "ADH and more ttsd spar2"
    }
  ]
}