{
  "AuthorID": "TuffMama",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
  "Posts": [
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 19, 2015 09:39AM - edited Feb 19, 2015 09:43AM by TuffMama Minus Two - Thanks for the link. My immune system is worse than normal because I have several autoimmune diseases. I am very careful, but it never hurts to be reminded of the dangers of LE!",
      "MessageIndex": 757,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 19, 2015 09:42AM - edited Feb 19, 2015 09:44AM by TuffMama Dancing diva - My sentiments exactly. I feel as though I've been dropped out of a plane and landed behind enemy lines without a map or a weapon. I guess Arimidex is my weapon, but I don't feel protected. And I hate the \"hot flashes,\" which in my case have become \"protracted superheated intervals.\" Ha!",
      "MessageIndex": 758,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 19, 2015 09:56AM TuffMama wrote: Momine - Hi, and thanks for the helpful info. I may have mentioned that I do the LeBed exercises, but I also hope to start walking when the weather improves. I have balance issues from inner ear damage, so I have to be careful. And I am.",
      "MessageIndex": 760,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 21, 2015 09:09AM TuffMama wrote: Minus Two - I'm thinking the same thing. I'm due for a bone density test this year - I think - but my last one was stable. I've taken Actonel, which I couldn't tolerate because of GI problems, and Reclast. I was due for a Reclast infusion about the time my cancer was discovered. I dodged Prolia with my new MO (I moved here in July, just after radiation and in the middle of chemo) due to the fact that I needed some dental work done. My dentist thinks all those drugs are terrible and has some horror stories to back up his opinion. I think I'll just keep dancing around the topic. I take calcium and vitamin D and eat a healthy diet. I'm also very careful. I'm one of those \"older\" women who could wind up in a nursing home. Not interested. ",
      "MessageIndex": 777,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 17, 2015 08:04PM TuffMama wrote: Hello - I'm new to the site and having trouble getting around. I posted on another forum and was directed here - yea! I'm Stage III b. Had a BMX (Bilateral mastectomy?) December 20, 2013. Started chemo in Jan. 2014. I think I've finished chemo, but I moved after completing radiation in June/July, and this new place either can't find or never had my records. They're not sure whether I've had the proper number of Herceptin treatments or not. Anyway, I'm taking Arimidex now and wondering what happens next. Am I in remission until something else develops? Are there tests to check to see if the cancer has returned? I keep hearing rumors about certain markers that show up in blood work, but no one has mentioned that to me. BTW, I haven't figured out how to post all my data at the end. I had cancer in both breasts, three different types, the most dangerous of which was a large HER2+ tumor on the right. I had 12 positive nodes on the right and now have lymphedema in that arm. I would appreciate information on what I can expect - although I know no one really knows that. I guess I'm feeling a little lost after the routine and structure of chemo. I had a schedule to keep; now I don't. I feel at loose ends. Does that make sense? I don't know what to do with myself anymore. Thank you. Lynne",
      "MessageIndex": 745,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 19, 2015 09:53AM TuffMama wrote: 2Tabbies - I am relieved to know that what I feel is not totally off the grid. I didn't think it was, but where BC treatment is concerned, I tend to feel insecure until someone validates my feelings, as you did. Thanks for the great post. BTW, I have three black cats, all rescues. Friends have joked that perhaps that's the source of my troubles. :-) ",
      "MessageIndex": 759,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 19, 2015 10:40AM TuffMama wrote: Question: Does anyone taking Arimidex also take some form of treatment for osteopenia/osteoporosis? I'm on the fence about that. My onc wants me to start Reclast, which I took before BC, but it can cause serious side effects. On the other hand, Arimidex can cause or aggravate osteopenia and osteoporosis, so there is legitimate cause for concern. This is one of those areas where you have to choose the lesser of two evils, but I'm not sure I have enough accurate information to make an informed decision. Anyone?",
      "MessageIndex": 762,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 22, 2015 12:51PM TuffMama wrote: Wintersocks - Thanks. That sounds reasonable to me, and it also gives me a year under my belt, so to speak.",
      "MessageIndex": 784,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Apr 11, 2015 06:40AM TuffMama wrote: Katey - Ditto what's been said. I finished chemo in January. It's tough, but drinking lots of water and staying in touch with supportive friends and family will help you get through the worst spots. Best wishes. Lynne",
      "MessageIndex": 813,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 22, 2015 09:00AM TuffMama wrote: Where is the Start a New Topic button?",
      "MessageIndex": 782,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 18, 2015 02:25PM TuffMama wrote: Hi, Minus Two - that's clever. We have a lot in common with treatments and doctors. I have found a certified LE therapist about an hour away and have seen her a number of times. Unfortunately, the past week or so my arm hurts more and has become somewhat larger. I contacted her and will go back as soon as this snow storm is over and I can drive again. I bandage every night and wear a sleeve every day. I also do the LeBed exercises and self massage. Don't know what more I could do, but I also understand that LE follows its own course and does not always respond well to treatment. Thanks for taking the time to post; I really appreciate it. I will definitely visit the threads you suggested, and I'm already a fan of Step Up-speak out - oodles of good info there. BTW, before I moved here - E. Tennessee - I lived most of my life in the New Orleans area or in Baton Rouge. Visited Houston many times and used to have family there. Great city. Thanks for the welcome and the help.",
      "MessageIndex": 749,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 22, 2015 08:55AM TuffMama wrote: Magdalene51 - Ditto that. I know this is a stupid question, but do you begin counting your survival after the surgery, or does it start after you've completed chemo and radiation. The reason I ask is that someone said I was a year out; that's a year from the surgery, but I just finished chemo.",
      "MessageIndex": 781,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Mar 21, 2015 07:27AM TuffMama wrote: Welcome, newcomers. I continue to be short of energy after completing chemo - I think - in January. I said \"I think\" because at my last visit, the oncologist wasn't sure how many treatments I'd had. the clerical staff at that clinic is terrible. They keep saying they have never received my records - since August '14. All the other doctors have gotten the records, so I'm not sure what's going on. At any rate, I'm done with them and going to another oncologist April 1. My quarrel was never with the docs, but if they don't get what they need from an inefficient office staff, I'm not happy. I'm having lots of joint/bone pain and miserable hot flashes from anastrazole and really wonder if I really need it or if it was prescribed just because that's what \"they\" always do after chemo. I'm 75, went through menopause years ago and wonder just how much estrogen could be circulating in my aged system. I am going to have a frank discussion with the new onc, who is a woman, and may be more sympathetic to my cause. I'd appreciate input. Re the NED situation, no one has told me I'm cured. I think you're \"cured\" or whatever until you're not. I try not to dwell on what may happen down the road. ",
      "MessageIndex": 808,
      "PostDate": "21/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "TuffMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/211391/profile",
      "Content": "Feb 25, 2015 07:51AM TuffMama wrote: Wow. My doctors didn't even mention it. I had to ask. I still wonder if I'm getting appropriate treatment because my arm keeps getting bigger by degrees. I gather this is the way it goes sometimes, so I'll just keep on keeping on and hoping for the best. What else is there to do? Maybe Kathy Bates involvement will produce some real change in research and treatment. I hope so. Bless her.",
      "MessageIndex": 5,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/828681",
      "Title": "Kathy Bates discussing LE Luvmydobies glennie19"
    }
  ]
}