{
  "AuthorID": "tulips",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134576/profile",
  "Posts": [
    {
      "AuthorID": "tulips",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134576/profile",
      "Content": "Dec 3, 2011 07:10AM tulips wrote: I appreciate that this site has so many encouraging posts, since it is easy to get lost in fear at a time like this.  I had my first chemo on Wednesday, TC.  While I was in the chemo room, the oncology nurse gave me a list of vitamins to take, which included mostly B vitamins with suggested levels, plus vitamin E, fish oil, and magnesium, along with other remedies for neuropathy, which I have been told is a side effect of taxotere.  I went out and bought the amounts suggested, but now I have started looking around the web and worrying that these vitamins might interfere with the chemo's work.  Any thoughts? ",
      "MessageIndex": 23,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755819",
      "Title": "TC chemo- what can i expect? sweeney Anna2017"
    },
    {
      "AuthorID": "tulips",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134576/profile",
      "Content": "Dec 3, 2011 07:29AM tulips wrote: I know that you have a point--why would the oncology nurse give me a sheet of vitamins to take if they weren't useful and safe?  According to the net, people don't know everything about the subject of vitamins and chemo, but the nurse would be an expert more than most.  I have always been a worrier, not liking to take anything into my body, and this worry just caught my attention and stuck there.  Thanks for responding.  I hope everything goes well for you.  Tulip",
      "MessageIndex": 25,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755819",
      "Title": "TC chemo- what can i expect? sweeney Anna2017"
    }
  ]
}