{
  "AuthorID": "twiggy2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157220/profile",
  "Posts": [
    {
      "AuthorID": "twiggy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157220/profile",
      "Content": "Jun 6, 2015 01:19AM twiggy2 wrote: Most Important to help with the overwhelming process you are in the midst of - Call American Cancer Society & ask for the: PERSONAL HEALTH MANAGER - could not imagine how helpful this will be in this process. Has a binder with folders for: 'Dx & treatment', treatment center, appts & contacts, test results, medications, insurance info, resources, etc. All in one organized place! Was told they now have them at all chapters & also at Cancer Centers across the country. Wish so much it was available in 2007 when my journey began, it's amazing! Their number 800.227.2345 or Cancer.org - well worth contacting them. On to your original concern & hope this helps give some perspective. Neoadjuvant treatment worked great for me (at 47) & is the best option in many cases, especially those that are hormone positive (receptive). As far as surgeons, go with what feels comfortable, but the best do become involved early on for a extremely important reason, what is removed, by biopsy or surgery, controls what later treatment will be. Sometimes treatment is restricted by when surgery is done, depending on the exact cancer profile, as well as what other treatments are available. (I'm certain in my case, had I had surgery 1st, my course of treatment would not have been the success it was, because the complete staging wouldn't have happened before removing the tumor, thereby limiting the available information & treatment.) I know it's hard & scary, but now is the time to slow down & get ALL possible information & options laid out for you. Also, time to do research, you or someone you trust to help you, but PLEASE if possible, DO NOT go to appts alone, DO take notes or recordings & GET COPIES of results. Will be able to keep it all, nice & neat, in the Health Manager. Lol My Breast Surgeon is still very involved in my case, surgery was on 6/4/08, but she is the one that orders all my scans & no one need try to override her. See her & Oncologist at least once a year. My MO did try one time & she was not happy with him & let him know to never do it again! Lol (Not in a mean way, the meet weekly to discuss all their cases, she just wants specific tests done & as she wants them, ex. dye or not,) I love my team & don't plan to go any where else, they saved my life) It was not the 1st place I went. First, was same surgeon that did original biopsy & he wanted to do mastectomy asap & then send to MO & RO to discuss treatment. I called to ck on 2nd op at a major University hospital/NCI facility, they were affiliated with the hospital that did the biopsy, so getting the slides was no issue. They got me in within a couple days & my real staging began after meeting the surgeon, which she explained how & why it was done this way. Many far too long days of blood work, Bone Scans, PET scans, 3D mammos & many more I forget, including MRI guided breast biopsies of 3 more areas of concern, done by BS & no bruising. Did sentinel node biopsy which showed 1/3 cancer, which changed my stage & options for treatment, as well as being ER+, PR+ & HER2+. Discussed surgery then chemo & rad or chemo then surgery & rad, she then took me to meet MO, explaining where we stood on results & timeframe. WE decided to start with Herceptin for the HER2+, then start Chemo the following week, with the hope of good response & \"kill\" cancer. They scheduled for a week off, time for me to regroup & come back recharged & ready to fight! That in itself helped build trust, they wanted me rested & clear headed to move forward. It worked, by the end of Chemo 6 months later, there was no evidence of disease (NED) in tests. My surgeon, in her words said, \"It's time to go in & take out the trash!\", with a big hug! We did & she did a wonderful job. So thankful for listening & not jumping out of fear on the 1st surgeons suggestion. Don't know where you live, but If possible, go to a National Cancer Institute affiliated facility, can look up all locations on their site. A lot of people make fast decisions, just wanting the cancer gone & think get rid of the breast to be done, but it's not that simple. Many times, the breast is in a way, the least of the issue, genes, hormones, her2, etc, count as much or more! My opinion, the 2nd surgeon is giving you the better chance for the most options available for your long term treatment. Bottom line, that is what is important, knowing what the true picture is & deciding from there. Now there are so many more detailed tests available that weren't then, so don't hold back on asking for them to be done. Couple to ask about: Oncotype DX & Prosigna, they both look at multiple genes that can help direct treatment, now & at any time in future that may be needed. Others out there too! Wish you great luck & thoughts are with you. You will get through this, even though it's a dark time now, you will find light in knowledge! Prayers for your peace in what ever decision you make.",
      "MessageIndex": 15,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832248",
      "Title": "Neoadjuvent vs adjuvent - help!! mira845 Stephmoen"
    },
    {
      "AuthorID": "twiggy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157220/profile",
      "Content": "Jun 6, 2015 03:28AM twiggy2 wrote: Very sorry to say it, but I'd run from #3! May have people mad at me for saying this, but hear me out first, please. She's talking against known results of very good studies & in practice, of treating hormone positive cancers before surgery. It's not only possible, but probable to at least find out if will respond & exactly what chemo, hormone, biologic, targeted or any combination of treatments your specific tumor will respond to, invaluable information to have. Once a tumor has been removed from your body, will no longer have the opportunity to see the REAL results of various treatments on that specific tumor. They will not ever respond the same in a dish, dynamics have changed, so once removed, it's a game of chance to an extent, finding what will work. After removal, it's much harder to trace, track or otherwise screen for results of treatment, costing time wasted on treatment that may not work. With the tumor in place, it's fairly easy & fast to see,exact effect a treatment protocol is having, keeping in mind, this can still be fluid, but still better to see results. Please discuss this with the every MO, RO & PS you speak with. Very Afraid # 3 is operating on some older protocols, refusal to accept change or progress in treatments or flawed data. This is your life, do as you feel best, but you don't get a redo on such an important aspect of your treatment plan. Thankful the PS sees the need for an MRI, would still be asking for more staging to be done, NOW! Could you talk to #2 & get his take on this advice she has about hormone positive treatment? May want to check results from Clinical Trials, they're posted on NCI & other Trials sites, get an idea of real numbers. Also, please keep in mind, this organization has some stellar medical authorities involved in this community. They may be able to guide you to someone that may help with this situation that has left you confused about your diagnosis & treatment. Again, best wishes in your decision, it's a very hard time. Thoughts with you, also feel free to send msg if have any questions or comments.",
      "MessageIndex": 16,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832248",
      "Title": "Neoadjuvent vs adjuvent - help!! mira845 Stephmoen"
    },
    {
      "AuthorID": "twiggy2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157220/profile",
      "Content": "Jun 6, 2015 10:38PM twiggy2 wrote: Kayb, agree with you, but I was using \"chemo\" more in regard to chemical treatments, including hormone, biologic, targeted or other drugs. My main point was that doctor not feeling a MRI would be helpful. Doesn't sound as if all the staging tests have been completed that would help with her treatment plan with the best chance of success, NED later. That's of more concern, planning surgery without having the big picture, or knowing what her tumor was most likely to respond to best. Think we're both on same page with this, she's trying to make a decision, before having all the details needed to do so & feel confident in her full treatment plan. Sure we both know those that have been pushed for quick treatment out of fear by doctors that want to jump in and start cutting. I know I dealt with that & chose to go to the closest NCI facility to hear them out on the best plan of action, and very glad that I did, think it made the difference between my being able to remain cancer free for this long. Wishes to you for your continued good health!!!",
      "MessageIndex": 18,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/832248",
      "Title": "Neoadjuvent vs adjuvent - help!! mira845 Stephmoen"
    }
  ]
}