{
  "AuthorID": "TwoHobbies",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
  "Posts": [
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 18, 2015 11:38AM TwoHobbies wrote: Here is the study that caused me to increase my vitamin d, which is probably what Claire and nicevolvr are referring to. My last D levels were 31 even with several weeks of 4000 IUs, so I also supplement with real sun. http://www.medicalnewstoday.com/articles/273728.php",
      "MessageIndex": 53,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835778",
      "Title": "Vitamin D range...what is normal? tangandchris patoo"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 20, 2015 07:58AM TwoHobbies wrote: I think the concern with calcium has been heart and artery related. And I read a study that said supplementing with calcium did not preserve bone mass in women on AIs, nor does it prevent fractures. What are we to do, right? I was never good at taking it anyway so now I don't feel so guilty but I do take my vitamin D especially in the winter.",
      "MessageIndex": 56,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/835778",
      "Title": "Vitamin D range...what is normal? tangandchris patoo"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 23, 2011 12:29PM TwoHobbies wrote: There's probably nothing I can say to really make you feel better.  It's an anxiety promoting time, waiting for those results.  Hopefully you don't have to wait long.  I was struck by your statement of feeling totally alone.  I felt the same.  Even with a wonderful husband and family and friends, I am the one on that table, all by myself.  I have dense breasts too and was shocked I had cancer because I always had cysts and was used to that.  If you do have cancer, there are so many women out there that have been through the same thing.  You can meet many of them here and many will come out of the woodwork in your own life.  It doesn't feel as alone once you meet all the great women out there.   It's nice that the doctor explained what she was seeing.  You know that stage 0 is so early so if it is cancer, that is a positive.  Here's hoping for negative results but we'll be here if you need us!",
      "MessageIndex": 2,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769332",
      "Title": "Overwhelmed Luebbsgurl suzanneinphoenix"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 24, 2011 02:20PM TwoHobbies wrote: I'm sorry about your news.  We all know how you feel.  You can do this even though it may feel like you can't.  I said it feels like I got on a roller coaster and then the ride starts and I think maybe I can't do these turns, the drop is too high for me, but there's no way to stop.  But it will get better.  The first month for me was the worst, and then it gets easier. ",
      "MessageIndex": 5,
      "PostDate": "24/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/769332",
      "Title": "Overwhelmed Luebbsgurl suzanneinphoenix"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 11, 2013 06:40AM TwoHobbies wrote: I don't know what the protocol is, but when I had the mass in left breast,they did ultrasound the right. I had mammo first and maybe they wanted to look at right based on the mammo. Not sure. But I have very dense breasts. Two tumors could not be seen on mammogram so I wouldn't feel confident in mammogram for myself. If your biopsy is positive they will do more testing on both. If negative I would tell the doc you are not comfortable. Perhaps there's more explanation that we are missing. I am hoping for a negative result for you.",
      "MessageIndex": 5,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/810774",
      "Title": "Should I insist on ultrasound of the other breast? cactus cactus"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Mar 5, 2012 03:32PM TwoHobbies wrote: I think you still have insurance because you didn't have a break in coverage.  If you break your leg, you're covered.  However I think they are talking about your pre-existing condition period.  HIPAA (Health Insurance Portability and Accountability Act) is what you are looking for.   Here's some good information on this link. http://www.dol.gov/ebsa/faqs/faq_consumer_hipaa.html",
      "MessageIndex": 3,
      "PostDate": "05/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/783688",
      "Title": "any insurance experts out there? onvacation onvacation"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 24, 2011 08:02PM TwoHobbies wrote: I had bmx with flap reconstruction on Tuesday.  Came home Friday morning.  What I would tell anyone when you wake up from surgery is however bad yuou may feel one day, next day you will see good improvement.  Had some trouble getting comfortable at home, but by today I think I've found my sitting spots and sleeping spots, ",
      "MessageIndex": 160,
      "PostDate": "24/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 9, 2011 05:58PM TwoHobbies wrote: I am scheduled for bilateral with TUG reconstruction on April 19th.  Hope I made the right decision on both the bilateral and TUG but I really just want to go through this once and get it over with.  I don't think I can take the 3 hour mammogram and ultrasound session every 6 months and the worry of something showing up.     I had my SNB yesterday.  It was probably good for me to have a little practice surgery as I've never had any before and I am a little less nervous about the big surgery.  Not that I'm looking forward to it, but at least my irrational fears of not waking up have been diminished!",
      "MessageIndex": 102,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 15, 2011 04:47PM TwoHobbies wrote: Glad to hear of everyone's recovery stories.  Everything seems to be going well.  Beaglesgirl and Randy, I'm going under with you on Tuesday.  Don't really want to, but let's go girls.  .  .  Thanks everyone for the great suggestions on the hoodies and piillows, etc.  I'm making my shopping list for this weekend and its getting longer and longer the more I read.",
      "MessageIndex": 131,
      "PostDate": "15/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Feb 10, 2012 03:55PM TwoHobbies wrote: Plantlover, while we haven't yet used this option, I've looked a little bit into it because my son has a chronic disease that causes many missed school days.   I would recommend the parents check with the school and see if there is an on-line option available through the school district or state.  Some states do have online school programs.  Also might want to get connected with some homeschooling groups or parents, as they may use some on-line classes themselves.  I would think any on-line school would be fine as long as its accredited. Also, I will mention that this young person is probably subject to a 504 plan where the school has to provide accomodations for him/her, which could include home tutoring services. ",
      "MessageIndex": 6,
      "PostDate": "10/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782438",
      "Title": "Teen Struggling in School PlantLover 1Athena1"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Feb 14, 2012 04:37PM TwoHobbies wrote: Plantlover, I completely understand wanting to get out of the school system all together.  It is often so frustrating to deal with them.  However, if money is an issue, I believe this could be pursued further.  I did a quick google search and anxiety disorder seems to be covered under the Americans with Disabilities Act.  If so, the public school must provide an education and accomodations.      If someone wants to pursue this further, I would suggest a few things.  Look for info on 504s on the web, maybe go to anxiety disorder boards or organizations as they will be familiar with accomodations specifically to ask for.  Maybe talk to the teen's doctor about the problems at school and if he/she is familiar with 504 plans.  Find out who in the school district is charged with 504s and speak to that person.  It sounds like they want to be discouraging and don't want to do it, but it's the law.  ",
      "MessageIndex": 13,
      "PostDate": "14/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/782438",
      "Title": "Teen Struggling in School PlantLover 1Athena1"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 30, 2011 07:52PM TwoHobbies wrote: 10 days post-op and I managed to strain my calf so I can barely get up or walk.  UGH.  I actually took a vicodin today for the first time.  Plus I was hoping to get all drains out on Monday but two of mine will not fall under the output mark by that time.  This is when I am losing patience and enthusiasm for all this.  Ha ha, like I ever had enthusiasm. BeckyP I also feel cancer is a lonely journey.  I have lots of support too, but in the end, I have to lie on that table all by myself and be poked and cut open.  It's very helpful to know so many women have gone through it all too.  When I think I can't do it, I know others have.  And I know I spent so much time researching my surgery and reconstruction that I almost forgot I had cancer.  Now its back to thinking about cancer and wishing I could go out and run, bike, walk like everyone else.  . ",
      "MessageIndex": 187,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 17, 2011 01:46PM TwoHobbies wrote: Today is my 4th week and I'm getting around better but wow, I am still sore, sore, sore.  Of course it doesn't help that all I can take is extra strength tylenol but I will be so glad to get back to normal.  Faithfulhope, I too had an infedction and had to go back into the hospital for five days of IV antibiotics.  I almost had to come home on IV antibiotics too but luckily they found two oral antibiotics I could take.  They didn't take my infected site drain out until I left the hospital., Even though it had stopped producing much, they wanted to make sure anything that could come out did.  I finished my 10 days of oral antibiotics yesterday and am doing fine now.  Well I'm very sore but fine as far as the infection.  Melania  don't be afraid to call the doctor back and ask your questions.  That's his/her job.  Don't worry yourself if there's not a need to worry.  I can't answer your question but it seems positive that you had response and maybe it just takes more time.",
      "MessageIndex": 229,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 27, 2011 06:13PM TwoHobbies wrote: Randi congrats.  That is good news for sure. LuvRVing, Happy Birthday although of course it might not be your happiest.  I turned 50 in the midst of this diagnosis.  It sure seemed like a slap in the face, to hit that decade and find out you thought you were healthy but you're not.  But I'm not gonna let stupid old bc take me down.  Next year will be better. Lifelover I had a bad couple of nights because now my back is bothering me and can't sleep comfortably.  So I've had a bad couple of days but today I slept sitting up for several hours and feel a little better.  Hope you will feel better tomorrow.  I lose patience with the progress.  Everyone, I think we can forgive ourselves for feeling down, disappointed, unfeminine etc.  I have some kind of breasts and I do have hair as of now but I still don't feel pretty.  Can't shave my legs, paint my toenails, fix my hair.  Hey I can't hardly even shower.   I will try to remember it is not permanent.  ",
      "MessageIndex": 173,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 11, 2012 06:58PM TwoHobbies wrote: I think one of the issues is most of us in the throes of BC are on the threads that involve our current issue.  So when I was looking for my recon, I was totally on the breast reconstruction thread and you probably couldn't find me elsewhere.  Women in chemo most likely spend the majority of their time there.  Now that I'm done, I have my favorite topics and then occassionally I'll look through the active topics.  If I see someone I can help, I always do.   There are many threads I read and don't know the answer, or someone already answered so thoroughly I have nothing to add.  I've posted a couple of threads that didn't get much response.  Don't take offense.  It doesn't mean anything except no one who saw your post knows the answer. ",
      "MessageIndex": 15,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787324",
      "Title": "Alot of us in this topic forum dont get answers back? djones37 dogeyed"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 2, 2012 08:24PM TwoHobbies wrote: No, its not painful at all.  It feels funny, but no pain at all.  All the #$%@ we've been through, this one is easy. ",
      "MessageIndex": 50,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/786782",
      "Title": "Drain removal with no pain meds?! Stormynyte SerendipiTea"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jun 13, 2011 06:25PM TwoHobbies wrote: Everyone had great ideas and I won't repeat those great ideas but housework and yardwork would be a great relief too, and I don't think anyone mentioned those.   ",
      "MessageIndex": 9,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770222",
      "Title": "Help/Suggestions cyndesign TwoHobbies"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 1, 2011 08:34AM TwoHobbies wrote: Wow, I'm really sorry for such a long wait for you.  I had mammogram with ultrasound one day and biopsy the next, results the third, and I was a mess in that short period of time.  If you can convince yourself you don't have cancer, then go ahead and think that way.  Its always better to think positive if you can.  And then if it is, you will put one foot in front of the other to resolve it.  I'm sure they will explain the biopsy before they start.  I don't know if you'll.have exactly the same type of biopsy, but for me, they started by using the ultrasound to locate the mass.  They numbed me up with a local.  The apparatus that withdraws the sample has kind of a clicking noise and there's a click going in and click coming out.  So they let me listen to it to not be alarmed.  The whole time I was on that table I thought about cancer survivors to keep myself calm!   In my case, they didn't show me my pictures.  Mine didn't show up on mammogram, and I didn't ask to see the ultrasound screen, but I'm sure they would have showed me if I wanted to. The results were actually given to me by the radiologist and the nurse navigator, but I'm sure the set-up is different depending on your center.  They may send them back to your doctor and you meet with him or her.  If it is positive, there's a big group of women hear to help you through with information and encouragement.  Just take one step at a time.   ",
      "MessageIndex": 2,
      "PostDate": "01/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/775781",
      "Title": "Feeling Lost and disconnected dragonfly55 dragonfly55"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 10, 2016 05:57PM TwoHobbies wrote: Optimist, I had double mastectomy and still had a recurrence. Ayr, its a tough decision and your own decision to make. I just want to point out that recurrence after mastectomy does occur. I was originally scheduled for lumpectomy but had a second tiny tumor found on MRI and my other breast was on six month watch. I chose double mastectomy and reconstruction thinking I'm getting this all over. Lucky me I ended up with a recurrence in the skin despite a 16 oncotype, so then I had lumpectomy and rads. Having done both, I think I would lean towards lumpectomy and rads if you qualify. Of course there are medical reasons that many of us have that leans towards mastectomy: family history, more than one tumor, can't do radiation. But if those aren't present, in my mind the difference in odds of local recurrence are not great enough to warrant a mastectomy, and as noted, for years they have shown the same survival rates, and now there seems to be an advantage to the lumpectomy w rads, as Ruth posted. Although I'm generally happy with my reconstruction, and have no lingering problems, it is not a breast and it is definitely a harder route to go as far as recovery. So that's my two cents. Good luck with your decision.",
      "MessageIndex": 18,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839680",
      "Title": "Met with Surgeon - very confused now on what choice to make ayr1016 TwoHobbies"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 27, 2011 06:40PM TwoHobbies wrote: I just had BMX with reconstruction for the same reason you are.  I had two lumps in one breast, neither could be seen on mammogram, only one was found initially with the ultrasound.  I didn't want to spend my life wondering if I had cancer again and who/what would find it.  My sister in law came to stay and its been wonderful.  She helps manage my son and the dog, cooks does laundry and cleans while my husband helps me with drains, getting dressed, getting up, etc.  She has been a godsend, allowing my husband to concentrate on me.  Do any shopping you can ahead of time, including clothes you may need.  If kid's friends parents ask what they can do, ask them to get your kids out of the house a bit. If friends ask what they can do, maybe they can shop for you or bring a dinner.  That can leave your family to tend to your  needs. ",
      "MessageIndex": 24,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/768151",
      "Title": "I'm 39 with breast cancer, need advice mommyrnx2 waltersmith"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 10, 2013 10:33AM TwoHobbies wrote: Thank you, Mellie and Option on the BRCA info.  I will go ahead and do it since it seems you never know.  Welcome to the newbies! Ladies I saw some mention of tea tree oil and I just want you to know this may be estrogenic and I would be hesitant to use if you are an ER+ cancer.  I think the almond oil is safe.  I am using coconut oil and nail polish on my nails but no idea yet if it helps.  Grace, I would get started on the wig as soon as you can.  I had to go to three places and once I started chemo, I was in no position to deal with it.  In fact I recommend going to a wig shop that has hairstylists on staff or a hairstylist that can order wigs.  They are way better at telling you how to make your wig look normal than a retail shop with clerks, and can trim if necessary to fit your face.  I take Claritan anyway because I have allergies.  I wasn't pain free after the Neulasta, but of course I have no idea how bad it would have been without the Claritan.  One interesting fact about the Cytoxan, it stuffs you up.  I had the worst sinus pain even with my Claritan so I had to get some nasonex and hopefully that will decrease my pain round 2.  I have round 2 tomorrow.  I have to go lay in supplies since tomorrow I'll be back in chemo coma.   ",
      "MessageIndex": 209,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 28, 2013 12:00PM TwoHobbies wrote: Grace, the first two or three days I am tired with constipation starting and chemo fog.  The muscle pains start after that, and for me, the mouth sores came about a week later, but the second time I didn't get the mouth sores.  Daisy and Scribblin, sorry you are having such bad SEs. I did too, and I think part of the angst was not expecting it.  My husband says now I know what to expect, and that it will get better, so that did kind of help me roll with the punches.  Lark, sometimes I fall apart in front of my 16-yr-old.  At first I felt bad since I'm the mom and supposed to model strong, but I figured this is real life.  He does not seem any worse for wear and gives really good hugs and says he's already used to me without hair!  I think you'll find your daughter to be a comfort.  I also have a rash just on my hand, Soriya.  I think your onc will want to know about it.  Mine does not itch and they don't exactly know what mine is! Anyone else have something similar?  I personally think mine was caused by the steroid because I felt it get irritated when they ran the steroid.  It has been cold here in Illinois, 60 yesterday and I can see that I may need some kind of cap to keep me warm by September.  Does anyone have any ideas on a non-winter type cap, not too hot, not too cold, to just wear around the house or taking the dog out? ",
      "MessageIndex": 649,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 2, 2013 02:19PM TwoHobbies wrote: Momx2, I'm so sorry you have lost your mother.  It is never a good time, but this seems particularly unfortunate timing.  You are in my thoughts.  Lark, if I press on my eyebrows or under my cheek bones in the middle of my face and it hurts, that's sinuses.  I don't usually have any temple pain with sinus.  If you think it could be sinus, maybe you could ask if you could take a sudafed and if you feel better in a few hours, it was sinus.  It will take maybe a good six hours for it to help.  And Nocompromise is right, the claritin won't help unless you're taking Claritin D, which you have to get behind the counter from the pharmacist (at least in my state).  Another thing to try is steaming over a pot of water.  If that relieves the pain, it seems like sinus and you might want to try some meds.  For me, nothing gets rid of the pain except sudafed, which you're not supposed to use all the time, or a prescription nasal spray. Nasonex is my friend. Another thing to check is if your jaw hurts?  This could be TMJ which could cause headaches also.    Daisy don't be ashamed of the Xanax.  Glad it is helping you.  This is what medications are for.  It's not a weakness, it's your body chemistry.  It would be weak to ignore it.  2bluestars, I also feel like I have the neon sign, wig, wig, wig.  My natural hair is quite fine and this wig is not! I sat in the chemo chair yesterday looking at everyones wigs and to me, they all look like wigs, so we're not alone.  But I still feel better with it than hairless.  BTW, I am a NE Oklahoman by birth, and although we moved when I was six, I spend many a summer and spring break vising my aunts, uncles, cousins and grandparents.  Angela, I constantly see the girls with beautiful hair and I'm jealous, jealous, jealous.  But I also notice a lot of people's hair doesn't really look that good so they make me feel bettter!  LOL.  Maybe we will enjoy rocking the short hair. I love the breastbook moniker!  Has anyone's glucose gone up during this treatment?  I believe it is from the steroids but it kind of upset me.  I get certain labs right away, and then they send out the rest.  So I got the report yesterday and my last glucose was 130, and it happened to be a fasting glucose.  Another question for those doing rads.  When are you set to start post-chemo?  I have to do rads but I haven't been to the RO yet.  Guess I should schedule that. ",
      "MessageIndex": 803,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 21, 2013 08:05AM TwoHobbies wrote: Lark, we have probably all had those moments.  I know I have.  Everyday chores, whether it be getting the back-to-school in order or getting the AC fixed, are just overwhelming.  And to top it off, you didn't really get to enjoy your birthday.  It's hard not to get down.  Added stress, not feeling good physically or emotionally, and lack of fun is not a good combination.  Maybe you could think about a little belated treat for your birthday? NC, how is your cellulitis?  Also crossing fingers everything goes on schedule so you can make your trip. ",
      "MessageIndex": 1125,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 22, 2013 06:57AM - edited Aug 22, 2013 06:57AM by TwoHobbies No one was allowed to tell me I was half-way through until I got over the 10 to 12 days of misery!  I considered myself half-way through when I was sitting in the chair for the third infusion.  We have a lot of English and Scottish in my background and I think a lot of that mindset has been carried down for many generations!  My mom is mostly good but I could totally see her frowning on the public displays.  This morning I go for another infusion.  I dropped half my steroid prescription on the floor last night so I have one pill instead of two this morning.  I hope that is not an issue. I think my laptop might be dying so my communication may be sparse shortly, but I will be thinking of you all.  I can always use my phone but won't want to type much on it.",
      "MessageIndex": 1138,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 23, 2013 08:23AM TwoHobbies wrote: RealityCheck I have the same leg problem and it lasted all the way through treatment 3.  I spoke to the onc yesterday and she said its normal - just had another lady complaining about it.  Walking up stairs really tires me out and any kind of squatting.  A few days ago I had a good cry trying to walk up two flights of stairs and thinking I'll never be normal again!  Sick of it.  Just did another treatment and feel even more heavy legged this morning.  HVV: I personally have not heard of black tongue.  Don't be afraid to call the doc or nurse as that is what they are there for.  I have even e-mailed pictures to my docs of concerning things when its kind of far to get in to see them.   Lark, I'm glad you have gotten over your bad day.  I find a get-together with friends-not talking about cancer, works every time.     ",
      "MessageIndex": 1154,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 26, 2013 07:45AM TwoHobbies wrote: Jerigrace and Rambo if you can't continue working, please take care of yourself. What are they going to think? Oh jerigrace couldn't work cause she has a little breast cancer? No they are probably going to think i cant believe she worked that long. Soriya those dark thoughts can get to all of us. Just try not to let them stay. We are all taking steps to get the most positive outcome. Assume you will be a positive statistic. Hope those who are feeling bad will have relief soon. Glad to hear of tumors shrinking and other good news.",
      "MessageIndex": 1208,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 29, 2013 02:22AM TwoHobbies wrote: FormygrNddaughter there is some concern that antioxidants might negate chemo. I was told to only take calcium and vitamin D.",
      "MessageIndex": 1244,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 12, 2013 06:47AM TwoHobbies wrote: Marsha thanks for the tip on asking about the range of rads They give me my cream day one so that will remind me to ask. I better get shopping for comfy bras too. I have some sport bras so maybe those will work. And it sounds like you've got a plan for work. If you hadn't discovered this yourself, I found last time that working from home mid week is so helpful to my fatigue level. Sleeping an extra hour and not having to walk around really refreshed me. Hannariggs I think you have hit on a good method for raising your spirits. A study found people to be happier when they wrote how it could be worse rather than a group who wrote about how they wish things were. I read about that many years ago and it has helped me throughout my life. Now I haven't exactly learned a method for the worry and anxiety of cancer that comes sometimes. Usually I just try to distract myself. So if anyone has any better tips... Something I saw yesterday talked about not being a survivor but a warrior and I thought yes,I like that term so much better. A survivor could be by chance. A warrior had to fight. I think that fits us better. I'm imagining all of us standing tall in our armor with weapons in hand and perfect strong bodies of course. I just can't decide in my vision if we should be bald or have long flowing hair. I kind of like the idea of Angela in long flowing red hair but I think I look more badass bald.",
      "MessageIndex": 1357,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 18, 2013 01:15PM TwoHobbies wrote: Dfw that's great you can see results of the chemo-evidence that its doing something. Marsha if you we're approved for a longer disability period and want to go back earlier I think it could be a liability issue they are worried about. I don't think the accommodations go into effect until you are cleared to work. Soriya I have heard there is a theory on antioxidants being bad during chemo but I think it is mostly related to supplements. The instructions i was given is do not take anything other than calcium and vitamin D without asking doctor. I may have heard don't juice during chemo because that is really concentrating the nutrients. i can't imagine eating vegetables and fruit in normal amounts could be bad. I am pretty confused on what to eat or which diet to follow. My brother got me re-reading some books I have on low carb and its interesting that many native populations did not have cancer before coming in contact with Europeans and these books think it is related to grains and sugar. When I think about my diet that could make sense. I grew up in fear of heart disease because I have a very strong family history. What they told us was eat less fat and more grain. Now it seems that may be incorrect for heart disease and other diseases too. So anyway didn't mean to write a book but I decided to restrict carbs and make most of my carbs fruit or veg.",
      "MessageIndex": 1418,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 21, 2013 09:36AM TwoHobbies wrote: Marsha try not to let the work thing upset you although I should talk. I would be right there in the anger and anxiety mode too. I really think it's just a liability concern maybe they just don't know how to handle it. Maybe the walk and dancing will help. I'm sorry to hear of all suffering of my warrior sisters with the aches and pains. Taxol sounds similar to the taxotere. I love what Mellie said, that it's not easy like we were led to believe. I've been wondering why they downplay the experience of chemo.",
      "MessageIndex": 1441,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 27, 2013 11:00AM TwoHobbies wrote: Jeannie this does sound like a common thing and most likely will rebound. Your white blood count decreases with chemo. Mine went down to one from eleven. They gave me neulasta to up the WBC but I was not doing weekly treatments. Maybe some of the weekly taxol ladies will weigh in.",
      "MessageIndex": 1469,
      "PostDate": "27/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 30, 2013 07:39AM TwoHobbies wrote: I had read an article about the injectable herceptin when it was approved in Europe. The company was to meet with the FDA to see if additional trials needed to be run. So I don't think it is available yet but I don't know how far away it will be. It's pretty recent that it was approved in Europe.",
      "MessageIndex": 1478,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 18, 2013 06:06PM - edited Oct 18, 2013 06:10PM by TwoHobbies hey Donna. I'll be watching the game with you from home but I'll be rooting for the Bears. I'll forgive you though. At least you're not a Packer fan. Goodness grace I'm up there with you on being a hard stick. Of course my left arm always worked fine but can't use it now. I'm so upset. I have a fingernail coming off. It is split about 3/4 of the way down and extremely detached. I have a bandaid on it but I know that won't help long term. Isn't this going to hurt a lot. Damn chemo. I'm just getting my hair back and now my nails are falling off",
      "MessageIndex": 1588,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 20, 2013 07:43AM TwoHobbies wrote: Donna I completely get it and its not selfish to do whatever you have to for your mental health.  I am similar in that regard.  I did some one-on-one therapy at the local cancer center round one.  They wanted me to join a support group but warned that most were a lot worse off than me.  I decided it was better for me to not think about it week after week.  If I don't hear the bad stories I am more positive.  I even got off these boards and just lived my life.  When I got the recurrence I was still glad I had spent that time not thinking and worrying about breast cancer.  Now I have to learn it all again-moving on and nor worrying about distant recurrance.   I remind myself that  my cousin is a 28 year survivor.  So try to focus on the roomful of thriving survivors and others you've seen in life surviving and even public figures who had breast cancer and are still living.  There are more surviviors. Lets plan on being in that group.   ",
      "MessageIndex": 1595,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 25, 2013 07:03PM TwoHobbies wrote: Hugs to Cherri and anyone else who needs them.  Cherri its perfectly OK to cry and sometimes you  just need to.  I hope in between the bad days you have some better days.  If not, do not be afraid to ask for antidepressants.  A good many are taking them.  I lost part of a second nail today.  At least it doesn't hurt as much as I feared.  Try to be extra gentle with them, but alas I failed at keeping them attached.  This one broke putting on my jeans.  Angela, I suspect you just need healing time as far as going back to nursing.  But there are always nursing jobs in the business world too.  Maybe you can try to find something outside the clinical world.  2Bluestars, someone on another thread mentioned they put a private facebook group together after chemo was done.  That would be a good way for us firecrackers to remain friends but \"move on\" from the reminders and other threads that can put you in a bad mood.  I'm not exactly familiar with setting that up, but I'd be happy to figure it out if others are interested.  I would love to keep in touch with the group but I'm not sure if I do want to be on this board for a long time.  You can \"accidentally\" run into stuff that ruins your day! And I second the \"thanks\" to everyone for hanging with me through this ordeal.  BC is a very lonely disease because even if you have family and friends, its you alone on that table, alone in the chemo pain, etc.  Its been great to have buddies who understand and lift each other up as we need it. ",
      "MessageIndex": 1626,
      "PostDate": "25/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Nov 5, 2013 01:15PM TwoHobbies wrote: maybe there's something in the air because I'm having a bad day too. I go to the doctor today to get my ovarian suppression and yes, it just feels never ending. I was so glad to be done with chemo and now I'm worried how I'll feel on the next meds. Everyone thinks I'm done but it's really not. I just want to cry. Hannariggs, girl strong, Soriya come on over to my house. I'll make the drinks we can't have if someone will bring the Kleenex.",
      "MessageIndex": 1664,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 11, 2013 02:39AM TwoHobbies wrote: Hahaha love that JeriGrace. Let's see mine looks like this. Cut, rearranged, nipped, cut again, poisoned, burned, and neutered. Geez they call this medicine? Someone should be going to jail!",
      "MessageIndex": 1802,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 14, 2013 02:45AM TwoHobbies wrote: Hugs to you Angela. You're near the finish line. Just a few more days! Be kind to yourself and know that you will feel good again.",
      "MessageIndex": 1828,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 27, 2013 03:40PM TwoHobbies wrote: Yes Soriya, I had the same problem with the scary pain.  My ob/gyn recommended astroglide as she said it had a good PH.  I still had some pain with it, so now I'm also using replens two or three times a week which is to replace moisture in general.  The ingredients are mostly glycerin I noticed.  As for libido mine has come back some as I feel better and more normal, but it still kind of comes and goes. Spontaneity is pretty much out as it takes so much preparation so I feel like I'm defective and that doesn't help your mood or desire any either.  Maybe that will get better or maybe we'll get used to the \"new normal\". ",
      "MessageIndex": 1868,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 28, 2013 07:26AM TwoHobbies wrote: No these are both over the counter.  I got them at Walgreens.  If these don't help enough ask your doctor.  Believe me it won't be the first time they've heard it, and  I think there's additional things you can do.    Here's a thread that I had found a while back.  Thankfully she put a funny title or I wouldn't have remembered.  http://community.breastcancer.org/forum/67/topic/759583?page=3#idx_82",
      "MessageIndex": 1870,
      "PostDate": "28/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 18, 2014 01:41PM TwoHobbies wrote: NC I was just reading and seeing pictures.  It sounds like they have a lot of repair work and it could be a while before you get power.  I'm so glad this didn't happen when you were going through chemo.  As miserable as it is, that would make it worse.  We had a power outage that latest a day and a half this past summer and I was hot and sticky and spent all night lying there planning what hotel I was going to the following night so I can only imagine how unpleasant it is to be without power for 6 days.  UGH.    Stay safe. ",
      "MessageIndex": 1920,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 7, 2013 02:17PM TwoHobbies wrote: Hello, ladies.  I see a lot of you are starting your chemo on July 11.  I'll be doing my second on July 11 so I'll be thinking of you while I'm in the infusion room! I had a pretty hard time with round 1 so I would just say if it hits you harder than others, I can sympathize and just roll with it and don't think you are weak.  I thought it was going to be 3 or 4 days of feeling bad and then I could cope.  I was planning on going back to work on Monday morning.  Well there wasn't a chance and I felt kind of guilty and like I wasn't as strong as others until my onc had a good talking with me.  So I have released that idea and will let my body heal in its own time.    Has anyone heard if that Brian Joseph's stuff has worked for others?  I wonder if it helps if you didn't start it at first chemo?  I have one bare spot in my eyebrow now so I need to get out and at least get an eyebrow pencil.  Had the wig ready but nothing for brows or lashes.  I'll pass along my cure for constipation which is broccoli salad and cole slaw.  I figured those are supposed to be cancer fighters anyway so I just eat one or both every day and it has helped more than all the other stuff I tried.  Marsha and Baby Ruth - I am a local recurrance and I wondered if you know the plan for your hormone therapy following this lovely round of chemo.  I was on tamoxifen and they will probably suppress my ovaries and switch me to an AI, although I don't know which one yet.   ",
      "MessageIndex": 131,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 7, 2013 06:46PM - edited Jul 7, 2013 06:50PM by TwoHobbies Rambo, if you can wait to decide on teaching next semester, I would suggest seeing how you feel after you start treatment.  I would think you'd have a good idea whether you can handle it or not.  BTW, I also got cancer for my 50th birthday, and then I got it again for my 20th wedding anniversary.    Mellie, I bet your onc will sign for what you need.  At my one week follow-up, it was actually my doctor who brought up whether I'd been able to go to work or not.  Based on my description, she said I should apply for disability.  Now I'm waiting to see if the disability insurance approves it or not.  Aaoaao, you have developed a good attitude.  I need to work on reducing my everyday stress.  For some reason I have coped with the cancer and am just doing my treatment and assuming the positive, but I let other stuff bother the heck out of me.   Rambo, there's a LGFB I found in August, but I was going to see if there's another at some other location earlier than that.  Gee, I'm such a low maintenance girl, I hate to have to do eyebrows and false eyelashes every morning.  Plus it will use up that time I was saving on no hair styling! ",
      "MessageIndex": 137,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 8, 2013 05:15PM TwoHobbies wrote: Welcome, lesmdes.  Sorry about the coinciding twos and the memories it brings.  Both of my cancers have been close to milestones in my life (50th birthday and 20th wedding anniversary) and also tragedies in the news (Japanese Tsunami and Moore Tornado).  I don't know what that means!   Marsha, I mis-read your dx on the second tumor.  I thought it said ER+ PR+.  Need to get my eyes checked! Has anyone met with a cancer geneticist?  I am wondering if it is valuable or do you just skip to the BRCA test?  I have been on the fence about it.  I do have some family history but not considered strong (third degree relatives) and no ovarian cancer.  So I feel it will be negative but perhaps I should find out.  ",
      "MessageIndex": 157,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 20, 2013 09:24AM - edited Jul 20, 2013 09:27AM by TwoHobbies Sweetheart, that's interesting about the anemia.  My hemoglobin is a little low every time they do labs so I wonder if that is the issue for me also.  That's good to know.   Angela, all those emotions you are having we've all been through.  It gets better at some point but its totally normal to go between fear and anger and sadness and then back again.  And yes, I felt like cancer was a series of good news and bad news.  The truth is you just don't know 100% until they take the thing out and do the pathology.    I'm about 2 weeks into the hair loss.  I had long hair my entire life.  When it started to shed more I cut it in a bob as I always wanted to see what it looked like on me.  I actually liked it.  So as traumatic as it was to lose my hair, I feel kind of free of it now.  No one at my house seems upset by it, why should I?  I'm kind of looking forward to having a short hair cut in six or eight months and probably going to do a new color, too. P.S. Angela the steroids don't give you moon face if you only take them for three days, and the dose is much lower than what would give you moon face.  Don't worry about that.   ",
      "MessageIndex": 446,
      "PostDate": "20/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 11, 2013 09:00AM TwoHobbies wrote: Thanks, Vilia for the link.  I'll check it out.  Puppymama ours is about 2K a year too, but is still cheaper than some I checked on.  Sorry I can't help more as I am a newbie wading through this too.   Rambo, I have low hemoglobin too.  Slighty low before chemo, lower after first, then improved slightly after 2 but still not up to pre-chemo level.  However not so bad as to need a transfusion.  While I did try to eat a little more red meat than I normally do, I don't know if that was the key or if it recovered on its own.   And I have been  for massage, but I don't have a port.  I usually do swedish massage which is gentle, and I tell her what spots not to touch.  GMA, I am one who had pain 1st neulasta, very low low back, but no pain subsequent shots.  Although I also did switch to ibuprophen from tylenol second shot, so maybe that is the difference.  Lana I am eating too much.  Is that the steroids?  One day I'll want nothing but junk food and then the next I only want salads, but overall I feel I'm eating too much.  I just spent the spring losing 10 lbs and I don't want to gain it back.    NC come to my house if you feel like cleaning!   Ok maybe you motivated me to at least run the vacuum in one room.  Maybe.     Angela, if you have distention and vomiting, that could deserve a trip to the ER, but it sounds like you are on the mend.  Pretty scary.  I think my few good days are going to be taken up with chores.  My dog is sick and needs to go to the vet.  My contact lens prescription is done so I'll have to hit the eye doc.  Need my wig trimmed, etc, etc.    ",
      "MessageIndex": 963,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 11, 2013 02:28PM TwoHobbies wrote: JeriGrace, good idea on the contacts.  Maybe I'll ask them for one more box till I get done.  Honeybunny I've heard a lot of people say they buy a wig, wear it once or twice and that's it.  So if you love the scarfs, why bother? I'm sorry you are having a bad day.  Sometimes even sleep doesn't relieve the misery, does it?  At least keep up with your liquids.  Welcome, KTLe.  I had two tumors and neither showed on mammogram.  Couldn't even find one w/ultrasound to do the biopsy.  So goodbye breasts.  I couldn't see feeling comfortable every six months that I was clear or not clear.  I definitely see the need to simplify too.  I love gardening and have a lot of garden beds, but I'll be darned I'm going to seed over two of them next year with grass as its' too much work.  The weeds have taken over and I didn't love the stuff that was in there anyway (from the previous owner).   Hi, Stonel.  I learned that hoping you will feel better by a certain time has nothing to do with when you'll actually feel better!  So take care of yourself and it is what it is.   You will feel better at some point.  It just varies from person to person.  ",
      "MessageIndex": 971,
      "PostDate": "11/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 13, 2013 10:01AM TwoHobbies wrote: I hope everyone is having a good day, or at least tolerable.  Rambo, if your first wig is too big, you can take it up a little.  My wig lady gathered about 4 wefts and put a stitch in each \"band\".  Not sure if that is the term, but the bands that run vertically.  This is done about 2 inches from the bottom piece in the back.  They don't always do scans, but I'm not sure of the exact protocol.  I didn't have any the first time because I had no nodes involved.  I am here because it came back in the skin of my breast, and then they did do a bone scan and CT scan.  All clear thankfully. ",
      "MessageIndex": 995,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 16, 2013 02:33PM TwoHobbies wrote: To all, I'm so glad you are all here getting us through this journey.  Yesterday i was down and stressed, and I come here and I feel better and not alone.  Sweatheart, it sounds like the RO is a little authoritative with no bedside manner which we really don't need, but I think the concern is that the cancer was on/near the muscle so they want to take extra precaution.  Based on that, I would be inclined to do the radiation.  Second opinions are always good.  Even if they say the same thing, you won't feel conflicted, and maybe the second doctor can explain it better.  If you can avoid going through this a second time, you'll thank yourself.  I'll be doing radiation.  Come on with me, we'll do it together. HVV, I like your \"holding its head under water\" phrase.  That gives me a good visual.  Let's drown that %$&@!! Lana, my chemo regimen is different than yours, but round 3 was overall no worse or better than the previous rounds.  I lost some eyebrows and eyelashes after round 1, but it hasn't gotten worse after 2 or 3.  I think the eyebrows I lost were ones I had plucked in the past.  So I just have one \"hole\" on one side.  And then my eyelashes are thin, but on the right I also have a \"hole\" in the lash line.  So not too bad.  Now, my nails are still here and growing but my nails hurt so bad.  They started to hurt after round 2, but after 3, they hurt really bad.  I'm at the point where if I bash my nails against something, it hurts so bad I could cry.  I try not to use my nails for anything.  I can't even pull the cellophane off a package. NC, there's no rush.  I have a friend who had UMX and no recon.  She said the only thing she doesn't like is the prosthesis is hot in the summer.  I know someone who went YEARS and then did it.  She said she didn't want any more surgery  and she was busy with her young kids.  Not sure what to do about the husband. but maybe he'll just get used to it.   Honeybunny, that's what I figured on work.  This is my time to beat cancer and I need to be as rested as possible and focus on that.   ",
      "MessageIndex": 1052,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 20, 2013 09:00AM TwoHobbies wrote: Happy Birthday, HoneyBunny!  JeriGrace, glad you escaped the hospital.  Momx2, you can be down, but don't be defeated!  That's not allowed.  KTLe, its great to have a friend who can make you laugh.    Lana, can relate to the too tired to go to a cancer program.  We have a center with so many great programs but getting there...Has anyone else been to a cancer support group?  I've never been sure if its for me, and just wondered if anyone had been and what they thought.  I have learned how important sleep is.  I had been feeling pretty good over the weekend, even went shopping for a birthday gift on Saturday.  Didn't sleep well Sunday night and yesterday I was so weak and miserable.  I'm near the end of week 3 so I shouldn't feel like week 1.  It was actually disturbing that there might be something wrong, but I hope it was just the poor sleep.  I have a hairless story.  I'm walking my dog at the park and just wearing a baseball cap and a little boy about 5 is saying how cute my dog is, what's his name, etc.  He looks up at me and pauses mid-sentence for about 4 seconds, then just keeps on talking.  I wanted to hug him for noticing and then deciding it wasn't important and just going on with the conversation.  The same trip I was washing my hands in the bathroom and a woman walked in and got startled.  Gee sorry I'm so scary.  Maybe she thought I was a guy!    ",
      "MessageIndex": 1101,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 29, 2013 02:16AM TwoHobbies wrote: Angela I think you answered it when you said she is bitter. She's not thinking of you. That could' be from being unaware or selfish or maybe even revengeful. I probably would be in the same boat if my stepson was still school age.",
      "MessageIndex": 1243,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 17, 2013 03:08PM TwoHobbies wrote: Lark I have an itchy spot on my back and my chest both. Nothing I've tried has relieved it. I was on different chemo than you but I believe it is related to that. Hugs to all.",
      "MessageIndex": 1403,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 30, 2013 01:28PM TwoHobbies wrote: Donna I seem to recall the nipple surgery recovery was pretty easy and I was actually more excited to have them than I expected. I hope you have an easy recovery too. I can also relate on the worry about it coming back again. I'm trying to assume the positive since today I have no evidence otherwise. My plan is to keep busy and enjoy myself as much as possible.",
      "MessageIndex": 1480,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 5, 2013 08:47AM TwoHobbies wrote: Grace I don't know if it's the steroids or chemo but I had that too. It seems to last for a few days and then the following week I thought my skin looked better than before chemo. Congrats on getting one down.",
      "MessageIndex": 1495,
      "PostDate": "05/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 30, 2013 10:07AM TwoHobbies wrote: Lark and Angela, I found a lot of my headaches was sinus pressure.  The cytoxan can cause this.  I got a prescription for nasonex and this helped a lot the second time.  JeriGrace I'm so sorry you ended up in the hospital.  I also developed a UTI but it seems I was able to catch it early, fingers crossed.  I hope you are on the mend and feeling better. Vilia I also went through a period week 2 when I'm just starved and can't seem to eat enough.  Went up about 5 lbs but I've been better for a couple of days and down about 2.5 again.  Poconos I'm glad you found a new doctor who has some ideas on how to get you through treatment and we'll be hoping for success for you. Realitycheck if it turns out your insurance does not cover a wig, TLC direct has more reasonably priced wigs than the shops or other wig websites, although not quite as much variety.  I'm in for another treatment on Thursday.  Have to get my pre-chemo chores done - pick up steroid prescription, stock up on groceries and get gas.  I'm getting used to the routine!",
      "MessageIndex": 707,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 16, 2013 12:18AM TwoHobbies wrote: Rambo that's great news about your daughter.  What a relief I'm sure that is.  Hanna you tell 'em.  Till you've walked in our shoes, you can stop the pep talks.  I'm pretty sick of hearing how strong I am too.  Uh, what's my option?  Mellie, I am doing the fasting too.  I didn't round 1, but round 2 I did 24 hours before and 24 after chemo.  Round 3 I did 36 before but only lasted about 3 hours after.  (Took my son for pizza - silly me).  I don't know if I'm doing it long enought to make a difference, but 48 hours before and 24 after seems daunting.  I've been wondering what is in the chemolieve they are using.  I had immediate reconstruction and it never really felt like I had lost my breasts, just that they had been operated on.  I'm glad I did it, but don't have anything to compare it too.    ",
      "MessageIndex": 1038,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 20, 2013 03:08PM TwoHobbies wrote: Mellie, I vote rest and enjoy your mom.  JeriGrace, not all pharmacies compound.  There are some in your area that I know do compounding.  I sent you a PM.  Also, thanks for the recommendation to call my eye doc about the contacts.  I did, and they couldn't authorize a full prescription, but ordered me two months of trials to get me through.  So glad of that.  Marsha, I hope you can safely and comfortably get to the camp to pick up your son.  I know that would be a hard day for me to do it.  Could there be another parent coming somewhat close to your area that could drive him part way?  I know we brought home another boy one time whose mom was sick.  And I was thinking about sleep medicine or anxiety medicine after that sleepless night because I think you (or someone) mentioned it before.  My sleep problem is mostly when I'm working, so I may consider that when I go back.  Otherwise I may not make it through the day.  One more semi-good day for me and then chemo again.  I dread it as much as everyone has mentioned!",
      "MessageIndex": 1105,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 23, 2013 08:57AM TwoHobbies wrote: Thanks, Angela.  And no apologies needed on response time.  Hope you feel better today.    Yes I know its highly contagious.  When my son was in the hospital he could not go out of his room and everyone had to wear the yellow smocks to come in the room until his tests came back - negative thankfully.  It seemed like she went in the bathroom to do some test and then I went in afterward and then the nurse was telling her later she had c-diff.  She was already on flagyl so I don't know if that makes a difference but I personally thought it was handled inappropriately. ",
      "MessageIndex": 1156,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 31, 2013 09:45AM TwoHobbies wrote: Lana I don't know if I've ever seen that topic covered on whether or not the bald look is professional or not. Honestly I think if you're dressed professionally and have your makeup on you're just as professional. Remember when Melissa etherridge did the awards show bald? I love that she just got out there and flaunted it and that's what I'm thinking about you right now. You're a VP so set the tone for others below you. Yes I had chemo and I'm still a strong capable woman. So my last TC I believe I had a bit of a reaction. Had a fever of 101.3. They thought I was getting sick but I did not and now I have a red itchy patch near the injection site. Aaoaao did you lose power? We had horrible wind and lost power from evening till 10am. Sure made it a miserable night. I think it was my sons first experience without electronics for more than 12hours. I told him how we used to tell ghost stories and play cards when the power went out!",
      "MessageIndex": 1272,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 11, 2013 06:44AM TwoHobbies wrote: Ladies I just wanted to mention there is a recall on some chobani yogurt for mold which they state may not be good for those with compromised immune systems. They have a code 16-012 on the top. I had some of this and thought it tasted funny so luckily I only had one bite. Welcome DonnaD. I'm kind of in your boat on the second time around thing. Two years after surgery I had a small mass in the skin. This is my first lovely experience with chemo however.",
      "MessageIndex": 1350,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 13, 2013 07:14AM TwoHobbies wrote: Cherri I had the same problem with my last infusion and it did last longer than normal. Do you have an external medicated cream you are using? I rinsed with water only throughout the day. Then apply the medicated cream or petroleum jelly or baby rash cream as a barrier. NC being mom doesn't stop just cause you're in chemo. Sometimes I want my teen to be more independent but it is nice to be needed! Stay strong warriors",
      "MessageIndex": 1378,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 23, 2013 09:57AM - edited Sep 23, 2013 10:20AM by TwoHobbies Lark sorry you are feeling bad. I can't advise on the blood transfusion but like you I'd probably want to try the iron first. I had low hemoglobin before chemo and low during and I had fatigue during chemo but not before so how much will the transfusion help I wonder. But only you can judge how bad you feel and go ahead if you can't stand it. Sometimes when I couldn't do much we would go out to pick up food or go for an ice cream and it helped to get out of the house but not have to get out of the car or not for long. Glad to see there are other gardeners. My flower beds are a mess of weeds and I don't think I'll get them clear before winter. I can only work about 15 minutes at a time and I used to go for hours so that is scary. Oh well maybe next year.",
      "MessageIndex": 1448,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 12, 2013 11:53AM TwoHobbies wrote: Woo hoo Donna. That is good news and try to assume it will stay that way. I know it's hard as I still have moments of shear panic despite my big talk. But you are right. If we dwell and worry then that's some precious moments lost. Angela thanks for the cosmetics recommendations. I think I'm going to check out the eyelashes as mine are so sparse they look kind of funny with mascara because there are spaces. If eyelashes will last four or five days it's worth it. It seems lashes are later to come back. I have quite a head of 1/4 inch hair but lashes continue to fall and brows still sparse. Congrats to all who are finishing up. Celebrate that you made it and will be feeling better soon. I know it seems impossible now but you really will.",
      "MessageIndex": 1530,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 12, 2013 12:55PM TwoHobbies wrote: One of my facebook friends posted an article about preventing breast cancer and I can barely hold my tongue. You know breast cancer can be prevented if you stay a healthy weight(check), exercise (check ) and drink less than three drinks per week (how about three drinks per year). I'm so aggravated. Would you ignore it or comment?",
      "MessageIndex": 1531,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Nov 2, 2013 10:11PM TwoHobbies wrote: I have hair but it's short. I'm about 2 1/2 months past last treatment. It's pretty filled in now and dark except for the gray. It's such a relief to see it. Eyebrows are also coming back and my eyelashes too. Warning the eyelashes continued to fall after chemo. I only have two or three left on each eye so I'll be glad when the sprouts grow longer. I still also have some aching especially in the rainy weather but it's way better than during chemo. Rambo I love those mammograms. What are the breasts? Such a cute idea but I guess I shouldn't take them to the office party. I never have felt inclined to purchase the\"pink\" gear but today I was looking for a hoodie and underArmour has one that says \" she's a fighter\" on the sleeve. I had to have it. It's funny how each situation affects us differently. JG many feel the same as you during rads but I had no distress at all. In fact I kind of enjoyed the rads experience. Mine they played music and had pictures of the sky and trees on the ceiling. Maybe that helped. But put me in the mammogram waiting area and I have an anxiety attack.",
      "MessageIndex": 1653,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 11, 2013 01:57PM TwoHobbies wrote: Girlstrong I love the rat poison reference. We have to laugh right. My cousin called it brassy humor. JeriGrace now I feel like Charlie Sheen. WINNING! Soriya someone in a thread mentioned your nose runs because of nose hair loss. I guess that makes sense? We always have that problem up north due to cold winters. Lana forgot to say I love your Halloween picture. What fun. I hope all that are recovering from surgery will have smooth sailing.",
      "MessageIndex": 1806,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 11, 2013 06:06PM TwoHobbies wrote: Soriya I think this is just saying if dr felt on physical exam that nodes were positive that they could need to come out and not rely on sentinel node. For instance my dr said node was soft and unlikely to be affected and SNB agreed. But take this to your dr and he or she can fill you in. JG I felt a little sad finishing rads plus my doctor left the hospital so I feel abandoned but there seems to be plenty of follow up with my BS and MO. I go monthly for zoledex so maybe that's why I still feel someone's watching me. Now is our time to watch our diet, exercise and take our meds every day, if applicable. Angela the skin healed pretty fast after rads were done. I didn't blister until after but was extremely red or purple. Within a couple of weeks the blistering healed and I was just tan looking. Hang in there. Rambo I feel for you doing another surgery so soon. And my eyebrows and lashes continued to fall out. Eyebrows have been normal now fir a while. Eyelashes are thick but still too short to bother with mascara. Grace I had white hairs coming in about 3 to4 weeks after last chemo. They were barely there but there. This is the chick down everyone is referring to. I might have barely an inch of hair now and my last chemo was late august.",
      "MessageIndex": 1812,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Feb 3, 2014 07:05PM TwoHobbies wrote: Hey all good to see you all.  I wondered what you thought about keeping in touch and what would be your preferred method?  1. Stay on this thread 2.  Move to a different thread. Ie firecrackers hang out or other moving on threads.  3. Facebook group or google or twitter or something else 4. Old fashioned email.  5. other suggestion?   6.  Just want as far away from you chicks and these memories as I can get.  Don't be afraid. That's OK too!   Yeah. Soriya on the clean scan.   I don't know how to move on from that worry. I obsess about diet and exercise and it keeps me sane part of the time but every new ache and I think mets.  ",
      "MessageIndex": 1929,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 30, 2013 12:04PM TwoHobbies wrote: What a year, huh, firecrackers?  Congrats Hanna and JG on finishing and you vacation to celebrate.  Congrats to all those finished and approaching the finish line.  Those who will continue treatment into the New Year, hang in there and we'll just celebrate again when you are done.   I am so glad to have spent this year with all of you but only wish to repeat the friendship!  I read that you wear green underwear on New Year's to have good health, so I'll be wearing my mint green undies just in case, and hoping mint green is green enough.  I also plan on opening the back door to let the old year out and the front to let the new year in.  Probably more importantly I'll be dedicating next year to all-around good health.  Tweaking diet and more exercise, yes, but some other things that maybe I never paid much attention to such as less stress, more friendships, more play, more hugs, more fun, and maybe even more sex! ",
      "MessageIndex": 1881,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 9, 2014 06:42PM TwoHobbies wrote: Hanna glad you got good news on the check up! I think it's hard to tell what is causing the tiredness but yes I am exhausted mid week. It can be surgery. Maybe it's the chemo of the hormone therapy. I know I'd feel a lot better if I worked part time instead of more than full.  In my dreams. I had a lot of achiness but recently I think it is better.  Could be time or could be gabapentin. . Maybe it's my yoga loosening everything up, improving my lymph flow and my chakras or chi or something!  But I'm still so darn tired!",
      "MessageIndex": 1946,
      "PostDate": "09/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Mar 22, 2014 12:56PM TwoHobbies wrote: I have totally changed the way I eat, although looking at all the studies, there does not seem to be an answer to how we should eat other than not gaining weight.  But I decided if diet would help in any way, the way I was eating didn't work, right?  So I am amost no dairy, almost no grains or potatoes and cutting out added sugar.  As a result I also eat a lot more vegetables and fruit.  I didn't drink hardly at all before, just a few times a year, so that's not an issue for me, but when I do drink I try to make it a red wine or a sangria that includes red wine.  I'm trying to exercise more as it seems every time I go to the doctor she says they've increased the recommendation.  It is still a challenge to get to the amount I should be doing.  Mostly I am trying to focus on reducing stress or helping my body handle stress better through meditation and yoga and happiness and fun!   I think that maybe your immune system doesn't work as well under stress. so the cancer cells got a chance to grow.  This part has actually been the hardest and is very much a work in progress.    ",
      "MessageIndex": 10,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/819360",
      "Title": "Anyone make lifestyle changes? Footballnut vbishop"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 16, 2013 09:25PM TwoHobbies wrote: Hello Ladies.  I'm catching up a little.  Had my second chemo Thursday and can't say this one was easier.  I would rate it about the same, which is better than worse, right?  Extreme tiredness.  I slept day after from 2 to 7 pm.  Fogginess that I hate and then the muscle aches start.  I ache from my jaw all the way to my ankles right now.  Mouth is starting to get tender but no sores yet. I did get mouth sores last itme and I'll weigh in that the biotene works better than the salt and baking soda wash.  Also I found an extra soft toothbrush and switched to kid's strawberry toothpaste as the minty toothpaste was really bothering me.  On hydration, my doc recommends 8 cups per day.  The main thing I have to concentrate on is not waiting too late in the day to start drinking or I'm up all night.  Also, I would recommend not waiting until you feel bad to take your medicines, take your naps and eat.  All of those will make you feel really bad if you wait too long.  Sometimes I don't really feel like eating but I can tell my body needs to eat and I feel a little better afterward.  The only other relief I find is taking a shower or bath.    Hang in there, everyone.  I'm not feeling much like a firecracker but proud to tag along amongst the firecrackers.  ",
      "MessageIndex": 343,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 7, 2013 01:23PM TwoHobbies wrote: Hello, ladies!  What a blur this summer has been doing this chemo thing.  I see ads for back-to-school and it seems unreal it is August.  Apparently time flies even when you're not having fun! Sorry for all those just losing your hair.  Yes its traumatic but you kind of get used to it.  I'm not saying you ever like it though. I guess we'll save a lot of money on haircuts and hair color for the next several months.  And I don't have to read that section of the women's magazines anymore.  sigh.  jnprsn, so sorry about your infection.  I hope you can get everything settled down soon.  I've been through the infection after surgery but at least wasn't doing chemo at the time.  Nausea has not been my problem but unusual cravings has.  I seem to be having strange cravings for things I don't normally eat.  I have gone through a lot of lemonade and pretzels.  Before this, I bet I haven't had lemonade in 5 years and pretzels are last as my snack of choice.  Weird.  As many bad days as this chemo is giving me, it does kind of help me appreciate the more peaceful days when I feel better.  I'm learning to be kind to myself and have lower expectations of myself and yes, others.  I hope that can last beyond chemo as I think its something that would benefit me in my every day life.  Time will tell!    ",
      "MessageIndex": 894,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 8, 2013 11:44AM TwoHobbies wrote: Honeybunny I think your head will get a little better after it sheds more.  No great advice except I found the irritation to be improved by washing it every day rather than waiting two days.  I wondered if my dog would recognize me after the shave but he didn't even seem to notice.  Maybe he can't see as much with the curly hair in his face.  Realitycheck, such a good task to get done, the photo albums.  I have cleaned and re-arranged my bathroom drawers but that's as far as I got.  Hugs to everyone.  Triple hugs to Momx2.   ",
      "MessageIndex": 913,
      "PostDate": "08/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 9, 2013 05:26PM TwoHobbies wrote: Realitycheck, loved your sexy, beautiful wonderful gifts to the world greeting.  Why thank you, you're right.  LOL.  Made my day.  So just when we think we have hit all the SE of this disease, I am noticing my fingernails are very sore.  Especially my thumb nails but all of them if you push on them.  I've been trying to not use them to open things, etc, lest I do damage or pull one off.  I'm ready to stop at the losses here - the hair, the sparse eyelashes and brows are enough for you, chemo.    Lark, had to laugh on the wig/dog.  How embarrasing.  Note to self, don't buy a wig that looks like a shih tsu.      Marsha glad you are feeling good enough to go to the beach.  I have done some walking also but I'm not sure if it helps me feel better or worse.  I just feel like I cannot forgo all activity for 12 weeks.  I tried \"gentle yoga\" today and it was surprisingly hard.     Vilia how old is your daughter that you are homeschooling?  We are doing the same with my high schooler - eek, scary.  Happy Friday everyone.   ",
      "MessageIndex": 932,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 10, 2013 09:28AM TwoHobbies wrote: Good morning everyone.  Well I'm not sure what time it is in Australia, but G'day Nocompromises! Thanks for the Buffs talk ladies.  I just watched all the videos on the website and these seem like a good option, plus they'll be useful after hair too.  I bought a straw fedora but I found it scratchy, so I could even wear one of these under it.  I even might get an \"infinity\" buff for work when its cold there.  Those are so cute!  Patty, put some bling on the white one for the Christening.  You won't look like a nun that way!  Vilia and Puppymama, we don't have good options for online school like some states.  I am so jealous when I see what other states are doing where it seems you can pretty much go to online school or local school.  We just started last semester and my son is in high school.  We use University of Missouri online program. It's been a little bit of a struggle - time management, and I'm not sure if that's because of my situation or if he will do better next time.  And puppymama, my 16 year old isn't into doing things for himself either, but he has been very helpful through this.  I've noticed for several years he does stuff at his grandmother's but at home he wants mom to do it for him.  So even at 11 they can do more than they let on.  Just explain that he is going to have to step up and do some things you usually do, and then think of a reward for doing so, or a special celebration/event when you get done.  I feel bad that my son is spending so much time hanging with me/taking care of me.  I want to do something special for him when we're done.  Angela, i think you can go out in the sun with sunscreen, can't you?  Buy yourself a 50 SPF, take a hat and enjoy.      ",
      "MessageIndex": 945,
      "PostDate": "10/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 16, 2013 08:10AM TwoHobbies wrote: Angela, I also work with someone who had breast cancer about 2 years before me.  But I guess 1 in 8 of us gets it in our lifetime, so then it doesn't seem as odd. ",
      "MessageIndex": 1056,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 16, 2013 10:49AM TwoHobbies wrote: Sweetheart I would definitely get a second opinion.  Verify that 1 to 2% and why did they say no radiation before.  Has there been some change, some new study that indicates that radiation is superior, or is this Dr. super cautious, super aggressive.  I think a second opinion would help you decide, and then go with your instincts.  ",
      "MessageIndex": 1059,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 17, 2013 06:44AM TwoHobbies wrote: NC, I had an infection post mastectomy but I was worse off with a high fever.  I had to go to the hospital for IV antibiotics.  Just keep track of the size and your fever and keep in touch with the doc if the size gets bigger or you get fever.  Sounds like you are doing that.  They even trace it with a pen (the red area) to see if it grows outside the boundaries, so you can do that too.  In my case, they did test me to see what kind of bacteria I had, but that may have been because of the severity of my infection.        ",
      "MessageIndex": 1063,
      "PostDate": "17/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 5, 2013 02:31PM TwoHobbies wrote: Dreadix I can relate to your situation. My son has a chronic disease and was in major flare when I was diagnosed. It was hard to turn off my 24 caretaker brain and concentrate on myself. Take help wherever you can get it whether it is for you or your parents. I went tto RO yesterday and got some conflicting info from what breast surgeon had said. So stressful. Sometimes I feel like a ticking time bomb and I'm not sure which wire to cut. Is it the red one or blue one.",
      "MessageIndex": 1315,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 8, 2013 10:39AM TwoHobbies wrote: Hi everyone. I'm sorry for all of you having pain on the Taxol. It sounds similar to the pain I had with taxotere. Just wanted to say the MO let me take Ibuprophen and that seemed to help more than just pain killers. Rambo I have Raynauds too. I didn't even ask about icing because that would shut my circulation off. I am officially done with chemo and moving on to rads. Woo-hoo? Yes glad to be done with chemo but scared of the next step too. I almost feel bad that I'm done and my firecracker girls still have more to tough out. Hang in there you strong super women. The recovery from chemo is ongoing. I still have extreme tiring in my legs. I have been making myself walk and exercise a moderate amount but then I'm exhausted. It seems like this is going to be a long recovery. We will see.",
      "MessageIndex": 1338,
      "PostDate": "08/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 12, 2013 01:19PM TwoHobbies wrote: NC I. came home chemo #4 with many holes but I made it through. The last two they got chemo veins in the hand that wouldn't produce for labs so had to stick me elsewhere for labs. But it all worked out. Lark I'm glad to hear your daughter is doing so well. It's also proof that dark days can turn around completely.",
      "MessageIndex": 1362,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 26, 2013 02:25PM TwoHobbies wrote: Ok I did get a laugh out of momx2 calling it the dreadmill. My sentiments exactly. Everyone hang in there. You will get to the end because you have already exhibited amazing strength And Soriya we won't desert you as you finish up your herceptin.",
      "MessageIndex": 1462,
      "PostDate": "26/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 4, 2013 07:21PM TwoHobbies wrote: Just checking in on the firecracker warriors. As I was throwing out some of the info they gave me I noticed a sheet that mentioned headaches were relatedto platelet counts I know that doesn't lessen your pain any but at least you know it's normal and related to chemo. One thing I learned is keep that remote close by in October. Can't stand all the breast cancer commercials. I have to mute them or turn the channel. Rambo it drives me crazy also to hear all the prevention stuff. I look at people around me and I eat way healthier,exercise more and weigh less than most of the women over 35 and here I am. Hell I'm not even tall(an alleged risk factor). I hate that I look at every bit of food and wonder if it causes cancer while everyone else just eats.",
      "MessageIndex": 1493,
      "PostDate": "04/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 8, 2013 04:24PM TwoHobbies wrote: Rambo maybe you got cancer later because of you're good lifestyle. It does seem the brca makes it harder to avoid. I'm waiting on my results right now. Sweetheart yes I had that taxotere pain. From my jaw all the way down. Felt like someone was twisting my muscles up on some torture machine. Lark I went through some counseling after my first cancer run through. For me the emotions did get worse later because recovery is slow and fatigue was great. It was kind of a \"is this what I wanted to live for\" feeling. So don't anyone be afraid to get help and be kind to yourself and keep up your support. Today my husband said my breast was really red from the rads. I told him nobody cares. So we were \"laughing\" about what would it take to alarm an oncologist. Nothing I ever brought up to MO alarmed her. Think about that. Your scalp itches and breaks out. Your hair falls out. My heart pounded for two days. Can't taste can't poop. Mouth breaking out in sores. Muscles hurt like hell. I even fell down once when my legs gave out. Fingers go numb and fingernails hurt so bad I want to cry. Couldn't stay awake for three hours at a time. Can't have sex without getting a UTI. Rash all over my hand. Vein red and itchy. Fever. Eye swelled from a sty. Eyelashes and brows fell out. As my DH said. \"Ok see you next Thursday! So we have been through a lot!",
      "MessageIndex": 1511,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 19, 2013 01:28PM TwoHobbies wrote: Marsha I cannot draw eyebrows either, or at least consistantly.  I just gave up and stick to eyeliner and mascara cause I have 35 years of experience at those, while I never die eyebrows.  Mine look quite funny because I have few long brow hairs but now the others are starting to come back so its kind of a five o'clock shadow in between the longer hairs.  And I think the black nail is from chemo. Mine didn't turn black but you could see white bubbles underneath and that is where they are detached from the nail bed.  I tried keeping them short and polished for strength, but it didn't work.  I still have it wrapped in a bandaid.  I'm afraid to pull it off even though its only attached one millimeter. I do think this gets me out of doing dishes though. ",
      "MessageIndex": 1591,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 28, 2013 03:13PM TwoHobbies wrote: today I went for a dexa scan in preparation for my anastrazole. The scan was in the center where I had my biopsies and cancer notification. Wow I tried not to let that creep me out but it did. Sitting with my baldish head among three gowned women waiting on their mammograms. I started to think will they all be negative or will one be getting bad news. And then my mind started down that bad path I know I shouldn't go-wish I had been the one sitting here where this is just part of the routine and going back to work blissfully ignorant of the cancer thing. Sigh.",
      "MessageIndex": 1632,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 24, 2013 01:56PM TwoHobbies wrote: Merry Christmas!  I think I have overestimated my abilities this Christmas. Too much trudging through malls and standing in line last weekend and I am exhausted so I hope the rest of you did not make that mistake. I wish everyone a happy but unstressed day!  ",
      "MessageIndex": 1854,
      "PostDate": "24/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 3, 2014 05:46PM TwoHobbies wrote: Bluestars you can wear all those scarves that are popular now.  Who will know?  You're right that when you starts rads you probably won't want to wear a prosthesis anyway.  All I wanted on my chest was the softest tank tops.  When do you all think you'll ditch the wig, or have some of you done it already?  I have about an inch of hair.  Right now it is so cold that I wear winter hats in the house or a hoodie.  I'm still wearing my wig at work as I can't see wearing a ski hat at work nor a hoodie.  I don't know when I'll have the nerve to ditch it there.  Of course I'll have to color because I am way grayer than I knew.    I'm actually thinking about experimenting with color and maybe decide on a new color.  If you see a picture appear of a punk looking boy with blue hair appear above my name, well that'll be me!  That avatar I have now is how I feel, but not how I look! ",
      "MessageIndex": 1895,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 13, 2014 06:47PM TwoHobbies wrote: Oh no, NC. How awful. I hope all were able to get to safety, and that the weather will take a turn for more favorable conditions.  ",
      "MessageIndex": 1917,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Feb 5, 2014 05:11PM TwoHobbies wrote: thanks for doing this NC as I am somewhat inept at facebook.   I sent you a PM. ",
      "MessageIndex": 1937,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Apr 10, 2014 05:34PM TwoHobbies wrote: Yes!  Hanna and anyone else please join us.  We miss you all!  ",
      "MessageIndex": 1948,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "May 20, 2011 03:50PM TwoHobbies wrote: I had two tumors and the breast surgeon said it doesn't change prognosis.  She had women with 5.  Generally, if the tumors are far apart, they tend to recommend mastectomy.  If yours are close you may still be able to do lumpectomy if you choosel ",
      "MessageIndex": 3,
      "PostDate": "20/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/769237",
      "Title": "Multiple Lumps cdairth cdairth"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 19, 2013 11:39PM TwoHobbies wrote: Babyruth, sorry about the confusion on the Her2.  I hope they can get it straightened out and maybe you want to have a second opinion on that pathology just to make sure.  I used two hospitals for pathology and it was kind of surprising how they differed. JeriGrace, I think Marsha said it well.  After my surgery I took off minimal time because I just wanted some part of the day to feel normal, and I felt myself at work.  So I was planning on doing the same with chemo.  As it turns out, I am not very functional for many days after chemo.  My jos is very high energy and the new project I would have been working on is very high profile and non-routine.  I could not have given it 20% some days much less 100%.  The other thing is, I went back to work after my first incidence of cancer, and I was tired all the time for months.  I would rather take the time to heal myself this time and concentrate on my health and fighting this thing 100% instead of operating on fumes.  Nocompromise, sorry about your mouth issue.  I hope you can get through without further incident.  My WBC dropped from 11.8, which is actually high, to 1 the first time.  But by week 3, I was back up to 6 after the Neulasta shot two weeks earlier.    Rambo, I get muscle pain head to toe from the chemo.  Feels like someone is twisting my muscles up with a torture device.  The Neulasta pain was a little different and more joint/bone than muscle and in the deep lower spine/hip.  Second time I do not seem to (yet) have the Neulasta pain, but still have that awful muscle pain. I also had some heart pounding this time on day 2 and 3.  I hope that is nothing to worry about.  I will have to remember to askl the doc about that.     ",
      "MessageIndex": 427,
      "PostDate": "19/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jul 27, 2013 12:30PM TwoHobbies wrote: Hello everyone.  I haven't been on for several days and had some catching up to do.  I was \"lucky\" to get a UTI just as I was recovering from chemo 2 SE, so I am on antibiotics.  So something else to watch out for.   JeriGrace, hang in there.  I had bone pain from my first Neulasta shot but not the second.  I take Claritan every day anyway for allergies, so for me that was not the difference. So I think there's hope that this will not give you such pain every time.  Now unfortunately, I do have muscle pain really bad from the chemo, tightness all throughout including my jaw. And plenty of other chemo miseries!  I am also getting used to being hairless.  I wear a ball cap outside in my yard or walking but I do wear my wig going to the store or out and will definitely want it for work.  I am still struggling a bit with my wig and have to get it cut when my hairdresser gets back from vacation.  I think the layers are too long for my small face.  Anyway I hate the GI Jane/alien look when I see myself in the mirror but most of the time I forget about it.  Angela it was not that easy to find something that matches my color either, which is kind of light brown with auburn and gold.  All the wigs are dark brown or too much blond if they are highlighted.  I feel I am officially half way through since next week is treatment 3.  I really wanted to quit after the first chemo, but perhaps I can soldier on now.  We're all rowing the same boat. ",
      "MessageIndex": 627,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Aug 22, 2013 02:36PM TwoHobbies wrote: Good luck, Soriya.  It's pretty anxiety provoking to go through those scans, but praying for you that it will be good news.  Don't panic if you get no feedback from the tech.  I was hoping she'd say that it looks good, but I got nothing and everything was clear for me.  Angela, I'm hoping since you are a nurse you'll have some feedback.  At my infusion today, the lady next to me was told she has c-diff, and she had used the bathroom right before me.  Of course I washed my hands in the bathroom, and washed them again when I got home and then took a shower and scrubbed down.  Gee, I hope that was sufficient. ",
      "MessageIndex": 1143,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 3, 2013 06:10AM TwoHobbies wrote: Do any of you have a recommendation for a good mattress that you love? I am not sleeping well. I have a pillow top and it is too soft and not enough support when you have aches and back problems. Plus it absorbs heat and I'm constantly moving over a foot to get a cool spot. I sleep better when I take ibuprofen but if I forget it, not well at all Rambo glad to hear you are recovering nicely. Welcome to Cheri.",
      "MessageIndex": 1284,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Sep 3, 2013 06:41PM TwoHobbies wrote: Thanks Marsha and Angela for the mattress suggestions. I will have to look into it pretty soon I'm tired of just putting up with it. I too am jealous that Marsha can go on a hike. My son and I walked for a half hour today and I am so tired at7 pm. Its weird because some days are better than others. I just want to cry some days wanting to be my old self. Gavinsgrandma I got hit pretty hard by fatigue to the point where I'm sleeping during the day for five or six dAys and then I would start to do better for longer periods of time. I did have a little lightheartedness more than dizziness. My instructions said call if you are so fatigued you can't take care of yourself. Otherwise sleep when you need to and drink plenty of fluids.",
      "MessageIndex": 1289,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 16, 2013 07:25PM - edited Oct 16, 2013 07:39PM by TwoHobbies Catching up on posts. I get so behind since I had to go back to work but I miss you girls. For those who are feeling bad I will let you know you will feel normal again. I kind of worried about that but every week is better than the last. Hannariggs what a great idea and it's so wonderful of you to give back. I did not reply to the facebook post on prevention. Part of me wanted to rant but I figured anyone should try even though I think it's complete hogwash. So I decided to ignore it but needed to vent somewhere so thanks for listening here. I forgot to ask my onc about what the follow up will be for me now but I can tell you for early stage I only saw my breast surgeon for a physical exam every six months. They don't do scans unless you present with symptoms. I have a couple more weeks of rads and next I get tossed into menopause! I'm not looking forward to that but tell myself it would have happened in a couple more years anyway. Don't you sometimes wish you could get in a time machine and just go back 10 years before all this? I jumped back on as I seem to post and there is a whole page I missed. congrats Angela. Reovery is a little slow at first but it comes. Cheri hang in there. You will look back when your daughter turns two and marvel at the difference a year has made in both of you. But I am sorry you have to go through this when her first birthday should bring nothing but joy. It's not fair but you will know more appreciation at each birthday that other moms take for granted.",
      "MessageIndex": 1570,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 24, 2013 04:46PM TwoHobbies wrote: Congrats to all who are finishing up chemo.. Today I finished rads. For those taking that step it was much easier than chemo. The last two weeks I got quite tired and red and sore and don't get me wrong, I'm glad to be done. I don't see how my skin could take another week. They gave me a certificate and everyone signed it which I thought was really sweet. I did have a little bit of a cry and I'm not sure why because I didn't cry at the end of chemo. Maybe because the techs made it all so pleasant overall and I've been seeing them every day. It's nice to have a crew that cares about you to start off every morning. I'm sure it's also relief that I'm officially done with treatment except for medication. Wow how weird is that.",
      "MessageIndex": 1614,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Oct 24, 2013 05:09PM TwoHobbies wrote: Congrats KTLE and shout it out! I had 28 rads. I can't tell if my skin is tough but it is bright red. The worst of the pain is in my armpit. Let the healing begin.",
      "MessageIndex": 1617,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Nov 10, 2013 08:29AM TwoHobbies wrote: Thanks Lark. I got my Zoledex and started anastrazole and really don't feel any difference so that has improved my mood. Plus I have a light therapy light for SAD and that is helping a lot. If anyone suspects they have winter blues I highly recommend trying it. Yes the white downy chick look does go away although I'm sad to say the gray is still there! For the first time in a very very long time I'm seeing my natural hair color which is quite dark and ashy plus I see how much gray I really have! But I'm just glad to see hair covering my scalp. Lark a friends son had a concussion and they are doing the same. No electronics, no school work. She had to put out an appeal for his friends to come see him because he was so bored and depressed. I don't know if it's my imagination or not but I think the neuropathy is getting better. My nails are pretty fried. 8 of10 are semi detached and broke part of four off. Can't wait for that damage to grow out completely. They are so ugly and annoying.",
      "MessageIndex": 1670,
      "PostDate": "10/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Nov 28, 2013 07:31AM TwoHobbies wrote: Happy Thanksgiving to my lovely firecracker sister warriors. I want to let you know how thankful I am to each of you for traveling this bumpy road with me. It would have been much harder without you! When I was down you lifted with support and good laughs. I have been on vacation which I highly recommend. It truly got me out of the obsession with cancer mode and I feel renewed, less stressed and happier. A week of sun and swimsuit with no wig no makeup was freeing and no one seemed to care. I know I don't look as good as I used to but it will come back and next year I will be hot hot hot on that beach. LOL. And yes I plan to go every year now because enjoying life is on my schedule from now on. I will have to catch up on posts but I see Soriya had a worrying situation and I'm so happy that biopsy was negative. I hope everyone is doing well. ",
      "MessageIndex": 1762,
      "PostDate": "28/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 2, 2013 06:49PM TwoHobbies wrote: Hanna thinking of you and hope for good results. I don't think the stress ever permanently goes away. Every scan or test we will stress-hopefully not so much in between though. Soriya and blue stars good luck with your surgeries this week. Fatigue and hair will resolve. Although I still have some fatigue issues (like today for instance) it is overall much improved. And I have a full head of almost an inch long hair. Too bad the chemo did not destroy the grays!",
      "MessageIndex": 1771,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 13, 2013 12:00AM TwoHobbies wrote: Soriya that is good news so be relieved that it had not spread. It's not good to take out too many nodes so you trust and believe all is well. Angela and Rambo I have a lot of pain in my feet and ankles by the end of the day and I have yet to sleep very many nights without ibuprofen. But at least that does help me sleep through the night. My fingers still are very sensitive too but I hope that is more due to broken nails exposing that sensitive skin. I broke anywhere from2/3 to1/3 of each and every nail.",
      "MessageIndex": 1820,
      "PostDate": "13/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Dec 26, 2013 11:06AM TwoHobbies wrote: Angela, so sorry about the rads and your skin.  I had blistering but no bleeding and mine was mostly at the very end and continued to get worse after I was done.  I would think they'd have to take a break if you are bleeding.  Can you send in a picture to your doctor?",
      "MessageIndex": 1861,
      "PostDate": "26/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 11, 2014 01:30PM TwoHobbies wrote: Hmm, I can't decide if 107 F is worse than the -18 that we had.  I don't like either and both are kind of dangerous.  Is that unusual temps, NC?  Marsha how long are you supposed to wait before you color your hair?  I'm thinking about doing it soon.  This chemo cut and gray hair makes me look just like an old lady who had cancer.  Oh wait a minute...Did I...Am I?  I do have aching and I'm on arimedex (anastrazole) but I swear mine is left over from chemo because I ached before I started it.  It's annoying but not stopping me.  I was having trouble sleeping though because its worse by day's end and so my oncologist put me on gabapentin when I told her I take ibuprofen every night.  She said that is bad for your liver.  And actually it has helped a lot.  My hot flashes are pretty miserable too but I look at it as a sign of a good drop in estrogen which I need.  I was wondering the other day how long they will last but I'm really afraid to ask! Lark I am doing the Paleo Diet for the most part.  By no means am I 100% but they recommend sticking to it 80% and that I can do. It is helping me lose weight and I feel good and happy.  I don't know if that last piece is the diet but I'll take it.    ",
      "MessageIndex": 1910,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    },
    {
      "AuthorID": "TwoHobbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126341/profile",
      "Content": "Jan 12, 2014 08:41AM TwoHobbies wrote: There was a recent study that pointed out some of the food substances that specifically kill breast cancer cells in the lab, and the interesting thing to note is it was the combo of nutrients, not one alone, that worked.   Based on this I started eating a meal a couple of times a week that includes all these ingredients, although of course I don't know how much to include, or whether we will need to take supplements or if food is enough, but its worth a shot.  One of my dilemmas is it includes soy isoflavones and resveratrol, which is high in red wine and of course soy has been controversial and alcohol is not good.  But I decided I'd eat whole soy (edamame) and mix my red wine with grape juice and only do it a couple of times a week.   Here is a link: http://www.sciencedaily.com/releases/2013/11/131122103901.htm   NC, thank God for modern things like AC, warm coats and furnaces!  I admire our ancestors who lived in these climes without those. Marsha, I'll do a test on the hair color, and maybe I will wait until I'm sure I'm ditching the wig. ",
      "MessageIndex": 1913,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/806779",
      "Title": "Starting Chemo July 2013 Mellie289 JeriGrace"
    }
  ]
}