{
  "AuthorID": "TXBadboob",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
  "Posts": [
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 6, 2009 04:05PM TXBadboob wrote: I think they base this decision on the type, stage, and estrogen markers.  Also on your general health, too.  I had ILC, and was put on weekly Abraxane for 3 mos., then FEC every 3 weeks for the next 3 mos.  Deen",
      "MessageIndex": 1,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/745003",
      "Title": "Chemo types Merilee TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 23, 2010 08:36AM TXBadboob wrote: RIP Deen",
      "MessageIndex": 49,
      "PostDate": "23/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/747176",
      "Title": "Kimmytoo Sachi justjudie"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 31, 2009 07:37PM TXBadboob wrote: My prayers are with her now. Deen",
      "MessageIndex": 3,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731625",
      "Title": "Margaret goes for surgery April 1, 20009 clewisj1 TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 28, 2009 06:12AM TXBadboob wrote: Hope your surgery went well!  A day at the beach would be wonderful! Deen",
      "MessageIndex": 11,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731393",
      "Title": "Surgery Tomorrow 3/27 mln8428 caligrlof68"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 1, 2008 06:38AM TXBadboob wrote: Hey, Jackie     I had that happen, too.  Believe it or not, that's because the swelling has really gone down.  It will probably continue to for awhile.  I can feel feel the whole port and tubing underneath my skin.  It might be more if you lose weight also.  I got mine in Aug. and I'm starting to get used to it being there.  Better than needles in my arm all the time.:) Deen",
      "MessageIndex": 1,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723721",
      "Title": "Port question: Catheter from neck to port GointoCarolina bluedasher"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jul 12, 2009 07:17AM TXBadboob wrote: Lainey, there is a medicine my onc talked about that will help the nerves come back faster, I'm sorry, I don't remember the name, maybe someone on here will know. Deen",
      "MessageIndex": 3,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/737282",
      "Title": "Anyone with delayed neuropathy? Lainey64 SanDeeLou"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 27, 2009 05:54PM TXBadboob wrote: Hi I had a BMX with both SNBs and TEs, it took 6 hours.  It seems like it would take longer for bigger breasts, but I had not thought of that:).  My BS did her stuff first, then the PS took over.  I had 4 drains, but not everyone does. I'm sorry you're having to go through this, but I'm glad you're getting treatment and I'll say a prayer for you. Deen",
      "MessageIndex": 1,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731483",
      "Title": "how long does BM with tissue exp. take 4greatkids lvtwoqlt"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jun 27, 2009 07:20AM TXBadboob wrote: revellsk,  I am feeling almost back to normal now.  Just a little sore at the end of the day, not too much.  Advice, take the stool softener and keep eating like you are now, I don't know why, but it took that for me to start feeling a whole lot better.   Unfortunatley, my hot flashes came back as if they never left! Hope everyone gets feeling better,j Deen",
      "MessageIndex": 8,
      "PostDate": "27/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736535",
      "Title": "Post-ooph, what to expect? Everlastpink Everlastpink"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jun 26, 2009 02:50PM TXBadboob wrote: revellsk,   I just had my ooph/hysterectomy Jun 2, and I had no blood at all, but I was already on Tamoxifen.  I asked my GS if this was normal(I really just thought there would be some blood), and she said it was o.k., doing good.    I also had the bloating.  I tried stool softeners in case that was the problem, as it could cause pain, but it just took time for that gas they shoot into you to absorb back into the body.  I also heard it can cause shoulder pain!  Took about 2 weeks for my tummy to feel normal again.   I don't know about you, but it seems like at the end of the day my tummy gets a little sore.  I never did take rx pain killers, but I took Tylenol.   Hope you get feeling better soon, Deen",
      "MessageIndex": 5,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736535",
      "Title": "Post-ooph, what to expect? Everlastpink Everlastpink"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 21, 2008 06:30PM TXBadboob wrote: Stephanie, this could be a common SE called neuropathy.  I have burning on the tips of mine, and sometimes my toes, too.  I'm on Abraxane.  Hope it doesn't get worse.  Good luck!",
      "MessageIndex": 1,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721402",
      "Title": "Nevalbine-Neuropathy milconmom arharwood1"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 19, 2008 08:45AM TXBadboob wrote:     Hi, Lori and Gina,     I was starting to wonder if I was the only one on Abraxane.  I don't see much about it on here.  My onco told me it's a little more expensive, so they have to fight the insurance on it, so I figure that's why it seems rare.  I'm going to let you know what I've been through so far.  Hope this helps.     I am on my 8th weekly Abraxane treatment so far.  My side effects have been neuropathy in my fingers, toes, and sometimes my tongue.  It feels like I have been burned but not bad.  Sometimes I feel like I'm burning inside also, and just every once in a while I feel nauseous.  My onco gave me meds for that. Also my face and neck burn sometimes, and a while back my face broke out in a rash like acne.  I tried different moisturizers and even hydrocortisone, but it only got worse, so now I only wash my face with aveeno sensitive wash, and I only moisturize my eyes, and it is better.  I have bone pain sometimes from the neupogen shot I get the day after chemo.  Sometimes it's kinda bad, but mostly not too bad.  I have been able to keep working, but I work with my hands, so I hope it doesn't get worse.     I only have four more treatments to go and then I start FEC for the next three months every three weeks, which they tell me will make me sicker and more tired than the Abraxane, but not the neuropathy.  I'm so tired of the burning fingers, it gets to you sometimes.  My nails hurt, too, but they haven't fallen off like they said they might.     I get real depressed sometimes, but I think it might just be the chemo.  I definitly have the chemo brain.  I think it's made me dyslectic.  You wouldn't believe how long it took me to type this reply:)      Gina, I live south of Houston, and I get my treatments there, too.      I hope this helps ya'll.  Sorry if I run on a bit.  I'm saying a prayer for both of you right now.",
      "MessageIndex": 2,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719580",
      "Title": "Abraxene, anyone? LoriFL gma5279"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 20, 2008 07:29PM TXBadboob wrote: Sorry Gina, I lost mine after 3rd treatment.",
      "MessageIndex": 4,
      "PostDate": "20/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/719580",
      "Title": "Abraxene, anyone? LoriFL gma5279"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 21, 2009 07:02AM TXBadboob wrote: jkwick, try posting this on the Reconstruction site, you will get more replies.  Warner makes some of the most comfortable support bras at a reasonable price.  I've even found some great ones at Marshall's and Ross. Deen",
      "MessageIndex": 1,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/744235",
      "Title": "bra help chicagomom TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 3, 2009 07:14AM TXBadboob wrote: DrDecker I want you to know that I also wanted to die while I was doing chemo.  I thought about no one being there for me, leaving me alone, even though I asked to be alone during my sick time.  I have never been so depressed in my life.  Uncontrollable crying, until I made myself congested, which you don't need at that time.  Asking God why he was putting me through this, begging Him to take me home to Him.  Then dreading the next chemo with almost panic! I finished chemo on Jan 20, and I had a bil masect w/TEs last Fri.  You need to know that I have not experienced any more depression like I did during the chemo.  It was caused by the chemo, I'm positive about that!  If you can just get through the chemo, you will have won a great battle, I promise you. Please, let your Dr and staff know about this awful SE.  They should be able to help you.  Also, talk to your family and friends about it(I'm sorry that I did not).  This is such a hard thing to go through, I can't say it enough.  I still have the worst fear of having to go through it again, and I'm not sure I could do it. When is your last chemo, do you know? My prayers are with you strongly, Deen",
      "MessageIndex": 6,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/730022",
      "Title": "suicide ideation lovemyfamilysomuch Texas357"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 10, 2009 04:42AM TXBadboob wrote: sharebear,   I also did my first Zometa IV in July.  They want me to do it every 2 mos.   I want to warn you if they haven't already, get ALL of your dental work done BEFORE you get the Zometa!  There is a small chance of jaw necrosis that can be a SE of Zometa.  I needed some dental work before I had it, and now I'm having to do some very expensive laser dental because you can't have extractions of teeth or cutting on your tissue that can get infected.  So what would have cost me about 300.- 400.00, is now costing me 5000.00 in all.  Just make sure you tell your dentist that you are on Zometa.  It is important for them to know.   It is just a small chance, but one I wasn't willing to take after I saw pictures of it.  I will still take the Zometa, because of my osteopenia and the 50% chance of no recurrence!  Isn't it wonderful about the new drugs they're finding now to help us.  I'm sorry you're having to go through this again and my prayers are with you. Deen",
      "MessageIndex": 5,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734445",
      "Title": "Anybody on Zometa for bones? sharebear tibet"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 16, 2010 12:17PM TXBadboob wrote: Zoegr, your onc should give you medicine that will prevent any nausea or vomiting.  There is no reason anymore to go through that.  Just don't be like me and get sick before taking them.  Be proactive with the meds.  Most women going through treatment go on with their lives as normal as possible.  A freind of mine on CMF didn't even lose her hair!  I hope that is true for you also.   I hope your treatment goes smoothly and successfully, Deen",
      "MessageIndex": 1,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751310",
      "Title": "CMF side effects? zoegr aprilgirl1"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 18, 2009 07:12AM TXBadboob wrote: Tabatha, I did 12 weekly of Abraxane last year starting in Aug.  I worked all the way through it.  It wasn't too bad.  I lost my hair at about 3 weeks, I got some neuropathy in my fingers and later in my toes.  I've heard if you keep them cold, it can prevent some neuropathy, wish I'd tried that.  My fingers and nails are just now getting better, but my toenails still look bad(at least I never lost any).    My infusions took about 3 hours, but they gave me fluids and antacid IVs also, so maybe that's why mine were longer.  I also had to go in the next day after chemo to get Neupogen shots in my stomach for white blood counts, also weekly blood tests.   I hope this treatment goes well for you, Deen",
      "MessageIndex": 3,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742295",
      "Title": "Abraxane Tabatha00 Hopbird"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 10, 2009 06:10AM TXBadboob wrote: Hi, everyone, Maydene, I also had BM done that day, I had 4 drains, last Fri had 2 pulled, and I will have the last 2 pulled this Fri.  I didn't want to rush pulling them, as I am scared of seromas and infection.  The fluid is just now slowing down.  The worst of my pain is under my arms where they took the sentinal lymph nodes, so it sounds like we're normal.  Besides that, the pain is like a barbed wire bra cinched up tight on me.  My drs. gave me Darvocet for the pain, but I'm only taking them before bedtime now.  I also use tylenol during the day(I just got used to it from chemo).  I hope you get to feeling better soon. SueG, congrats on your drains out.  What an experience!  My prayers are also with your Dr. Samiam40, hope you're doing well.  Thanks for the tip on the Advil Mooma, sounds like you're making it through just like a trooper!  Take care. Jilli, hope you're fine today! Dani, you got your drains out fast!  Lucky you! Hope everyone has a great day!  Prayers for 2new1s again! Deen",
      "MessageIndex": 554,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 10, 2009 02:20PM TXBadboob wrote: Hi, Just a little venting.  My Fri appt got moved to next Tues, so I have to have these drains over the weekend.  I really did cry(such a baby).  I was hoping to go back to work Mon, but I won't go with these drains in, so I'll have to wait a little longer. My path report came back good, so that was great news! Thanks for letting me share, hope everyone feels better, Deen",
      "MessageIndex": 557,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 12, 2009 11:49AM TXBadboob wrote: Terri My prayers are with you.  I hate waiting, too!:) Deen",
      "MessageIndex": 598,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 19, 2009 05:33AM TXBadboob wrote: hey, all   I went to work yesterday 10:00 to 4:00, and it went pretty well.  We were very behind in our work, which made me feel good (don't want things to go too good when you're gone).  I'm going to stick to that schedule this week to take it slow. SueG, good luck today with your fills! Hope everyone has a great day! Deen",
      "MessageIndex": 668,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 27, 2009 06:33PM TXBadboob wrote: Hi everyone, Sorry, I've just been lurking lately. Bee, I was sorry to hear your TE didn't flip like we hoped it would.  Hope the surgery will be easy for you.(and timely!)  Have fun with DG! Caligirl, I still have some fluid in my left foob,too.  It keeps leaking out of the hole where my drain was when I do my arm exercises.  Sounds gross, huh?  I just be sure to keep it clean. my560, sorry about the ins problem.  They took my blood for the BRAC test at the onc's office, maybe you can do that.  I know they won't do the test until they know for sure your ins will pay.  Good luck! Have a good night, Deen",
      "MessageIndex": 752,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 31, 2009 06:45AM TXBadboob wrote: hope, yes, I have been feeling that shifting when I get up, since the tightness has gone down some.  I hope the implants won't be like that, because mine really irritates under my arms. Mooma, my PS said I could wear bras now.  I have a zip up front sports bra I wear to work out in.  I don't see how it could hurt anything as long as it's not too tight. caligrl, hope your appt. goes well and they give you some relief.  Heal! Hope everyone has a great day, Deen",
      "MessageIndex": 782,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 3, 2009 05:56AM TXBadboob wrote: Hi everyone,   I'm going for my 2nd fill this afternoon.  I think this one will make me bigger than I was before the surgery.  I don't know about ya'll, but I'm already really tired of these expanders.  I want to sleep on my side again!:) 2new1s, good luck on the PT, and FYI, I'm already regretting that I didn't do the tummy fat procedure.  I didn't have enough for the DIEP, but PS said I could use the fat in my tummy plus an implant.  If I would have done so, I wouldn't need another surgery.  Oh well, can't look back now.  Hope you get your approvals. samiam, how's the chemo going?  Hope you are well.  I'm glad you're getting some good support.  Good luck on the fills! Have a great day! Deen",
      "MessageIndex": 802,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 15, 2009 07:23PM TXBadboob wrote: Hi everyone,   I'm on Facebook, too.  Dena Anderson Engel, please send friend requests, I love getting messages!  Dani, you don't have to hurry at all.  Just wait until after graduation, so you won't feel so under pressure.  That might give you time to decide anyway.  I'm at the point where I'm not sure if I want another fill or not.  I just don't want to look back and regret not doing it.  I'm still kinda regretting not getting the DIEP with small implants my PS talked about. caligrl, Wow! 900ccs!  I'm at 650cc, and I feel pretty big!  My son met his wife on the internet also.  They've been married three years now, both 26 yrs. old. mooma, I know what you're talking about with the shrinking.  I think it's when the skin has stretched enough and gets looser or not as much swelling or something.  Good luck on your last fill. Hope everyone has a great day, Deen",
      "MessageIndex": 860,
      "PostDate": "15/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jun 21, 2009 06:02AM TXBadboob wrote: 2new1s, my prayers are with you.   Hope everyone is doing well. Deen",
      "MessageIndex": 1007,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jul 18, 2009 06:45AM TXBadboob wrote: Hi ladies,   I haven't been to this thread in a while, and a lot had happened, I see.  Congratulations to the women who have had their exchanges.  Sending good healing vibes your way. Hope4cure,  your exchange will be coming soon and I hope you get what you want. Jilli, The DH problem seems to be a little common around here.  According to some others I have read from, it just takes time and communication for them to come around.  Very hurtful, I imagine.  I'm glad you're happy with your new ones, and hope for no revisions. [[[[[Hugs}}}}} Deen",
      "MessageIndex": 1047,
      "PostDate": "18/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 29, 2009 05:18AM TXBadboob wrote: Bee- my prayers are with you.  You are not alone, don't ever think that.  You have a right to be upset.  I also had problems with my son in his late teens, he ended up going to jail for 2 years.  I thought my world had ended, but God got us through it, and he is now healthy, married, he is a sleep tech at a hospital, and I hope I will be a grandmother soon. Please take care of yourself, that's what you have to worry about right now, know that God is watching over your grandbaby now. God bless you back!  Deen",
      "MessageIndex": 134,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 10, 2009 07:40AM TXBadboob wrote: Hi 2new1s,   Is it possible for you to ask your PS if they can go on and do the exchange now so you don't have to do another surgery?  You don't deserve this and I'm sorry you're having to go through this so many times. {{{{HUGS}}} Deen",
      "MessageIndex": 1112,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 23, 2010 08:12AM TXBadboob wrote: Hi everyone,   Saw this thread and had to stop and say hi!  Hope everyone is doing great!  I miss the group, too. 2new1s, good luck with your reconn. Deen",
      "MessageIndex": 1151,
      "PostDate": "23/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Feb 20, 2009 09:11AM TXBadboob wrote: Hi, everyone Thanks for all the posts and the updates.  I now know a little more of what to expect.  I was fine about the surgery until they called to confirm the date and instructions for the surgery.  I almost fell into tears, just realizing I'm going to wake up with no breasts that day, and with no hair on my head I'm going to feel like a boy!  I'm praying a lot, and hoping for a good outcome.  I don't want to ever have to do chemo again for sure! SueG, looks like we're having the same surgery the same day.  My prayers are with you. Gentle hugs to all,  Deen",
      "MessageIndex": 355,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 2, 2009 07:36AM TXBadboob wrote: Hi, everyone     I got home from surgery yesterday(Sun), and am doing ok.  Surgery went well, and lymph nodes showed neg so far, I'll get the Path on Thurs.  I feel like a tight band of pain around my chest.  PS filled me 350cc so far, I was pleasantly suprised, as I wasn't flat when I woke up.  The hospital and nurses, staff were fantastic!  My BS actually held a prayer with me and my family before I went in for surgery.  I love both her and my PS! I have two drains on each side, PS took out my little pain pumps yesterday.  I also threw up a few times after surgery from the morphine, but it went away when they took it off.  I woke up last night in quite a bit of pain about 2 am, took a Darvocet, and woke up in almost no pain.  I get to take a shower today, yeah!  I guess I'll see the whole things then.  I've been taking pix on the progress and will post them on the pic website. Debbie, sorry about the lymph node problems, I am scared of that, too.  I really don't want rads after all I went through with chemo.  I know we have to do what we can, but it can be so disappointing.  My prayers are with you Mooma- PM TimTam and ask for permission to get on the website.  They are very strict on privacy.  TimTam set this up herself, and she really takes a lot of her time running it.  She's great.  It really helps others to see pix of the different procedures, both good and bad. Hope everyone has a great day Deen",
      "MessageIndex": 471,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 4, 2009 07:17AM TXBadboob wrote: Hi, everyone Bee- good luck on your first fill. also hope everything goes well at the onc Jilli- you really inspire me to get back to my workouts!  Just not yet:) Mooma- I'm jealous about the drains out! Samiam-my prayers are with you starting chemo, it SO sucks!  Keep looking forward! Sue- we had BM the same day, thanks for posting, as I also am very sore today.  What are you doing during the day?  I sit around a lot on the PC, read, and I've been walking as far as I feel comfortable, just to get out of the house.  I don't think that's overdoing anything.  My sore throat is finally going away (from the tube?).  I think I might be a little more swollen today, but it might just be the pain.  DH has been cleaning the drain sites with alcohol and bacitricin, then putting gauze back on them, but I don't see any scabs yet.  I didn't want it to heal there, but to keep it clean.  My followup with BS is tomorrow for Path, PS is fri for checkup.  I don't want any fills yet, as I feel really tight still.  He filled me initially with 350cc.  I look like about half of what I was. I hope we both get to feeling better soon:) Have a great day, everyone! Deen",
      "MessageIndex": 497,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 11, 2009 06:52AM TXBadboob wrote: Thanks everyone for your understanding. Caligrl, that does seem like a lot of fluid, I'm getting about 30cc in ea per day now.  We'll both tough it out over the weekend:) 2new1s, I'm still praying for you.  You have been through so much!  Please keep your strength up as much as you can, and rest!  We're all cheering for you! Glad everyone seems to be getting better, Deen",
      "MessageIndex": 574,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 16, 2009 06:53PM TXBadboob wrote: Hi, everyone jpixstix, welcome to your Feb thread!  Hope you are doing well. jilli, congrats on your path! caligirl, sorry about the drains and debridement, hope it goes well and heals.  I'm hoping to get my drains out tomorrow. 2new1s, hope you are healing up nicely! Have a great night, Deen",
      "MessageIndex": 646,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 19, 2009 04:54PM TXBadboob wrote: my560sel, I was dx'd with ILC, and my onc said that it is known to go bilateral.  At that point I decided to have a BMX, however, later I tested pos for BRCA2, so that pretty much sealed it.  Had my BMX Feb 27, and when I got the path back, I had IDC and DCIS in the other breast!  I was very glad of my decision, but I know that this is my case, and I'm not trying to scare you, just letting you know what happened to me.  It is a very personal choice, and you've got a lot of support here at this site, and great information to arm yourself with in making those decisions.   My onc told me IDC tends to be more invasive, ILC is sneaky, and tends to mirror in both breasts.  I will say that a second opinion might make you feel better about your choice.  Have you discussed any of this with an onc?  Maybe that would help, too.  Just a thought.  My prayers are with you in this. Jpixstix, maybe see if you can use the homeowner's vacuum cleaners, I ran mine, but I know I could not carry it if I had to.  I also am seeing two little stretch marks above one of my incisions, and I've been using cocoa butter above and below the incisions. Caligirl, I hope you find an answer to your problems.  You've already been through so much! Jilli, good luck with your new belly button!  Sounds good that it's slowly closing. Ya'll were right, I was very tired today after work, so I'm taking it easy tonight!  DH is picking up hamburgers, yeah!  Hope everyone has a great night. Deen",
      "MessageIndex": 679,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 22, 2009 06:30AM TXBadboob wrote: Hope4Cure, I know what you mean about the cold drinks!  The weirdest feeling!  Makes me shiver.  Good luck on your first fill!   It has been three weeks for me now, and I am getting shooting pains in my right breast.  I have not had this before.  Maybe a muscle cramp from stretching?  I had to take a Darvocet last night, and I had not taken one for a while.  No sign of any infection, which is what I'm scared of.  Anybody else had this at three weeks? Have a great day! Deen",
      "MessageIndex": 711,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 28, 2009 06:23AM TXBadboob wrote: Caligrl, my MIL had a MX w/ no recon 2 yrs ago, and she told me they did have to drain out some fluid with a needle a few weeks after her drains were out, so I'm guessing this might be normal.  I finally dried up for now:) dani, I'm so sorry for you, that is scary.  I haven't been wearing a bra too much either, but I think I'll start wearing one now to be on the safe side,  Mine are so tight still, I can't imagine them being able to move.  Were yours tight? mooma, where are you having necrosis?  I hope you're getting better and can have your fills soon. Hope everyone has a great day, Deen",
      "MessageIndex": 755,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 29, 2009 09:29AM TXBadboob wrote: sueg, I know what you mean!  My PS told me not to do any exercise until my drains were out, because it caused fluid to build up more.  After they were out, he said I could exercise and he wanted my range of motion fully back in a month or he would send me to a PT to help me.  He also said I can wear any bra I want to now.  I've read so many different opinions about this on this forum.  Who's right?! Deen",
      "MessageIndex": 768,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 4, 2009 06:15AM TXBadboob wrote: Hi everyone, Had another fill yesterday, I'm up to 450cc, and this time it's really tight!  But I'm a lot happier with how it looks, it's starting to fill the upper part of the TEs.  PS still says sleep on my back:( Samiam, I feel the same about having my foobs bigger than my tummy, they keep asking me how much bigger I want to go, and I keep saying not there yet! He did say I could have my oopherectomy at the same time as exchange, so that is good news to me.  I want to get off this Tamoxifen before I start getting the SEs I keep reading about. Bee, that sounds SO romantic!  I love my DH so much, but I know he would never think to do something like that.  Hope you have a wonderful anniversary.Good luck on the eye stuff.  Do you mind me asking, how can ins pay for something like that?  I would sure like to do that! Hope ya'll have a great day, Deen",
      "MessageIndex": 811,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 18, 2009 06:02AM TXBadboob wrote: Teri, you might be right about the tumor, my MIL had dx of IDC two years ago, she's 82, and the BS said her estrogen was so low by then, that the tumor would probably not get much bigger, but she took it out in a mx to be on the safe side.  Did any of your Drs inform you that ILC tends to be bilateral?  I just want you to be fully informed for your decision.  That was the main reason I chose DMX, before I found out I had the bad gene.  ILC is so sneaky!  I think your gyno sounds a little unprofessional, and you might be better off finding another.  With your BC problems, you need care and understanding. Vent anytime! Deen",
      "MessageIndex": 872,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 18, 2009 04:40PM TXBadboob wrote: Terri, sounds like you have come a long way!  I've seen you get stronger and stronger as you've come down this road.  Hats off to you! 2new1s, it doesn't hurt at first, but then my muscles get sore for about 2-3 days after.  I just take Tylenol and it gets better.  BTW, your DD is adorable! Deen",
      "MessageIndex": 876,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 21, 2009 06:14PM TXBadboob wrote: Bee, hope your surgery went well. Caligrl, bummer about the new date and the rads.  Don't worry, kids grow up:) jpix, prayers to you on your surgery Friday.  2new1s, hope your skin did what it was supposed to for the best results! Hugs to everyone, Deen",
      "MessageIndex": 885,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 25, 2009 05:55AM TXBadboob wrote: Jilli, I've seen pics of how red the tummy scar is at first, then it just turns into a white line that you can barely see.  I watched a commercial on that scar cream, wondered how good it worked.  I'm not using anything on my incision since I know they're going back in that way, but I use cocoa butter on my foobs to avoid stretch marks.  I still have some light ones, though.  Are you having any pain now?  Hope not.   Going to take Mom to the beach today.  Looking forward to it!  Just realized I don't have a swim top that fits anymore.  Have to stop at Target I guess.  Oh, well! Have a great day! Deen",
      "MessageIndex": 910,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 29, 2009 07:34PM TXBadboob wrote: Michele, I don't think a day will go by without me feeling the big \"C\" looking over my shoulder.  Every little pain or bump scares me.  I have a two inch long dent in my calf since chemo, and no one can tell me why or if it will go away.  It's just a side effect, they tell me.  Your body is still tired from the trauma of surgery, and this can bring you down some.  My prayers are with you through your thyroid problems.     As for DHs, they're wonderful through this, but my DH is really tired of my cancer and would like it to be over with.  Hmmm, guess I would like that, too. Hugs to all, Deen",
      "MessageIndex": 932,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jul 28, 2009 07:35AM TXBadboob wrote: Hi everyone,   Sending healing vibes to all of you gals who had surgery again.    It's been two mos since my exchange, and I still peek at them all the time!!!  Mooma, I don't see them through my skin, but I'm not sure what you mean.  I saw your pics and you look wonderful. Deen",
      "MessageIndex": 1075,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 1, 2009 06:50AM TXBadboob wrote: Hi Surgery Gals,   Terri, yeah for B9!!!!  Keep going slow and easy, and remember the TEs are just to stretch skin and muscle, your implants will be very different.   Hope,  I'm sorry you're having such a hard time in your journey.  My prayers are with you that you find the right PS.   Mooma, saw your pics, looking great!!   dani,  I'm sorry you're not happy with your new ones, and I know how you feel.  It's a hard decision to think about another surgery.  I've given mine until Aug, well, they're hanging down more than ever, so my PS has GOT to do something about it.  I'm 46, not 86!!  My bras won't even hold them up anymore!  I don't know what to do.  I also think if he would have used a little bigger implants, this might not have happened. Hope everyone has a great weekend, Deen",
      "MessageIndex": 1084,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 25, 2009 06:19AM TXBadboob wrote: Hi Feb ladies!!  I haven't been on in a while, but I just caught up. 2new1s, I'm so glad to hear you doing well.  Did your PS wait for your incisions to heal before he started fills?  I want this to be successful for you this time!  Congrats on the weight loss, like Terri, I have that stubborn 6 lbs to lose from chemo! Hope you are all well, Deen",
      "MessageIndex": 1092,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 12, 2009 06:24AM TXBadboob wrote: 2hands4me, I'm so sorry you have to go through this again!  I'm glad they were so diligent in their search!  Sounds like they are being very proactive, which must be comforting.  I'm sure you're reeling from news, though!   Please keep us updated! {{{HUGS}}} Deen",
      "MessageIndex": 1103,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 15, 2009 08:33AM TXBadboob wrote: Yeah, I'm getting ready slowly but surely!  Trying to get in the Xmas spirit!  I didn't need drains for the exchange(whew), so maybe you won't need them.  I would rather have drains than any problems, though.  Just reading about all that makes me grateful.   I still don't know how I feel about my new ones.  I've given myself some time to really think about it.  I may have gotten too greedy and maybe went too big.  They are heavy and I'm pretty active, so I'm always aware of them being there.  It doesn't seem to be a problem for most women, so I wonder why it is for me?  I'm probably going to get a second opinion just to be on the safe side, in case there really is a problem.   I'm glad for you getting yours soon!  I've seen the pics and you're doing great! Deen",
      "MessageIndex": 1145,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 29, 2009 05:11AM - edited Jan 29, 2009 05:22AM by TXBadboob Congrats, Debbie and Susie, I just finished my chemo on Jan 22, so I know how you feel!  I go today to see my BS to get a surgery date. Good luck everyone!  Deen",
      "MessageIndex": 133,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Feb 3, 2009 05:49PM TXBadboob wrote: Hi, everyone   I finally found out today I am having the bilateral mx on Feb 27.  As far as I know now, I will have expanders put in.  We're still discussing PS options.  Thanks for good vibes!  Deen",
      "MessageIndex": 185,
      "PostDate": "03/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Feb 27, 2009 03:27AM TXBadboob wrote: Hi, everyone    I'm heading to the hospital now.  A little nervous, but I know it's in God's hands.  Hope everyone has a great day! Deen",
      "MessageIndex": 421,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 5, 2009 06:15AM TXBadboob wrote: Hi, everyone Sue- congrats on clear margins!  I'll find out mine today, hope it's good, too. Jilli- ouch!  Be careful!:) Tried the yoga exercise, I'll keep doing it! Bee-sounds like you'll be back to your big boobed self in no time Samiam-hope you are feeling good.  Advice: don't be shy about using the meds, keep ahead of the nausea!  I learned that late in chemo:( Dani- I was hoping for 2 weeks off also, but I can't tell yet how I'll be then.  Please keep us updated.  Hope you feel better. Hope everyone has a great day!  Deen",
      "MessageIndex": 509,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 12, 2009 08:00AM TXBadboob wrote: Jill   I don't know if this even compares, but the feelings you're having with your pacemaker sounds the same as us chemo girls that had the port put in our chests.  It took longer for that to heal than my biopsy, and never felt right even after it healed.  Also messes up your range of motion.  It may also be worse when you're a thin person.  Check out port complaints and it sounds like the same as your pacemaker!  If it's similar, it's just going to take quite a while to start feeling close to normal.  That's why so many of us are so happy to get our ports out(whew!).  Sorry you're having to go through that as well as bc. dani, good luck at work today! sueg, hope4, hope you get to feeling better, I guess it's just gonna take a while for our bodies to adjust to all of these artificial things going on in our bodies. Prayers and hugs for all, Deen",
      "MessageIndex": 594,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 15, 2009 02:04PM TXBadboob wrote: my560sel,   I didn't have a lumpectomy, but I have read a lot of threads here that describe the same type of bruising you have with their lumpectomies.  Also they always spread to the nipples for some reason.  Must be something with the blood vessels bleeding and healing around there.  Check out the search on this.  Hope you find something. Deen",
      "MessageIndex": 633,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 7, 2009 07:25AM TXBadboob wrote: Terri, my prayers are with you this morning.  Hope everything goes well. I'm with Caligrl, this ILC is a sneaky bastard!  I had a mammo and US in 11/07 that were clear, and I myself found a 2.9cm lump in my breast 7/08.  It still didn't show on the mammo, the tech said \"I can see it, looking at you, but not on the films!\"  The US showed it right away, and that is how they measured it while I was doing chemo, to see if it was shrinking, which it did.  I decided to do the BMX, because I never wanted to go through this again, plus I tested pos for BRCA2, and they still found some ILC in left breast, but surprise, surprise, found IDC in the other breast!  And that was after chemo!  So I'm glad of my decision, and I know everyone's choice is very personal.  On this decision, I think you have to only listen to your heart.  No one can tell you what to do on this choice.  I did pray for guidance and I was. Hope everyone has a great day, Deen",
      "MessageIndex": 822,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 14, 2009 06:43AM TXBadboob wrote: Hey everyone, jpixstix, congrats on the upcoming exchange.  My PS said most women come back after first surgery, because they want bigger.  He told me that on my first appt.  Don't feel alone, and I'm taking him up on that. caligrl, you crack me up, you playboy bunny you!  We want to hear more about this new a$$ man! samiam, I know what you mean about popping out!  My last fill had me staring down a lot!  I keep bumping them into things, ha! 2new1s and Bee, I'm glad your Easter went well with the children!  Congrats on the insurance problem being fixed.   I go for another fill today.  This might be the last, then he will overfill me next time.  We will talk about exchange today.  I will also have an oopherectomy at the same time.   I hope everyone has a great week! Deen",
      "MessageIndex": 849,
      "PostDate": "14/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 28, 2009 06:30AM TXBadboob wrote: my560sel, I, too, have people constantly telling me their horror stories, usually about someone they know, or heard of(my so and so died, etc.)   Not here on the boards so much.  You just have to know that they aren't thinking about how it might affect you.  We dream up our own horror stories enough, we don't need their help.  The stories I read on here I take as a learning experience, and I appreciate even the bad stories, and I'm glad I'm on here to help anyone who needs it, even if it's an ear for venting.  It's nice to have a place to go to not worry about anything we say.  sueg and 2new1s, I hope you're feeling better.  I go for my next fill this Fri.  I think I'm getting foob greed, but my skin can only stretch so far Hope everyone has a great week, Deen",
      "MessageIndex": 922,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 3, 2009 06:18AM TXBadboob wrote: I'm praying for all of our children today!  Have a great day! Deen",
      "MessageIndex": 948,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 12, 2009 10:19AM TXBadboob wrote: bump ladies, have a great week! Deen",
      "MessageIndex": 959,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 14, 2009 07:10PM TXBadboob wrote: Michele, my prayers are with you, as if BC was not enough! Jilli, what are you doing to lose weight?  I'm working out 4 days a week, walking almost every day, and eating more veggies and fruits, and I'm only maintaining still!  What's your secret? Deen",
      "MessageIndex": 965,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 20, 2009 05:55AM TXBadboob wrote: 2new1s, I hope I'm not one of those who you feel ignored you.  I follow your posts weekly and have been praying for you constantly to heal and get your other new one.  I'm thinking we're not posting because of Spring and we all just want to get out in the beautiful weather.  That's my reason.  I sometimes feel ignored on some of the threads, but I don't think anyone means to do that.  For me, sometimes, it's the venting that helps.  It should be about time for you to get on the reconstrucion site now, it's time to look forward!  I also check in on you on FB.  I think your husband posts more than you do! my560, good luck on getting a surgery date. stacey, congrats on the end of rads!  I follow you on FB, too! jilli, thanks for starting this post.  I have met some wonderful sisters here! Hope everyone has a great week, Deen",
      "MessageIndex": 972,
      "PostDate": "20/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 22, 2009 05:54AM TXBadboob wrote: Hi everyone,    I had my gyn appt on Wed and they scheduled me for June 2 for my exchange and oopherectomy.  Wow, that seems so soon!  But I'm glad, less worrying time.  I'm looking forward to really having this behind me.  I hope ya'll have a great Memorial Day weekend. Deen",
      "MessageIndex": 979,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 4, 2009 05:52AM TXBadboob wrote: Hope4cure, I hope your exchange went well!!  Let us know! my560, my PS said to watch out hugging people with my TEs, I might hurt them!:) 2new1s, good to hear your fills are behaving now!:) Hope everyone has a great holiday! Deen",
      "MessageIndex": 1096,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 5, 2009 05:17PM TXBadboob wrote: Hi, everyone Jilli- I won't go back to work next week, but was hoping to the week after, but now I'm not sure of even that.  You're right about the stretches, my BS told me today no moving my arms as much as possible until the drains are out.(Oops!)  The yoga was kinda hard to do with the expanders.  They feel so tight! BS said it was a good thing I chose bilateral, I had DCIS and possibly IDC in my supposed good breast.  What a shock!  I chose bilateral mx because ILC tends to be bilateral and I tested pos for the gene.  God is there for me again!  Still waiting to hear about lymph nodes. Good night!  Deen",
      "MessageIndex": 512,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 17, 2009 05:58PM TXBadboob wrote: Happy St. Patrick's Day everyone! jpixstix, congrats on your good news! sueg, I am also still sleeping at a 45 degree angle, and a little pain and swelling under my arms where they took the sentinel nodes.  I think the edges of the expanders irritate that, too. 2new1s, congrats on your fill! My PS pulled my drains today!Yeah! I also got 100cc's filled today.  That's 3 or 450cc total so far.  I'm actually almost back to my old size. I also took a Darvocet before I went. Today was beautiful and I walked as far as I could go!  I started my arm exercises today, and I'm going to try to work half a day tomorrow.  Please say a prayer for me, girls! Deen",
      "MessageIndex": 661,
      "PostDate": "17/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 20, 2009 06:02AM - edited Mar 20, 2009 06:03AM by TXBadboob",
      "MessageIndex": 689,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 22, 2009 09:29AM TXBadboob wrote: Dani, thanks so much for your understanding.  You sound like I feel today, just tired of it and wanting to move on.  I was so excited when my PS said I could start using my arms again, but now I'm in too much pain.  I think you're right, work really wears me down more than I thought it would.  Driving seems to be worse!  I live in the country, so it is a long drive to anywhere.    I tried to wear a sports bra Thursday that zipped in front.  Thought I would not make it through the day!  Guess I'll stick to loose fitting shirts for a while.  I'm so tired of all this:(   Thanks for letting me vent, Deen",
      "MessageIndex": 716,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 10, 2009 06:22AM TXBadboob wrote: Hope everyone has a Happy Easter! Deen",
      "MessageIndex": 833,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 1, 2009 06:37PM TXBadboob wrote: Terri, I had the BMX with TEs, and I went back to work after 2 and a half weeks.  I had four drains coming out of the hospital.  They took two out after a week, then the other two a week and a half later.  You can go out with the drains, I just hid mine under hoodies.  My PS filled my TEs at surgery, so I had some humps when I woke up, I was pleasantly surprised!  My foobs look good already in clothes, not just baggies. There is a picture forum where you can share with other women who have gone through this and post pics of the different types of surgeries and recons.  I think you have enough posts on here to get on.  Just PM TimTam and ask her permission to get on the picture forum.  It has really helped me a lot and is totally private.  TimTam is very careful about who she lets on there to insure everyone's privacy. I had my last fill today.  I'm ready to pop!  Next is coordinating my oopherectomy with my exchange surgery.  I'm so looking forward to putting this behind me and looking to the future!  Have a great day!  Deen",
      "MessageIndex": 939,
      "PostDate": "01/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 2, 2009 07:44AM TXBadboob wrote: Hi ladies,   I feel I have to tell my son's story.  When he was 17, he broke into my neighbor's house and stole some VHS movies.  He pawned them, probably for drugs or gas money, etc.  He was charged with B&E, and went to jail for 2 years.  We went through Hell during his teen years!  After he got out, it looked like he was going to go right back to his old ways, but a friend of his got him a job at a sleep clinic they worked at.  He met a wonderful girl online and they have been married for 4 years now.  He is doing wonderful and they are in the process of buying a new house.  My point is that this was a miracle for me, and no matter how bad it seemed, I never stopped loving him or praying for him.  It worked, if not as fast as I wanted it to, but it did!  Please just keep praying.  I'll pray for them, too. Deen",
      "MessageIndex": 943,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 11, 2009 06:48AM TXBadboob wrote: Hello, ladies, I will be finishing my last chemo Jan 23, so I'm hoping to have surgery late Feb.  I have appts coming with some different PSs, as I wanted to know all of my options.  Does anyone know what the weight or BMI limits are for the DIEP procedure?  I am 5'2\" and weigh 120 lbs.  I have a little belly pooch from not working out as much since 6 mos of chemo.  I mostly walk a lot now.  Any advice would be great.  Thanks, Deen",
      "MessageIndex": 48,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 15, 2009 06:55AM TXBadboob wrote: Hi, everyone caligirl, sounds like you just cut loose an anchor to me!  I'm glad you found the new support from your neighbors.  It seems like you're already looking forward now, and that's great.  We're all here for you, too. 2new1s, how's it goin'? Jilli, my son(25) went through a little of that when I started chemo, he didn't know what to say to me, so I talked to him very little at first.  Then slowly he started calling me and asking questions, and has been there for me all the way since surgery.  Granted I did 6 mos. of chemo, so it took a while, and I was very hurt by him and his wife, who I had thought of as a daughter.  I'm just glad they came through.  Maybe it will be that way with your DH, too.  My prayers are with you. Hugs to all! Deen",
      "MessageIndex": 627,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 18, 2009 06:44AM TXBadboob wrote: 2new1s, I was a B cup before, and I would like to be a large C, I think.  I'm an orthodontic tech, so I won't be able to do a few things, but I should most. Bee, my expanders don't seem too high, just tight under my arms, maybe they will fall with gravity:) Anyone interested in seeing pics of women going through this can PM TimTam to get on the picture forum.  It really helps to see all of the different experiences women go through, and maybe share your own.  I posted some pics yesterday and will post more at the end of the week. Well, I'm going to work now, wish me luck!  Have a great day! Deen",
      "MessageIndex": 665,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 24, 2009 06:06AM TXBadboob wrote: Hi all, I got a sports bra by Hanesport at Walmart that zips in front.  I always liked it because it didn't make me look so flat when I worked out:), but now it's easier to put on than my others.  It's also very comfortable.  I can't wear it for long now though, I'm still too sensitive under my arms.  I'm going to look at Target for the ones ya'll are talking about. Hope everyone has a great day! Deen",
      "MessageIndex": 730,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 18, 2009 06:07AM TXBadboob wrote: hope4cure,  I am also going for fills every other week.  I get 100cc per visit, does that sound about right?  I get sore for around 3 days after, but not too bad.  I have been doing small weights, and I think it might be helping those muscles around my underarm and behind there, where I was sore.  Hope you get feeling better soon.  Take care, Deen",
      "MessageIndex": 873,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 24, 2009 04:27PM TXBadboob wrote: jpix, yeah for no drains!  Hope you continue to get better! dani, sorry about no fills.  My skin is starting to get shiny, too.  I put cocoa butter on them, but it's still shiny. jilli, glad to hear from you.  How's that belly button doin? Hope everyone is doing well, Deen",
      "MessageIndex": 907,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 8, 2009 05:52AM TXBadboob wrote: Terri, I'm so sorry you didn't get a tx plan yet.  I think going to an oncologist is a good idea, and I agree with Jilli that having a BMX may let you avoid chemo.  I had to have both, because my tumor was bigger and I tested pos for the gene, but I didn't have to have radiation.  I am on Tamoxifen now until I get my ovaries out, hopefully next month, then I will go on Femara.  So these hormone therapies may be an option for you, too, since our dx and receptors are similar.  I don't know about the clinical trials, almost sounds like oncotype testing.  You might also look into that.  Waiting and seeing is the hardest part!   Sometimes my DH doesn't understand either, he wants us to go back to before \"C\", but it just can't happen.  He also was afraid to touch me, but has recently started getting a little excited (facinated) about the new, improved girls, and is coming around.  I think he just couldn't go without any longer 2new1s, I'm sorry you're having to wait so long for you other foob.  It's heartbreaking after all you have been through, I would think the Drs would understand that and fasttrack you! Have a better day ladies!  Deen",
      "MessageIndex": 956,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 15, 2009 05:53AM TXBadboob wrote: 2hands4me, it sounds like you're bouncing back nicely.  Please rest and take good care of yourself.  It's early as far as moving your arm, remember baby steps!  Feel better!:) Bee, I'm so sorry you're having to go through this so much!  Please feel free to rant and rave here anytime you want to.  We're here to help as much as we can, good ears and dry shoulders to cry on!  My prayers are with you now. my560sel, how's it goin with the upcoming surgery?  Hope you are feeling well. {{{{HUGS}}}} Deen",
      "MessageIndex": 1121,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 28, 2009 01:21PM TXBadboob wrote: Bee, my prayers are with you for great results on your PET scan.  For sure, by Spring, you can rest assured that you ARE a survivor!  Invasive or not, the important thing is we caught it! Jilli, how are things going with you? Terri, Good luck on the exchange, keep in touch with your results about the bloodwork. Deen",
      "MessageIndex": 1134,
      "PostDate": "28/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 29, 2009 02:57PM TXBadboob wrote: Jilli, good luck on that, and yeah, I would be nervous, too!:) Deen",
      "MessageIndex": 1136,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 12, 2009 07:12AM TXBadboob wrote: Bee, this is great news!!!!  Now you will have some peace of mind with the holidays coming up and can really enjoy them, hopefully with your grandbaby!  Good luck with your reconn, I have some issues with mine also. Terri, are you nervous yet?:)  Just a few days away, and you can have your new beautiful soft, squishy new foobs!  I know you will love them. {{{HUGS}}} Deen",
      "MessageIndex": 1143,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 5, 2009 06:14AM TXBadboob wrote: hope4cure,    I'm glad your surgery went well!  I don't know about the wrinkle, but I do have a little rippling that kind of radiates from my scars.  On Wed, I go for some fat injections for this and the stepoffs I have from my chest being so thin.  He will take fat from my tummy, which lately is not so thin!   I had 600cc implants, and am a small c cup, but from what I have read here, it depends on how much they took in the mx, width of chest, skin conditions, etc., so everyone is different on the cc's.  Look on the pic forum if you can. Deen",
      "MessageIndex": 1098,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 18, 2009 06:18AM TXBadboob wrote: Hi Michele!  I keep up with you on FB!  Sounds like you have a really large,close family like me.  The nip surgery is quite easy compared to the other surgeries. Terri, who is that in the pic with you?  Is that your grandbaby?  I'm going to be a grandma in April!  I can't wait! 2new1s, I'm sorry you're having troubles.  The weight loss is a good SE though!  I tend to eat more when I'm stressed:( Hope everyone has a great weekend! Deen",
      "MessageIndex": 1110,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Nov 21, 2009 06:57AM TXBadboob wrote: So nice to see everyone back!:)  Hope everyone has a great weekend! Deen",
      "MessageIndex": 1129,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 31, 2009 08:00AM TXBadboob wrote: Three mos of Abraxane caused my neuropathy, followed by 3 mos of FEC, which I think prolonged the problem.  So I have been off chemo for 2 mos, and I still have the numbness in my fingertips, I think my nails will still take a few months to grow out the \"tree rings\" effects.  I didn't lose any nails, but I kept them super short and worked with gauze tape on my fingers.  I thought I was out of the woods with my toenails, went for a pedicure a month after chemo, and now my toenails are coming up like my fingernails did.  I actually have an ingrown nail on my right foot because of it:(  Sat night it was very painful, and I used my lidocaine on it to get back to sleep.  I've been babying it carefully to avoid infection.  So last night I talked to my stepmom, and she informs me she just had her big toe amputated last week because infection in her bone from an ingrown toenail!  Whoa!  So, I'm going to the Dr Friday and I'll have him look at it, though I think it's getting better.   Looks like it will take a long time to get over this, just like everything else with this #%$^ disease! Deen",
      "MessageIndex": 34,
      "PostDate": "31/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723974",
      "Title": "Finger/fingernail problems? How common? Texas357 Texas357"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 11, 2009 09:18AM TXBadboob wrote: Sounds like she needs to see a PS about this, someone with some experience in breast tissue and scarring. Deen",
      "MessageIndex": 1,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740177",
      "Title": "All Hard Rock R.Breast Lumposcar3yrs TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 10, 2009 09:27AM TXBadboob wrote: Ugadawg and TexasRose,   You might find it helpful to look under the chemo forum for your month's group.  It was very supportive for me to go through my chemo with other women who were having their's at the same time.  My prayers are with ya'll Deen",
      "MessageIndex": 8,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/732260",
      "Title": "Portacath Insertion ugadawg_lover TexasRose"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 29, 2009 03:25AM TXBadboob wrote: javagirl, I was able to work out except on the bad days(usually two days after chemo for two days), and my chemo nurse said he thought it really helped my blood counts, too.  Sometimes on or around my bad days, I would just walk as much as I could.  Sometimes, you just can't get out of bed or get motivated.  Hope you do well with yours. Deen",
      "MessageIndex": 3,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731557",
      "Title": "Exercise during chemo javagirl39 Bethie1"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 23, 2009 08:50AM TXBadboob wrote: cck, I haven't had the fat grafting yet, but I'm talking to my PS about it next Fri, as I also have quite a big stepoff, which he warned me thin people often get.  If you will post on Exchange City under the Reconstruction thread, you will get a lot of feedback on this. Hope this helps, Deen",
      "MessageIndex": 1,
      "PostDate": "23/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/739350",
      "Title": "Back to Surgery cck mawhinney"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 7, 2008 09:39AM TXBadboob wrote: Hi, Sherry, I haven't had surgery yet, but I have ILC, still doing neo-adj chemo to shrink everything.  My onc said even after surgery, there might be bad cells left.  I tested pos for BRCA2 gene, so she said I could get my ovaries out, too, and I would not have to do the Tamoxifen.  I don't know if this is an option for you or not, but it might be something to ask about.  Sorry you have to go through this.  Deen",
      "MessageIndex": 1,
      "PostDate": "07/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725470",
      "Title": "LCIS in margins after bilateral mast sherry64 karen9516"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 27, 2009 09:50PM TXBadboob wrote: Twa, I had the swollen bridge, too!  I thought it was an allergic reaction to the chemo!  Made my face look flat. One of my SEs was smelling.  The smell of leather repulses me still.  The smell of other people's hair revolts me still!  I have been off chemo for 2 mos. now!  FEC made my skin really clear for some reason.  Abraxan made my skin break out like a teen.  The eye twitching nearly drove my crazy!  Also the tearing up.  I still think I smell the chemo in my sweat when I work out.  I know, I'm looney tunes! Sandy, my eyebrows and lashes were the last to go, but they're growing back really fast now. Shopping is a SE:), cool! Deen",
      "MessageIndex": 14,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731431",
      "Title": "What's your wierdest side effect ann-idiot ann-idiot"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 22, 2010 09:08AM - edited Aug 22, 2010 09:10AM by TXBadboob I had Abraxane in 08.  Weekly tx for 3 mos.  My hair fell out the 3rd week.  I had neuropathy in my fingers and later in my feet, but it is slowly getting better.  I didn't have any sickness from it, and continued to work throughout.  I had to have a shot of neupogen the day after tx each week for my WBC.  It definitely shrunk my tumor quite a bit.   I then had FEC every 3 weeks for 3 mos.  Now that one kicked my butt, but just for a couple days after.:)   I hope your treatments go as smoothly as possible. Deen",
      "MessageIndex": 4,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/756862",
      "Title": "Abraxane Anyone! hmh23 hmh23"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 25, 2009 08:57AM TXBadboob wrote: EMM, I'm sorry you're having to go through this.  That is a very confusing diagnosis.  You will need to be really proactive in getting real answers from your drs.  It is good that they are getting a second opinion, they are not blowing you off.   Please ask your onc about having the babies after Tamoxifen.  I'm not sure after these meds and IVFs you've had already, but mimi1964 gives hope for you.   Maybe someone else will chime in that has had this experience.  This is a great site for info. and support. My prayers are with you, Deen",
      "MessageIndex": 2,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/742731",
      "Title": "DCIS w/ lymph nodes positive ? EMM_ann EMM_ann"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 2, 2009 10:30PM TXBadboob wrote: Hi Michelle,   I'm sorry, I didn't have the mx and oopher/hyster at the same time, but I had my exchange and oopher/hysterectomy at the same time.  The abdomen area was quite sore, but not even bad enough for pain pills, and the incisions were tiny(laproscopic).  The exchange was also no big deal, except the nauseau after surgery.   My mx itself was quite a bit harder.  In the hospital two days, had to sleep sitting up on a big pillow for about four weeks, and I took pain pills as necessary.  Don't be afraid to take them, they will help a lot.  I went back to work part time after two weeks for a week, then on to normal time.  Don't rush it.  If people want to help you, have them bring meals you can heat up, and of course cleaning if you're alone.  You won't be able to lift your arms at first, so set things down at your level.   Right after surgery, take something to avoid constipation, I didn't have it with mx, but I had it with the exchange/oopher, and it took forever to go away.  I did start walking as soon as I could, as that was the only exercise I was allowed for awhile.  Walk, walk, walk, it will help you. Hope you breeze through it, Deen",
      "MessageIndex": 2,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/738163",
      "Title": "Breast and Ovary Surgery at the Same Time strngwmn39 Silverpullet"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 16, 2009 11:34AM TXBadboob wrote: rebilla, you need to talk to an oncologist to help decide on double masectomy.  I opted for the DMX also, and I had ILC in my left breast only.  I was covered by insurance for the surgery.  Good thing I got both removed, as the path came back and I had IDC and DCIS in my right breast as well!  The nurse you spoke to doesn't sound like she knows what's right about this.  If you will look around the forums, you will see a lot of women who get DMXs with only one side having the cancer.  I also highly recommend a second opinion on all of the treatment decisions.  You DO have time for this, and you don't want to look back on this with any regrets.  Prayers and hugs, Deen",
      "MessageIndex": 4,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/732468",
      "Title": "waiting for surgery rebilla rebilla"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 26, 2009 09:30AM TXBadboob wrote:   It could be a hemotoma or seroma, where the fluid built up behind the little incision.  It is fairly common and may need to be drained.  I'm glad they put him on antibiotics just to be sure.  I hope he gets better soon. Deen",
      "MessageIndex": 1,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/740924",
      "Title": "possible infection sadsel TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 8, 2010 09:43AM TXBadboob wrote: I work in an orthodontic lab and we make appliances for all types of TMJ problems.  I would advise that when you are having these problems, try using a soft mouthguard, such as the athletes use.  This will open your bite and relieve the pressure on your condyle(jaw joint).  Don't just ignore it, as it can get worse.  Hope this helps! Deen",
      "MessageIndex": 2,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/756392",
      "Title": "TH treatment and TMJ dental problem curious_one TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 24, 2009 10:26AM TXBadboob wrote: Ang,   I'm glad you're communicating with your Drs.  Please also talk to your onc about the depression, because when I was doing chemo it was kinda bad, and maybe they can prevent this for you with meds or group counseling.  I have found the group counseling is very helpful, and wished I had started when I was on the chemo.  Just nice to share with people who understand because they're going through it, too.  I also advise you to join a chemo group on this site for the month that you will start chemo.  This helped me a lot and I've met some lifelong friends. {{{HUGS}}} Deen",
      "MessageIndex": 8,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742613",
      "Title": "Depressed Ang7 TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Aug 8, 2010 09:47AM TXBadboob wrote: Hi Lynn,   I did Abraxane and it was 3 weeks for me, and it kinda all fell out at once, no kidding!  I took a shower that morning, and it was a mess.  I was pulling it out in handfuls.  I also had that funny feeling on my head, for both different treatments, just before it fell out. Good luck, Deen",
      "MessageIndex": 1,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/756357",
      "Title": "Hair Loss from Abraxane Lynn1 TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 9, 2010 07:52AM TXBadboob wrote: I didn't do TC, but I did Abraxane and FEC.  With the Abraxane, I got neuropathy pretty bad.  My fingertips radiated tingles, and numbness at the same time.  This started after the first tx. and continued.  My feet and toes actually started hurting after the tx was finished.   It has been since Jan 20, 09, and I still have some neuropathy in my fingertips, and my feet hurt quite badly if I stand too long.  My toes hurt when anything touches them.  I'm hoping that since they started later, they will also heal later.  I have a freind that has it in his feet, and cannot run anymore, although it has been 2.5 years since his last chemo. Hope this helps, Deen",
      "MessageIndex": 1,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/749481",
      "Title": "Peripheral Neuropathy and Taxotere faithfulc JudyM"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 23, 2010 10:41PM TXBadboob wrote:   I didn't do this specific chemo, but I will tell you that it has taken me a year to really recover from my chemo SEs.  The neuropathy has not completely gone away, and my onc said it may not.  Mine is in my fingertips and my toes.  Please give it time, and I hope your rads go smoothly. Get better soon, Deen",
      "MessageIndex": 1,
      "PostDate": "23/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/751676",
      "Title": "Side effects after chemo is over JudyM Texas357"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 23, 2009 06:21PM TXBadboob wrote: Pat,  I'm so sorry you're having to go through all this mess.  The only thing I can think of for you to do would be get referred to an infectious disease dr., like 2new1s had to do.  It is their job to find out what this is.  I have read from other women about getting cellulitis from their surgery, so you might want to do a search on that. My prayers are with you, Deen",
      "MessageIndex": 1,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731185",
      "Title": "Question Pat634 LRM216"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Apr 5, 2009 08:40PM TXBadboob wrote: It might be nerve pain, where so many have been cut and are repairing themselves.  I can't believe it would be lymphedema already, but you might check those symptoms, as you need to stay on top of that.  I am 5 weeks out, and I still get pains under my arms from the SNB.  I hope you get to feeling better soon. Deen",
      "MessageIndex": 34,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 8, 2009 02:54PM TXBadboob wrote: Hi rsdsboys,   I gained a little weight with my chemo, too.  I have read a lot about that we crave carbs while on chemo, and the steroids cause weight gain,too.  I'm having problems losing it now, I don't know if it's my age(46) or the Tamoxifen, but I'm dieting and working out, but don't see any progress in the fit of my clothes.  Try to eat more fruit, less carbs, to see if that helps.  I got addicted to cold grapes while on my bad days of chemo, you might try that. When you go into this site, go to Chemotherapy link, then scroll until you find March 09 Chemo thread.  I think this will help you a lot. You will make some great friends there.  You already have here! Happy Mother's Day!  Deen",
      "MessageIndex": 5,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733651",
      "Title": "ovary removal rsdsboys TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 22, 2009 10:35AM - edited Mar 22, 2009 03:09PM by TXBadboob Life,  I am sorry this is happening to you now.  I don't have experience with this, but I have read of this problem by a woman here named Swimangel172.  You might look her up and read her story. Prayers for you, Deen",
      "MessageIndex": 1,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731150",
      "Title": "Abdominal Hernia after DIEP? Lifestooshort1 swimangel72"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 15, 2009 11:26AM TXBadboob wrote: I had neo-adj chemo and had Neupogen shots the day after each weekly tx of Abraxane for 3 mos, then Neulasta shots after each tx every 3 weeks of FEC.  I had a little bone pain, but I really think that was from losing my estrogen so quickly.  I didn't like getting the shot in my tummy, and during the FEC, my red cells went down, so I had to get another shot in the tummy for that, too.:(   After the chemo, I had BMX(BRCA2+), and they still found IDC in the other breast(never was checked in that breast).  So don't know how big that one was before surgery and how much it may have shrunk from the chemo.  My ILC shrunk a lot.   I hope you get through your tx just fine, Deen",
      "MessageIndex": 12,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/745204",
      "Title": "neo-adjuvant chemo 1marmalade1 toni30"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 27, 2009 08:56PM TXBadboob wrote: Maybe nerves?  Sometimes nerves are cut during surgery, and it may take awhile for the damage to heal itself.  Hope you get better soon. Deen",
      "MessageIndex": 1,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/731496",
      "Title": "numb baby finger worried000 laughlots"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 9, 2009 08:10PM TXBadboob wrote: I started neo in Aug 08, Abraxane every week for 12 weeks, then FEC every 3 weeks for 12 weeks.  I only have one left to go.  At the halfway point, I got an ultrasound and it had gone from 2.9 cm to 1.9., and the lymph node had not shrunken too much.  I definitely can't feel it anymore.  Yeah!  Deen",
      "MessageIndex": 15,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/709810",
      "Title": "Anyone done neoadjavant chemo? mommy3abm Joyceska"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Sep 27, 2009 09:04AM TXBadboob wrote: Cheryl, S is lucky to have such a good friend in you.  I will be praying for her, also Alicia. Deen",
      "MessageIndex": 2,
      "PostDate": "27/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741041",
      "Title": "A rqeust plez victoriasecret TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 23, 2009 09:25AM TXBadboob wrote: Ang,   I'm so sorry you're having to go through this.  I remember how devastating it was when I found out I would have to do chemo.  Boy, you've got a houseful!!!",
      "MessageIndex": 1,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/742613",
      "Title": "Depressed Ang7 TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 22, 2009 10:31AM TXBadboob wrote: Hi, Red I also had that hurting stickiness under my arms.  I did have one SNB on each side, so I thought that was why.  I put a little rollon deoderant in the crease, and it seemed to help for a while.  Also, the little stitches that hold the drain tubes in can hurt for awhile.  I think my expanders irritated my drain tubes,too. I am three weeks out, and getting a lot of muscle pain in my chest.  I think I may have overdone things a little, too.  Good luck on getting drains out.  Just a warning, I still had a little fluid come out of the holes after tubes came out, but it finally stopped after 2 days.  Take care, Deen",
      "MessageIndex": 12,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 15, 2009 10:02PM TXBadboob wrote: Hi, jpixstix,   Had my BMX w/TEs on 2/27,  I'm not even supposed to raise my arms that high yet!:)  I also can't lay flat yet either without pain.  I prop myself up on a large pillow at about 45 degrees.  The pain seems to get a little better every day.   You might want to join our February surgery thread in this forum.  Kinda helps to see what everyone is going through at the same time. Hope you don't have to do chemo! Gentle hugs, Deen",
      "MessageIndex": 2,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730777",
      "Title": "bil/mas with t/e, when will I feel comfortable again? jpixstix JanMarch"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 8, 2009 02:01PM TXBadboob wrote: Hi rsdboys, You're right,supposedly I am cancer free, but the BC is still looking over my shoulder, and I think it always will, with every little pain and weird condition, you wonder.  I think you would really benefit from getting on the March 09 Chemo forum.  I'm on the August 08 chemo forum, and they helped me a lot through this as we all went through it together.  A great place to vent, cry, talk about you fears, not being able to sleep from the steroids, etc.  Try it out! Have a great day, Deen",
      "MessageIndex": 3,
      "PostDate": "08/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733651",
      "Title": "ovary removal rsdsboys TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 9, 2010 09:59PM TXBadboob wrote: I had my ovaries and tubes removed in June, and I was surprised that I had no bleeding.  I also had my uterus out. Definitely keep an eye on it and call them Monday if you need to.  If it gets worse, just go to the ER if you have to.  Hope it gets better, Deen",
      "MessageIndex": 1,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746517",
      "Title": "Bleeding after Ovary Removal - need advice? encoremom encoremom"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Jan 10, 2010 04:36PM TXBadboob wrote: My worst part of surgery is the problem with the ole bowels:).  Even Milk of Mag didn't seem to work for me.  Just had to give it time!  Good luck! Deen",
      "MessageIndex": 3,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/746517",
      "Title": "Bleeding after Ovary Removal - need advice? encoremom encoremom"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 7, 2009 02:01AM TXBadboob wrote: Hi rsdsboys, I also am getting my ovaries removed, probably in June.  I'm getting them out at the same time as my implant exchange, to hopefully save a surgery and recover at the same time.  My last chemo was Jan 21, after 6 mos of chemo, and I'm SOOO glad it's over!  I'm glad it's not so bad for you.  I know what you mean about the hair on your legs!  My eyes also watered a lot with the FEC, but it's stopped now.  My hair started growing back about 6 weeks after my last chemo.  Also my eyebrows and eyelashes.  I'm on Tamoxifen until I get my ovaries out, to shut down my estrogen, then I will probably go on Femara.  I'm sorry you had to join us here, but you will find some great friends and share a lot of experiences here.  It has helped me so much. My prayers are with you, Deen",
      "MessageIndex": 1,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733651",
      "Title": "ovary removal rsdsboys TXBadboob"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "May 29, 2009 08:10PM TXBadboob wrote: My PS told me on Tues that I could continue to see the breast surgeon or the onc, it didn't matter.  I continue to see my onc, but my MIL sees the breast surgeon.  I also think it matters that she specializes in breasts.  I personally like both of them:) Deen",
      "MessageIndex": 1,
      "PostDate": "29/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735009",
      "Title": "Why continue seeing surgeon after tx has ended crazy4carrots JROGBURN"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 5, 2010 11:27AM TXBadboob wrote:   It is so nice to know that I am not alone with this problem.  My PS said my arm pain was my shoulders, my age(47), etc.  I still am not sure, as I am on Arimidex and Zometa also, but I remember the pain right after my BMX, thinking they wrenched my arms during surgery, but the pain was minimal, eventually getting worse.   I wanted to let everyone know about this book I checked out from the library:  it is called \"The Breast Cancer Survivor's Fitness Plan\" by Carolyn M. Kaelin, MD.  In it, they talk about the why's of the pains we are feeling, and suggest the things we can do about them.  They have gentle exercises for every type of surgery and reconstruction, including the frozen shoulder that they say is common after surgery.  They talk a lot about lymphedema and careful things to do about that.  I like it so much I am going to buy it.  Wish I'd known about it after my surgery, as I am a fitness freak and may have overdone myself too soon, hurting myself further.   Hope this helps, and thanks again, Deen",
      "MessageIndex": 263,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Dec 27, 2009 08:55AM TXBadboob wrote: This sounds to me like your breasts are very fibrous and dense.  They want to make sure that what they are looking at are lymph nodes, not small tumors.  Each person has a different number of lymph nodes, in different places, so they can't be sure since they can't see well through your dense tissue.  It is good that they are referring to a breast surgeon, since they specialize in this area and will know what to look for and make a decision on what to do.   They may want to do a biopsy on the suspicious mass, which is no big deal, but because of your age, it may be important to find out.  They may just want to monitor you with u/s's or MRIs to keep an eye on it.   Waiting is the hardest part, but please try to keep your mind off of it as much as you can until the time comes.  Saying a prayer for you now! {{{HUGS}}} Deen",
      "MessageIndex": 1,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/745685",
      "Title": "Understanding Report midmichiganmommmy midmichiganmommmy"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Oct 24, 2009 09:04AM TXBadboob wrote: REKoz,   I'm so sorry you're having to go through this, and especially so young.  I'm 46 and feel I'm too young!  I remember being so confused when I was diagnosed about all of the numbers.  The pathology report is going to be the thing that your treatment will be based upon.  You should request a copy if they don't give you one.  At the BCO start page, there is a link to your pathology report that explains everything on it in terms we can understand.  It really helped me, even though my oncologist explained a lot, too.   I went through chemo last year and masectomy and reconn this year.  It is very doable.  I hope that it will go smoothly for you and successful.  I'm saying a prayer for you now.  This is a wonderful website to go to for info and support.  I have met many friends here. {{{HUGS}}} Deen",
      "MessageIndex": 4,
      "PostDate": "24/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/742686",
      "Title": "Pathology Is Back - Cancer Lifeisbeautiful jenn3"
    },
    {
      "AuthorID": "TXBadboob",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/71473/profile",
      "Content": "Mar 15, 2009 04:56PM TXBadboob wrote: Hi, comingtoterms,   I had my BM w/TEs on Feb 27.   My PS put 350cc in my expanders at time of surgery, so I, too, was pleasantly surprised when the bandages came off.  I do have a little swelling, off and on, around the expanders and under my arms where the SNBs were done(just one lymph node per side). The feeling is very tight, sometimes with a little soreness, not unbearable, though.  Advil has been enough for those times.  Looking at myself, it looks like I'm half of what I was.(I was a B cup).  My first fill with my PS is this Tues.  Looking forward to it and a little nervous at the same time.   Hope this helps!  Have a great painless day! Deen",
      "MessageIndex": 2,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730763",
      "Title": "Ms w/ TE on 3/03 I am swollen! Why? comingtoterms comingtoterms"
    }
  ]
}