{
  "AuthorID": "txkari",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128477/profile",
  "Posts": [
    {
      "AuthorID": "txkari",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128477/profile",
      "Content": "txkari wrote: I just found out that after two partial mastectomies that were done to conserve my breast that I will be getting a full mastectomy in a few weeks. I have DCIS and the area is quite large, so to get is all, there is no other choice. I didn't want to go this route, and was genuinely caught unprepared for the mastectomy. I havent had a chance to meet with plastic surgeons yet -- that will happen this next week -- so I don't know what route my reconstruction will take. I'm 47 and single with no significant other in my life at this time. I have a fantastic network of friends and family supporting me, but in the dark of the night I'm doing this by myself. In trying to prepare myself for what is about to happen I (rightly or wrongly ... I don't know which) looked at some before and after pictures on the web. My reaction was very unlike me. I started to hyperventilate. Its not that the pictures were bad ... they were very tasteful and the woman in them was very beautiful. What shocked me was how completely the breast was just gone ... like it was erased ... no nipple, nothing, like it never existed. And until those photos, I guess I just never thought about losing my nipple either. I have always be a little squeemish, so I honestly don't know how I am going to look at myself in the mirror or touch my body. Where I am now is trying to figure out how to prepare myself for waking up without a breast. I am naturally large breasted (DD) so even if the reconstruction starts at the time of my mastectomy there will be a significant difference. I know I won't ever be fully prepared, but how do you get ready for such a major change to your body? (I mean no offense to anyone who has gone thru this before me. Please forgive me if my attempts to put this into words was clumsy at best.) Dx 3/4/2011, DCIS, 6cm+, Stage 0, Grade 3, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/768350",
      "Title": "Looking in the Mirror txkari rmf"
    },
    {
      "AuthorID": "txkari",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/128477/profile",
      "Content": "txkari wrote:  I have DCIS. The affected area is high grade and quite large, so I have no choice but to get at least a unilateral mastectomy. (I've had two partials already, and they were not able to get clear margins.) I'm wondering about the need to go further. Does anyone know what the risk level is for DCIS (or any other kind of cancer) developing in my healthy breast down the road? Could I please hear from others regarding why they chose to get a bilateral rather than just a unilateral and those that chose to go with just a unilateral? I really have no framework form making this decision. My mother, who died from breast cancer five years ago, had a unilateral. She was in her 70s at the time and the breast cancer (a different type than mine) was very advanced when it was found. I'm only 47, so I really have no idea what to do. I could really use some perspectives. I'm going to need to make this decision in the next couple of days. Thanks. Dx 3/4/2011, DCIS, 6cm+, Stage 0, Grade 3, 0/0 nodes Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/768404",
      "Title": "Unilateral or Bilateral txkari cinnamonsmiles"
    }
  ]
}