{
  "AuthorID": "Txmommyof2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247663/profile",
  "Posts": [
    {
      "AuthorID": "Txmommyof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247663/profile",
      "Content": "Feb 25, 2017 09:11AM Txmommyof2 wrote: Thank you for your replies, it means a lot to have someone to talk to even if its just a concern. I was having a hard time sleeping last night. I hope all is well and will post an update as soon as I hear back. Which hopefully won't be too after Monday.",
      "MessageIndex": 3,
      "PostDate": "25/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853021",
      "Title": "Too young for B Txmommyof2 ShetlandPony"
    },
    {
      "AuthorID": "Txmommyof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247663/profile",
      "Content": "Mar 1, 2017 03:15PM Txmommyof2 wrote: hey all just an update. Ultrasound guided biopsy was scheduled tomorrow and today was a preliminary exam with the doc. I told her it was getting bigger and annoying, and she replied \"well, it shouldn't be annoying it should be terrifying.\" whaaaat?! That comment was terrifying lol She said the mammogram and ultrasound were both abnormal and its growing rapidly and she \"is very worried it's cancer.\" so she said it would have to be taken out anyways. So instead of two procedures (biopsy then removal) she recommends I give her 7 days to find a doctor at the hospital to do an excisional biopsy and they can get 2 birds with one stone. So now its the waiting game again and I'll post when I know more. Her comments really terrified me. Anyways, I hope you all are doing well. And I'm glad I have someone to talk to right now.",
      "MessageIndex": 4,
      "PostDate": "01/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853021",
      "Title": "Too young for B Txmommyof2 ShetlandPony"
    },
    {
      "AuthorID": "Txmommyof2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/247663/profile",
      "Content": "Txmommyof2 wrote: Hey everyone, I'm a new member on here. Topic is supposed to be, too young for BC? I have been reading several different topics over the course of several months to try to compare to my story. I wanted to see what you all think? I am only 24 now (until my birthday on monday) and I found a hard lump about the size of a pea last year around June. It never gave me any problems but never went away, until recently in December it grew a little. I went to a clinic and DR felt it and send me for an ultrasound because I am too young for BC she told me they would skip a mammogram. It didn't show on the ultrasound and the tech said she could feel it but saw nothing. I was very confused when I was sent home with the \"wait and see\" approach. A month later in january, it doubled size and I went to ER to try to get a mammogram or some help because I didn't have insurance. They couldn't do anything since it wasn't an infection and told me to get a biopsy if ultrasound didn't work. However without insurance and a single mom of 2, a biopsy was way out of my price range so I left it alone. Now, a week ago, I realized my breast was heavy and when I lift my arms, the bottom half of my nipple dimples inward and my breast/nipple is flat when relaxed. It doesn't match my other breast, so I decided to feel it and the mass is 4-5cm! I went to a clinic again because I just got a type of women's insurance. They sent me for an ultrasound today and it came back irregular, because of the rough edges/grey area inside/and spots to the right of it, so he sent me for a mammogram right away. Doc said it didn't look like just fluid filled and it also didn't match with BC completely. So he said \"it doesn't match with a cyst completely and it doesn't have the shadows underneath like cancer would, so its a mystery we need to find out.\" I will be getting a call on Monday to schedule a biopsy. I'm nervous because I haven't gotten any answers, doc sounded worried during his explaining, and BC runs in my family. My lump is pretty big, has no give to it when pressed, and kind of lumpy fingers out to the inside of my breast. I have been told repeatedly not to worry because I'm too young. I feel silly for even considering worrying but I don't know what to expect? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/853021",
      "Title": "Too young for B Txmommyof2 ShetlandPony"
    }
  ]
}