{
  "AuthorID": "uberles",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167514/profile",
  "Posts": [{
    "AuthorID": "uberles",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167514/profile",
    "Content": "uberles wrote: Hi everyone.  My name is Amanda, I'm 35 years old, and have some very concerning symptoms in my right breast.  Now, I've always had \"cystic,\" lumpy breasts and have always had some trouble knowing new lumps from old ones.  However, quite some time ago (9-12 months), my right nipple began to be horribly itchy from time to time.  It bothered me, I remember mentioning it to my doctor, but it wasn't a priority for me.  In the last couple months, it began to itch daily.  My breasts, prior to this, were almost identical and while I'd heard that it was \"normal\" to have uneven sizes, I didn't worry about it - they were pretty damn close!  My right breast has grown at least a cup size, if not more, in less than a year.  So...there was the itching.  I asked my doctor about it and since I have a family history of breast cancer, she scheduled a screening mammogram (it will be on the 24th of January.  However, in the last week, it has begun to burn.  It still itches, deep down, but sort of like when you have an injury and it scabs over and is healing and itches, but you can't itch it because it hurts too much?  Well, that's where I'm at.  It is constantly itching and hurting and, occasionally, I have shooting pains in it.  Now, I'm not sure if maybe the pain is related to my menstrual cycle, as both breasts get more sensitive around my cycle, but it's VERY uncomfortable.  Any ideas, suggestions, commiseration, etc...  Has anyone had these same symptoms and how did it work out?  Thank you! Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "12/01/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/798748",
    "Title": "I'm not sure what's wrong, exactly... uberles momof3boys"
  }]
}