{
  "AuthorID": "umsami",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
  "Posts": [
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Mar 10, 2015 07:16AM umsami wrote: I honestly believe you need to follow your own intuition. If you do not feel that everything is OK, then be pushy. If the radiologist she sent you to does not specialize in breast health, then see if there is one near you that does. When I had my first abnormal mammo, I remember reading an article about a study in Scandinavia (I think) that showed an increase in breast cancers with hormonal IUDs like Mirena...but....I don't think you had it long enough to be an issue.",
      "MessageIndex": 3,
      "PostDate": "10/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829323",
      "Title": "How concerned should I be? How much should I push my Drs? WorriedOne Moderators"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Aug 27, 2014 07:57PM umsami wrote: So after calling me this morning to try and fit me in tomorrow, then then called me around noon to tell me it was cancelled.  Apparently, the radiologist had looked at my old films and decided that there were no changes to the lymph node and area of concern. Crazy. So amazing levels of stress for nothing and they cancel at the last minute anyway.  Glad it's probably OK, but this was really really weird.",
      "MessageIndex": 9,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823991",
      "Title": "So frustrated…Diagnostic Mammo and U/S postponed umsami Hopeful82014"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "umsami wrote: So last fall, I had a screening which showed something weird on my left breast. I ended up getting a diagnostic 3D mammo and u/s (only on the left breast). The area of concern was actually just a lymph node that was a little bit in an unusual place, but when they compared previous films, it was fine. But with the u/s they found some cysts and fluid under the nipple they wanted to follow. So I went back after 6 months this week, and the cyst had turned complex, and now they want to do a biopsy. The thing is, nobody has ever done an u/s of my right breast in that timeframe. I'm assuming if I have dense breast tissue, then both breasts are dense. Are they not doing an u/s on the right because insurance won't cover it or is it just because of protocol based on the screening? I find it weird because the mammo didn't find the problems we're following in the first place. Should I push for an u/s of my right or wait another 6 months when I'm assuming they'll do it as part of my annual mammo? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829135",
      "Title": "Doctor Ignoring the Other Breast umsami umsami"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "umsami wrote: My appointment for my diagnostic mammogram and ultrasound is supposed to be tomorrow morning.  I just got a call today that their machine is broken and they are rescheduling patients.  Of course, all of us patients who were supposed to be seen tomorrow now go to the back of the line.  Next available???  Two more weeks away.   I asked for the next available at any of their locations (including one where I'd drive 1-1/2 hours to get there)….it didn't matter. I've been so incredibly stressed over this, adding another two weeks is torture. So, what would you do?  Call another group and try and get in earlier…or just wait it out? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823991",
      "Title": "So frustrated…Diagnostic Mammo and U/S postponed umsami Hopeful82014"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Aug 26, 2014 06:38PM - edited Aug 26, 2014 07:48PM by umsami Thanks.  I did try other groups and knocked off four days.  Still a long wait…but better. I can't really call every day because I had to set up babysitting in advance, and it was difficult.  I may see if I can get some pre-approved days with friends and then try to call.",
      "MessageIndex": 4,
      "PostDate": "26/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823991",
      "Title": "So frustrated…Diagnostic Mammo and U/S postponed umsami Hopeful82014"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Aug 27, 2014 06:42AM umsami wrote: So I sent a message through the practice's feedback saying that I think they need to rethink their policy on rescheduling patients already scheduled for a diagnostic when they have an equipment malfunction.  Making them wait another two weeks is cruel.  I acknowledged that while I knew 80% would turn out fine, when it's you…it doesn't help with the stress level.   They called me this morning and said that they can squeeze me in tomorrow.   While I'm glad they're doing that for me, I really hope that they called all the other women in my same situation.",
      "MessageIndex": 6,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823991",
      "Title": "So frustrated…Diagnostic Mammo and U/S postponed umsami Hopeful82014"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Mar 11, 2015 10:55AM umsami wrote: Hi Asma: I'm sorry your family doesn't understand just how difficult this is. Luckily, every single woman here does! I hope your pathology report doesn't take two weeks. Hopefully you'll here something next week. Something like 80% of all biopsies are benign. May the odds be ever in your favor. :)",
      "MessageIndex": 3,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829363",
      "Title": "Waiting on biopsy results Asma Asma"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "umsami wrote: I remember seeing some posts from 2009/2010 on this topic.  Well, after four normal mammograms, I had an abnormal one.  Definitely something in the left breast.  Going in Wednesday for diagnostic mammogram and u/s.  I am 45.  Four years ago, I had a Mirena inserted after the birth of my last child.  I love it.  Easiest/best birth control.  I never knew the risks re: cancer…but then again, maybe nobody else did. So, for those of you who have been diagnosed or even through a scare, have you had yours removed? I'm thinking Paraguard (copper, no hormones).  This article/study is from July of 2014. http://edition.cnn.com/2014/07/08/health/iud-cance... \"But researchers did see a spike in the number of breast cancer cases, especially in women between the ages of 45-49, compared to women in the general population who were not using this particular IUD. \" \"The number of diagnosed new breast cancer cases among Finnish women who used LNG-IUS for menorrhagia was 19% higher than in Finnish general population,\" said Dr. Tuuli Soini, the lead author of the study. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823894",
      "Title": "Mirena and Breast Cancer umsami MelissaDallas"
    },
    {
      "AuthorID": "umsami",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204271/profile",
      "Content": "Mar 12, 2015 09:31PM umsami wrote: It's great that you are seeing somebody, but I'm sorry you have to wait so long. I agree with asking to be added to the cancellation list. In the meantime, you might want to see a gynecologist or your GP regarding your missed period. Are you very thin or an athlete which could affect your cycles? Have you ever gone this long without having a period? Have you done a pregnancy test? If you don't have a gynecologist, Planned Parenthood (in the US) does well women gynecological checks. If you're in college, most student health orgs will do them as well. Hoping everything turns out O.K,",
      "MessageIndex": 3,
      "PostDate": "12/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/829394",
      "Title": "super worried sashajjj umsami"
    }
  ]
}