{
  "AuthorID": "unique",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
  "Posts": [
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Aug 2, 2008 02:59PM unique wrote: Kaitlin, I'm SO sorry you are dealing with this so young.  I wanted to reassure you about the mastectomy surgery, as I had a mastectomy three weeks ago with 12 lymph nodes (2 were positive microscopically) and other than a little soreness I had NO PAIN. I don't know if everyone has this experience but it doesn't have to be awful, I just wanted to let you know. The only places that were sore at all were in my armpit, and that was mostly itchy. ",
      "MessageIndex": 28,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709468",
      "Title": "masectomy - seems like this sucks rseaw22 Mandy1313"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 13, 2009 10:18PM unique wrote: Now, forgot to mention the emotional aspect of radiation. I am ... well ... sort of freaked out by it in a way that is different than how I felt about surgery or chemo. I don't know why. It seems a little bit more \"scary\" in a way. I haven't a clue why, as it's much easier really than the other two things. Could I pretend that the other two were therapeutic, but being irradiated just seems spooky. Anybody else notice this at all?",
      "MessageIndex": 188,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 21, 2009 11:16PM unique wrote: Cupcake, talk to your doctor about Tamoxifen. Latest studies showing Arimidex et al not necessarily better, so if your SEs are just too much, maybe Tamox is the way to go. I can email you the info I have if you wish!",
      "MessageIndex": 363,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 24, 2009 06:03PM unique wrote: P.S.: I am sleeping around 10 hours a day when I can get it - and I had a day where I got up, showered, got dressed, and then went back to bed!!! I was that tired. I slept for three more hours. My onc said too early for fatigue, but who knows.",
      "MessageIndex": 400,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 26, 2009 07:11PM unique wrote: Forgot to write earlier - I had such a laugh from this Buddha saying from over on Etsy http://www.etsy.com/view_listing.php?listing_id=21411036 \"Let us rise up and be thankful, for if we didn't learn a lot today, at least we learned a little, and if we didn't learn a little, at least we didn't get sick, and if we got sick, at least we didn't die; so, let us all be thankful.\" -Buddha ",
      "MessageIndex": 438,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 28, 2009 10:42PM unique wrote: Hi Girls, The Club sounds great! I sort of feel like I'm in one already, over on the \"Wii Exercise\" forum. We are comparing our Wii FIT scores over there. I am not allowed to lose weight yet but am eating better - I never ate badly - but am focusing on getting more fruits and veggies and lots more water. Exercising really does feel great! Altho last week my son was sick I did not feel real good either, kind of tired, and as my onc says, it's impossible to sort out what is what sometimes. I was a bit dizzy on Tuesday and wondered about that, but it's not radiation because I had a dizzy thing - my GP and I thought it was probably inner ear. One half, love the avatar - about 10 years ago I bought a pile of those stamps, not realizing until I got home that they were VERY expensive. Well I gave to a good cause LOL! Donna, I'm sorry your oncs aren't helping you understand things more. I believe the DCIS is usually the smallest, earliest cancer to have, so please feel relieved that you are most likely in a very good situation! My Mom had this also and she had the lumpectomy and rads. Her surgeon told her it is like a pre-cancer. Check it out but you may be happy to know that you are in a better position than many of us! Usually they don't want to do a mastectomy unless there's a good reason, for example, I had a largeish tumor of 4+cm that was diffuse, none of the scans could show exactly where it ended. That's why I had the mast, I definitely did not want to have them not get good margins and have to do over! Studies have shown that lumpectomy plus radiation is JUST AS EFFECTIVE as mastectomy in many cases. I plan to go on an AI after rads are over, and one of us or both of us (my Mom and me) are getting tested for BRCA genes, on behalf of my sister, who is the gal who didn't have a problem yet. Well she had a biopsy but it was \"just\" calcification and they want to keep an eye on it. She is kind of annoyed by this LOL! Not half as annoyed as I was when I had a cancer diagnosis!!! Maybe keep trying oncologists until you find one you like ... if your insurance permits ... I saw four oncologists but the first one I saw was a doll - I just wanted to double check what he was telling me, and he was right on. Plus he was kind, listened well, has a good perspective, was angry on my behalf about what is not yet known (he thinks they should know more by now!!!), etc. I adore him.",
      "MessageIndex": 461,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 2, 2009 05:29PM unique wrote: Hi, Girls ! I thought I would feel better going to a lymphedema specialist for some exercises, but now the ladies on my breast email list say it is going all wrong. I don't have lymphedema, was just hoping for practical exercises/massages I can do myself to hopefully prevent it. Are any of you seeing a lymphedema PT? Worrying at all? I would think those having rads to one place maybe should not worry - but I am having the whole upper left chest area and rads to nodes under the arm. I really liked the LE PT, she is LANA certified and I thought she was terrific! However, lay ladies on list said no pressure sleeve, that can cause lymphedema. Yikes. Anyway had a radiation snow day today and a LE PT snow day as well. Denise and Joy, hope the snow didn't mess you both up too much! I know it was a mess in the Southeast. Here is PA we got a fair amount but the plows were out so tomorrow it should be okay driving in the mini compact Honda.",
      "MessageIndex": 476,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 3, 2009 10:20PM unique wrote: Debi, how long does your treatment with four fields take every day? I am glad you got your attendants back. I think they must have meant millimeters! The one saving grace today was that I knew they really wanted to get it bang on. They were talking about 2 mm to the left or right. Jane, does the LEPT stretch the muscles right after treatment, or at any appt. later on in the week? I have done Day 14, almost half thru! Woo hoo!",
      "MessageIndex": 494,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 13, 2009 11:39AM unique wrote: Are you sure you want to know?",
      "MessageIndex": 559,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 18, 2009 12:02PM unique wrote: Denise ~ I second those who suggested maybe a break from radiation. Now I re-read your post and it seems you are having boosts now. I think we really have to bug our docs - they may not have experienced this first hand and felt how vulnerable it feels to be a patient. We have to be brave but we are also scared of what is happening to us. I'm glad the gel helped - is it still helping? Did you tape it to yourself? Did it stay on at night? I would prop myself up with pillows or something or wrap myself up to make it stay on if it were me!!! I am all brown under my armpit and red on my whole upper left chest area. It's itchy, but only really sore on one part of my mastectomy scar under my armpit. It's not in an area that moves, so if I'm not moving I don't feel it much. But the armpit does indeed look like overcooked bacon. I hear the skin damage goes away but I'll bet it doesn't completely. Oh, well.",
      "MessageIndex": 616,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 20, 2009 09:32PM unique wrote: BTW, I tried glucosamine at one point for my back arthritis, and it made me sick to my stomach, so I stopped it.",
      "MessageIndex": 638,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 22, 2009 08:21PM unique wrote: Interesting to read your discussions about when to see doctors. I have a pile to see when I finish up here. Some of them had appointments to see me earlier, but I put them off because while doing rads one dr. appt. in a day is really enough for me. I'll ask my onc about the surgeon, when to see him. I know I have to see the other onc about the AI, but will wait until my bone density tests to come back. Then I have to do the dentist, the colonoscopy, the gyne, and of course my GP for my anxiety meds. I have to be careful as I only get 18 doctor visits per calendar year, not to do too many, only the exact right number! I will pay out of pocket for more if necessary, but I didn't want to overdo!",
      "MessageIndex": 660,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 28, 2009 09:44PM unique wrote: Debi - I'm just in shock about your sister. I am so sorry for you. I have lost loved ones and it never gets any easier. It is always just hard. You have to break your pact though and get better for her. Be a vessel for channeling her on earth, okay? Tell us all about her and know we have you both in our hearts here.",
      "MessageIndex": 699,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 1, 2009 02:19PM unique wrote: Hi all! Supposed to rest today but hey, once on the train, how does one slow down? I have to go pick up my car, it got inspected today. Yesterday was my first day after finishing rads, and I would have liked to rest, but I had my lympedema PT appt. She said things are looking good, swelling is going down a bit. She wants to see me Friday but thinks that should be my last appt. So maybe next week I'll get a bit of rest. I am still really poopy-tired. And interestingly on my discharge it mentions bowel troubles as something that may improve in 10-14 days. Well, I've been having some nausea and diarrhea for a couple days, thought it was a bug, but could it be an SE from rads? I didn't have it until last week? My rads team smiled and said it could be - huh LOL. debi, I continue to think about you and your sister. You'll be in my heart and prayers, ok?",
      "MessageIndex": 723,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 18, 2009 10:06PM unique wrote: Hi, Seabee ~ It seems you are right on the edge between those who need chemo and those who don't? And how much does your Femara cost? I looked mine up on my insurance web site and it says $450 for a 3-month supply. Ouch! My insurance is supposed to pay 50% after my $250 deductible. Does that mean Femara is really $900 for 90 days? This sounds about right as my Mom has Part D Medicare and hers is free until she falls into the donut hole and then it is about $300/month.",
      "MessageIndex": 799,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 5, 2009 02:44PM unique wrote: Hiyas! I thought I was starting in January but I go for my second planning session next week. So I guess I'm in the February group!!! Nice to meet all you gals!!! This site is amazing!!!",
      "MessageIndex": 58,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 5, 2009 03:25PM unique wrote: Lories - Don't put me on your list yet, as I don't have a start date. I would guess 3rd week in Feb., good grief am I going to have to migrate to a March rads list? I don't know for sure. 2nd planning is next week.",
      "MessageIndex": 61,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 12, 2009 12:21PM unique wrote: Lories, cdcpa, sim + mandy! Thanks for posting about the circles. Well, for me that's the mystery, as I got 3 tattoos my first simulation session. Now I have blue marks and circles. I'm going to ask about the Tom's today as well as whether I can decorate my chest. Confuse the geeks, hey! Just kidding. On another note, well wishers out a bit further in my social circle are being lovely and calling about getting together, and I've felt a little guilty because there's no real reason I can think of why I can't. It's just that I feel uneasy about scheduling too much stuff until I get used to going to rads every day.",
      "MessageIndex": 166,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 12, 2009 09:48PM unique wrote: Seabee - I think someone posted on here they decide whether to give you higher doses in fewer days or lower doses in more days. I'm getting 33 - 2 down, 31 to go. They did the bolus today. I am avoiding looking at anything tho, so I don't know what it looks like. They also added more tattoos. I may have lost a little weight, perhaps this is why. I got tattoos three weeks ago when I did my first planning session, then the blue marks and circles for the past two days. I'm liking the My Girls cream. It is very soothing and not sticky or messy, just melts into the skin. No redness yet, just a little bit of tightness in the skin. I took a small bit of the My Girls cream with me to radiation and put some on right after. Then more before putting on pajamas. I may need a camisole or something - I'd do the undershirt thing but I have only one boob, so if I'm out I need something to hold my foob.",
      "MessageIndex": 172,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 13, 2009 10:15PM unique wrote: Hello everyone! I did treatment no. 2 today and I'm getting better at it. Well, I get in position and then we all realize I haven't slipped my arm out of my gown. A subliminal desire not to disrobe? During the planning I had an awful time with my neck, so today I brought a small herb pillow with and that worked very well. I am also spending a little more time with a side to side yoga neck exercise. So in addition to the triangular leg thing they give me, I have a small pillow for the small of my back and my neck, which has to twist so my head can turn right so I guess I don't get my nose zapped. I must be having 4 fields zapped? I have 4 marks, one in center, one up on collarbone, one under armpit in middle of body. Wait, that's only three. Well I don't remember exactly where the other one is. I feel like I'm in a planetarium with the machine going around to do the zaps at an angle. Nothing is pink yet but the skin feels tight and a little \"burnt\" but not really sore. Well, whenever I feel a little discomfort, I put on some My Girl's cream and it goes away immediately. I really love that cream. I feel kind of spacy tonight but not really too fatigued yet.",
      "MessageIndex": 187,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 21, 2009 12:16PM unique wrote: Jobu ~ What a lovely essay, almost poetic. Your center has a wonderful way of easing you thru the process. Mine has some nice features, but I could have used the blanket yesterday!",
      "MessageIndex": 344,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 26, 2009 06:35PM unique wrote: Hi, Mandy ~ You actually read the article I sent you! I think I started reading and then got tired and forgot to finish. What is Ki67? My thinking about all this is maybe try an AI unless you don't have a good prescription plan OR start having low bone density. In which case maybe switch to Tamox. I'll ask my onc about all these things when I go back after rads. I am getting a bit pink and today even my camisole is irritating me in a spot right in front of my armpit, you know where there is that little muscle there? (Or tendon?) Anybody else ahead of me with supraclavical and axial fields who has some ideas for me?",
      "MessageIndex": 435,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 26, 2009 06:55PM unique wrote: Hi dear girls, My, my I am not the only one worrying! Do they say misery loves company. Well I feel better hearing you all whining (big grin). Cupcake and Kfinnigan, I am also getting the bolus. It is kind of like a big washcloth. I have been worrying that it is actually a big washcloth and it should be more rubbery. But I have not looked at it to be honest. I am feeling rather overwhelmed and just like an ostrich closing my eyes and sticking my consciousness in the proverbial sand. Not really like me - or maybe I have gotten this way over the years - just too much to deal with. I also feel uneasy that my heart or lung will get zapped but I did ask my rad onc about it and she said they will do an oblique angle to avoid that. So what more could I ask? Yup, Mandy, I could ask her to show me the fields. Maybe your example will encourage me to ask. The ambience in my rad office is in between the best and the worst of yours, but everyone is really nice. It would be fun to be offered coffee! Wow! Mom, why don't you ask if a change can be made \"I wonder if you could wait until I come out because I feel rushed and like the next patient might burst in on me!\" Don't criticize, suggest and ask for what you want. Actually, I have been feeling the whole changing, getting into a gown only to go in and spend time taking it off is kind of a waste of time!!! Maybe your center has a tough schedule and thought it wasn't that important to spend 10 mins per patient on the whole gown shebang. But it IS IMPORTANT to you, so let them take the extra time and care for you, okay? Kari, all I know about reconstruction was they told me I would only be eligible for the TRAM flap, not the expander/implant thing. I definitely did NOT want the TRAM flap, leave my other body parts alone, please! I do know rads is hard on reconstructs, so many have it done after rads. But your skin is kinda messed up by the rads, so I wonder for myself, how is this all going to go? I am trying to be patient and wait and see. Oh, the reason I wasn't eligible for an implant was my tumor was superficial so they didn't think there'd be enough skin left over for that. I have a fantasy they take my other boob and make two small boobs out of it for me.",
      "MessageIndex": 437,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 3, 2009 02:00PM - edited Mar 3, 2009 02:00PM by unique I'm worrying and worrying this week. First I had to cancel my PT appt for Monday and have to wait a whole other week to see her. Then today rads took a LONG time, about an hour or longer, because they just could not get me in the right position. They always want my torso to go left and my shoulder to go right. Just not a very happening thing. Anyway, I can be fairly comfortable with the wee back pillow and neck pillow, but after all the realignment of me the neck pillow was out of wack and the arm was hurting. There's an arm holder where you put it so it's up and over your head. It tends to go to sleep in the \"cuff\" part on the best of days and on the worst it hurts like hell. Now I have a thought it will cause lymphedema in that arm. I thought about Guantanamo prisoners being in positions for long periods of time and have sympathy about that, because it hurts like hell! It's a metal table and it's hard. What are you all lying on? What holds your arm? Does it cause discomfort, the way you are lying? My treatments take a lot longer than I thought they would, too - the shortest are about 25 minutes because I have 4 fields to zap. Kfinnigan - your docs are sort of right, sometimes you can get lymphedema no matter what. But there ARE exercises you can do to decrease your chance of getting it. I got my referral from my doctor but then went online to www.lymphnet.org/resourceGuide... to cross-check. You want a LANA certified therapist. Just enter your zip code.",
      "MessageIndex": 487,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 10, 2009 10:59PM unique wrote: Gals - Just finished #19 and am really zonked. Drove my son to his art class tonight and then crashed on the couch outside the classroom with a magazine over my face and slept for the whole two hours. Not a deep sleep though, I kept thinking I felt my heart hammering. Putting on my PJs tonight I notice my left side has a definite square red area with the edges right where my tattoos are. So they are right on their plan. Kinda neat. I also have some redness on my back, I didn't see it but I've been itchy. Doc says to use cream on it, but I can't reach it! Got my 11 y.o. to apply cream there. 14 more to go, three weeks and I will be done. Have to keep my eye on that. I'm getting there. I got a pressure sleeve but it feels too tight at the top of my arm. I called the PT to see if I can dodge in there and check the fit. Or will go back to the pharmacy and try the medium size. I am right on the edge between those two. I'm just so pooped, even my brain is pooped, so I'm not doing what I'd normally do, such as try on both sizes while I was there.",
      "MessageIndex": 541,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 14, 2009 09:33PM unique wrote: Hi dears, About the undies, I figure if I had to go thru the TOTAL humiliation, at least I should get some humor mileage out of it for the rest of my life. So anyone I figure can handle the grossness, gets the funnies I've certainly enjoyed from it. I've tried all kinds of methods to get calm, and only yoga and Klonopin really work for me. Must be my personality. Yoga works most of the time. But I'm glad I have the Klonopin, I haven't needed it for quite awhile tho. I feel SO much better today, guess my body had a chance to heal. I didn't do a THING. My kid and I just watched TV, played video games, ate food, and did computer.",
      "MessageIndex": 577,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 26, 2009 04:58PM unique wrote: Well ... I have been woozy in the mornings again lately. What I mean is, when I get up out of bed, I feel a little dizzy. Not spinning, but a bit of a lurch. Also, I do rads at 9:15, and often in the last week or so I need a little help, not getting up per se, but getting up without falling off the table, because I'm woozy. I thought it was sinuses. Is this anything like what you are experiencing? I had it major at the end of chemo, I thought it was the respiratory infection I got. It went away. 2 Treatments Left! Woo hoo!",
      "MessageIndex": 686,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 30, 2009 09:35PM unique wrote: I am done!!!!!!!!!!!!!!! Dancing the dance!!!!!!!!!!!",
      "MessageIndex": 710,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 30, 2009 10:03PM unique wrote: Mandy, when do you take those last two chemos?",
      "MessageIndex": 712,
      "PostDate": "30/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 3, 2009 12:53PM unique wrote: Okay, now I am done rads, now what? So I made an appt. to see my oncologist for f/u for aromatase inhibitor or something. Also BRCA testing. Should prolly call surgeon about f/u there too. Both wanted to see me earlier but since I only get 18 visits with my insurance, I didn't want to do hi/bye appts. May schedule surgeon in 3 months or something, unless there's a reason to go in earlier.",
      "MessageIndex": 737,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 11, 2009 11:20AM unique wrote: Jane, ha ha ha ha, Angela Jolie's lips - you have given me a lift with that! Kate, my swelling seemed to go down almost immediately after rads, but they said I would get worse before better so that must be the norm. Nearly two weeks and I feel great! On the other hand, I felt awfully tired the first week of rads and they said that was too soon but that's how I felt. Needed a nap almost every day. So we're all different. I am glad so many of us are finishing and ready for the next thing. A new lease on life, I hope and pray and dream for all of us. Some of us have a new challenge - hormonal treatment. It's a bummer but makes such a difference - my onc gave me 20-30% less chance of recurrence with that. Those of you who are hormones negative have another thing - I forget - that really does work so we can look positive, and it is SPRING! (Or almost)",
      "MessageIndex": 776,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 16, 2009 11:47AM unique wrote: Jane - I would NOT want to go off my anti-depressant! So prolly off to strategies to reduce cost of AI ... I had a bad cold, better today, but still feeling not great. And kind of at odds ... Will have to get over to the POST group. Thanks Onehalf!",
      "MessageIndex": 797,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 14, 2009 07:41PM unique wrote: Thanks for all the input on the alien thing. I have decided it's partly that I can't SEE the rays. That's all it is. I could SEE the chemo, I could have seen the surgery but of course wouldn't want to!!! I think I can do better thinking HEALING thoughts. Reading all your kind words helps a great deal. Goodness, Jobu, that sounds hard, holding your breath. I was kind of wondering about breathing, because you are moving, wouldn't that affect things? I guess I am just going to trust the techs, huh? It's interesting how different all our environments are. I am not keen on the gowns either because you can tie across your chest but then the neck ties leave a bit of a gap. Then you have to untie two minutes later. Almost not worth it. Maybe I should design my own gown? I could also wear my husband's cute little gown the hospice gave me after he died. It has little yellow trucks on it and I loved him in it, so they let me keep it. Too much emotions?",
      "MessageIndex": 199,
      "PostDate": "14/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 15, 2009 11:32PM unique wrote: Lories - I was told I should go to a lymphedema PT. I got a referral to the local rehab center, but I think I may use one of the LANA certified PTs in the area, there are two. I need to hurry up as I already started rads. I am making sure while doing Wii FIT exercises that I do a lot of arm exercises, that should surely help keep lymphedema at bay.",
      "MessageIndex": 232,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 21, 2009 05:44PM unique wrote: P.S.: About the deodorant, I have been wearing Tom's only, and only after my treatment. It is not a problem at this time of year in N. America. But could I wear the anti-perspirant after? I probably could, right? Or does it tend to stick and you'd still have it on the next day. I shower in the mornings.",
      "MessageIndex": 357,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 24, 2009 06:02PM unique wrote: Hi Cutie Cupcake, Lori, Mandy, kfinnigan, souad, pascale, and everyone! Thanks for the birthday wishes!!! I think this is the mostest I've gotten recently. My rad onc office gave me a card with everybody's signature in it. Soooooooo nice. I don't know how many treatments I've had LOL. The rad onc said I am on #10 and I said I thought #9 because that first one was setup. She said no there was a treatment in there. I'll ask my techs tomorrow and get it cleared up. That would be kind of cool to have had a treatment I didn't know about heh heh. It was terribly long, I know they made marks and took a lot of pictures, perhaps they also did a treatment in there. I had a previous setup about two weeks previous to that. I thought usually there are two setups or rehearsals? Well anyway. I might be a little pink but just put cream on after each treatment (My Girl's Cream - has lanolin and calendula, very nice) and if the skin feels tight at all. I'm not expecting my skin to fall apart or anything. As most like a day after the beach, I'm thinking. Hoping. After this I will be DONE I hope - except for the hormone med, which is long term. I am going to enjoy my new short hair (Mia Farrow do) and the Springtime.",
      "MessageIndex": 399,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 25, 2009 05:54PM unique wrote: Hi dear girls, For those of you who think it is too early to be tired, I agree with what Cupcake said. She is right, we are the ones who have lived in our bodies. I did #11 today, they say I had my practice on Tuesday the 10th, then 11 treatments including today. Okay ... that's not what my calendar shows but my mind has gone totally awol LOL. I may ask again because I want to be sure. My cal sez doctor at 1:30 on Tuesday, then 2nd practicee on Wednesday. Do I care if I have 32 or 33 treatments? I don't know!!! I am pinkish on my entire upper left chest area, but it doesn't feel bad. I am with you gals on nervousness vis a vis are they doing it right? I don't think there's a good way of knowing, we have to go with the flow on this one. I think I'm not depressed, because I have been before and the first thing it does is make me lose my temper (I feel overwhelmed) and get real spacy. I have been down about still doing treatment, if you want to know the truth. I had hoped to be done after chemo and here I am doing rads too. The other thing I've noticed, that drags me down a bit, is that I'm worrying again. I've always been a worry wart (I love the song on the \"Monk\" show!) and one great thing about coming out of the terror of a cancer diagnosis was that I stopped worrying altogether and it was such a wonderful load off! But darn it I've started up again. Do I have enough money to retire on? Am I a good citizen and contributing enough? (I work only part-time and get some money from my deceased husband's accounts) Have I taken care of my child well enough? His gums are inflamed because I haven't checked up to make sure he's brushing his teeth at night lately, and I guess he hasn't been. I was telling myself to let it go, I'm a patient, but it's starting to creep up again. I have to not worry!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I have to have confidence and just do my best. The other thing is I used to bite my nails, and this BC scared me out of it. I have beautiful nails now and most of the time do not bite. This makes me proud, altho it wasn't will power, it just happened.",
      "MessageIndex": 414,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 10, 2009 11:00PM unique wrote: P.S. I have also had the stabbing pains in the shoulder area, my PT says it's nerves yelling from being zapped.",
      "MessageIndex": 542,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 13, 2009 04:29PM unique wrote: All right ... here goes ... squeamish gals run for the hills ... A couple years ago I had some recurring problems with accidents. I think it really stemmed from living in NYC for 10 years were there are very few public bathrooms. Something got damaged from holding it so much LOL. Anyway, I went to Michael's Craft Store and no sooner did I arrive than cramping started up, so I knew I had to find the bathroom QUICK. I am more used to A.C. Moore, where the bathroom is on the back left of the store. Anyway, I ran for it in the Michael's and it wasn't there! So I ran to the other end of the store, and I could tell ... sigh ... I hadn't made it. Once I got in there and took a look - ew! This episode is directly responsible for me carrying extra underwear and a baggie everywhere I go nowadays. But that time I was stymied. I cleaned myself up with wipes but wondered how to get my dirty underwear home. Then it struck me! Wash the solid stuff out! But not in the sink, I would never do that to the next person. So I held the underwear firmly and dipped the dirty parts in the commode, and hit the flush. I figured once I got home I could soak things in bleach, etc. get them really clean. But I let loose of them! And there, swirling round and round in the toilet bowl, a pair of grandma undies! I held my breath, would they go down? Would they get stuck? Would there be an overflow? Could I ever show my face in the Michael's again? They went down. Of course, I went right home, and I had to go without any underwear beneath my jeans. :@* Are you guys surprised I'm not too nonplussed by minor indignities like being bare for radiation?",
      "MessageIndex": 566,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 13, 2009 07:45PM unique wrote: Deb & Kari ~ the funny part was my utter panic thinking what I would do if the panties DIDN'T FLUSH, instead clogged up all the works and flooded the Michael's bathroom. On another note, Here we are Day 22, and things are SO SORE under the armpit. Itchy/sore. They say things look good tho ... I'm looking for something - anything - that's more comfy. Time for cortisone? Altho I'm not a fan of it, as it tends to break down skin ...",
      "MessageIndex": 569,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 18, 2009 11:47AM unique wrote: Hi Girls ~ Will post how I am first, then read all your posts! Then prolly come back and talk about your stuff you're going thru. Only 8 more treatments!!! Woo hoo!!! But I'm really dragging around the tail end of all this. Just so pooped, and in different ways. Feeling definitely overwhelmed today as they planned my boosts and put a complicated picture in blue magic marker on my chest and up my neck. It bugged me there's a triangle on my neck. Also more of those circles I'm not supposed to get wet. But I'm almost done with this phase of treatment, I have to keep that in front of my mind. Have my compression sleeve and my therapist says it's good, but it makes my arm feel funny, a little cold, and a little achy. So I'll only wear it part of the day. Looking on the net for a colorful cover to cheer me up about it. Sliver Sleeve looks good, but I'll prolly check at the thrift shop for a shirt to cut sleeves off. Be creative. I don't have lymphedema yet, so this is prophylactic. Usually my work excites me but the little bit I have to do right now is just making me tired. Maybe take a bit of nap.",
      "MessageIndex": 615,
      "PostDate": "18/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 25, 2009 07:59PM unique wrote: 3 more rads to go!!!!!!!!!! What more can I say????? I had a nap today, thank goodness. Yesterday I skipped it and was sorry. Let me read your posts now.",
      "MessageIndex": 675,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 25, 2009 08:08PM unique wrote: Mandy, congrats to you girl!!! All done!!! Denise, my heart goes out to you, what a bumpy ride. I hope you will be healing soon and fully and can get out and enjoy the Spring, which will come! Debisongbird, what the heck does your doctor mean, fatigue for a couple more MONTHS? Could he have said weeks, not months? I hope I'm not like this for months!!! Altho not having to go to rads every day will be nice, I might actually get some rest I think. If it's going to be months I am not taking on more work just yet. Holy cow, MONTHS? I was thinking a couple of weeks. I really need a nap every day. Otherwise all my joints hurt, my head hurts, I feel down and icky. Doing more than one thing a day, frankly doing one thing a day other than just eating and sleeping, it an enormous effort.",
      "MessageIndex": 677,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 4, 2009 07:16PM unique wrote: Hi, Mary ~ No, we do not *HAVE TO* do the breast cancer walks. Only if we want to! I am used to doing the Autism Speaks walk but I always poop out halfway thru. That's okay!",
      "MessageIndex": 745,
      "PostDate": "04/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 13, 2009 03:09PM unique wrote: Jane M ~ I am also armed with a list of questions for my med onc about Tamoxifen vs. Femara/Arimidex/whatever. Are you pre or post menopausal? I have a study that says Femara et al. may not be that much more helpful than Tamoxifen, if you metabolize the Tamox. Any other ladies who may take Tamox even if post-menopause? Jobu and Denise ~ I read a WONDERFUL book that somehow put my fears and fussing about testing to rest for the most part. It is titled, \"After Breast Cancer,\" by Musa Mayer, a gal who is a survivor of breast cancer. She makes the case that if your recurrence is found by you or by a test, it's all the same, no difference in survival rates. So relax, don't worry too much. On the other hand, some new study came out showing that there is a survival benefit to finding something thru a test ... never a dull moment, huh? My chemo brain is causing me to forget where I saved info about this last thing. When I re-remember, I'll post it. I also feel in limbo. I'm going to focus first on losing weight and exercising every day. That will be my own self-treatment and will take the place of the treatments I am finishing. And dealing with the hormone med decision and then easing into that.",
      "MessageIndex": 789,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 01:10PM unique wrote: Okay - it is coooooold and snowy or icy rain here in Pennsylvania so I got a wii FIT. I have the wii already. So I've been doing on that every day and it's great.",
      "MessageIndex": 88,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 12, 2009 12:04AM unique wrote: Hi everyone! I did my first rads today and last night I was tossing and turning for awhile before sleep, thinking and hoping they don't miss and fry something that's not supposed to be fried. Today went all right. She told me not to get the little clear circles that are on top of 4 markings wet, so I put 4 waterproof bandaids on so I could shower as normal. It went okay, but I have a couple questions I somehow didn't ask the techs or anyone, wondering what you all think. Also there was an annoying lady sitting in the waiting room who was talking to another woman and she said she is taking Tamoxifen now, during rads, and that's what we're supposed to be doing. Are any of you taking Tamox or Femara/Arimidex now or are you waiting until after rads? Can you put on the Tom's deodorant in the morning or do you have to wait until after rads to do it? I also got the Apricot scent. What are they marking you guys with? I get blue but it's coming off everywhere on my bra. Who is doing therapy with a lymphedema PT? My neck was bothering me during the treatment which was about 20 mins. I asked about putting a small pillow and they said \"oh no\" but I may take one anyway. They weren't keen on the small of the back pillow but it turned out to have absolutely no effect on my position. What's up with the tape circles? Do we get zapped on these markers or is it more general in the area? I did My Girl's cream once I got home and then again tonight after putting on PJs. The area feels a little tight, but not sore, no redness or anything. Anybody know what the markers and circles do? They line up the machine using them? How long do the circles last? Thanks if anybody knows anything, and hope your treatments all go well.",
      "MessageIndex": 156,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 19, 2009 05:38PM unique wrote: Hi Debisongbird and all ! 6 down, 27 to go ! Had one bouncy day, now back to resentment of the whole thing. I don't seem to have any energy either. Onc says it's too early to be tired. My exercising had been really giving me a sense of buoyancy, but I'm just dragging my butt here and there this week. My radiation areas feel just fine, am using My Girls Rad Cream, it is not cheap at $25 a pot but I think the whole thing will last and it feels great. I put it on after treatment and then again at bedtime. I am trying to put on a great attitude, but I'm sagging. What moi, the cheerful dame of the BC Boards? Well we all have to have a dip LOL. The only good thing today was I was planning to go to a girlfriend's house to double sign my 5 Wishes Living Will, but we are going to do it over the weekend due to cold and fatigue on both sides. She spent the whole day with her father who is in the hospital with a couple of things going on. Not to make anyone feel down - I have had my Will, POA, Guardian designation, Living Will all together since 2000, but after my surgery in July my sister asked me about it, and I find out she never got her copies. Don't know who's fault it is, but stuff was supposed to be notarized and it never happened. Anyway, I want to revise my Will - I am not planning to die anytime soon but as single parent of a child, I feel I want my ducks in a row. I might do it via legalzoom.com as my estate lawyer just doesn't call me back. What else. Debisongbird, I will keep Kathy in my thoughts and prayers. Denni - am going to go now and eat a hardboiled egg. I just have a lack of appetite lately. Too nervous to eat before rads, so generally have skipped lunch. Not a good plan. Water is going in, I've gotten in a habit of keep water bottle right next to me and sipping constantly. I'm doing wii FIT for exercise and that is a bright spot in all this. Today I spent some time as a penguin on an iceberg trying to eat as many fish as possible! Fun fun fun!",
      "MessageIndex": 311,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 20, 2009 05:18PM unique wrote: Cupcake, you are a cutie!!! I think sometimes the board does a burp. I also hope the fatigue isn't cumulative! I think like with chemo, everyone is different. Joy, joy. I felt really exhausted my first week! My onc says it is really too early for that. No pinkness or itchyness thought, that's one less thing.",
      "MessageIndex": 332,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 23, 2009 10:34PM unique wrote: Hi dear girls, Did #8 of 33 today. The simulation took the longest for me, and I wondered as it took them 30 mins each day previously. Today was faster, I think they are getting into the rhythm of my treatment as I am getting into the rhythm of being treated. Today was the first day I remembered to take my arm out of my gown, LOL. Do all of you do it the same time every day? I was 2:30pm but this is a rush for me to get back in time to p/u my 11 y.o. at the bus stop. So this week I am 2:15 until Thursday, then 9am! This is too early, but I think I can make it. I will drive my kid to the stop, then dash off as soon as he gets on. If I don't hit traffic, I will make it. I told them I could be late-ish. I saw my lymphedema therapist today, Jane Roche, and she was EXCELLENT. LANA-certified. She massaged an area about 3\" below my armpit that has a little bit of swelling, snapped some cording (this does not hurt), and gave me mucho exercises and told me to get a script from my rad onc for a pressure sleeve. I feel I am in good hands to prevent lymphedema.She said the little bit of swelling makes sense for being in radiation. She sez wearing the sleeve during waking hours will tell the brain, no lymph in the arm, and will help. Definitely wear it while travelling in car or plane a long distance. I also have to talk to rad onc about how often she will see me. I have a lot of confidence in the techs, but only get 18 doctor visits a year thru my insurance. So we may want to ration them a bit. I have already done a couple, 1X GP for dizziness, 2X rad onc, and another thing I think. I cancelled my chemo onc and surgeon until done with rads. I am sure I will see each of them at least once again this year. And I can pay for a couple of visits. I just want to make sure each visit is well used. I also wore my camisole today on account of other bras being in the wash!!! It was $28 from TLC and very comfy. My boobs droop a little lower but what else is new. Tomorrow I will be 52, a pretty old bat. Can I join the club? We are all still cute as buttons you know.",
      "MessageIndex": 387,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 2, 2009 06:45PM unique wrote: P.S. - I was going to see her today but I got snowed out. I made a new appt. for next week but want to get back in earlier. Was going to do things weekly.",
      "MessageIndex": 480,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 6, 2009 05:39PM unique wrote: Jane and all ~ I have the tlc camisole and it is VERY comfy, but you are correct - the good boob does tend to want to escape the cup on the camisole, LOL! Today I tried tshirt under bra as I wanted to wash my cami, and it's pretty good! Only thing as it gets warmer I am not going to want a tshirt, then a bra, then another tshirt. On the other hand the tshirt is black, the bra is black, so no marker stains on this setup! That's why I'm having the cami washed yet again, all the blue marker that gets on it. I've tried a paper towel (too scratchy) and kleenex (doesn't stay put) to keep the marker off my underwear. I would almost rather be tattooed. Only kidding. They don't keep me covered thru the treatment - I am covered until I get on the table and then get out of the top of the gown. I would be nervous I might move during treatment or something get out of line if I were covered. It is tricky where my other side is for my treatment plan, I mean out of the way. Maybe I'm the only one who would feel unhappy to be covered up? I finished #17 today and so far just a little pink, a little tan, and a little sensitive. So I'm hoping no burning or skin breaking. I'm applying cream like crazy. Really pooped I must say ~ when I get home from rads the past two days I have just laid down and rested. That has helped a lot.",
      "MessageIndex": 522,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 11, 2009 08:41PM unique wrote: On the other hand I wore my new \"hair\" today because it was warm and spring like and I love it! It's so cute and pretty! On the third hand I am itchy all the time unless I apply cream frequently and my back is itchy too. So I'm not a happy camper but I can hack it for another 3 weeks. I am just going to sleep all day when this is over. Kick the kid to the bus stop and toss myself onto the couch.",
      "MessageIndex": 545,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 12, 2009 06:39PM unique wrote: Hi Deb and Mandy! Good lord you guys are having a time! This makes me appreciate my people quite a bit. Altho I am so cranky going in the morning. I had to change from the afternoon for my kid, but it was so much easier resting in the morning, then sashaying in after lunch. Mornings have always been hard for me, I've been achy and groggy my whole life until a bit of time has passed. So you can imagine getting ready for anything requires an extra effort, and I was always proud of being able to start a job at 7am once! And they scheduled me TOO EARLY one day this week, and I told them I might be late on account of leaving right after my son gets on the bus, and so I was :@P There's just not enough time to get in there by 9:00 when he gets on a bus at 8:40. If I have to go to the bathroom, I'm late. And no, don't ask me to hold it, I used to be able to do this, but there have been too many messy potty accidents for me to be blase about it. I go when I feel it coming on LOL. Remind me to tell you all about what happened at the Michael's Craft Store ...",
      "MessageIndex": 554,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 13, 2009 11:41AM unique wrote: 22 down, 11 to go ... Yeah I will tell you all, it was kinda gross but VERY FUNNY.",
      "MessageIndex": 560,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 19, 2009 07:50PM unique wrote: Mandy ~ Will definitely remember the little girl in pink, and Jack, my accountant's secretary's husband, who is getting radiation to both sides of his brain. There are so many with greater challenges than we have, and they are managing somehow. About all the skin adventures, girls, with the gels and the peeling and the heat from burned places, maybe I'm lucky to have had a mastectomy? Geez. I just have a tan in places, a bit of burn in other places, and a little soreness in one place on my scar. My back itches. They say they are done with that field. I've been putting lotion on there with the back of a long plastic spoon. 7 left - amazing, it went faster than I thought it would. Thank goodness. Fried Brown Annie",
      "MessageIndex": 628,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 20, 2009 09:31PM unique wrote: Lori! I am so sorry you are having such a bumpy ride with Femara. My Mom is on it and she is reporting not much trouble. Maybe another AI? Or even consider Tamox? I will be figuring out what to do here myself shortly. 6 more days of rads!!!",
      "MessageIndex": 637,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 27, 2009 07:21PM unique wrote: ONLY 1 MORE TO GO!!! I am doing okay with the itching. My major problem has been post nasal drip and nausea last night where I threw up. I think I ate too many strange things yesterday, altho I will throw out the 2nd half of a Subway $5 footlong :@* I had half of a tuna footlong for lunch, then a salad for supper with lots of chunks of veggies and too much thousand island dressing. Then before bed I had three bowls of Post Selects Apple Caramel cereal with milk and I think the mix was just too much, what do you think? Started immediately to hiccup, burp and fart and was up until 4 in the morning. Post 50 gals, we must watch what we eat!!! When I itch, I put on some more Gals Cream, sometimes on back with a long handled spoon, that seems to do it. I do have a sore stingy spot back of armpit where the tape took off some skin. And it's sore at a weak spot in my incision under my arm. Otherwise A-OK, big deep breath and sigh of relief! Next phase will be to heal and lose a little weight and SLOWLY get back on my schedule. It'll be a nice, relaxing Spring.",
      "MessageIndex": 693,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 01:16PM unique wrote: Oh, and did anyone else have a mastectomy so they are getting rads to the chest wall?",
      "MessageIndex": 89,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 7, 2009 09:45PM unique wrote: Hi Girlfriends ~ Yes, that's my hair now, how it really looks. It was longer before I did chemo. I did put on the dye the same week it began to come in, because my son felt it was really grey. My last rads was Monday a week ago! I am looking at my chest tonight and it is already less red and a whole lot less tight. I was tired the whole week after rads but this week I feel energetic and refreshed. Pretty cool, huh? I see a lot of us are finishing up. So those of you who have a bit more to go, take courage, it does end and you will feel better very soon!",
      "MessageIndex": 759,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 10, 2009 05:49PM unique wrote: Hi galz! Had my second planning session today and I start rads tomorrow!!! I didn't even get my lymphedema PT referral yet, I had wanted to see that person before I started. How important is this??? I have to say, I did not like this session at all! The position I was in was most uncomfortable and I had to hold it for nearly an hour. Not a happy camper. First the neck and then the left arm got painful and then numb. Also the scalp where the donut thingy was pressing into my head. They kept saying they almost done. I stuck with it and am proud of myself. I do not like pain! The actual rad sessions should be short, so even if they wrap me into a pretzel shape it shouldn't matter. I'm thinking today was the hard part. They did let me have a little pillow under my low back so at least that didn't hurt like last time. Grumbled a bit but I am swaybacked so there's a space when I lie down where my spine curves, and that hurts if no support. I showed her it made no difference pillow or no pillow, so she let me have it!!! And I noticed, I totally didn't see this last time, they have the most beautiful lit screens of flowers and she played music, one of my favs, Simon and Garfunkel, the Bridge over Troubled Waters album, made me think of being in college LOL. I also did the color exercise. I thought of things that are yellow. Here is part of my list: the sun, daffodils, egg yolks, lemons, squash, smiley faces (see above), Pikachu, Spongebob, Sprint phones, galoshes (the old fashioned ones), chicks, duck bills, chicken feet, yellow crayons, yellow markers, hilighters, flame, school busses, my teeth (too much coffee), tulips, pancake batter, my son's hair, manila folders ... and so on. pottergal - did I say the wii fit was great? Yeah, it's very interesting, keeps the boredom at bay. It seems to start you out on an easy regimen, but I've gotten to advanced step and it is a real workout! They keep adding things too and I feel I'm not ready for the new stuff, I am still happy with the old stuff, except for the advanced step and the new yoga techniques. I am on my second week and I can do an hour every day, the time just whizzes by. You can also compete against yourself or other players in your family, and that can be fun! I want to beat my kid on the ski slope, I almost got there today. You can keep on doing one thing or vary your routine, it's totally up to you. The only drawback with some of the things is that if you want to repeat the routine, you have to hit the go again button and wade through some of the explanation each time. I just keep doing whatever the exercise is while this is going on. It's only a couple of seconds though, hardly worth complaining about. Once you've done the demo for each exercise they don't repeat that. It also keeps track of your total exercise time and doesn't count the menu wading as part of it. So you know how much time you've actually been in motion. I think it's great, I've never been faithful to an exercise program before now, I always get bored.",
      "MessageIndex": 135,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 12, 2009 10:02PM unique wrote: Forgot to ask - what are you gals wearing when the skin gets irritated? My spaghetti strap bra, comfortable until now, chafed just a little in front of my armpit when I put it on this afternoon. I'm looking at TLC's Pocketed Comfort Camisole. I'd just wear a t-shirt but I need a pocket for a prosthesis as I hate that one boob look.",
      "MessageIndex": 174,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 18, 2009 09:40PM unique wrote: Hello all! Had my 5th treatment today and whereas Monday and yesterday I felt fine, almost happy, today I was definitely a little scared again, and feeling like a cancer patient. Part of it is fatigue which hit this morning after getting up, I just felt soooo tired and took a 2 hour nap on the sofa. This is really rare for me. Got up and still felt tired, and a little queasy. Now feel the queasy is not eating lunch. I just am not hungry for lunch because I know I'm going to radiation and I'm nervous, which kills my appetite. Then when I get back around 3:30pm I'm ravenous and eat. The funny thing is I got up on the table with such aplomb that I swear I almost jumped over and rolled off the other way. I didn't, but there was a wobbly minute there! Techs always help me sit up because I get stiff lying there and really can't do a sit up. They are really kind and friendly, and I'm glad about that! Saw the onc and asked her how many fields. She said 4 - which is what I thought. I haven't asked her too many questions, because I did a lot of asking at the beginning of this journey, especially about the chemo, and I'm all burned out. I'm just trusting them to not get my heart, etc. I mentioned this in the beginning and she said they set up the plan to miss any important areas. So hopefully they will.",
      "MessageIndex": 287,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 21, 2009 05:41PM unique wrote: I am a left breast gal, no breathing, no block. They are using a Varian - it looks old - ? I asked specifically about missing the heart and so forth and my rad onc said the angle should avoid it. They do have my head turned way over and it seems they want my body one way and my chest another LOL. So hopefully. Did I tell you guys I almost rolled off the table on the other side, ha ha? I sort of jumped and almost jumped over ...",
      "MessageIndex": 356,
      "PostDate": "21/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 27, 2009 07:22PM unique wrote: Cupcake, I really like the My Girls Cream and it doesn't seem greasy to me. Also smells nice and fresh. Today I tried also the Fruit of the Earth 100% Aloe Vera Gel and it was a little sticky but very cool and felt nice. Skin is a little tight and hot and this cooled it off very well. Did stick a paper towel in my camisole so it wouldn't get damp, I really slathered it  on. Mary, I think your feelings about finishing treatment may be common. I read a book about it entitled \"After Breast Cancer\" by Musa Mayer that really gave me a sense this will all be okay. She is a survivor and knows whereof she speaks. What I am going to do is find other things to do to \"treat\" myself, reduce my chances of reoccurance. I started the Wii FIT exercise program and will go on a diet. I'll be starting Femara or something hormonal. I'll be seeing one of my docs every 3 months. I think I'll go on a walk- either the American Cancer Society one or the Susan G. Komen one. With two survivor girlfriends.",
      "MessageIndex": 451,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 2, 2009 06:44PM unique wrote: Mandy and Jane, What my therapist gave me was a circular massage for a small swelling about 4\" in diameter about 3\" below my armpit in the back. Then some stretching exercises for the arm. Mandy, what are the pros and cons of the pressure sleeve? My PT thought it would send a signal to the brain to not send lymph into my arm. Hi, Mandy!",
      "MessageIndex": 479,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 5, 2009 08:48PM unique wrote: Hi gals, I am definitely reddish under the armpit. Still using the Aloe Vera and the Girls cream, things usually feel okay during the day and if I'm feeling itchy or sore-ish I just put on more cream or gel. I am on #16. So almost half through. After Monday's torture session the other ones this week have been fine. I think the creams affect one aspect of burning, the dehydration of skin. It does help with that. As far as soothing, I am cool with making things feel better! I have the TLC camisole and other than it being beige and the blue marker they use coming off on it, it's great. It came in the mail at exactly the right time. Feels very comfy. I hear y'all about the Tshirts underneath things and if I need to try something else will try something like this. I am very tired yesterday and today. I should probably be taking a nap. I just sat on the sofa with my kid watching Law & Order and my eyes half open for an hour. Felt better afterwards.",
      "MessageIndex": 517,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 11, 2009 08:39PM unique wrote: Did #20 and I'll tell you I am totally zonked. I am like a zombie lurching around. I have crashed each afternoon for a long nap but I'm not comfortable and I wake up groggy. So I am just counting the days until this is over. Last night I thought to myself because I'm so achy and groggy I feel a little like I have chemo again. Well I am being poisoned again, that much is true.",
      "MessageIndex": 544,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 22, 2009 08:17PM unique wrote: Hi galz ~ Yes! I have the greyish tinge under my armpit! I thought it was dried cream because I'm so itchy and have been applying all day long. I've applied so much two of my circles covering my blue marks fell off, and I redrew the lines with a sharpie and put on some surgical tape to cover. I have 6 - YES 6! - treatments left to go!!!! I'm so happy!!!!",
      "MessageIndex": 659,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728199",
      "Title": "February 2009 rads group - all aboard!! Lories sobx"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 12, 2009 07:11PM unique wrote: Hello Binney and all ~ I got a compression sleeve, and I'm wondering how it's supposed to fit. The first one seemed WAY too tight, this one seems okay but when I bend my arm it really cuts into the inside of my elbow. Is that right?",
      "MessageIndex": 33,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/707625",
      "Title": "instruction on how to wrap your hand and arm jinky Cheryl417"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 25, 2009 12:38PM - edited Jan 25, 2009 01:14PM by unique Hair Pix!   Left to right: Sep. 11(before starting), Oct. 14(about 3 weeks after first tx), Oct. 18(a couple days later), Oct. 28(2 weeks after 2nd tx), Nov. 20(couple days after third tx), Jan. 16(new hair growth-2months post-chemo), Jan. 16 closeup",
      "MessageIndex": 1131,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 25, 2009 04:24PM unique wrote: Hiyas, these are my hair progress photos",
      "MessageIndex": 1132,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 27, 2009 11:31AM unique wrote: Dear Ladies, Thanks so much for the comments and encouragement! I've been thru a lot in my life, so I've had practice, and without going into all the details, every minute of life is a happy minute. Well, not EVERY minute. LOL.",
      "MessageIndex": 1143,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 7, 2009 05:26PM unique wrote:  Okay, here's the hair at 3-1/2 months out. About an inch long, as soon as it gets warmer I'll just go au naturel. I think of it as my Mia Farrow look. A great improvement over The Donald Trump, The Zero Mostel, and The Beetlejuice. The color is Clairol Natural Instincts in 28B Roasted Chestnut. It's semi-permanent, which for me means I am going for a new application only about once every three months. It sort of slowly comes off, leaving golden grey highlights which are not bad at all, kinda nice. Some people pay for highlights ... When I look in the mirror and it looks grey as opposed to highlit, then I go for another apply - takes 10 minutes, quite fast.",
      "MessageIndex": 1352,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 8, 2009 12:13AM unique wrote: Joanne, It seems to me that my hair is taking FOREVER to grow. But this is probably just a little slower than normal hair growth. Actually I got dark spots on my scalp almost a month to the day after my last chemo infusion. It was freaky in the beginning, but starting looking great after about a week. I mean, after having no hair, a 5-oclock shadow on your head really is something!!! I'm fairly happy with mine at 1 inch, partly because I've had my hair short before. Maybe not quite this short, and I had bangs previously. But this isn't bad, and if it's warm tomorrow I may just ditch the hat.",
      "MessageIndex": 1362,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 28, 2009 07:00PM unique wrote: Now that it's warm I'm wearing my new hair out everywhere! So happy to have hair!",
      "MessageIndex": 1480,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 3, 2009 02:03PM unique wrote: Karen, You look wonderful! What a cute do! Nancy, you look great, too! I think some of our new hair dos are better than our old ones! I know my hair is curlier, less frizzy, which is an improvement. May not last, as I too am headed for Arimidex and my hair had a wave but not a tight curl before. Just tended to look messy.",
      "MessageIndex": 1541,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Apr 18, 2009 11:10PM unique wrote: Spring, your hair looks sensational! You look adorable! I feel adorable myself with the short-short do, very young and so forth. It went thru an awkward phase last week (seemed all back hair for some reason) and I beat it into submission with hair gel but today I did nothing and took a new avatar pic of it. Just seemed to fall into place, stick out in all the right places, etc.,etc. I probably will take it to my hair stylist to get it shaped soon. It is still exactly the way it grew out of my head still.",
      "MessageIndex": 1645,
      "PostDate": "18/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 19, 2009 10:27PM unique wrote: Hiyas ~ I kept the brows and lashes until my hair started growing back, then funny things started to happen with the brows - first they thinned on the inner parts (next to nose), that is a funky look. This week they are thin at the ends, which isn't so bad, looks like I tweezed a little much. But my LOWER lashes bit the dust, they mostly fell out, the uppers are fine tho. What is up with this?!!!!!!!!!! (Not really expecting any answer) Looking forward to the pixie look. Not there yet as you can see. More like the lichen look.",
      "MessageIndex": 1114,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 1, 2009 11:29PM unique wrote: Plakatakr, it is so nice to see you! I remember you from the Chemo board. Thanks to you and Lorena both for saying I'm looking okay. It's only cute from certain views, in others I look a little pointy headed. I actually wore my short hair today at a birthday lunch for my niece! It took a bit of courage to do, I might have chickened out except it was so warm in the restaurant or I was having a hot flash or something. When I was finally feeling cool again, I re-donned my cute hot pink hat again. I thought maybe a couple people scanned me a little longish to decide whether I was just growing hair back or intended that look ... But I'm not going to be paranoid here, just enjoy my hair, such as it is.",
      "MessageIndex": 1174,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 22, 2009 12:41PM unique wrote: Hair - at various stages - to give you gals hope for hair! The first one is Jan. 18th, Second is Jan. 31st, Third is February 20th. 2 months post last infusion, 2 weeks later, 3 months post. It's not really longer looking, but it is - now 1 inch long but it's not quite ready for spiking. It's a lot thicker and if it were warmer, would go without hat outside. Sometimes the head is even cold inside ... I think it's looking pretty cute! ",
      "MessageIndex": 1279,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 9, 2009 12:19AM unique wrote: This happened to me, thought I posted pics and no pics. Maybe it's a Picasa thing? But you oughta be able to do it. Springtime, do it again, girl, I want to see the before and after!",
      "MessageIndex": 1367,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 11, 2009 09:57PM unique wrote: Lori ~ My hair is right behind you, a little over an inch and getting a bit of personality. Also no bangs! A little fringe. My take on this is bangs are really longer hair than whatever the rest of your hair is. So it will take a while for bangs. My forehead is about 3\" tall at least with a bit of a dent in front where I crawled into the coffee table corner as a baby. So I usually have bangs. Otherwise I look pretty good. I colored mine as soon as it was a quarter inch because it was very grey. My son hated it. I am still deer in the headlights, I hadn't really noticed. I mean, it was HAIR!!! The color went on very nicely but it did seem to wear off faster than usual. I got a new color then and that is very nice, a little darker than I did before all this mess. There's a pic a couple pages back. That is washing out a bit also, interesting. It's a temporary color that is supposed to wash out in about 14 shampoos, but I've used it for years and never redone it before three months. Maybe I have more grey hair than before so I just notice it more.",
      "MessageIndex": 1408,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 24, 2009 07:52PM unique wrote: The don't look too different, but the Feb. pic is much thicker, not much add'l length but a whole lot thicker, and cuter if I may say so myself.",
      "MessageIndex": 1286,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 7, 2009 03:51PM unique wrote: Hi galz, I also use the Natural Instincts and have since I stopped breastfeeding my baby. Before that I was using something else, I forget ... as a kid had coppery brown and then at puberty it turned blackish, so the Natural Instincts Cinnaberry is perfect for me and it's kind to my hair, don't get the straw stuff any more. Actually was ready for a change so went a shade darker (to make new hair more impact-ful, LOL!) so am doing Roasted Chestnut, which is your basic brown with just a teensy bit of red shade. Should take a pic of this on account it is curly today, kind of cute actually if you ask me. I had been sort of straightening the Groucho unrulys with my hands, but today I'm happy with the corkscrew hair.",
      "MessageIndex": 1349,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 7, 2009 03:52PM unique wrote: My mother thinks hair color causes cancer, but if that were so I'd have scalp cancer, right?",
      "MessageIndex": 1350,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 28, 2009 07:00PM unique wrote: Okay ... here is my hair four months post ... I love it!!!!! Except I would like more bangs. I have a little dent in my forehead from crawling into a coffee table corner as a baby. I am using Swarzkopf's got2Bglued to control the unruly hair. ",
      "MessageIndex": 1479,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 28, 2009 07:13PM unique wrote: And, I colored it immediately when it started coming in, when it was only 1/4 in. long, because it was all gunmetal gray! Didn't like that! I use Clairol's Natural Instincts which was as close as I could get to the truly natural color I used to use in Chicago - no health food store with color here. I suppose has chemicals in it but I have had breast cancer not scalp cancer so I am not going to worry about it. This color is a little darker than I used to use pre-chemo, it is 28B Roasted Chestnut. I'm really not a blond.",
      "MessageIndex": 1481,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 19, 2009 10:29PM unique wrote: Jo Anne - I did not do anything to my hair as it was falling out, but when it started coming back I had to trim the long sparse hairs a bit because it was so freaky. Sort of like weeds in the grass. So I did trim the old hairs to match the new ones, not a job really as there was so little hair left from the last chemo. I'd say an 1/8 to a 1/4 inch, it is almost nothing, but adds a shade of color to my head there. I did apply a little Clairol to it as it came in almost all grey and horrified my 11 y.o.",
      "MessageIndex": 1115,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 02:04PM unique wrote: Hi Hare Wimmen! Yes, what is Garsparilla? Pray tell! I have gone another week and my hair looks exactly the same. Maybe it grew a little? Dunno.",
      "MessageIndex": 1201,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 02:05PM unique wrote: P.S. What the heck is a baby flat iron? I have always had curly hair so prolly won't try to straighten it. But what is it and how do you not burn your hair to a crisp?",
      "MessageIndex": 1202,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 12, 2009 10:53PM unique wrote: Hi, Hare Wimmen! Anyway I scared my son the other night. I was so happy I was getting some hair poking up, so I ran to show him the hair is coming back!!! I had my last chemo day before TGiving, here it is Jan 12, so I guess it's been 6-1/2 weeks. My 11 y.o. said what is all that gray, I look so old!!! I'd like to dye the 1/4 inch that's there, but I'm a little worried to do it on account that the scalp will also get dyed I would imagine. It is a medium auburn I have been using for the last 20 years, very nice. But not with red on the head!!! LOL!!! Nice to discuss the hair yet again. I am thinking I will NOT let it get goofy. I will spike it or color it blue, but I will not let myself look like David Bowie LOL!!! (I'll come back to whine when this is exactly what it looks like, okay?)",
      "MessageIndex": 1067,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 22, 2009 11:29PM unique wrote: 8 WEEKS OUT FROM CHEMO ~ ~ and I'm feeling the hair is kind of cute. So short yet, but in one week it is starting to look like hair. It's a little wiggly, too, as though it is going to do some of the wild things I see you gals reporting. I'm so happy to have it!!! It is going to be so adorable, just give it a week or two more!!! I guess the only thing I mind is my head is a little pointy on top, I tried to take the pic so this is NOT so noticeable.",
      "MessageIndex": 1129,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 1, 2009 12:07AM unique wrote: Hiyas, here is my hair this week, just a little bit longer. I'm thinking if it were Summer, I'd just go au naturel with the hair at this point. But it's just way too cold for the bare head right now!!! I got two cute little hats at Kmart of all places, while looking for something else I bumped into them. I do always check out the hat section at any store LOL! ",
      "MessageIndex": 1167,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 8, 2009 12:09AM unique wrote: Hi, I have a web site and so I upload my pics to that location, then there is an address to put in the blank that appears when you click on the tree. I am on other sites (Etsy.com) where I can upload directly from my computer so I do think this is cumbersome. And you can upload your avatar directly, right? I think I could upload my avatar directly. I did a new one a couple weeks ago, it must be chemo brain, I have no memory of what I did, LOL!",
      "MessageIndex": 1361,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 2, 2009 07:22PM unique wrote: Susan, you look beautiful! Sunshine, I like my hats !!! (picking hat out of ditch) I've always been a hat person but now I can wear a hat without flattening my hair LOL!",
      "MessageIndex": 1186,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 24, 2009 07:52PM unique wrote: Good grief where are my hair pics? I was sure I d/l them huh. Either chemo brain or a burp in the BC site programming ... Anyway here I try again ...  First is Jan 31st, about 2 months after last infusion. Second is Feb 20th, 3 months after. Really can expect first month for more hair to drop out, as chemo is working in the body from that last infusion. Then a month for the hair to grow maybe a half inch. Then another month for another half inch. My hair is about an inch long now. I realize I never took a photo of that last hair loss, just too awful to describe LOL! Like \"Beetlejuice\" heh heh.",
      "MessageIndex": 1285,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 17, 2009 02:51PM unique wrote: Lisa810 ~ Looks like you got the encouragement you needed from the great gals on this site. Only one thing I wanted to add. Look at all this as the Grandest Adventure. Also, that you won't get all the side effects, only some. It is doable. I never got mouth sores, hospital visit, low blood counts, or red hands. My fun effects I could handle. You'll focus on yourself, make sure friends help out, and have fun with wigs or hats. You get lots of love from here.",
      "MessageIndex": 1100,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 26, 2009 12:26AM unique wrote: Thanks, Deanna and Adrienne, for being so nice!!! Adrienne, looks like you're getting your hair back there, too. BTW, I think I need to look for my \"Beetlejuice\" pic when I had the least amount of hair, the hair that fell out the week after my last chemo. Maybe I was too overwhelmed to take that shot, heh heh.",
      "MessageIndex": 1135,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 24, 2009 07:54PM unique wrote: BTW, love the Buffs but not sure how to use them for myself. Am exercising at home on the Wii FIT, will start outside when it gets warmer, walking mostly, but may just go bearheaded or with a brimmed hat. They are sooooo cute, though! I want one!",
      "MessageIndex": 1287,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 26, 2009 08:20PM unique wrote: Oh, Deb - my last hair went away AFTER my last chemo - I didn't even take a pic I was so bummed. I call it my \"Beetlejuice\" period. I had \"Donald Trump,\" \"Zero Mostel,\" then \"Beetlejuice.\" Now I have \"Mia Farrow.\" I was so bummed I bought three new hats. That cheered me up because I LOVE hats.",
      "MessageIndex": 1297,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 14, 2008 11:39AM unique wrote: Hiyas ~ My first tx was actually September 25th, I'm taking Taxotere and Cytoxan X 4. But I will be doing most of my tx's right on schedule with you gals and will be a little ahead so I can let you know what you're in for LOL! All I can say is WATER WATER WATER and COFFEE for constipation and MIRALAX for diarrhea (plus a panties in the purse). I am having hair challenges at the moment but otherwise feel great. I do #2 Thursday and HOPE it is no worse than the first one. I was fine for two days, then down with fluey aches and pains for two days, then a respite, then Neulasta cramping for a day and a night. I got the 8 hour Tylenol for next time as I was up every four hours all night with thumping in my pelvis! The main thing with the hair is that it's falling all over, but I hate to shave it. I was thinking yesterday it was too awful to show to the public, but today I kind of don't mind it. Did I get used to how I look with wispy thin hair? I did take to the nightcap because I was tired of the hair coming out all night long and itching me to death!!! Plus during the day it tends to fall down the back of my neck so it's always like post-haircut. So I sometimes try the hat during the day, but then it presses the hair down a little, so the ends are digging into my scalp?!? What is up with that!!! Gotta go vaccuum the hair off the bathroom floor! Whenever I change or take a shower or anything, it's like dandruff or leaves falling off a tree or a dog in the house, LOL. Quote of the week: \"I am my own dog.\" ",
      "MessageIndex": 180,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 16, 2008 11:35PM unique wrote: Gals ~ You can see my hair is mostly gone - doesn't look too bad tho - well the pic is yesterday he he and today it is really thin on top so I look like Friar Tuck. Wearing a little scarf or hat because it is still hot here in Penna. I have some better hats but woah it is hot so I don't know how you can manage in the summer. ",
      "MessageIndex": 209,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 16, 2008 11:46PM unique wrote: It is Day 21 and I have been losing the hair since last week, so you all are right, about Day 14. I didn't have the heart to shave it, but it's very itchy as it's thinning out, my quote has been \"I am my own dog.\" As of today it seems to have stopped falling out for the most part, not that it looks good tho! I am thinking the rest of it may go in a week or two. I bought a couple of hats at this site ~ very good site and great quality and made for us gals on chemo. Here is the bucket hat I got I wore today ~ http://www.headcovers.com/26/denim-bucket-hats I also got some light hats and a red wool cloche with a flower, but that's too hot for the moment, it's been 76-78 all week. I got a large scarf from the Cancer Society site, but 36\" happens to be too large, I was thinking elegant but it's just making my head look small. Here the scarf http://www.tlcdirect.org/products/sku-7747__dept-24.html I am actually now wearing a napkin folded into a triangle on my head and tied in back, way too small but fine for sleeping in. 20\", not enough coverage in back to go outside. I need something to catch the hair loss at night so I don't wake up in a pile of hair, he he. The lovely fleece night cap with moon and stars is too hot still but will be great soon. I got three scarfs from over at AnokhiUSA, Cherry Booti, Indigo Lily Pads, and Rust Moon Flower. These are 30\" squares altho you can get 15x72\" also. I don't know how to wrap that for coverage. http://www.anokhiusa.com/all_scarves/index.html Just hoping before I go to bed to put a little fun into this conversation.",
      "MessageIndex": 211,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 16, 2008 11:26PM unique wrote: Fammy ~ So sorry you had all that trouble! Did you take Dexamethasone the day before and then for two days? Did they give you Aloxi in your IV? Did they give you a script for Ativan with instructions to take that for nausea first, then to go to Compazine or Zofran? You can also take Emmends but it's very expensive. My tips for chemo success are as much water as you can drink - just tote a water bottle around with you everywhere and sip all the time. I am getting in about 96 oz and that helps with the bone pain and everything else. Tylenol or whatever analgesic they tell you to take. Caffeine if you can get it down, I do coffee and have not had trouble with nausea yet. Mountain Dew might be good if Pepsi gives you trouble. Caffeine also helps with constipation, Miralax also. Immodium for diarrhea. If you can drink it, cranberry juice will forstall a urine infection, yoghurt with live yeast cultures will help with vaginal infections. I am really being careful going out, except for eating at restaurants, but only decent ones I know and trust, and only hot food, no salads. I am washing my hands all the time, they're definitely getting dried out but that's better than ending up in the hospital. None of these things might be right for you, I'm just throwing them all out there in case there's one that makes it better next time. I did TX#2 today, and I'm achy and full of hot flashes and chills, but otherwise okay. My neck hurts. ",
      "MessageIndex": 208,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 24, 2008 06:03PM unique wrote: Hey Plaktakr, how's it going today? I hope Karen, fivekids, Joy, mother78, Kimmysue, Kathi, lindbad, Cheryl, Teena, Fammy and Jill do okay over the weekend! As for me, it has been 8 days since my TC#2 and I finally feel better. Yesterday wasn't too bad but today is the first day I really feel ALLRIGHT. Here's the list for next week. Go Warrior Women! Mon 10/27    Lisa 1964 (TCH) Mon 10/27    Bluedasher (TCH) Mon 10/27    Sweetpam Wed 10/29    mother 78 (Herceptin/Taxol) Thu 10/30    MeMePat (TCH#2) Thu 10/30    Lori Bourscheid (Abraxane/Avastin) Thu 10/30    Peeps (TC) Thu 10/30    Kim/threegirlsmom  ",
      "MessageIndex": 328,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 22, 2008 04:54PM unique wrote: P.S. ~ with me it's always a P.S.!!!! I don't know how people can work full time doing chemo. You can't go in infusion day, and days 3+4 are usually crap. Then you feel tired for a couple of days, and sometimes the Neulasta gives you bone pain (knock it out with tylenol). So I would say maybe go home early those days maybe. So if you're on an every three week schedule that last week before your next treatment you could go in and work like the champion you are as long as nothing happens, uh huh, like catching a little bug when your white counts are low and needing to go on Penicillin for the fevers. I am being optimistic and telling my clients I can probably work but it will be now and then with little gaps so leave off the deadlines for now. I haven't done a lot of sustained stuff though. ",
      "MessageIndex": 285,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 23, 2008 12:14PM unique wrote: Hi all ~ Still a little heartburn!! Zantac was good last night, as well as Coke! However, I now look in the fridge and I'm afraid of the food in there LOL! I think the trouble is anything too rich and fatty. I had a bag of plain corn chips in the afternoon and then a sourdough donut and that really made me burp up acid. Do you guys have suggestions on what foods were bad for you? Don't be scared of the chemo - look at how many of us are just kicking tumor butt and doing fine, except for maybe a little heartburn. Strongmom, our tumors were almost the same size - bummer isn't it!!!!!!!! I lost my glasses for a day but found them finally. Are we brain sisters? ",
      "MessageIndex": 300,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 28, 2008 11:46PM unique wrote: Deb ~ How about you stay with us here and ALSO start a November chemo thread. Although - I have two more treatments to go so I'll be here in November and so will many of us. I am actually on two boards here, one for my specific type of chemo, TC, and also here. Both have been tremendously helpful, you have no idea!!!!!!!!! There's a Tip list here somewhere, I've forgotten where it is tho, I can send it to you privately if you like.  Here are Anne's Chemo Tips ~ Good luck with the lumpectomy! The only surprise I had was the \"galloping horses\" in my pelvis and thighs for about 24 hours. It wasn't really that painful, just unnerving. Tylenol put it to sleep, but whatever analgesic should be an 8-hour version because all night every 4 hours once the Tylenol would wear off the gallops would start up again. 1. I think much of the key to reducing side effects is HUGE amounts of water. Helps to flush all the poisons out. My onc said 48 oz a day but I am doing twice that now. 2. Keep them bowels moving, and be ready for either constipation or diarrhea. I had constipation the first week, but no stoppage, just a feeling of pressure and then had to huff and puff a little. Out came marbles, which is not my usual! Today I had some loose ones. Coffee with caffeine is good to start the bowels in the morning, if it doesn't disturb your stomach. Mine has been fine so far. 3. Yoghurt with live cultures and cranberry juice to ward off yeast infections and bladder infections. I felt like one of either might be coming on over the last couple days but things seem fine today. 4. Lots of salt water and/or baking soda gargling. I also do a nose rinse with warm salt water most mornings to clear out my post nasal drip. This also helps with scratchy/sore throat and that fuzzy tongue thing. 5. All fruit popsicles like Edy's or Tropicana to add fluids, counteract that chemical taste in the mouth. Lots of fruit juice, soup broth, aromatic teas (Throat Coat by Yogi Tea feels oh so good going down, it has licorice in it which soothes the throat). 6. Hot sweats or chills plus that feverish feeling - either a cold pack from the freezer OR a hot herb pack which is squirted with a little water and then heated up for two minutes in the microwave. I have lots of these latter due to my history with sinus headaches and migraines. They do a charm with muscle aches, just zap a few and take them to bed with you and the warmth is just so soothing. I have lived with my son's little terry Piggy ice pack when cold seems to be what I need, I feel like I'm burning up or something. Pack of peas does the same. 7. Not sleeping - take a Benadryl, it will knock you right out! Good night to you, too!",
      "MessageIndex": 375,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 30, 2008 12:41PM unique wrote: Hi! I am feeling good today and slowly getting all the mess (work-wise and home-wise) tidied up from when I just dropped everything last chemo week. I am getting into a groove with that - early next week I will vaccuum and make sure the fridge is stocked so I can just flop on Friday when the SE's start up (whatever they are this time!!!) Deb, you make me feel better about missing my two ACS fitting appointments. Maybe you don't want/need a wig? Many ladies say a wig is tight, causes headaches, uncomfortable, etc. I am still on hats/scarves over here myself. Sometimes I'm happy I look cute, other times I am uncomfortable with this new and seemingly strange look. Do I look like a cancer patient? Is a scarf wrapped around my Comfy cap too much? I now know where to pee in a 20 mile radius around my house!!! LOL!!! TNT, I really hear you as my husband died of a brain tumor in 2000. When people ask me how I am doing I really don't know what to say because compared to him this is a little lurch in the backseat as opposed to a complete mangled car wreck. I do want to be honest and let folks know I am distressed some days, I do need help from time to time altho not a whole lot, etc. But it is hard to explain. One thing I heard other survivors talk about what even with kids, once they know they are very sick they seem to find an inner peace. Often kids are more resilient than adults. It is so hard when kids are sick because they haven't had a life yet! In my 51 years I have done a lot of living, so I feel not so worried about going on to another dimension to do the next thing. Here's all the galz going today ~ while mother78 went yesterday, so hopefully that went well. Deb, try not to worry, you can do this! And it may be easy as pie, my first one was for me! I felt fine until the weekend, then a flu-like feeling for two days, then better ... Thu 10/30    MeMePat (TCH#2) Thu 10/30    Lori Bourscheid (Abraxane/Avastin) Thu 10/30    Peeps (TC) Thu 10/30    Kim/threegirlsmom Thu 10/30    ggoff0124 (Taxolx12) Thu 10/30    debk (AC/Avastin)  ",
      "MessageIndex": 389,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 3, 2008 12:57AM unique wrote:",
      "MessageIndex": 432,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 27, 2008 05:04PM unique wrote: Lisa ~ My Neulasta shots have been WAY easy. Just an ordinary shot, doesn't really hurt much.  Glad your port is working. They said since I have only 4 treatments they wouldn't use the port. I do kind of envy the folks with ports because they can do more during infusion. Plus, I am wondering should I do 6 treatments? Would my veins hold up? BTW, Ativan also helps with nausea. Keep on with the water, the more the better. It protects your stomach and bladder from the chemo and helps you minimize the side effects. I use a bottle beside me and take constant sips and never get that bloated feeling. Bluedasher and Sweetpam also had chemo today so I am wondering how they did. Lisa, keep us posted on how you feel, you know where to come for info on how to fight those side effects! ",
      "MessageIndex": 359,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 29, 2008 11:27PM unique wrote: Lisa ~ I'm so glad the urinary symptoms disappeared. You know, it's funny, but my Round 1 second week I was plagued with \"almost\" infections. A bit of vaginal itchy, a bit of urinary discomfort, a bit of sore throat, small fevers (99 mostly). One thing that threw me on Round 2 - I was all ready for a repeat of Round 1 but I had different symptoms for Round 2. Good grief. With some the first round is the hardest, then they keep getting easier. With some the first round is the easiest, with each round getting harder. I guess I am going to just have to guess what symptoms each round. One thing that was true for both rounds is that I felt bad Days 4&5, better but not well Days 6-8, then thereafter felt like my old self again! Deb ~ Do let us know how it goes. I know you can do it!!!!!!! TNT ~ That is a very cute scarf!!! Joy ~ My nurses told me to drink lots of water as you said, but also to be sure to stay very warm and bundle up once it gets cooler. Staying warm helps your veins be easier to find. Lori ~ I will say EXTRA prayers for your student and her family. How awful! Yes, it could always be worse, I tell that to myself lots. ",
      "MessageIndex": 383,
      "PostDate": "29/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 30, 2008 10:24PM unique wrote: Hi Rockfan! And good luck for tomorrow! I think most of us find infusion day isn't bad at all - the hard part is when the Decadron wears off, over the weekend. You can write here about all your SEs (side effects) and get lots of love, attention and advice. About the hair, some of us are more depressed about that than others. I've tried to make it fun, bought pretty hats and stuff and new makeup. Do what works for you. The hair will come back!!! Just keep thinking about that. Maybe, you'll find that you get a stronger feeling of who you are, not so dependent on your appearance? Let us know how it is, and know you can vent as much as you want here!!! Lynn!!! I am glad to know your first name. I am glad your Mother who is 78 years young is managing all right. How long has she been doing chemo? My hair started to fall out around Day 14 - it did prickle quite a bit for about a week before that. It hasn't fallen all the way out but it is VERY thin. About that menopause - after I was ALL DONE I felt just great!!! You may really get a second wind. I was a wreck from 2002 through 2005 pretty much, woke up every night in a sweat, couldn't get back to sleep, anxious, achy, tired, headaches. I did go on Paxil in 2004 and the night sweats went away. So don't borrow trouble and look forwards to a new era in your life, ok? Kathi - I had pulsating and my onc also thought it was dehydration. Glad they were able to fix you up there! It can also be the Neulasta. TNT - I was real worried after the whole thing with my husband that I would just be a wreck when the next shoe dropped. And as I was telling Lynn, I was a wreck most of the time after my husband died, went thru all those emotions, grief, feeling like half a person, anxious about everything. But, as it turns out, I've learned something from it all, and I can feel it, a sense of peace about the future, no matter what happens, altho I'll be honest sometimes I feel afraid too, but I also feel an inner strength. ",
      "MessageIndex": 400,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 1, 2008 11:08PM unique wrote: http://suzy2110.wordpress.com This is the Irish lass who started this whole thread. She's not on here at the moment, but I'm enjoying her blog!!! Altho she has had trouble with the chemo and been in the hospital for fevers. ",
      "MessageIndex": 419,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 9, 2008 10:36PM unique wrote: Elizabeth (I love my kids) ~ I am doing better this round than last. I tapered my dex just a little more, instead of taking 4 pills on Friday and then crashing Saturday, I took 2 on Friday morning, 1 Saturday morning and one Sunday morning. My onc said it doesn't make a difference but I think it did. My cold went away day before chemo. How lucky is that? On the other hand my son got a fever with his cold and had to go stay with a friend during my treatment. Yesterday I slept a lot but with Tylenol felt pretty comfortable. Sweated a lot. Today was tired but felt pretty good. I am not shaving my hair either, if it goes, it goes. ",
      "MessageIndex": 506,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 3, 2008 09:27AM unique wrote: Hi, Deb ~ I am thinking in terms of strength, Ativan is first (works a little), Compazine next (stronger), Zofran next (stronger) and Emend (really works if nothing else did). So for gals for whom insurance is balking at Emend, may get relief with Zofran. Fammy ~ Nice to see you and that you are doing ok. Does sound like you had a rough time about the tooth. You know, with both my TXs my jaws ached. Hmmmm. ",
      "MessageIndex": 436,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 11, 2008 09:59AM unique wrote: I am thinking so much about Cheryl, hoping it will go much better than she was worrying. Maybe in a day or two she'll come in here and let us know and hopefully it was okay. None of this is great, but survivable at least I hope. I have had trouble with overwhelming panic and I have learned to take my little pills (Ativan sometimes, Klonopin sometimes) when I really need them, that is if I am pacing and hyperventilating. I use prayer, music, friends, positive thoughts etc. and you never know what is going to help your panic, it could be any one of these OR a little pill. Use the tools you have I say! I have had help with my panic, generally speaking am doing fine now since I started treatment, only need a part of a pill every now and then, haven't needed anything for weeks now ... I am hoping the Emends and Aloxi and Decadron make her SE's tolerable. Now back to makeup and hair!!! Yay!!! TNT, just play with the makeup, you'll get the knack. I got some eyeliner but I'll tell you it was a failure, I'm back to just playing up my eyes a tad with some eye shadow. I'm tossing some of it now because it was the wrong color, and getting some new in the right color now. I didn't wear much makeup for the last 10 years because (strutting) I looked pretty good even without it, would just do it when a work event or something. I finally got lipstick in the right color but it's a little irritating on my lips this week, that wrong color is very moisturizing LOL! Have fun with it. Benefits and Your Public Persona ~ I think this is a topic all on its own. Somehow it can feel strange how people react to your cancer diagnosis and treatment. Their take on it is of course going to be different than your reality. I try to just accept whatever love and good feelings come my way even if it doesn't quite fit. I have been trained though, have had a number of upsets, health and otherwise, with my hubby and myself so have been here, done this, and wear that T-shirt because what else ya gonna do! The only caveat with this would be on occasion the Well drive the Sick crazy with well-intentioned projects - the Benefit should not put you out, you should not exert extra energy about it. You need to heal! I remember with my sweetie his relatives had us make a trip to visit them from Chicago to Pennsylvania/New York and that is just STOOPID. He wanted to go anyway. But the Sick do not visit the Well, it is supposed to be the other way around!!! Crazy family dynamics. So stand firm if folks' helps aren't really helpful, let them know what you need and don't budge. Do you need some extra money? Some of us are way shorted on medical insurance so definitely could use a bit of a help here, so let em throw the Benefit and be well and happy, okay? I think it definitely helps to let folks do whatever they are moved to do, it is good for them as well as for us. We are *ALL* gonna have times in our life when we need help and when we have the opportunity to help others. So they will feel better if they are part of the Helping Thing, it's just good all around.",
      "MessageIndex": 525,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 4, 2008 11:09AM unique wrote: Huh, I wanted the pneumonia shot and the flu shot before I started, but they didn't have the flu shot out yet. So I guess I'll ask again about it. I would think I'd want it right in the middle of a cycle, after nadir has passed, whenever that is. When I went in last time with a fever it was Day #5 of Cycle #2, and my white cells were high. The nurse said that's good, if you weren't on chemo we'd suspect an infection (?) but since you are it's a sign your WBCs are in good shape. Then she put me on Penicillin. Were my counts just not knocked down by the chemo yet? I wish I knew how this tends to go. And ~ are your counts lower as you go along, i.e. even with Neulasta they tend to bounce back less well? ",
      "MessageIndex": 452,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 23, 2008 07:06PM unique wrote: Hi everybody! I'm having chemo Wednesday too. I don't know what anyone else is doing except Lori, Martha and me though. Here is the list for three weeks ago, ladeez!!! let me know who else among you is going this week, ok? Tue 11/4    sobx/Joy (AC, #3) Tue 11/4    ilovemykids/Elizabeth (TC, #2) Wed 11/5    mother 78 (Herceptin/Taxol) Thu 11/6    Fammy5 (AC+T, #3 of 8) Thu 111/6    Lori Bourscheid (Abraxane/Avastin) Thu 11/6    unique/Annie (TC, #3 of 4) Thu 11/6    Cheryl (AC-T, #3)  ",
      "MessageIndex": 614,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 7, 2008 09:42PM unique wrote: P.S.: Fammy ~ some ladies say Claritin and/or Benadryl helps with SEs. I take one in am and one in pm for my allergies and maybe that is helping me some. They are both cheap, it is worth a try. Benadryl also helps sleeping and as the precursor of the SSRIs is also relaxing.",
      "MessageIndex": 490,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 03:40PM unique wrote: Hi Deb & Linda ~ I think the hair was itchy for almost two weeks, it was kind of nerve wracking because I knew it was going on but it seemed to take its time to start falling out. I just did Round 3 and there is still a teeny bit of fine hair all over and it seems to be staying. It's comfortable and I didn't shave it or anything, my onc said it would all go but I'm just waiting to see. I even have started to leave off a hat if it is hot (over the weekend I had hot flashes and as well it was warm out) and felt I didn't look half bad because I have some hair and I am getting used to how I look with such a thin coat of down. Or something. I think unless it is patchy or uncomfy leave the hair alone, wouldn't stubble be kind of uncomfy? Each to her own I guess!! Many gals like to go au naturel with their bald heads, that would not be me yet I don't think, at least out of the house. Too bashful.",
      "MessageIndex": 510,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 05:35PM unique wrote: hi Bluedasher ~ my hats are a little big so I've had to use a hat liner to make up the room. It's a small deal I guess but looms larger on the self-esteem front. It's so great to see all of us doing it differently. Still always self-esteem surprises. It was cold today so I put on a turtle neck shirt and I have gained a little weight so my neck bulged out a bit!!! I didn't like that look at all!!! That shirt is a tad too tight and is going to go in the bottom of the bin I think. Thankfully the onc says I will probably lose it again. I sure hope so!",
      "MessageIndex": 512,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 08:36PM unique wrote: Bluedasher, I think it's kind of hard to plan for losing your hair, tee hee. I actually have never seen my scalp before in all the 51 years I've been wandering this planet. It is rounder than I thought it would be. I thought I took into account the volume of hair in terms of hats, but no my bean is smaller than I expected, so the hats are bigger than expected. You evidently went the other way, and it is an adventure to say the least.",
      "MessageIndex": 516,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 4, 2008 07:39PM unique wrote: Hi all ~ My cold is finally winding down. Still coughing a bit but the fever didn't go up tonight - yay! My chest is very tickly and I still have a PN drip. Have past the constipation part and am now doing the diahrrea phase, LOL. I am annoyed that chemo again trashed that first week with a wierd SE that wouldn't let me do my normal life. Next week I should feel normal again - maybe. ",
      "MessageIndex": 655,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 13, 2008 08:32PM unique wrote: Kristi - I have no idea why I am so up, as you say. Actually since 2004 I was clinically depressed, but after going on Paxil this got better. I was worried I was not strong enough for the rest of my life, felt very fragile, would freak out driving distances. Since my periods stopped though I feel like a new woman. Was it all menopause? It is hard to say because my husband died in 2000, then we had 9/11 which freaked most of us out, me too, and politically speaking it has been a roller coaster to say the least. I was strong while my husband was ill. Then I sort of fell apart? Was it PSTD and it resolved? I was really scared when I got the diagnosis, just was pacing, hyperventilating, praying, talking to friends, singing songs in the shower, running around my house, finally I settled down once all my tests came back and I was able to say, well, this part is not so bad. I think the worst moment for me was after my operation and my surgeon said I did have micromets in 2 of my nodes. I just had to sob for about 10 minutes. Then I accepted that and went on. Since then, I've been fine. Is it Adrenalin? Is it a new mind set from having this? I used to fret how my savings would last through my \"retirement\" - you know around 75 when I am too sick to work, how I would afford my medications for arthritis or whatnot, would I have to suffer a lot of pain? and I'll tell you I am not worrying about that at all any more!!! If I live that long it will have to take care of itself!!! I am going to be happy RIGHT NOW for pete's sake. Does this make any sense? I may have more trouble once my treatment is over, I'll have less adrenalin going on, more time to think worrisome thoughts, but I hope I don't, I just focus on BEING HAPPY for however long I have on the planet. The only other thing I can think of is Vitamin D. I get enough of that now, from about 1985 to last year I kept out of the sun, and I mean totally (so as not to get skin cancer). They now think Vitamin D is important for lots of things. Could my good mood be partly that I get enough Vitamin D? I also take a multi that gives me lots of B too. Not too much, my onc passed on my vits.  Does anyone else wonder why they are taking it all well? Or why they're not? I'm not sure there are any good answers though. P.S.: The only two things that really stopped the panic were 1. shopping at Target and 2. Half a Klonopin. Part of it may be the Klonopin works for me if I've prayed, ran, meditated, vented, shopped and none of those has helped. It takes the panic and makes it disappear.",
      "MessageIndex": 551,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 17, 2008 12:04AM unique wrote: Where is everyone? I hope you all are okay, especially those getting chemo this week. You know who you are, but I don't!!! So write in and let me know how you are doing. Tomorrow I am going on a grand tour to get all my films and slides at a clinic and two hospitals in advance of my appointment at U of Penn in Philadelphia Thursday. Will drag my kid along as he is still having a fever and taking Penicillin for his cold, which turned into conjunctivitis with goop coming out of his eyes, major bloodshot in his whites, and red puffy eyes. Also a sore throat. So he is now on Penicillin LOL. I say that because it took 2 antibiotics and I am still recovering. Horrible bug. So wish me luck and that we don't have ice - it snowed beautifully for a couple of hours and is now raining ... Fammy, how did you do?",
      "MessageIndex": 694,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 19, 2008 10:26AM unique wrote: Kristi ~ Well I am done with chemo but it looks like I will have to rads after all >:@* So not quite done. Must somehow fit all the yearly appts in there too somewhere as I am overdue for them all. It is snowing here. My son is feeling a lot better. I was better but the exertion of driving down to Philly to see Dr. Kevin Fox took the stuffing out and I woke up feeling distinctly worse, aches and a definite post nasal drip. Will rest today. Dr. Fox was great, I am really glad I saw him altho I will have to pay for this visit as I am over my number of doctor visits for this year thru insurance.",
      "MessageIndex": 703,
      "PostDate": "19/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 17, 2008 10:47PM unique wrote: So who is going this week???!!! I have Bluedasher today but no one else on my list. I am thinking some of you from 2-3 weeks ago must be going. Let me know, and then let us know how you feel, okay?",
      "MessageIndex": 585,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 18, 2008 09:54PM unique wrote: Blue, Plaka, Jill ~ So sorry you are having these folliculitis problems. Cheryl ~ you made me laugh so hard!!! \"I'm all talk and no action\" I get this some Days 5-8, how can I put this delicately? I am like a pet rabbit, hard little balls, plop, plop, plop. So strange. I take Miralax to get them going, or I feel like there is cement hardening in my gut. Then Day 9 or thereabouts, WHOAH the runs. I know where every bathroom is in my 15 mile area around the house. Bruises are better, quite colorful but not sore anymore. Here have an OT (\"off topic\") bit - the Parents are trying to decide whether to sign up for a Medicare Advantage Plan or instead a Medigap with a Part D prescription drug plan. So I have been working pretty much full time on The Project, which is so complicated it would make your eyeballs fall out and roll across the floor. They were on a Traditional Indemnity, free through their pension, but the pension has decided to do this Fee per Service thing instead called Secure Horizons. The name ought to tell you all you need to know, LOL. There's no contract, no network, none of their doctors have heard of it and if a doctor's not on the plan no Medicare payment at all, not just no Medigap payment. Plus ... the doc can charge you the diff between what Medicare approves and what he charged, that does not sound good at all. So we are numbers crunching, as The Mom is on Femara, that stuff is expensive. I will probably be on it soon :@*",
      "MessageIndex": 596,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 1, 2009 08:42PM unique wrote: Cheryl, Try to hunker down and just realize this will pass. I am not my bouncy stuff right now either, and I'm not going through what you are. What you posted is JUST AWFUL. You SHOULD feel down, if you weren't I'd wonder about your sanity. Let your kids watch TV. Cry if you need to. You may not be good at hunkering, it's a skill I learned while my husband was sick. Just put the hopeful brain on hold, know IT WILL GET BETTER and just wait. Also from migraine headaches, which are as you said, the pain is such that you are not lucid, just a trembling ball of agony for hours on end. I will wish for all this to pass SOONEST because you have the sweetest smile in your photo, my heart goes out to you every time I see your face.",
      "MessageIndex": 738,
      "PostDate": "01/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 3, 2008 01:44PM unique wrote: Gals ~ Now that I am back in the Land of the Living I wonder who is going this week. Lori most likely, because she goes several weeks and then has a week off. I think. Kathi and Kimberly on Thurs and Plaktakr on Friday. I'm rooting for you gals!",
      "MessageIndex": 649,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 11, 2009 01:35AM unique wrote: Lori ~ I am dancing the dance for you!!! I'm so glad to hear! I'm doing okay over here, been working more since I finished. Was so tired the first weeks after chemo ended but am feeling more energy now. Soon start radiation, so perhaps will get tired again. I went sledding today with my son and his friend so am really feeling a new lease on life. I love sledding!!! Actually went down myself a couple of times and then huffed back up the hill. Have to take this easy because of my arthritis. The huff and puff back up the hill is always wonderful, as opposed to walks I really am happy to go up because then I can sled back down again!",
      "MessageIndex": 762,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 10, 2008 08:29AM unique wrote: Hi, Hermits! I think I should have been more hermit-like, as I caught a cold at Halloween (at least a day or so later I started sneezing) and it is still bothering me a lot. I've run fevers on and off, but for the last 5 days or so no fevers, just a lot of coughing and spitting up globs of mucus. Plus I have soreness at my incision site, I think from coughing, and there's also a sore spot near the bottom of my rib cage on the left, also probably from coughing. At least I'll try to not worry about mets at this point! When I stop coughing if it's still there I'll worry about it then. Also it may be time for soreness at the incision because definitely the numbness is fading. Anyone else find the numbness fades after awhile? For me it's been six months since surgery now. So, hermits take courage! Don't be like me and catch something! Maybe go out and take walks in the fresh air, but stay away from people.",
      "MessageIndex": 671,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 12, 2008 02:58PM unique wrote: P.S. - I also forgot to ask about Stevia. I haven't had a chance to get to the Health Food Store to look for Blue Agave nectar, but at the local grocery I found some Stevia. That's better than sugar or Sweet n Low I would think. What do you guys think?",
      "MessageIndex": 687,
      "PostDate": "12/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 24, 2008 10:52PM unique wrote: Happy Holidays to everyone - and we really are having \"Holidays\" now - Hanukkah started Sunday and Christmas is tomorrow, and I don't know if anyone is celebrating Kwanzaa but that and Boxing Day are Friday. I'm less positive the last couple days, hopefully it's just that I'm tired. The car accident, then the 1st rental car, then the flat tire on the 1st one on the way to see Dr. Fox in Philly, then the snow and ice, and now the 2nd rental car. Plus a job came through and first I said I couldn't, then I felt better and said I could, so have been trying to do that plus everything else and I'm pooped!!! No time for me to just rest. Well now that I've gotten that all off my chest, maybe I should just rest for the next two weeks?! I have to see the radiation lady on Monday, get my bone density done, but that's really it. I did get some lovely and very warm fleece bucket hats from CJ Hats and one very cute sleep hat which is red with white snowflakes on it. I have one with a long tail that's blue with snowflakes that I adore, but it can be too warm. This one is just a little lighter which is just what I needed. Trying to recapture my upbeat self!!!",
      "MessageIndex": 718,
      "PostDate": "24/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 19, 2009 10:21PM unique wrote: Got over being bashful. So here it is!",
      "MessageIndex": 770,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 5, 2009 03:34PM unique wrote: Lori and Cheryl ~ It is soooo quiet in here I must say! I think some of our ladies have left us (sob) and they are in the Rads Group now. I'm in there as well altho pretty much lurking as I didn't start rads yet. I've been held up by two missed planning appts. One illness (my son) and the other snow. I go back next week. So, just taking it easy and enjoying my hair. I colored it as it was sooooo grey. It's a nice brown now. You can color it at 1/4\" if you like, I found. I was afraid it would color my scalp and miss the hair, but it was okay, that didn't happen. And my hair is really soft, I like feeling it. Altho I am wearing my hat because it's cold out today, and it's cold in here too. About an hour after doing my exercises I started to feel the chill and put on socks and a sweater and my hat. I'm using the wii FIT and it's VERY good for a couch potato like me.",
      "MessageIndex": 777,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 01:54PM unique wrote: P.S. Cheryl and all ~ am going for second rads planning next week. I'm biting my nails that I gained or lost weight - the Wii has me down or up 4 pounds every day. The scale is more consistent at 167 pounds. The Wii thinks I'm 157 pounds!!! LOL!!! Whatever.",
      "MessageIndex": 781,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 12, 2009 01:11AM unique wrote: Lori - you are looking very cute with your blond hair! I am fine, did first rads tx today, it was uneventful, but I don't know how I'm going to get through 33 treatments. Not difficult, but annoying to have to kick my butt in there every weekday.",
      "MessageIndex": 788,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 18, 2008 02:51AM unique wrote: Elizabeth ~ It will get better. My ton of bricks will be tomorrow I think if 2nd Rd. like the 1st. Have lots of library books, herb packs, popsicles and Tylenol to get me through. Guess the 2nd Rd. will knock out the rest of my hair. It stopped shedding a couple days ago, which is nice on account it's not prickling and itching. But it's so thin, I'm wearing hats and scarves now. Drink as much water as you can, and take Tylenol or something for the worst. Ask your doc office for something stronger if Tylenol, Aleve or Ibuprofen does not help. ",
      "MessageIndex": 221,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 18, 2008 06:26PM unique wrote:",
      "MessageIndex": 230,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 19, 2008 11:57PM unique wrote: Elizabeth (Ebann) ~ Arghhhhhhhh! I am so sorry you have to go through this. I thought I had the biggest tumor ever (4.2 cm.) but gal you got me beat! Keep positive, you gonna be okay! How did they find the more cancer? Same place or in a different place? This is what worries me, that I'll wake up and find it's in my bones and have to start all over. Argh! Argh! Argh! I'm thinking who is doing chemo this week, the list says: Kimmy Sue 10/23 (this coming Thursday)  no chemo type listed though - hey, Kimmy, list your poison! Bluedasher 10/27 (a week from Monday) TCH Anybody else doing an infusion this week? Love, Annie ",
      "MessageIndex": 237,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 20, 2008 12:00AM unique wrote: Galz ~ Forgot to say how I am doing, I started Rd #2 of my TC on Thursday. Felt kinda icky Thurs nite but I hadn't taken as much Decadron as usual (forgot to take the script out of the doctor's office and didn't remember until that night!) Fine Friday, did alot, then last two days have felt like a steamroller went over me, plus I'm all pretty and flushed and pink. No makeup needed! Not that I felt like it anyway. Metallic taste, but basically fine except for the EXTREME EXHAUSTION. Sleeping okay with Benadryl and Ativan, just a 1/2 pill. ",
      "MessageIndex": 238,
      "PostDate": "20/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 21, 2008 09:29PM unique wrote: Here's a new list, just of those who either had chemo last week or it's coming up this week or next. October 08 Ladeez Last Week Tue 10/14     Elizabeth    (TC) Tue 10/14     ilovemykids (TC) Thu 10/16     Annie (TC) This/Next Week Mon 10/20    Kathi (AC-T) Thu  10/23    Kimmysue (TCH?) Mon 10/27    Lisa 1964 Mon 10/27    Bluedasher (TCH)",
      "MessageIndex": 260,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 22, 2008 02:10PM unique wrote: Hi EconMom! Wow what all you have been thru! You are an inspiration! BTW, surgery itself isn't usually painful, not too many nerves in the breast other than nipple (sob). Underarms if you need lymph nodes removed can be a little sore. And you'll be in the B Flat club! I myself have one non boob and one floppy boob, a little unbalanced, but I'm like that! LOL! Lisa ~ yesterday my bad mood lifted as my fever receded. Er, now I have some heartburn, another new SE. But the ones from my first round aren't as bad, so it'll work. I wonder how Kathi is doing, she went Monday. Kathi? Lindbad and KimmySue, good luck for tomorrow! Do well and know we're thinking about you over on the Board!",
      "MessageIndex": 272,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 23, 2008 09:35AM unique wrote: Today's List - it is really a CHEMO PARTY today!!! Thu  10/23    Kimmysue (TCH?) Thu  10/23    Kathi (AC-T) Thu 10/23    lindbad2 Thu 10/23    Cheryl (AC-T) Then tomorrow plaktaker goes Fri  10/24    Plakatakr Dear AC ladeez, celebrate that red liquid!!! And take it easy! We'll be looking for you and finding out how it went and to listen if you have SEs and try to help and give advice if we have any!!! And keep your spirits up if it's hard!!!",
      "MessageIndex": 296,
      "PostDate": "23/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 26, 2008 03:42PM unique wrote: I am thinking about all the gals going for their chemo this coming week. Let me know if you're not on the list, okay? I tried to include everyone. The only thing I prepare for is all the spare meds I'll need (Claritin, Loratidine, Ativan, 8-hour Tylenol, etc. Then I vaccuum the house and believe it or not nagging my son it stays pretty clean now for 3 weeks. Friends bring food that weekend and that makes leftovers for a couple days too. I also call buds to have them take my son out to eat if I'm totally down for the count. One question: if any of you gals are going to vote, how are you managing that? Did you do an absentee ballot, or taking a chair, or going early, or going late, or what? I am soooo thankful next week isn't a chemo week. UPCOMING CHEMO Fri  10/24    Plakatakr Mon 10/27    Lisa 1964 (TCH) Mon 10/27    Bluedasher (TCH) Mon 10/27    Sweetpam Wed 10/29    mother 78 (Herceptin/Taxol) Thu 10/30    MeMePat (TCH#2) Thu 10/30    Lori Bourscheid (Abraxane/Avastin) Thu 10/30    Peeps (TC) Thu 10/30    Kim/threegirlsmom Thu 10/30    ggoff0124 (Taxol#6 of 12) ",
      "MessageIndex": 351,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 18, 2008 03:27AM unique wrote: Ok, who is not on this list? I copied it a couple pages ago and added myself. And where is Suzy from Ireland who began this wonderful space? October 08 Ladies SuzyWillKickThis            Sept. 30 / Oct. 2   FEC x3 taxotere x3 /rads            Ellzig                              Sept. 30                AC x 4/ T x4 Wyndywy                        Sept. 24    Annie                              Sep 25/Oct 16      TC x 4 (Taxotere/Cytoxan) Keryl                               9/26                     A/C x4  T x 12 ladyleen4                         9/29                     TC x4/ rads Peeps1111                     9/17 (2nd on 10/9)     TC Duke 2001                       Sept ?                   OregonPenny                   Sept ?                   TC Bourscheid                      Oct 2                   Abraxane/Avastin ( just dx with mets) Fammy5                          Oct 2                    AC x4/T x4/ TNT                                  Oct. 3                  TCH Sobx                               Oct 7? Prayinghands                   Oct 9                    AC Threegirlsmom                 Oct 9                    TC x6/radiation Jenn46                           Oct 9                    TC x4 then tamoxafin Ilovemykids                     Oct. 14                  TC x 4 Kimmysue                      Oct. 23                 Golfgirl                           Oct. ? (2nd wk)       AC then T + Herceptin, Scarp                              Oct. ?                    Taxatere or CMF x8 Dee811                           Oct.10                    TAC                             bar62                             changing Onc           1 AC in Sept AngelEyes                       Oct. 7                    AC-T bluedasher                       Oct 27                  TCH kathimdgd (Kathi)              Oct 20                  AC-T",
      "MessageIndex": 222,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 18, 2008 03:38AM unique wrote: Hiya all ~ I found Suzy by clicking on her name next to her avatar. I sent her a post to say we're all thinking about her. Also there's a link to her blog and you can catch up with her there. She has the most beautiful kids and she looks beautiful in her buzz cut! She can write, too, made me smile and laugh alot. Here you go, catch up with Suzycankickthis! suzy2110.wordpress.com ",
      "MessageIndex": 223,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 28, 2008 05:43PM unique wrote:",
      "MessageIndex": 370,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 1, 2008 10:45PM unique wrote: Here's our crew I have for the upcoming week. I'm on it - I go Thursday. Please let me know if you're not here! Also, here's another list of you gals I haven't heard from lately, but you were on the original list. Please pipe up and let me know what's up with you! (I did PM Suzy but she's not answering :@( but she has a blog which is fun! Another thing I thought of that would make it really easy for me is to put in your signature (not your dx) when your next treatment is. See mine? Like that! THIS WEEK GALZ!!! Tue 11/4    sobx/Joy (AC, #3) Tue 11/4    ilovemykids/Elizabeth (TC, #2) Wed 11/5    mother 78 (Herceptin/Taxol) Thu 11/6    Fammy5 (AC+T, #3 of 8) Thu 11/6    unique/Annie (TC, #3 of 4) Thu 11/6    Cheryl (AC-T, #3)  LOST GALZ Wyndywy                        9/24 Keryl                               9/26                     A/C x4  T x 12 ladyleen4                         9/29                     TC x4/ rads SuzyWillKickThis            9/30, 10/2      FEC x3 taxotere x3 /rads           Ellzig                              9/30                AC x 4/ T x4 Duke 2001                       Sept ?                  OregonPenny                   Sept ?               TC bar62                                  Sept ?                         AC-changing Onc Linda            10/2             TC 4X(every 3 wks) then Herceptin for 1 yr AngelEyes                       10/7                    AC-T Prayinghands                   10/9                    AC Jenn46                           10/9                    TC x4 then tamoxafin Golfgirl                           10/? (2nd wk)       AC then T + Herceptin, Scarp                              10/?                    Taxatere or CMF x8 Dee811                           10/10                    TAC          ",
      "MessageIndex": 417,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 1, 2008 10:46PM unique wrote: P.S.: Or if you PM me and let me know if it's weekly, every 2 wks, or every 3 weeks, then I can look at my calendar and I'll know when your next go is, unless of course you have to put off because of SEs. Not!!!!!!!!",
      "MessageIndex": 418,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 22, 2008 04:49PM unique wrote: Karen ~ everybody is different, but ask your onco or nurse about avoiding all the nausea next round. Things to ask about: Dexamethasone the day before and for a couple days after, Aloxi in your IV, Ativan for nausea after, then Compazine if that doesn't work, then Zofran if that doesn't work OR since you had so much trouble if your insurance will pay for it the amazing miraculous Emend which is $400 for the 3 doses I kid you not. I got it all but didn't need it - I have had other issues. It is crazy - I had aches and pains my 1st round and this round it's none of that but instead heartburn and brain fog. I've been weepy for the last three days and everyone on here knows I'm a cheerful person by nature. I'm just so tired of losing everything and being disoriented. Whatever it is, it usually lasts just a couple of days and then you feel better. Think of that and stay strong! fivekids, have fun with your hats. I sure have! ",
      "MessageIndex": 284,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 6, 2008 10:22PM unique wrote: Ok, Guys, I'm so pooped, so let me know who is going next week? This is what I have ~ Mon  11/10    kristifromsandiego Fri     11/14    debk (AC/AvastinX4 every 2 wks +T/Avastinx12, every wk) What about the pile of you who went the week of 10/24? Guess I think the TC and TCH folks might be going every three weeks and the AC(+T) folks every two? Maybe?",
      "MessageIndex": 475,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 10:24PM unique wrote: Cheryl ~ Know I will be thinking about you and hoping it all goes well!",
      "MessageIndex": 520,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 1, 2008 09:52PM unique wrote:",
      "MessageIndex": 415,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 13, 2008 02:01PM unique wrote: Sobx, I too am completely mad at your soon-to-be-ex. No matter your relationship troubles he should have compassion on you as a fellow person. I am a single Mom but my 10 y.o. helps out a lot to take care of himself and me too! He eats what's in the fridge whether he wants to or not, so I don't have to make a dinner. I also have friend bringing me dinners. We need to get you some help and get you ideas you can use. I would like to kick his butt myself! Feeling tired today, Day 7 of Round 3 ... ",
      "MessageIndex": 545,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 3, 2008 08:57PM unique wrote: Suzy ~ it is SOOOOOO great to hear from you!!!!!!!! But, starting the thread was enough, you just have to understand with your powerhouse personality we were all curious if you were ok, what happened, how you are doing etc. So pop in once in a while or whenever you feel like, no pressure whatever! If you don't pop in we'll hunt you down on your blog to see how you're doing :@D",
      "MessageIndex": 446,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 13, 2008 08:36PM unique wrote: Peeps ~ plan to have your stepdaughter and her husband help you with everything you are doing. I know they won't mind, and you'll enjoy the rest. Kristi ~ my bone pain was okay after regular Tylenol. Well, my onc said drink more water, so I did that too. It was more of a throbbing than an actual pain. Well, it was painful but I'm a migraine sufferer so maybe my sense of pain is skewed. To be honest none of the chemo SEs is nearly half as bad as some of my migraines. Maybe that's why I'm so up? I've suffered so much worse already? ",
      "MessageIndex": 552,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 14, 2008 12:19AM unique wrote: Penny ~ I have had no trouble with my Neulasta shots, other than some low back pain, like menstrual cramps, and if I take Tylenol they go away. I am so sorry about your hospital stay, I worry all the time that something like that will happen with me. So far, so good. I worry that the low back soreness is a kidney infection coming on or something. Hopefully not.",
      "MessageIndex": 555,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 14, 2008 05:21PM unique wrote: Hey, Suzy !!! You come in here only when you feel up to it, okay? My heart goes out to you as you've had as rough a ride as anybody here I would say. You too are a tough gal. As I said, I have no idea why I'm so cheerful these days as for many years I knew I should look on the bright side, but it seemed to escape me. Maybe it was the trauma of the diagnosis? I was so scared the doc would say I had a 3 lb. tumor and I had a prognosis of 6 weeks or something. I know that is dumb but as I said sometimes you're just scared and there's not a whole lot that helps (except half a tab Klonopin.) Once I realized hopefully after the chemo that would be it for the cancer, in fact a good chance of that, it is like I have a new lease on life. What me worry? That said I am exhausted and sore today, did not do a whole lot but all I want to do is rest it seems. But I have to eat something, and so does my 10 y.o. ",
      "MessageIndex": 557,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 6, 2008 10:19PM unique wrote: Kristi ~ My veins are doing fine. No trouble and I have done 3 rounds so far. Now you might count 4 as my office has suddenly decided to do a full draw for bloods instead of the finger stick. TX#1 they used one off the back of my hand near my thumb, for TX#2 over near the pinkie, then today the thumb side again. I have to use my right side only as my mast was on the left. Hope it goes as well with you!!!! ",
      "MessageIndex": 474,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 17, 2008 07:41PM unique wrote: Hi everyone ~ onc said my platelets seem fine. Since bruises are in only one place, indicates an injury. Guess I musta done something and then forgotten it :@* If the platelets are low, you get bruising all over.",
      "MessageIndex": 583,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 27, 2008 10:12PM unique wrote: Elizabeth, I hope you are done there, and I had a great Thanksgiving with my family which is the point of it all. But I am very tired tonight, I think the Decadron gets me so revved up and altho I can sleep because I take a half Ativan it does tire me out. Tomorrow get my Neulasta shot and a girlfriend is driving because my car is out of commission. I hope to talk to the insurance guy if his office is open about what shop to take it to. Since you are Carboplating I'll ask how is that going? That sounds like a tougher chemo than most of us are doing. I know Cheryl was scared of it and then her onco changed his/her mind about doing it. It is that scary? I hope you will be done. If not, let them do Christmas for you. Really. They can order a dinner from a caterer - I don't know where you are but here in the Northeast we have a store called Wegman's and they cook the most wonderful dishes to take out. We did this twice now on Thanksgiving - my sister makes a Turkey but I bring the sides from Wegman's. It is a wonderful spread and something we can do - she has Lyme disease so has energy issues too. Joy, people were asking why I'm so cheerful, and I think it's just luck because I have not had that many side effects. Mostly the annoying ones, and I did have to get an antibiotic for a fever and now I'm on Augmentin for a cough in my chest I've had since that last treatment. But it is really helping, I was really coughing a lot the last couple of days, just starting up with fits that wouldn't stop until a little bit of gluey phlegm, the culprit would come up. And so forth. But nothing like spots all over my body! My heart goes out to you honey, that would freak me out! It's not chicken pox I hope. Boy I'm tired. ",
      "MessageIndex": 626,
      "PostDate": "27/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 29, 2008 05:53PM unique wrote: Hi gals ~ doing okay, finished TC#4 on Wednesday, feeling gingky today but not too bad. Picked up some books at the onc office - they have a whole bookshelf of mysteries and bodice rippers that I guess people have donated. I did pick up one that was great about breast cancer - \"After Breast Cancer\" by Musa Mayer. I've been wondering about checkups after my treatment is over (maybe I'm done, my onc wants me to double check with a rad onc about rads because the treatment standards are changing, they are starting to put more rads back) and my surgeon didn't recommend a whole lot of testing, which disturbed me. This book kind of gave me a different perspective about testing after, because I guess most of them don't tell you much but just put you in for a lot of other tests and upset, and it's really symptoms that will tell us if we are having a new problem. This made some sense to me. I am seeing an expert in December and will ask him too about tests he thinks are good to do. I hope we are all done with breast cancer after our chemo and rads!!! We have to have confidence that we will be okay for a long, long time, and there's no reason to not be confidence in the light of all the new things coming along all the time. ",
      "MessageIndex": 631,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 11, 2008 08:51PM unique wrote: Cheryl!!! ~ I know this is silly but I was thinking about you all day!!! See how it works out sometimes??? Altho sometimes it doesn't, uh. I think someone else on here is also doing Abraxane, would that be Lori Borsheid I think!!!!! So maybe you can compare notes. Good grief on all the crazy things the medical establishment puts us through. Ran out, huh? Anyway I'm so glad you're basically okay! Let us know how it is going in next couple days allright?",
      "MessageIndex": 533,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 12, 2008 10:19AM unique wrote: Cheryl ~ Re bone pain - drink lots of water, Tylenol worked for me here. Altho my bone pain was more of a throbbing. Question for all ~ what is a lingering cough and lots of clear mucus? Is it a lingering virus or irritation? Not a big deal but I'm tired of hacking and coughing. I feel fine otherwise, no fever. ",
      "MessageIndex": 534,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 15, 2008 10:20AM unique wrote: Hi, Linda ~ Yes, you can do chemo!!! You will find the chemo will make you lighten up some, but for the most part your retirement can continue to blossom. Think a couple days every 3 weeks or so that you are resting, drinking lots of fluids, eating popsicles and crashing on the couch with a good book. Part time sounds great, it's what I do, and I work when I feel like it and catch up on my reading when I don't. Acronyms, let's see ~ ILC and IDC are infiltrating lobular and ductal carcinomas. Stage is how hey evaluate early detection or not. Stages 0, 1, and 2 are considered early. Grade is how aggressive. You will see our gals fighting some of these and they are still kicking cancer butt. ER/PR and HER are receptors. ER is estrogen receptor positive, PR is progesterone I think, I forgot what HER is. You really get a different style treatment if you are ER/PR negative and there's a chemo, Herceptin, that really works well on HER+.  ",
      "MessageIndex": 562,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 12, 2008 01:36PM unique wrote: Hi, Unique here ~ I *think* the cold is better. Today was the first day I didn't have a rush of stuff trying to get out of my lungs and head on first getting up, leading to a coughing fest of about 20 minutes before it died down. I swear I've been spending most of my waking time productively coughing mucus for the last week. But the downside is that the low fever came back last night. I felt really exhausted and took a little nap from 5-7 pm then got up to feed my son and felt yukky - achy and feverish and there it was at 99.6 again. So I don't know. But while stuff stayed put first thing this morning about an hour and a half after I got up I had to honk up a whole lot of glue, so is it the same thing? My son has a low fever and he is home today as well. I'm sorry to be absent from posting but I've been trying to catch up with stuff while I was down for the count and that is hard! Spent an hour or so on the phone checking that all the slides and films at three different places will be there next week when I go to pick them up. UPenn called to say they hadn't gotten anything, they were expecting my slides to go by mail, which I said, looking at my notes, they had told me to bring on foot. I wouldn't want my precious slides to go by mail, what if they get lost!!! (They did lose a critical MRI of my husband's in transit and neither hospital had another copy, luckily I had one in my big MRI bag, so I've been there done that and learned the lessons.) So I've been a busy little bee in spite of my cold but I am still horribly behind. I did pay my medical bills (checked the bank balance, wrote checks, licked stamps, gave to parents to mail Wed. nite). I can sleep for the rest of the day along with my kid if I want, all I have to do is check on the car to see if the body shop got the parts yet. I may cave and get a loaner next week. I just kinda dread having to go pick it up and so forth because the only thing I really have to drive for is taking my kid to his class Wed. nite. Everything else - grocery, etc. is within walking distance altho I haven't wanted to walk because it's cold and rainy and when I go out it makes things run and inspires coughing fits (with a need to spit mucus which I can't do while I'm out). If the coughing doesn't get better, I'll go back for another antibiotic or something. QUESTIONS: When after chemo can we start taking vitamin C again? I blame the length of the cold partly on my lack of C. I used to take 1500 mg a day and did pretty well, but then stopped it and now only get 60mg in my multi-vitamin.",
      "MessageIndex": 686,
      "PostDate": "12/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 17, 2008 09:45AM unique wrote: Kristi ~ I am SO SORRY you are having so much trouble. I am thinking Vicodin, that is Tylenol plus Codeine, but just because I have taken it from time to time. But definitely ask you onc for something stronger. I used Ativan for sleeping, but many of us take it also for nausea and to relax a little. They like me to take it before I come in for infusion. One thing that might be aggravating your sleeping - Decadron tends to make you AWAKE. But if you're feeling this sick that by itself might be making you sooooooo anxious. I find my mental state is very affected by how I feel physically. I imagine it is because all my serotonin is sucked up by the pain (Serotonin is a neurotransmitter that works with both mood and pain) and then I'm in more pain and also more upset. So there you have it. Now, my first TX was the worst and they have all been better from there out except as Gilda Radner would say \"it's always something\" - today I am having bruises on my inner arm and therefore another trip in to town to see the onc. I did have other plans!!! Other thing - maybe your onc will decide the TAC is too hard and do AC+T instead, that would be AC every two weeks and then when that is done just T every two weeks. My onc said TAC is very tough, he finds people tolerate the AC+T better. Or lower your dose a tad. There are lots of ways to help you tolerate your treatment better. We all want to gut it out so we get the Most Cancer Killing Drugs, but if you can't get through the treatment what good is it? Right????????",
      "MessageIndex": 580,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 18, 2008 09:23PM unique wrote: Lori ~ I'm so glad you are having a chemo vacation, and I hope you see results from it in the interim!!! Hi! I had my appt with Dr. Fox today and it took some doing because my rental car got a flat, so had to put on the donut, then went back to my sister's house for her car, then hit construction, but Dr. Fox's office was REALLY NICE, said when you get here you get here. He said 4 treatments only so I am DONE WITH CHEMO. He also said - rats - radiation is now recommended, trials have shown it makes a difference in preventing recurrence even if you had a mastectomy. It would be chest wall and nodes in neck and under arm.",
      "MessageIndex": 700,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 17, 2008 09:46AM unique wrote: PS - forgot to say, there is a thought that Tylenol is harder on the kidneys, and Ibuprofen harder on the liver, something like that. Depending on which organ processes your type of chemo, your onc will have you on one or the other.",
      "MessageIndex": 581,
      "PostDate": "17/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 18, 2008 10:00PM unique wrote: Cheryl ~ it's a wierd thing, what you mentioned about your nice neighbor getting a Taxotere reaction. I never do know what to say to people who look at me like I am a real trooper, going thru the works, and I guess I am, but once you've done some of this stuff, well I should speak for myself but some of it is definitely harder than some of the rest of it. I really don't know what to say to people sometimes, just something nice, but I feel like an alien, or they are an alien, or something. I hope they never understand, as we have enough of us gals doing this thing.",
      "MessageIndex": 598,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 19, 2008 12:15PM unique wrote: 3GirlsMom ~ I am also over the halfway point and feeling REALLY GOOD about that. I would feel REALLY REALLY GOOD but I made an appt. with Dr. Fox to discuss my whole case and I'm worrying he'll want me to do rads after, but if I do I do. Then I have to take Femara and I'm hoping that doesn't make me feel bad like I did during menopause. Two migraines a week and always a low back ache. But I have to remember to take it a day at a time.  Peeps ~ Now that it's cold, a new hat issue. What is warm enough to wear outside but won't make me sweat inside? Or do I take one hat off and put another on? Where do I put the first hat? Do I wear a hat on top of a hat? I put on the Comfy Cap yesterday and on top of that the brown felt hat. Everything fit, and the comfy cap could come down over the ears and protect against the wind. And it looked elegant, you don't see the Comfy Cap underneath. TNT ~ Yeah holy cow the medical issue is a problem in the US. I have Blue Cross and it's not half bad, at least it pays promptly and so far is acting like the brochures indicated, I have not always had that. The one before this took forever and you called and were on hold forever and then they couldn't locate the unpaid claim LOL/COL. However ~ and I'm not moaning because I have enough income to budget and manage to pay my bills, even medical ones ~ the premiums come to more than $6000/year, then the deductibles nearly $1000, then the out of pocket is $3000. So usually i spend about $7,000 a year but this year it was $10,000. $3,000 more but the original bills total more than $30,000 which is what I would be in for if not insured. I figure if we don't fix this problem it is dire but those of us who are middle or upper middle class will just have to hope we can budget so the bulk of the money goes to housing/food/medical care and we'll just have to forget about iPods and wide screen LCD TVs. I don't have any of that, and don't miss it. My computer can play nice music, so I let it :@D",
      "MessageIndex": 605,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 26, 2008 10:40PM unique wrote: Ooops I had an accident with my car. Otherwise all is well and no one was hurt. Just rearended another car while waiting for a light and thought it had changed, well it had but then turned red again. Chemo went fine and my sister drove me around but I thought I would be okay to drive tonight. Guess not. That should be my last chemo!!!",
      "MessageIndex": 623,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 20, 2009 04:15PM unique wrote: Lori ~ Don't be bashful about hair color. I use Clairol Natural Instincts which is gentle. Just put it on like shampoo, read the paper or something for 15-20 mins, then hop in the shower. I would do it even if the hair was going in a week or two, so I could enjoy the hair while it lasted!!! I can't wait for mine to get long enough to spike!!! I'll be Goth Girl for a bit, what fun!",
      "MessageIndex": 773,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 2, 2009 07:58PM unique wrote: Hi girls, I've been hiding out in FebRads and wiiFIT for the most part, with a dodge in the Lymphedema forum. Do not have that, but am seeing a PT to make sure to do everything that may prevent it. Lori, maybe just do exercise and eat right, don't worry about weight, with exercise weight tends to take care of itself. Counting calories can help too, I am on myfitnesspal.com where you can put in the food you ate and it will tell you how many calories the portion was. It remembers your daily diary every day and lets you add fluids and exercise and it shows if you've gone over and under your goal. I am not allowed to lose weight while on radiation though.",
      "MessageIndex": 800,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 7, 2009 05:19PM unique wrote: Cheryl, Does carbo cause permanent damage in some people? I do know it kicks ass. I mean, of people. I hope it kicks cancer ass too. Who are the other people in your avatar? Looks like a cute husband and two adorable daughters.",
      "MessageIndex": 807,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 9, 2009 12:34AM unique wrote: Yeah, I was thinking 9 months too - wow what a roller coater ride! I found my lump at beginning of june and here it is march already. In april I will be done and then counting until I get two years out I suppose then 5 years and on to 10!",
      "MessageIndex": 810,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 14, 2009 10:43PM unique wrote: Hi Cheryl if you pop in here - glad this list is winding down. I have moved on and am almost done with rads. Not as bad as chemo but has its own set of issues. I have an angry pink map on my left upper side, and every morning I drag myself off for another zap, which knocks me on my keester for about an hour or so after every treatment. I have no energy and feel kind of down. Someone mentioned it's a 9-month journey for those of us in the first phase, hoping not to repeat, but some of us will, sigh. The 9 months without respite gets tough. I'm thinking of you, hoping you get remission soon and a vacation from all this.",
      "MessageIndex": 815,
      "PostDate": "14/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 7, 2009 01:52PM unique wrote: Cheryl!!! So great to see you!!! Are you on the Mets Board too? I just saw Elizabeth I love my Kids on the TC board, she popped in to say hi. I have stayed up with all my boards because I feel I don't want to leave anything (anyone) behind, I'm so fond of everyone!) I am sorry to hear you are having such a tough time. Sorry to say but I heard Carbo is a bitch. My husband might have taken it at some point, I was worrying about it. But you seem to be doing it, I hope it kicks your cancer butt! Lori Bourscheid is also doing ongoing chemo. I sure hope I am not in the 15% of us who have to go for more, but I know it's a possibility so your posts are SO IMPORTANT in terms of making me feel that whatever it is, I'm up to it. Re depression, pain brings mine on big time. Are you on any meds for that? I kind of hallucinate when I get too much pain. I am on Paroxetine for it now, have been on it since 04 so I may have to change meds at some point. May try to kick it for awhile and see if I'm \"cured\" - as if. I took it for extreme terror and I mean extreme. I was 1 mm awhile from the loonie ward. Are you getting tumor shrinkage? I hope I hope I hope!!! And you're not a wimp!!! You're dealing with really challenging SEs and beating it like a champ!!!",
      "MessageIndex": 780,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 7, 2009 05:16PM unique wrote: Hi galz! I'm sorry I haven't checked in more, I have been on the FebRads board mostly. I have noticed I am more tired, I guess the chemo kicked cancer butt and mine along with it, and now I am doing rads and that takes energy too. In fact, one day I got up, got kid to school, had breakfast, and went back to bed for the rest of the day! Now I figured if I take a little nap when I get home from rads that will do it, I don't feel too bad for the rest of the day. Typically taking naps during the day has not been good for me, I wake up feeling groggy and awful. But this doesn't even have to be nap, can be just sort of a doze or restful period, even if I'm awake. Lay down on couch with TV on low, eyes closed, just listening to them carrying on about the stock market or some other disaster, positioned so if I open eyes I can see the pretty little pond across the parking lot. Bluedasher, I'll check into the March Rads to say hi! I am done with #17 / 33 so am getting there. I started middle of February so could actually migrate to the March group if I wanted to.",
      "MessageIndex": 805,
      "PostDate": "07/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 21, 2008 08:57PM unique wrote: Hi ~ A bit of detour here ~ got a fever and had to go get penicillin yesterday. And ~ have just been feeling soooooo down, sorry for myself. But the fever is better. Part of it is I feel SO STUPID the first couple days of each round. I lost my earplug for my phone, I lost my mail, I lost my glasses. I lost my Miralax. That latter doesn't matter too much, as I had BMs today, sorry to mention. Still kinda hard ones, but better than yesterdays. Tomorrow will prolly be diarrhea. And I am still a caregiver for my son and my cat. I want them to take care of me. It's not that I don't have others helping, they are helping a lot. It just doesn't seem like enough when I spend hours just looking for my water bottle, where did I put it?",
      "MessageIndex": 259,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 22, 2008 12:17AM unique wrote: Okay, here's our list again! Let me know who to add, I'm happy to add always. Also let me know what chemo. Thanks so much Lori, I was in so much despair yesterday over my brain, it felt like I am coming unglued. I got the mail out of the mailbox and then immediately couldn't find it. So unhappy. But I think it is a little better today!  You also have my undying awe about having to do chemo every other week. How ever do you hack it? How do you keep that smile?  October 08 Ladeez Last Week (Had chemo last week) Tue 10/14        Elizabeth    (TC) Tue 10/14        ilovemykids (TC) Thu 10/16        Annie (TC) This/Next Week Mon 10/20    Kathi (AC-T) Thu  10/23    Kimmysue (TCH?) Thu 10/23    lindbad2  Fri   10/24    Plakatakr Mon 10/27    Lisa 1964 (TCH) Mon 10/27    Bluedasher (TCH) Wed 10/30    MeMePat Wed 10/30    Lori (Bourscheid) Abraxane/Avastin",
      "MessageIndex": 268,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 22, 2008 10:45PM unique wrote: Hiya ~ Glad you are not having a lot of SEs! I was kinda bummed my SE's for Round 2 were TOTALLY DIFFERENT from Round 1. But they haven't been too bad overall. Is your name Kim, threegirlsmom?  Welcome KarenBarrow! This list has been just great for me - I am also on a Board for just my kind of chemo. It is a place to ask questions, get a bit of a hand holding, and a place to celebrate! Here's the list of gals who are doing it right now - let me know if anyone wants to be added! JUST HAD CHEMO Tue 10/14    Elizabeth    (TC) Tue 10/14    ilovemykids (TC) Thu 10/16    Annie (TC) Mon 10/20    Karenbarrows (AC) Tue  10/21    fivekids (AC) Wed 10/22    mother 78 (Herceptin/Taxol) GETTING CHEMO Thu  10/23    Kimmysue (TCH?) Thu  10/23    Kathi (AC-T) Thu 10/23    lindbad2  Fri   10/24    Plakatakr Mon 10/27    Lisa 1964 (TCH) Mon 10/27    Bluedasher (TCH) Thu 10/30    MeMePat Thu 10/30    Lori Bourscheid (Abraxane/Avastin) Thu 10/30    Peeps (TC)",
      "MessageIndex": 295,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 26, 2008 09:40PM unique wrote: Kathi ~ Don't lose heart about the A. It's a good chemo but the T&C are also very good. There's a little argument in the onco community about whether to do T&A&C or to do just the T&C. The MUGA is a heart scan, the Adriamycin can damage the heart, and if you failed it, look on the bright side and you will lose the 1% change of a heart problem. Guess you already have something there that worries them about the heart. So one less thing in my humble opinion. The Adriamycin has been successful for many years but the oncs are dying to find something with fewer possible heart effects down the road. They only give folks a certain dose they hope is safe. The Taxotere/Cytoxan combo is newer but there's a study that shows T&C is better than A&C, and a study just starting that pits T&A&C against T&C to see which does better. We won't know for at least 10 years, but some oncs are staying with the tried and true while others are jumping off to try the new thing. I got several second opinions so some oncs wanted to do T, A and C and others wanted to do just T & C. I decided to do just the T & C. We won't know for a number of years who is right, and which is better, but both are good. Is this more than you ever wanted to know?  There is a TC list on here if you are interested.",
      "MessageIndex": 721,
      "PostDate": "26/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 31, 2008 12:45AM unique wrote: Hey, when did you have a lung xray? I imagine it is nothing, because you're on chemo! Keep me posted, ok? What a roller coaster!!! Mricha, do try to take it easy, let them help you! I have an 11 y.o. so yes it is easier when they're older. You had a lot to say in a small space, you have been thru so much!!! Are you getting Aloxi and Decadron for nausea? This worked like a charm for me, needed no antinausea meds, but I was very energetic the first two days because of the Decadron. Maybe you need to bring down the dose a bit. Also I took Ativan for sleeping, this works well for me. I did the insomnia thing during menopause, I am not doing it again now for chemo!!!!! Elizabeth ~ Oncs differ on what your allowed to take during chemo, I was told on TC Tylenol is what they want me to take. This is good because Ibuprofen doesn't work for me. Tylenol doesn't have Ibuprofen. Aleve is prolly Naproxen Sodium, the 3rd pain killer. I think Vicodin is Tylenol and Codeine. I've taken that for short periods. My intense exhaustion is wearing off a little. Feeling a little better. It helps that I have NOTHING I have to do tomorrow. Well maybe write my Christmas and Hanukkah cards. Maybe they will turn into New Years Cards LOL.",
      "MessageIndex": 730,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 4, 2008 10:43PM unique wrote: jill ~ I think I will go get a flu shot as soon as I feel better from my #3rd Round, sometime late next week. Kristi ~ Welcome to our group! Do you have a port or are they using your veins? If veins make sure you stay warm, wear a sweater or something to chemo. Also make sure you take your Decadron if they give it. I keep forgetting to get a script and fill it ~ I have to do that tomorrow!!!!!!!!! Start taking it the day before. I bring my sister and a book ...",
      "MessageIndex": 457,
      "PostDate": "04/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 6, 2008 10:13PM unique wrote: Hi all ~ I got my #3 infusion today and it went like a charm. My WBCs are up, my RBCs a tad down but my onc is pleased just a little. No neuropathy or other problems. Joy, I had chemo brain really badly last week and it got me very upset but this week it has been fine. I misplaced important things and couldn't find nouns. The first made me very cranky, the latter I was able to joke about. I'd had a cold but it was better yesterday, mostly blowing, loose coughing up and draining. Today I barely noticed it at all. My son's cold has gotten worse though, tonight has a fever with 100. Not high for a kid but he will be off school tomorrow. I will have to take him to my Neulasta shot but maybe make him sit in the hall. The gal next to me in the chemo room is doing AC+T and I'll tell you, that Adriamycin is red!!! She had a tiny little aggressive tumor in her breast but a huge tumor in her lymph nodes. She found her breast cancer because she was having wierd brain problems, they thought she had a brain tumor, a lymphoma, anything but breast cancer. Once the operation was over, all her brain symptoms went away. Evidently poisons from the tumor. That is different and amazing. I guess we all have a different journey. The man next to me looked kind of dejected. I tried to talk to him but he was a one word dude. He was a lung cancer patient, had part of his lung removed and getting chemo for that. Fammy, Lori, and Cheryl also went today and I am wondering how you all are doing? I know it doesn't usually hit for a day or two, but I'm just pooped from spending half a day in a chair getting the drugs. Heh. ",
      "MessageIndex": 473,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 7, 2008 09:40PM unique wrote: Kathi ~ My hair came out evenly all over, so it is very fine and thin but something still there everywhere. Onc said it will all go, but no prickling or shedding yet, and here I am on Day 2 of Round 3. Fammy ~ Oh I'm so sorry you're having so much trouble! Changing to 3 weeks may help a lot. Don't blame yourself, I think all this has nothing to do with anything we can control. I do have a couple of things I want to ask though: are you getting Aloxi for nausea in your IV with infusion? Do you get Decadron to help with SEs? Do you have Ativan, Compazine, Zophran or Emend to help with the nausea? The Emend you take on Infusion Day and then for the next two days. It's expensive and not all insurance cover it (for shame!) but it's worth fighting for if you need it. Maybe like Kathi you need to just drop the Adriamycin and do just the TC part. But no, you should not suffer like this!!!!!!!! Lori ~ It went well but I am tired. I had a cold starting Sunday but it resolved in time for treatment, woo hoo! I have a sore joint on my left finger - huh what is that about? A little heartburn but can't complain. Expecting tomorrow to be the \"hit by a steamroller day.\" Bluedasher ~ I'm also slightly anemic so expecting more fatigue this round. Should we be eating red meat? Can we eat red meat? Hmmm. I did have some beef lentil soup for lunch, tres good! Peeps ~ a strange thing about my thin hair. I am getting used to it. It's been hot in eastern PA yesterday and today so have just taken off the hats and things and been going with the head the way it is. Doesn't look half bad actually. What did I look like before with all that thick hair? I forget. Bluedasher ~ your sig comes in a song, I guess you know that. I have a ring I got at the Christian bookstore (!!! I know) that says \"fear not\" which I associate with the song. Note to all - the song is a Jewish song that talks about life being like walking across a narrow bridge over a chasm, and the main thing is not to fear or look down, just keep having faith and going on. When I first got my diagnosis I was scared to death and pacing back and forth, could not sit still or sleep!!! So this ring is part of my getting my courage back. A friend sent me a note that says - I like this - \"courage is fear that has said its prayers.\" (She's a Stage 4 survivor of another kind of cancer.) Anybody heard from Elizabeth/ilovemykids? I think she's the only gal who hasn't reported in yet. I hope she is doing okay. ",
      "MessageIndex": 489,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 9, 2008 12:00PM unique wrote: Bluedasher ~ Loved your post about the song ~ it has so much meaning for me with my history of anxiety - anyway for the rest of you gals, don't feel left out, here's a nice rendition of the song on Youtube www.youtube.com/watch?v=2DdAfW... and the words here in english http://www.hebrewsongs.com/song-kolhaolamkulo.htm",
      "MessageIndex": 501,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 9, 2008 03:43PM unique wrote: Well, I feel okay on Tx.3 Day 4. Hollow headed, dry throat, tired, a bit of brain fog. But not bad overall. I tapered my Dex a bit more, I think that helped. Felt very achy yesterday and took 2 Tylenol, a half an Ativan, a Benadryl and took a book to the couch for the afternoon. Let my 10 y.o. walk a block to the Pizza Place and buy his own lunch. Slept on/off for hours. It was really kinda nice. After the Tylenol, no achiness, just sweated gallons!!! My son got me a towel and said Mom you're all wet, here, dry off! Drinking a lot, eating nice things like toast, popsicles, fragrant tea and coffee with creamer (no taco chips! no pepper!)",
      "MessageIndex": 503,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 9, 2008 10:38PM unique wrote: Here are the galz I have for this week. I hope you all do as well as I did, I had an exceptionally easy crash weekend, may #4 be this easy!!! Did I miss anybody? Mon  11/10    kristifromsandiego Tue   11/11    jill 323 (Taxol/Herceptin) Wed 11/12    mother 78/Lois, Mom of Lynn (Herceptin/Taxol, #4) Thu 11/13    Lori Bourscheid (Abraxane/Avastin-will  take a week     off to see how tx. is working!) Thu 11/13    Fammy5 (AC+T, #3 of 8, now going every 3 weeks) Thu   11/13    kathimdgd (TC#2) Fri     11/14    debk (AC/AvastinX4 every 2 wks +T/Avastinx12, every wk) ",
      "MessageIndex": 507,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 08:33PM unique wrote: Cheryl, my heart goes out to you. Have you talked to your onc about how worried you are? Maybe there are some additional meds s/he could give you to ease the SE's a bit. I know this is not at all the same, but I was so scared a couple years ago that I wouldn't be able to cope with my next life problem, and this is a big one, but I've coped all right. Well, I was completely panicked at first, but my GP gave me a couple tablets of Klonopin, and that REALLY helped me calm down. I also remember how scared I was going into surgery but my family and friends stayed with me and that helped too. Do you have people around you? I am rooting for you and that the Carboplatin will give you the kick you need to get that beast once and for all. What part of the ordeal last time was hardest? Was it nausea, or complications? Well anyway we are all rooting for you over here. I'll check in from time to time this evening and so feel free to talk as much as you need to.",
      "MessageIndex": 515,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 10, 2008 09:50PM unique wrote: Cheryl ~ how old are your girls? I remember having some really bad migraine/virus/vomiting things (actually periods worse than my SE's now) where my 8 year old would sit with me in the bathroom while I worshipped the porcelain and prayed for some relief. Now that my guy is 10 he can actually help me a little. When did you do this before? How long ago? Will you get some Emends and is it likely to help with nausea? What about dosage? Maybe you onc can lessen up on the dosage a tad and make it easier. I do know that folks are saying chemo in general has gotten easier over say the last 10 years. I do think you could use more help, is there any way to get some more help?",
      "MessageIndex": 519,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 11, 2008 04:10PM unique wrote: Still thinking about Cheryl over here. That girl touched me and I hope she is doing a whole lot better than she was worrying about.",
      "MessageIndex": 529,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 16, 2008 02:22PM unique wrote: Loved reading all your posts - I was not aware that OTC stuff was allowed for flexible spending accounts. It is not allowed in counting medical expenses for a small business deduction or for the 7.5% of your income so you can take money out of your IRA. Maybe a reason to get a FSA account, altho I'm not giving up my Blue Cross insurance for any reason!!! Anybody have unexplained bruising as a side effect from chemo? I'm looking at Taxotere and Cytoxan and don't see anything listed. My left finger joint keeps spraining itself (this is the second time and it has resolved in a day or two) and I have purple bruises on the inner right upper arm. It was sore Friday and yesterday, GP couldn't see anything, but today it feels better but is all yellow and purple blotches. I have no memory of hurting myself either in the finger or the armpit!!! So what is up with this??? Will call onc tomorrow about it, today is Sunday, I am nervous about it, that's all.",
      "MessageIndex": 570,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Nov 18, 2008 09:57PM unique wrote: P.S. And if they try \"Secure Horizons\" the name has me going off into gales of laughter - and they don't like it, they can't switch to a Medigap without the problem of \"pre-existing conditions\" for a period of 6 months or so. Cheryl, yes, you can laugh as much as you want. For a man 83 and a lady 78, the whole point is to pay for the pre-existing conditions. That's all you have at that age.",
      "MessageIndex": 597,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 2, 2008 08:50PM unique wrote: Hi gals ~ Welcome Mina and take care with hugs too - lurk as much as you like. I still have the Cold from the Black Lagoon, coughing, low grade fever, aches and pains, hips killing me, am on my 2nd antibiotic now. I think the Cipro is doing it, the chest feels stronger today. Oh, and my farts were the stinkiest, I had to leave the room and I was the only one in it!!! I was keeping the list of who was going for chemo, but I don't know when gals are going. My leg hairs are still going strong, why the heck is that? Those I really don't need. ",
      "MessageIndex": 644,
      "PostDate": "02/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Dec 15, 2008 10:50PM unique wrote: Hi everybody! The cold is a *little* bit better every day. If it doesn't improve A LOT I will go back and get another antibiotic or something. Still coughing some, but the congestion is much better. I am so sorry I dropped the list of when people are going - I didn't know when anyone was going anymore and I was so down and out. Let me know if you are coming up and I'll start it again. Fammy, good luck tomorrow.",
      "MessageIndex": 693,
      "PostDate": "15/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 16, 2009 02:33PM unique wrote: Hi, just poking head in here ~ I had my last chemo Nov. 26th, and am now heading for radiation. Got mapped last week and am waiting for my call back. Then will start. Hair started to grow, it is about 1 mm. long!!! Also was very grey so I dyed it, I use a medium auburn and what it did was color the grey on top orange!!! Ha ha ha!!! The sides stayed dark so I look very punk. I know the bright color will go in about a week so I should look more normal. I should take a picture of returning hair but am still a little bashful about YE OLDE BALDE LOOK.",
      "MessageIndex": 768,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Mar 12, 2009 08:46PM unique wrote: Hi Cheryl, I do think about you from time to time, wonder how you are doing! This list is kind of quiet at the moment, hey!",
      "MessageIndex": 812,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/721556",
      "Title": "Anyone starting chemo in October 08? SuzyWillKickThis unique"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 20, 2009 04:31PM unique wrote: Hi - I didn't start yet. I got mapped about a week ago, and they want me to come in to confirm the plan once it's complete. Then I start. So I don't know when. Binney, thanks so much for the info, it's a life saver!",
      "MessageIndex": 24,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/517650",
      "Title": "Key links to Lymphedema pages on bc.o site Melissa kira"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 3, 2008 09:47AM unique wrote: Hiyas ~ I didn't do reconstruction with my original unilateral mastectomy because I just couldn't face the 5-hour operation there. I've been happy/unhappy with the flatness on one side and may consider reconstruction later. But like you, I'm not ready! Right now I am looking for a pocket camisole to wear at night because wearing a bra under my PJs just isn't happening! Right now I just wear a T and am flat on one side but don't like that. I think if I had a pocket cami I might just put a bath puff in there. I haven't got a husband or boyfriend, just a 10 y.o. so how I look in an intimate situation is not coming up yet. I was thinking though of doing the henna tattoos on my scar area to dress it up!!! ",
      "MessageIndex": 21,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 13, 2009 09:52AM unique wrote: Hi gals - I've done surgery, chemo and now starting radiation. Lost 12 lymph nodes to surgery, so planning to see an LE PT.",
      "MessageIndex": 18,
      "PostDate": "13/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/517650",
      "Title": "Key links to Lymphedema pages on bc.o site Melissa kira"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Jan 19, 2009 10:23PM unique wrote: Hi Binney, I copied the local LE PTs from the LANA site. Just a question - the list for my state had a group of about 10 that had \"member\" next to their name. Then an alphabetical list that was much longer, some of them had LANA-PT next to their name. What would be the difference between the first and second groups? Second group had two in my area, first group didn't, closest was about an hour from me.",
      "MessageIndex": 20,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/517650",
      "Title": "Key links to Lymphedema pages on bc.o site Melissa kira"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 23, 2009 11:24PM unique wrote: Oooh such a quiet board. Anyway, I went in to see my LANA therapist today, Jane Roche, and she was EXCELLENT. She massaged an area about 3\" below my armpit that has a little bit of swelling, snapped some cording (this does not hurt), and gave me mucho exercises and told me to get a script from my rad onc for a pressure sleeve. I feel I am in good hands to prevent lymphedema.",
      "MessageIndex": 25,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/517650",
      "Title": "Key links to Lymphedema pages on bc.o site Melissa kira"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 3, 2008 10:23PM unique wrote: Wilsope ~ On my breast cancer email list, there was mention of a B-flat club. So there are some ladies running with it and getting some fun. I would have done a double mast but thought that would be WAY too much surgery at one time. For me. It would be!",
      "MessageIndex": 24,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Oct 3, 2008 09:47AM unique wrote: P.S. ~ I am looking for a pocket cami or solution that doesn't cost $40 each! ",
      "MessageIndex": 22,
      "PostDate": "03/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/706184",
      "Title": "Unhappy where I am, but too scared to do anything about it. samon OnEaglesWings"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "unique wrote: I suddenly had some major trouble with this. About 6 months after surgery, during radiation, I visited a PT to forestall lymphedema, and she snapped a couple of cords in my armpit. I'd had them but ignored them. Now almost 1-1/2 year later, I suddenly have a tight long cord going from my armpit to my wrist, and that puppy is SORE! After seeing surgeon and so far two more visits to PT, it is much better. She feels she doesn't want to snap it because it can cause trauma. Work on it awhile and see if it will snap in time. Anyone else get this? Just wanted to compare notes. No lymphedema problems, just this cord thing. Annie - L. Mast, Taxotere/Cytoxan x4, 33 Radiation Tx Dx 6/11/2008, ILC, 4cm, Stage IIB, Grade 2, 2/12 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/742087",
      "Title": "Axillary Web Syndrome unique kira"
    },
    {
      "AuthorID": "unique",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70331/profile",
      "Content": "Feb 27, 2009 09:26PM unique wrote: When I went my therapist measured my arm (both arms actually to compare), observed my range of motion, did some massage along my scar and under my arm where there is some puffiness I thought was just fat LOL. She snapped some cords also and showed me some exercises and how to massage that one area. I am going again on Monday so may get some more info instructions. This lady is LANA certified and she seemed very good. I don't remember anything about lotions/no lotions and was using lotions - doing the massage after anointing myself with the My Gals Cream in the evening. She also sent me to a place to get a compression sleeve as a prophylactic measure, I didn't do this yet as my son was sick all week and just getting to radiation was difficult.",
      "MessageIndex": 7,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/729784",
      "Title": "My 1st Visit to Lymphedema Specialist mom2two Shrek4"
    }
  ]
}