{
  "AuthorID": "Uturn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180532/profile",
  "Posts": [
    {
      "AuthorID": "Uturn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180532/profile",
      "Content": "Jun 8, 2013 07:56PM Uturn wrote: Well, it's invasive ductal carcinoma, aprox. 2cm in diameter, going back for more ultra sounds and mammograms, I'm in kaisers hands now, previous films were done by another hospital, and several typos in reading. Met my oncologist and surgeon. Decisions to be made are beyond my comprehension right now, how do you know weather to lumpectomy or masectomy??",
      "MessageIndex": 14,
      "PostDate": "08/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802793",
      "Title": "Biopsy kk12903 Uturn"
    },
    {
      "AuthorID": "Uturn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180532/profile",
      "Content": "Jun 3, 2013 02:32AM Uturn wrote: I had a core biopsy ultrasound guided two days ago and it was the most painful experience I can remember ever having. They injected maximum lidocaine, I have very dense breasts, and it seemed they had difficulty penetrating the lump, 9 or 10 attempts and four samples, more lidocaine after procedure, it bleed or drained for a day, now I am bruised, tender, and there is a larger hard tender lump opposite the entry and original lump site. I have dull aching pain toward arm pit. My first biopsy was not like this at all. Will call doc, first thing tomorrow.",
      "MessageIndex": 11,
      "PostDate": "03/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802793",
      "Title": "Biopsy kk12903 Uturn"
    },
    {
      "AuthorID": "Uturn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180532/profile",
      "Content": "Aug 28, 2013 06:05AM Uturn wrote: They found two more lumps in the left breast. Had a single mastectomy. And I'm ok with that. My ocotype was a 2. Taking tamoxifen. Greatful. No reconstruction for me. I hate hospitals,,,, but love my docs. They have been the greatest",
      "MessageIndex": 16,
      "PostDate": "28/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/802793",
      "Title": "Biopsy kk12903 Uturn"
    }
  ]
}