{
  "AuthorID": "Vadre",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
  "Posts": [
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 24, 2014 07:52AM Vadre wrote: Judy, You have landed in a good spot. I have learned so much and been held so close by this strong group of women that I don't know how I would get by without them. Â You are so right: this is a 'metastatic storm.' Â This is one safe place to be for cover and protection. I have come to think of it as a circle of sisters, holding hands and supporting each other. Welcome to the circle.Â  I was diagnosed three and a-half years ago. At the time I had two out of college (boys), one finishing college and one finishing high school (girls) and one in middle school (boy). Â Our plan has always been to be honest with them. As I learned from my wise Mom \"Never tell them anything that you will later have to tell them was a lie.\" Â At the time of my diagnosis I SO wanted this to not affect/change their lives. That just isn't possible. I have she'd many a tear because of this truth. I was afraid they would make decisions based on my diagnosis and come to regret them. Since then I have been in awe of their strength, their support and the loving choices they have made. My oldest daughter & I are in the midst of planning her wedding! My younger daughter has finished a couple of years of college and is taking a break to figure out what she wants to do. Both girls have decided that they need to be closer to me. They are both in the process of moving to Richmond (One hour, door-to-door) so that they can be closer to me and their little brother. It isn't the scene I would have imagined but it is so lovely to feel their love and support of me and each other. I guess I have learned to sit back (a little!) and let them figure things out. If you stay in this together wonderful things can happen, screw Stage IV! Â Didn't mean to go on so long! Sorry.Â  At any rate, I'm glad you have started treatment. I share your desire to be 'doing something!' Â It will continue to 'hit' you but you sound strong enough to hit back! Â Don't be afraid to ask for some medicine to help with the overwhelming feeling. Xanax is my pill of choice. Welcome to the circle. We are here for you and are thinking about you in these days as you get things sorted out. Peace, Virginia",
      "MessageIndex": 19,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821908",
      "Title": "New to stage IV...feels like I was hit with a one, two punch. Jaytee RonnieKay"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 29, 2014 09:58PM Vadre wrote: Judy, I hope your daughter is doing better. No need to feel defensive...my 22yo was home for three days last month for dental work! Â I, too, jump at the chance for a little mothering. I think my bed will always be open for a quick snuggle! We just hosted a Family Reunion at our home. Twenty-two people! Â Everyone pitched in and cooked and cleaned. Lots of laughter and games. I am exhausted but glowing. My family gives me strength. Â  I hope you are well as things begin to sink in and take hold. This is an amazing group. Always someone who has done that thing that you are questioning. Anyway, thinking of you.Â  Peace, Virginia",
      "MessageIndex": 25,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821908",
      "Title": "New to stage IV...feels like I was hit with a one, two punch. Jaytee RonnieKay"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 21, 2014 08:53AM Vadre wrote: Scuttlers, I don't think we've \"met\" yet in BCO, I look forward to when we do. My heart hurt so much for you as I read your post. Sometimes there is simply too much in life to cope with. It suddenly occurred to me that maybe it was time for you to take a page from your mother's play book. Be narcissistic for a change. Decide what you need to do for you! Â Taking care of your brother or supporting your Dad or Mom can be part of that narcissism if you want but YOU get to decide. How much energy do you have and where do you want to spend it. It's tough to remember that we're never going to change anyone else....we can only change how we are going to respond to them. You decide what you want to spend your time & energy on. Please remember, you need to be at the top of the list.Â  Sending positive, caring vibes your way.Â  Virginia",
      "MessageIndex": 33,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821138",
      "Title": "OT - dealing with family and cancer scuttlers justjudie"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Mar 4, 2014 02:29AM Vadre wrote: LizLemon, I grew up in a family that had been Military for five generations. It was a wonderful way to grow up. One thing that was true, and that I had to grow up to grow out of was the belief that there is a right and a wrong answer to each question. I have had the tendency to approach many life choices as if there are only two possibilities. I have come to understand that, between 'this answer' and 'that answer' there are almost always several more possibilities. You are definitely at a difficult crossroads in your life. The choice you describe is a shitty one! Â Between reaching for the goal/life you have worked for and dreamed of while ignoring your health and turning away from your work which has brought you a hard earned sense of security and pleasure in order to take care of yourself and possibly live longer and in a less stressful way. I hurt for you as you face the reality that your life-goal may not be particularly good for you now. Sometimes I hate this \"new normal\" about which we all speak.Â  I told the story about growing up with two answers to every questions because your description of your options sounds SO much like me. It's A) Do what I want, which is probably bad for me or B) do what is probably good for me but is certainly not what I want. Â So I ask, are there possibly some in-between choices? Is it possible to turn down this new job but not leave all together? Or possibly ask about taking on some of the new tasks which might bring some of the challenge you wanted without adding too much new stress. Â I'm sure there are many options. You must be very good at what you do or they wouldn't be interviewing you.Â  I know there is a \"get busy leaving or get busy dying\" way of thinking about a Stage IV diagnosis but I think there's a lot of living in between point A and point B. I hope this makes sense and helps just a bit. I also hope that you sleep easily tonight. Virginia",
      "MessageIndex": 10,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818665",
      "Title": "I had a dream that I was dying. LizLemon stagefree"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Mar 2, 2014 10:24PM Vadre wrote: LizLemon, Thank you for sharing your dream...maybe nightmare is a better word? I don't know for sure how you experienced it, but I imagine it would have been terrifying for me.Â  I haven't had dreams about dying that I remember. I have had a bunch of nightmares in which I know that I HAVE to do something important. Sometimes it's clear that the thing I have to do will \"save\" me or make things better. The bottom line is that in all of these dreams something stops me from doing what I need to do. Most recently I knew I had to run to get to somewhere/someone safe. I couldn't run. I just couldn't. My legs hurt and they felt so heavy. I just couldn't get them to work right. My family was all there trying to get me to move - telling me to run but my legs hurt too much. I couldn't move. When I woke up my legs were really aching. I took breakthrough pain meds and lay there quietly while they took hold.Â  As I retell this dream I guess it was about dying. My family pulling, encouraging me. I needed to get moving or keep moving and I just couldn't anymore. I was so afraid when I woke up. Knowing that the reality was that at some point I just wouldn't be able to do it any more. At the time I thought \"it\" was just some task. Maybe \"it\" was living. Maybe I was dreaming about the time when my body wouldn't be able to help me live anymore.Â  It's amazing that, even while we sleep, our minds are trying to work out and make sense of the craziness of MBC. I had not thought again about my dream. I have been thinking for a while now that I need to find a therapist or someone I can talk with to better cope with the stress and fear of living with and dying from MBC. I think my dream is reinforcing that need. If I'm trying to deal with all of this EVEN in my sleep, maybe I should give my psyche a break!Â  Thanks again for posting, LizLemon. You helped me figure something out. I hope this is helpful to you. I hope you have pain-free, sweet dreams tonight!",
      "MessageIndex": 1,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818665",
      "Title": "I had a dream that I was dying. LizLemon stagefree"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Feb 24, 2014 12:28AM Vadre wrote: Desi, Â I have just joined this chat room experience and I am so glad! Â I have been takin narcotic pain meds since my initial diagnosis. Bone mets are painful! Â I am taking an Aromatase Inhibitor which causes even more pain! Â My mets have been stable since day one. I know that docs need to be careful about \"users\" but I think someone who is Stage IV is a different thing! Â  I have had two Oncologists,and two GPs (I moved a year ago). Â They both have been very upfront that a patient with a metastatic BC is in a different category where pain medication is concerned. My Insurance case manager said the same thing recently. If the Insurance company agrees than you know it's true!! I think that pain and pain management are a part of our life from now on. I can't function if I am in pain or if I am tense about not having my pain meds. If my doctors were giving me difficulty about pain meds I think I would need to change docs. It is difficult enough not to feel \"weak\" for relying on pain meds without someone whose job is to promote your quality of life making you feel worse! Â I'm sorry to rant but I feel strongly about this!Â  You are the one who knows if you are in pain. Your doctor needs to be someone who trusts your judgement! Â Fear of pain and real pain can be mostly controlled. It should not control you! Peace, friends!",
      "MessageIndex": 11,
      "PostDate": "24/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/812520",
      "Title": "Pain with mets Hopefaith11 Rose07"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 13, 2014 09:07PM Vadre wrote: ðŸŽ‰ðŸŽˆGreat news! Â Worth tears & celebration. I think good news for one is good news for all. Seeing Hope answered is a terrific thing. Savor every minute ,",
      "MessageIndex": 24,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821031",
      "Title": "got some good news this evening chris1959 sandilee"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Aug 16, 2014 03:10AM Vadre wrote: Beautifully put, Diana50. I know that words like \"battle,\" and \"journey\" don't work for some. I hope I use the right lingo when I speak to each of you. I personally don't care for \"battle\" and \"war\" but I grew up in the military and those words just meant that my Dad was away for a long time and we were all scared and sad. I think it's all about your perspective. I, too, don't care what we call it. I just want it not to make my life difficult to live. As long as I am enjoying my family & friends and laughing every day AND the world is taking MBC seriously, well, then I'm OK. Just let me know what you are comfortable with when we speak and I'll do my best to be sensitive.Â  Pax, Virginia",
      "MessageIndex": 89,
      "PostDate": "16/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 8, 2014 10:45PM Vadre wrote: Thank you so much, DivineMrsM, As I said to Susan, my heart is lightened by the knowledge that some of my BCO sisters understand how painful this is. Sometimes I just need people that understand my situation listen to me so that they might, gently, say \"Hold on, is it possible that blah blah blah?\" Â I also need some strong people standing behind me. I know that I need to talk to her, whether or not she is really going to understand. I really, truly do not want to hurt her but every time she makes one of these comments I end up in knots for days! Â It just hurts me as a sister and leaves my hold on my energetic, positive outlook tentative at best. I also need to talk to her (I will actually probably write her a letter) because my DH, who usually leaves me to deal with my sister as I feel is best, is not going to be able to hold his tongue very long. Very basically he doesn't like to see me hurt, but more seriously in his mind is that he does not like me having to deal with unnecessary pain and craziness now. He really believes, as do I, that part of managing my cancer, is managing the negativity iin my life! Â He is close to stepping in as my protector here. I am not afraid to. Let him do that if needed but I would like to avoid things being said that can never be taken back! Â  Your observation about baiting me is very insightful. We are on a spur of the moment little trip with our DS and nephew. A few days in the sunshine on Kiawah Island in SC. When you said baiting a lightbulb suddenly went off in my head about how often these episodes happen when my DH & I are doing something special alone or with our children. Her relationships with her. Husband and kids aren't what I think she hoped for.Â  The thing that is saddest for me is that I so wish that I was able to support and be supported by my sister rather than feeling I need to protect myself from her. Thank you again for listening.Â  Virginia",
      "MessageIndex": 1063,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 9, 2014 08:39AM Vadre wrote: Wow! Â Once again my BCO Sisters leave me overwhelmed with support and caring...not to mention your stunning insight. While none of you have met me, let alone my baby sister, you have given a clear and accurate synopsis of her, our relationship and what I need to give myself permission to do lest our relationship do me more harm than good. You have given me several things to 'sleep on!' Â I have an almost completed letter on my computer that has been sitting there for a week. It is clearly time to dust it off, finish it up and put it in the mail! You all have given me some new insights to ponder and, maybe more importantly, you have helped me see that it is time for me to break this cycle! I need to reinforce the boundaries that are important to me. I need to begin being the capable, powerful and loving woman I am instead of the competitive, teenage big sister she wants to be in a relationship with. I need to start with the letter I've written and go from there. And I need to do the laundry! ðŸ˜‰ You are wonderful. One of my favorite movie lines of all time is from Shawshank Redemption: Â \"Get busy living or get busy dying.\" Â I had no idea, when I first heard this line, how significant it would be to me. It is also such a powerful thing to know that a group of women, who are faced with what we are faced with, always, always is striving to focus on the living part! You keep me focused more often than I can say.Â  Thank you",
      "MessageIndex": 1066,
      "PostDate": "09/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 11, 2014 02:14PM Vadre wrote: Dear friends & Sisters, Thank you for all of your support and concern. A special thanks to those of you who reflected back on your own sister relationships Â I it is so difficult to admit it yourself that the relationship you have with your sister isnt what you would hope for. It makes me very sad. As many of you have said, I can't expect to change her behavior I can only change how I react. I need to keep reminding myself of that. Especially because our interactions, of late, leave me so upset and agitated. It is too bad that our relationship is at this place, but I need to take care of myself. I work hard to have my life be as full of positive things as I can. It is time to stop the cycle. If she decides that she wants to make some changes as well that would be wonderful. All I can do is tale care of myself and no longer allow this to absorb so much time and energy.Â  Thanks again Ladies. I don't know what else to say.Â  Virginia",
      "MessageIndex": 1069,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 17, 2014 03:12PM Vadre wrote: Akevia, Â I understand that Terminal has the feeling of urgency, of death happening soon. In the conversations my Aunt was commenting on people had been talking to me about cure, about what great meds there were out there and that I shouldn't give up hope. I used the word advisedly in an effort to help them understand that there is no cure for Stage IV Metastatic Breast Cancer. Ie it's terminal. I know that is a tough word to use, believe me. I just needed them to understand! Akevia, are you Stage IV? Virginia",
      "MessageIndex": 944,
      "PostDate": "17/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 26, 2014 03:31AM Vadre wrote: Tilda, Â I felt as if I was reading my own words when I read your note! Â I think I have said exactly those things... maybe even here! Â I can't believe how insensitive people can be and how much it hurts sometimes! Â I'm SO glad you have a friend you can count on for those moments when you simply can't stand it anymore.Â  Romansma, I am at a loss for words when I think of your Mom's terrible remarks. How ANY mother could accuse you of not trying hard enough for your children is awful but for it to be your own mother is beyond understanding. I know that she is overwhelmed & hurting but that is inexcusable. I hope the miracle cure parade has gone for good and that your Mom can find someone to help her get her stuff together so that she can give you the love and support a girl wants from her mother! Â If you need someone to talk some sense to her I'm happy to take on the job - as would be many of your friends here! Â Anyone who has read your posts here knows that you are a strong woman who uses everything you have to live your life to the fullest with and for your kids! Â I hope that you can wrap your Mom's words up in a box and leave them far away from you. You deserve better.Â  Sweet, pain free dreams friends. You mean so much to me.Â  Virginia",
      "MessageIndex": 1000,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 14, 2014 01:59AM Vadre wrote: I have a wonderful Aunt. She would walk over hot coal so for me. She would willingly die early if it meant I could have longer. She is utterly amazing and I adore her. She can also be stunningly clueless. About a year after I was diagnosed we were together at a family gathering, I had to explain my diagnosis and prognosis @@to some family in person for the first time. Â A few days later she called to see how I was doing. Toward the end of our conversation she suggested that I not use the word \"terminal\" when I described my condition because \"it can be so alarming to some people and they assume it means that my death is immanent.\" Â  I was speechless. To this day I don't know what I wish I had said. I remember standing there with my mouth open, thinking \"That's the point, damnit! Â It is alarming and my death is certainly more immanent than it should be!!\" Â I just reminded myself that she adores me and is almost 80.Â  What might I have said to help her understand? Â ",
      "MessageIndex": 942,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 22, 2014 03:36AM Vadre wrote: Sorry I dropped out of site - house guests were keeping me busy & having fun. Even though I was enjoying myself I kept wondering what was up with my BCO \"friends.\" Â I do think of you that way because we have many things in common the most important of which is genuine care for other people! Kite, I am so sorry you are in the hospital! Â I think that the worst part of this disease is all the time we spend in agonizing waiting. The one thing that makes waiting even more awful is having to do it in the hospital! Â I am sending peaceful thoughts your way. I do hope that you are home soon! Â I'm glad you have computer access!! Thank you for reaching out to offer me support.Â  Grammy R - I think you're correct. I think fear of death, fear of even discussing death, is often behind the dumb things people say and do. I think that's why conversation on these feeds shuts down sometimes. Things just get \"too serious\" for some people. I stay positive and hopeful but I stay realistic & honest too! KUDRA, I wish there were words to say that might make some sense of your friends thoughtless, hurtful words. None of us chose this. None of us! Â Shame on anyone who says otherwise. You deserve a friend who listens without judgment to hear the strength and courage you have even when you are sharing fear or pain. I'm sorry you didn't get the support you deserve.Â  I'm sending wishes for peaceful sleep, SE-free days and friends who really listen to all of you. Peace, Virginia PS. Can't wait to look into all these new places! Pink Ribbon Inc, Breast Care Action & Pink Ribbon Blues....thanks for the tips.Â ",
      "MessageIndex": 982,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 15, 2014 10:55PM Vadre wrote: I never felt the LGFB sessions were for me. My impression was that they were designed to help people to deal with changes in their appearance while they were in treatment. Tips to help get you to the point when you were \"yourself\" again. Since these changes aren't temporary I never though they were addressed to me. I actually figured I would end up more marginalized and upset than anything! Snazzy, I'm so sorry that your step-mother doesn't get it! Seriously? Â Only YOU get to decide even to make those decisions and who you will honor by asking their participation. How people assume that that is a conversation you want to have at all, let alone casually and at their timing is beyond me! Â I'm sorry that someone who you should be able to count on was so far away. I'm having this fantasy picture in my mind of you looking at her and saying: \"What? Oh my, you're so old I was just assuming that you would go first. I was gonna offer to do your obituary for you. Since we're so close and all!\" Â Yes, I know, I am very passive aggressive and getting more so every day. ðŸ˜‰ These hurtful, thoughtless comments are hard enough to take from people I barely know, even if they are \"in the field\" and should know better. Â The ones that hurt so much, and mKe me so tired, are from friends or family who I have explained to, several times what Stage IV is. \"No, Aunt Whoever, this isn't like her. She had a lump, yes they had to do some chemo but all along they felt they had it all. Â Yes, I know it was serious and scary it's just not at all the same thing. Yes, it is breast cancer, not bone cancer. What I mean is that it is N E V E R Â going away.\" Â I so tired of being up against the pink ribbon belief that it's just a matter of fighting back. I've got a family reunion coming up. I adore my family. They mean so well and love me so much. I just wish that they would really listen, get past their fear - I'm afraid too and try to understand. It's not going away.Â ",
      "MessageIndex": 1018,
      "PostDate": "15/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 18, 2014 02:31AM Vadre wrote: Stella, Â I can hear how much these comments hurt and I wish I could knock some sense into some heads! Â People just blow my mind. Those comments are so inappropriate and hurtful, whether you are sick or not. I can't begin to understand why people think they have the right to ask things like that....maybe they are just dumb! Â Sometimes I wish I could think of something funny but sarcastic to say that would catch people off guard and, at the same time, tell them to mind their own damn business! Â Maybe try \"Yeah, after my mastectomy he's been nagging me about my weight. I talked to my doctor who put me on the Cancer Diet. Maybe you'd like to try it?!\" Â I am not a mean person and I don't like to offend people but come on. Â As grown ups we all just HAVE to pay more attention to the world around us and special attention to people's feelings there is just too much hurt in the world to make things worse with carelessness!! Take care, Virginia",
      "MessageIndex": 1028,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 8, 2014 06:21PM Vadre wrote: Susan, Thanks so much for the hugs. It makes me calmer to know that people \"get it.\" Â It helps just to know someone will leave a caring message.Â  The piece that I left out in my original post that makes this so much more complicated and painful is tha my sister (who is five years younger than I) has Stage IV too. She has mets to her bones and liver. With several large tumors in her liver. Â While we should be able to turn to each other for compassion and understanding it is as if we are in two different worlds. She has chosen alternative treatments for the most part and seems determined to have my situation be worse than hers and that I be reminded of that.Â  Of course there is a lifetime of sibling nonsense under all of this but knowing that doesn't help. While we have a large and loving extended family, both of our parents and our brother are gone. It's just us. She has mental health issues that should probably excuse all this. Â I know all these things in my head. My heart is another thing.Â  Thanks for caring and not telling me I'm being a Ninny.Â  Virginia",
      "MessageIndex": 1061,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Aug 14, 2014 05:18AM Vadre wrote: Tina and Brenda you are my heros! I wii stand in awe of your snappy comeback ability for years to come! Â  {{{hugs}}}",
      "MessageIndex": 1094,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Feb 14, 2014 10:47AM Vadre wrote: 51 After diagnosis review of previous MRI showed Mets at 48 My cancer is lobular, never formed a lump. My mother had BC twice, my sister was diagnosed with her 2nd BC 6 months after I was dx, Stage IV I have two daughters, 24&22. Older daughter has sought expert opinion. They have advised annual mammograms. She has discussed profrolactic mastectomies with her doctors and considers it a serious option once she has children. I NEVER missed a mammo. This just sucks. Dx 2/11/2011, ILC, 4cm, Stage IV, Grade 3, mets, ER+/PR+, HER2-Hormonal Therapy 10/18/2011 Arimidex",
      "MessageIndex": 985,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Mar 2, 2014 06:06PM Vadre wrote: this has been a wonderful thread to follow. I have been feeling the same depression this winter. Just no energy to do anything! Â Yes I have fatigue and pain but this desire to stay in bed feels like something else! Â I know myself well enough that I need to find a good therapist to talk to. We moved last year and I have yet to connect with anyone here. It is SO helpful to read the stories you all tell. We all talk about how good it feels to know we're not alone - that is so true. I really love some of the suggestions here. It helps to hear somebody else's ideas, I'm very tired of my own! Â My DH and I took a beautiful spring walk today. It was sunny and I was just wearing as weather. The birds were out, my dog was happy. Then I heard we hac more snow predicted for tomorrow, Â coming home and reading this has been a huge help.Â  I hope you all have sweet dreams tonight and find something tomorrow that makes you smile and feel glad that you had THIS day!",
      "MessageIndex": 24,
      "PostDate": "02/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818598",
      "Title": "Winter blues raro chris1959"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Feb 14, 2014 04:16AM Vadre wrote: I am new to this thread, to this whole web site, as of today. I've been stage I've for three years. I wasn't sure that I was going to be able to do this or whether I would find anyone here that I could relate to... Then I saw your post of your \"New Motto\" and I wanted to shout for joy, Â someone gets it! Â Someone gets me!",
      "MessageIndex": 173,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 20, 2014 01:16PM - edited Jun 20, 2014 01:18PM by Vadre Ebru, I'm a fairly new participant on these boards. In the past couple of weeks I've experienced my first deaths of BCO sisters. I found myself wondering if participating was good for me or not. It really surprised me how much it hurt to loose people I had never met. They weren't symbolic losses, I really felt pain and sadness. I struggled for a bit: do I keep checking in or signing off for good? Some days I find such strength and support here. Then I remembered what I have to remind myself over and over again: one day at a time! If it's too painful I can sign off and stay off for days or until tomorrow whatever works. Whatever works best today. Â  I'm with Surfdreams...you are a huge ray of sunshine for us. Just remember that you are our friend, sunshine or gloom! Â We are here for you. Peace, Virginia",
      "MessageIndex": 290,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 4, 2014 04:02AM Vadre wrote: Sinsin, Thanks so much for posting this! I read it a while ag and loved it but couldn't find it in order to quote it properly. You've saved me so much stress. Â Oh how I wish old age wasn't making me so forgetful and achy!!",
      "MessageIndex": 1057,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 4, 2014 08:46AM Vadre wrote: Musical Carolyn, What wonderful encouragement! Â I have been reading these messages of support posted for Stella and have been so glad that people have been saying the things I have been thinking. When you wrote about not being ashamed to take Narcotics in order to live the lives we should live...the days of brilliance, I felt like you were speaking just to me. I was diagnosed over three years ago. I managed the first several months without pain meds and then (in my words at the time) \"gave in\" and asked for an Rx. Since then I have increased dosages,till I'm at a place where I know I can make things better. Yet the whole time I've felt a little guilty for being so \"weak.\" Â For not being able to handle the pain on my own many people have tried to make me feel better but something about your choice of words really grabbed me. I love your line \"...make every single day one of brilliance.\" Â Even if that means taking some narcotics!! Thanks so much for having the words I needed to hear!! Virginia",
      "MessageIndex": 20,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
      "Title": "Pain pain pain stellaratovsky bhd1"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 22, 2014 09:40AM Vadre wrote: Thanks, GatorGal! Â I'm feeling pretty calm & confident right now Â I'm hoping that keeps up so I get a good nights sleep. Am I the only one who is nutty while waiting for results?? One minute I'm cool as a cucumber the next I'm jumping out of my skin! Â It makes me crazy, I don't know how my DH puts up with me! {{{hugs}}} Virginia",
      "MessageIndex": 32,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
      "Title": "Pain pain pain stellaratovsky bhd1"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 20, 2014 04:22AM Vadre wrote: Stella, I'm so glad that your results were good and your MO even better! Â I agree with you 100%! Â Having an MO that you trust is more valuable than I can count! Â I love my MO - when she tells me that things are good, I can breath.Â  Now it's my turn to wait. I had my scans this past week & see my MO on Tuesday. I had a little progression last quarter so these results are kinda big in my mind. After the last results we switched my from Generic back to name brand Arimidex. My MO thinks this might get things back under control. I really hope so 'cause (even though so many of you have been brave and done this already) I'm really afraid of the whole progress of switching AIs. The SE of Arimidex aren't great, pain especially BUT at least I'm used to dealing with them.Â  Not going to get myself worked up now. No point! Take care, everyone.Â  Virginia",
      "MessageIndex": 29,
      "PostDate": "20/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
      "Title": "Pain pain pain stellaratovsky bhd1"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 14, 2014 12:14PM Vadre wrote: SophieJean, I understand why it makes you laugh. Every time. If I didn't laugh about this stuff I would cry the day away! Â When we went to pick up my Arimidex for the first time after dx my husband and I prepared ourselves for how expensive it might be. We got to the check out & the Pharmacist said: \"That will be $13.78.\" Â My husband looked at me with a little twinkle and said: \"Wow! Â That's great. I would have paid as much as $15.99.\" Â The poor Pharmacist looked horrified at the thought that hubby might not have bought my life-saving drug for me. Remembering it makes me smile. Every time.Â ",
      "MessageIndex": 216,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 19, 2014 04:38PM Vadre wrote: yikes! Â I have to get caught up. You ladies are far ahead of my in funeral planning. When I have a big, special event coming up, my first worry is usually \"What will I wear.\" Â I guess I don't have to fret about that. Though it would be fun to watch a snooty sales ladies face when I told her I was looking for something to wear to a funeral....MY funeral! Â (Can you tell I have a problem with snooty people? Another thing I should work on!)",
      "MessageIndex": 226,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 8, 2014 06:57PM Vadre wrote: Stella, I am thinking of you, sending calm and peaceful energy your way. Awaiting those results is time that just drrrrraaaags, isn't it? Â It feels to me as if my anxiety multiplies with every moment. I don't know if you have considered a little support in alleviating that fear and anxiety? I began takin Xanax as needed shortly after my diagnosis. I take it PRN, not on a regular schedule. There are times when I start worrying or living in fear, as you put it, and it just spirals. I can't slow down my thoughts. The fear or anxiety just gets bigger and bigger. The Xanax helps me come back to center and be more peaceful. It also helps me sleep and we all know that getting good sleep is essential to living with a positive outlook. I hope the days go swiftly and that you get good results soon. Virginia",
      "MessageIndex": 24,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
      "Title": "Pain pain pain stellaratovsky bhd1"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 23, 2014 12:12PM Vadre wrote: Today was a very happy day for me!! I had an appointment with my MO to review the results of my quarterly scans... \"No new activity seen anywhere! There is even a 20% reduction in the size of the new area of activity found on the last set of scans!!\" My dear MO was all smiles as was my husband. You all know how I felt! So the switch back to the name-brand Arimidex seems to have done the trick for now. Thank you so much, sisters! I felt your support all day. It was so special to know that when I came home and posted this message you would celebrate with me!! {{{{hugs}}}} Virginia PS I apologize that this is going to be repeated on several feeds. You may end up reading it a couple of times...but it will still be good news. ðŸ˜ƒ",
      "MessageIndex": 34,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/822323",
      "Title": "Pain pain pain stellaratovsky bhd1"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 19, 2014 09:37PM Vadre wrote: I have been upset by responses to a post I made here a couple of days ago. I posted a sorry about having used the word \"terminal\" to describe my prognosis. I recounted that my Aunt called me later to suggest I not use that word as it could be upsetting to other people. I posted this on \"S**t people say\" because, at the time, it was difficult & upsetting for me to understand that making other people comfortable was my job in that situation. I thought that \"S**t people say\" might be a place where I would find understanding & recognition of my situation.Â  I understand that \"terminal\" is a hard word and that there are many words which leave room for hope and time and other positive things. Â I don't use the word very often, at the time I used it partially because of its seriousness but that isn't really important now.Â  The response to my post was to suggest other words I might have used. Words which were less stressful to other people. Words that members of our \"Stage IV Club\" have found helpful to describe our diagnosis. I didn't ask for help finding better words, I know there are better words. I certainly didn't hope to, in essence, be told that my Aunt was right, I could have used a better word.Â  When we express frustration about comments referring to \"being hit by a bus\" or \"at least you're loosing weight\" we aren't asking to be reminded that these people love us, that they don't mean to upset us, that they didn't really think about what they were saying, that they didn't really mean that. We are asking for understanding, support & fellowship.Â  I thought long and hard about not mentioning this. I really don't like to upset people or seem bitchy and self-centered. I don't want to make anyone feel uncomfortable but I actually considered not coming back to this feed because I felt so misunderstood. That seems particularly ironic, since the whole point of this particular conversation is to find understanding and support when people's responses to us and our cancer diagnosis leaves us feeling misunderstood and even dismissed.Â  I apologize if I'm being too sensitive. Especially if that means I upset one of you in the process! Â This has just been a particularly difficult theme in some of my family conversations. While wanting to remain positive and hopeful it is really important for me that people understand the reality of my diagnosis. Â It hurts to have my fears dismissed because \"they are doing such amazing things in cancer research.\" Â I need those who care about me to understand the whole picture. That is what led me to use the word terminal in the first place.Â ",
      "MessageIndex": 962,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 19, 2014 11:26PM Vadre wrote: Susan, Susan & Sheila, Thank you so much for your understanding & support. Sometimes I just want to know that there is someone out there who hears me! Â I so appreciate how \"real\" everyone here has been. Sometimes it feels like there isn't time for the social niceties - I just want to get to the things that are really frightening, maddening and wonderful! Susan, I really get what you mean about not wanting to accept, IN ANY WAY, that not being optimistic enough makes me accountable for the path that Cancer takes. That kind of talk really alarms me. I wish that I didn't have metastatic BC, but I have \"met\" some of the most amazing women in the world. That has been quite a gift.Â  Virginia",
      "MessageIndex": 966,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 20, 2014 06:32PM Vadre wrote: DivineMrsM & Diane, You are so lovely. Your apologies and kindness brought tears to my eyes. It is so good to be understood! Â Thank you. My Aunt is a wonderful woman who would do anything for me but sometimes she speaks without thinking or she doesn't think about the context or something. No matter how well intentioned or how much love is shared, thoughtless words still hurt. You all have done much to make me feel less alone.Â  What is most ironic is that I, too, am not particularly comfortable with the word terminal. It has come to indicate that the Undertaker is not far away. I'm nowhere near that! Â I like several of the suggestions that have been made. I like \"incurable\" because it probably will lead to further conversation.Â  I see my MO on Thursday. It appears that my three year run with Arimidex may be coming to an end. While I feel blessed to have stayed with my first AI this long, the thought of changing and all the unknown that brings is frightening. I want to stay in my happy, positive place. I'm glad I now have you all there to lean on! Â Peace!",
      "MessageIndex": 971,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 20, 2014 11:07PM Vadre wrote: I have a Handicap Â placard for those days when my joint pain and aches are just too much for me. I am always super aware of who is watching when I park. I'm embarrassed to admit that I actually exaggerate my limp sometimes just so people will believe I have \"earned\" the right to the spot.Â  We were taking a flight once and I had all of my meds in my carry-on. On the outgoing flight had been so much carry-on that I was separated from my stuff by rows & rows. The flight attendant suggested that I board with the \"special needs\" group in order to board early to assure I would have my luggage close. She was also sweet and put me in the row with extra leg room. There was a man standing in the First Class line who took offense at the fact that I was boarding before he was. He kept making \"under his breath\" comments about \"The 'sick' lady in line in front of me.\" Â He was being very rude and I was really uncomfortable and close to tears. It had been a wonderful but exhausting trip and I was a little upset about how much more difficult travel was for me now. Â The man made a comment to the attendant about the Airline needing a more strict set of guidelines so people didn't take advantage of special seating. Â My sweet husband finally couldn't take it any more. Â He turned to the man and said \"My wife, the mother of our 13 year old son, has terminal breast cancer. We don't know from day to day how good she will feel or, indeed, how long she will live. I think she would pass any test for Special Needs before you would pass any test for having Class at all let alone First Class.\" Â A small group of people standing around started to clap. I, of course, kissed him soundly! Â When it came time to board the plane my son stepped back and offered to let Mr Rude the chance to board first. The guy guy at least had the class to turn bright red and let Scott go first. It was all so embarrassing and upsetting. Everyone else made up for it though. People bought us a couple drinks and the Airline gave us a voucher for an upgrade on our next flight. The Flight Attendant winked when she gave it to us and said \"We didn't figure you wanted to sit there on this flight!\" Â If he hadn't spoken up I wouldn't have met all those nice people which made up for how horrid Mr Rude was.Â ",
      "MessageIndex": 1032,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 24, 2014 12:26AM Vadre wrote: Skylotus, I seem to be writing to you a lot today! Â I'm sorry that you had such a rude encounter with someone you thought was a friend. I had a very similar encounter a year or so after dx. A good friend of mine told me that she understood I had \"some stuff\" going on in my life but that she had stuff going on in hers too. If I really cared about our friendship I wouldn't let \"stuff\" get in the way of our spending time together etc. Â I tried to respond nicely but before it was all over she had de-friended me in every way possible. While I knew, in my head, that she was selfish and not worth the energy, it still really hurt. I was so sad for days. Even being as angry as I was didn't stop the sadness. I finally let myself be just plain sad. Took down some pictures. Cried for a couple of hours. I probably even ate a bunch of cake. It sure helped. I've come a long way since then and I try to focus on the friends that I can really count on and the activities that really help me enjoy life. But, to be honest, I can still be sad when I think of Leslie.Â  I like to think of this group as a circle of sisters, holding hands and supporting each other. I hope that helps, even though others can still hurt us.Â  Hugs, Virginia",
      "MessageIndex": 1043,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 30, 2014 06:06PM Vadre wrote: Skylotus, I'm glad we could help a bit. I hope that time & distance do give you some peace. This is a really good place to come for complete acceptance and understanding. I am so glad I stopped \"lurking\" and actually joined in the conversation , Â I don't know what I'd do without y'all! I had a Family Reunion this weekend and was overwhelmed with the love and caring my family showed me. They have worked hard in the three years since my diagnosis to learn the right things to say and how to best help me out. I have probable also learned that sometimes, when they don't use the exactly right words, I have to hear the love behind the words. So much of this is new to all of us. We have to let ourselves grow up together.Â  Having said that, I think I would go crazy if I had to make excuses for everybody, and be understanding and accepting etc etc all the time. It is so GOOD to be able to come here and have people \"Get It\". What a relief!! Hugs, Â VirginiaÂ ",
      "MessageIndex": 1045,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 8, 2014 03:32PM Vadre wrote: I don't know what to feel. I'm so angry and hurt and somehow, even though I know I am doing well this strikes fear in my heart.Â  My sister posted something about having said very special prayers today. I sent her a message and asked what the prayers were about, was everything ok. She responded \"Yes! Â I was thanking God for taking care of \"X\" issue and also that my sister is feeling strong even with sooooo much cancer!\" Â I appreciate prayers, though my sister and I have different theologies. Is it really necessary to point out to me how bad my cancer is? She does this regularly. Not \"praying that you will be well.\" Or \"praying that your cancer doesn't bother you or \" thankful that you are feeling well\" but thankful that I am doing well even though I have large amounts of this disease inside of me.Â  I am probably being petty and unthankful for her concern but really?!?! Â I've been thinking I feel every single lesion since I read her message! Why do people say such dumb things??",
      "MessageIndex": 1059,
      "PostDate": "08/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791428",
      "Title": "Lets do a Sh*t People say to Metastatic BC Patients Fitztwins ChicagoGirl"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 22, 2014 05:25PM Vadre wrote: AlyonA, Â I am so sorry that you lost your mother. Having lost mine, I know that it is a terrible, lonely feeling. I wish for you peace and rest. I hope that soon the memories of happy times will bring you comfort.Â ",
      "MessageIndex": 2419,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Aug 14, 2014 06:25PM - edited Aug 14, 2014 06:34PM by Vadre Naturelover, I don't mean to edit or correct you, but I have one observation to share relating to the story you shared about the woman at Church. You said that you didn't want her pity. Well, you see, I don't think you had her pity. In order to pity someone you have to care about what is going on in their life. Clearly this Churchlady doesn't have the ability to pity because she is so busy thinking of herself! \"I am so glad... I don't have... I had colon cancer...\" See, she didn't really need you there for that conversation! I pity her because she thinks about herself so much that she doesn't see how much good in people she is missing! All of that aside....she was an ass to say those things to you. I hope that you vented and stomped your feet until you were ready for some ice cream! PS. There is a thread that I really like. I think you might like it too! https://community.breastcancer.org/forum/8/topic/7... Lots of venting, no judging!",
      "MessageIndex": 86,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818107",
      "Title": "MBC is Not a \"Journey\" Bestbird cliff"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Feb 14, 2014 10:46AM Vadre wrote: 51 After diagnosis review of previous MRI showed Mets at 48 My cancer is lobular, never formed a lump. My mother had BC twice, my sister was diagnosed with her 2nd BC 6 months after I was dx, Stage IV I have two daughters, 24&22. Â Older daughter has sought expert opinion. They have advised annual mammograms. She has discussed profrolactic mastectomies with her doctors and considers it a serious option once she has children. I NEVER missed a mammo. This just sucks.Â ",
      "MessageIndex": 984,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 15, 2014 05:24PM Vadre wrote: About telling children about diagnoses... When I was two my little brother was born with a heart defect. The doctor's didn't expect him to live past infancy but my Mother who was an RN managed to help keep him alive until he was eight. As long,as I can remember I knew that my little brother was sick and that he would die from being sick one day. I understood, long before I really understood, that his illness was the reason for the many things in our family life that was different from my friends. When I was older and thinking about having kids of my own I asked my parents how they decided what to tell us and when. My parents said: \"We decided that we would never tell you anything that we would later would tell you was a lie. Â It was so important that you could always trust that we were telling you the truth.\" Â  This is the rule I have used in talking to my kids when I was diagnosed. My youngest was 12 yo at the time. It doesn't mean that I have to give him every detail, but I can't lie. I won't pretend things are fine if they aren't. I answer his questions honestly. He asked the very first day if I was going to die from this. I had promised him his whole life that I would never lie. I told him \"Yes, I will die from this. Â But my doctors think that won't be for a long time.\" Â As we have lived through these past several years, to include one brief period when my MO though I had serious mets to the brain and suddenly only had a year (which turned out not to be true.) I have never told him something that I later had to tell him was a lie. I think this has helped all five of my kids. They are afraid of what the cancer might do but they have never been afraid that they won't know what is happening.Â  I'm not telling anyone else what to do or what is best for your kids. I'm just sharing our experience. I appreciate how honest and open you all are. Going through this is hard, watching my children grow and knowing what I might miss is hell. Having y'all to share that with is such a help.",
      "MessageIndex": 170,
      "PostDate": "15/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 16, 2014 10:39AM Vadre wrote: I just want to say that I am honored to be part of such an amazing, strong group of women. As I read these posts I cry thinking of the fears we have and the reality we face. It also reminds me that strength like this is passed on. Our kids watch everything. They will learn what strength is through us. Â I really believe that I am passing that gift on to my kids. When they tap into that strength, one day, it will be something I helped teach them....something we all helped teach our own kids. Thanks for supporting me when it's not so easy.Â  Virginia",
      "MessageIndex": 175,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 20, 2014 05:32AM Vadre wrote: Star, I wish there was a guarantee, a new pill or a miracle I had to offer to help calm the fear for your children but we both know that there isn't such a thing yet. We know that it is sometimes impossible to watch our children without thinking about leaving them. Â All of us with MBC and children share the pain of bringing cancer intoÂ Â lives. Â They should be thinking about summer vacation, ice cream, boys/girls, fun.... Sometimes the wrongness of it all is overwhelming. Add to that pain and the anxiety of things constantly changing and it's almost completely overwhelming. When I am overwhelmed, like you sound right now, it is so easy to be consumed by the darkness. Just remember that you were right here, in this same overwhelmed place this time last year and yet this has been a wonderful year! Â I am not trying to be Pollyanna like so many who don't understand the meaning of \"Stage IV.\" Â I promise that I know the reality. I, too, am facing right now the fear of having to give up a tool from my bag of AI tricks. I'm not suggesting that you should pretend that everything is OK. Just remember that you faced this darkness before and found a little pill and the inner strength to give yourself a good year, a year where: \"I almost feel like things have kind of gotten back to normal.\" Â The little pill helped, I know. Having SE mostly under control helps too. But mostly I think it was your own determination to care for your children and give them a life not focused on the darkness of cancer that gave you that year. Yes, it is possible that the Scan will show new activity and you will have to give up your Femara. Â But don't forget that there are more tricks in the bag and, as your MO said, there are a couple of amazing treatments just on the horizon.Â  You asked for help, inspiration, experience. Well, there is lots of it here. Many women who, like you,Â  have faced a Prognosis that sucks, looked it in the face and still managed to watch a Tball game like it was all that mattered in the world. I can't say anything that changes our reality. Â I do think that there are some really exciting discoveries coming, but those may or may not help us with the next six months or a year. What will help is remembering that you found the strength, deep down in a place you didn't know existed, to make this last year a happy one. I believe that you can find that strength again.Â  I have become hooked on the show \"Game of Thrones.\" Â I'm not one of those crazy fans who dresses up and pretends I live in the Seven Kingdoms or anything, but I really like it. I know it seems ridiculous to answer your sadness, pain and fear with a quote from a TV show, but we get our inspiration where we can. There is a line that comes up from time to time that sometimes helps me get out of bed or just sit and watch TV with my teenage son. It's not a false promise or a magic pill but it helps me sometimes and I hope it helps you now.Â  \"Today is not the day that I die.\" We can't live our lives years or weeks at a time. Just one day at a time. You have done it before and I think you can do it again. You knew you needed some support and you found it. You are a strong, loving mother. You are \"almost\" in the same spot you were last summer. Â You made that be a good year and, one day at a time, you can again. I've gone on and on. I will be thinking of you and sending loving strength your way as you wait, yet again, for more news. Just remember how strong your love is and that \"Today is not the day\" Virginia",
      "MessageIndex": 184,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 30, 2014 11:40AM Vadre wrote: Kjones, we'll be thinking of you as you get ready for the MRI. \"Nothing\" is relative for us! Â I have found that being stingy with pain meds while on a long car ride doesn't help at all (unless you're driving!). Go easy on yourself! Â Then soak up all the calm & blessings the ocean has to offer! Â The heat from the sun, the sound of the surf, the smell of sun screen, salt air & sweaty kids!! Â Such a healing place, the beach! Â I hope being with your family is a good thing! Let us know how the MRI goes. Virginia",
      "MessageIndex": 196,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 23, 2014 05:53PM Vadre wrote: PP & WW, Letting our kids take off for camp was always difficult for me. I think I cried from missing them more than the other way round. My youngest ds (16 now) never wanted to go. He agreed to go one year, had a blast, didn't want to go again. I think letters are the answer. I wouldn't encourage phone calls...hearing a voice, particularly a crying one, just makes it too difficult. Cheerful letters from home help so much. My daughter has been a Camp Counselor for 5+ years. She always said that the cheerful letters which said \"I can't wait to see you and hear all the fun things you are doing & learning!\" were perfect.Â  We have five kids, ranging from 27-16. Since my dx I have found, over & over, that they need a kind of permission to live their lives and have fun even in the midst of Stage IV. One way to give them permission is to model that behavior yourselves. Mention in a letter that you took the chance of an empty nest to go see a movie that they wouldn't have liked or something. Â Or maybe even help them be glad they are away by telling them how much Dad misses them doing their chores! As hard as it is to believe, you will make it through these weeks. Having them home, scratched, sunburned and bug-bitten will come faster than you know!! Giving you a squeeze of support! Virginia",
      "MessageIndex": 193,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 4, 2014 02:47PM Vadre wrote: Kjones, I just wanted to check in and see how the MRI went. Â I'm always so anxious around my regular test times! Â I hope it went well for you and that, as you hoped, it was all \"nothing!\" Hope you're having a Happy ðŸ‡ºðŸ‡¸4th complete with ðŸ’¥fireworksâ—ï¸ Virginia",
      "MessageIndex": 200,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jul 11, 2014 04:54PM Vadre wrote: Susan, I'm so sorry about your eye procedure! Â I know exactly what you mean about things affecting our health and mood. Sometimes I feel like my mood can be so fragile. I have monthly Zometta infusions. They aren't that terrible, I end up feeling like I've got the flu for a couple of days. By I always end up Â feeling \"down.\" Â It took me a while to realize that sitting in a room full do people who have no reason to be there except cancer messes with my mind! Â So, yeah, \"no down side\" is a relative thing! Left foot, I'm so sorry for all the tests. Like Susan and I were just saying, some things make it hard to just live! Going in for test after test each with a different prep is exhausting! To have little ones seeking attention at the same time must almost be too much. But the faces in that picture are not overwhelmed! Â Those are faces that are well cared for and loved. They look strong and happy. I know the guilt of adding something to their lives that you don't want them to experience, but the real job of a parent is to teach them love and confidence even in the face of the most difficult things. It looks to me like you & your kids are well on the way! How I wish there wasn't a \"list\" of things we can use to keep living our lives well. Every time one of us faces a change, that list hangs over our heads. Scratching something off the list can bring darkness for days. I so look forward to a time when they have a real handle on cancer and there are so many GOOD options that the list never crosses our mind again!, Virginia",
      "MessageIndex": 218,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 20, 2014 11:21AM Vadre wrote: Some where in this tongue in cheek conversation about planning our own funeral I actually started thinking about mine. I don't want to miss it! Â How strange is that? All of my favorite people will be there, having a blast and telling great stories. Why would I want to miss that?? Â It might be just too confusing to attend my own funeral, plus people have the right to gather to mourn without me? Â What about a big Farewell Party. To say goodbye to everyone. Quiet personal moments in the midst of confusion. This is beginning to apPeal to me",
      "MessageIndex": 231,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 21, 2014 08:49PM Vadre wrote: thanks, Pajim. Â I'll look back and see if I find the conversation. Ever since it came into my head I've been pondering. I agree, I think there is great merit.Â  Hope everyone is having a beautiful, SE-free day!",
      "MessageIndex": 239,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 20, 2014 04:27PM Vadre wrote: I'm glad I had the words this time, Kelly. It will be your turn to be strong for me one day. That's how it seems to work here! Virginia",
      "MessageIndex": 188,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Jun 20, 2014 11:00PM Vadre wrote: Starbright, Â My words did come straight from my heart. I guess it's easier to see things clearly and understand the truth when we're helping someone else. I wrote those words for you but I knew exactly what to say because I have been right where you are and those are the words I have come to understand I need to hear myself sometimes But like I said, it's easier to express them to you when trying to help you! So when I show up here one day looking for support, you'll know what to say. Sisters, in a big circle, holding each other up.Â  Virginia",
      "MessageIndex": 190,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819925",
      "Title": "Mothers with school aged children Kjones13 Kjones13"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "Mar 3, 2014 10:16PM Vadre wrote:  MrsM, Funny thing is my DH left Ohio in 1971 to go to UVA and never looked back! Â You might not guess it by this winter, but he couldn't stand the Ohio winters! Â We've been in the greater Washington, DC. area for 25+ years and retired to Williamsburg about two years ago. We were building our retirement dream home when I was diagnoses. We are so in love with this area. Such beauty and so many wonderful, historic, natural, fun things to do. Cancer has slowed our life down, but we are still loving being retired here. If you come back this summer it would be wonderful to meet! Finding this site has given me such perspective. I have been measuring my coping, progress, depression etc all against the general BC community. Not a fair comparison. Being able to know that others feel and think the way I do and are still living their lives is a tremendous help. What a blessing.Â  The \"saying\" that keeps coming into my head this winter as the cold grey weather has added to my depression to leave me feeling immobile is from my father. Dad died shortly after I graduated from College. When I was younger and was feeling overwhelmed by something my DDdy would look at me with his wonderful blue/grey eyes and tell me \"Everything is going to be OK.\" Â I always understood that he meant this in a long-term, big picture way, but somehow it gave me comfort today.Â  We've got snow & ice again today, but yesterday promises me that Spring is on it's way! Sweet dreams, Virginia",
      "MessageIndex": 26,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/818598",
      "Title": "Winter blues raro chris1959"
    },
    {
      "AuthorID": "Vadre",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/135811/profile",
      "Content": "May 21, 2014 05:25AM Vadre wrote: Tasha, I've always been curious about the places people choose to be buried or scattered. Do you mind sharing why Thorpe Cloud? I think I'd like to be scattered on the James River behind our home because this is where I have been the happiest in my entire life. It is the place that my husband and I chose as \"ours.\" Virginia",
      "MessageIndex": 236,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/810314",
      "Title": "Gallows/Black Humor Nel surfdreams"
    }
  ]
}