{
  "AuthorID": "ValL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
  "Posts": [
    {
      "AuthorID": "ValL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
      "Content": "Feb 5, 2013 04:18PM ValL wrote: Wonderful news!!!!!!!!!!!!!",
      "MessageIndex": 6,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799957",
      "Title": "Worried Marly04 ValL"
    },
    {
      "AuthorID": "ValL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
      "Content": "Jan 22, 2013 04:01PM ValL wrote: Wonderful news!  Let us know your results in 6 months!  Hugs to you!",
      "MessageIndex": 8,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799218",
      "Title": "Results are in - BENIGN! rhodeeho brittany12"
    },
    {
      "AuthorID": "ValL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
      "Content": "Feb 5, 2013 12:06PM ValL wrote: Good Afternoon vee2009, I am so happy that a breast specialist has set up a biopsy for you, but the bs that the famous line \"breast cancer doesn't hurt\" is overly used.  Keep pushing for answers, as that is what I have learnt from this forum also I have not been diagnosed as of yet.  Mine started with shooting pains of the left breast in December 2012 as I was laying on my left side.  Then it continued throughout the day.  I was sent for an ultrasound, and the radiologist said it is just cysts, nothing to worry about, I'm too young to get bc and \"breast cancer isn't painful\".  For two months I have had shooting pain in and around my left breast, up to the collar bone, my left arm pit is swollen , my left breast doesn't sway as it use too, like thickening has occured, my nipple doesn't look right, swollen, which constantly throbs.  I was scheduled for an MRI last week, just waiting on the results to come in.  Though I saw my regular doctor today, because last night I discovered a lump in my left nipple.  The exact same spot that the pain is, like a kidney bean shape.  My doctor thinks it's a blocked milk duct.  Not really concerned, as he is waiting for the MRI results too. I will push for a biopsy no matter what the out come.  I agree with you so much.  Something isn't right....push until you find the answers. Good luck vee2009, and keep us posted.  Hugs. Val ",
      "MessageIndex": 2,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799999",
      "Title": "Right Breast Lump...very worried! vee2009 ValL"
    },
    {
      "AuthorID": "ValL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
      "Content": "Apr 18, 2016 05:22PM ValL wrote: Thanks Simms8212 for the insight. I have been scheduled for an MRI and hopefully this will conclude of what has been going on.",
      "MessageIndex": 2,
      "PostDate": "18/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843470",
      "Title": "Nipple Lump....Painful and Growing ValL ValL"
    },
    {
      "AuthorID": "ValL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167764/profile",
      "Content": "ValL wrote: Hello Everyone. I was wondering if this is all in my head, as the nurses, doctors and technicians lead me to believe. Around December I started noticing that when I laid down on my left side, my left nipple was achy. It felt like I had pinched it or slept on it during the night. I started being aware of how I laid when I went to bed, and how often the achiness was there. It eventually became more painful, that you ladies describe and \"thank you\" as I couldn't pin point the word...a bee sting. Only in my nipple area. This became every day all day symptom. I discovered in March 2016 a lump underneath the nipple area, so I went and saw my nurse. She felt it and said there was something there, and we were not fooling around with it. (When you push on it, I feel it is like a thousand bees stinging, and I feel sick to my stomach). Even my Medical doctor agreed, as three years ago I had two cysts at 2 and 4 o'clock which went away, but in the same breast. So last Friday, I was sent to get a Mammogram done along with an ultrasound. I have implants, (8 yrs ago) so the mamo took longer, and the lady was amazing with me. The ultrasound technician was soooo ignorant that she said is it just pain or a lump?, as I don't feel anything! If it's just pain, an ultrasound won't do anything. As I laid there I must have shown her six times where the lump was, and each time she pressed down on my nipple with the transducer the bee stings got worse. I was there for almost an hour, and after she was finished, she told me to clean up and she will be right back. 20 minutes later she tells me that the radiologist read the report and said the mamo came back clear and the ultrasound picked up a very small black spot, but too small to do anything about. Come back in 6mths. I just looked at her and said and the lump and my pain is from what? SHE SAYS I DON\"T KNOW. and that was that. My jaw dropped. So I emailed my nurse and told her what exactly was done and said. I said I wanted an MRI, as the lump has gotten bigger and HARDER then last Friday. I don't want to miss anything. My nurse says yes I'm looking in for other imaging options and consult. She will see me NEXT Friday. I ask her today, did you book an MRI for me (I am in the Canadian military, so the wait for these tests are only weeks to get in) no she has not, as she is \"working what the best options are\" AND the results do not explain the pain you are having. I am wondering about consulting back to Plastic Surgery. Ladies what do I do? I read from your discussions that is possible that tumors can \"hide\". Am I right pushing for an MRI? I can't stand the pain. Even now typing this, it is brutal \"lightening bolts, bee stings\" etc. I have noticed a small change of my nipple, and the hardness of this lump is not like it was a month ago. Is it possible to have this lump in my milk duct? and why wouldn't the testing I had revile a lump? I'm so desperate for answers. My plastic surgeon has nothing to do with this. My implants are in back of my chest muscle. I have to tell you what the ultrasound tech said.....when she first went over my nipple with the transducer she said that the plugs of my implants were by my nipple. WHAT? I just had my breast checked out two years ago by my plastic surgeon and we discussed if movement can happen. No he said. That's why it was important within the first couple of weeks of my surgery in 2008, if I wanted more saline in my implants to do it then, as the scar tissue will form and it would be tricky to get to them. The plug is under my breast. What is with medical staff? Any ideas, suggestions or avenues would be much appreciated. Hugs ValL Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/843470",
      "Title": "Nipple Lump....Painful and Growing ValL ValL"
    }
  ]
}