{
  "AuthorID": "var126",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127261/profile",
  "Posts": [
    {
      "AuthorID": "var126",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127261/profile",
      "Content": "Jul 1, 2011 12:59PM var126 wrote: All:  I am enjoying getting to know you through your posts and sorry for all the anxiety/awfulROs/long drives/lack of empathy we are all experiencing.  I am kind of down today because I was supposed to leave for a Greek islands cruise today and instead drove to the medical center for #7/25 (and pink already, uh-oh).  It could be worse, but I'd like to be heading to the airport instead!   Do any of you have good waiting room reading to suggest?  I am so tired of blaring TVs! Janet",
      "MessageIndex": 84,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "var126",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127261/profile",
      "Content": "Jul 17, 2011 11:06AM var126 wrote: 15 of 25. yay!  Liking the Jean's Cream and Miaderm - one in my purse, one by the bed.  Also the Barely There bras working great - thanks to whomever recommended them! 10 to go, but also ugly heat wave coming, oh please don't let me blister in 100 degree heat!",
      "MessageIndex": 243,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "var126",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127261/profile",
      "Content": "Jul 3, 2011 12:36PM var126 wrote: I have marker, stickers, tattoos -- I look like an edgy 5th grade art project.  And they still can't get me situated to their satisfaction. They fiddle and fiddle and make me get up and get in the mold again and move my arms until they are out of the mold and that makes my arms fall asleep.  What is with that?  I have found with breath hold, that if I am in the mold I have no problem hitting my mark, but if not, then I am always just under.  The one tech who had no problem with situating me in the mold went to the beach for two weeks -- the trials of summertime rads!",
      "MessageIndex": 109,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "var126",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127261/profile",
      "Content": "Jun 17, 2011 07:11PM - edited Jul 1, 2011 01:02PM by var126 Hi Emily and everyone: I had my prep session last week and start treatment on June 23rd using the breath hold technique.  Five weeks -- last treatment is Aug. 10.  I am a little worried about hitting my mark when treatments start in earnest, but glad that my heart will be less of a target.  Treatment at Geisinger in cental PA. I should be on the road at this time of the year and finding it hard to accept being leashed to the radiation department, but I know it's all helping me, so I will go in there and hold my breath and get through the next 5 weeks.  This is my first post, but this website has been a remarkable website since early April when I was diagnosed. Thanks to you all who post their experiences!",
      "MessageIndex": 172,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769611",
      "Title": "JUNE 2011 RADS bluewillowskys duckyb1"
    }
  ]
}