{
  "AuthorID": "vee2009",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169554/profile",
  "Posts": [
    {
      "AuthorID": "vee2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169554/profile",
      "Content": "vee2009 wrote: Hi. I found a lump in my right breast last April (2012) went to PCM and she sent for mammogram and ultrasound. Both were negative. So she sent me to breast clinic. Doctor told me that it was just breast tissue. Well, the last 3 months the lump has become very painful. My breast is also very painful...shooting pains, tenderness, and some swelling up near collar bone down to breast. Underarm also sore. The pains are almost constant now. Went back to doctor whom decided to send me back for mammogram and ultrasound. Mammo neg. Radiologist said I needed a biopsy ultrasound guided. BIRADS 4. Well, went in for biopsy and this radiologist tells me he doesn't see what the other radiologist saw...which was a mass. and that I needed to go to the breast clinic. Okay, breast speciaist said he feels that I need to have a biopsy done cause he can feel the lump and it feels rather large and I'm having pain. Also, because I had a BIRADS 4 on ultrasound. I am now worried cause I have so much pain and some swelling and a tingling sensation in this breast. It just doesn't feel right and I feel something is wrong! The breast surgeon told me not to worry cause breast cancer doesn't hurt. Wrong answer I have read people have had pain and had breast cancer. Just wondering did anyone else have any of these symptoms with pain that were diagnosed with breast cancer??? Thank You!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/799999",
      "Title": "Right Breast Lump...very worried! vee2009 ValL"
    },
    {
      "AuthorID": "vee2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169554/profile",
      "Content": "vee2009 wrote: Hello everyone! I have not been on here for sometime now. Well, in the last few months I have developed 2 new indentations on the side of my left breast. One is closer to my under arm and looks as if it's getting deeper. I also have swelling in the left arm pit. My left breast also has swelling and I have swelling from the top of the breast that goes all the way to my clavicle. I have this constant aching pain in my arm pit daily. It's really starting to bother me. I had a mammogram 2 weeks ago that showed nothing. Just states that my breast are extremely dense which lowers the sensitivity of the mammo. I had an area of concern which they did ultrasound but stated that they did not see anything in the area. I have a appt today with my breast surgeon and I'm wondering if I should ask for a breast MRI? My mother feels that I should. I just feel like something isn't right. I don't think I should have all this swelling going on and constant aching pain. Please give me your thoughts. I feel as if my mammo are never going to show anything since my breast are dense. If something is hiding in my breast they are not going to see it. I just need to know the reason for the symptoms I am having. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/844534",
      "Title": "Breast Indentations/Swelling vee2009 LRGO2016"
    },
    {
      "AuthorID": "vee2009",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/169554/profile",
      "Content": "vee2009 wrote: Hi everyone! this is my second post...I'm new here... I had an excisional biopsy on Tuesday of this week. Well, on Monday the day before the biopsy I noticed swelling on the top my breast going up towards the collar bone. I went and saw my surgeon whom ordered a stat ultrasound. Well, the ultrasond didn't show any skin thickening or fluid so they are not sure why I'm having the swelling. Well, during the ultrasound the tech and doctor noticed another area and they then asked if this was the area that was going to be biopsed and said no it's another area. The doctor then asked if I had a history of breast cancer...I replied no, the room was very quiet and they kept looking at the screen. The doctor then said okay let me send this report to your surgeon now. The report stated a lesion at the left upper outer breast. My biopsy was for the 3'o clock location. Two weeks prior the ultrasound stated the 2' o clock location. I have 3 diffent ultrasounds with all three different locations. I mentioned this to the surgeon the morning of surgery and he said that they are all talking about the same location...???? I'm not so sure. He said we were doing the area that is causing me pain and it's very tender. So, that's what we did...no results yet. My question is....if cancer is present at one of these locations is the one biopsy at the 3'o clock location going to pick it up??? He sent the tissue to the pathalogist. I dont want to miss anything...meaning being missed diagnosed due to the 3 different locations. Any information would be greatly appreciated. Thanks!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/800477",
      "Title": "Excisional Biopsy Completed On Tuesday....waiting vee2009 farmerlucy"
    }
  ]
}