{
  "AuthorID": "vegas",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
  "Posts": [
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Dec 24, 2009 04:16AM vegas wrote: Dear mystle2care, I am so sorry you are having such anxiety, especially at such a young age. It's hard to say \"don't worry\" when you have this hanging over your head. If it's any comfort at all, as my breast surgeon said to me when I was waiting - no matter what the outcome, once you get the results all that will have changed is your level of knowledge about what is going on in your body. In the meantime, just try to remember to breathe. The waiting and wondering sucks big time and the emotional roller coaster can be almost as stressful as an actual diagnosis itself. As far as genetic testing, no matter what the results of your biopsy, with such a strong family history and a previous diagnosis of thyroid cancer, I would STRONGLY encourage you to set up a meeting with a Certified Genetic Counselor. They specialize in genetic mutations and, based on your family history, can advise you on whether genetic testing is applicable. There is also a wonderful resource for those familial mutations called FORCE and their web site is www.facingourrisk.org. If you post on the forum there, you can get a recommendation for a certified genetic counselor in your area. You can also connect with literally thousands of women (and men) who have been dealing with genetic cancers for generations. It really helps to know you are not alone and to have others to lean on that totally \"get\" where you are coming from. When do you get the results of your tests? If it has been more than a couple of days, I would be on the phone with my docs HOUNDING them to get me the results rather than spend the long holiday weekend in uncertainty. It really doesn't take more than a couple of days in most cases. In the meantime, we will all be sending you lots of hugs and hopes that your pathology is truly benign and please keep us posted. XOXOXO",
      "MessageIndex": 3,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/745785",
      "Title": "Not Diagnosed but History of Family Breast Cancer mystyle2care ElaineD"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Sep 3, 2009 09:53PM - edited Sep 3, 2009 09:55PM by vegas Dear Silverlady, I had invasive ductal carcinoma two and a half years ago and made the decision to have a bilateral mastectomy. Like Lee (and it sounds like you are kind of on the same page), I didn't want to even have to think about dealing with BC again if I could help it. I had also talked with a number of women who had had lumpectomies or unilateral mastectomies, and more than half told me that later they wished they had just done a bilateral and been done with all the worry. But that's an entirely personal decision, and we all have to decide for ourselves how we want to deal with it. Either way, THERE IS NO WRONG ANSWER! As LisaMG pointed out (Hey Lisa! I miss you sweetie!!) triple negative cancers tend to be more aggressive. Having a bilateral is a very proactive approach to further spread and prevention - it is not \"radical\" at all. I did choose to have immediate reconstruction with a direct to implant procedure so that I only had to do one surgery and not have to deal with expansion and exchanges. I don't even think of it as an amputation, because it wasn't. Instead it is more like taking out the bad stuffing and replacing it with new non cancerous stuffing. I went from a flat A- to a nice perky full B/small C. And as an FYI, I never had any real pain at all from the surgery. It was more like being extremely uncomfortable for a week afterwards. But even whether to have recon is another personal choice based on you and your lifestyle. Again, there are no wrong answers, just what YOU are comfortable with. After my surgery I did chemo since I had lymph node involvement, and now I have been on Femara for a little over two years. Femara is for post menopausal women - pre menopausal women still do take Tamoxifen. Whatever you decide to do, my dear, it is always wise to get at least a second opinion and interview two sets of surgeons. You want to go with a surgical team that listens to YOU and your lifestyle. Also I would ask for patient referrals and actually talk to them about their surgeries and recoveries with those doctors. Having confidence in your surgical team is huge and can make all the difference in the world. In the meantime, we are here to support you no matter what you decide and in any way we can. Having cancer sucks. Having women who understand what you are going through and \"getting\" what you are feeling, is priceless.",
      "MessageIndex": 10,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739799",
      "Title": "Just diagnosed silverlady LISAMG"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Sep 3, 2009 10:22PM vegas wrote: Lisa, you will never be \"just a previvor!!\"  :)  You are a true WEALTH of information, not to mention a lot of fun too and just a really cool person. Isn't it time you took a trip out here to Vegas???? How's the family?",
      "MessageIndex": 12,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/739799",
      "Title": "Just diagnosed silverlady LISAMG"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jun 8, 2009 02:22PM vegas wrote: Anxious Mama, I was diagnosed November 5, 2006 and had my surgery Dec 11, 2006. It is very normal for the process to take between 4 to six weeks. dlb823 is right, it took years for this tumor to grow large enough to be detected so try to take a deep breath and realize that these weeks can be used for gathering information about various types of procedures. Then you when get the results of your tests back you will be equipped to make a decision about treatment options. If you have a genetic mutation you may decide to opt for a bilateral mastectomy. If you don't have a genetic mutation you may decide to do a lumpectomy or a unilateral mastectomy  (though bilateral is still an option which I personally chose). The waiting does SUCK, however!!! Everything seems to take forever. You live, breathe and eat cancer until your mind and emotions have a chance to adjust to and absorb all the new information being thrown at you. It really does get a bit better once you have a plan in place, but it takes some research and time to get there. You will experience an emotional roller coaster, so be gentle with yourself and know that ALL your feelings during this traumatic period are normal and valid. One of the benefits of these forums is that the women here \"get\" it when your friends and family may not. They just want to know that you are going to be all right - they feel helpless and you feel like you have to be \"strong\" for them. Here you do not have to be strong for anyone - lean on us and let us help you through this!",
      "MessageIndex": 12,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735449",
      "Title": "How long between diagnosis and surgery or treatment? Anxiousmama katiec"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Apr 20, 2009 07:45PM vegas wrote: How did Hannah's appointment go? I think this post has touched us all, and we all want to help in any way we can. I have made Hannah's web site a favorite and will be checking it daily along with sending her prayers and happy thoughts to get through the days. Laughter is still the best medicine.",
      "MessageIndex": 140,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 18, 2009 02:01PM vegas wrote: Dani, I don't know where you are in your process, but I couldn't help seeing your latest post where your PS is doing the entire surgery!!! Sorry, but that just does not sound right to me. You want an experienced breast surgeon (not just a general surgeon) to remove the breast tissue and then an experienced PS to do your reconstruction. And it is best if they normally work together as a team to get the best cosmetic results afterwards. The PS can only work with what the breast surgeon leaves. But since the whole idea is to be cancer free, you need a great breast surgeon first and foremost! Also there actually is a surgery that does NOT use expanders. It is called the one step alloderm and is relatively new (five years old) so a lot of surgeons don't do it yet. (They usually do what they have been taught in school and won't recommend a procedure they are not comfortable performing.) Basically they take alloderm and stitch it to the pectoral muscle so that it creates a pocket for the implant immediately and eliminates the need for expanders and the exchange surgery. I went to sleep a small A- and woke up a full B/small C. I had nipple sparing on the side that did not have cancer and it is so good, my oncologist did not even realize I had had a mastectomy on that side! The really good plastic surgeons have such a good eye, they can get you to the size you want to be without doing fills. If you don't actually have cancer yet and have a few weeks to research, you might want to look into this procedure. There are several really great doctors scattered around the country that are doing it now. Feel free to send me an email at diann at greatlasvegashomes dot com if you want more info.",
      "MessageIndex": 94,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 10, 2009 03:21PM vegas wrote: Just wanted to let you gals know that are going through surgery, the fear of the unknown was far worse for me than the actual event itself. I had a bilateral mastectomy a bit over two years ago - one step alloderm with implants and no expanders. Went to sleep a small A- and woke up a large B/small C. At least I got some cleavage out of the whole thing! Besides having two kids, I had never had surgery and of course every imaginable worst case scenario plays through your mind 100 times a day. So I was pleasantly surprised by how relatively \"easy\" the actual surgery and recovery was. I can't say I had any pain, it was more just extremely uncomfortable for the first week and then progressively got better. The only painful part was getting the shots for the sentinel node biopsy - make sure they give you something besides a local!! Those babies burn like fire from the dye they put in. The drains sucked - that was the worst part of the after surgery experience and it did hurt when they were pulled, but that is so quick it's not that bad. I was in the hospital for less than 24 hours and couldn't wait to get out. What surprised me was how weak I felt. You will be walking like a granny for a week or so afterwards. And you will need naps. (I grew quite fond of the naps and was sorry to have to give them up.) And you will feel like you have a couple of aliens strapped to your chest for the first month or two. At first you are totally numb like you have ragdoll boobs. I was afraid I would get too close to an open flame and do a Mrs. Doubtfire. There are also some weird sensations like swallowing a cold drink and feeling it go all the way down your throat and into your stomach. But all this goes away with time and some sensation returns though you will most likely not ever have true feeling there. The good news is that makes nipple recon and areole tattoos a breeze later. Something that is important to remember - it takes a good six months for the swelling to subside and for your new foobs to settle into their final form. So don't be upset if they are a bit misshapen, bruised or different sizes or heights even. You will be amazed at the difference that first six months can make, and even up to a year you will notice more subtle changes. Mine looked great in clothes from the get go but it wasn't until about six months that I felt they looked good nekked too. Just to make friends with your new foobs, you might try giving them names. Because of my Vegas connection I named mine \"The Rack Pack\" collectively and Dino and Frank individually. :)",
      "MessageIndex": 42,
      "PostDate": "10/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/726408",
      "Title": "February Surgery jillisucat 2new1s"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Mar 2, 2009 10:35PM vegas wrote:",
      "MessageIndex": 25,
      "PostDate": "02/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Mar 1, 2009 01:46PM vegas wrote: Karen, please, please consider your options wisely. You only get one chance to prevent recurrence and metasticis. Your tumor is quite large and your HER2+ status makes it likely that it is of a more aggressive type. And it is also hormone positive. This means that literally the food it eats is the estrogen and progesterine your body is producing. The Tamoxifen is meant to strip your body of these hormones so that the cancer cells have nothing left to eat and starve to death. Believe me, I went into chemo kicking and screaming all the way. But in the end if it means a year or so of inconvenience but a long life, it is all worth it. There are never any guarantees, but I would have been really angry with myself if I hadn't done what I could early on and something came back.",
      "MessageIndex": 14,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729926",
      "Title": "Anyone declining further treatment after bilateral? karen_3 Jamie6"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Feb 10, 2009 01:20PM vegas wrote: Absolutely you belong here! Please let us know what you are feeling or ask as many questions as you like. If you have had a BC diagnosis many of us have already walked that path and we are more than happy to help you along!!!",
      "MessageIndex": 3,
      "PostDate": "10/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728826",
      "Title": "someone to talk 2 feelingbad jancie"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Dec 29, 2009 09:08AM - edited Dec 29, 2009 09:12AM by vegas Chantel, what a WONDERFUL daughter you are and your mom should be so proud of you! And you have every right to be on this site. It is for ANYONE who is battling breast cancer for themselves or for loved ones. To begin with, there is a TON of information to assimilate in a short time and both you and your mom will be on emotional overload as well. My first piece of advice is to BREATHE and not rush right into surgery. That tumor has probably been there for five or six years (depending on what type it is), and it will probably not hurt at all to do research for a number of weeks while you consider all the surgical options and try to formulate a complete treatment plan which may (or may not) include chemo and/or radiation.  The first thing you need to know is what are the characteristics of your mom's tumor. Did they do a biopsy? If so, you absolutely want to get a copy of the pathology report. In fact, from now forward you want to request a copy of every single test as it is done so that if something is lost or needs to be transferred quickly to another doctor, you will have that information readily available. If she has not had the biopsy done yet, that would be the next step so the doctors have an idea what they are dealing with before they go into surgery. In the pathology report you will find a description of the size and location of the tumor as well as what kind of tumor markers it has. You will need to know if the tumor is hormone positive - is it Estrogen and/or Progesterine positive or not, and if it expresses something called HER2Neu (again is it positive or negative). There will probably also be a grade of tumor showing how much the breast cells have mutated from normal cells. Based on the type of tumor and how aggressive it might be and its location, then your mom can make a decision on whether to have a lumpectomy or a mastectomy. (If there is a significant family history of breast or ovarian cancer, she may also want to consider genetic counseling to determine if she has a gene mutation that she may have passed to her children. That may also determine whether she elects to get a lumpectomy or a mastectomy based on her probability of getting another breast cancer.) With a lumpectomy, the tumor and the breast tissue around it are removed to get clear margins free of any cancer cells. It is a great option for women whose cancer is smaller and non aggressive and do not have a high probability of recurrence. Almost all woman will need radiation after a lumpectomy to make sure all the cells have been removed or killed. With a mastectomy all the breast tissue is removed and your mom can elect to do reconstruction at the same time (or not). The breast is NOT \"cut off!\" The tissue inside the skin is removed and can be replaced with either tissue used from another part of your mom's body or by implants. (You would be amazed at the beautiful breasts created after a mastectomy now that can be nicer than nature's own!) There are a number of surgery options using either tissue or implants if your mom decides to go with a mastectomy, and you can research those once she has made that decision. The size and location of the tumor and whether or not it has spread to the lymph nodes will determine whether your mom will need chemo, no matter which type of surgery, lumpectomy or mastectomy, is performed. There is also a test called the Oncotype DX that you should ask about which can help determine how beneficial chemo will be for your mom's particular tumor. (Sometimes, depending on the size or location of the tumor, the oncologist may want to give chemo prior to doing surgery.) Hope this gives you a bit of an overview of breast cancer. There is a whole lot more to it, but until we know what your mom's pathology is based on the biopsy, it is hard to give suggestions on what her next steps might be. Once you get that information, those of us that have been there already will be more than happy to help in any way possible. Tell your mom her BC sisters are all sending her hugs and she is not alone! The first couple of weeks are the scariest time when you are trying to process too much information and waiting and WAITING for answers. Once you formulate a plan of action and know what you are up against, it is a bit easier emotionally to handle it all. Bless you all and keep coming back with any and all questions, my dear!",
      "MessageIndex": 2,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745961",
      "Title": "My Mother was diagnosed Today. Chantel_Alyssa sheila888"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 17, 2009 11:56PM vegas wrote: Hi MovinOn, So sorry you are having to face all this at such a young age. I was 53 when I got my own diagnosis and it just knocks you out. Then you have to make so many decisions so quickly. Your brain is on information overload and you are riding an emotional roller coaster. As I was doing my own research two years ago I talked to as many women as possible who had been there before. Some had lumpectomies and others had unilaterals or bilaterals. Of about a dozen who had unilaterals, all but one said they wished they had done both at the time of the original surgery and several had gone back and had the other side done later. Most of those who had lumpectomies said they would opt for a lumpectomy again, though a couple were actually considering going back for mastectomies based on genetics. But overall it seemed like either a lumpectomy or a bilateral. Those who had chosen unilaterals did not seem to be nearly as happy with their choice. I can highly recommend Kathy Steligo's Breast Reconstruction Guide Book. It details all the recon options and the pros and cons of each type of surgery. Personally I decided to go for a bilateral, though I chose the one step alloderm with implants over a DIEP. I was afraid of the extra incision site and wanted to get in and out and on the road to recovery as soon as possible.  But this is such an individual decision and you really need to explore all your options and figure out what will make YOU the happiest.",
      "MessageIndex": 11,
      "PostDate": "17/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727489",
      "Title": "Lumpectomy, Mastectomy or Bi-Lateral Mastectomy movinOn movinOn"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Aug 9, 2007 08:54AM vegas wrote:",
      "MessageIndex": 255,
      "PostDate": "09/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/615874",
      "Title": "February Chemo Cruisers Heading to Rads ErinsGram wildabouthorses"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Aug 9, 2007 09:59PM vegas wrote:",
      "MessageIndex": 260,
      "PostDate": "09/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/615874",
      "Title": "February Chemo Cruisers Heading to Rads ErinsGram wildabouthorses"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Aug 8, 2007 02:09PM vegas wrote:",
      "MessageIndex": 247,
      "PostDate": "08/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/615874",
      "Title": "February Chemo Cruisers Heading to Rads ErinsGram wildabouthorses"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Mar 3, 2009 01:50AM vegas wrote: Linda, just in case you do check the boards again before your appointment it would help if you researched just a bit on your surgery options so you know what questions you want to ask. If you are even thinking about mastectomy, there is a wonderful book, Kathy Steligo's The Breast Reconstruction Guidebook which lists the types of reconstruction you can have done, with some of the pros and cons of each type. Also keep in mind that if you decide to do a mastectomy, you may have the option of traveling outside the state to go to surgeons that specialize in the type of procedure you want (after you decide what that is, of course!) Just remember, you WILL have lots of questions and for many of them there are no \"right\" answers, only the one that suits YOUR lifestyle and emotional makeup the best. You can ask one question and get ten different answers to it just on a single thread here on the forums! But after you do a bit of research, something will start feeling right to you and then you will know you have found YOUR answer.",
      "MessageIndex": 11,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729961",
      "Title": "Just found out, please help me LRM216 gmw"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Dec 29, 2009 09:11AM vegas wrote: Wanted to add that AnnNYC makes a GREAT point! It is so helpful to have along another set of eyes and ears to ask questions and note the answers that the doctors give you. Often you are so petrified the information goes in one ear and out the other. I highly recommend writing down as many questions as you can think of before each appointment so that you don't forget or get sidetracked once you get in with the doctor. And then write down the answers to so you can refer to it later.",
      "MessageIndex": 4,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/745961",
      "Title": "My Mother was diagnosed Today. Chantel_Alyssa sheila888"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Aug 11, 2007 07:43PM vegas wrote: Karen, we are SO dependent on the information we are given to make our decisions. It sucks that often we do NOT get what we need to make the right choice. And of course with cancer, we are in a panic on top of all that and just want to get the cancer out as fast as possible. You did the best you could at the time with what you had, which is all any of us can. And with two small kids on your own too! Wow, you are certainly one brave strong woman.",
      "MessageIndex": 262,
      "PostDate": "11/08/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/615874",
      "Title": "February Chemo Cruisers Heading to Rads ErinsGram wildabouthorses"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Mar 1, 2009 04:27PM vegas wrote: Linda, sorry you had to join the club that no one wants to be a member of! The first couple of months are by far the hardest, trying to figure out what your best treatment options are, who your surgeons should be, etc. But remember that in all likelihood this cancer has been there for quite a number of years. Not that you should wait six months, but you can take a few weeks to sort out your alternatives! Of course the first thing that hits you is all those dreadful words: cancer, chemo, mastectomy, lumpectomy, radiation. Emotionally it takes a while for it all to sink in. Your imagination is your worst enemy right now. I can honestly say that each step was not nearly as bad as I feared it would be. Not that I want to go through it again, but at least it was not as horrific as I thought - the treatments are \"do-able.\" The other part that is so hard is really not knowing what to do. This is a whole new world with a whole new jargon. You need to get online and get a good overall picture of the \"pieces\" of breast cancer treatment. Once you understand your treatment plan you will feel a lot better. Do NOT bother reading the \"statistics.\" That will only scare you. And statistics are just that - they do not represent you at all. And most of them are at least five to ten years out of date as they gather new data on different kinds of breast cancer and the efficiency of the latest treatments. I was diagnosed on November 5th and had surgery December 11th in 2006. In the meantime I had met with three oncologists before I found one I actually liked and trusted. I also researched my surgery options. You can do either a lumpectomy (if you choose this route you will have to find out if chemo and/or radiation is also appropritate) or you can go with a mastectomy. With a mastectomy, if your lump is small enough you may not need to have either chemo or rads depending on the aggressiveness of the tumor. A lot of your treatment will depend on whether the cancer has spread to your nodes or not. And no one knows until they do the surgery. Very small cancers can spread and very large ones may not have spread at all. Again, you are individual, and your treatment needs to be handcrafted to fit your individual diagnosis. And remember, YOU have options! You can do your research and make your doctors explore options with you. It certainly never hurts to get more than one opinion, no matter how wonderful your doctors seem. In particular, surgeons rarely ever mention surgical options for procedures they do not perform, and if you bring them up they will say the procedure is not a good one if they don't do it. Above all, know that you are not alone. Many of us have fought the battle before you with the support of those that have gone before us. We are here to help you through. You will be amazed at the \"kindness of strangers\" who will rally around someone they have never met before, but who will understand you so much better than your beloved family. I found that I could say what was in my heart to my BC sisters and get the responses I needed so desperately during those dark hours. Your family and friends, no matter how loving, really only want to hear that you will be well. They don't really \"get\" what you are going through unless they have already been down the path themselves. So take a deep breath, ask for anti depression meds if you need them (many of us have never touched anti depressants before BC) and know that there truly is a light to the end of the tunnel!  ",
      "MessageIndex": 7,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729961",
      "Title": "Just found out, please help me LRM216 gmw"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Feb 24, 2009 11:23PM vegas wrote: De-ported, just a little chemo humor no one but us can really understand! :)  And just for fun, here is the t shirt I had made up for myself after my bilateral with immediate recon: ",
      "MessageIndex": 21,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729576",
      "Title": "Port Removal sunshine787990 liz19"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 19, 2009 08:12AM vegas wrote: Movingon, depression is VERY common after a BC diagnosis. Please mention this to your doctors - they have stuff to give you. I did not and later I wished I had. For a solid three months after my diagnosis I felt totally disassociated from my life, my family and my friends. It was like I was playing at being myself and nothing brought any joy at all. I had actually gotten to the point where I didn't think I would ever be \"me\" again and then one day, boom, just like that, I was back. I have no idea why. But in the meantime I suffered quite a bit and truly wish I had not been so \"macho\" and asked for help. There are no prizes for suffering in silence!!! On the issue of reconstruction, if any of you gals are considering implants, you do not necessarily have to do multiple surgeries and have expanders. There is a newer form of implant surgery called the one step with alloderm. Originally they used expanders because the pec muscle is not large enough to place the implant under and they need to stretch it out. (Your skin is too thin to handle the implant.) They place the expander and at regular intervals they fill it will saline through a port in your breast until you get to the size you want. Then they do a second surgery to replace the expander with a permanent implant and remove the ports. With the one step alloderm they take sheets of alloderm (which has been used in burn patients more than 30 years) and literally stitch it to the pec muscle to make a larger pocket for the implant to fit underneath immediately. No fills and no second surgery to switch out the expander for a permanent implant. I went to sleep a small A- and woke up a full B/small C. (Might as well get a little cleavage out of this, right?!!) The most important thing about recon, no matter what type you decide on, is to do your research and pick the kind that suits YOU personally, no matter what type your local doctors try to push on you. Most often they will only recommend what they are proficient in, rather than the kind that might work better for you. After you have decided what YOU want, then find the surgeons that specialize in that particular type of surgery to get the best cosmetic results. (You want to find a breast surgeon and plastic surgeon that work together regularly and you don't want anyone using you as a guinea pig while they try something new out for the first time!) I ended up flying to New York from Vegas because at that time hardly anyone did the surgery. I went to the surgical team that invented the procedure and could not have been happier. Fortunately now more doctors are doing this surgery on a regular basis and usually you can find someone reputable fairly close by. Anyway, my point is, figure out what YOU want, not what the docs want, and then find surgeons that specialize in that type of surgery. YOU are the one that will be living with your choices for the rest of your life.",
      "MessageIndex": 19,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727489",
      "Title": "Lumpectomy, Mastectomy or Bi-Lateral Mastectomy movinOn movinOn"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Apr 13, 2009 12:29PM vegas wrote: Alison, I am SO sorry you had to join our little club that no one wants to be a member of. But there are many long time survivors here and you will get lots of support while you are going through the journey. It is VERY scary after you first get diagnosed and you live, breathe and eat cancer. As Lexislove said, you WILL get your life back. There are just a few bumps on the way to manuever. I would highly recommend you go to: www.facingourrisk.org. It is an amazing resource, especially if it turns out you have one of the BRCA genes. There are many young women there that have been where you are and will be delighted to help you. Also, you may want to rethink doing the lumpectomy in favor of mastectomy, especially since you will have to do chemo anyway. Radiation can really do a number on your skin, and if it turns out you do have to have a mastectomy later, you will be very limited as to what type of reconstruction options you have. I chose to do a bilateral because I did not ever want to think of having BC again and because I did not want to have to do radiation in addition to chemo.  While it is nothing to take lightly, the recon results of a good PS are as good as an augmentation these days, so don't be afraid to explore that choice. And that suggestion is just something to think about, my dear. Don't let anyone rush you into anything. You have a few weeks to do your research and make an intelligent decision about what YOU want to do. I know there are lots of facts and figures being thrown at you. Make the doctors sit down and take the time to explain it all so that YOU understand it. Get the opinions of other women that have been through it before. And then decide what feels right to you. There actually are options for treatment. We are not \"one size fits all\" so don't let your docs treat you that way.",
      "MessageIndex": 7,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732355",
      "Title": "just diagnosed at the age of 33 aaronali12 nandy1975"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 10, 2009 05:14PM vegas wrote: Run, don't walk, to another surgeon! What a bunch of ....... You absolutely should quit smoking (I know, easier said than done) at least a couple of weeks before surgery as that does help you heal much better. And if you have any kind of a smokers cough, well, you really don't want to be coughing after a mastectomy. Are you planning on having reconstruction? If so, it is best to find a surgical team that works together that specializes in the kind of reconstruction YOU want to have. Surgeons generally only recommend what THEY feel comfortable doing and may not give you all your options. And the plastic surgeon can only reconstruct with what the breast surgeon leaves, that's why it's best to find your team and make sure they are all on board with where you want to end up. That will give you the best cosmetic outcome, though of course the primary goal is to remove the cancer!",
      "MessageIndex": 8,
      "PostDate": "10/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/727106",
      "Title": "Smoking and no masectomy? Deb-from-Ohio anianiau"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Feb 24, 2009 09:54AM vegas wrote: I could not wait to be de-ported! I was pestering my onc about it two treatments before my last infusion, though she said she normally likes to leave them in a year. I had a reverse superstition that if I left it in, it would come back! I had mine out two weeks after that last treatment. It's just an outpatient surgery and I was dancing through the doors when it was done.",
      "MessageIndex": 13,
      "PostDate": "24/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729576",
      "Title": "Port Removal sunshine787990 liz19"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Feb 4, 2009 04:04PM vegas wrote: That is a ridiculous answer on the part of the surgeon! At that point I would have asked to see his documentation certifying that he is really \"the best.\" You need to feel confident that your surgical team and the type of surgery you choose is the best for YOU!  Most doctors will only reccommend what THEY feel most comfortable with, not necessarily what will work best for you and your lifestyle.  Anyway, maybe this link will help you:  http://www.breastrecon.com It is an online guide to some of the surgical options available to you and even recommends doctors in local areas that specialize in those options. You first need to decide what kind (if any) breast reconstruction you want and then go out and find the doctors that are renowned for doing that kind of surgery. There are two basic types of recon - using your own tissue or implants. From what I understand the most progressive and best types for using your own tissue are DIEP or GAP. There are two types of implant surgeries, one using expanders with fills and then an exchange surgery to place the permanent implants, and the latest called the one step which puts the permanent implant in right away with no expanders. You need to know the pros and cons of all these types of recons before making your decision. Once you decide which surgery YOU want, then find the best doctors who specialize in that type of surgery to get the best results. I traveled across country to use my doctors, though I know that is not an option for all. I personally chose the one step with implants and it was absolutely the best option for me, but right now this is all about you. There is no \"right\" choice, just the one that seems best to you with the time you have to decide. So don't take any guff from a prima donna! As was pointed out, this is YOUR body and YOU are the one that is going to have to live with it the rest of your life. Get second and even third opinions until you find what feels most comfortable. Just FYI, I have heard some great things about Moffitt, and know some people who work closely with them who have had BC and \"get\" what you are going through.",
      "MessageIndex": 6,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728469",
      "Title": "Need some support ~ mln8428 lovinmomma"
    },
    {
      "AuthorID": "vegas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/40015/profile",
      "Content": "Jan 22, 2009 02:39AM vegas wrote: You know, it is truly lovely that your family is all there and trying to be very supportive for you. So many are all alone in this world and don't have anyone to really be there for them - they will probably think you are crazy. But guess what, for maybe the first time in your life this is all about YOU! Some of us want company, some want to be alone - the main thing is, right now you need to do what makes you feel the best. This is a very scary time and it sounds like you need some time alone to process what is happening. You are on information overload and it takes a while for your brain to catch up. Not to mention the emotional roller coaster part of it all. So take all the time out you need, even if it means sneaking out the back door or climbing out the window. Those who love you will understand.",
      "MessageIndex": 1,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727747",
      "Title": "Tiem for Yourself? Selfish? hazydc apple"
    }
  ]
}