{
  "AuthorID": "velo",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
  "Posts": [
    {
      "AuthorID": "velo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
      "Content": "Jul 29, 2016 12:35AM - edited Jul 29, 2016 12:38AM by velo I am still trying to figure out what makes most sense as it has only been 3 weeks since surgery. So far I have been wearing a camisole with soft stuffie. I went back to work a week ago and asked a co-worker I had told I was having a mastectomy (most ppl just think I was on vacation) to let me know if I look lopsided, as it tends to move around. She's like you're wearing something? Thanks, I know my boobs are small, but they are not non-existent. I do feel I look unpleasing lopsided. Human eyes like symmetry I think. But I also tend to think ah f@# it if I end up feeling more comfortable going around braless and lopsided, like one time when it was hot out and I had a coat on so didn't worry about the stuffie, but decided I needed to take off the coat from the heat. Since its still summer I want to figure out about swimming without having to necessarily buy a \"mastectomy\" suit. I have seen swim suits with removable cups, I am wondering if it would work with a cup in the flat side for shape and nothing in the other? The holes don't look big enough to insert a prosthetic (which I haven't acquired) Or when wet would the flat side tend to pull away from the chest and then my scar show?",
      "MessageIndex": 6,
      "PostDate": "29/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/845143",
      "Title": "Unilateral masectomy and no reconstruction dianee3 velo"
    },
    {
      "AuthorID": "velo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
      "Content": "May 26, 2012 06:22AM velo wrote: I'm in the same boat as you as having had surgery and now the waiting game!! I had a visit with my surgeon 2 days after surgery to check on healing, and I wrote up a whole list of questions to ask him, then forgot to get my list out! Doh. Do you have some good painkillers? Have they giving you any indication of what's next? Usually with lumpectomy radiation is necessary which may be 6-8 weeks. I've also been told I'll likely get chemo but that's because my tumor was large-ish (over 3 cm - no exact number yet) and I'm young (38). But what I want to know and don't know yet is when will I get my oncologist referral? And also staging / hormone status / and lymph node status. And of course the most important post surgery question - are the margins clear? Since they don't have results yet the only question that I could have but didn't was the first one. But likely your next step will be to see an oncologist.  ",
      "MessageIndex": 1,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/788087",
      "Title": "Just Diagnosed.....not sure what is next.... Ellendou chrissyb"
    },
    {
      "AuthorID": "velo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
      "Content": "May 26, 2012 01:12AM velo wrote: Sorry that you have so much waiting to have the core biopsy done! I was lucky in that once the ultrasound was extremely suspicious they said they could do the core biopsy same day if I wanted so I didn't have time to think or worry. Mine was no problem, the radiologist kept apologizing for all the pressure and I'm thinking hey this is much kinder than the mammogram!",
      "MessageIndex": 21,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787728",
      "Title": "Core Needle Biopsy - What's it like? thradia Layla2525"
    },
    {
      "AuthorID": "velo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
      "Content": "May 12, 2012 11:30PM velo wrote: Hi ElleBee - I'm in the same boat - I am 38 and waiting for biopsy results. Sending good vibes your way. As for the sense of urgency, I think that once they find something suspicious they want to do the tests as soon as possible for YOUR peace of mind :) Funny that trying to work for our peace of minds makes our minds more active eh? ",
      "MessageIndex": 3,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787362",
      "Title": "Waiting, waiting, fretting, and more waiting. ElleBee AnewBeginning"
    },
    {
      "AuthorID": "velo",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/151515/profile",
      "Content": "May 13, 2012 11:45PM velo wrote: Sending good vibes your way for your u/s tomorrow. I have my appt with the surgeon tomorrow who will hopefully have my biopsy results (at least partial). Here's to an UNEVENTFUL day for both of us :)",
      "MessageIndex": 8,
      "PostDate": "13/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/787362",
      "Title": "Waiting, waiting, fretting, and more waiting. ElleBee AnewBeginning"
    }
  ]
}