{
  "AuthorID": "Venusia",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64260/profile",
  "Posts": [{
    "AuthorID": "Venusia",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64260/profile",
    "Content": "Mar 12, 2008 10:45PM Venusia wrote: Hello everyone, first time posting.  This is really my first time daring to read these forums, b/c everytime I try to read up on BC I end up reading about statistics and they scare me, so although I am the type of person who researches everything, in this case I feel the less I know the better for my nerves and I put all my trust in my treatment and my doctor. I am 35, married with 2 daughters 5 and 7.  I had a ganglion in my armpit removed in late Nov, found out in Jan. that it was undifferentiated and cancerous, and BC was diagnosed shortly after.  I have 6 chemo sessions scheduled, 3 of FEC and 3 taxofer, then mastectomy then radiation.  I started chemo on Feb 1 and have my third scheduled on Mar 14, although we have to see if my white blood cell count is high enough.  If not, I get some sort of injection and treatment is postponed to next week. My hair started falling by day 11, 4 days later my husband clipped it off and I've been wearing a wig ever since.  I wear a headband under it for comfort.  If I'm alone I wear a scarf or a little beanie.  I got mouth sores for the first time this week (after 5 weeks of treatment - I was doing the baking soda and salt, but got lazy with it), so I started the magic mouth wash 2 days ago and they are almost gone now.  My red blood cell count dropped a lot so I had an Aranesp injection 2 weeks ago, and it made a big difference in my energy level.  I find that days 4-8 after chemo I have a horrible taste in my mouth, and drinking lemonade helps.  After 2 chemo sessions, my vein is sore, especially when I stretch my arm, so I am a little worried about the next session and whether or not they will put a tube up my vein and if that might hurt. Mostly, I try to enjoy my daily life, see my friends, take care of and be taken care of by my family, and be patient.  I look forward to moving through this experience with you.",
    "MessageIndex": 414,
    "PostDate": "12/03/2008",
    "ThreadURL": "https://community.breastcancer.org/forum/69/topics/699067",
    "Title": "Chemo starting Feb 2008? nowwhat cancerviking"
  }]
}