{
  "AuthorID": "Vermonster",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
  "Posts": [
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 11, 2018 10:09AM Vermonster wrote: I've thought of a couple of questions. 1: I have what I hope is plenty of button-up shirts (oversize) for the next couple of weeks. I have button-up blouses that I hope will fit when I have to go back out into the community (job-related). I'm wondering how long it takes before oversize t-shirts, pullover tops or baggy sundresses are possible. My husband will gladly help if that's all it takes to wrangle a top onto me while range of motion is an issue. Is that all it is, having someone help? 2: I read, a lot - it's a great escape from the real world!! How soon before holding a book or Kindle is not uncomfortable? I've never done an audiobook and wonder if I should plan to download a bunch of those to make \"reading\" easier. I don't usually watch tv or movies. Thanks to anyone who can venture an answer.",
      "MessageIndex": 97,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 11, 2018 02:42PM Vermonster wrote: Thanks Bostoniangal25 - my husband will gladly do the buttons, I have no plans to go anywhere or any need to go anywhere (except follow up doc appts on the calendar in 2nd week) and won't need to drive myself for as long as it takes - so I guess I should be ok by the third week with loose blouses - if not, we'll cope I guess!",
      "MessageIndex": 105,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 26, 2018 07:48AM Vermonster wrote: Ok, I got a full night's sleep last night - first sound sleep in a long time - and woke up feeling full of piss & vinegar - call me crankypants. Why, oh why, would the designers of the damned post-surgical bra put skritchy lace on?? And WHY are the armpits of it so freaking high?? Does anyone have suggestions for removal of the sticky residue off my chest? I've tried alcohol wiping (3x) and gently rubbing with fingers and applying Aquaphor (in excess) and STILL the blasted bra sticks to my foobs and has to be peeled off to swap for the daytime compression bra. At least that bra has no lace, but oh, man, does it squish! Thanks for letting me vent!!",
      "MessageIndex": 144,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 26, 2018 10:30AM Vermonster wrote: Did you get direct-to-implants? I did. I may be wrong, but I think from what I recall reading before my surgery that the folks with TE are the ones who are bra-free post-surgery... but I also know from the commentary of the nursing staff at my plastic surgeon's office on Tuesday that each surgeon has her/his own \"art\" to how patients are sent off after surgery, some using more or less taping to help \"shape\" things and/or hold them in place. It wouldn't surprise me to learn that to-bra or not-to-bra is a similar preference by the surgeon...",
      "MessageIndex": 146,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Aug 3, 2018 11:10AM Vermonster wrote: Hi Wagmorebarkless - I can totally relate to hiding with books - they are an escape from the reality of not having control of so much (diagnosis, snail's pace of waiting on test results, pace of surgical recovery, etc) and for all the blessings that the friends and caregivers are, they can also be exhausting - and it's not steadily easy to adjust to a different body and all that comes with the treatments! I'm glad your margins & nodes were clear (mine, too!!), I'm trying to be patient with all of the many limitations (my last two drains came out yesterday - what an improvement!!) I still have, 18 days post-surgery (my belly is still \"off\" after the laparascopic ooph), while celebrating the things I can do today that I couldn't yesterday (I got a stretchy tank top on all by myself). I wish you (& all of us) well as we move forward!!",
      "MessageIndex": 181,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Aug 8, 2018 09:43AM Vermonster wrote: Hi LittleRebel - I am 23 days post-surgery (nipple sparing bmx, direct-to-implant), final drains came out last Thursday and sutures come out later today!! It's amazing the range of feeling of discomfort around my chest. Like you, there are times anything touching me seems like sandpaper, but I have to wear a compression bra per my plastic surgeon. Where the band touches is hot & itchy. Where the drains were feels raw on each side. The top of my cleavage feels sunburned and hypersensitive. My nipples feel like they're being gnawed off. There's pressure on my backbone between my shoulder blades (but I think that's from being forced to sleep on my back for the last 3+ weeks). And I still have adhesive residue from taping that came off two full weeks ago. Such fun. The only area that doesn't have feeling is the underside of each breast and along the suture lines (mine go from nipples out to armpits, like hands of a clock pointing at 9 & 3). I'm kind of hoping that lack of feeling means it won't hurt when they take out the sutures, but I'm also hoping there will be some feeling when they do that (does that make sense?). Anyone willing to share whether they could feel it when the sutures came out?",
      "MessageIndex": 190,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Sep 6, 2018 02:28PM Vermonster wrote: I am 7 weeks out from surgery - met with the PS yesterday and am cleared for taking a real bath, swimming, side sleeping, going bra-less at night (if I want) and had all weight restrictions lifted other than \"don't overdo\" - I see my PT later today and meet my new MO next week. I have another appt. with the PS in November and have fat grafting scheduled for early December - need to research more about that... I hope everyone else is doing well as we all transition to the next phases of treatment.",
      "MessageIndex": 208,
      "PostDate": "06/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 11, 2018 01:25PM Vermonster wrote: Thank you Bostoniangal25 - I have a bunch of button front shirts (out of hubby's closet!) and loose shorts/pants (drawstring) - so first week or two should be ok - I don't care what I look like at home! I'm fretting more about when I finally have to go out in public (my job often involves interactions folks where I need to dress \"nicely\") as to whether my summer teeshirt dresses (and similar dressy casual stuff) will work...",
      "MessageIndex": 103,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 20, 2018 09:34AM Vermonster wrote: I finally have a surgery date of 7/16 for BMX and oophorectomy . It seems we go from one type of waiting to another (from waiting on all the test results to waiting for the date of surgery). Everything feels like it's in limbo. Sadly, seems like there's a lot of company in this boat on this journey.",
      "MessageIndex": 19,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 24, 2018 09:39AM - edited Jul 24, 2018 09:41AM by Vermonster What a week: morning of 7/16 I had my BMX (nipple sparing, direct to implant), sentinel node (l) and the oophorectomy. Day started off with a bang with me passing out after the sentinel node injection (it didn't hurt much and I don't know why I fainted!). That caused a bit of a delay with surgery itself. They gave me the happy juice shot and next thing, I came to and first thing I remember is my husband's face coming in to kiss my forehead. Last peaceful moment for a while. Barfed that night when they got me up to use the commode, had low blood pressure, didn't get asked to walk until next morning. Was sent home that evening (Tuesday). Getting in/out of the car was a nightmare. 90 minute drive, last fifteen on washboard/rutted dirt road. Made the mistake of sleeping in my own bed - with plenty of wedge pillows, was as comfortable as might be expected, but the bed is too high and I couldn't get out in the morning. I was in such pain. Wish I'd thought to have my husband set an alarm for middle of the night pain meds (we both slept straight through). Only took the narcotic pain meds (5mg oxy) on Tuesday night and Wednesday morning. Since then it's alternating tylenol and ibuprofen. I still have four drains, but two of them will be removed later today! One is almost ready to go, but the 4th (on left side) is still pretty active. I got the call from the BS yesterday that my surgical pathology report is in: no node involvement, very wide, clear margins all around the three tumors on the left and all the ovary/abdomen stuff and right breast were clear. BS is optimistic that with my oncotype score (19) and path results that it's possible I won't need to do chemo!! I am feeling very peaceful. What did I wish I knew beforehand? That it was possible my drains would be set so far back in my armpits that I can't reach them and so I can't strip them myself. That I would feel like a t-rex (short stubby arms!!). That at first my range of motion would be so limited I couldn't wipe myself after peeing (made me very glad I didn't poop until Saturday!) the first two days. That I would be blown up like a beachball for most of this first week (and am still very round) - cheap nursing scrub pants from WalMart ($5.84/pair) are my friends right now. All I can say is that I am so very glad I have such a wonderful husband. He's made it possible to smile and even laugh through all this so far. Thank you also to this group for being here - alleviated a lot of my fears, provided a lot of information and generally reminds me daily that this too shall pass.",
      "MessageIndex": 141,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jul 11, 2018 09:53AM Vermonster wrote: My surgery is set for 7/16, BMX and Ooph. Just started the muciprocin goo up both nostrils today. Gross. Tonight I'll use a petit pois size lump and hope it's less disgusting. It's starting to get real. I've been glad to read others here that had positive outcomes (negative node findings and the like), hate to read about the negative outcomes. My wedge pillows (one for head, one to elevate feet) arrived yesterday. I have one more big project to finish at work (tomorrow!) and then can hope for two full weeks of absolutely no work disruptions (self-employed, no guarantees there). My aunt (26 year bc survivor!) will \"babysit\" the one time we know my husband has to be out for a couple of hours. Still not telling anyone really about this ordeal - I'm not ready to have people know. Upside of that: no risk of unwanted visitors. Downside: people keep telling me to enjoy my vacation next week and that they hope we're going somewhere fun! Anyway. To those that have been through surgery, thank you for sharing your experiences. It's comforting.",
      "MessageIndex": 95,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Aug 22, 2018 12:43PM Vermonster wrote: Hi Borogirl - that's so generous of you!! I had my BMX 37 days ago - nodes done on left side, prophylactic on right side so no nodes - I am still sleeping with squishy pillows to prevent me from pushing either arm too close to my ribs - there's tenderness on both sides and having the pillows supporting my arms and being padded in the underarm/pit area has been comfortable (or as comfortable as it gets). I've tried napping without my pillows and it's not as comfortable. So, from my perspective, a pillow for each side works. Not every one of us will have the same experience, but I'd say go with your instincts!",
      "MessageIndex": 196,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Aug 10, 2018 08:05PM Vermonster wrote: I had my sutures out Wednesday - didn't feel a thing. Maybe one or two tiny tugs out of 32 stitches. Otherwise, totally numb!",
      "MessageIndex": 193,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Vermonster wrote: On 4/30/18, I had a routine annual mammo (I am 46). That same day I had an ocular migraine (2nd ever) and my annual Ob/Gyn visit (get all the fun done in one day!) - based on the migraine, my ob/gyn switched me off Nuva Ring onto Errin bc pills (the minipill). Since that day, I've had the needle biopsy by a BS with diagnosis of Invasive Mammary Carcinoma, no specific type, 2.3 cm spiculated mass, moderately delineated. I am er+, pr+, her2/neu- (1st test was equivocal, FISH test said negative), the Oncotype dx is in progress to decide if neoadjuvant chemo is appropriate, I'm also waiting on the genetic results (significant family history of BC: maternal aunt, great grandmother, cousin and OvCa: mother), I had a mapping MRI of both breasts - that report says it's invasive ductal carcinoma and there are \"several\" satellite lesions (one is identified as about 8mm and is about 1.3 cm away from the primary lesion). All my BS has talked about is neoadjuvant chemo followed by lumpectomy. He hasn't yet answered if I should go off the pill. He seemed surprised when the MedOnc said no to neoadjuvant chemo unless the Oncotype DX score is high enough (not sure what that score is). I don't yet have a next appointment with the BS. But I have a second opinion appointment scheduled for next week with a SurgOnc at a much larger facility. Thank you for letting me vent, suggestions appreciated. Dx 5/10/2018, IDC, Left, 2cm, Stage IIA, Grade 2, ER+/PR+, HER2- (FISH) Surgery 7/15/2018 Lymph node removal: Sentinel; Mastectomy: Left; Prophylactic mastectomy: Right; Prophylactic ovary removal; Reconstruction (left): Silicone implant; Reconstruction (right): Silicone implant Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 8, 2018 09:39AM Vermonster wrote: NotVeryBrave - yay for quiet ovaries - I'm still waiting on the results of the Oncotype DX - if the #s are low, chemo for me is unlikely (perfect timing on the new Tailorx study for me) - the Oncotype results are due Monday. I am signed up for the OvCa consult 6/21 (but on waiting list if earlier appointment is available). Hurry up & wait.",
      "MessageIndex": 13,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 8, 2018 01:53PM Vermonster wrote: Hi Lula73 - yes, the PS does do natural tissue, and a whole lot of alphabet soup reconstructions - I've looked at those as an option and for a variety of reasons, I don't think they're necessarily for me (I'd be more tempted by going without reconstruction)... there's now almost too many options, it's overwhelming....",
      "MessageIndex": 14,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "May 24, 2018 04:17PM Vermonster wrote: Did just hear from the BS responding to my follow up email asking the bcp question again and he said definitely time to stop taking the pill. Also now have a plastics consult end of next week to review those options before I have to make a decision. Progress, even baby steps, is good. Better than feeling totally out of control.",
      "MessageIndex": 4,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 6, 2018 11:43AM - edited Jun 6, 2018 11:44AM by Vermonster Update: Met with 2nd opinion SO who pulled strings and got me in same day with the plastic surgeon and who also ordered some same day bloodwork, including CA125 (for OvCa). She was fantastic - her style of explanations is much more suited to what I need so I switched to her care going forward. She is hooking me up with an OvCa SO to discuss ophorectomy. Genetics results are back - no negative findings. Bloodwork came back ok (CA125 not elevated, liver & kidney panels fine). Still waiting on Oncotype DX (next week, they say). I hate waiting. I'm not a patient person. I'm staying busy at work. Still not telling anyone, and absolutely hate polite chit-chat right now. Decision seems to be coming down to UMX or prophylactic BMX. Would welcome thoughts on that issue from folks (and any other thoughts)... Thanks!",
      "MessageIndex": 5,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 6, 2018 02:38PM Vermonster wrote: Lula - thank you for the input - I'm evidently in a category where I don't have enough tissue to use my own, so there go those options. SO should be able to do nipple/skin sparing, so that's good. Plastic surgeon thinks he can immediate reconstruction under the muscle, assuming SO doesn't find anything to suggest he shouldn't do that. Just got word my consult with SO for OvCa (re: oophorectomy) is set for June 21. More waiting. UGH.",
      "MessageIndex": 7,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    },
    {
      "AuthorID": "Vermonster",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274472/profile",
      "Content": "Jun 7, 2018 03:45PM Vermonster wrote: Lula - the plastic surgeon said he wouldn't recommend me as a candidate for using my own tissue for reconstruction, he was concerned there wouldn't be enough tissue there for symmetry. I'm slim(ish) with C cups. He thinks there would be a better result with implant(s). NotVeryBrave - I am premenopausal with ER+/PR+ and they need to either put me on chemicals to force menopause or take out the ovaries to induce surgical menopause - I don't need to preserve my fertility for any reason - my mother died of ovarian cancer - - there's a significant family history of breast cancer, too - I'm doing a consult with the SurgOnc for OvCa to see what her recommendation is - even though the genetics don't show any mutations, that's only for what they can currently test for - my aunt was tested in 2014 and at that time, they could only test for something like a dozen and my test was for 21 - who knows how many they'll be able to test for in a few years - we shall see. It's not decided or official yet.",
      "MessageIndex": 10,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/864824",
      "Title": "Diagnosed & Waiting on enough information to make decisions Vermonster Vermonster"
    }
  ]
}