{
  "AuthorID": "verynervous…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
  "Posts": [
    {
      "AuthorID": "verynervous",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "verynervous wrote: I am wondering if anyone knows whether hormonal changes associated with perimenopause can cause tingling, cold sensations in the breast.  I have these sensations frequently, but on one side only and am wondering if this is cause for concern?  I am 47 and have started to have some other perimenopause symptoms, but am wondering if this is a cause for concern.  I had clear diagnostic mammo and sonogram last May, plus clear clinical breast exams in May and September..  I do have more density on the side on which this occurring, so am wondering if that could contribute?  I don't have any other symptoms of concern, but am just wondering if anyone knows what might cause this or if I should be concerned. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/746155",
      "Title": "tingling sensations verynervous verynervous"
    },
    {
      "AuthorID": "verynervous…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "Apr 28, 2009 08:05PM verynervous wrote: Thank you for your very helpful response.  I called the hospital this morning and they confirmed I was being called back because \"extreme density made the films unclear\".  This is reassuring to me in the sense that it is the same reason I was called back last year.  I feel better knowing they just need more pictures, but am also concerned about the mention of \"extreme density\" as I know density can be a concern. Since I wasn't called back on my mammos when in my early 40's, I'm wondering if pregnancy and perimenopause can actually increase one's breast density.  I know that overall density is supposed to decrease once through menopause, but am wondering if it can vacillate with hormonal changes of pregnancy and perimenopause.  I also had a life threatening case of preeclampsia during my pregnancy - since that does have some hormonal implications, I am wondering if that can impact density.  Anyways, I go back Thursday for more films.  Thanks so much for your support - your response really made a difference. ",
      "MessageIndex": 2,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733219",
      "Title": "needing reassurance verynervous Maybe484"
    },
    {
      "AuthorID": "verynervous…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "Apr 29, 2009 09:31PM verynervous wrote: Thanks again so much to all of you who have responded to my post.  I am so grateful that this forum exists and appreciate your replies so much.  I know I shouldn't be worrying as much as I have and originally felt unsure about posting since I know others have much more serious worries than I have had so far.  The follow-up mammo is tomorrow afternoon.  I will be sure to post results.  I'm trying to look at it that if they do find something,I'll be thankful they found it early.  Also: when I got home tonite, I got the letter re: the call back (even though I had already spoken to them on the phone).  While the call back scheduler told me that the radiologist wrote \"extreme density made films unclear\", the letter says \"mammogram shows an area that needs to be looked at further in order to be sure that it is normal\".  I guess it's nothing to worry about, but seeing them mention a particular area scares me once again.  Last year's letter just said \"Additional imaging is necessary to complete the evaluation...it usually turns out to be normal\".  Maybe they've just changed the wording, but my mind is wandering to worry that something more is wrong than they told me on the phone.  The good thing that happened today is that I saw my PCP, who reassured me not to worry and did a clinical exam on my breasts that came out fine.  Thanks again to all of you - I know my problems are minor at this point compared to most, but thank you for realizing the fears are very real to me (even if they should not be). ",
      "MessageIndex": 7,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733219",
      "Title": "needing reassurance verynervous Maybe484"
    },
    {
      "AuthorID": "verynervous…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "May 2, 2009 01:24PM verynervous wrote: Thanks again for your responses.  I know I have probably overreacted to all this, but I tend to worry a lot about medical issues.  Although I have never had breast cancer, my worrying about anything medical comes from having a life threatening case of preeclampsia (toxemia of pregnancy) that landed me in the ICU in critical condition a few years ago. Ever since then, it doesn't take much to make me worried.  Just thought I'd explain so my overreacting is more understandable.  You have all been so helpful, I hope it is okay if I ask another question.  After the sonographer spoke with the radiologist, she said I could leave and to follow-up with my physician who should be receiving a report in a week.  This made me a little nervous as I wondered if this meant something was still unresolved.  She said nothing was wrong or the radiologist would not be letting me go home.  I'm wondering if it's standard protocal to tell people to follow up with their physician?  I'm asking because if the results letter they send tells me this, I want to know if it's routine or if I should be worried because they are telling me to follow-up. She also indicated he didn't specifically mention my needing to come back in six months, but I'm wondering if the letter is apt to say this since I needed extra imaging.  Just wondering what is the normal thing to expect in the letter after this type of call back with sonogram.  I am relieved they sent me home, but somehow the stress of this experience two years in a row has left me feeling afraid it isn't over.  Have any of you felt this way after frequent call backs?  Thank you so much.",
      "MessageIndex": 12,
      "PostDate": "02/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733219",
      "Title": "needing reassurance verynervous Maybe484"
    },
    {
      "AuthorID": "verynervous",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "verynervous wrote: Hi Everyone - I have had a mammogram callback for \"focal assymetry\" and am wondering if anyone knows what this means or if it is something to be concerned about.  This is my 3rd year being called back for something, so I continue to worry more each time.  I've had diferent symptoms too over the past two years, but all have turned out to have muscular or vascular origin and not actually in the breast.  In the past, the callbacks and other symptoms have turned out okay after additional tests (imaging, ultrasound), but I am going crazy again over this and am wondering if anyone can tell me whether focal assymetry is cause for worry.  Thanks. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/751901",
      "Title": "what is focal assymetry verynervous alligans"
    },
    {
      "AuthorID": "verynervous",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "verynervous wrote: I have posted a few times before and it has been immensely helpful.  I went through having a callback last year due to an \"area of density\".  Went back for this year's mammogram last Tuesday and had not heard anything, so I thought all was okay.  Tonite when I got home, I had the dreaded phone message telling me to call them back. I can't call them back until tomorrow morning, but I am terrified....Everything turned out fine last year, but somehow I am still quite scared.  The hospital has switched to digital mammography and the technician did tell me I had dense breasts, but the confusing part for me is that I'm 45 and had no callbacks on my first few mammos.  The callbacks came after having a baby at age 42.  I know I should not be worried at this point, but being called back two years in a row is making me very worried.  Any reassurance you can provide will be greatly appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733219",
      "Title": "needing reassurance verynervous Maybe484"
    },
    {
      "AuthorID": "verynervous…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/65784/profile",
      "Content": "Apr 30, 2009 10:45PM verynervous wrote: I am happy to say that things went well today with my call back appt.  When I got there, they informed me they needed to take more films of the left breast due to an area of extreme density (same area they were concerned about last year).  They took 3 views, had me wait, then radiologist wanted 3 more views.  Then the technician told me he wanted a sonogram because he still wasn't sure what this area of density was. He thought it was probably normal tissue, but wanted the sonogram to be sure.  I was very nervous because at last year's call back, I didn't have to have the sonogram.  The sonogram tech came back and told me the radiologist said I could go because he didn't see anything of concern on the sonogram.  So I guess it was just the dense tissue that was the problem.   I asked them why the density was never an issue in my earlier mammograms and they agreed that my early forties pregnancy and new technology could be the reason (thanks to those who posted info on these questions I had).  So I think I have the all clear until next year.  The experience was very nerve wracking and I do worry a bit about this area of density and that this will keep happening every year, but I guess I just have to focus on the present and be happy about today's good outcome.  I really appreciate all of your responses - your kind words helped me get through the last few days.  I will come back and visit and offer any helpful responses that I can in the future.  I wish you all the best and thanks so much!!!!",
      "MessageIndex": 9,
      "PostDate": "30/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733219",
      "Title": "needing reassurance verynervous Maybe484"
    }
  ]
}