{
  "AuthorID": "Vevs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
  "Posts": [
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "Sep 7, 2016 05:01AM Vevs wrote: Hello there, I looked in to Endopredict but my Oncologist in The Christie's hospital in Manchester, UK, which is a centre of excellence for Cancer care, suggested I use an American company called Caris Lifesciences based in Phoenix, Arizona, for tumour testing. I have followed his advice. It was not free but my oncologist uses them for mets and more complex cancers. I hope this helps, the results have come back with many treatment options for my particular tumour which is very reassuring Elen",
      "MessageIndex": 2,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/847786",
      "Title": "Endopredict test hawksfansarah Longtermsurvivor"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "May 2, 2017 09:56AM Vevs wrote: Thank you for your ideas. I'm going to look at a personal trainer, treat myself. Maybe in a private gym so that I can excercise without my wig!!! It does get really hot. Haematomas can be big and painful Z, when you get them post op I'm sure that Physio's use Ultra Sound to help dissipate them. My nursing practice is very dated so there are probably better treatments available now. I like it here...everyone is so upbeat and motivated. Brilliant group 😊👏🏻",
      "MessageIndex": 746,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "Mar 4, 2017 09:51PM Vevs wrote: Thank you ladies, I'm back on the yoga twice a week but the cardio is falling behind due to dismal weather and a poorly dog. Back on it next week. I'm going to buy some lighter weights and re start weight training very soon. I'm as weak as a kitten and very frustrated!! On the plus side my hair is growing back and I have eyelashes...yayyyyy",
      "MessageIndex": 342,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "May 12, 2017 03:52PM Vevs wrote: I've been such an insomniac for many years, pre cancer, post cancer and especially post MBC diagnosis. My GP would let me have 14 Temazepam tablets and 14 Diazepam tablets every 3 months. So I would cut them in half and ration and borrow Zopicline from my MIL to tide me over. Recently the GP said no more, that I would have to start on anti depressants to take regularly and stop the Temazepam. I took it as a chance to try something new. I bought custom made ear plugs from our local hearing centre, they block out virtually all noise and are amazing, I invested in black out blinds, that work which does help. Finally I started on Melatonin, I went on 10mgs initially and built up to 20mgs. I did have a couple of vivid dreams but nothing major. I am now fully off the Temazepam and my sleep pattern is much better. To be fair the Melatonin may just have a placebo effect, I did a lot of brain training to convince myself that they worked but so far so very good. I'm also far happier in myself, which will, of course, aid sleeping. I do hope this helps, as an added bonus I have read many articles that suggest that Melatonin does help with bone mets, especially with hormone receptive tumours, the dose is usually stated to be 20mgs.  ",
      "MessageIndex": 840,
      "PostDate": "12/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "Feb 16, 2017 03:12PM Vevs wrote: I've been reading the most recent posts and would love to join you. I've just completed a course of chemotherapy, previously I was doing Hiit training 3 times a week and walking 3-4 miles a day. I managed to continue the walking every day throughout the chemo, it was very tough. I also took up yoga, which I enjoy. On Wednesday I had the results of my ct which shows no active disease. My confidence following my mbc diagnosis has hit rock bottom so I am wary of joining a gym or any group activity at the moment. Any ideas as to how to build upper body strength? Not swimming as I have no hair, part of the confidence issue.Z invited me here, what a rock she has been and a font of knowledge",
      "MessageIndex": 263,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "Jul 15, 2018 11:56PM Vevs wrote: hi Bliss, I’ve recently gone on to 12 weekly Xgeva injections as I had been on the monthly regime for 6 months on then 6 months off. This is the usual regime that my oncologist prescribes. However I find that the injection gives me really bad bowel problems and the sux months on was miserable. So I had 6 months off and three months ago had my first Xgeva, no bowel issues. Two weeks ago I had the second injection on the new 12 week regime and my bowels are shot again. I’m mentioning this because you mentioned the half life. I can absolutely guarantee that Xgeva is in your system for at least 12 weeks as my diarrhoea is an accumulative issue. Just as it was on the first round last year. The first dose after 6 months and the first ever dose was fine. Then as it accumulates in my system things go downhill. I had a good few weeks of peace when I was on the six month break. It is definitely the Xgeva. Shame really as I haven’t heard many complaints about it, I really dislike it very much.",
      "MessageIndex": 123,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832600",
      "Title": "XGEVA let's talk about the good and the side effects dixiebell JFL"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "May 1, 2017 04:14PM Vevs wrote: hi, haven't been posting in a while because I'm actually feeling really well. Great to see so many enjoying excercise, it's been my salvation. I fell off the Yoga wagon but am now really wanting to go back in to the gym or circuit training. I'm seeing the Oncologist on the 17th so will ask his permission 😱 My sacrum is the main problem I think but I managed circuits very well until diagnosis with no ill effect. Z it sounds like you have a deep tissue haematoma perhaps? I'm no physio though but it should ease over a few months if it is a haematoma. Anyone with diffuse but small mets doing circuits please? Thank you",
      "MessageIndex": 734,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    },
    {
      "AuthorID": "Vevs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/237235/profile",
      "Content": "Sep 1, 2016 11:32AM Vevs wrote: I am new here and have never posted before. Not sure if this thread is still active. Could anyone help me out? I'm not in the best place and could do with some positive support",
      "MessageIndex": 20,
      "PostDate": "01/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766374",
      "Title": "My Story - Widespread Bone Mets cheriee Laurie09"
    }
  ]
}