{
  "AuthorID": "vhqh",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
  "Posts": [
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 5, 2008 08:04PM vhqh wrote: Doing a prophylactic double is something to certainly consider in your situation but it's not a decision you need to rush into with a low grade DCIS.  One factor to consider with a mastectomy and DCIS is that you may be able to avoid radiation, I know my doctors really pushed for me to just do a lumpectomy though. Genetic testing would also be warranted.  It is a personal decision though and one that I would have no problem with, I'd lop them both off in a heartbeat but I'm not one who is particularly upset at the thought of being \"flat\".  Actually the idea of being able to go braless is actually rather appealing to me.",
      "MessageIndex": 1,
      "PostDate": "05/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720712",
      "Title": "Just Diagnosed with DCIS Jo_Ann_K SonCallsMeEarl"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 30, 2009 07:15PM vhqh wrote: I've just got fuzz right now but at least I'm getting something!  They told me before WBR that it probably wouldn't come back but I am right at 2 months out and something is happening with it.  Looks like I may be getting a reverse mohawk though! This is my second round of baldness, didn't buy a wig the first time and have resisted buying a nice one this time around although I've got one picked out.  Just hate to spend the money......",
      "MessageIndex": 26,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728101",
      "Title": "Goodbye to hair... again SunshineSmiles heatherpalmerton"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 26, 2008 07:42PM vhqh wrote: I have only been diagnosed for less than a year, stage IV from the get go, so I'm not a very good example but I wanted to tell you about my supervisor's wife, she has been stage IV with liver mets for over 9 years now.  Consider this, most people who are coming to this site are seeking support, they're newly diagnosed, needing answers for treatment questions or dealing with progression.  Those that are doing good tend to not come around nearly as often.  I literally spent hours here and on other sites when I was first diagnosed, then I slacked way off as I had most of my questions answered.  Now that I am about to have a mastectomy as I didn't get clean margins on my lumpectomy last fall, I have been spending much more time here again checking out the surgery threads.  Don't fall prey to your fears and nagging doubts, there are a myriad of treatment options available today and many more exciting developements on the horizon!",
      "MessageIndex": 4,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708098",
      "Title": "Stage IV Encouragement Wanted Baziotes plc"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 19, 2008 06:44PM vhqh wrote: I didn't but I have had a sore collar bone, I think Shirlann is one that has rib pain.  There is a name for it that I can't remember, costo- something, but sometimes the tissue around the ribs gets sore.",
      "MessageIndex": 1,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721487",
      "Title": "Radiation and Rib Pain tomatojuice BarbW"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "May 16, 2010 02:36PM vhqh wrote: I have brain mets.  I was diagnosed as stage IV from the get go and had a clean brain MRI as part of my preliminary scans in September 1997.  In September 1998 I had a second brain MRI just to check as I am HER2+.  Multiple small lesions scattered throughout the brain were found yet I was and continue to be asymptomatic.  I did WBR that ended in December 1998.  The mets remain but I have only had 1 scan show a slight progression.  Brain MRIs are now part of my regular quarterly scans and I still show no symptoms after 2 years. ",
      "MessageIndex": 17,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/752623",
      "Title": "Would you want to know? daisylego konakat"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 14, 2008 08:34PM vhqh wrote: If the lesion is osteolytic it may not show up well on a bone scan.   From what I've read, osteolytic lesions show better on PET scans and osteoblastic show better on bone scans.",
      "MessageIndex": 3,
      "PostDate": "14/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722749",
      "Title": "Positive MRI-Negative Bone Scan roseanne vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Apr 5, 2009 08:04AM vhqh wrote: Hang in there, radiation can kick butt on brain mets.......I finished WBR last November, just had scans a couple of weeks ago and my mets are shrinking away.  Oncologists even mentioned NED! ",
      "MessageIndex": 42,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731126",
      "Title": "Brain Mets for me kgrimm SunshineSmiles"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Dec 26, 2009 08:33AM vhqh wrote: Full house remodel and a house keeper, new horse trailer with living quarters and a big new 4 wheel drive truck to pull it...... 4 wheel drive cause I'm about snowed in right now!",
      "MessageIndex": 11,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/745812",
      "Title": "Santa Baby...If you could get one present Fitztwins LuAnnH"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 20, 2008 12:50PM vhqh wrote: Yes, they can.  It can spot lesions and identify some characteristics of the lesion but it cannot tell for certain if it is actually cancer or benign. ",
      "MessageIndex": 2,
      "PostDate": "20/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709355",
      "Title": "CAT Scans twogirls vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 25, 2009 08:56PM vhqh wrote: I'd have to look it up but I think tomorrow is mine also......if not tomorrow it was yesterday..... :)",
      "MessageIndex": 6,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740957",
      "Title": "Tomorrow is my cancerversary lovinmomma MJLToday"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 21, 2008 02:22PM vhqh wrote: I've got 21 down and have had the bolus every day, they only use it for the two angle shots, the one coming strait down they've been pulling it off for lately and they act like it doesn't really matter if it is there or not for that zap.  I'm a little red and tender but nothing serious.",
      "MessageIndex": 12,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/720961",
      "Title": "Anyone use BOLUS embmom EmilyJane"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 17, 2010 08:34AM vhqh wrote: Statistics are not what they are made out to be.  By the time they collect the data, evaluate it and crunch their numbers it is already a year or two, at the very least, out of date.  With all the new drugs that keep coming out it, survival rates just keeps improving.  The statistics when I was diagnosed with brain mets was that my life expectancy was 1 year, 2 year aniversay was last month and there is no big indication that my stability is going to change anytime soon.",
      "MessageIndex": 6,
      "PostDate": "17/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/759422",
      "Title": "new normal elizarose63 vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 18, 2008 04:54PM vhqh wrote: I just spoke with my surgeon yesterday and I asked about taking the \"good\" one also, he discouraged it and stated that in the past 5 years he has only had one patient where they actually found something in the \"good\" breast after removing it.  He did offer a MRI if I insisted but commented that these frequently lead to delays in surgery while they biopsy suspicious spots on the MRI that ultimately turn out benign.  He also commented that the insurance companies will often balk at paying.  I am in a different situation though, I am stage IV, had a lumpectomy but did not get clean margins.  They did not want to wait for me to heal from a second surgery so I have had chemo and must now have a mastectomy.  Due to my stage IV status I will be getting regular scans so it is not as worrisome to me that something may be lurking.",
      "MessageIndex": 1,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/707569",
      "Title": "Options stacymo pinoideae"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 16, 2009 11:29AM vhqh wrote: I was always given an IV steroid with my chemo, the ol' knees sure felt better on it.",
      "MessageIndex": 4,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/729026",
      "Title": "Effects of Chemo or Stoppage of Chemo on Musles & Bones bevsteed bevsteed"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 3, 2008 02:08PM vhqh wrote: I started Herceptin at the same time as I started chemo, the Herceptin was continued after chemo ended.  I have practically no side effects from the Herceptin, the main concern is the possibility of heart problems, I'm not aware of Gemzar or Xeloda affecting the heart so I would think taking it along with them would be fine.",
      "MessageIndex": 1,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708457",
      "Title": "Need suggestions on Herceptin shengyue527 LuAnnH"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 25, 2008 01:30PM vhqh wrote: I don't know that the incision type will affect your discomfort level.  I just had a unilateral in July and had no discomfort at all from the incision, drain caused some minor twinges but nothing that I required meds for.",
      "MessageIndex": 7,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720017",
      "Title": "bilateral incisions--which way is best? harmonysun otter"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 6, 2008 04:44PM vhqh wrote: I wish I could have limited how many people I told about my diagnosis but I know them all to well at work, my supervisor especially would not be able to keep his mouth shut.  The alternative for me was to be fairly open about it and then there would be no talk when I needed time off or lost my hair.  It worked out good, if anything everyone has urged me to back off and take it easy.  There were a few times when I about lost it but for the most part it's been good.  I think continueing to work has prevented me from losing my sense of self, the unexpected instances when coworkers whom I never would have known had have cancer themselves talk to me about their experiences was reassuring. The worst part of this journey has been with some of my cousins, not that they said or did anything wrong.  It's just that I had one cousin who was diagnosed with lymphoma about the same time as I was diagnosed.  I responded well to treatment, she did not and we lost her a month ago.  They always asked about me and it was hard to tell them how well I was responding knowing that their sister was not.  I feel guilty yet I know there is nothing to feel guilty about.",
      "MessageIndex": 14,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708505",
      "Title": "Identity and late-night tears LorenaB cp418"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 19, 2008 06:32PM vhqh wrote: My quality of life might even be called somewhat better, having cancer has forced me to allow others to help me more when in the past I've always been the stubborn hard headed do it myself type.  Although I had some problems with chemo, side effects and symptoms for the most part have been minimal to non-existant and I've been blessed with some very caring and supportive family, friends and coworkers.  I am anything but normal in this though and it is my goal to give my young onc an educational experience he won't soon forget regarding statistics and expectations, from what the nurses have told me I am succeeding so far in it.",
      "MessageIndex": 3,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723030",
      "Title": "quality of life jerseymaria badboob67"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 11, 2009 04:23PM vhqh wrote: A lady I know has been dealing with liver mets for over 10 years.  I also agree with those who say don't cancel your trip, take it if at all possible and have some fun!",
      "MessageIndex": 13,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741902",
      "Title": "Just diagnosed with liver metastasis Krystyna Krystyna"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 19, 2010 01:53PM vhqh wrote: I also have bad knees and took ibuprofen 800 mg while on tamoxifen with no problems.  Also have Lortab 5 mg and 10 mg as my onc does not want me taking too much ibuprofen because of the potential for stomach issues.",
      "MessageIndex": 2,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/748457",
      "Title": "Tamoxifen and NSAIDS meima-Bev vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 28, 2008 03:02PM - edited Sep 28, 2008 03:05PM by vhqh PET was done Friday, brain MRI was done Thursday.  They didn't biopsy the femur as the lesion was not on the surface and he did not want to risk any further weakness by drilling even a tiny hole for the biopsy.  The MRI confirmed the lesion and showed severe bone thinning, onc ordered me onto crutches and referred to an orthopedic doc to have a pin put in, fortunately the xrays that doc ordered showed that the MRI was wrong, the bone had not thinned.  Go figure, I was asymptomatic for that lesion also.... Trust me, they are going to have to give me a pretty certain diagnosis before I will allow more radiation!  As it is, I am thinking of seeing how I respond to Tykerb first, maybe Xeloda also.",
      "MessageIndex": 12,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 30, 2008 02:34PM vhqh wrote: I have multiple lesions, 3 are around 1 cm and the balance are much much smaller, WBR is my only option.  Talked to my medical onc today, PET scan was good, no new lesions other than uptake in one vertebra that could not be matched up with any lesions on the CT, met in femur is healing.  He is going to add Tykerb to the Herceptin and Tamoxifen, I am really hoping this works as I'm not ready to call it quits but he wasn't sugar coating anything.",
      "MessageIndex": 21,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 4, 2010 04:35PM vhqh wrote: I had something similar, for my lumpectomy the anesthesiologist came in, introduced herself and 5 minutes later I'm being rolled into surgery.  I was back for the port surgery 2 weeks later, same anesthesiologist.  A month later I received a bill for $900 from the anesthesiology group.  I blew a cork!  The group was in plan but the insurance company denied payment for the first surgery and paid the second.  Like what has already been posted, you don't have the opportunity to check before surgery.  What I discovered was that the anesthesiologist was new to the group, she had not yet been put in the plan at the time of the first surgery but was in by the time of my second surgery.  I was not a happy camper when I started making phone calls.  Insurance wouldn't back down and pay but they did take over dealing with the anesthesiology group to get the bill written off. ",
      "MessageIndex": 23,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754866",
      "Title": "A Moment of Rant khartoregon khartoregon"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 6, 2008 05:09PM vhqh wrote: I didn't get the same drugs, mine was TCH every 3 weeks, but I did work through chemo.  I switched hours worked, working 4 10 hour days, Monday through Thursday, instead of working 5 day work weeks.  Treatment was scheduled for Thursdays which gave me until Monday to recuperate, however I usually felt bad enough to take all or part of the following Monday and Tuesday off.  If I had to I could have forced myself to work but my supervisors and coworkers couldn't have been more supportive, taking over my caseload when I was gone, often trying to get me to take more time off.  Biggest problem I had was fatigue. I agree with playing it by ear, that is pretty much what I did.  A lot will depend on how supportive and flexible management is if you choose to continue working, of course there is nothing wrong with not working and focusing on your treatment and kids.",
      "MessageIndex": 2,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723986",
      "Title": "Working during Chemo Emma303 vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Apr 17, 2009 02:00PM vhqh wrote: This is such a difficult situation to be in!  I do want to offer you a ray of sunshine on the path report, a Ki67 of 3% is good, it is a measurement of how aggressive the tumor is and 3% would indicate lazy slow growing cancer cells.  Just for comparison, my Ki67 was 46%.",
      "MessageIndex": 77,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/732491",
      "Title": "HELP! 10 year old with bc cjsocal Mary-Lou"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 13, 2008 08:15PM vhqh wrote: Don't let the statistics get to you, YOU ARE NOT A STATISTIC!  Also keep in mind that all statistics are outdated.....they spend several years gatthers information, several more years compiling it and coming up with their figures before finally releasing it to the public.  End result is that the statistics you see can be 5 to 10 years old by the time you read them.  Great advances have been made in the past few years and more are on the way.  Talk to your doctor about your desire to skip the biopsy, with it being classified as Birads 5 they might be inclined to go along with you.  I know my onc made some assumptions about me that he soon learned weren't accurate, be clear about what you want.  {{{{{{{{{HUGS}}}}}}}}} ",
      "MessageIndex": 2,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/724413",
      "Title": "Pretty scared Triciaski vitaledoda"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 28, 2008 09:15PM vhqh wrote: Well, I have just finished going completely through this forum and reading every post that mentioned the brain and then some......I feel quite a bit more reassured that if it comes down to it I can get through WBR.  I don't post much but I would have been totally lost this past year if not for all the help I have received here! I clued in my hay supplier tonight that things weren't looking good and I'm betting he'll be more than willing to put out hay for me, he did it last winter when I was going through chemo and wouldn't take anything extra for the delivery.   I'm thinking I might even hit up my cousin to use a 300 acre pasture for a month or two that is less than 2 miles from my hay guys house.  I know my siblings will say I need to sell out, oldest sister flat out told me last winter that I needed to grow up and get rid of the horses!  I gave her a little education on how the horses are therapeutic,  they forced me to get out and exercise during chemo, not to mention I am 47 years old so not exactly a kid to be bossed around anymore. ",
      "MessageIndex": 14,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "vhqh wrote: Tests are not all in but I may have scattered mets throughout the brain.  I am not dealing well with this at all.  I am single, live alone, have horses and pets to care for.  I have already been told no driving which is going to put a big kink in things, no bus or taxi service in this town.  How bad does whole brain radiation affect your neurological functioning during treatment?  How long before you could drive again?  Is living alone going to be feasable?  IDC, er+/pr +, her2 +++, stage IV Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 28, 2008 12:49PM vhqh wrote: I appreciate everyone's help, I'm doing better today, broke the news to one of my sisters and she didn't freak out, she actually reminded me of one of my Mom's CTs that showed brain lesions that they didn't know where they came from.  My CT showed a number of enhancing nodules, most very small although there were 3 that were around 1 cm.  I am asymptomatic so that is in my favor as I do not want to quit working, not yet anyway.  I do have family and coworkers who will help me out with transportation and I am sure I can make arrangements for my horses, I just hate to impose on people.   I am very stubborn and independent, I was doing ok until I talked to the rad onc Thursday and she took the attitude that it was brain mets despite the fact that she isn't convinced that my femur met is actually a met since it wasn't biopsied.  We only had a CT on the brain, the femur was verified with a MRI, PET and xray, seems to me she would accept the femur as a met, especially since it has changed from osteolytic to osteoblastic!  She did say that as small as the lesions are they should be controllable although WBR is pretty scary.  She was not happy to find I am still driving, she also told me to quit work, I lost my temper a little and informed her I was not going to quit living because of this crap.  That took her back a bit, she looked at me and said \"Martha, you're an amazing patient!\".     I will get the results of the brain MRI, PET and CA 27-29 Tuesday, I will also finish up rad boosts to the mastectomy site and axilla next week.  Last week was the one year anniversary of my diagnosis, I was really looking forward to getting a break from things.......        ",
      "MessageIndex": 10,
      "PostDate": "28/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 29, 2008 07:09PM vhqh wrote: The verdict is in and it is mets.  Rad onc talked to me this morning after treatment instead of Thursday, she took me back, showed me the MRI and pointed out the lesions.  She's decided no boosts now and wants to start rads to the brain right away, I put it off until Monday since I won't see my regular onc until tomorrow and we still don't have the PET results as the computers were down.  She seemed cautiously optimistic that we may be able to control it long term but time will tell.  Good news is that she didn't even mention not driving today, I suspect my lack of symptoms and the fact that the MRI showed practically no edema may have changed her opinion some.  She is still pushing for me to quit working and doesn't seem to understand why I'm not eager to. Loosing my hair again is bothering me much more than it did the first time, the short curly cut I have now is sooo cute and I don't want to loose it.  Rad onc has said the hair loss will be permanent which doesn't help at all even though I have read a number of posts where the hair loss was not permanent.  I was really looking forward to seeing the extended family at Thanksgiving with my cute hair style, now I'll have to go bald.....",
      "MessageIndex": 18,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721895",
      "Title": "whole brain radiation vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 24, 2008 08:00PM vhqh wrote: When I was in high school, my mother was diagnosed with colon cancer, we'd lost Dad 3 years before that to stomach cancer.  Being the youngest and the only one left at home, I drove Mom to all her appointments and chemo sessions, I wasn't even 16 yet.  The chemo SE was horrid and nearly killed her a couple of times yet she hung on.  It was to the point that we just hoped to get to the car before the vomiting started.  They finally stopped one drug after it got to the point she needed hospitalization nearly every month.  Mom recovered and is still alive today.  She is my inspiration, I know that I haven't gone through near the hell she did so I tell myself I still have a lot of options open to me.  I do worry about it though since the brain mets diagnosis, I've tolerated treatment very well so far but the future possibilties scare the crap out of me.  I honestly don't know how Mom did it but I'm hoping maybe it is the same stubborn hard headedness that I have. I honestly don't know if this story really helps you at all or even makes sense, but I thought you might want a kids perspective.  I was thoroughly grossed out by much of this experience yet I wasn't about to shirk helping but like most teens my attitude wasn't always the best either.  You may be sick and in bed but don't you believe that this means you're not there for them.  I am much much closer to my mother than my siblings as a result of this but there are times now that I wonder if she ever wanted to stop.  {{{{{{{{{{{ HUGS }}}}}}}}}}}} Martha",
      "MessageIndex": 17,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723339",
      "Title": "How long will you fight? TripleNeg pinkpig"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 22, 2008 06:28PM vhqh wrote: My most recent PET included the brain and brain mets can be picked but PET is not very reliable for this.  I have brain mets and my PET came back clean.  I suspect part of the reason is that a lesion must reach a certain size before PET will pick up on it, mine were all 1 cm or smaller.  The big problem is that PET uses radioactive sugar which is taken up as fuel by the most active cells, there is so much activity going on in the brain that it generally lights up throughout it.  MRI is the preferred scan for the brain but a CT can also pick up brain mets. ",
      "MessageIndex": 5,
      "PostDate": "22/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724851",
      "Title": "Scans, Scans and MORE scans WingsofHope vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "May 30, 2008 12:01PM vhqh wrote: I am triple positive and did 5 rounds of Taxotere and Carboplatin,  I am continueing on Herceptin, Tamoxifen and Zometa.  I also went through an ACS treatment decision tool that indicated Carboplatin was an appropriate treatment in my case so yes, Carboplatin can be for triple positives.",
      "MessageIndex": 6,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706346",
      "Title": "recurrance in lymph node lemonpie vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Mar 22, 2009 12:05AM vhqh wrote: I finished WBR the 1st week of November 08, dealt with severe fatigue in December and January, hair started coming back in February.  Had a MRI yesterday followed by an echo and finally a mammo.  Radiologist sent word back through the mammo tech that he'd had time for a preliminary look at the MRI and my mets are still shrinking!  I have been asymptomatic the entire time, the \"innumerable\" mets were a surprise finding during a routine CT.  I was given decadron as a preventative but only took 1 mg a day and quit it early with the blessing of the radiation onc.",
      "MessageIndex": 25,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730968",
      "Title": "It hasn't even been a year :( HELP! ekenny315 Makratz"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 13, 2009 10:55PM vhqh wrote: I had a cousin who was diagnosed with lymphoma during the same time period when I received my diagnosis.  I responded well to treatment, she didn't and we lost her a year ago. I still feel guilt even though I know she was getting the best care available as her daughter is an MD.",
      "MessageIndex": 25,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734458",
      "Title": "Do you ever feel guilty?? RobynK konakat"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 6, 2008 09:01PM vhqh wrote: Tom's caused me to break out in a rash.  During radiation I made the discovery that the aloe gel I was using seemed to eliminate any odor problem, don't know why but it did.",
      "MessageIndex": 9,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/722191",
      "Title": "deodorant lafera12 mariek56"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 28, 2008 12:33PM vhqh wrote: Yes, I've done it and it's not bad, pretty much just a lumpectomy but they stick a big needle in first to identify the spot.  Radiologist screwed mine up, missed the spot and had to reinsert the needle but it didn't hurt a bit either time.",
      "MessageIndex": 1,
      "PostDate": "28/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708226",
      "Title": "surgical biopsy with needle localization sushi2 sahalie"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 10, 2008 05:19PM vhqh wrote: The aloe I found was at WalMart, a very large bottle, clear with no colorants.  My rad oc only wanted me to use Aquaphor, I used the aloe anyway as I worked through rads and Aquaphor is just too greasy for that environment.",
      "MessageIndex": 4,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/721616",
      "Title": "\"Orinine\"? Kleenex"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 28, 2008 09:34PM - edited Oct 28, 2008 09:35PM by vhqh I started rads to the mastectomy area in mid August, when that was done I immediately started whole brain radiation and will not finish until next Friday, only 8 more (out of 50 total) to go!!!  They don't like to give sessions of rads that close together but in my case there really wasn't any other option.  I have had some fatigue but have not missed any work yet because of it.  Each person is different and until you get into it there is no way to tell how you'll react.  I am fair skinned and I had some burning but not anything too serious, biggest problem was where my soft cotton Tshirts rubbed at the neck line. If you get tired, take a nap or go to bed earlier, it's time to be nice to your body.  Use the aquaphor or aloe or whatever creme is recommended by your rad onc, and use it as much as you want to but no less than twice a day, three would be better.  Mine insisted that I used nothing but corn starch until they told me differently, then they gave me Aquaphor.  I did not wash mine off before reapplying, friction is not good on radiated skin.  Ask for Silvadene if you get any raw spots or blisters, it worked wonders for me.  I was not totally compliant with my rad onc instructions as I used aloe right after treatment instead of the Aquaphor due to the greasiness and the fact I go directly back to work, unexpected side benefit is that aloe acted as a deodorant for me, no BO once I started using it. Once I started treatment, deodorant and bras were forbidden, I was not allowed to use anything at all on my skin prior to my zaps. ",
      "MessageIndex": 3,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/723531",
      "Title": "Questions about rads protocol HeatherBLocklear Kleenex"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 2, 2009 04:28PM vhqh wrote: I started Navelbine in August, got 2 rounds at 50mg then my blood counts dropped so he reduced the dose to 35.  I haven't had scans since starting this but my CA 27-29 which had been rising about 10 points at a whack from 13 to 41 dropped back to 29.",
      "MessageIndex": 3,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741338",
      "Title": "HELP! Dasatinib or Navalbine? gma5279 gma5279"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 30, 2008 08:58PM vhqh wrote: I have a very big issue with one thing your doctor told you - just because you can feel a lump does not mean treatment options are limited.  It actually isn't a prognostic or treatment factor at all!",
      "MessageIndex": 4,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723666",
      "Title": "Overwhelmed and terrified Emmabell Towhee"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 26, 2008 07:56PM vhqh wrote: I would be asking for a PET or bone scan.  Cancer is sneaky but there are other things that can affect the calcium levels so it's not time to panic yet......  :)",
      "MessageIndex": 1,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708103",
      "Title": "high blood calcium vs other results hutspa Joviangeldeb"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 15, 2009 10:57PM vhqh wrote: Thanks for the reminder - I have the acne rash too!  I consider it to be a superficial annoyance in light of what they say about it being a sign of effectiveness.",
      "MessageIndex": 7,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729111",
      "Title": "side effects for tykerb YHong YHong"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 6, 2008 08:43PM vhqh wrote: I really can't speak for myself, I just had my first head zap today and since I was asymptomatic, I am only taking 4 mg of dexamethasone a day once a day as a precaution.  I was on much heavier doses while doing chemo but of course with the chemo who knows what caused which symptom.  I would suggest taking some senekot as a daily routine unless she starts having the opposite problem.",
      "MessageIndex": 23,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 6, 2008 07:35PM vhqh wrote: Call the doctor about the head ache and upset stomach, it could be the steroids and not the radiation.  Either way the doctor needs to be aware of these symptoms.",
      "MessageIndex": 21,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 16, 2008 11:56PM vhqh wrote: I was diagnosed with brain mets in September but we have only added Tykerb for now so I really can't help you with the Xeloda se.  I started Tykerb at 1000 mg, am also getting Herceptin, Tamoxifen and Zometa.  Broke out in a bad rash and had some serious abdominal pain that was probably due to an ovarian cyst.  Stopped the Tykerb for about 10 days to get things under control and then restarted it at 750 mg, splitting it into 2 doses.  I'm tolerating that much better, I did switch the heavier dose to nights as it tends to make me a little gassy.  I've only had to take immodium one time and have been using whatever lotion I have around on my hands.  No problem with my feet but I believe the hand foot syndrome is more a se of the combination of Tykerb and Xeloda.  There's several creams whose names keep popping up, Bag Balm is one and Burts Bees is another.  I've got some Bag Balm but haven't used it on myself.....yet!   Sorry I can't be of more help.",
      "MessageIndex": 2,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724544",
      "Title": "Managing SE of Tykerb and Xeloda shafali LuAnnH"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Apr 13, 2008 03:09PM vhqh wrote: First surgery was the lumpectomy, I went out right after they wheeled me into surgery, woke up in recovery with a nurse telling me to breath.  I guess my blood pressure had dropped really low during surgery so they kept me overnight to monitor it.  Ended up being the next afternoon before the surgeon made it in to release me.  No nausea and very little pain, worst problem was a sore scratchy throat from the ventilator, otherwise I felt well enough I could have gone to work the next day. Second surgery was to put a port in and was done under what they call twilight, they wheeled me into surgery, got me scooted over onto the table and strapped down (good thing I'm ok with restraints!).  Staff and sugeon were joking around a lot when one of them realized it might be making me nervous and said something, I told them I'd be more nervous if they were too serious.  Last memory was the anesthesiologist leaning over my head to inject the sleepy juice in my opposite arm.  Woke up in recovery with no problems except my blood pressure was a little high, went home as soon as they got an xray of the port.",
      "MessageIndex": 32,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 15, 2009 09:39PM vhqh wrote: I've been on tykerb since November, nausea seems to be the biggest problem for me.  It may be that the tykerb has just tweeked her other drugs enough for the side effects to kick in.  I know Carboplatin can affect blood counts, Avastin is known for causing bleeding problems. ",
      "MessageIndex": 4,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729111",
      "Title": "side effects for tykerb YHong YHong"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 3, 2008 02:00PM vhqh wrote: I did pretty good eating the Green Giant single serving brocoli and cheese, also macaroni and cheese tasted decent to me.  Green grapes worked pretty good also, I had a bout of the flu a few days after chemo and ended up with my pottassium levels low, the green grapes were recomended to help with this plus they tasted good.",
      "MessageIndex": 6,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708413",
      "Title": "Need help with food suggestions! lemonld Fitztwins"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 13, 2009 12:45PM - edited Feb 13, 2009 12:46PM by vhqh This just plain sucks!  I have a monitored alarm and would highly recommend one.  Mine has a smoke/fire detector plus 2 remotes with medical/panic buttons on them.  It only costs $24 a month.  We bought the system when I had Mom at home so she could call help if she fell or something.",
      "MessageIndex": 24,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728880",
      "Title": "On top of everything else now a Robbery TripleNeg SpunkyGirl"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 30, 2008 11:42PM vhqh wrote: I was officially diagnosed yesterday with scattered brain mets.  I've been doing a lot of research since the lesions were first spotted on a CT a week ago and one statement I've seen several times that has given me hope is that despite the dire sound of having brain mets, most do not die from them.  How well your cancer is controlled from the neck down has a big impact on your prognosis with the brain mets.  Tykerb, xeloda and temodor are all believed to cross the blood brain barrier so there is more than just radiation available however radiation is still the primary treatment.  With scattered mets like mine, it's going to be whole brain, I start Monday and I am dreading it.  I will continue with herceptin, zometa, and tamoxifen, once done with radiation we will add tykerb.  My femur lesion is healing and I have no confirmed mets anywhere else below the neck so I am hoping to be one who can beat the odds.",
      "MessageIndex": 5,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722063",
      "Title": "MOM NOW HAS BRAIN METS! cneal318 TripleNeg"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 27, 2008 02:56PM vhqh wrote: Herceptin is a very good targeted therapy if your mother is HER2 +, otherwise it is useless.  It is frequently used alone or along with other treatments but I don't believe they use it in place of other drugs, Tykerb is an exception to this as it is the only other targeted therapy I am aware of that also targets the HER2+ receptors.  I would suggest visiting the HER2 or Chemo forums on this site for more help.",
      "MessageIndex": 1,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708152",
      "Title": "wonder if my mom should switch to Herciptin shengyue527 SandyAust"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 4, 2008 12:09AM vhqh wrote: I finished up Tuesday, boosts were cancelled.  I've got a pretty sore spot on my neck where my tshirts have rubbed, also have a pretty sore spot in my armpit right at the top of the radiation field that I blame on friction from arm movement.",
      "MessageIndex": 407,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 6, 2008 07:11PM vhqh wrote: It's been a week since my last regular zap and I am still pretty sore.  I put aloe on early this morning and it actually seems a little better tonight.  I am wondering if I didn't need to let it dry up a little and crust over.  I appreciate everyone's prayers and thoughts, I hesitated to even say anything about it as I know most here are fairly early in this journey and I didn't want to scare anyone.  I have brain mets and started whole brain radiation this morning.  The official prognosis is poor but I am not a statistic, there seem to be more and more people living years after being diagnosed with brain mets and I have a number of factors that are strongly in my favor to join their ranks.  Herceptin appears to have worked a little too well for me and left the cancer no where to go but the brain which Herceptin cannot reach.  The only suggestion I would make to others here is for those who are HER/2 posititve to get a brain MRI annually, even if you have to conveniently get a severe headache to get it. ",
      "MessageIndex": 427,
      "PostDate": "06/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 8, 2008 07:14PM vhqh wrote: That really sucks!  I still wander if they didn't sneak a heavier dose in on me after cancelling the boosts, the machine ran longer and my skin took a nose dive, both in redness and ouchieness.  They brushed it off as being affected by the air pressure etc. from the weather change.",
      "MessageIndex": 455,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 18, 2008 07:48PM vhqh wrote: Kristy - I started doing the topless arm extended bit also and I think it really helped me also Congrats to all who have completed or are nearly there! I finished a little over 2 weeks ago and finally went to the city yesterday to buy a good prosthesis and a couple of bras.  Thought I was pretty well healed up but now I'm not so sure I was as far along as I thought.  After not wearing a bra since mid august, this is going to take some getting used to!",
      "MessageIndex": 569,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 22, 2008 12:55AM vhqh wrote: It's good to see everyone getting this wrapped up!  I've got 12 of 25 brain zaps done as of today, still working and only a little fatigue to deal with.  Saw the onc today and he had me go ahead and start the Tykerb, will continue the Herceptin, Zometa and Tamoxifen.  Both onc are completely thrilled with how well I'm doing, I hope to continue to surprise them!",
      "MessageIndex": 619,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 24, 2008 02:15PM vhqh wrote: I think it's something in the air....I have been super tired and functioning slower all week.  Funny thing is I keep accusing the gal I share an office with of having sympathy symptoms, she's having as much or more problems than I am!",
      "MessageIndex": 637,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 3, 2008 11:09PM vhqh wrote: I did the Look Good Feel Better program last week and I heartily recommend it also.  Walked out with a big bag of make up including Mary Kay, Clinique and Estee Lauder plus a wig that looked good on me.  All they ask with the wig is that I return it when I no longer need it.  I hadn't even decided if I was going to get a wig this time or not, I didn't the first time I lost my hair but I knew for sure it was coming back that time, this time I don't.  It will be nice to try it out and see if I can tolerate wearing one before dropping $$$ for the much more expensive one I picked out",
      "MessageIndex": 731,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 7, 2008 11:13PM vhqh wrote: Ohhh yeah, I'll take the bartender........Thanks Nancy! Finally done, 50 zaps total, also got my Herceptin today.  Had plans to buy tires and do some shopping after but came home and napped on the couch instead.....maybe tomorrow I'll get some things done.  Barring any problems before hand I'll do scans in December to see how well the WBR worked.  Restarted the Tykerb today too, dropped it to 750 mg and split it up, 2 in the morning and 1 at night.  I'm hoping that if I can tolerate it at this level, maybe I can bump it back up to a full dose later.  It's going to be weird not leaving work every morning to go get zapped, I've been doing it since August!",
      "MessageIndex": 756,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 2, 2008 11:39PM vhqh wrote: I worked a horribly stressfull and underpaid job for 9 years, at the same time I was primary caregiver for my mother who has dementia, couldn't get a full nights sleep and never knew when my boss would pull some stunt on me.  Was finally forced to put Mom in a home and moved on to a much better job in a different department, 33% pay increase and way more appreciation for the work I do, after 2 years I get diagnosed.  I've long suspected this contributed and I believe they have scientific evidence that stress is a risk factor for cancer.",
      "MessageIndex": 21,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723726",
      "Title": "Does desperation play a role in developing breast cancer? HeatherBLocklear dlb823"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 29, 2008 10:21PM vhqh wrote: I also started a week ago Thursday, round number 7 today, I will be having 28 tx and 5 boosts.  No problems or side effects yet, I have been a little tired but I'm not sure it's treatment related or allergies or just staying up too late...... :) I would suggest not buying anything in advance until you find out exactly what they are going to allow you to use.  I was told absolutely no bras after the 1st tx, onc really frowned on my prosthesis which was a lightly weighted swim puff.  No creams or gels or deodorant other than 100% corn starch, clean and dry is the goal.  Nothing, including corn starch, before treatment as any residue will aggravate the skin reaction.  When I start having problems they will give me what they want me to use.  I was given no instructions regarding what soap to use although I did go ahead and buy some Dove. Simulation didn't take too long, maybe 30 minutes on the table.  My only problem was a crick in my neck from having to lay still with my head turned to the side.  The xray machine is built into the radiation machine but on a separate \"arm\", they will move the arms around you while you lie on the table.  Be prepared for ink transfer from their artwork.  Also don't be surprised if they turn the lights on and off, they use lasers mounted on the walls and my tattoos to line me up in the same position each time.  For the actual treatment a very flexible rubber like mat is laid on my chest \"to concentrate the radiation\".  Treatment is quick, I am in and out in less than 15 minutes.  They were able to work with my schedule, I go to work at 6:30, leave for treatment at 8:15 and am back before 9:00.  This meshs with my daily routine perfectly.  On Thursdays I see the radiation onc, I Wednesdays I have a CBC drawn. ",
      "MessageIndex": 28,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 29, 2008 12:48AM vhqh wrote: This will be my last week, all boosts, and then I'm done, MAYBE!!!  Got a bad CT scan, am still waiting on the PET and MRI results to see where we go from here but more radiation is certainly a possibility.  I was also thinking it was going to be weird not going in every day but I would certainly have preferred that to doing more rads.  Skin has been much more tender and ouchie this weekend, got zapped Friday morning then they immediately pulled me in for my Herceptin.  I forgot to put my aloe in my pocket before leaving the house but didn't worry thinking I would just put it on as soon as I got home.  Before I got home the PET center called and moved my appointment up so I had to leave immediately to get there.  By time I got home hours later I could tell that not getting the aloe on right after treatment had made a big difference.",
      "MessageIndex": 354,
      "PostDate": "29/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Dec 10, 2008 01:45AM vhqh wrote: I've been down with some weird virus for the past week, stomach was queasy all last week but I blamed it on the Tykerb, then the chills started and finally the fever came Sunday night.  Of course by then I'd exposed all my family and coworkers thinking it was only SEs! Fever finally came down today and I'm going to try working at least part of a day tomorrow.  Weird thing is that it was exactly 1 year ago to the day that I came down with the flu during chemo! ",
      "MessageIndex": 849,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 1, 2008 07:19PM vhqh wrote: I'm getting the bolus every day, tomorrow will be day 8 for me.  I am not doing reconstruction but I know that they demand you wait a minimum of 6 months and some say as long as a year to do it. ",
      "MessageIndex": 52,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 15, 2008 06:44PM vhqh wrote: My rad onc hasn't billed for any copays, I was really afraid because my copay is $40 and that adds up in a hurry.",
      "MessageIndex": 797,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 30, 2009 04:10AM vhqh wrote: I finished WBR the first week of Nov with no problem till December when I came down with a virus that was circulating at work and I got the dreaded delayed fatigue side effects.  2 antibiotics later, half the month off work and I'm feeling pretty good again.  As an added boost to my disposition my hair is starting to grow finally!",
      "MessageIndex": 897,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 31, 2009 02:53AM vhqh wrote: Work is going good although I'm picking a fight right now.  I work Mon-Thurs, they signed me up for a 2 day training class on a Thursday and Friday, I have treatment scheduled for that particular Friday.  My solution.....be gone for 2 1/2 hours for treatment.  Their solution ..... drive 30 miles to another facility the following week for the training as my absence for that short time period may interfere with their team building interactions!  Negotiated compromise is for me to go get my blood draw Thursday before training, get the Zometa Friday during lunch, return to training with tubes hanging off my port and then after training ends Friday I return to the center to get Herceptin.  I could easily put treatment off until Monday but I'm just being stubborn and obnoxious about being forced to go to training plus I'd have to use leave time that I'm trying to conserve for when it's truly needed. Oh, and did I mention the training has absolutely no bearing on my work duties?  But I am classified as unit team on a technicality so I've got to do it even though I will NEVER use it.  Nice thing is that my chemo nurse is the wife of one of the big bosses, she was not impressed.",
      "MessageIndex": 902,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 19, 2008 04:01PM vhqh wrote: #21 down today, some fatigue and quite a bit of redness but I started using aquaphor and an aloe gel last weekend and the tenderness has been much better this week. Had a busy morning getting an echo, CT and bone scan prior to radiation, even though I didn't have a set time for radiation the techs were right there holding the door open for me when I walked in!  It's a small satelite cancer center and I really like it, the main center in the city is just too big and busy for my tastes.  I have 2 female and 1 male tech, one of the females just came back from an extended leave so for the most part the male has been in there.  Like someone else already said, I'm getting so used to baring it all that I have had to remind myself to finish buttoning up my shirt before walking out of the dressing room.  It's kind of funny but I am not nearly as selfconcious about the unreconstructed mastectomy side as I am about the good \"natural\" side. My radiation doc has been very insistent that I'm not stage IV because no biopsy was done and the met wasn't seen on the prior bone scans, I wonder what she'll say about todays scan as it lit up much more brightly.  I'm also curious to see what the radiologist who reads the scan is going to put in his report since he has repeatedly ignored it in the past when it was only faintly seen. For those who worry about the time between chemo and rads, it was 6 months for me.  I finished chemo in February, waited 3 months then did scans to see if I would remain stable, finally got the mastectomy done July 1st and started rads in August.  I'm actually about 1 week away from my 1 year anniversary!",
      "MessageIndex": 246,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 21, 2008 05:14PM vhqh wrote: Maybe I'm just strange but I think the aloe gel has acted as a deodorant for me, anyone else notice this?  I've done pretty good at keeping it under control but every now and then I've noticed slight odor during rads, I put the aloe on afterwards and have not noticed any odor for the rest of the day.  It is 100% aloe, the stuff that Walmart stocks with no alcohol.",
      "MessageIndex": 258,
      "PostDate": "21/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 4, 2008 02:28PM vhqh wrote: I wish I could say I was all done!  We did scans 2 weeks ago and new mets showed up so I start a new round of 25 zaps Monday.",
      "MessageIndex": 415,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 9, 2008 07:31PM vhqh wrote: Hey all, I'm still doing good!  Round 4 of 20 whole brain rads today, absolutely no side effects as of yet and I am still asymptomatic.  It's certainly something different to experience, face mask is locked down to the table, head can not move, flash of blue light if I keep my eyes closed and I smell bleach during the zaps.  Only abut 15 seconds per side so it really goes fast..  Got me a new work ID made today, wanted one with my cute curly hair before it falls out again, maybe permanently, old one was done shortly after my hair was coming back in from chemo, with the lighting and the green shirt I was wearing all I needed was the stumpy ear posts to look like Shrek!  We're going to play a joke on my supervisor, start out with obviously misspelling a word or two on an email, next email misspell 3 or 4 words, then go to 8 or 9 words and drift off into some completely weird and off subject like I'm completely losing it.......he'll kill me when he figures it out but it was actually HIS boss that came up with the idea! Saw the rad onc today, she prescribed some silvadene for my neck and mastectomy area, it's not weeping and only one raw spot (from a tick bite I got the first week of tx) but it is still very red and tender 9 days post tx.  Quite a bit of peeling going on too.",
      "MessageIndex": 467,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 6, 2008 09:37PM - edited Jul 6, 2008 09:41PM by vhqh My initial CT showed liver lesions, the bone scan was clean.  They then sent me for a PET to check the status of my liver, those lesions appear to be benign but a met in my femur lit up.  A MRI was done which showed severe thinning in my femur, this thinning was proved to be false by an xray.  The second PET scan did not get a clear look at the femur due to generalized tissue uptake in the thigh, probably due to having walked all over the hospital trying to find where they moved the PET machine to, I guess they are serious when they say not to exercise a day or two beforehand.  My personal opinion is to get all the scans you can done, this beast is a sneaky devil and the more ways you look for it the harder it is for it to hide. I don't have a whole lot of confidence in my radiologist, not once has he commented on a femur lesion on my CT yet they guy who read the second PET made reference to the met appearing to correspond with a lesion visible on the CT?!?  On both bone scans I was able to look at it on the computer and noticed a lighter area where this met is, the radiologists admitted that there was \"in retrospect\" some uptake on the first bone scan but gave no indication of seeing it at all on the second, to my untrained eye I could see it much clearer on the second scan.  Needless to say I am giving strong consideration to driving to a much bigger hospital for my next round of scans just to get a different set of eyes reviewing them.",
      "MessageIndex": 12,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708355",
      "Title": "CT, bone scan, xrays and progression... katie11 Tracy1964"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 10, 2008 07:11PM vhqh wrote: I'm glad you've got her going in and even happier to hear she is feeling a little better.  Waiting until the day of treatment to address a problem isn't good as it might interfere with her receiving treatment when maybe it could have been addressed and cleared up beforehand. ",
      "MessageIndex": 9,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708809",
      "Title": "Need Prayers for mom... cneal318 TripleNeg"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 20, 2010 09:55AM vhqh wrote: Kansas, born and raised.",
      "MessageIndex": 86,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753351",
      "Title": "Where is everyone from? shelbyjane72 BarbaraA"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 7, 2009 12:51AM vhqh wrote: Wonderful News!!!!!!!!!",
      "MessageIndex": 1,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726908",
      "Title": "Happy ..No Brain Mets.. Stefanie LuAnnH"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 12, 2008 11:55PM vhqh wrote: Day 16 for me today.  Had a bit of a sore throat last weekend and was told no way could it be the rads, somehow I'm not convinced... :)    Started getting a little pink this week, have had some \"pangs\" from time to time plus I'm beginning to get tender but nothing that is intolerable.  Doc is just thrilled at how good my skin is holding up and told me to continue using corn starch, nothing else.  Rad tech doesn't seem to share her opinion and gave me some aquaphor samples today.  I decided to go ahead and use aloe during the day and the aquaphor at night this weekend as I was feeling a little heat the last couple of days.  Got chewed out last week for losing 2 pounds, I was weighed the time before with my work radio clipped on my belt which weighs at least a pound and last week I had left it in the truck.  I was only down 1 pound this week so my doc wasn't soo upset, I didn't bother to point out that I had the radio back on this week so I was actually down at least 2 more pounds.  I'm not trying to lose, I'm just making the effort to eat healthier.",
      "MessageIndex": 161,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 11, 2008 05:04PM vhqh wrote: KAK - I've actually told several people that I have it made, I have my get out of trouble free card, if I screw anything up I can just blame the zaps!  Nancy - I think you've come to the same conclusion I did, letting it dry out a bit may be best.  I have been using a little silvadene on it as needed and I think I'm making progress.  Some of that new skin is certainly a little tender though, some spots still seem to be cooking some too!",
      "MessageIndex": 490,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 27, 2008 07:25PM vhqh wrote: Rose - I have been on tamoxifen since February of this year.  I have had minimal side effects.  If you are basing your decision based on negative side effects others of us have reported, be aware that we talk about what goes wrong, rarely do we talk about what goes right.  I had hot flashes at first but they had faded away less than 4 months later.  The risk of uterine cancer is actually rare.  I would suggest you consider giving it a try to see how you get along with it before writing it off as not worth it. ",
      "MessageIndex": 664,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 1, 2008 05:49PM vhqh wrote: Your not entirely alone, I have 5 boosts left to my WBR and will finish up next Friday.  Had a little skin breakdown sneak up on me behind my ears, guess I shouldn't have been lazy and used my contacts Thursday instead of wearing glasses all day.  Also had a reaction to Tykerb plus some unidentified pain that we strongly suspect may be connected to a large ovarian cyst, all in all not a good week for me.  Started a steroid pack for the reaction which they said might help the pain also, so far so good, rash is drying up and pain is gone!  I'll check back in with the chemo nurses Monday when I get my zap and may have to see the onc Tuesday.  I did go to a ACS \"Look Good Feel Better\" meeting this past week and I highly recommend them, I left with a big bag full of make up including name brands such as Mary Kay, Estee Lauder, Clinique, plus application tips and tricks.  Also walked out with a brand new wig!  I highly recommend this program for everyone, there were only 5 in my group but we ranged in age from 30 to 60 and it was a wonderful experience for all.",
      "MessageIndex": 715,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 18, 2008 01:50AM vhqh wrote: My copay appears to have worked out like Nancy's, the difference with mine is that I first saw the rad onc back in Nov 2007 and that is when I paid the single copay that I have received a bill for.  I was subsequently found to have mets so I did chemo before surgery to clean up the margins and it was August before we got around to doing the rads.",
      "MessageIndex": 807,
      "PostDate": "18/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719767",
      "Title": "SEPTEMBER 2008 rads group NancyD NancyD"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Apr 13, 2008 07:30PM vhqh wrote: Mine elevated a little during chemo, from 39.5 up to 45 but dropped down to 19 on the first check after chemo was completed and tamoxifen started.  The rise didn't worry me as I knew it was not unusual for that to happen during treatment.",
      "MessageIndex": 5,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703829",
      "Title": "Anyone have markers go up but tumors go down? tooyoungtohavebc Member_of_the_Club"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 27, 2008 01:13PM vhqh wrote: The end of my drain was poking at the end of my incision a little by the 8th day, there was also several occassions when it pulled on the stitch holding the drain in, other than this there was no pain at all with the drain and what I did feel with these problems were more of an annoyance than a pain.  When he pulled the drain I felt nothing other than a little tug on the stitch as he cut it, I was actually surprised when he said all done. I wore some button down shirts with chest pockets and tucked the drain in the pocket on my mastectomy side running the tubing out through the placket.  There was 2 to 3 inches of tubing exposed but it wasn't very noticeable and it was very comfortable for me.",
      "MessageIndex": 16,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720042",
      "Title": "How long do drains stay in? HeatherBLocklear new2bc"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 12, 2009 01:31AM vhqh wrote: My femur met did not show up on a bone scan, it did light up on the PET.  An MRI showed severe bone thinning that was proven to be false by an xray.  The xray also confirmed the met.  Somewhere I have read that an xray is one of best ways to diagnose a bone met.",
      "MessageIndex": 5,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741909",
      "Title": "Testing to make sure it's bone mets? Chelee joaniji"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Mar 15, 2009 03:07PM vhqh wrote: At my initial diagnosis the radiologist went over my scans with me briefly.  My regular onc usually just goes over the report but I know when they found the brain mets he went over them with the radiologist.  So, long story short, if there is a significant finding he looks at the scans himself.",
      "MessageIndex": 11,
      "PostDate": "15/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730709",
      "Title": "Onc's review of scan pics Bonnielv vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Apr 30, 2008 12:08AM vhqh wrote: I live only minutes from my cancer center but I have had to drive the their main office a couple of times which is about a 45 minute drive.  I had no problem driving myself to and from chemo, if you are the type that gets very sleepy on Benadryl I would recommend a driver as you often get that with the chemo.  I didn't start feeling poorly until the 2nd or 3rd day after.  Frequency of treatments vary depending on the chemo drugs you get, I was on a once every three week program, two week programs are common also.  Plan on spending hours getting your chemo, mine averaged 4 1/2 hours, again this will depend on which drugs you get.",
      "MessageIndex": 3,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704685",
      "Title": "Rural Living cinnabar vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 22, 2008 06:14PM vhqh wrote: I read that article earlier and I think they focused too much on death rates instead of the number affected.  They mentioned pancreatic cancer but how many people do you know that are actually diagnosed with it?  Yes the prognosis is very bad, but I've only known of a couple of people who had it, I have no idea how many people I know with breast cancer but it is a bunch.  Quite frankly, even if the bulk of the money goes to breast cancer research, that doesn't mean that all the other types of cancer doesn't benefit, chemo drugs are often effective against more than one type of cancer.",
      "MessageIndex": 2,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723236",
      "Title": "Breast Cancer hogging the spotlight Fitztwins magsandmattsmom"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 7, 2008 12:59AM vhqh wrote: I have confidence in my surgeon and onc but the radiologist has me concerned.  The guy who read my latest PET at a different hospital makes reference to a lesion in the area of my met that is visible on the CT yet at no time has the radiologist who read the CT picked up on anything in that area.  After the PET picked up on my met, he admitted that the first bone scan showed there was faint uptake visible at the site of the met yet makes no mention of any met at all on my second bone scan.  Really funny part is that my untrained eye could clearly see something visible on the screen in that location.  There has just been too many discrepancies to inspire much confidence.  It is a small hospital and the one radiologist signs off on all reports, I'm strongly thinking of going to the big hospital 30 miles away for my next set of scans just to get a different radiologist.",
      "MessageIndex": 15,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/707607",
      "Title": "Anyone ever think about getting a 2nd path opinion? BustersMom drcrisc"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 25, 2008 12:55PM vhqh wrote: Mine was out on day 10, it had only gotten down to 25cc for the prior 24 hours, surgeon just commented it had been in long enough and pulled it. ",
      "MessageIndex": 4,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720042",
      "Title": "How long do drains stay in? HeatherBLocklear new2bc"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 19, 2008 11:13PM vhqh wrote: I would also recommend seeing someone who specializes in breast cancer.  False negatives are possible as are false positives, no test is infallible.  From the inflamation responding to the antibiotic, I would be more inclined to say it is infection.  It does sound like your doc is taking this seriously though and doing a thorough job of checking it out.",
      "MessageIndex": 2,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723007",
      "Title": "any thoughts cheryls Jen3"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 3, 2008 12:05AM vhqh wrote: The big thing is that she MAY have cancer, until they do an actual biopsy they don't know for sure.  About 80% of lumps will back negative, so don't assume too much even though I know it's hard to do at this stage.  It sounds like you are both at one of the worst points, where you're scared witless and don't have any answers. About the only thing I can suggest right now is try and help your Mom out as much as possible to reduce her stress.  Run the sweeper or do some cleaning for her without being asked, help fix supper for the family or maybe see if you can take her out for some ice cream or a \"chick\" flick.  I'm sure you're busy with school but it doesn't have to be something big, just little things to let her know you are thinking about her and trying to ease things.  Whatever you do, don't let it affect your grades, I\"m sure she wouldn't like that at all.  Martha",
      "MessageIndex": 1,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/723793",
      "Title": "Hello to all, heres the deal. Shiconia Dukemom2"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 26, 2010 02:13AM vhqh wrote: I have a problem with urge incontinence, very strange characteristics though.  I can work all day in a prison cell house and do just fine despite the fact I have to go down a flight of stairs and get an officer in a control center to open two secure doors to get to a staff restroom.  I've had practically no problems what so ever at work.  Get me home though and it is all I can do to get down the hall to the bathroom, theres been a few times I didn't make it.  My current thought is that soda that triggers it, caffeine may be involved.  I used to drink nothing but Coke all day long but weaned myself off of it.  For a couple of years I was down to a single 16 oz bottle a day at work and now I may drink one or two a month.  I have noticed it seems like I have incontinence problems after drinking one of my occassional sodas but not so much with the clear lemon lime varieties. Absolutely no problem with pineapple, go figure.",
      "MessageIndex": 20,
      "PostDate": "26/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/754407",
      "Title": "WARNING: Tykerb and Pineapple juice does not mix!! Fitztwins kimmie68"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 30, 2008 01:35PM vhqh wrote: Although your sister may seem to be unreasonable, please remember that she is likely dealing with the same emotions you are but it does not sound like she is dealing with them well, lashing out at you may be the result.  Please don't let it get to you and don't feel guilty about it.  You are doing the best you can and that is all anyone can ask of you.  You're in a tough situation, does your son have any friends that he could stay with for a couple of days to free up some time for you to go to be with you Mom?  It's not the best of solutions but it would give you a little more time with her.",
      "MessageIndex": 9,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/723496",
      "Title": "Just been told my mum has weeks to live kazzyann TorchSong"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 11, 2008 05:25PM vhqh wrote: Mine were in the morning and it was nothing to eat after midnight, nothing to drink that morning but I could take my meds with a sip of water.  Drank the contrast, 1 1/2 cup saving half a cup for just before starting the CT, IV line was for an iodine solution and will give you a \"flush\" when injected.",
      "MessageIndex": 4,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722591",
      "Title": "What to do before a CT scan? YHong YHong"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 6, 2008 09:31PM vhqh wrote: I've nevery heard of a biopsy on a node, they are small and I would imagine it could be easily missed if they tried.  I would resign yourself to having it removed.  Whether or not your breast will still look good after a re-excision depends on a number of factors including how big it was to begin with, how big the tumor is and how much additional tissue they need to take out.  I was a D and looked just fine after the removal of a 2.8 cm tumor, someone with an A cup might not have as positive of an outcome.  They did not use the blue dye on me, I was injected with a radioactive tracer and yes, it stung for a few seconds but it wasn't intolerable.  My sentinal was positive and I ended up with 11 total being taken out, the steps you describe sound right on track to me. ",
      "MessageIndex": 2,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708609",
      "Title": "Does this sound right? ettelok 41yrpeachgal"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 11, 2009 10:57PM vhqh wrote: I was originally given a temporary one by my PCP.  When it expired in 6 months I asked my Onc about getting a renewal, he very willingly signed off on it but failed to check the box to indicate whether it was a temporary or permanent card.  Needless to say it somehow got marked permanent before I reached the DMV.",
      "MessageIndex": 5,
      "PostDate": "11/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740221",
      "Title": "Disability Placard Application Analemma DJ64"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 4, 2009 04:39PM vhqh wrote: I was diagnosed with brain mets in Sept 08, almost 1 yr to the day from my initial BC diagnosis. I finished WBR the first week of Nov 08, December scans showed a reduction in all the scattered nodules and no new nodules.  The 3 larger lesions (1.2 cm at the largest dimension) all reduced by 25 - 50%.  I have been asymptomatic throughout it and plan on hanging around for a long long time. I hope things go smoothly tomorrow! ",
      "MessageIndex": 25,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726659",
      "Title": "My holiday gift - brain mets Analemma badboob67"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 3, 2008 04:25PM vhqh wrote: I only have one drain, I'm wearing oversized button up shirts with chest pockets and putting the drain in one pocket, no more than 3 inches of tubing is exposed between the placket and the pocket although I wouldn't be comfortable with even that little bit of exposure in some situations.  This is keeping the tubing under control so I'm not catching it on things or having too much movement of the drain. ",
      "MessageIndex": 63,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699835",
      "Title": "Is there a \"packing list\" for surgery? Panchoandlefty lvtwoqlt"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 1, 2008 12:18AM vhqh wrote: These symptoms all need to be brought to the attention of your oncologist, they will need to be checked out.",
      "MessageIndex": 12,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720390",
      "Title": "Nottingham grade: III of III - Mottingham score: 9 of 9 daisyhope Denise2730"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 13, 2008 09:31PM vhqh wrote: Until your wife has the biopsy, you won't know for sure whether or not it is cancer, many highly suspicious lumps will come back benign so don't jump to any conclusions yet.  Your appointment with the surgeon will be to get the biopsy set up, he will go over things with you and get your wife's background medical information, be sure to bring a list of any meds she is on, both prescription and over the counter.  You're at one of worst points, when you don't any answers and don't know what is going to happen.  Don't hesitate to ask questions here, there are a lot of very well informed ladies here who would be happy to help.....Hang in there!",
      "MessageIndex": 6,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/724046",
      "Title": "Help me understand Ania mysoulmate"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 15, 2009 09:44PM vhqh wrote: 46 - stage IV from the get go.  I made the mistake of skipping a couple of years getting my mammos done.",
      "MessageIndex": 2,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 29, 2009 09:15PM vhqh wrote: Radiation will not cause hair loss unless they zap the head.",
      "MessageIndex": 3,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/728051",
      "Title": "Will hair fall out? CandyLuna vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Mar 8, 2009 04:19PM vhqh wrote: Many many prayers!",
      "MessageIndex": 19,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730236",
      "Title": "Slonedeb sending out prayers! LuAnnH VickiG"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 19, 2008 09:38AM vhqh wrote: I've only had a unilateral, I'm willing to lop the other one off but the doctors are balking and saying the insurance will be reluctant to pay for it.  My oncologist at least agreed with me that the first time a biopsy is needed on the remaining one we are taking the whole thing off.  My feelings are much like yours, I feel it would be easier to balance things out with both gone, my fear is that something would show up in the remaining one and then it would be chemo and rads again.",
      "MessageIndex": 21,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719436",
      "Title": "Need to decide one breast or two? catemarie catemarie"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 9, 2009 02:37AM vhqh wrote: I did not have clean margins with my lumpectomy, they found a met so sent me straight to chemo.  When I finally had my mastectomy 6 months after chemo, extensive flecks of IDC, DCIS and ALH was found to still be in the breast although it showed \"chemo response\".  No mention was made of doing any additional chemo but I did follow up with some pretty aggressive radiation.",
      "MessageIndex": 2,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726998",
      "Title": "Re-excision of lump and skin question.. Lynette vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "May 29, 2009 06:21PM - edited May 29, 2009 06:25PM by vhqh I don't know where your tumor is located but I assume it must be fairly close to the nipple since this is an issue with the doctor.  There are options with reconstruction for tattoos to replicate a very realistic nipple.  If it is feeling and sensativety you are concerned about, I would quiz the doctor about extensive the numbness will be or if she expects you to have any long term loss of feeling.  Most do have a significant lack of feeling regardless of whether or not reconstruction is done.",
      "MessageIndex": 18,
      "PostDate": "29/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/734948",
      "Title": "Refuse To Do Surgery makingway nelia48"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Dec 23, 2008 11:26PM - edited Dec 23, 2008 11:28PM by vhqh Take it one step at a time.  Research, both here and other sights.  If I relied on my doctor to tell me what I needed to know I wouldn't know anything because I wouldn't know what questions to ask.  I can say that there are studies that have shown a better prognosis if the primary cancer is removed.  As for the ovaries, that depends on your individual situation, I still have mine and taking them out really hasn't been discussed however chemo threw me into menopause. Are you having bone pain or are the mets causing any problems?  Usually rads are only given to the bone if there is problems associated with them. Don't ever apologize for asking questions here, that's what we are all here for!",
      "MessageIndex": 1,
      "PostDate": "23/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726310",
      "Title": "Don't know what to do lovinmomma saint"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "May 23, 2009 12:13AM vhqh wrote: I've never had much pain with my one bone met.  I started off monthly but recently switched to every 6 weeks.  Onc initially thought to go to every 8 weeks but switched it to 6 weeks so it would fall on the same days I get Herceptin. ",
      "MessageIndex": 10,
      "PostDate": "23/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734510",
      "Title": "How often do you get Zometa infusion? meima-Bev marieibrahim"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 26, 2008 12:19AM vhqh wrote: I get scans about every 3 months and I think this is considered standard for stage IV, I've read of some who have choosen to stretch this time out but even then the longest I've seen was 6 months and that was after several years of NED.   I get a CT along with the PET as they like to compare the 2, could they possibly have you scheduled for a PET/CT?  You get both scans at the same time with this machine.  My brain was scanned in Oct 07 but not checked again until Sept 08, however I am HER2+ which tends to go to the brain more frequently.  Most brain mets tend to be diagnosed after symptoms become evident.  Skull mets should show up on either the PET or bone scan.  Martha",
      "MessageIndex": 1,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723390",
      "Title": "Frequency of Scans/Tests rkt vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 26, 2008 05:21PM vhqh wrote: Anything below 38 is considered good for a CA 27 29, small fluctuations are normal, an overall upward trend would be of concern.  PET or CT either one will look at your liver, since your schedule says PET/CT I would bet you are getting the combined version which is better than the separate ones.  It doesn't surprise me that the instructions just refer to PET since the restrictions for PET are far more stringent than that for a CT.  The CT provides a clearer picture, the PET detects activity.  My first CT detected liver lesions, the subsequent PET showed that these were benign.  PET is also limited in the size of the activity it can pick up on.  My theory is to look at the big picture, my CA 27-29 is at 13.5 yet I was just diagnosed with brain mets.  CT and MRI picked up on them, largest was only 1 cm and the PET did not detect it.  The bone scan repeatedly missed my femur lesion until it started healing, PET scan picked it up every time until now that it is healing.  MRI showed severe thinning in the bone, plain old xray proved this to be false.  All tests have their limitations, you have to look at everthing within context.",
      "MessageIndex": 9,
      "PostDate": "26/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723390",
      "Title": "Frequency of Scans/Tests rkt vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 5, 2008 06:21AM vhqh wrote: Many prayers for a clean MRI!!!",
      "MessageIndex": 2,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/722270",
      "Title": "Scared that I have brain mets mollyboc ilovemysweetmomma"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 27, 2008 02:18PM - edited Aug 30, 2008 10:58AM by vhqh I had the exact same treatment, ended it in February after 5 rounds due to the good response.  I did chemo on Thursdays and got the Nuelasta on Friday.  The first round I started feeling a little down on Sunday but worked half days Monday and Tuesday, resuming a full day schedule on Wednesday.  Round 2 was a disaster as I came down with a flu bug right after treatment and was off work for the entire following week.  By round 3 the fatigue was setting in pretty good and I took Monday and Tuesday off, rounds 4 and 5 I took Monday through Wednesday off the following week.  After the 5th round it literally wiped me out just to take a shower.  Although queasy at times, full blown nausea was limited to only a couple of isolated incidents.  I had very little tingling and the only constipation came the week I had the flu so who knows what caused which symptoms.  I will be getting the Herceptin indefinitely but I've not had any side effects with it.  edited to add - I really could have worked most of the days that I took off other than the week I had the flu but I had plenty of leave time on the books so I didn't push myself to go in. ",
      "MessageIndex": 1,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720113",
      "Title": "taxotere & Carboplatin, herceptin Maggie63 Deedee79"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jun 9, 2008 12:17AM vhqh wrote: I take Caltrate 600 D, twice a day for a total of 1200 mg calcium and 800 mg vitamin D3.  This meets the levels my oncologist wanted me to take.  ",
      "MessageIndex": 4,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706795",
      "Title": "Calcium janmarie vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 10, 2008 08:45PM - edited Nov 10, 2008 08:46PM by vhqh I've already been told that if there is any progression Xeloda will be the chemo added because it does appear to cross the barrier.  There is some thought now that the mets themselves can open up pathways for some of the other chemo drugs to cross the barrier where ordinarily they don't. ",
      "MessageIndex": 2,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724189",
      "Title": "Xeloda for brain mets HeatherBLocklear VickiG"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 7, 2008 11:17PM vhqh wrote: I didn't lose taste but I did get a very sore throat several times.  I also got chomped on big time by the rad onc any time my weight was down by even a pound. ",
      "MessageIndex": 1,
      "PostDate": "07/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/724096",
      "Title": "Taste Buds NewToCancer Westie"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 25, 2009 10:43PM vhqh wrote: This next round of scans, my onc wants to see the CT and MRI before ordering a PET.",
      "MessageIndex": 5,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729735",
      "Title": "MRI Questions.... lovinmomma lovinmomma"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 21, 2008 09:04PM vhqh wrote: I have horses also, currently down to 7.  I don't have stalls, 2 were on a small pasture and the balance were on dry lot.  I live in town, the horses were 15 miles out on the farm.  Prior to diagnosis, I went out daily to grain and check them.  Hay is big round bales and I have my own bale buggy to move them with.  After diagnosis I adjusted things considerably in how I care for them.  I would put 2 bales out at a time for the ones on dry lot, this would last them for about a week.  Daily trips out were eliminated, depending on how I felt I went either every other or every third day.  Grain of course was cut back to small amounts on the days I went out but they had hay access 24/7.  The neighbor I bought the hay from voluntarily started delivering and setting out the hay for me at no extra charge after the exhaustion from chemo set in.  The two on pasture were older horses that really needed the extra calories grain could provide but I started putting out Chrystalyx lick tubs and they did good on them.  This was winter time, I started chemo in November and finished it in February of this year.  I am in Kansas which of course has considerably different weather than Florida.  The drastic reduction in care I made may seem neglectful to some but this is ranch country and a pretty common level situation.  Horses evolved to eat forage and can generally get by just fine with free choice good quality grass hay which I made sure that they had.  Due to the escalating price of gas and feed, I have not returned to daily trips out and feeding grain.  I am single and live alone, having the horses depending on me forced me to get out and get exercise, even when I didn't feel up to doing much.  I really didn't worry about the possibility of infection from the horses, the people you have everyday contact with are a much bigger threat.  Of course I wore good foot wear, I don't think I'd want to run the risk of stepping on something in flip flops while on chemo.  I also showered as soon as I got home.  Unless you have family or someone else who can help you, I would strongly recommend you figure out a minimum level of care acceptable to maintain your horses health with the facilities you have available.  Also figure out what to eliminate first if needed.  This way, as you progress through treatment you will already know what steps to take as you go should the side effects start getting you down without the stress of trying to figure out what to do.  I cannot give you any lymphadema advice as I have had no problems, I do try to avoid repetetive movement on that side but that's it.",
      "MessageIndex": 8,
      "PostDate": "21/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722958",
      "Title": "Horse Care and Chemo Lisa1964 vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 15, 2008 12:18AM vhqh wrote: I agree with the advice to find a new onc.  Your current one isn't treating you as an individual and that is adding stress to your life.  Stress can be a contributing factor to health problems and none of us need any more stress than what we have already.",
      "MessageIndex": 13,
      "PostDate": "15/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/721143",
      "Title": "I have Doctor Depressing,, I need your input LynnW Monique42"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Dec 19, 2008 10:52PM vhqh wrote: Mine have been about every 3 months but I have not ever reached the point of being stable long term. ",
      "MessageIndex": 3,
      "PostDate": "19/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726132",
      "Title": "Frequency of PetScans for Bone Mets dragonfly mom2acat"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 30, 2008 03:21AM vhqh wrote: I am currently in radiation and wearing bras has been forbidden.  It is really amazing but people don't notice that I'm lopsided.  We are self conscious about it and think everyone is staring but I've yet to catch anyone looking other than those I had just said something to about it. ",
      "MessageIndex": 10,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/720273",
      "Title": "lop sided for 6-8 weeks - help Viktoria vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 4, 2009 09:28PM vhqh wrote: If you have a lumpectomy you will need radiation, with a mastectomy you may not have to do radiation but I suspect with you having it in your nodes they will still want you to do the radiation.  I had a lumpectomy but the margins were not clean, then they found the met so I went straight to chemo.  After chemo I had a mastectomy followed by radiation.  Don't be afraid of radiation, it is doable, biggest complaint seems to be fatigue. Usually they will not do a MRI unless they are targeting a specific area.  Every 3 months I have had either a full body bone scan or a bone survey, CT of the chest, abdomin and pelvis and a echo cardiogram (HER2 +++).  Every 6 months I have a PET done.  Not all doctors believe in PET scans, they do have a high rate of false positive readings.  Since the diagnoses of brain mets in September, a MRI of the brain has been added to the 3 month cycle.",
      "MessageIndex": 8,
      "PostDate": "04/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726688",
      "Title": "Questions from a first timer lovinmomma lovinmomma"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 31, 2008 06:17AM - edited Aug 31, 2008 06:20AM by vhqh I live alone and have gone through a lumpectomy, chemo and mastectomy with very little help.  I have family and friends willing to help but I didn't feel I needed it too much other than driving to the hospital and back for surgery.  The biggest help I accepted was from my hay supplier, I have horses and it was last winter when I did chemo.  He delivered and set out hay for me and refused my offer to pay extra for the delivery.  Living alone and NOT being known as the greatest housekeeper, it was no big deal if the dishes didn't get done for a couple of days or the sweeping wasn't done.  Chemo was the worst thing that got me down and even then I functioned pretty good, working full time except for the first week following treatment when I usually took part of the week off.  I drove myself to all my treatments and would have driven myself to surgery if they would have allowed it.  I did not have reconstruction though, from what I understand you would be much more limited after surgery than I was after my simple mastectomy.  Here we have a \"General Public Transportation\" van that you can set up transportation to and from things like doctors appointments and grocery shopping.  It started out as a senior citizens service but I believe they had to open it up for everyone due to discrimination laws.  I know of some local churches who have volunteers that will drive people to doctors appointments also.  Where I work our Wellness Committee would have stepped up to provide transport if I needed it plus I had several coworkers who would have done it in a heartbeat if I asked.  I am in a smaller city, population 15,000, we do not have taxi service or bus servince running regular routes. Talk to the people at your cancer center or your hospital social worker to see if there are any organized groups in your area.  Also contact your local chapter of the American Cancer Society, they have monthly support groups here.  Don't panic about doing this alone, it is doable and actually can have it's advantages, sleep when you want to, don't clean if you don't feel like it, etc. ",
      "MessageIndex": 4,
      "PostDate": "31/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/720390",
      "Title": "Nottingham grade: III of III - Mottingham score: 9 of 9 daisyhope Denise2730"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 4, 2008 12:14AM vhqh wrote: The one underneath you sounds like they are targeting the nodes located underneath your clavicle, that's how they zapped mine and I also had 5 positive nodes.  The rubber sheet is a bolus.",
      "MessageIndex": 4,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/722241",
      "Title": "just starting SQL Kleenex"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "vhqh wrote: This week I finally made time to attend this program after a year of dealing with cancer.  I regret that I didn't get in to one sooner and would highly recommend it to everyone.  I left with a big bag full of makeup, mostly name brands such as Mary Kay, Clinique and Estee Lauder.  They also had a nice selection of wigs on hand and most of us found one that looked good.  All they ask is that the wig be returned to them when it is no longer needed.  The cosmetologist who did the presentation was very good, had past modeling experience and was able to give many good tips for both make up and hats.  Again I highly recommend this program! IDC, er+/pr +, her2 +++, stage IV Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/723744",
      "Title": "ACS \"Look Good Feel Better\" vhqh vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 18, 2008 06:38PM vhqh wrote: I agree 100% that it is an individual decision and we should all respect each others views and decisions.  I am one who wants to throw everything possible at it but then I am also very high risk.  I might feel differently if I was only stage I.",
      "MessageIndex": 9,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/719522",
      "Title": "RADIATION INCREASES SURVIVABILITY OF HIGH RISK PATIENTS. worriedhubby MarieKelly"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 6, 2008 12:50AM vhqh wrote: Bumping this back up as I feel there is some good info here for those with surgery coming up.  I am 4 days out from a unilateral mastectomy, no reconstruction or nodes, I'm doing good but no showers until the drains come out.  I bought a terry wash mit and a ramie covered sponge for general clean up and keep Cottonelle wipes by the toilet.  As a final step I use cotton makeup pads or cotton balls soaked in rubbing alcohol on my underarms, this seems to have eliminated any odor issues from not being able to use deodorant.  Hair is being washed at the kitchen sink using the spayer and Nuetrogena shampoo.  This shampoo is one that rinses out quickly and cleanly, leaving no residue.  My hair is still short from chemo and that has helped make it easy to care for. ",
      "MessageIndex": 14,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/706721",
      "Title": "Toilet Items suggestions for after surgery Young79 Iamblessed"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 18, 2008 05:44PM vhqh wrote:",
      "MessageIndex": 14,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/719640",
      "Title": "AUGUST/SEPT SURGERIES?? harmonysun museumlover"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 25, 2008 08:11PM vhqh wrote: I am doing Tykerb and Herceptin, haven't been on it long enough to say whether it's working or not.  September scans found brain mets, the single bone met was already healing at that time.  Because Tykerb is believed to penetrate the brain, we added it (1000 mg) in October while I was doing WBR, was on it for a week and had to quit due to a skin rash and abdominal pain.  Got the pain under control, it appears to have been unrelated, and we restarted the Tykerb at 750 mg November 1st.  So far so good, slight acne like rash and it makes me a little bit gassy but no other serious problems.  I'll do scans in December, with the WBR it'll be hard to say what did what assuming the scans show improvement.",
      "MessageIndex": 6,
      "PostDate": "25/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/725018",
      "Title": "That Dreaded Word...Progression AusAla faithandfifty"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 17, 2010 04:13AM vhqh wrote: I think the reason the time frames don't match up between COBRA and Medicare qualification is that COBRA was not designed just for those people who are waiting until they can qualify for Medicare.  It was designed for people who lose their jobs, whatever the reason is.",
      "MessageIndex": 18,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/746302",
      "Title": "Rant about insurance and COBRA mom2acat MiracleMileM"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Feb 26, 2009 04:21AM vhqh wrote: At my initial diagnosis, I passed a bone scan with flying colors but the CT showed liver lesions so a PET was done.  Liver did not light up but a femur met did.  In retrospect, I was having pain in that spot when my 16 lb cat stood on that spot but no other symptoms, I would never have connected that pain with cancer without knowing the met was there.  It took a year for the bone met to light up on the bone scan to where the radiologist would catch it although I could see it, I guess he had been dismissing the slight uptake as urine spillage!  (whatever that means) When I was diagnosed with brain mets a year later it was a fluke, my onc ordered a brain CT simply because it had been a year.  I was asymptomatic at the time and have remained asymptomatic.  I consider myself very lucky to have had them find the b9 liver lesions, otherwise I would have been misdiagnosed as stage III.",
      "MessageIndex": 6,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729701",
      "Title": "Scans Results kim40 RetrieverMomNancy"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jan 8, 2009 07:16PM vhqh wrote: I'm on Tykerb and Herceptin now for my brain mets, my onc stated that with any sign of progression anywhere we will add Xeloda because it is believed to cross into the brain.",
      "MessageIndex": 5,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/726968",
      "Title": "Xeloda for Brain Mets? ilovemysweetmomma vhqh"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 22, 2008 08:16PM vhqh wrote: Agree that there is no such thing as a 100% guarantee.  Breast cancer does not always come in the form of a lump, lobular tends to grow in \"sheets\", inflamatory  is more like it's name.  Any unexplained change in your breast needs to be checked out, whether it be an itchy swelling, a lump, skin fixation, nipple inversion, an orange peel appearance, discharge, ect. ",
      "MessageIndex": 5,
      "PostDate": "22/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723191",
      "Title": "Questions mpieterse Member_of_the_Club"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 19, 2008 02:04AM vhqh wrote: Don't listen to the radiologist, wait until you talk to the surgeon. ",
      "MessageIndex": 1,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/709176",
      "Title": "BC lump adjacent to nipple - surgical options mommy3abm Beesie"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 7, 2010 12:47AM vhqh wrote: I don't get on here very often and just found this.  Many many prayers for continued healing!!!!",
      "MessageIndex": 115,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/757424",
      "Title": "Today was frightening day Kimberly is in ICU dhmeiser RobinWendy"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 4, 2008 12:09PM vhqh wrote: I was put under what they called \"twilight\" sedation for my port placement, I don't remember a thing about it.  They were strapping me on the table (good thing I am ok with restraints!) and then I woke up in recovery feeling fine.",
      "MessageIndex": 1,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/708521",
      "Title": "Are you awake or asleep? snoopygirl karen1956"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Oct 27, 2008 02:28AM vhqh wrote: Many many prayers for your Mom.  I was diagnosed with brain mets last month, added Tykerb to my regimen this week, so far it has been very doable.",
      "MessageIndex": 5,
      "PostDate": "27/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/723192",
      "Title": "Vision Deterioration & Aromasin lemon_acosta LumiPojo"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 3, 2008 09:17PM vhqh wrote: I also take Citracal, my onc told me to take at least 600 mg calcium and 400 iu vitamin D.  He started me on it at the same time as he started me on Zometa, this was midway through chemo so yes, it can be taken with chemo.  What foods that taste good during chemo can vary between people, I did pretty good eating brocoli with cheese sauce, sweet corn, homemade veggie soup and yogurt with cherries. ",
      "MessageIndex": 5,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720584",
      "Title": "Calcium and Vitamin D , any body is keen on these? jinan22 Calico"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 15, 2008 11:30PM vhqh wrote: I had surgery on Monday and took the week off.  I felt good enough I could have gone back sooner but I didn't, even with the axilliary node disection.  I did not have a drain though.",
      "MessageIndex": 2,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/709133",
      "Title": "Lumpectomy Recovery Time? oldlady Pollygator"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Jul 6, 2008 06:46PM vhqh wrote: Many, many prayers!",
      "MessageIndex": 66,
      "PostDate": "06/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708563",
      "Title": "Can't Walk.... Headed to ER TripleNeg booklady"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 3, 2008 06:46PM vhqh wrote: The clip will likely be done with a hollow needle, I know they left one in me after the core biopsy was done to identify the site of the biopsy.  They used this clip when they placed the wire for the wire guided lumpectomy.  Incision was very small, about 1/4 inch, and I wouldn't expect anything different for your clip placement.  They may use ultrasound or the mamo machine to verify placement of the clip, I don't know if they will do this while you are out or not, it could be done either way.  My sentinal node was positive so they took out 11 nodes total, incision was about 2 1/2 inches long.  Steri strips were used to close it and a dressing was put on top of that.  I tend to have allergic reactions to tape, a plain old fashioned bandaid will literally eat my skin off.  After the lumectomy and node disection I also reacted some to the steri strips where in the past I have not.  Please let the surgeon know if you react to tape or bandages, there are alternatives they can use.",
      "MessageIndex": 9,
      "PostDate": "03/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/718949",
      "Title": "SNB recovery time bettelou68 bettelou68"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Sep 3, 2008 11:03PM vhqh wrote: I have read some reports recently that indicated that surgical removal of the primary tumor resulted in longer survival for even us with mets.  Here's a link to one study - http://www.annalssurgicaloncology.org/cgi/content/abstract/14/12/3345   ",
      "MessageIndex": 3,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720588",
      "Title": "2nd Opinion done Roja1955 Roja1955"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Aug 2, 2008 06:32PM vhqh wrote: Some have drains after SNB, I didn't, I had 11 nodes total taken out.  Mine was done on a Monday and I could have gone back to work on Wednesday, that was after being held in the hospital overnight due to low blood pressure.  Data entry would not have caused me any sort of problem, reaching and lifting with that arm will.  I would try to negotiate another day or two if you can, would FMLA apply here?",
      "MessageIndex": 1,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/718949",
      "Title": "SNB recovery time bettelou68 bettelou68"
    },
    {
      "AuthorID": "vhqh",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/56118/profile",
      "Content": "Nov 11, 2008 11:00AM vhqh wrote: Xeloda is very commonly used for brain mets as it has been shown to be effective.  I just finished WBR, I was already on Herceptin and we have added Tykerb to it as Tykerb has been shown to cross the blood brain barrier.  Should I start to show any progression Xeloda will be added. Push your doctors for Xeloda and Tykerb, both are oral and neither should be denied based on hormone status.  Do you have the option of switching Onc or seeking a 2nd opinion?  I've never heard of an onc stating that the failure of one oral med means all oral meds are useless.",
      "MessageIndex": 3,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/724248",
      "Title": "Those with Brain Mets (ER+/PR+), Pls share me your treatment... lemon_acosta lemon_acosta"
    }
  ]
}