{
  "AuthorID": "vickigs",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137948/profile",
  "Posts": [
    {
      "AuthorID": "vickigs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137948/profile",
      "Content": "vickigs wrote: I have fibrocystic breasts.  Went to see my ob/gyn in March, 2011, for a lump that I noticed under my left armpit. She send me to a breast doctor. Had an U/S and mammogram, all normal. They told me to not worry about it, but it's growing a bit, and it's painful. I waited and tried to not think about it. Then in June, 2011, I was too worried and came back to the breast doctor. She did an in-office U/S and said that her mashine is not a very high resolution, but that it still looks like \"normal breast tissue\" that happens to be in my arm pit. Again, I go away and try not to worry... but it get's impossible in Oct, 2011, so I go back to her and she sais that it should be removed, but that she is afraid to damage nerves in the area and refers me to a neurosurgeon. The neurosurgeon's receptionist tells me that they will call me back after they look over the tests, if he \"will take the case\" or not.  They never call back.  I go on line to find a neurosurgeon and find one at a different hospital, make an appointment. He orders an MRI of the left axilla. The MRI shows an enlarged lymph node in the clavicle area (1.7 cm). Otherwise nothing. He tells me the lymph node is nothing, but that's not what I'm reading on line. Today (Monday) I am scheduled for another U/S which he wants to do to localize the mass and then use the U/S during surgery to find it?  It is clearly palpable to every doctor that has touched it, and visible as it sticks out when I lift my arm, so I'm not sure why he is confused.  All this running around and doctor searching is nerve wracking. I have not slept well in weeks. I'm a single mom and I'm trying to function and not think about it, but there is no guidance from the doctors. The breast doctor, who is at a different center, has probably forgotten about me by now. The neurosurgeon, well... I don't know if this is the right specialist for what's happening.... I don't know who to see, what doctor to look for?  Feel totally on my own here...  Any advice would be greatly appreciated.... Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776601",
      "Title": "enlarged lymph node on MRI and breast mass vickigs vickigs"
    },
    {
      "AuthorID": "vickigs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137948/profile",
      "Content": "Oct 19, 2011 10:48AM vickigs wrote: Thanks Angel, I had an U/S and am waiting on the results. There were new cysts (about 5 or 6, I can't remember), and possibly a fibroadenoma in the armpit. This is from the tech who did the U/S. Don't have formal results yet. Never had cysts before, but have very dense breasts. Waiting...  Looking of a breast surgeon in Connecticut. If anyone knows a good one, please let me know.  Thanks, Vicki",
      "MessageIndex": 4,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776601",
      "Title": "enlarged lymph node on MRI and breast mass vickigs vickigs"
    },
    {
      "AuthorID": "vickigs",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/137948/profile",
      "Content": "Oct 17, 2011 06:23AM vickigs wrote: Thanks Tarry, I'll search for a breast surgeon.  Glad your node was clean :)",
      "MessageIndex": 2,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/776601",
      "Title": "enlarged lymph node on MRI and breast mass vickigs vickigs"
    }
  ]
}