{
  "AuthorID": "vicky3blum",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
  "Posts": [
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "vicky3blum wrote: my name is vicki. i'm 57 and just diagnosed. i now it is aggresive. i am so afraid. i have a 17 year old son with severe health problems. i had been planning on living to 100 to take care of my son.  i see the surgeon on monday and i guess i'll know more then.  Dx 1/20/2012, IDC, ER+/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/781933",
      "Title": "scared vicky3blum lago"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Feb 3, 2012 05:27PM vicky3blum wrote: thank you all. i don't feel alone anymore.",
      "MessageIndex": 6,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/781933",
      "Title": "scared vicky3blum lago"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 20, 2012 06:56PM vicky3blum wrote: what is MLD? Also, I have been trying to get my doctor to prescribe a sleeve and he says not yet which is frustrating.  I am high functioning autistic[ Aspergers] and exercise has always alleviated many of the challenges. I NEED to exercise but I am afraid to unless I have a sleeve.  How long did you all have to wait after surgery or did they make you wait until you were diagnosed with lymphadema?  Thanks Vicky",
      "MessageIndex": 120,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 13, 2013 04:58PM vicky3blum wrote: My sister had 23 nodes.Stage 111c.  it has been nearly 20 years.  she is now an oncology nurse.  she was one of the few who had an autologous bone maarrow transplant which has been discredited but she still feels it may have helped.",
      "MessageIndex": 271,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/773239",
      "Title": "Positive nodes with long term survival many Lily55"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 28, 2012 08:05AM vicky3blum wrote: we moved our camper up there last wednesday and most of our stuff is stored behind the ice cream shop.",
      "MessageIndex": 1,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784800",
      "Title": "prayer request not pertaining to cance vicky3blum vicky3blum"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Feb 12, 2013 09:04PM vicky3blum wrote: hey everyone.  there is a contest going on now for best healthblog.  the winner will receive one thousand dollars.  two blog sites are neck to neck.  one of them is for rheumatoid arthritis and the other one is our own ann [coolbreeze i THINK is her user name] Please google Breast Cancer? But doctor i hate pink blog.  you can vote twice a day.  anne is stage 4 and not doing well at all now.  she desperately wants to win so that she will have a grand to go towards her sons college.  PLEASE VOTE FOR HER.  you can vote every day[3 days left] Also, after you have gone online and voted, please mention this in threads you are active in and any social network you are part of.  thanks vicky",
      "MessageIndex": 1121,
      "PostDate": "12/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 29, 2012 12:13PM vicky3blum wrote: gram, i'm praying for your sister.  she is most likely in an area where her cell phone does not have reception.The news I have heard o the fire is pretty positive now that they have help from out of state. ",
      "MessageIndex": 10,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784800",
      "Title": "prayer request not pertaining to cance vicky3blum vicky3blum"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "vicky3blum wrote: i had my BMS on feb 27.  this board has been so helpful. we just rented out our home because we cannot afford the mortgage but that was okay because we bought a camper to live in the mountains in a nudist resort where we have been members for many years. they have given emotional support all these years for my seriously ill son and now for me with the bc.  we are supposed to move there on saturday. we have been saying thank god for the place because of the support and it sure beats living under a bridge and i also make money running the ice cream shop.  nowit is surrounded by fire, 2 people have died, alot of animals have already died and there is zero containment. please pray. vicky Dx 1/20/2012, IDC, ER+/PR- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784800",
      "Title": "prayer request not pertaining to cance vicky3blum vicky3blum"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 28, 2012 11:46PM vicky3blum wrote: thanks indigo. that's what i hear as well.  vicky",
      "MessageIndex": 6,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784800",
      "Title": "prayer request not pertaining to cance vicky3blum vicky3blum"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Jun 6, 2012 12:09AM vicky3blum wrote: I'm sure you have nothing to worry about BUT my surgeon never ordered an oncotype before my bmx.  When I first went to see my oncologist he decided to order one at that time.  He assured me that everything they needed for the test had been saved.  I could not help but envision a freezer [chest of course] filled with saran wrapped, snowball shaped boobs. weird, huh?",
      "MessageIndex": 2,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/788650",
      "Title": "A bit OT, post-BMX question mary625 mary625"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Feb 22, 2012 01:59PM vicky3blum wrote: my son has a delilibating neurological condition.  they believe it is related to his tourettes [which is always related to some form of brain damage]  his brain signals to his body that his nerves are under accute attack.  he has had months on end where he would pass out hundreds of times a day from the pain.  accupuncture sometimes controlled it a bit.  we tried everything, even goingoutside the country, spending every dime we had and then some.   then we tried mmj [ my son was second minor in state to receive the pink card] that helped alot for about 3 years but then stopped helping.  every day he was begging me to help him die.  anyway, after alot of online research, i asked the doctor about nortryptaline .  probablt it has already been mentioned in this thread, but thought i would mention it just in case. it is actually an anti-depressant. since taking it my son's pains have reduced 80 to 90 percent.  has anyone tried this. for us it has been no less than a miracle[ of course we start planning on a somewhat normal life for him and 2 weeks later i get BC. and we wind up homeless.[ we will have a place to stay but we will miss our home of the past 12 years]  I keep trying to remind myself that if things turn out well after my mastectomy and my son keeps doing alright, everything else is just a piece of cake.",
      "MessageIndex": 848,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "vicky3blum",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/143697/profile",
      "Content": "Mar 25, 2012 11:22PM vicky3blum wrote: I had my BMX on february 27th. Because I gained 15 pounds as soon as I found out I had cancer[ watched too many people with cancer waste away] my 36DD bras were too small for me.  During my BMXmthe psput in TE's.  After 2 fills I am already at 450 cc's.  <m nipples, aerola and a large ammount of skin was removed along with my breasts and the cancer.. some skin, not a lot was left. the skin will actually be stimulated to grow, my 57 year old diabetic body is having no problems with this.  My next fill will be friday but that is only to overexpand beccause I am happier at my age with the slightly smaller chest. I'm still a full c, small d but I am sure I would have no difficulty getting larger. i have simply chosen otherwise.  BTW, you are not being shallow.  You hav a right to have as much as has been taken away from you as possible.",
      "MessageIndex": 12,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/781465",
      "Title": "Double Mastectomy, will I get 38D's back? Honeypotpie vicky3blum"
    }
  ]
}