{
  "AuthorID": "vickie1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
  "Posts": [
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "May 21, 2008 05:52PM - edited May 22, 2008 02:26PM by vickie1 Hi Anne Thank you for your comment. You are right I do have time and good health on my side. I made this decision a long time ago and have kept putting it off. The problem now is that Im getting very close to the age that my mum and nan died of Breast cancer. With every year, my risk is increasing. I worry that if I put it off much longer I will need to have it done out of necessity rather than choice. My mum and nan died in their 40s and my big sister was 9 when she was diagnosed with cancer. My sister survived and is now 37. I have 2 sisters and I really want to tell them what is happening but I dont want them to be upset or worried. I cant tell my friends either as I lose my bottle every time I try. I will have it done in the next 12 months but I need to get my head round it first. I have so much to sort out first, like childcare, time off work, my family and friends, my relationship I dont know where to start. Just talking to you is helping though, thank you so much for taking the time to comment. Vickie",
      "MessageIndex": 2,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705880",
      "Title": "TRAM flap surgery vickie1 tam1953"
    },
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "May 22, 2008 06:37AM vickie1 wrote: Hi Linda, thanks for your comment. I cant be gene tested as my family members who were diagnosed BC died. My sisters diagnosis was Thyroid Cancer which she survived. They can apparently check the histology of her tumour but gene testing for BC is out of the question. My family history is pretty scary and my sisters are aware that I have been to the Family History clinic. My Sis who has already had cancer doesn't want to know about BC as she is of the opinion that she has beat it once and she would do it again if necessary. My other sis has just got over a Cardiac Arrest so I dont want to be worrying either of them to be honest. I know I have to do this for me and my son and its lovely to have like minded people to talk to. I hope you test results come back ok. Take lots of care. Thanks Vickie",
      "MessageIndex": 5,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705880",
      "Title": "TRAM flap surgery vickie1 tam1953"
    },
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "May 22, 2008 09:44AM vickie1 wrote: Hi TPPJ, My surgeon told me that I am not a good candidate for implants. If this were not the case I would definately opt for that over TRAM as I understand the recovery is so much easier. Maybe I should go back to talk to him and find out exactly why I cant have implants. I think it was something to do with the size, but I am happy to go smaller. I will research all my options. Vickie",
      "MessageIndex": 7,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705880",
      "Title": "TRAM flap surgery vickie1 tam1953"
    },
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "vickie1 wrote: Hi all, I have never used a chat room before so please forgive me if I get anything wrong. I am really quite nervous about the whole thing and Im struggling to talk to people, but here goes. Im a 33year old single mum with a small boy. I have been attending a family history clinic for several years now. I cant have any genetic testing as I have no surviving family members but I have been put in the High Risk category. I am absolutely terrified of being diagnosed with breast cancer and leaving my son behind as I was a child when I lost my mother to the disease. I know that treatment has moved on and my chances would be so much better than hers but the fear has dominated my life for years. Anyway, I saw a breast surgeon the other day about risk reducing surgery ( I have been several times ) as I made a decision 3 years ago that I would do everything to make sure I see my son grow up. We discussed the option of a  bilateral mastectomy and TRAM flap reconstruction. I know I want to do this but I am terrified. I dont know how to tell my family, I am scared that my boyfriend will run a mile afterwards and worry that I will be alone forever. Im sure that some of you may think I am being petty and worrying for silly reasons but I would just like to talk with someone who understands my fears. Im sure my concerns will change but at the moment the only thing I am sure of is that I have to do this for my own peace of mind and for my precious son. I dont want him to be without his Mummy, like I was. Please help me to understand what I am feeling. I am so grateful that there is someone I can tell my fears to without upsetting my friends and family. Thank you so much in advance. Vickie Ps Sorry if Im babbling nonsense Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/705880",
      "Title": "TRAM flap surgery vickie1 tam1953"
    },
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "vickie1 wrote: Hi all, 4 years ago, I posted on this site (see original post) to talk about and try to make sense of my feelings about my decision to have prophylactic bilateral mastectomy . The advice and care I got from you was amazing and I later booked my surgery, which was due to take place in the January of 2009. During December of 2007, my sister had a Cardiac arrest and was later diagnosed with Sudden Arrhythmia Death Syndrome in December 2008(she was fortunate enough to have been outside the ambulance station when she had her 1st attack and so was shocked back to a normal rhythm). This meant that my surgeon was no longer happy for me to continue with my surgery, until he was sure that I was not at risk of SADS as this too is a genetic condition. In Decemeber 2011, I was given the all clear of SADS and so began my journey to explore my surgery. Last week it was agreed that I could begin the process again and was given a few different options, one of them being 'straight to implant' using Strattice. Still the TRAM was offered but this time, with the newer Srattice surgey and implants, I am a good candidate for implants. This pleases me as the recovery is quicker and the surgery is simpler. I have chosen not to keep my nipples as they carry risk if I keep them. I am hoping to go in to have my surgery in September of this year. I dont want it before the long summer break, I want to be able to do stuff with my child and then have my surgery when he returns to school in September. My concerns are still the same, especially about my boyfriend. I wish I could see what he is thinking..............or do I?? Maybe it's best not to? Anyway, I hope and pray that nothing happens this time to delay it. I am ready for this and I do not want to put it off again. Oh, I did discuss the genetic testing but was advised it wasn't really necessary as I am in such a high risk group anyway bacause of my family history and the ages of diagnosis.  Thanks in advance for any help/advice you can offer, especially on the relationship front. Vickie xx  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/789714",
      "Title": "Prophylactic bilateral mastectomy vickie1 vickie1"
    },
    {
      "AuthorID": "vickie1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/67126/profile",
      "Content": "Jul 31, 2012 01:07PM vickie1 wrote: Hi, Just thought I would give a little update. I have got my date through and will be having my surgery on September 19th 2012 and I cannot wait. I cannot wait for the morning I wake up and the first thing I think of is not breast cancer!!! I have lived in fear for so long and I am about to have that all taken away :-) My boyfriend is being brilliant about it all too, we had a good chat and he is totally ok with it all. I will post again after I have had the op to let you know how it is all going. ",
      "MessageIndex": 2,
      "PostDate": "31/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/789714",
      "Title": "Prophylactic bilateral mastectomy vickie1 vickie1"
    }
  ]
}