{
  "AuthorID": "victoryismi…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
  "Posts": [
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Mar 29, 2011 02:30PM victoryismine2 wrote: Hey Raincitygirl, it is raining here in GA  today. As a matter of fact it rained buckets the day I got my results and the same thing on the day I had surgery. I figured that the earth was crying for me because, I haven't shed a tear since I found out that I had cancer. I don't think I am in denial, it's just been like I am sleepwalking in a non-stop barrage of things to do, know, inqure, surgery and on and on. When am I most likely to crack? The ER/PR+ phrase that you are using, I don't see that on my pathology/surgical reports. Thanks for the Triple Negative explaination, which I've seen used a lot on this Board. That is one other thing that I will have to inquire about on Friday, I feel better equipped for my meeting now, before I really didn't know what to ask. When I was talking to my daughter about the Oncotype which she didn't know about, I was concerned if the insurance would pay for it. She snidely said , so if it can help determine your best treatment course and the insurance won't pay for it does that mean you won't have it done?? Now on the Pathology report, I saw that the ki-67 would be done on another test. I will inquire on Friday ladies, if there are any other questions that I need to ask, please let me know. All of these new words and procedures are a lot to learn; actually it's like going to school all over again. I like learning about new things, but I don't think I wanted to have my world turned up side down to know this. My husband goes in with me, but he doesn't hear well and certainly doesn't understand what's just hit us, but I thank God for his being there. I think it made a believer out of him when he witnessed my breast aspiration last Friday. I feel so good today, when I REACHED down to put on my slippers this morning I did it with ease, no pain and little tenderness, Whoopee!!  Thanks for your reply, Group hug",
      "MessageIndex": 6,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Mar 29, 2011 12:19PM victoryismine2 wrote: Bless you Raili, Thanks for your answer which was right on time; I was just thinking that no one wanted to discuss such a boring topic . . . My breast surgeon, such a sweetie, said that with the lumpectomy and not any nodes involved, that she would think that I would have radiation and use Herceptin for 5 years. But, after reading some of the posts here Herceptin doesn't seem to be a pill. Is that Chemo? My treatment part of it has not been discussed yet with the Radiologist or Onc. Doc so I don't know. She gave me the option of having internal radiation, but I don't do well, with having to take gadgets out of my body after they've been in for a bit. I have some other medical problems and I am 69, so, I don't know what they will do with me, just don't hurt me! I will let you know when I return on  Friday. Thanks a million, Big hugs and kisses!",
      "MessageIndex": 2,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Apr 3, 2011 01:57PM victoryismine2 wrote: Hi Crazylife41, How's about that? I live in the ATL area also. There is a light at the end of this tunnel and I have learned in just a couple of weeks that this Breastcancer.org Community plays a large part in holding that beam. There seems to be more collective knowledge here (from experience) than at most doctors offices.",
      "MessageIndex": 17,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Mar 30, 2011 03:24PM victoryismine2 wrote: Thanks Anjanita, When I finished filling out 22 pages of information for the new patient packet for my visit to the Rad Onc on Friday, I was worn out. When I do wake up from my fog and start to crack I will need many big hugs from you. I am writing down many questions (now that I know what to ask) and getting ready to conquer this inscidious disease. ",
      "MessageIndex": 8,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Mar 29, 2011 01:49PM victoryismine2 wrote: Thanks Leah_S, I don't think Oncotype has been discussed in length with me. In the haze of information over-load at the surgeon's office, she mentioned it, but I don't have any paperwork to that effect. I will call her/or maybe when I meet on Friday they will have all of that on record. Thanks, your comments have helped  so much and when you think of something else you forgot to tell me, I'll gladly receive it, I have told everyone who will listen about this new group of friends I've found on Breast Cancer.org",
      "MessageIndex": 5,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Apr 2, 2011 11:05AM victoryismine2 wrote: Good morning ElizabethAnne, Raili, (Ladies): I am back in the game again. Yesterday, Friday, I was just wasted! I stayed awake ALL night long Thursday night, going over what questions to ask??? I could hardly walk from the car to the office, because I was so tired; when I returned home I threw myself into bed and stayed there until this morning. Ignorance is not bliss! I had a really wonderful first meeting with my Radiologist Onc! He is just what every one of us surviors need. He spent at least two hours with my husband and I. He said, \"Looking at my notebook, I see that you have quite a few questions, so let me explain a few things first, then I'll address all of your questions; I will speak slowly and in layman's terms\". He answered all of the questions that I had on my notebook, during his explanation and more. He  said that he would have to taylor my XRT just for me, because of the prior medical problems with my lungs. So, he was glad that I got to see him first, so that he could plan his attack! He offered me 2 radiation Tx options: Traditonal 33 Tx for 6-7 weeks or CANADIAN FRACTIONATION, which is only 4 weeks.  His diagnosis is that I am a good candidate for Hormonal therapy, since I am ER+/PR+ and he said the Onc will order the Oncotype, because I am somewhat borderline. Rad Onc said that he thinks like a surgeon; Lumpectomy plus Radiation = Mastectomy, from a prognosis point of view. So, he thinks Chemo is a little over the top, but that is for me and the Onc to make that decision. He said that the K1-67 is borderline and that number determines how fast the cells are trying to reproduce themselves. He then took me on a tour of the Wellness Center and introduced me to all of the people with whom I would come in contact. So many programs in which to participate, the wig and make-up shop, the library, the demonstration kitchen with the huge TV monitors, the lounge for anyone who comes with you, on and on.  I'll stop now, but if I've missed anything let me know, Oh, he suggested a book for me to read, that he thought was just great reading, \"Your Life In Your Hands\", by Jane Plant.  Have a great weekend!",
      "MessageIndex": 13,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/766737",
      "Title": "Which to See First - Radiologist or Oncologist? victoryismine2 Anjanita"
    },
    {
      "AuthorID": "victoryismi…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126551/profile",
      "Content": "Apr 29, 2011 03:20PM victoryismine2 wrote: Hi Ladies, I have been lurking for a few days so, may I  join the May 2011 Rads group? I thought about what Romansmom said happened when she was leaving her treatment. Well, as I was leaving, I think my nipple was smoking and my  body told me that it could either walk me to the car or it could breathe, but it couldn't do both. I was so wasted, just too tired to place one foot in front of the other. By the time I got home I was nauseated and tired, after resting the remainder of the day I was doing better. The next day  I ate a little something before going and I wasn't nauseated just extremely tired. Today, Friday, the machine is down AGAIN, so, I get to rest over a long weekend. I did not expect to get SE's after the first treatment. I am praying that it will get better maybe, I won't burn, it seems that I always do things backwards.",
      "MessageIndex": 54,
      "PostDate": "29/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/767583",
      "Title": "May 2011 Radiation Pinkprincess GabbyCal"
    }
  ]
}