{
  "AuthorID": "victorialee…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200281/profile",
  "Posts": [
    {
      "AuthorID": "victorialee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200281/profile",
      "Content": "Sep 27, 2018 08:19PM victorialee wrote: Hello everyone. I hope everyone is recovering well or warm thoughts to those whose surgeries are upcoming. I had my masectomy yesterday with immediate implant (nipple and tissue sparring). I could not have asked for a better team of doctors and nurses. I stayed one night and while I didn't sleep much I was well taken care of. I was nauseous from the anesthesia and had 4 meds for that in recovery. They really dont want you throwing up. They said the numbed my breast really well and I've only been taken tylenol and a muscle relaxant. Great if it stays that way but I have meds if needed. I feel more tightness than pain. Once the nurse pinned my two drains to my bra I was comfortable. I had two sentinel nodes removed that were clear, yay! Was so worried since this was a recurrence in 4 places 4 years out from original dx. Good luck everyone! Speedy recoveries!",
      "MessageIndex": 76,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "victorialee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200281/profile",
      "Content": "Sep 4, 2018 10:44AM - edited Sep 4, 2018 11:21AM by victorialee hello all! My surgery is penciled in for Sept. 26th. Left MX. It's far off as my husband and I had plans to visit Nashville 9/12-17. I've met with the PS. Taking Letrozole and dealing with the stress. Of waiting and worrying about the surgery. WigLButtz I hope everything turned out well for you. I totally understand the emotional toll this surgery places on you. I'm hoping I can get my head together beforehand but probably wont.",
      "MessageIndex": 13,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "victorialee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200281/profile",
      "Content": "Sep 23, 2018 11:35AM victorialee wrote: Britspreech, I am with you. I was dx end of July with a local recurrence in 3 places and scheduled for MX on Wed 9/26. This week leading up to Wednesday I have been all over the place with my emotions and anxiety. I know that the day of my surgery i will be calm knowing i have a great BS and PS working on me. I just hope I show up! LOL can I run away? ;)",
      "MessageIndex": 64,
      "PostDate": "23/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "victorialee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/200281/profile",
      "Content": "Sep 17, 2018 04:02PM victorialee wrote: Annie60 - sending warm thoughts your way. As someone once said to me- Nervous feelings are good, shows you are alive. My MX surgery is next Wed, the 26th. When I had my lumpectomy I took a clanosopam (sp) and kept telling myself I was ridding myself of this tumor and had the best doctor's helping me. Deep breathing helps too. Let us know how things go.",
      "MessageIndex": 46,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    }
  ]
}