{
  "AuthorID": "VicZen",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10877/profile",
  "Posts": [
    {
      "AuthorID": "VicZen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10877/profile",
      "Content": "Oct 30, 2008 08:28PM VicZen wrote: Please don't freak out.  I know this is stressful to you, but stay on target and do what you have to do.  First, be like a squeaky wheel and get those mammogram films by calling, faxing, doing whatever you have to in order to expedite them.  Also, ask if the doctor's nurse can call for you, too. Also, your bc may not be exactly like your mother's so until you get a biopsy and the necessary tests, treatment and procedures, you still don't have all the information.  Take a few deep breaths and get as much info. as possible.  Breast Cancer for Dummies actually is an extremely helpful book.  My sister got it for me when I was first diagnosed. There are so many good therapies and drugs these days and they keep improving.  You are young and will have many years ahead to enjoy your little ones.  Stay strong and keep a good attitude.  I'm thinking of you. Viczen",
      "MessageIndex": 2,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723666",
      "Title": "Overwhelmed and terrified Emmabell Towhee"
    },
    {
      "AuthorID": "VicZen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10877/profile",
      "Content": "Oct 30, 2008 04:53PM VicZen wrote: I've been waiting for a reply on this myself in the Her2 group and I haven't heard anything.  Like you, I'd love to hear from a few more people.  I'm post-treatment and get frightened every time I have these, because my numbers seem higher than the teens and low-20s that everyone else seem to have.  Yours sound very good.  Take a deep breath and let me know if you hear anything. I've been having these two tests about once a year and they seem to fluctuate just enough to cause me anxiety and concern. Do any of you have some experience with this? I'd love to hear from you. Here's an example:  My most recent CA 15-3 was 38 (lab report says <35 is normal). Last Oct., 2007, it was 34 and in April, 2007 it was 39. So, it's always hovering at these numbers. My most recent CEA was 3.0 (nonsmokers normal range on my lab report shows: 0 - 3.1), so this was normal, but when I compared it to my last Oct., 2007 blood tests, my CEA was 1.9, so it had gone up 1.1 pts. in one year. Coincidentally, I was diagnosed with a small melanoma in situ on my arm and it was surgically excised two weeks ago and the margins are clear as I saw my dermatologist yesterday and got my final report on it (yea!), but I don't think that would have anything to do with these other markers. I read on another her2 site somewhere (http://www.her2support.org/) that her2 circulates in our bodies and for some it may run higher. My onc. said we could repeat these tests in six to 10 weeks and I will. She said if there was another increase, she would do a clinical evaluation (I guess that means an office visit). I just get anxious and concerned and would love to hear from some of you. Thanks for responding and Happy Halloween, Vicki Z  __________________ Diagnosed 12/03 at age 53 1.5cm tumor, ER-PR-, Her2 3+(rt side) Stage 1B, Three negative nodes from Sentinel Node Biopsy Paget's of the nipple, Infiltrating Ductal Carcinoma and DCIS of the rt breast Bloom-Richardson score 8/9, P53+ 60-70%, Ki-67+ 30-40% Skin-sparing mastectomy with immediate lat-flap reconstruction and saline implants, 1/04 Chemo: FAC, five sessions every three weeks Feb.-May 04, then switched to HTC weekly for 12 weeks, June-Aug 04",
      "MessageIndex": 1,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723505",
      "Title": "Tumor markers and nurse VENT!!! DianaT VicZen"
    },
    {
      "AuthorID": "VicZen",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/10877/profile",
      "Content": "Oct 30, 2008 11:40PM VicZen wrote: Hey Member and BeerGirl, You BOTH made me laugh and have really helped me to feel better!  A big thank you and I always think before a test, \"was it the glass of champagne, the pinot noir from a week ago, the vitamins?\"  Who the heck knows.  My onc. didn't really want me to take the tests, probably because of the fear factor.  But, I thought knowing things would be better, yet I end up scaring myself.  So glad you wrote a reply. Viczen",
      "MessageIndex": 4,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723505",
      "Title": "Tumor markers and nurse VENT!!! DianaT VicZen"
    }
  ]
}