{
  "AuthorID": "villagirl",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
  "Posts": [
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jun 28, 2010 03:50PM villagirl wrote: Dililahbear - thanks for the info, you are amazing you seem to have been through so much! I am still waiting for a date for my op.  I am self employed, so if I don't work I don't get paid, so I hope I will be fully recovered as soon as possible. I am keeping busy reading (for the 3rd time) the Twilight sagas, and I am off on 3rd July to see the new one, Eclipse, with my daughter! So I will keep myself emerged in daydreams of Rob Pattinson, and hope that he comes back home to the UK very soon.  Wishing you well, keep strong, love life. Villagirl",
      "MessageIndex": 10,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jun 25, 2010 10:52AM - edited Jun 25, 2010 04:52PM by villagirl  Intraductal papilloma I am awaiting a date for the above operation. I had a microdochectomy in 2003 for the same 'bleeding' problem.  In 2007 I had a FNAC (core biopsy) on a lump, both times I escaped the big 'C'.  This time I am petrified, surely I can't be lucky enough to be cleared again?  I see there are a few of you that have had this op.  I remember the microdochectomy (removal of the duct with the papolloma) and that was really painfull, so what is it going to be like when they are all taken away? If there is anyone out there that has been through the same, please let me know - do you end up with one boob bigger than the other - where can I get a supportive bra with a zip at the front from in the UK, and how long did it take you to get back on your feet and able to work again.  Sorry I'm babbling, this is such a release!  ",
      "MessageIndex": 8,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jul 18, 2010 03:30PM villagirl wrote: Hi Nancy, nice to hear from you again. Hope everything goes well with your BS on Weds, Im sure it will be fine.  I am much better thank you, a high dose of antibiotics the doctor gave me seems to be doing the trick. I had to work as well, I am a registered child minder, self-employed, so if I dont work I dont get paid. I live in Worcestershire, which is not far from Stratford upon Avon and Birmingham (you will probably of heard of these places). I live in a lovely village in the countryside. Where is Sarasota? America is very big, and I am hopeless at Geography! I am coping with the waiting, keeping busy with the children, reading etc. I have been to see the new Twilight saga Eclipse twice, (still besotted with Rob Pattinson!!) with my daughters. My grand children are keeping me busy too. My eldest daughter has just been recalled after her routine smear test, she is having a camera examination on the 28th (day after my op!). But hey, we are ready to take on what ever is thrown at us. Take care Julie ",
      "MessageIndex": 14,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jul 18, 2010 03:35PM villagirl wrote: Hi Raquel Hope you are recovering from your op. Iam having the same thing done on the 27th July. Did you have a lot of pain prior to the op? I seem to have waves of pain, some like a knife stabbing me, which seems to go right through to my back/shoulder blade, and in my armpit. How are you feeling now, and are there any helpful hints you might have for me. Take care Julie",
      "MessageIndex": 15,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jun 28, 2010 03:56PM villagirl wrote: Hi I am waiting for a date to have a major duct excision, which should be any day now. I also have had a lot of pain, and was hoping that after the op it would not be there anymore!! Perhaps it is just nerve endings healing, as I am tole they have to cut through quite a few nerve endings, and these take a bit of healing. I do hope you are feeling better now and healing nicely, and I hope your tests are clear.  The waiting is the worst thing.  Thinking of you, take care. ",
      "MessageIndex": 11,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Aug 29, 2010 04:07AM - edited Aug 29, 2010 04:09AM by villagirl Hi Nancy,hope you are feeling ok after your recent treatment. I am on the mend, after having to go through two operations in the end.  The major inductural excission went well, but when my breast surgeon came round to check on me she was not happy with the swelling, and I had to go back down to theatre for a removal of a haematoma! Apparently they removed the heamatoma and drained 300ml of blood away! I looked like Pamela Anderson on one side for a while!!  I have been back to see my breast surgeon (10 days later) and have been told that there was not any papilloma in fact she could not say what was causing the bleeding. She said she saw cases like this about once a year, but she was not too concerned, but I will not have regular checks so she can keep an eye on me! This is more worrying for me, because I still am not sure what is going on in there.  I hoped it was a papilloma or two as they are usually B9, but there we go. Really I don't feel any far forward than I did before surgery. I had a few days off work, went back to work and developed an itchy red, raised rash. I went to my GP who informed me I had shingles! Just got over that, and then picked up a tummy bug!  Was your immunity low after surgery?  Still feel very tired and very low, perhaps this is normal? Anyway, really hope you are doing well and look forward to hearing from you again. Julie",
      "MessageIndex": 18,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    },
    {
      "AuthorID": "villagirl",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104154/profile",
      "Content": "Jul 11, 2010 07:06AM villagirl wrote: Hi Delilahbear, just to let you know I have got my date, we are a bit slower in the UK!! I have my pre med tomorrow 12th July and the op on 27th.  Trying to get over a throat infection at the moment, so I hope they will still operate.  Hope you are well, take care.  Julie",
      "MessageIndex": 12,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/742762",
      "Title": "question about after papilloma surgery cupid104 ccongdon"
    }
  ]
}