{
  "AuthorID": "VintageGal1…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
  "Posts": [
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 9, 2014 08:48AM VintageGal1111 wrote: Hiya~ I never thought I would be back here looking for another *starting chemo* group. I was part of the Sept 2013 group. I finished chemo in Feb & just had my last Herceptin infusion....& the cancer has returned. It's been an awful confused, painful, pissed off couple of weeks for me. I am starting chemo again on Tuesday...my birthday!",
      "MessageIndex": 130,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 11, 2014 03:10AM VintageGal1111 wrote: Hey Gals going for my second round at chemo today. Started A&C last Sept '13, then went on to weekly Taxol & Herceptin. Finished Taxol in Feb '14, continued Herceptin til last month when we found cancer had returned. I felt *safe* while doing treatment, really didn't think the HER2+ would show its ugly head again. But here I am, on my birthday no less, starting taxoeter, pergeta & herceptin. ..sigh...",
      "MessageIndex": 154,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 1, 2014 12:37PM VintageGal1111 wrote: Hi Marcela~ I too started chemo (again) in Nov. I was still on Herceptin HER2 infusions when it came back. Guess I better join the FB group too!",
      "MessageIndex": 535,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 1, 2014 02:01PM VintageGal1111 wrote: Marcela~ thank you..... well the taxotere almost killed me, really bad reaction to the dose (every 3 weeks). We are starting back tomorrow to weekly taxol, with some misgivings since it obviously didn't work before?! And yes Herceptin & Pergeta.",
      "MessageIndex": 538,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 13, 2014 04:27AM VintageGal1111 wrote: Thanks! BD chemo went fine, long day but no issues. Went yesterday for Neulasta shot. Also had xray, chest fluid filled up again, left lung only going at 10% so back today to have it drained. Onco & pulmonary dr both think/hope chemo will keep that fluid down. Not happy to be in this rodeo circuit again so soon. So not fair my hair never really got to grow back much now it will be gone again. And my nails were just recovering from Taxol now Taxotere will wreak havoc. ",
      "MessageIndex": 165,
      "PostDate": "13/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 11, 2014 09:48PM VintageGal1111 wrote: Thanks Gals~ I wasn't scheduled early since they had to squeeze me in today for my second go round at this chemo game. I had blood drawn at 10. So it was 4:30 before I got out of the chair. loooong day! But I knew it would be, iv steroids, then the pergeta very slow, dose dense & an hour monitoring after for reaction. Then the herceptin (been there!) & then the taxotere. Dr is still stunned how this *new* cancer (cells in pleural fluid) could be HER2+. I was cancer free in March after BMX, had rads & the continued Herceptin should have got anything that was possibly lingering. It was a decent BD anyhow....wifi there so I had many messages, FB, texts & emails all day sending wishes & luck. Hubby sat with me the entire time. My sister delivered a bouquet from a friend who left it at her work for me. And I came home to find a bonsai had been sent by gal I met here last year on the Starting Chemo in Sept 2013 group! And said Hubby made me a gluten free angel food cake! Stage IV is very scary at first. But I am feeling better about things. Thanks~",
      "MessageIndex": 159,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 17, 2014 04:00AM VintageGal1111 wrote: Hey Tigger2 I don't go for chemo again tl Dec2. (pergeta herceptin taxotere) Well at least that's what my team has planned for me up here. But I travel down to Dana Farber on Thursday for a consult. Not sure if they will have anything different to add. But because my HER2+ cancer coming back during treatment is so *highly unusual* my onco wants to cover all bases.",
      "MessageIndex": 235,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 1, 2014 12:45PM VintageGal1111 wrote: I am Lyn Kells on FB. I would like to join the new Nov chemo page. Thanks.",
      "MessageIndex": 536,
      "PostDate": "01/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 8, 2014 01:27PM VintageGal1111 wrote: Hello~ I go tomorrow for my taxol/pergeta/herceptin. Hard saying if this is # 2 or 3. I had a dose dense 11.11 of taxotere with the pergeta & herceptin but it was very bad. We had to wait 3 weeks, along with many other issues & procedures due to this recurrance. Good luck Ladies! Any questions I can help with, fire at me. I did my A&C last Fall, then 12 rounds of Taxol along with Herceptin. I was just going for my LAST herceptin when the HER2+ came back in October. (sigh) So here I am, stage IV when I didn't really get past stage 3....",
      "MessageIndex": 642,
      "PostDate": "08/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Sep 6, 2013 05:05AM VintageGal1111 wrote: Hi thanks. I am Her2 positive, so was told a couple weeks ago Chemo would be necessary. Hopefully today I get squeezed in to see the surgeon! Have a great Friday!",
      "MessageIndex": 367,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Oct 28, 2013 09:38AM VintageGal1111 wrote: We had a Making Strides Breast Cancer Walk here in NH in a few cities weekend before last. In the town I walked in (Dover) we locally raised close to $100,000 which stays right there in that town/cancer center. It is amazing! I was so happy it was a non-chemo week & I was able to do the 3 mile walk. I had several friends with me & it sure was a feel good day!",
      "MessageIndex": 813,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 31, 2013 04:40PM VintageGal1111 wrote: I had my surgery Thursday, the 29th. Came home yesterday. Doing well. Visiting nurse was impressed, all looked good. I only took Morphine once that night in hospital and half a Vicoden last evening. I think the most irritating area is where the drain tube is inserted. I was fairly busy today, doing little stuff around the house, my sister came over so she took the dogs out, helped me make lunch and washed my hair! I see my surgeon on Wed, hopefully the drain can come out.",
      "MessageIndex": 259,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Jan 22, 2014 05:35PM VintageGal1111 wrote: KBee  GOOD LUCK tomorrow!!!!!",
      "MessageIndex": 1062,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Apr 22, 2014 01:42PM VintageGal1111 wrote: So sorry to hear of your latest news Lili1964. I sure hope somehow things go ok for you. You have a lot on your plate. Thanks for you post!",
      "MessageIndex": 1094,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Sep 5, 2013 03:04PM VintageGal1111 wrote: I had a lumpectomy a week ago, Aug 29th. The lump was solid to the touch, 6 o clock position chest wall. There was another growth or extension which the surgeon found out was a lymph node. (removed) The surgery was extensive he said because he really had to dig. I am new to this, just learning the terms. Before surgery I was taken down to Nuclear Medicine, scary, behind the door with the big RADIOACTIVE warning. A radiologist did 4 injections, owie, with a needle below my nipple. Have most of you had that done pre op? I did have lymph nodes removed and have a drain. I went to the BS yesterday, he was pleased with the incisons, healing well. But did keep the drain in. The pathology results were not in yet. He hopes by tomorrow and I have a tentative appointment with him in the afternoon. I had a navigator (liasion?) call me after my diagnosis but she was going on vacation and I have not heard from her since. I guess oncologist appointment won't be made til these last results are in. Though the surgeon put in a port, telling me I will need herceptin, chemo and radiation. So that news won't be a surprise. It sure helps to read all your posts.",
      "MessageIndex": 360,
      "PostDate": "05/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 28, 2014 09:06AM VintageGal1111 wrote: What a difference a year makes! So many mixed emotions looking back. At times I hought I'd never get through it all, the bald chemo sick Winter lasted forever. Then at times I cannot believe it has been a year, time does flies. I am doing well. A year tomorrow I had what I thought would be a fairly mundane lumpectomy. Then have rads. But I ended up waking from surgery to be told there was lymph node involvement and a port was placed for chemo. And the report came back no clean margins. So...A&C, (ugh!) then 12 weeks of Taxol/Herceptin. Then BMX in March (no recon!) quick trip next day back to OR for re-incision & evacuation of blood, then radiation for 6 weeks & now finally just have 3 more Herceptin infusions to go! Life is good. It's good because I am alive. We only have today, nothing else is guaranteed. I may only have 1.5\" of hair growth after 7 months post chemo, I may have more wrinkles & more sags (at age 60) and I may have a concave scrawny flat chest but I also got my lashes & brows back, I healed well, got back to the gym, am enjoying being on the motorcycle, going in the motor home, still buying & selling other people's old stuff, painting furniture & just loving family, pets & home.",
      "MessageIndex": 1160,
      "PostDate": "28/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 9, 2013 11:22AM VintageGal1111 wrote: LiLi1964 I did my 2 months of A&C with the awful Neulasta shot & yeah it was rough. Cumulative SEs made me think how could it get worse.....? I have had 3 Taxol treatments (with Herceptin) will go for4 4th tomorrow & so far the SEs are minimal. So much more doable than the A&C. I didn't even have the fatigue this last week so I must have got my blood counts up & anemia isn't an issue. So I have felt pretty good on Taxol. Hope the same for you! VintageGal",
      "MessageIndex": 1031,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Dec 27, 2013 04:17AM VintageGal1111 wrote: poodlemum  dont beat yourself up looking back. We've all had to make decisions in this battle we're fighting & many of us have had our doubts. But it doesn't help to wonder. Just be brave & go ahead! All the best to you!",
      "MessageIndex": 1053,
      "PostDate": "27/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Apr 25, 2014 04:02AM VintageGal1111 wrote: Hi Lili  I tried to add my radiation to my stats a few days ago but don't thin k it showed up. I have #5 today. ",
      "MessageIndex": 1103,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 23, 2013 07:12PM VintageGal1111 wrote: I am new here & just figuring out the discussions. This may be a good place to start since I just got diagnosed last Friday & my surgery is scheduled for next Thursday Aug 29th. I have had the mammo, unltra sound, biopsy, MRI, EKG & chest xray, met with the surgeon last week & hubby & I will see hm again on Monday. I am learning terms I wish I didn't have to know, tyring to grasp what it all means, & reading posts here that have been very helpful Thanks ~Lyn~",
      "MessageIndex": 170,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 27, 2013 10:20AM VintageGal1111 wrote: My surgery is Thursday the 29th. The waiting to see my pcp then finally get the mammo & ultrasound was awful. Luckily once I saw the surgeon he moved fast, he did my biopsy (unexpectantly) that day & had the results in 2 days. And his office scheduled the MRI, chest xray & EKG, plus another meeting with him. All the best to you!",
      "MessageIndex": 209,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 8, 2013 10:47AM VintageGal1111 wrote: Just chiming in on the lumpectomy vs mastectomy decision.....I can't help but wonder if I made the right decision.....so much was going through my head at the time....the discovery the biopsy, diagnosis, tests then BOOM! BS says *we rarely do mastectomies anymore* (like he said that 3 x) so I went for the lumpectomy even though last minute the Tumor Board felt I should have the option of chemo first since my breast was sooo petite & the masses deep in the chest wall. (this told to me the day before scheduled surgery). I went with my first decision but post op the BS told me he wanted to do a re-incision to get better margins & the cells on the skin then the Tumor Board said NO, start chemo asap. ....sigh.... then revisit the chance of more surgery in the future. I do sometimes wonder if I had more time if I would have made a different choice but for the most part I just have faith in the experts.",
      "MessageIndex": 865,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 14, 2013 06:52AM VintageGal1111 wrote: I will have my first Taxol next Tuesday. Every week! I cannot even imagine it being worse than the 4 dose dense A&C & Neulasta shots. UGH. Here's hoping! All the infusion nurses say that while it isn't a walk in the park it isn't as bad as the A&C.",
      "MessageIndex": 941,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Sep 6, 2013 04:14PM VintageGal1111 wrote: I saw the BS today. Got the drain out. (yay) In discussing the pathology reports we learned a few things and one is that he suggests I go back in for surgery on the 16th. My breasts are small, no extra fat, and the tumor & two attched lobes he removed were in my chest wall. (taking up a lot of room) He got good margins on sides but on the top it was right up to my skin. And evidentally he feels he needs to get back in there, clean up. He meets with *the team* on Tuesday & will call me with their suggestions. But he & I both feel ok about the second surgery. So I think it's a go. It will delay chemo by 2-4 weeks. Have many of you been back fro second surgeries within  couple weeks of the first? I was half prepared for a second surgery, just from my research. I thought perhaps he would have to go in for more nodes. So to go in where the lumpectomy incision is shouldn't be a big deal. That gacve me no grief & is healing well.",
      "MessageIndex": 377,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 25, 2013 04:35AM VintageGal1111 wrote: Hi Babs Thanksgiving here as usual but I am cutting waaaay back on what I will be baking/cooking. My sister & my son will do the most. Thursday unfortunately is always my worst SE day...but I plan to claim the couch before the guys get it! Hope you & everyone has a non stressful week & a fabulous holiday. VintageGal",
      "MessageIndex": 1003,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 24, 2013 05:32PM VintageGal1111 wrote: Thanks Babs!  Congrats on your anniversary. We celebrated 40 years in June. Had a big party! All the best to you on Thursday! Thanks for your reply. Lyn",
      "MessageIndex": 179,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Oct 12, 2013 07:19AM VintageGal1111 wrote: Lili1964 I have only had two infusions & the time was different. The first time I'd already done blood draw so didn't have to wait on that. The second one I had to wait so that was a delay. Plus it was later in the morning, close to lunch & the infusion room was busy. I would say you should plan on an extra hour, just for delays, checking in/out etc. Good luck!",
      "MessageIndex": 733,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 1, 2013 01:47PM VintageGal1111 wrote: Honeybair I used it as a paste, because I was already using 2 different rinses for the sores. I am knocking on wood cause I think (hope) there is some improvement today. After 3 weeks of this mouth pain I am about to scream! But I may make up some for a rinse too.",
      "MessageIndex": 828,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 6, 2013 05:31PM VintageGal1111 wrote: Does the Blood Builder have iron? I cannot have iron supplements because my constipation (& rectocele) are such an issue. But I am anemic & sure don't want my chemo to be delayed because of it. I had beef liver tonight, have calves liver in the freezer too as well as chicken liver. It's a good thing I don;t mind it! I know some seafood it good *heme* iron. I already eat the veggies & fruits but that doesn't really absorb.",
      "MessageIndex": 852,
      "PostDate": "06/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 9, 2013 01:31AM VintageGal1111 wrote: Jo6202 thanks! Yeah I had a seroma too & was like \"wow my little boobette looks better & bigger than before the lumpectomy!\" But alas when I got the swelling down I really saw how badly my breast had caved. Masses were at 6 oclock so there's really nothing there now below the pointed down nipple.",
      "MessageIndex": 870,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 9, 2013 01:39AM VintageGal1111 wrote: Lisa thanks I ordered the Blood Builder from Amazon. I tried liver this week but know there is no way I can cook & eat it 2-3x a week!",
      "MessageIndex": 871,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 20, 2013 04:37AM VintageGal1111 wrote: KBeee today is a good day so far! I had my first new cocktail yesterday Taxol & Herceptin. All went well though with pre meds it was a long infusion time. So weekly T&H for 3 months then Herceptin alone to finish out a year. VintageGal",
      "MessageIndex": 974,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Apr 15, 2014 09:21AM VintageGal1111 wrote: Hi LiLi  you're been through a lot!!! But sounds like you're on the way to healthier days! It was a long winter for many of us. I had my initial surgery, lumpectomy & node removal (14 out, 2 cancerous) end of August. Didn't get clear margins so started chemo in Sept. A&C for 2 months then 12 weekly does of Taxol (with Herceptin that goes til Dec) I had good days & bad days, some times I thought it was doable other times I thought the side effects were just never ending. I finished chemo in Feb & had a BMX March 13. (no recon) Plus an unexpected bleed the next day & pretty much grew a new boob on 20 minutes, totally filled with clots. So back to the OR.  I go Friday for my rad dry run & start radiation on Monday. I don't plan to have recon, not saying I never will but I know the failure rate is high & at this time I don't want anymore pain, discomfort, surgeries or hospital stays.",
      "MessageIndex": 1074,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Apr 22, 2014 01:39PM VintageGal1111 wrote: Hi Lili Well I did have surgery last year lol I had a lumpectomy and the node removal, 14 out two cancerous. Surgeon didn't like margins and wanted to go back in but tumor board said NO to that, to start chemo ASAP then mastectomy. So yeah back last August I thought my only surgery would be the lumpectomy and alnd didn't have any idea then I would have BMX in March.",
      "MessageIndex": 1093,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Apr 25, 2014 01:39PM VintageGal1111 wrote: Thanks Wrenn, hope you're doing better?  I went to the gym before I drove over for rads. I cut my treadmill time to a half hour, just one mile. Then I did some arm & ab machines, nothing that would affect the pecs or chest area. now that I am concave (beyond flat) I need to work on my 60 year old belly! And the arms sure did get flabby through winter & chemo, phew! ~~~~~ Lili, I was told 28. But I know there is a chance that could change. They did xrays today. I brought some items into the shop. Moved the Hoosier & a bureau, shuffled things around. Then hit goodwill for a couple tops. I could almost maybe probably rest my eyes for a few minutes before hubby gets home!",
      "MessageIndex": 1107,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Oct 22, 2013 04:46PM VintageGal1111 wrote: Oh ndgrrl I can't imagine how you feel! I had some miscommunication with my BS regarding my biopsy results & it was such a bad feeling. I know you will just do what you need to do, step by step. You are strong. Take care, VintageGal",
      "MessageIndex": 785,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 1, 2013 01:45PM VintageGal1111 wrote: Hi LiLi1964 how are you feeling today? It's so hard to try to figure what is a chemo SE & what is from that Neulasat shot. For me I think the worse SEs, the over all fatigue with flu like symptoms that keeps me down for days is the shot. Hope you're doing better! VintageGal",
      "MessageIndex": 827,
      "PostDate": "01/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Nov 6, 2013 05:28PM VintageGal1111 wrote: I got heart burn & acid reflux wicked last treatment & am feeling it start again today. I have Pepcid AC & that seems to help that awful bile that seems to be at the base of my throat. ....YUCK.",
      "MessageIndex": 851,
      "PostDate": "06/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "May 28, 2014 04:54AM VintageGal1111 wrote: Hi Poodle Mum I had no choice so didn't give it much thought. But I will say my teeny breasts were never a BIG part of me LOL I always wore a padded bra, never had cleavage so didn't wear revealing clothing & honestly they weren't a major part in sex play.  I guess we just accept things as they are. Ya know, that old \"it is what it is\". I don't like what I see in the mirror naked. Specially now with my chest burned to a crisp & peeling & leathery from rads. I don't like how my sternum sticks out like a skinny old chicken & both my sides cave in. But with my little soft foobs in my stretch bra I looked just as I did before when I am dressed.  Maybe this is a good time to seek help from a therapist. Maybe it isn't the actual loss of nipples that is bothering you. Perhaps it is more but right now that is your focus?  All the best to you.",
      "MessageIndex": 1150,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/807576",
      "Title": "August 2013 Surgeries laura11103 babs6287"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Mar 29, 2014 01:05AM VintageGal1111 wrote: kgruenhagen Hi  I am 2 weeks post BMX. It was my choice to have a bilateral. No recon. It was evident the drs *assumed* I would just have the one breast removed & have recon. But after going through a lumpectomy, node removal, several months of grueling chemo & knowing I still have radiation coming up for 6 weeks as well as Herceptin infusion til Dec...for me this was the way to go.  Hope you do well!",
      "MessageIndex": 3,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/819526",
      "Title": "surgery kgruenhagen Tdickinson"
    },
    {
      "AuthorID": "VintageGal1…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/186362/profile",
      "Content": "Aug 19, 2013 08:01PM VintageGal1111 wrote: Hello, I just joined today, Aug 19, 2013...having been diagnosed just last Friday. It sure is a shock, and I am sorry you are here, sorry we had to join this forum but happy that we have this forum to get support and information. Many of us are on this journey together.",
      "MessageIndex": 4644,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    }
  ]
}