{
  "AuthorID": "violethope",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
  "Posts": [
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 4, 2016 04:06AM violethope wrote: Hello everyone. I am brand new to this site. Diagnosed with IDC left breast November 26,2015 after having a lumpectomy for a Radial Sclerosing Lesion. I had a follow up Mammo and ultrasound that resulted in them finding a second suspicious area in the same breast so today I go to have an ultrasound biopsy of that area. My surgery is tentatively scheduled for January 19th and I guess what they decide to do will be based on the results of today's biopsy. Any suggestions as to what \"pages\" to follow, books, credible sites etc would be appreciated as there is so much on this site and new to the world of breast cancer. Thanks everyone!",
      "MessageIndex": 132,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 4, 2016 06:38PM violethope wrote: grandma3x-thanks for the suggestion regarding Dr. Love's book. I just went on-line to my local library and poof...there it was. Put a hold on it and they'll set it aside for me and let me know when it is there. Gotta love the library!",
      "MessageIndex": 145,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 19, 2016 01:06PM violethope wrote: Hello everyone and best wishes to all. My node biopsy went well today. I am sore and wonder what the next few days will bring. Taking Advil and Tylenol Extra Strength regularly and will start my exercises tomorrow. ending lots of positive Karma to everyone! Hope",
      "MessageIndex": 413,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 23, 2016 06:05PM violethope wrote: Virginia 123- re lumpectomy and activity/exercise. I run and was so discouraged when my BS said I couldn't do anything for 2 weeks post-lumpectomy in October. She explained that with exercise there could be a build up of scar tissue and perhaps infection and if that happened it might mean months of \"packings and dressings\" in the lumpectomy site itself. It was hard but I listened to her and it healed quite nicely. I even waited a few extra days as I wanted to make sure it was healed. I am a nurse and have seen way too many complicated incisions! A few weeks goes by very quickly and I wanted to avoid any possible complications as this journey is so difficult at the best of times! Everyone-keep up the faith and greetings from Nova Scotia! I still read the posts regularly and wishing everyone all the best!",
      "MessageIndex": 493,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 7, 2016 05:59PM violethope wrote: Hello everyone. My surgery is confirmed for January 19th. Sentinal Node Biopsy - left breast. Had good news today because they did a biopsy of a second suspicious area in the same breast on Monday and found out today that it was benign. So for now just the 1 small area of IDC for which I had a lumpectomy in November and hence now the SNB on the 19th. Wishing everyone all the best as you have your surgeries this month! ",
      "MessageIndex": 197,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 24, 2016 09:07AM violethope wrote: Virginia 123- I too feel the only things I can control are my diet, exercise, weight and alcohol intake as it doesn't appear as if we have much control over the other things -age and genetics. I had a glass and 1/2 of wine last night and still beating myself up over it today! Feeling pretty blue but keep telling myself i will not take any medications to get me through other than the pain meds post-surgery. I am in Nova Scotia so it may be different but had no drains post-op lumpectomy or node biopsy. Everyone- I'd be curious to hear what your docs. have told you about your alcohol intake? Have a great day everyone!",
      "MessageIndex": 498,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 18, 2016 06:19PM violethope wrote: Hello ladies. Sorry I can't follow all the posts. There are just too many but the support you are showing each other is just amazing! Had my injection today for my sentinal node biopsy tomorrow. I must say it didn't hurt nearly as bad as I thought it would. They used a special needle that held both the Lidocaine for freezing and the dye in the same syringe so I thought that was pretty cool! Just looking forward to getting tomorrow over and then the long wait for the results begin as you know. Positive thoughts to all!",
      "MessageIndex": 399,
      "PostDate": "18/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/837244",
      "Title": "January 2016 Surgeries SVGsurvive Jr114"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 15, 2016 12:35PM violethope wrote: Hello everyone. I am fairly new to this site. I will have radiation starting in Feb but I haven't seen my Radiation Oncologist yet so don't know any details. I am looking forward to reading your posts, becoming informed and giving and receiving support!",
      "MessageIndex": 632,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 25, 2016 12:52PM violethope wrote: Patty-thanks so much for the recipe! I am going to buy a Blentec blender this week and this will be one of my first tries! ",
      "MessageIndex": 877,
      "PostDate": "25/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Mar 25, 2016 12:51PM violethope wrote: Congrats to everyone finishing this week! To those who are still undergoing treatment wishing you all the best- you can do this! Your day will come soon!  I finished 16/16 whole breast treatments today and got to ring the bell. My friend took this pic which is the \"pitts\" but I am posting it anyways...haaaa! ",
      "MessageIndex": 2269,
      "PostDate": "25/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Mar 12, 2016 10:09AM violethope wrote: Congrats to everyone finishing this week! Today was #7 out of 16 and no problems yet with my skin. Suspect if that is going to happen it will start next week. Feeling tired but think that is to be expected with all that we are going through. Have a good weekend everyone...hugs!",
      "MessageIndex": 2061,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Feb 27, 2016 11:22AM violethope wrote: Hello lovely ladies. Read many of your posts but little time to write much. I start my Rads on Thursday -16 treatments over 3 1/2 weeks. Enjoy reading your posts and wishing everyone a peaceful weekend!",
      "MessageIndex": 1695,
      "PostDate": "27/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Jan 24, 2016 08:00PM violethope wrote: PattyMeg- can you post what you put in your \"mean green detox machine\" smoothie!? Thanks!",
      "MessageIndex": 863,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "violethope",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226512/profile",
      "Content": "Mar 5, 2016 12:56PM violethope wrote: Congrats to those of you finishing rads this week and to those of you who are so close! I have 2 treatments under my belt with14 left to go. I am fortunate not to have to work while undergoing my treatments so can focus on me. Trying to get exercise everyday and extra rest. Take good care everyone!",
      "MessageIndex": 1873,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}