{
  "AuthorID": "virginiab",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
  "Posts": [
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 20, 2012 10:39AM - edited Jul 20, 2012 10:42AM by virginiab FIRST CHEMO YESTERDAY Because I don't have a port, the nurse in the lab put in an IV for drawing labs and to use later in the morning for the chemo. I was impressed both by her people skills and her technical skills. She was using a vein on the back of my hand (so we could work our way up the arm over the course of the treatments). She ran into a valve in the vein and couldn't get the line fully inserted, but after she drew blood, she flushed the line with saline and was able then to \"float\" the line through the valve and get it in all the way. She wrapped it up for me, and we were able to take a walk around the clinic and the hospital grounds and stop in at the cafeteria for yet another beverage. Then we met with the doc who asked about any symptoms, checked my lymph nodes, answered a couple of questions and sent us over to the infusion area. We were met by my delightful nurse who got us set up in a private room which was rather dark, but my spouse had been paying more attention than I had and knew the the drapes over our glass wall to the corridor were hiding a short hallway leading to the big communal infusion room which is flooded with natural light and we could see the tops of trees through the windows. Much better! Next time we'll sit in the big room, I think, and more fully enjoy the light but they like to do the first session in the private rooms. The nurse got me going with a bag of saline and then with the premeds: steriods and antiemetic. Then we signed the informed consent forms for chemo (very plainly written, for a change). There was some delay while we waited for the Taxotere to arrive and then we started. Other than a little belching while I was getting the taxotere, the infusions were pretty uneventful and boring. We had brought snacks and nibbled our way through cheese and crackers, trail mix, yogurt with granola, and hard boiled eggs throughout the day.  Between everyting I was drinking (I think I had 4 12-ounce sodas while I was sitting there) plus the bogs of drugs flowing in, I had to go to the restroom almost every hour, which was good, because it got me on my feet. I wandered around in the big room a bit and looked at the literature and such out there while I was on my bathroom trips. We arrived at the clinic at 9am and were out of there at 4pm. We stopped for a frozen custard on the way home, then stopped by the drugstore to pick up the prescribed meds. I'm taking steriods for the first two mornings, and the anti-nausea stuff only as needed. I started to feel a bit wonky after supper last night, so I took one then, and I'm carrying one in my pocket so I don't have to look for one if I want it, but so far so good... I'm pretty tired today. I got up early for my exercise class and dragged myself through that. then -- and this is really cool -- a friend who wanted to do something to make things easier for us is sending us his cleaning ladies, so they were here from 9 to 11. And they will be back every 2 weeks. What a relief. With everyting else going on, the cleaning had fallen low on the priority list. It's great to have the house clean. And now it will be great to nap.... Best wishes to all my July chemo sisters!",
      "MessageIndex": 359,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 21, 2012 02:06PM virginiab wrote: Sue49-- Hi! I am generally a fan of as little medical intervention as possible. That's what makes the whole BC thing so crazy. Here you are, a healthy woman and people are asking youmto do crazy stuff. In my case, both radiation (I had lumpectomy) and hormmone therapy had pretty impressive gains in survival. Chemo was iffier: about a 4% improvement in 10 year survival rates. I took a while to think about chemo, but figured I'd really be beating myself up if I got a recurrence and hadn't done chemo. If I had done chemo and still got a recurrence, I could tell myself that at least i did all that we knew to do at the time. What does your doc tell you about the contribution to (10 year?) survival rates that you get from the various components of the plan?",
      "MessageIndex": 370,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 4, 2012 08:52AM virginiab wrote: _Ann_ -- How great to feel shrinking tumors. I think that for those of us who had surgery before chemo, it is really encouraging to hear from someone like you who has palpable evidence of the chemo working. Anyway, congratulations on shrinking tumors!",
      "MessageIndex": 578,
      "PostDate": "04/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 14, 2012 04:26AM virginiab wrote: dventi-- I'm on TC, not TCH, and I had mild sore throat after first chemo. Now, after second chemo last Thursday, I'm having a dry cough with a bit of sore throat. Susan-- Another vote for the group hug! I think I'm doing a bit better after second chemo than first. At least I'm not having the killer cconstipation that I had last time. Now I'm using Miralax to keep everything moving and that seems to be working well. I'm having similar amount of nausea to last time. Once again, my taste buds have taken a sabbatical and the best foods are tasteless; lesser foods are pretty awful. I'm struggling to find things I can tolerate drinking, doing my best to keep hydrated.... I'm not sure what (other than luck) determines frequency and severity of side effects, but I'm appreciating my center's procedures: Premedicating on chemo day with saline, steriods, and anti-nausea drugs, than taking a longer time than some other places with the major drugs. For me, it takes 90 minutes to administer taxotere and an hour for cytoxan, than more salline before I leave. Here's to an easy week for all of us!",
      "MessageIndex": 683,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 17, 2012 04:19PM virginiab wrote: Hi, NatL12-- My strength trining class is a research program at the University of Illinois. Among other things, they are interested in how exercise benefits older folks cognitively. The head of the program and I have spoken a couple of times about lymphedema. Now when the rest of the class uses resistance bands, I use weights. There was a nice study, maybe at Penn State, where they did progressive weight trining for women at risk of lymphedema. They started with 1 pound weights and added no more than one pound per week (meeting 3 times a week).So I'm kinda using that as a template and I'm currently using 3 lb weights. The new routine they started this week has a couple exercises that use the hands to support some body weight. I'm still working out how to adapt those to limit the weight.",
      "MessageIndex": 732,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 19, 2012 02:30PM virginiab wrote: Looking for Ideas about what to Drink I'm curious what you all are drinking. I'm having a hard time drinking enough because everything tastes so icky. I've had the best luck  with hot water and can often get about 8 ounces down. Other than that, I sometimes manage hot or iced tea, ginger ale, or diet 7Up. So what do you drink on those post-chemo days? I could use some more ideas to try out. On a related topic, I found sugarless cinnamon disks at Walgreens that are helping me cover up that nasty taste in my mouth. They are Walgreens house brand Nice, and are smooth so they don't irritate my mouth. I'm sorry to hear that a bunch of you are having a hard weekend emotionally!",
      "MessageIndex": 745,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 10, 2012 08:30AM virginiab wrote: I remember the night sweats when I went through menopause; I didn't get the daytime hot flashes too much. I think that instant menopause has to be more dramatic because of the fast withdrawal of hormones instead of  the normal gradual process. Those of us who got through menopause normally before meeting up with chemo have it much easier, as we got to face the hot flashes and the emotional ups and downs of menopause separately rather than having them bundled up with chemo SEs. I feel for you younger gals! Please know that the menopause symptoms will calm down and (for most women) disappear entirely with time. It does get better!",
      "MessageIndex": 931,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 11, 2012 08:13PM virginiab wrote: I have an appointment with my MO tomorrow to nail down a chemo plan. We already had a first meeting where she said chemo was a something I had to decide about and gave me the statisticql numbers for the theoretical benefit of chemo for me -- which was about a 4% difference in the 10-year recurrence possibility. I've decided to do it. She also offered a trial (AC/T vs TC x 6). We met with someone from the study who walked us through the whole informed consent document. The TC sounds better to me than the AC/T, so I don't want to allow some random number generator to make the decision. After reading articles on this site, I do want to talk to the doc about doing the T in weekly doses,  and also about the possibility of simultaneous radiation, as this seems to produce better results. It will be good to have a definite plan, and to get going. I expect that I will be a July chemo girl.  I'm wishing all of us relatively easy -- and delightfully effective -- treatment!",
      "MessageIndex": 192,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 12, 2012 10:35AM virginiab wrote: Hi, boobzilla-- It sounds like it's getting easier to settle into the idea of doing this. It's good to have a partner at your side as you go through it; I can't imagine what I would be doing without my partner of 24 years being here to support me at each step.",
      "MessageIndex": 198,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 1, 2012 01:36PM virginiab wrote: Maddie-- How nice that you got away for a while after finishing chemo! I did get my cruise scheduled. I'll be going in early January. It gives me another set of days to count down, as I count off the radiation treatments. Welcome back!",
      "MessageIndex": 1323,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 22, 2012 07:41PM virginiab wrote: Feeling blah, constipated, belching like crazy -- three days after my first chemo. I looked up the Zofran I'm taking for nausea and see that it suppresses serotonin -- well, that certainly explains the blah feeling! I couldn't even manage a walk today. Ugh. I hope tomorrow is easier!",
      "MessageIndex": 374,
      "PostDate": "22/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 23, 2012 09:19AM virginiab wrote: CityFi-- I don't know about other drugs but I know the nuse explained that teary eyes were a common side effect of Taxotere. I hope you bounce back pretty fast.",
      "MessageIndex": 385,
      "PostDate": "23/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 20, 2012 10:18AM virginiab wrote: Clarity 1210-- I had a positive node (only one was removed) and I am scheduled for TC x 6. You can see the rest of my stats at the bottom of the post, except I don't think it shows up there that I am 66 and have more than a few years of menopause behind me. My doc was happy to look over articles I brought in from this website and she would turn to her computer to look for the original research article and talk about how that might (or mostly did not) apply to my situation. She (and another MO I had talked to) both gave the same options of AC followed by T or the TC regimen. Because I see lots of women on here getting 4 TC treatments, I asked her if we actually KNOW that 6 work better than 4. She said it is not a settled question, and that if I got to 4 seesions and wanted to bail out that I could do so. I love this doc! All the best to you.",
      "MessageIndex": 357,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 1, 2012 04:44AM virginiab wrote: I'm feeling fully myself now, after 1st TC on 6/19. I had some problems with nausea and killer constipation. Yeah, we talk a lot about poop here. Anyway, I seem to have my gut regulated now. Whew! It really helps to read about other folks' experiences, so thanks to all who post and best wishes to both those who post and those who just reach out by reading -- you are also part of this community!",
      "MessageIndex": 522,
      "PostDate": "01/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jan 15, 2013 05:58AM virginiab wrote: I had a small melt-down today when I realized that although I had just returned from my post-treatments vacation, I still needed the Mandatory Nap at 4PM. I just imagine I'm all recovered, but I'm not. Yet. Patience is elusive....",
      "MessageIndex": 1606,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 2, 2012 07:53PM virginiab wrote: Minor Case of Hair Panic  Well, my hair has started to fall out, just on schedule (14 days) and I am not too crazed about losing the hair, but am a little nuts over whether I am prepared to cover my head with nice-looking things. I have some hats and scarves, but suddenly it seems like nothing goes with my clothes. I know I'm being unreasonable and a little freaky about it. I just ordered another bunch of sale hats from TLC.org and I may or may not actually need them. Anyway, there's a calmer part of me standing back from myself and watching this show.... I guess I'll go upstairs now and sew myself another headwrap. I found some nice soft, light, cute leftover fabric in my sewing stash... Best wishes to all the sisters, especially the 7/19 group!",
      "MessageIndex": 550,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Apr 20, 2013 12:24PM virginiab wrote: This week I realized that my nails are strong again, no longer tearing if I look at them the wrong way. They still don't look too great: dry and with ridges -- but they are functional again. Hooray!",
      "MessageIndex": 1716,
      "PostDate": "20/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 27, 2012 09:28AM virginiab wrote: Madelyn-- The thing that helped me last time with the chemo taste was cinnamon flavored sugarfree hard candy from Walgreens. It was their house brand, Nice. I don't know if it will work for you, but they helped me last time and I hope they'll help me again after chemo #3 coming up this Thursday.  Hang in there!",
      "MessageIndex": 812,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 27, 2012 09:20PM virginiab wrote: mamabr-- I love the phrase \" the total bald mom lecture\" -- my laughter at the words almost scared my cat into jumping off the keyboard.... Yeah, it's easy to lose everyday perspective, but congratulations on actually cooking spaghetti sauce!",
      "MessageIndex": 824,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 8, 2013 07:46PM virginiab wrote: Yeah, Maddie, when you said you have a real mop of hair, I thought that my hair is very mop-like! I feel a little like a Raggedy Ann doll with yarn hair--if Raggedy Ann was partially gray.... Had my 18-month mammogram and all is well.",
      "MessageIndex": 1810,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 30, 2012 09:02PM - edited Aug 30, 2012 09:03PM by virginiab My skin is looking splotchy. I went in search of a foundation that provides better coverage. For those of you whose skin has improved -- how cool is that? My hair loss is also a bit splotchy. I notice that one of my sideburns is still growing the pre-chemo hair, while the other is quite bare. But it seems like most of the original stubble is gone and in its place is short, sparse, feathery gray hair. Brows and lashes are sufficient for now, but I have been doing a little practicing for a time when I need to use makeup to replace the missing hairs. I like the brow powder and have used it in the past because my brows just kind of disappear, especially from a distance, so I used the brow powder when I was making a presentation.I'm trying to rediscover the right touch with the powder.",
      "MessageIndex": 845,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 16, 2013 09:40PM virginiab wrote: Yes, I still have moderately curly (or very wavy) hair. I'm not sure which term to use for it. The curliest is in the back, where I rarely bother to look.... I still haven't really learned to handle it, but I'm happy to have a full head of hair, so I try to be philosophical. This works most of the time.... ;-)",
      "MessageIndex": 1816,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 31, 2012 08:06PM virginiab wrote: Odd thought the day after chemo.... With my face all red today from the steriods, I looked in the mirror and tried to figure out what I looked like. I think the red on my face makes me look like one of Santa's elves gone rogue....  My other odd thought today (as my taste buds faded away in late afternoon) was that when you settle into the chemo routine, it's kind of like a weird hobby. lots of hobbies training for races, landscaping,home improvement) have predictable physical challenges, some periods of relative calm in the middle, then more chaos, before the thing is resolved at the end.  Thinking of it as an odd hobby makes it seem moremanageable somehow...at least it does today. Hugs to all. ",
      "MessageIndex": 855,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 10, 2012 08:50PM virginiab wrote: Hey, ItsAllTemporary-- I am currently struggling with a decision about 4 or 6 rounds of CT. Like you, I have finished the first 3. When I signed up for chemo, the doctor had previously talked about 4 rounds, as part of a clinical trial, and then she talked about 6 rounds when I declined the trial. So I asked her if we actually know that 6 rounds are more effective than 4. She shrugged her shoulders in a \"no, not really\" gesture and said we DO know that 6 rounds of AC are more effective than 4 rounds of AC. So she said I could choose. She set up the schedule as if I'm doing 6, so they only had to run stuff by the insurance guys once, but on the orders that went to the chemo nurses it said \"4 or 6 rounds.\" So I am at the point to decide. I'm leaning toward 4, but I'm still collecting what little information I can find. Today I browsed through 29 pages of article descriptions on PubMed. I found some interesting tidbits, but no actual relevant data. Anyway, I understand that 6 looks like forever from here, and yet 3 means that it is halfway done. I can't really claim that it's all downhill from here because we both know it's a bumpy ride. Even though our diagnostic summaries look pretty similar, you are certainly younger than my 66 years and that's a whole other set of issues for you, and probably what justifies 6 rounds for you.  I'm wishing you a smooth ride the rest of the way, even as a lot of our cohort wanders off to their respective next steps.  I hope and expect that most of us will keep coming back to this thread for a long time, because we will always be women \"Starting Chemo in July 2012\"-- even long after the chemo has ended. Hugs to all.",
      "MessageIndex": 935,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 30, 2012 02:12PM virginiab wrote: I'm just home from chemo #3. 3 down; 3 more to go. I am on a 3 week schedule for chemo and told my doctor I wanted to avoid Neulasta if possible, or for as long as possible. My white cell counts continue to be good, so I'm pleased to have avoided Neulasta so far! It was a quiet day in chemo-land. The lab nurse couldn't get a vein in my lower arm so we went to the inside of the elbow spot; she put in a hep-lock, so we were all set up for the chemo.Idon't have a port because I really like to avoid any medical procedures that aren't absolutely necessary--especially surgical procedures. While we waited for lab results, my spouse and I worked on a jigsaw puzzle that was laid out on a table in the main reception area, then went up and saw the doc and got the okay for chemo. At chemo, we played a game of Scrabble, chatted with a few of the nurses, then wandered over to a puzzle table and worked on another puzzle. And then we were done. Easy. I'm enjoying the belief/delusion that an easy chemo day means an easy post-chemo week....",
      "MessageIndex": 842,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 19, 2012 02:59PM virginiab wrote: Life-- I'm really tired, too! We've been on the same chemo schedule and this round I am just feeling worn down. A few tiresome symptoms (after the first 10 days of feeling like I have the flu or something), but just tired. Maybe it's just a cumulative effect -- or maybe some astrologer could explain it as having to do with the planets. Whatever the cause, I could really use a few nights of sleeping 10 to 12 hours....",
      "MessageIndex": 1018,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 11, 2012 03:30PM virginiab wrote: Today marks 3 weeks since my final chemo -- and thus the day that my MO said I could have a needle biopsy on the nodule on my thyroid that showed up on a breast MRI. I went in for the needle biopsy (which was incredibly easy) this afternoon. Now I wait 2 to 4 working days for the pathologist to so his (or her) magic. I understand that most of these thyroid things are benign, so I am doing my best to assume that is true of mine.  I really want to reschedule the cruise I had to cancel because of chemo. I hope that by the time I have the thyroid results I will also have my readiation treatment schedule and I can start looking forward to a cruise in December. Hugs to all of you!",
      "MessageIndex": 1192,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 12, 2012 08:08AM virginiab wrote: ItsAll Temporary-- Speaking of weird hair-- I have some very light colored hair (previous hair is/medium ash brown with some gray). I'm not sure if this hair is white or pale gray, and it started soon after I started losing my \"regular\" hair. It is very sparse, and wants to stand up straight. It gives a nice Mad Scientist look, I think! EmilyBrooke-- What a dillema you have now! It can be good to just take your time to make whatever decision is right for you. In the end, you just have to take in all the information from various sources, sift through it, then trust yourself. I'll be thinking of you!",
      "MessageIndex": 1201,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 3, 2012 12:34PM virginiab wrote: This morning I went back to my exercise group for the first time since my most recent chemo. Oy! It was really hard. When I was panting after wallking one block from the parking lot to the campus rec building, I knew this was going to be a challenging morning. I mananged to struggle through one of the 2 sets of each exercise they were doing and used the time while they did the second set to recover. Really, it just became my goal to make it through the session without fainting or puking.... so I guess I was successful. I hope the next session on Friday morning is easier! Then I went to my first meeting with the radiation oncologist, which went very well. I asked about lymphedema and he gave me the best answer I've gotten so far about using my right arm. He said if you decide to do something like moving the sofa by yourself and it caused pain (damage) in your armpit/lymph nodes area, then don't do that thing again. This makes a lot more sense than the \"never lift more than x pounds\" kind of answers, which are totally impractical.  I like this doctor a lot. He went on to ask about my insurance and to tell me I could get bras and a partial prosthesis to balance out my big breast/not so big breast look.  Now I could use a nap....",
      "MessageIndex": 1136,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 11, 2012 07:48PM virginiab wrote: teeballmom-- I love to cruise and don't care too much where we go. We will cruise out of Florida, probably Miami. I can get free airfare from Southwest with my points from my SW credit card. So we'll fly into Ft Lauderdale.  I'm guessing I may be pretty exhausted, so may stay on the ship in a couple of the ports and maybe look for a fairly passive excursion, like a bus tour, in one port. We always enjoy the ship when it's fairlly empty in port and in ports we've been to before we often just get off for a short walk, then get right back on the ship. If I can get clear to travel by Dec 7, we can take an 8-day cruise on a new ship, the Carnival Breeze. Otherwise, we'll probably take a 6-day ccruise on the same ship the following week. If we can't make that date, we will have to make different vacation plans, because the cruises that include Christmas or New Years are riduculously expensive and we have to take a vacation by the end of the year for my partner's work.",
      "MessageIndex": 1196,
      "PostDate": "11/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 12, 2012 09:40AM virginiab wrote: I just got an email saying that someone I don't actually know is having surgery for pancreatic cancer today and asking us all to send healing energy, using a song I had never heard, so I went to check it out. It starts \"This body is healing...\" and I liked it a lot. The title of the song is \"Connected\" and the artist is Celia. If that sounds interesting, search for it. The lyrics are on her website, as well as the opportunity to listen to the whole song for free. I'm putting it on my mp3 player.",
      "MessageIndex": 1203,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 12, 2012 06:13PM virginiab wrote: Ii got a call from the MO's nurse to let me know the thyroid biopsy was benign. Whew! Now I just have to wait for my radiation schedule to start making vacation reservations....",
      "MessageIndex": 1204,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 16, 2012 11:54AM virginiab wrote: emilyb-- Good for you for continuing to pursue the question of radiation. It surely seems mysterious to me (Not a doctor!) why the tumor board favors it. Is it just because you are young and they figure to be as aggressive as possible because any stray cells have a lot of years to grow? Or are they just afraid of lawsuits? Or what? A second (and possible third) opinion seems like a great idea!",
      "MessageIndex": 1228,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 24, 2012 07:45AM virginiab wrote: NatL-- I have a friend who had lymphedema after BC surgery. She got a few months of treatment and instruction on doing the drainage maggase herself...and after a few months the lymphedema was gone. Now 5 years gone. I'm praying for the same result for you! Hugs to you...",
      "MessageIndex": 1273,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 24, 2012 06:09PM virginiab wrote: Life-- Conrratulations on the disability going through. What a relief that must be!",
      "MessageIndex": 1279,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 19, 2012 12:23PM virginiab wrote: Eyelash Revelations 8 weeks post final chemo, most of my eyelashes are gone but I spotted some new fuzz at the edge of my eyelids, so I got out the mascara wand Sunday morning to see if I could get some mascara on the new fluff without actually inserting the mascara wand into my eye.... And voila! I have eyelashes like Morse Code -- a few dashes and lots of dots.",
      "MessageIndex": 1431,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 19, 2012 06:07PM virginiab wrote: Congratulations, Ann!",
      "MessageIndex": 1433,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 26, 2012 03:32PM virginiab wrote: Hi, Suzilla-- I did not take the same drugs as you, and I was on a 3-week schedule to start with, but I objected to the automatic use of Neulasta, and my MO said we could just wait and see the results and the worst case would be that I would come in for chemo and instead have to start a series of Neupogen injections with chemo delayed for a week. Well, the result was that my blood tests came out okay enough to do all of my chemo right of its 3-week schedule. It seems pretty harmless to try it without the Neulasta and find out how quickly your body bounces back from each round of chemo. Best wishes for great results!",
      "MessageIndex": 1469,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Dec 21, 2012 05:56PM virginiab wrote: Congratulations to everyone celebrating milestones and especially to those celebrating clear Margins! I am celebrating that the world did not end last night -- because if I had believed that it would end, I could have bypassed chemo. So I'd be mad if I'd gone through that and ended up immediately dead by some Mayan curse or something! Happy Solstice to all! The sunlight will bless us for longer each day now....",
      "MessageIndex": 1564,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 26, 2012 09:12PM virginiab wrote: Suzilla-- Well, I can answer the Biotene part of your questions (no experience with Taxol)-- the mouthwash I used is Biotene Dry Mouth Oral Rinse. I just used it at night, and it did help. During the day, I just sipped water or sucked on sugarfree Cinnamon candies I found at Walgreens.",
      "MessageIndex": 1472,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jan 17, 2013 08:50PM virginiab wrote: Wow, Susan, I do wonder if you are the only one still waving the July 2012 Chemo flag, but even if you are the last one getting chemo, know that some of us are still here listening, even when we don't say much. I hope you can feel our hearts supporting yours!",
      "MessageIndex": 1614,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 1, 2013 09:03PM virginiab wrote: I had my one-year from diagnosis mammogram today. They took a LOT of images, especially of the breast that previously housed the tumor, and the tech went to consult with the radiologist and came back to report that they didn't find anything to suggest any malignancies and that I should follow up in six months, as we had previously discussed. So, year number one has passed and I passed my test. Whew! Here's hoping for good results for others as well!",
      "MessageIndex": 1720,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jun 28, 2013 09:29PM virginiab wrote: Maddie-- Congratulations on the good test results! (Sorry I have no info on the nipple issues)",
      "MessageIndex": 1757,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 29, 2013 07:17PM virginiab wrote: Congratulations, Susan on your good news! What a relief!",
      "MessageIndex": 1784,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 18, 2013 09:37PM virginiab wrote: It's a year ago this week that I had my last chemo and I'm happy to report that this week I realized that my bangs had grown out enough to be below the tops of my eyebrows. I have had a few haircuts in the interim, to tidy things up, but it was nice to see my usual past sign that it was time for a haircut: the long bangs. This evening I got a cut.",
      "MessageIndex": 1802,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jan 5, 2015 08:11PM virginiab wrote: I'll report in, too. I'm happy, healthy, and looking forward to my 3-year mammogram in May, I've had some issues with pain, presumably from the Femara. At this point I did a year of Arimidex and will finish a year of Femara next week. I'm doing my best to hand in there with the anti-hormonals and am hoping my present pain issues will either just fade away on their own or I'll learn how to manage them as time goes on.",
      "MessageIndex": 1871,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 13, 2012 11:16AM virginiab wrote: It's official that I will start chemo this month. I have the orientation to chemo on Tuesday the 17th and my first chemo on the 19th. I think there are several of us starting on that date. I'm doing TC x 6, every 3 weeks. I feel like I'm in very good hands with my oncologist.",
      "MessageIndex": 214,
      "PostDate": "13/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 18, 2012 05:48AM virginiab wrote: Today we met with a nurse for the pre-chemo education session. The facility is pleasant, with about 10 private rooms on one side and a large area (with a long wall of windows) broken up by furniture into several smaller areas on the other side of the hurses' station. There is a balcony on each end if you want to hang out outdoors while you are getting your treatment, and there is an area which is only for use by breast cancer patients; this area is separated from the bigger room by a stone fireplace.  Thursday is my first treatment. Sometimes I wonder why I decided to do this, but what the heck, here we are....",
      "MessageIndex": 297,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 29, 2012 07:48PM virginiab wrote: FernF-- I'm glad you found us here. Lots of us are on the TC chemo, so you'll be able to hear from folks who are a few weeks ahead of you. I swear, sometimes it's just good to hear that whatever you are experiencing has been experienced by others. Dventi-- Your scalp condition worries me. I think you should call your doc or onc nurse and ask their advice.",
      "MessageIndex": 483,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 2, 2012 05:26PM virginiab wrote: Melrosemelrose--  I got some great scarves from Headcovers, too. Thanks for the local suggsetions for buffs. I'll check them out.  Well, My sweetie and I shaved my head after she got home from work. It was good to get it done before the cleaning lady comes tomorrow.",
      "MessageIndex": 559,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 17, 2012 12:55PM virginiab wrote: Susan HG-- You asked about the heartburny, belchy thing. Yeah, I've definitely got that. Pepcid does seem tto help with the burning part of it for me. I also have a shallow, dry cough that I think is part of the same little set of symptoms. Are we having fun yet? Eight days out from my 2nd chemo, I was able to go to my strength training class -- which totally exhausted me. But at least I worked out!",
      "MessageIndex": 728,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 8, 2012 07:47PM virginiab wrote: CitiFi-- What a nice piece. Thank you for sharing it. I felt like I could see you and the girl in that chair!",
      "MessageIndex": 1161,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 13, 2012 08:22PM virginiab wrote: Thanks to everyone who is helping me celebrate the benign thyroid biopsy! I had a wierd chemo response in that my very dry and itchy skin got less itchy during chemo -- and maybe less dry. Now three weeks and 2 days post final chemo, my skin is itchy in all the usual spots again. Pretty harmless,but just wierd that chemo would affect that.... I hope folks are having a good weekend, with few side effects (wierd or otherwise).",
      "MessageIndex": 1213,
      "PostDate": "13/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 16, 2012 11:05PM virginiab wrote: PAeagles-- What a good use of your cell phone!",
      "MessageIndex": 1414,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Dec 20, 2012 10:48PM virginiab wrote: My lashes are doing well, about half their normal length, but really full. My hair is wierd: a mix of very soft white hairs that grow fast and not-as-soft brown hairs that grow more slowly. I've had soft, light cheek hair for some years that needed periodic shaving. Well, it's back in full force. At least as much hair and I swear it's growing faster than it used to. Oh, well. I'm recovering nicely from radiation, which ended 8 days ago and generally feeling pretty good. I've still been needing a bit more sleep than usual; 9 hours has been about right. BUt yesterday, I woke up after 9 hours, went to the bathroom, came back and sat on the bed and realized I needed even MORE sleep, so I slept another 2 hours. I'm trying to listen to my body, except maybe when it says it doesn't want to work out...",
      "MessageIndex": 1556,
      "PostDate": "20/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 23, 2013 04:59PM virginiab wrote: Congratulations on your good news!",
      "MessageIndex": 1742,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 16, 2018 02:41PM virginiab wrote: it can be really hard to wait for results and wonder what things mean. While I am not qualified to say whether or not your mom is a hypochondriac, I do believe that her practice of bringing up symptoms is a practice that could save her life if her previous cancer ever does rear its head again. It is worrisome to take your little bundle of symptoms to the doctor so that together you can sort out which may be related to the previous cancer, and it is crazy-making sometimes to wait for tests and for test results. You probably already know that most times these symptoms are nothing, or are unrelated to the cancer, but this kind of due diligence in reporting could catch something early, so it is worth doing. It is okay to share your fears with your mom, and maybe let her share hers with you. Bless you for being there and for caring. Big hugs from the prairies of Illinois!",
      "MessageIndex": 2,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/865923",
      "Title": "Worried about my mom and metastasis daughterofmom JoE777"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 14, 2012 02:56AM virginiab wrote: It seems there are a bunch of us starting next week. Ellendou--It's good to hear that you didn't have a lot of side effects; that's an encouraging example for those of us who haven't started yet! Melroserose-- I've heard about icing the nails. I'll discuss it with the doc. I'm sure nail polish is a good idea; I'll have to buy some over the weekend. The doc did mention sucking on ice to help prevent mouth problems. I hope everyone has a calm weekend. I know I could use a chance to get some extra sleep....",
      "MessageIndex": 222,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 2, 2012 11:57PM virginiab wrote: MaddyMac-- Congratulations on keeping down the single cracker and 2 sips of juice. It's one step at a time around here (and sometimes one step backwards in the mix) and we have a right to celebrate the tiny triumphs. ramols-- Thanks for the reminder about buffs. I almost ordered one recently, but freaked out when they wanted $6 to ship a single buff. I guess I'll just have to get over it. Lifeonitsside-- I'm sorry you're having a hard time with the hair thing. I think I'm doing okay with it, but when the time comes to shave it,who knows how I'll react??? I can feel my scalp all wierd today, so it's just a matter of time before we go from a bunch of hair in the tub to a LOT of hair relocating itself by gravity.",
      "MessageIndex": 555,
      "PostDate": "02/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 3, 2012 01:05PM virginiab wrote: Another thought on hydration When I couldn't stand the taste of water (and I usually like it), I found filtered water was better than tap water. Better for me meant less icky tasting. But even better than that was hot water. I just nuked a mug of hot water and as long as it stayed hot or reasonably warm, I could get it down. When it got cool, it was icky again. Ann, maybe it will work for you. (Maybe not, but it's a cheap experiment). ",
      "MessageIndex": 570,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 6, 2012 05:35AM virginiab wrote: Melrosemelrose-- Congratulations on your \"graduation day\" Tuesday. What a relief to leave the CT behind and get on with the next step in the journey. And congratulations on not needing radiation, too. The combination of finishing TC and not needing rads must make you feel great!",
      "MessageIndex": 602,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Aug 19, 2012 07:24PM virginiab wrote: Thanks for the drink suggestions! I really appreciate new things to try.",
      "MessageIndex": 750,
      "PostDate": "19/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 1, 2012 09:54AM virginiab wrote: Thanks to everyone who gave me beverage suggetions a couple of weeks ago. I was just at the end of the foul-tasting portion of the game, so didn't get to try all of them out at the time, but I did stock up on things you suggested and am now starting to drink them. Right now I'm working on something that is about 2/3 sparkling water (made with my Soda Stream maker) and 1/3 light cranberry juice. This is unoffensive and (dare I say it?) almost tasty! I did try grape juice/sparking water combo at the end of my last cycle and that worked well for me. I'm going to try lemon juice/sparkling water when I tire of the sweet stuff. Palin hot tea is also pretty good, and plain iced tea is not bad for me. I read something about 20 minutes of brisk walking helping you generate white blood cells, so I'm trying to do better with exercise during the not-so-great portion of the cycle. I managed 5 minutes on the exercise bike this morning; hoping to do more later, but I know the mornings are usually best for me during this part of the cycle, so I'm trying to do my best here in the mornings. I noticed last night that I have no hair below my neck anymore. I can see the first visible gap in my eyelashes. It's time to review that great video from the woman with permanent hair loss....",
      "MessageIndex": 860,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 5, 2012 05:38AM virginiab wrote: EAgles FAn-- COngratulations on finishing chemo! Even though you are still facing the last round of side effects, it has to be a great relief to know you don't have to do this all over again in a couple of weeks! I wonder how much the lack of that dread/stress will ease your side effects this time?",
      "MessageIndex": 889,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Sep 20, 2012 04:44PM virginiab wrote: FINISHED WITH CHEMO Well, I'm finished with the actual chemo treatments; I still have to get through the last round of side effects. I now have appointments for a 10-week follow-up with the MO, a first appointment with the RO, and an appointment for a needle biopsy of a growth on my thyroid that showed up on a breast MRI around the beginning of chemo. My MO didn't want someone doing a biopsy during chemo, so we have been putting this off. I'm not too freaked about it, but I'm not thrilled either! I usually sleep pretty well in the days after chemo, except the first couple of nights when I'm on the steriods. But even on those nights, I just wake up more and get a poorer quality sleep but I still get plenty of sleep. If pesky scheduling doesn't get in my way, I'll generally sleep 10 to 12 hours a night for the first week and a half, and 8 to 10 for the next week. I know from many of you how lucky I am to be able to get that sleep. Oh, I wake up a couple of times a night and get up to pee, but then I easily fall back into sleep. At the end of my chemo session today they gave me a nice printed summary of the drugs and dosages I had, plus a summary of the lab results. I had just been reading that we should get and keep that kind of information for future reference. They also had printed a certificate for finishing chemo and all the nurses there had written little notes on it. Very sweet. I hope we all have easy treatments and minimal side effects in the next little chunk of time. Hugs to all.",
      "MessageIndex": 1033,
      "PostDate": "20/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 14, 2012 01:03PM virginiab wrote: NatL-- the first time I saw PFC I inserted what I thought was the most appropriate word for the F, just as you did. But here at least it does (as you suspected) mean Post FINAL Chemo.  ItsAllTemporary-- Yup, like you, I am on my way to radiation. I have had the initial consult with the RO and the session with the CT scan and many Sharpie marks on my breast. Now I am waiting (none too patiently!) to get called in for the initial check in the real rads room and then get started (and get done....). In addition to posting here, I am also posting on the Fall Rads board and have begun reading a long Post Radiation board to learn more....",
      "MessageIndex": 1217,
      "PostDate": "14/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Oct 30, 2012 08:27PM virginiab wrote: I had such a talk with my eyelashes today. I had just applied mascara and where I have lashes in a little strip, then blank space, then 2 lashes, another space, 2 more lashes. . .  the pairs of lashes wanted to stick to each other, making them only 2 lashes instead of 4. I expalined to them that this was unaccaptable as I worked with my little comb to get them to show themselves. . . .",
      "MessageIndex": 1309,
      "PostDate": "30/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 20, 2012 12:56PM virginiab wrote: Maddie 57-- I finished chemo with only a few obvious \"holes\" in the line of my eyelashes, but they kept falling out for about 6 weeks. My eyebrows also got extremely sparse. My brows were already so light as to be almost invisible, so I would have to do contortions in the mirror to get them backlit enough to see if they were still there. Now I have peach fuzz type very short and light colored hairs growing in both places, so it seems that help is on the way. I hope your lashes grow back is quickly!",
      "MessageIndex": 1436,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Dec 6, 2012 03:12PM virginiab wrote: Hi, boobzilla-- Lumpectomy is a pretty easy procedure for most poeple. Even when you add in a sentinel node biopsy, the recovery is neither long nor particularly painful. I was tired and dopey for almost 48 hours, but that was because of the anesthesia (I tend to over-respond to drugs). I never used the prescribed painkiller, just managed with ice, tylenol, and ibuprofen. I know we all worry about lymphoma, and it took me several months to settle down and decide that I will take some precuations against it but will not live my life never using that arm for much of anything! If I have trouble with it, I'll have to deal with it at that time, but I'm doing weight-bearing exercise in modest amounts (which I hoope to increase). I am just finishing radiation. It is much much much easier than chemo. Obviously, everyone has her own experience, but for me the main side effect was fatigue, especially after the first few weeks. I had less than a week of any real skin problems; the area below my breast (right where the band of a bra goes) was peeling and open for several days. They gave me some nice silicone dressings to calm and cushion the area. That has settled down now and it is still peeling, but like a sunburn with no open, moist areas. Now that my radiation is just \"boosts\" to the lumpectomy & SNB area, we won't be provoking that area of skin any more, so it should heal up pretty easily.",
      "MessageIndex": 1508,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Dec 14, 2012 09:02AM virginiab wrote: Madelyn-- In regard to brows and lashes -- I finished chemo exactly 2 months ahead of you and my lashes are now full (but short), so you should have lovely lashes for that wedding. In early November I ordered Wunderbrow from Soft Surroundings to make some simulation of eyebrows. Their shipping was delayed and when I got the package this week, I just packaged it up to return it. It's too late--my brows are back. I have sufficient eyebrows to color with powder shadow or one of those mascara-like brow wands. Mostly I have been using a lip brush to brush some eye shadow into my brows. I bought one of those palettes of 100 eye shadow colors for $10 at Walgreens and found some great colors in there for my pale brows. If you need 4\" for hair extensions, I think you should develop a Plan B of an adorable short hairstyle, because it's not a sure thing that you will have 4\" in time for the wedding....",
      "MessageIndex": 1538,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Dec 31, 2012 10:33PM virginiab wrote: I agree that radiation was SOOO much easier than chemo! I managed to keep participating in a Monday-Wednesday-Friday exercise class during this whole adventure (with a week and a half off in each chemo round) but finally the exhaustion of chemo made me stop about 10 days before the end of radiation. Now, it's less than 3 weeks since the end of radiation and I'm feeling great and have been exercising on my own (the class ended). Happy New Year to all of us who were in chemo in July!",
      "MessageIndex": 1575,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 10, 2013 01:42PM virginiab wrote: Maddie-- I suspect that your sister is as frustrated and exhausted as you are about this long journey. The way she expressed it was thoughtless and clumsy, but I would put more trust in the way she has been there throughout this journey than in one tactless remark. I know I've stuck my foot firmly in my mouth at times, and I hope those I care about will forgive my clumsiness of language! I hope that weirdness in your chest turns out to just be a meaningless oddity rather than something worse!",
      "MessageIndex": 1729,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 11, 2013 09:00PM virginiab wrote: Yeah, it's amazing how the old \"I'm sure it's nothing\" before cancer would heve meant just waiting it out to see if it resolves itself. Now, we say \"I'm sure it's nothing\" and we phone our doctors to get it checked out. I mean, I don't want to be paranoid about every little symptom, but have to pay attention to any symptoms that even MIGHT indicate metastasis or a new tumor. It's just the way it is now....",
      "MessageIndex": 1732,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 4, 2013 09:52PM virginiab wrote: Okay, Susan, you've aroused my curiosity. What is a lymphoscintigraphy? The word suggests that it has to do with the lymphatic system and the test produces an image. Is that anywhere close to what it really is?",
      "MessageIndex": 1768,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Nov 30, 2013 09:05PM virginiab wrote: Maddie-- Thanks for sharing the information about Stride.",
      "MessageIndex": 1821,
      "PostDate": "30/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jan 9, 2015 07:38PM virginiab wrote: i've been experimenting with using a combination of Tylenol, Claritin, and Motrin. It works a fair amount of the time, but not all the time. My basic plan id to take 2 extended release tylenol and one 5 mg claritin every 8 hours, then supplement with motrin when needed. The 5 mg Claritin comes in the form of their \"Reditabs,\" fast-dissolving little lozenges. I haven't been able to find a generic version of them. They are supposed to last for 12 hours, but don't last that long for me. I'm also taking glucosamine/chrondoiton tabs and also turmeric in capsule form. Some days go pretty well. Others, like today, are pretty frustrating. I've got a call in to my doctor about it as I'm thinking of taking a break from the AIs and starting fresh again in 6 weeks.",
      "MessageIndex": 1873,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 7, 2012 05:01PM virginiab wrote: About 10 years ago I had a PICC line put in for IV antibiotics for a surgical wound that would not heal(unrelated to breast cancer). It was pretty easy to manage. I had it in for about 10 weeks. I was getting a liter of antibiotics most days. Days when I was not getting the IV I had to flush the line with a prepacked syringe of saline. Easy. Now, why they are calling you for an appointment before you have been able to decide on chemo... well, that's a little mystery or a big mistake. I hope all becomes clear to you soon!",
      "MessageIndex": 5,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/790220",
      "Title": "PICC lines ridergirl virginiab"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jun 21, 2013 05:44PM virginiab wrote: I had a wound vac for healing issues after an ankle replacement a decade ago, so not really the same, but I do have some familiarity with the wound vac. I suspect that the issue is not about the wound vac, but that they most likely placed the TE under the chest muscles, as I understand that is where they place TEs. When you lost a bunch of tissue to infection, that included the chest muscle that (at that point) was probably on top of the TE. Now you are left with just the skin graft between your ribs and the world. I suspect that it may take a year or two before everything is really settled in that area, and that you may have very little between the ribs and the world in front of you, but as the skin graft continues to heal and grow its own new cells, it may well become more comfortable. So keep massaging and be patient. My thoughts are with you!",
      "MessageIndex": 5,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/806413",
      "Title": "Anyone's Skin Stuck to Chest After Wound Vac Treatment? TIGHT! Strike_Two Strike_Two"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 7, 2012 05:33PM virginiab wrote: I'm also new here. I was diagnosed last month, had 2 biopsies (to get clear margins). This site has already been such a help to me! The articles, especially the research articles, are so readable that I can find information that is relevant pretty easily here. Today is my first posting on the boards here. I am currently trying to figure out a treatment plan. My surgeon sent me to a MO at his same clinic. This MO was NOT a good match for me, but the surgeon's nurse offered more referrals and I now have a MO that I really like and trust. One thing she offered was a clinical trial of AC/T vs TC. This led to me learning a lot more about chemo regimens. I think I will not participate in the clinical trial, but I am very interested in TC for chemo, and I also want to talk to a RO about concurrent radiation, instead of waiting until chemo is over. I have been in a fog with all the options, but things are starting to get clearer this afternoon. I appreciate all the folks who have posted on these boards; it was a good source of information about how women fare with the TC chemo. The research articles helped me get a better idea about what was working best. In many ways, treatment choices seem like a big gambling game, but getting good information and good guidance at least allows you handicap the horses and have better odds of pacing your bets on the likely winners. I'm wishing the best for everyone who has been posting on this thread! Virginia",
      "MessageIndex": 49,
      "PostDate": "07/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/789853",
      "Title": "Any other newbies? cpp christina0001"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 28, 2018 03:07PM - edited May 28, 2018 03:09PM by virginiab I am now 5 weeks past my mastectomy and finally have a couple of things figured out for myself. When I want to go half-flat, I have been wearing Fruit of the Loom front opening sports bras. It took me a bit of retail experience to figure out that just one size larger was uncomfortable, two sizes larger than my usual bras was less uncomfortable, and three sizes larger was just right. I wear a 34C bra, but the Fruit of the Looms I now like are size 40. If you want to try them, they are cotton bras with front hook closure (about 8 hooks) and are sold in packages of two for about $12. I find the bra gives enough support to my one breast that I am comfortable walking in it. I suspect I could run in it, but I am not ready for running any time soon! These bras have something stiff at the very bottom of the closure but I just unhook the bottom hook and the stiff part moves away from me. If my chest wall is feeling uncomfortable and wants a little pressure on it, I put some padding in the bra on the surgical side. I bought half a dozen hawaiian shirts on eBay, for about $8 to $9 each, and love them as a replacement for my usual t shirts. I picked patterns to keep the eye a bit distracted, so these are great when I am half flat and when I am wearing the various experimental prostheses that wander from being at the same height as my other breast. I find the hawaiian shirts are comfy for working out, running errands, or just hanging out. I plan to wait until early August for a fitting for prosthesis and bras because then I can go to the shop at the cancer center at Ohio State where I am being treated. They seem to have a lot more selection than the local lingerie shop where I live which deals only with one company for prostheses and has a very limited selection of bras. Because we live 6 hours from Ohio State, I am holding off on the fitting until my next appointment with one of my doctors there. I hope everyone is doing well!  ",
      "MessageIndex": 68,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "May 14, 2018 12:11AM virginiab wrote: Thanks to this thread, I have just ordered from Tatas to Go. I am less than three weeks post mastectomy and have found that wearing a soft form in a sports bra provdes comforting pressure on my chest. But the fiberfill form rides up. The microbead form rides up a bit less but in a reasonably snug sports bra it looks like a bagel with no hole. I think the heavier beads in the Tatas model may work better. I certainly hope so! I have also ordered a few new t-shirts with busy multicolor floral designs to distract from my uneven breasts. I remind myself that I have never had breasts that matched in size.... although they did hang similarly -- an effect I have not yet achieved with a prosthesis.",
      "MessageIndex": 65,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jun 26, 2018 04:57PM virginiab wrote: I was browsing tankini swimsuits on eBay and saw this one, which seems like it would make it impossible to tell the relative size of R and L breasts: ",
      "MessageIndex": 80,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "virginiab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/155694/profile",
      "Content": "Jul 23, 2018 01:45PM virginiab wrote: shortcake42 wrote: \"Where did you find the Fruit of the Loom front closure bras? I wore those before bc, but they have all worn out. I loved the feel of them and they were fine after the mastectomy. But now I can't seem to find tdhem.\" I have bought the Fruit of the Loom front closure bras from Amazon.com. I have found that the bottom edge of the closure is unpleasantly hard, but if I just leave the bottom hook unfastened, the corners kind of float away from my body and all is well.",
      "MessageIndex": 90,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    }
  ]
}