{
  "AuthorID": "VirginiaNJ",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54214/profile",
  "Posts": [
    {
      "AuthorID": "VirginiaNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54214/profile",
      "Content": "Jul 8, 2008 10:00PM VirginiaNJ wrote: I cut 10\" of my hair pre-chemo and donated it to Pantene's Beautiful Lengths...they make wigs for adults.  (Just another option as Locks of Love seems to get tons of donations).  They sent me a certificate of acknowlegement...  Like you said, turns something negative into something positive!!  :)  http://www.beautifullengths.com/en_US/index_home.jsp Interesting that the hair that is unusuable seems to be from people who are not adhering to the guidlines...I guess they can't make people follow the \"rules\" (not sending colored hair or wet hair, etc...)",
      "MessageIndex": 7,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708687",
      "Title": "Locks of Love Jen44 VirginiaNJ"
    },
    {
      "AuthorID": "VirginiaNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54214/profile",
      "Content": "Dec 22, 2013 01:14PM - edited Dec 22, 2013 01:17PM by VirginiaNJ I had Dr. Van Zee as my breast surgeon and Dr. Cordeiro as my plastic surgeon.  I am completely and totally satisfied with both.  It is very hard to get an appt with Dr. Van Zee - her lead time was 3 weeks but they were able to move me up by 1 week.  I had my surgery 2 weeks after that.  Sloan is a \"well oiled\" machine.  I have had nothing but good experiences there (this is my second time going there...first was 2007).  I too had a private room at Sloan, but was only in the hospital overnight (kind of scary as I had a double mx).  I did not need any special approval from my insurance co for the private room (I didn't request it...they just put me there). Dr. Van Zee is a \"hand holder\" and Dr. Cordeiro has the reputation for NOT being a hand holder, but I like him very much.....and he is extremely skilled at what he does which in the end is most important - I will have my implant surgery with him next year after I complete chemo. Best wishes to your mom!!!",
      "MessageIndex": 8,
      "PostDate": "22/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/815644",
      "Title": "NYC Surgeons Recommendations jluv babs6287"
    },
    {
      "AuthorID": "VirginiaNJ",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54214/profile",
      "Content": "Jul 1, 2008 03:55PM - edited Jul 1, 2008 03:57PM by VirginiaNJ Hi Dawn- I too did 4 rounds of AC chemo followed by 1 year of Herceptin (infusion every 3 weeks for 1 year).  I did not have the port either.  I was just totally freaked out by the whole port idea and didn't think that I could stand it for 1 year.  My reason for not getting it was that I was just plain chicken... My chemo nurses were great as well...  THEY most definitely prefer the port...  I too have uncooperative veins, so it was always...always a battle to \"get\" a vein.  They used the backs of my hands a lot and they became sore...then used my arm and sometimes my wrist...once hitting a nerve.  Yipes.  That's the down side...  The nurses get freaked with the adriamycin (sp?) because it is so toxic so as another poster said, if it infiltrates, it's bad news... Anyhow, they could only use my left arm as well (due to surgery on the right side).  What else...oh, the drinking of the water???  KEY KEY KEY!  Drink TONS of water before during and after (if you can stand it) your chemo!!  But, the drinking before chemo (I was a crazy woman and drank water like crazy starting on Monday for my infusion on Thursday).  Didn't do it for the first treatment and they stuck me 3 times...(my place would do no more than 3 tries).  The next times were much much easier if I was really hydrated... Best of luck to you!!! Virginia",
      "MessageIndex": 29,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/708217",
      "Title": "Has anyone completed A/C tx successfully WITHOUT a port? deecsw MissUniverse"
    }
  ]
}