{
  "AuthorID": "vis0121",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
  "Posts": [
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 20, 2010 07:16PM vis0121 wrote: Hi Everyone, You know more than me about your chemo.  I just found out I will start in January  but not sure when.  I will have PET/bone scan on Jan. 5th and meet the oncologist on Jan. 7th.  My oncotype should be available then.  But all thos won't change the decision for chemo much.  Until last night, I though I was grade 1 and chemo was not at all anything I thought about.  Last night, I found out that my final path report, after my BMX last Monday, 12/13, changed the grading to 3!  So, now I am looking at chemo.  I don't know which kind.  I heard AC and the oncologists said different centers prefer different kinds and use different protocols but where I am, this is what they do, I think.  Citykitty and ProudMom, you were told it is OK to expand while on chemo?  I was assuming this would have to be put on hold but have not talked to anyone about it yet.  I had TEs places last Monday at the time of my BMX.  They are flat not because I was very tight and the PS said there was no way to inject anything but I was supposed to get a fill on Jan. 11.  It's good news that you can do that during chemo, if that is the standard.  I have always had pretty long hair and the lack of hair would be weird to me.  I will definitely shave my head after the first week. My birthday is on 1/21 and I think my hair would make it until then.  I will shave it the next day because I think it would be worse to have some left on the brush or in my hands.  That is what I don't want to see.  Do you guys know when it starts to grow back? Julie, thanks for starting this.  I was hoping to find a group which would be going through the same experiences as me in January.",
      "MessageIndex": 6,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 7, 2011 08:55PM vis0121 wrote: Hi All, I finally have a date for my chemo.  Met with my onc today and starting chemo on 1/14, Friday, which is what I was hoping for.  My onc was hoping I won't need a port because I am having DD ACx4 only but my veins have always been a huge problem (I had to be stuck 8 times before they could get a vein for my BMX!)  So, we went to the infusion center to see what the nurses would say and I was right - no way with my veins.  So, getting a port next Friday and chemo right away.  Scared but ready to start and get it over with.  Thursdays are very important to me at work, so I am glad to be able to do Fridays.  My weekends would be terrible, I am sure, but at least I should be able to go to work most of the week.  I hope anyway... I am debating what to do with my hear.  My birthday is a week from the way I start chemo, on 1/21, so I think I would still have my hair then.  Shave it off after that?  I thought about the Penguin Cold Caps (someone here is using them) but worried a bit about scalp mets - rare but I am paranoid about everything now.  Plus not sure if it is worth the hassle.  After all, the hair will grow back, right?! suz3, chemo was never much of a question for me even with oncotype score of 21.  Because of beign grade 3, it is just safer to do it.  I have clear nodes and still would do it.  I was not supposed to be doing chemo because originally, I was told my cancer was grade 1 based on the original biopsy but that changed when the pathology report came out after the BMX.  So, I have been preparing myself for the chemo for a couple of weeks now, mentally anyway,  Not sure we can be all that prepared no matter what we do.  Good luck with it all.  Lets hope for the best! Thank you evryone for all of the useful information posted here.   And for everyone who has started, stay strong.  At least the unknown/the waiting is over.  ",
      "MessageIndex": 165,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 9, 2011 06:14PM vis0121 wrote: Jean, as JulieH said, your biopsy reports absolutely must have the grade.  That is one the most important thing that comes out of the path reports.  Thpough my grade changed after the surgery, that is not very common and you can usually rely on the grade from the biopsy.  Garde 3 is aggressive, fast growing cancer, so it almost always requires chemo.  Even with clear nodes, there is always a small chance of a renegade cell here or there with grade 3.  Grade 1 is slow  growing cancer and usually does not require chemo.  Chemo is not very effective in grade one because cells might not even divide in the amount of time chemo is given.  And grade 2 is in the middle, with chemo usually given for it.  If you nodes are clear and you are receptor positive and HER2 negative, your oncologist might order an oncotype test to helps with treatment decisions.  Ask any of your treatment team/doctors - they should be able to give you the grade. Melissa, thanks for your support. And I am glad your hair is still unaffected.  I think I will cut mine this week to get used to it over the next couple of weeks.  AimeeMac, I am stilldebating what to do with my veins vs a port.  A couple of good doctor friends of mine tell me they are certain they can get a vein and I am trying to decide whether or not to take them there with me and have them try a vein for the chemo or whether to go with the port even though it is for 4 times only.   Welcome to everyone new!  How can there be so many of us out there?!?!  ",
      "MessageIndex": 181,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 19, 2011 02:16PM vis0121 wrote: Thanks Julie.  My husband just talked to the nurse and we have a better plan for next time.  I just hope I survive a couple more days now and feel better.  I don;t want to quit.  I am sure I will regret it. Ativan helps me sleep at night, marginally.  Last night I had horrible headache and it could not get me to sleep but the night before it did.",
      "MessageIndex": 382,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 19, 2011 01:26PM vis0121 wrote: Hi All and thanks for the support.  Too weak to write much and list everyone but ready everyone's good wishes and thoughts.  It makes me feel good knowing I am a part of this little community and people care. The nausea  is a bit better but I am incredibly weak.  I can't sit still from weakness.  Does this make sense?  I feel like I have restless legs but it is restless body.  My counts must be low though I got Neulasta.  Only on tx 1, so scared to death.  I hope they can do something more for me next time.  The nurse called but short of telling me more fluids and bringing me in for IV fluids and nausea meds after 36 hours, I heard nothing else.  Are there people who just can't make it through this?  I have never though I was one of those weak ones to give up but I can't stand things the way they are!",
      "MessageIndex": 378,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 19, 2011 02:18PM vis0121 wrote: Moe, You lok absolutely beautiful without hair!   I mean it.",
      "MessageIndex": 383,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 22, 2010 07:18AM vis0121 wrote: ProudMon - thanks for the explanation.  It turns out my PS wants to continue with the expansion through chemo as well.  I can't imagine how it will go because my bad side is in so mcuh pain that I can't think of anything else being done to it.  The other side is completely OK, recovering well.  But perhaps because they cut off some muscle on me and took out 6 nodes, the pain is the way it is.  It does not let me sleep even.  The smallest movement sends a shooting pain through my body.  But lets see how it goes. So, the AC makes only your hair fall out, not your eyebrows and eyelashes?   I am barely starting to learn all about my chemo.  I am told only 4 courses of AC but other people seem to do a lot more, so I am wondering....  My oncologist called me today but I could not possibly ask every single question on my mind.  I guess ince we meet in person in the new year, then we will talk.  Did you get an oncotype score? Best wishes for happy holidays to everyone.",
      "MessageIndex": 8,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 3, 2011 08:13PM vis0121 wrote: Thanks for the cheer, Annie.  So, what to expect after the scans?  By the way, your diagnosis is very much like mine.  I knew I had DCIS first but IDC as well at a closer look.  I am stage 1a and grade 3 as well with negative nodes (though I got more out of me).  You are HER2+ and I am negative, the only differnce. And we are both moms of 3!  :)",
      "MessageIndex": 101,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 16, 2011 03:12PM vis0121 wrote: I feel horrible today.  The SE are terrible for me.  I can;t get out of the bed and am taking every nausae med I have.  It is day 3 for me, if we coult Friday as my first does of AC.  I expected a bit better, I guess.  Nausea, vomitting, constipation, can't drink, can't eat.....  It feels I am about to die....",
      "MessageIndex": 306,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 17, 2011 12:33PM vis0121 wrote: Thank  you UTMom and Jean H,  Nothing seems to help.  I am starting to feel this is a permanent state of being.  I hate it!  The nausea is never under control completely and eating and drinking makes it worse.  How I can make it through 3 more treatments, I have no idea.  And work seems sort if impossible now.  I hate this!!!",
      "MessageIndex": 331,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 23, 2010 01:59PM vis0121 wrote: ProudMom - I am actually told that I will have AC without a port.  I am not sure what the pros and cons are but when I meet my oncologist on Jan. 7th, we will talk.  I guess for 4 treatments they can manage it without a port.  IF we decide I will do more chemo after that, perhaps this could change.  Why wer eyou told IV only?  Any explanation?  ANd too bad your insurance is not paying for the oncotype.  Not sure how much it costs since I think mine is.  No one has even asked me anything about insurance, so I hope they are doing/checking that on the back end. IslandMom - Your diagnosis is very similar to mine (see below) and I am doing 4 rounds of AC.  I am told that some cancer centers prefer AC and others other combinations.  I might be getting the T as well.  As Julie explained, with aggressive cancers, you want to be aggressive in treatment.  It is sort of am insurance against potential renegade cells. I am at one of the best cencer centers in the US and my husband is a physician as well.  We have talked to 3 oncologist officially and many other physician friends who all say that with grade 3, even with clear nodes and stage 1, chemo is a good thing to do.  I feel quite confident about that and hope it reassures you some.  You might find an oncologist who would tell you it is optional but no one would tell you that it is absolutely something you should not do.  If you cancer was grade 1, then you would not need chemo because it does not work well on slow growing cancers.  With grade 3, you want to do it.  Julie and IslandMom- good luck with the excision. I am still have a very hard time with my \"bad\" side after the mastectomy.  I walk hunched over constantly because the pull there is extremely painful.  It has been 10 days now and the tightness is almost unbearable.  But I am certain it is because muscle was cut and 6 nodes were taken out. I can't possibly imagine how anything more can be squirted inside my left side and expanded.  I can't even imagine I would ever be able to lie down flat let alone anything else.  But I hope this changes. My husband is telling me we should make plans for something fun next year so I can wait for it, so we can look forward to a trip with the kids and/or for something for the 2 of us.  It is a nice idea, I think.  Perhaps this could work for some of you too?  There is life after chemo and surgeries and scans and never ending appointments, I hear.  Clearly, none of us here are there yet but we will get there!",
      "MessageIndex": 13,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 31, 2010 06:44PM vis0121 wrote: bamamama2/Karen, So sorry to hear about your situation.  I think something sounds really fishy here though.  Someone made a mistake somewhere with you.  If you had DCIS, by definition, your nodes could not have been positive because DCIS is contained.  I think it is likely you had IDC back then as well and someone missed it.  Many people start out with DCIS and they then discover some IDC in the area. I had DCIS and IDC both but I knew that right away from the biopsy.  So, if you did have some IDC, you were mismanaged in terms of treatment.  You should have been on Tamoxifen (since you are receptor +) if you had IDC and this could have helped with microscopic mets, which is probably what you had in a node somewhere. The pathology from your BMX only noted DCIS?  You can probably still send it somewhere for a second opinion, not that it would change anything now. It is great that you were insistent to check this out.  I went in 3 times for the same beast, insisting that there was something there when I was told 2 times, based on 2 ultrasounds and one mammogram that there was nothing.  I insisted on biopsy the last time because the mass was so easy to feel.   Anyway, good luck with the chemo.  We have to do what we have to do and get through this.  I am supposed to start chemo in mid January.  I meet with my oncologist on 1/7 to discuss the plan.  Jsut found out that my oncotype score came back as 21, so 14% chance of recurrence.  Unfortunately, this is in the gray area where not a lot of data is available on how much chemo actually helps reduce the percentage number, so now we have to agonize over the decision.  I am tired of making tough decisions.... Happy New Year to everyone!  Lets hope it is a better one for all of us than the current one.",
      "MessageIndex": 71,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 3, 2011 07:02PM vis0121 wrote: Hi Everyone, It has been a week or so since I last posted and there are a lot more people here since then!  That is really not a good thing but good that we have each other.   I will likely start chemo next week but have to finalize the plan with my onc this Friday, after I have my CT and bone scan.  I have been told I will be doing ACX4 so far and we were waiting for my oncotype score to decide whether to do anything more than that or not.  But I see that almost everyone here does more than just AC, so am wondering whether I should just have Taxol after the AC anyway....  My oncotype score came back as 21, so in the middle.  I think lee7 or someone else here said her score was 20, so very similar to me, 14% chance of recurrence.  How much will the chemo reduce this percentage no one really knows because they just don;t have good data for the middle group.  There is a big clinical trial going on and a lot of hopes are placed on it but the results don't come out until 2014.   The recurrence worries me so much!  I was on the December 2010 mastectomy thread for a little while because I had BMX 12/13 but it seems like even BMX can't give people peace of mind!  So many people here, with similar diagnosis and who should have had small chances of recurrence are reporting recurrence and MaryMeg even completely new cancer with the breasts gone.  Or are we a self-selected group of people here?  I know very well how statistics works and staristics are helpful to a point, but they are mainly for population studies and we are all individual people here.  OK, sorry to be doom and gloom.  I try to stay positive and manage it most, especially with my three littles ones (almost 5, 3 and 1 years old) of the time but it just hits you from time to time. I am a little worried about being sick like those of you who teach because while I am not a teacher, I work in a hospital and everyone around me is a doctor.  I manage a residency program and right now is the interview season, so every week, we have a new group of 9 people come in.  During this season, someone in the group is always sick and coughing or sneezing.  No one would ever miss an important interview at Harvard, so they come in whatever condition (one even came with a kidley stone!)  But I have never missed an interview day in the years I have worked here (other than the week of my BMX).  So, I want to make sure I can make it.  How to do that?  Which day should I have my chemo to make sure I am at work on Thursdays (and potentially Wednesday afternoons when we have some events)?  Monday chemo?  I was thinking Friday but my husband, who is also a physician like MaryMeg's, thinks it's a bad idea because if I have really bad SE the next day, it's the weekend and have to go to the ER, which is a pretty bad idea (unless no other option, of course).   OK, enough for now.  Sorry to be rambling and thanks to those of you who are reading and chiming in.",
      "MessageIndex": 99,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 14, 2011 01:29PM vis0121 wrote: Hi All - long day for me today - got my port (painful/sore), then a heart test, then off to my first chemo!  I am sitting in a private room now (first time, so they thought they'd be nice to me) and getting my first dose of AC.  The nurse pushed in the A in 15 minutes and now waiting for the C to be done.  As my oncologist said, it is a bit anti-climatic. I am tasting something sort of metallic in my mouth as we speak but I guess it is normal.  I got Aloxi, Decadron, and Emend for the nausea right before the chemo.  I will have a Neulasta shot tomorrow and have Decadron and Emend for home.  Everyone here is telling me not to expect super terrible SE.  Yes, I will be tired but the nausea should be controlled well.  My taste will change somehow but I have to wait and see.  My nurse is super nice.  She told me that the hair really does fall out on day 14 or 15, not before that, so I think I will shave my head on day 13 or so.  Has anyone on AC experienced hair loss before day 14?  I bought 2 wigs which I like a lot.  One is typical for me but the other very different.  I thought I should have some fun with this. :) I am glad I am \"off\" from chemo next week because next Friday is my birthday (any my oncologist's birthday!)  I hope I can eat birthday dinner by then. Just wanted to post an update because I have been very busy at work last week and have not posted anything.    I hope everyone is doing well, as well as possible. ",
      "MessageIndex": 269,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 10, 2010 10:15PM vis0121 wrote: Hi Everyone, Can I join your group?  Like Andrea, I have my surgery this coming Monday, 12/13, BMX.  I am getting very nervous now that the weekend is here.  I also did a lot of work today and tried to do as much as possible to leave things in an organized manner.  And said Good Bye to people for a while. Weird feeling, yes.   I am worried about the SNB.  And mostly that I have no control over any of this and that when I wake up from the surgery, that is when I am going to find out if it was negative or positive.  It will make such a big difference! By the way, I live in Boston now but lived in Seattle for 10 years.  I often miss it.",
      "MessageIndex": 208,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 3, 2011 09:34PM vis0121 wrote: Tina - I have a very similar diagnosis to yours and an oncotype score of 27.  They don't quite know what to do with the middle group since there is not much data.  So, I am doing chemo too.  I will likely start next week.  No finalized plan yet.  What kind of chemo are you getting? Annie - I said appreciate your words you said to me on the Jan. Chemo forum but saw your post here and wanted to tell you that I went from grade 1 on biopsy to grade 3 from final path report after BMX!  A big shock since grade does not change often.  So, went from no chemo for sure to yes chemo for sure. And of course, much different prognosis in terms of recurrence with grade 3. I did know I had DCIS and IDC.  But, I went in 3 times to have ultrasound and mammogram a few months apart and NOTHING was seen!  I sounded like a hypochondriac.  Finally, I told the radiologist that I don;t care whether they see it or not - touch it, feel it and biopsy it.  It was there!  Infuriates me to know this could have been discovered a year and a half ago.  When I was pregnant the last time, they could only do an ultrasound but then once I was done breastfeeding, I went in again and still nothing.  I hate the dense breasts business.  No one would give me an MRI because no family history.  I just sounded crazy.  My husband is a doctor and even he though I needed tgo stop.  Thank goodness I didn't.  My children are very little - 5, 3, 1 and I sure would like to be around.  My not quite 5 year old asked me how he would get another Mommy if I died.  I asked him if he wanted another Mommy and he said: \"No, but I think I would need one!\"  So right about that! We have to beat this!  I realize that there are many sad stories here but we all, even us with the sad stories, and other with even sadder stories, should know that there are many more people with great stories out there.  We may not know them becauase they may not need us now and hence not be on this forum!",
      "MessageIndex": 458,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 20, 2010 07:47PM vis0121 wrote: Mar, I am in similar shoes.  I have DCIS and then invasive cancer on top of it.  I was told it was grade 1 from the biopsy but after the path report came out from my BMX last Monday, the grading changed to 3!  So, I went from for sure not needing chemo to a very strong suggestion of chemo.  While I am so not looking foward to it, I will do it because I am 35 and I have 3 little ones ages, not quite 5, 3 and 1.  But I am not sure what I would have done if I was 64.  Did you get an oncotype score?  I am still waiting for that.  It tells you whether your particular cancer responds well to chemo or not.  That might help you decide.  Momof2greatkids, welcome to the other side.  We all make it work for us somehow.  Stay strong and positive. Glad youa re feeling good about it all. Biker, good luck tomorrow.  I am a week out after BMX and totally doable.  I was not freaked out one bit by the site and looked as soon as possible.  My drains (4 of them) were out on Friday of last week, so I had them only Mon-Fri, which I guess is good.  I took a shower today.  It was tough but worked.  So, you will make it, believe me.  They are good at Swedish.  That is where you are going, right?  Are you getting your care after taht at the Hutch?  You are at a good palce. I actually wish all I was dealing with was recovery from BMX and all I had to worry about was reconstruction!  I am obsessed with thoughts of recurrance.  Since I found out last night that my cancer is aggressive and grade 3 now, that is all I can think about.  I try to think about my clear nodes but get little consolation.  I am worried about a tiny renegade cell, which no one can see and everyone can miss until it takes over my body.  Am I going crazy?  I keep thinking that I don;t want to die before my kids are old enough to remember me.    OK, I wil try to watch a movie now and not think about cancer. ",
      "MessageIndex": 328,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Jan 7, 2011 10:09PM vis0121 wrote:",
      "MessageIndex": 480,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 16, 2010 03:32PM vis0121 wrote: Hi All, Surgery was Monday, 12/13 and I came home yesterday, 12/15.  All went very well, I am told.  No regrets at all about my BMX.  I took a look right away and was neither freaked out, nor grossed out, nor depressed by the sight of it.  Looks rather good - clean skin and a reasonable scar.  My surgeon spent longer in the OR and tried to make smaller incisions.  She took out 5 notes (thought there were 3 because that is what lit up during th SNB but there were 2 extra small ones in there).  On the positive side, the frozens were negative.  Still waiting for the final path report but trying to be positive.  My mood is OK.  The drains are a pain.  I have 4 of them.  But they are coming out tomorrow because I am not draining much.  So, should be better then.   My first night at the hospital was fine.  I had a ton of visitors.  Everyone thought I looked much better than someone who just had surgery, friends and doctors a like.  The second night was horrible.  I had nausea, vomiting,  horrible headaches.  My IV site was swelling.  But things got better again yesterday and I am home.  The pain on the bad side is strong.  I am trying not to take pain meds because they are making me feel crappy and give me nausea.  I will manage somehow. The PS put in the TEs but could not fill them at all because I am very tight.  All will happen little by little.  I am somehow not worried about it too much.  I am so much more interested in being healthy and alive then in looking good.  Knowing me, most people would have thought I would worry about the aesthetics a lot.  I want things to look good but am not obsessed with this at all. My back hurts a lot because I sleep half sitting.  I hope this can change once the drains are out. OK, time for some rest.  I hope everyone who has surgery Monday, 12/13 and this week is doing as well as possible.  Hang in there! ",
      "MessageIndex": 276,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 19, 2010 09:44PM vis0121 wrote: Thanks Riley.  Good to put things in perspective.  I am still worried that there might a single tiny cell here or there, floating around and growing fast since it is grade 3....  But I guess the chemo an help with that.  I am sure I will pull myself together.  I just got the bad news and it kills my hopes for speedy reconstruction and recovery but living for my 3 little kids is more important that reconstructed breasts, so I have no qualms about the chemo in general though I have always had long hair and the hair loss willbe a shocker.  Thanks though.  Very important to stay positive.",
      "MessageIndex": 308,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 19, 2010 08:03PM vis0121 wrote: Hi All, Well, I was doing sort of OK after my BMX on Monday, 12/13.  One I have had one setback after another.  Today I found out that though my 6 nodes out were all negative, the IDC was not grade 1, as my biopsy report read but grade 3.  This changed everything.  Aggessive cancer, so most likely chemo.  I have to talk to the oncologist but from what I have read so far, it seems like it.  Plus, I have 3 areas of IDC, one 1cm, one 0.3cm and one 0.2cm, on top of DCIS, which was 3.6cm (and no one commented on that one before!)  I try to stay positive because my nodes were negative and I certainly know things can be worse but it is not easy. zogo - I am still have a little nausea.  I will try Benadryl. Arlene - constipation sucks!  I ended up in the emergency room the night before last because of severe abdominal spasms due to constipation.  They were like contractions and then I would gave a few minutes of peace and then again.  I was crawling on the floor with pain.  So, they had to give me Dilaudid again, as well as Zofran though they cause the constipation, because I was in such pain and had so much nausea.  And I had been on a heavy laxitive regimen too.  But I tried Milk of Magnesia in the ER and it worked!  I am not taking any pain meds at all even though I have a lot of pain on the left (I had a lot of nodes out and some muscle was taken as well).  And I am not able to go again.  I will be trying Milk of Magnesia again tomorrow.  Not pleasant but not a lot to take. to all of you ladies recovering from BMX or MX this week, good luck and stay strong.  I was doing my best but keep on hitting road blocks.  So many positive people are on here though and I am trying to be one of you too. ",
      "MessageIndex": 305,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 21, 2010 07:31AM vis0121 wrote: Thanks take_two.  What was your first diagnosis 10 years ago?",
      "MessageIndex": 338,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    },
    {
      "AuthorID": "vis0121",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/114231/profile",
      "Content": "Dec 23, 2010 03:16PM vis0121 wrote:",
      "MessageIndex": 367,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/760728",
      "Title": "December 2010 Mastectomy zogo fire-dancer"
    }
  ]
}