{
  "AuthorID": "vlederer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158032/profile",
  "Posts": [
    {
      "AuthorID": "vlederer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158032/profile",
      "Content": "Aug 23, 2012 01:08AM vlederer wrote: Hi Caryn, What I learned from this whole freaking process was patience. I felt exactly how you felt. Just get me in there and get this crap out of me! Stay strong and take one day at a time. The waiting for results, lab tests, blah blah is the hardest part. It is what it is. But if there is anything you don't understand, pick up the phone and call your doctor(s). What I found most frustrating was that no one ever sat me down and explained to me what the whole process was going to be. I went from doctor to doctor like a zombie, but I just really needed someone to sit me down and go through the steps. I'm a planner so not knowing details drove me nuts. Make sure you write down all your questions for your doctors and bring them with you to your appointments. Having someone there with you is also good because sometimes they hear things you may miss, or may have a good question that you didn't think of. Stay strong lady. There is a lot of support out there for you. Good luck and keep us all posted on what's going on. Peace to you.  Valerie ",
      "MessageIndex": 41,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792232",
      "Title": "Biopsy Tomorrow and I'm a Wreck LeahLeah LeahLeah"
    },
    {
      "AuthorID": "vlederer",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/158032/profile",
      "Content": "Aug 23, 2012 12:59AM - edited Aug 23, 2012 01:00AM by vlederer",
      "MessageIndex": 40,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/792232",
      "Title": "Biopsy Tomorrow and I'm a Wreck LeahLeah LeahLeah"
    }
  ]
}