{
  "AuthorID": "vonkmil",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206453/profile",
  "Posts": [
    {
      "AuthorID": "vonkmil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206453/profile",
      "Content": "Oct 14, 2014 12:42PM - edited Oct 14, 2014 12:44PM by vonkmil",
      "MessageIndex": 15,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825077",
      "Title": "Waiting Nursie LexiGirl33931"
    },
    {
      "AuthorID": "vonkmil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206453/profile",
      "Content": "Oct 14, 2014 12:40PM vonkmil wrote: Hello... I am also WAITING. I had a mammo, got called in for additional views of my left breast and then was sent in for an ultrasound which showed a very small solid, hypoechoic module at 2 o'clock. It is microlobulated with shadowing. The radiologist assigned it BIRAD 4C and scheduled me for a core needle biopsy 2 days later. He told me he thought there was increased blood flow, the doc who did my biopsy did not think so? anyway, the biopsy went well. They took five samples. I was told the results would be available today. I am going crazy waiting for the call. I won't lie and say I haven't googled the terms to understand what they all mean but I am trying to stay off the internet for the most part which is why I am here. I hoped hearing from some of you who are going through the same thing or have been through it may be helpful. The rational side of me feels this is probably nothing but there is that nagging voice that keeps saying what if. I honestly know I can handle the news if it is malignant, I just need to know. I start a new job next week and the stress is unbearable! Best of luck to all of you! I am trying to be positive for all of us.",
      "MessageIndex": 14,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825077",
      "Title": "Waiting Nursie LexiGirl33931"
    },
    {
      "AuthorID": "vonkmil",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206453/profile",
      "Content": "Oct 14, 2014 12:45PM vonkmil wrote: Nursie,   I am so sorry to hear this. Will keep you in my positive thoughts and prayers as you begin your journey...",
      "MessageIndex": 16,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/825077",
      "Title": "Waiting Nursie LexiGirl33931"
    }
  ]
}