{
  "AuthorID": "voraciousreader",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
  "Posts": [
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: http://www.newsday.com/news/health/li-study-avastin-chemo-mix-raises-risk-1.2654790 LI study: Avastin, chemo mix raises risk February 1, 2011                    by DELTHIA RICKS                            / delthia.ricks@newsday.com                           When used in combination with conventional chemotherapy, the cancer drug Avastin puts patients at a greater risk of dying from side effects, a team of Stony Brook medical investigators has found. Raising new questions about the popular medication, Dr. Shenhong Wu and colleagues studied 16 clinical trials involving more than 10,000 patients who received an Avastin/chemo combination, the method most commonly used to administer Avastin. Their analysis of the most common causes of fatal side effects involving Avastin found that 2.5 percent of patients taking Avastin and undergoing chemo died, compared with 1.7 percent of those taking chemotherapy alone, an increased risk of 47 percentage points. Nearly a quarter of those patient deaths of those taking Avastin and chemo were due to severe bleeding, the new analysis found. Another 12.2 percent died because their treatment destroyed infection-fighting white blood cells. \"When we consider Avastin for treatment, we have to balance the risk with the benefit,\" said Wu, a cancer specialist at Stony Brook University Medical Center, who has led a series of studies on Avastin in recent years. Ed Lang, a spokesman for Avastin's maker, Genentech, said the company welcomes research about Avastin's safety, but he contends Wu's study is flawed because the results include forms of cancer for which Avastin is not approved. In the study, appearing in Wednesday's Journal of the American Medical Association, Wu found that risks of potentially fatal side effects involve patients across a range of advanced cancers. \"We initially thought this drug was less toxic,\" said Wu, adding that doctors have faced a steep learning curve involving Avastin, a drug approved for colorectal, lung, brain and kidney cancers. The drug has been found to cause severe bleeding, holes in the bowel and problems with wound healing. In December, federal regulators began the process of withdrawing approval for its use as breast cancer treatment after a research review suggested it failed to help those patients live longer or provide enough benefit to outweigh its risks. Avastin eliminates tumor blood vessels, blunting the cancer's ability to tap into the host's blood supply to withdraw nutrients. Without sustenance, a cancer, theoretically, cannot grow. Despite the risks, Wu prescribes the drug for some patients and notes that treatment-related toxicity is also a problem with conventional cancer drugs. Like other doctors across the country, he has found that Avastin works extraordinarily well in some patients. The problem: Doctors have no way of discerning who will fare best. Dr. Daniel Hayes of the University of Michigan argues in an accompanying journal editorial that doctors need a way to screen patients and administer Avastin only to those who would benefit most. \"Although [Avastin] has benefit, it is currently not possible to determine in whom or for how long,\" Hayes said. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764294",
      "Title": "Avastin AND Chemo risks outweigh benefits...meta-analysis voraciousreader Lynn1"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Here's what Dr. Weiss has said about ABC's Good Morning America's Amy Robach who was recently diagnosed with breast cancer following an on-air mammogram: http://nydn.us/1djKPHs Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Here's what Dr. Weiss has said about ABC's Good Morning America's Amy Robach who was recently diagnosed with breast cancer following an on-air mammogram: http://nydn.us/1djKPHs Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814442",
      "Title": "Amy Robach voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Disparities Found in Repeat Breast Cancer Surgery By DENISE GRADY Some women who have lumpectomies for breast cancer may then undergo second operations they do not need, because guidelines for deciding who requires repeat surgery are unclear, a new study finds. It also hints that some women who might benefit from further surgery may be missing out on it.        Rates of repeat surgery can vary widely by doctor, from zero to 70 percent, according to the study.        The additional operations are done when pathology reports on tumor specimens suggest that the first operation may have left behind some cancer cells. But surgeons differ when it comes to interpreting those reports.        Such uncertainty about a cancer operation that has been in use for 30 years is \"a shame,\" said Dr. Laurence E. McCahill, the first author of the study, and a surgeon and assistant director of the Lacks Cancer Center in Grand Rapids, Mich.        Dr. Monica Morrow, the chief of breast surgery at Memorial Sloan Kettering Cancer Center in New York, said, \"It is getting to be the time for leaders in radiation oncology and surgery to get together and make a consensus statement that could help to guide their membership.\"        Dr. McCahill's study, published online Tuesday by the Journal of the American Medical Association, is based on the medical records of 2,206 women who had lumpectomies at one of four hospitals in different parts of the country. Over all, 22.9 percent had more than one operation.        Nearly half the repeat operations were done in women whose pathology reports did not indicate that any stray cancer cells had been left behind, meaning that the operations probably did not help the patients. More disturbingly, 14 percent of patients who did have evidence of cancer left behind did not have another operation, for unknown reasons.        Rates of repeat surgery varied by surgeon, from 0 to 70 percent, and by hospital, from 1.7 percent to 20.9 percent. Differences in the patients did not account for most of the variation, though very thin women, who tend to have small breasts, were more likely to need second operations. Surgeons say that is because they try hard to remove as little tissue as possible from small breasts, for cosmetic reasons.        \"The number of operations women undergo definitely depends on where you're treated, and even to a greater level on which surgeon you see,\" Dr. McCahill said. \"We put the math behind it and said, this is a lot of second operations that maybe don't make a difference.\"        A major reason for the variation is that there is no consensus among surgeons about how big a rim or \"margin\" of healthy tissue should be taken out when a cancer is removed. Surgeons try to cut cleanly around a tumor and remove enough of a margin to ensure that they excised all the cancer.        Negative or clean margins generally mean the whole tumor was removed. Positive margins mean some cancer was probably left behind and another operation is needed to prevent recurrence.        But how big should the margins be? When the tumor and the healthy tissue are removed, the surface of the whole specimen is inked so that when it is sliced and seen through a microscope, the pathologist can use the ink marks to find the margins between the cancer and the healthy tissue and measure how close the cancer cells are.        Some surgeons consider the operation complete if no cancer cells are touching ink. Others want a wider margin of healthy tissue between the cancer cells and the ink: one, two or even five millimeters (a millimeter equals 0.04 inch), and if there is less, they operate again. Surgeons say some radiation and medical oncologists insist on a certain margin size before starting the rest of the patient's treatment. The decision to reoperate also depends in part on what type of tumor the patient has.        But there is no evidence that a margin any bigger than \"not touching ink\" affects cancer recurrence or survival, said Dr. Morrow, who wrote an editorial accompanying the study. At her hospital, she said, \"not touching ink\" is generally considered good enough.        Many doctors think that bigger margins must be safer, Dr. Morrow said, but studies indicate they are not.        \"We really could decrease a significant amount of surgery that women are getting if we could come to a consensus that in this era, bigger is not necessarily better,\" Dr. Morrow said.        Nearly all women now receive additional treatment after lumpectomy - radiation and systemic treatment with chemotherapy or hormones, or both - and those treatments have greatly lowered the recurrence rate and made the size of margins less of a concern than in the past, Dr. Morrow said.        Lumpectomy is the most common operation for breast cancer, and is performed in 60 percent to 75 percent of the more than 200,000 new cases per year in the United States. It began coming into use about 30 years ago as a means of sparing women from what had been the standard treatment, mastectomy, removing the entire breast. Major studies begun in the 1970s transformed the field by showing that in most cases, women who had lumpectomy plus radiation lived just as long as those who had mastectomies.        But lumpectomy has always been a balancing act between trying to remove the whole tumor and yet preserve the breast, said Dr. Stephen R. Grobmyer, a breast cancer surgeon at the University of Florida in Gainesville. Cancer can spread in ways that do not show up on mammograms and that surgeons cannot see or feel in the operating room, so repeat operations have been considered inevitable for some women.        Previous, smaller studies have found repeat operation rates of 30 percent to 60 percent.        \"I don't think you'll have a lot of argument from women or insurers that doing something twice 30 percent of the time isn't the way to go,\" Dr. McCahill said, adding that the repeat operations are physically and mentally difficult for women, and an added expense.        What the repeat rate should be is not known, but surgeons interviewed for this article thought 50 percent or higher was cause for concern. They said there was no evidence that doctors operated more than once on cancer patients just to make money.        Doctors cautioned that it would be a mistake to look for surgeons with a low rate of repeat operations. Dr. Susan K. Boolbol, the chief of breast surgery at Beth Israel Hospital in Manhattan, cautioned that a low rate could mean the surgeon usually did the operation right the first time - but could also mean the surgeon did a lot of mastectomies, or failed to operate again after lumpectomy even when more surgery was needed.        Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/781912",
      "Title": "NY Times: Disparities Found in Repeat BC Surgery voraciousreader CTMOM1234"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Breast Cancer Recurrence Score Cannot Be Predicted by Traditional Clinicopathologic Measures An analysis of 2,097 patients from Clalit Health Services and 484 patients from Maccabi Health Services in Tel Aviv, Israel who received the Oncotype DX breast cancer tests between January 2008 and June 2010 concluded that the RS result cannot be predicted by traditional clinicopathologic measures, such as patient age, tumor grade, and tumor size.  The study, \"Evaluation of recurrence score and traditional clinicopathologic assessments in a large ER-positive, lymph node-negative patient cohort\" (Abstract #632) will be presented on Monday, June 6. Additional Breast Cancer Studies Expand Understanding of Tumor Biology Based on published data comparing the relative efficacy of aromatase inhibitors and tamoxifen in reducing the risk of distant recurrence, researchers concluded that an individual patient's Recurrence Score and Recurrence Score-Clinical-Pathologic (RSPC) distant recurrence risk assessment can be used to determine distant recurrence risk for early-stage breast cancer patients receiving treatment with an aromatase inhibitor.  The study, \"Using the 21-gene Recurrence Score (RS) and the recently developed Recurrence Score-Pathology-Clinical (RSPC) to assess recurrence risk in patients with node-negative, ER-positive early-stage breast cancer receiving aromatase inhibitor treatment alone\" (Abstract #592) will be presented on Monday, June 6. Initial data from the prospective, multicenter West German Study Group (WSG) Plan B trial examined the relationship between tumor grade and the tumor immunohistochemistry biomarker, Ki-67, the invasion markers uPA (urokinase-type plasminogen activator) and its inhibitor PAI-1, and the Oncotype DX Recurrence Score. Results from a preliminary analysis of 1,795 patients showed that there were only weak correlations between all the markers and the Recurrence Score. These results reinforce the conclusion that the Recurrence Score result cannot be predicted by other clinicopathologic measures. The study, \"Prospective comparison of recurrence score, uPA/PAI-1, central grade and molecular classification in early breast cancer: Interim results from the WSG-Plan B trial\" (Abstract #10594) will be presented on Monday, June 6. Results from an analysis of 5,644 early-stage breast cancer patients from a large US-based oncology group practice concluded that younger patients and patients who had better performance status and higher grade tumors were more likely to receive the Oncotype DX test.  The study, \"Evaluating utilization characteristics for the Oncotype DX recurrence score in early-stage breast cancer\" (Abstract #625) will be presented on Monday, June 6. Finally, an analysis of 1,543 early-stage breast cancer patients from a large US-based oncology group practice demonstrated a strong association between RS values and adjuvant chemotherapy administration.  This study, \"Evaluation of relation between Oncotype DX recurrence score and adjuvant chemotherapy administration\" (Abstract #e11105) will be published online in conjunction with the 2011 Annual Meeting and citable to the Journal of Clinical Oncology as a supplement, but will not be presented at the meeting Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770518",
      "Title": "Interesting Oncotype DX news from Asco meeting.... voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: I thought after Tamoxifen and switching to AI, my polyps would slow down.  Initially diagnosed prior to BC diagnosis.  Seems to be I'm growing them every few months and I'm symptomatic with bloody discharge... I've lost track of the number if D &C's I've had in the last 6 years.  I wanna hold on to my uterus... but when is enough is enough?  I keep wondering.... Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/821692",
      "Title": "Uterine/cervical polyps (chronic) voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Add Patience to a Leap of Faith to Discover Cancer Signatures By GINA KOLATA Are we outsmarting cancer? Or just ourselves? Over the past several years, scientists have begun looking not just for individual genes linked to cancer, but for collections of genes and molecules, like proteins, that form telltale patterns, or signatures, that can be used to identify a cancer cell and reveal what drugs might kill it. Signatures can be used to diagnose the disease, scientists hope, and to give a prognosis to patients who have cancer. But there have been few successes in this brave new world of cancer research, and some notable failures. Genetic tests devised at Duke University by researchers using the new methodology have turned out to be worthless, though they were once hailed as breakthroughs. Two new blood tests for ovarian cancer have also been abandoned. Despite the setbacks, researchers say they cannot give up on their quest for cancer signatures. Dr. Lajos Pusztai, a breast cancer researcher at the University of Texas MD Anderson Cancer Center, is one of them. How many new drugs, he asks, were approved for breast cancer treatment in the past decade? His answer: seven. None was much different from drugs already on the market. Yet in the same decade, he said, there were 8,000 publications in medical and scientific journals on breast cancer and more than 3,000 clinical trials at a cost of over $1 billion. \"What came out of this is seven ‘me too' drugs,\" Dr. Pusztai said. Yes, there have been studies showing single genes can go awry and fuel certain cancers, he and other scientists say. And yes, those studies have led to new drugs, so-called targeted therapies, that block the genes, extending the lives of some patients with some types of cancer. But for a major advance in the way cancer is diagnosed and treated, Dr. Pusztai and other researchers believe that work must continue on genomic signatures. It's a very different sort of science, an elaborate enterprise that involves complicated analyses of patterns of genes or other components of cells. The hunt for cancer signatures also is a type of work that requires a leap of faith. It is impossible for scientists to use their intuition to know whether a signature has any biological meaning - it is just a pattern, and the meaning comes from its statistical association with a result. By looking for these signatures, scientists are looking for a sort of next generation of biomarkers, and biomarkers have a troubled history in cancer research. About 15 years ago, when the world was simpler, the American Society for Clinical Oncology called together a group of experts and asked them to develop some guidelines. Which cancer biomarkers are useful for making clinical decisions? Dr. Daniel Hayes, a breast cancer researcher at the University of Michigan, was part of the group. \"We all kind of sat around and looked at each other and said, ‘We have no idea how to do this,' \" Dr. Hayes recalled. The field of tumor biomarkers, he said, \"had been so chaotic.\" All too often, researchers claimed to have discovered reliable ways to identify a particular cancer, but studies confirming they were valid had never been done. The group ended up writing a paper with what they called a \"level of evidence scale\" outlining the results they needed before they would believe a claim. Only a handful of tumor biomarkers met their criteria. Yet, Dr. Hayes said, \"during that time there had been hundreds of putative markers reported for breast cancer alone, let alone other diseases.\" With genomic signatures, the situation is more involved than it was 15 years ago, but the many of the same problems remain, Dr. Hayes and others say. Signatures can be used to identify cancer cells in the way a tartan can identify a Scottish clan, Dr. Hayes said. \"Each tartan is composed of threads of several different colors, but when woven into a single cloth, presents a distinctive pattern or signature that distinguishes one clan from another,\" he said. Yet the tools used to find signatures are so complex they can be misleading if the results are not tested properly. Investigators look for patterns in huge arrays of genes or proteins or RNA molecules, and they constantly find spurious associations with cancer that look for all the world like true ones. \"The question is, what is noise and what is real?\" said Dr. Steven Goodman, a biostatistician at Johns Hopkins University. In these studies, he added, \"you are guaranteed to find things,\" and almost always what is found is nonsense. Gene or protein patterns, said Donald Berry, a statistician at MD Anderson Cancer Center, \"are very difficult to get right.\" Finding them, he said, \"is like looking for a needle in a haystack when you can't tell the needle from the hay.\" Adding to the confusion is that the research requires a group of experts, each of whom has a different, highly technical skill. Each person on a team may be so specialized that no one is qualified to know exactly what his or her colleagues are doing. Dr. Pusztai's team, for instance, includes pathologists, molecular biologists and biostatisticians. \"No one person on the team sees all the pieces together,\" he said. For example, he said, just analyzing cancer tissue for a genomics study involves 200 to 3,000 steps and takes several days to complete. \"Any one of these steps can go wrong, and a good researcher should know what can influence the success of each step and control for the quality,\" he said. What comes out of this analysis is \"reams of numbers,\" Dr. Pusztai said. \"If one were to print these out it would amount to thousands of pages. The interpretation of these numbers is purely statistical and mathematical.\" Even when researchers find a real association, it may not be clinically useful. A genomic signature test that correctly identifies most tumors that will respond to a drug but incorrectly identifies others may not be of net benefit to patients. What is needed, and what rarely has been done, is research to see if a test based on a new biomarker does more good than harm. It's expensive and time-consuming, but it is the sort of evidence-gathering that is almost always done to see if a new drug is effective, Dr. Hayes noted. Yet there is little incentive to evaluate biomarkers, because the Food and Drug Administration does not require it and companies are not reimbursed as much for tests based on biomarkers as they are for new cancer drugs. \"There is a whole series of things in this cycle that need to be broken,\" Dr. Hayes said. One step that could make a big difference, scientists said, would be for researchers who think they have found a new genomic signature for cancer to publish enough of their data and analysis for others to verify their work. Surprisingly few have done so. The only reason the Duke research was discovered to be flawed, in fact, was that it relied on publicly available data sets and algorithms. Even so, unraveling the details of the work was so complicated that it took Keith Baggerly and Kevin Coombes, two statisticians at MD Anderson, 2,000 hours to find all the errors. Perhaps illustrating the perils of the needle-in-a-haystack approach, the only two genomic signatures for cancer that have been validated, used in the tests Oncotype DX and MammaPrint, were discovered in a very different ways. In both cases, researchers started with hundreds of genes that they had some reason to believe were important. They winnowed the collection down to those that seemed to be clinically useful. The Oncotype DX assay relies on 21 genes, and MammaPrint on 70. Both companies then rigorously tested their signatures to be certain that they were accurate in women with breast cancer. Oncotype DX showed its signature could predict prognosis and whether women would benefit from chemotherapy. Yet the two signatures used to make these tests have just one gene in common. \"What it means, as I suppose everybody is beginning to know, is that cancer is a very complicated thing,\" Dr. Berry said. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/771837",
      "Title": "Important BC article....NY Times voraciousreader 3littlegirls"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Radiologist Handel Reynolds has written a powerful 94 page book, The Big Squeeze... A Social and Political History of the Controversial Mammogram. I urge all women to read this book. The book questions how screening mammography became so popular while discussing it's limitations. It discusses the activism of breast cancer awareness that followed the rules book of the AIDS epidemic in getting political support behind the cause. And for those of you who hate the pinking of October, it is no wonder why everywhere we turn we see pink in October because the Komen folks have over 240 corporate tie-ins... The book is a sobering account of how the scientific evidence of mammography takes a back seat to politics and corporate will. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/802292",
      "Title": "The Big Squeeze voraciousreader 1Athena1"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Choosing Wisely: Doctors identify more than 130 tests and treatments they do too often Feb 21, 2013  9:00 AM     Think your kid really needs antibiotics for that sore throat? That a Pap smear every year is a good idea? That testosterone will restore your love live? The answers for most people: nope, nope, and nope. That's the word from, respectively, the American Academy of Pediatrics, the American College of Obstetrics and Gynecology, and the American Urological Association. And those are just three of more than 130 examples, from 25 medical societies, of tests and treatments that they the societies themselves say are often performed but often unnecessary, and sometimes even harmful. The topics have been gathered together as part of a project called Choosing Wisely. In it, each of the medical societies, which together represent more than 350,000 doctors nationwide, has identified five common tests or treatments that aren't supported by sound research. \"Twenty-five of the nation's leading medical specialty societies have now spoken up and shown leadership by identifying what tests and treatments are common to their profession, but not always beneficial,\" says Christine K. Cassel, M.D., president and CEO of the ABIM Foundation, the organization spearheading the effort. \"Millions of Americans are increasingly realizing that when it comes to health care, more is not necessarily better. Through these lists of tests and procedures, we hope to encourage conversations between physicians and patients about what care they truly need.\" Consumer Reports is participating in the project, too.... http://news.consumerreports.org/health/2013/02/choosing-wisely-doctors-identify-more-than-130-tests-and-treatments-they-do-too-often.html Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/800804",
      "Title": "Make yourself a better patient voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Breast Cancer and the FDA The agency's Avastin decision is a tragedy for desperately ill women. Article Comments more in Opinion » Email Print Save This ↓ More Twitter Digg + More close Yahoo! Buzz MySpace del.icio.us Reddit Facebook LinkedIn Fark Viadeo Orkut Text Yesterday the Food and Drug Administration moved to revoke its regulatory approval of Avastin for metastatic breast cancer. Withdrawing a cancer treatment is almost never done, and though the decision was expected, that does not make it any less reprehensible. The FDA said in a statement that it is removing Avastin's breast cancer indication because the biologic does not provide \"a sufficient benefit in slowing disease progression to outweigh the significant risk to patients.\" Ponder that \"sufficient.\" The agency is substituting its own judgments about clinical meaningfulness for those of practicing oncologists and terminally ill cancer patients. The risks of Avastin are real, but manageable. Clinical trials do not show that the drug extends life overall in the aggregate, but they have shown that it allows women to live longer without their disease getting worse. Avastin improves progression-free survival by about four months on average. Different patients respond differently, and the drug is far more effective in some than in others, for reasons that researchers still do not understand. There aren't any perfect therapeutic options in end-stage oncology, and Avastin ought to have remained one of them. Looking at the same data, the European Medicines Agency-the FDA's counterpart in the European Union-decided on Thursday that it would continue to approve Avastin for breast cancer in combination with chemotherapy. In October, the U.S. National Comprehensive Cancer Network-a consortium of 21 leading cancer centers that issues evidence-based medical guidelines-reaffirmed its position that Avastin is valuable in some cases. View Full ImageGetty Images Genentech is contesting the FDA ruling against its cancer medication, Avastin. But such finely graded distinctions are not part of the FDA's bureaucratic culture. The FDA provisionally (and reluctantly) approved Avastin for breast cancer in 2008 under an accelerated process for serious diseases. But the cancer drugs division believes that such flexibility is too friendly to industry and took extraordinary measures to rig the review process against Avastin's maker, Genentech, as we reported on August 18 in \"The Avastin Mugging.\" Genentech is contesting the ruling through a formal FDA appeals mechanism, and Avastin will remain available on an \"off label\" basis, because it is still approved for other cancers such as those of the lung, kidney and brain. However, private insurers are generally reluctant to reimburse for therapies that are not FDA-approved, and Medicare, which is the dominant payer in oncology, never does. One depressing implication is what the decision says about health-care financing as government entitlements expand. Avastin is a political target because of its high cost-a typical course runs as high as $88,000-and after ObamaCare all medical questions are inevitably political questions too. In September, the FDA and Medicare proposed a \"parallel review\" process that will allow the two agencies to coordinate market and reimbursement approval. Medicare is also increasingly opening \"national coverage determination\" reviews that allow a government board to decide if a therapy is \"reasonable and necessary.\" Another danger is to the future of medical innovation. Cancer treatment advances incrementally. Every year doctors are better able to pair medicines with the biomarkers pointing to the individuals who are most likely to respond and learn more about tumor angiogenesis, which is the process of cancer growth that Avastin helps to choke off. The FDA's assault will make it harder to conduct and enroll patients in further clinical studies, to say nothing of its message about the regulatory risk for drugs still in development. The greatest tragedy will fall on the women who are suffering from an incurable disease and whose caregivers are trying to improve their quality of life in the months they have left. The FDA is taking away one of their only options. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/762130",
      "Title": "Avastin Editorial from The Wall Street Journal voraciousreader kfinnigan"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Add Patience to a Leap of Faith to Discover Cancer Signatures By GINA KOLATA Are we outsmarting cancer? Or just ourselves? Over the past several years, scientists have begun looking not just for individual genes linked to cancer, but for collections of genes and molecules, like proteins, that form telltale patterns, or signatures, that can be used to identify a cancer cell and reveal what drugs might kill it. Signatures can be used to diagnose the disease, scientists hope, and to give a prognosis to patients who have cancer. But there have been few successes in this brave new world of cancer research, and some notable failures. Genetic tests devised at Duke University by researchers using the new methodology have turned out to be worthless, though they were once hailed as breakthroughs. Two new blood tests for ovarian cancer have also been abandoned. Despite the setbacks, researchers say they cannot give up on their quest for cancer signatures. Dr. Lajos Pusztai, a breast cancer researcher at the University of Texas MD Anderson Cancer Center, is one of them. How many new drugs, he asks, were approved for breast cancer treatment in the past decade? His answer: seven. None was much different from drugs already on the market. Yet in the same decade, he said, there were 8,000 publications in medical and scientific journals on breast cancer and more than 3,000 clinical trials at a cost of over $1 billion. \"What came out of this is seven ‘me too' drugs,\" Dr. Pusztai said. Yes, there have been studies showing single genes can go awry and fuel certain cancers, he and other scientists say. And yes, those studies have led to new drugs, so-called targeted therapies, that block the genes, extending the lives of some patients with some types of cancer. But for a major advance in the way cancer is diagnosed and treated, Dr. Pusztai and other researchers believe that work must continue on genomic signatures. It's a very different sort of science, an elaborate enterprise that involves complicated analyses of patterns of genes or other components of cells. The hunt for cancer signatures also is a type of work that requires a leap of faith. It is impossible for scientists to use their intuition to know whether a signature has any biological meaning - it is just a pattern, and the meaning comes from its statistical association with a result. By looking for these signatures, scientists are looking for a sort of next generation of biomarkers, and biomarkers have a troubled history in cancer research. About 15 years ago, when the world was simpler, the American Society for Clinical Oncology called together a group of experts and asked them to develop some guidelines. Which cancer biomarkers are useful for making clinical decisions? Dr. Daniel Hayes, a breast cancer researcher at the University of Michigan, was part of the group. \"We all kind of sat around and looked at each other and said, ‘We have no idea how to do this,' \" Dr. Hayes recalled. The field of tumor biomarkers, he said, \"had been so chaotic.\" All too often, researchers claimed to have discovered reliable ways to identify a particular cancer, but studies confirming they were valid had never been done. The group ended up writing a paper with what they called a \"level of evidence scale\" outlining the results they needed before they would believe a claim. Only a handful of tumor biomarkers met their criteria. Yet, Dr. Hayes said, \"during that time there had been hundreds of putative markers reported for breast cancer alone, let alone other diseases.\" With genomic signatures, the situation is more involved than it was 15 years ago, but the many of the same problems remain, Dr. Hayes and others say. Signatures can be used to identify cancer cells in the way a tartan can identify a Scottish clan, Dr. Hayes said. \"Each tartan is composed of threads of several different colors, but when woven into a single cloth, presents a distinctive pattern or signature that distinguishes one clan from another,\" he said. Yet the tools used to find signatures are so complex they can be misleading if the results are not tested properly. Investigators look for patterns in huge arrays of genes or proteins or RNA molecules, and they constantly find spurious associations with cancer that look for all the world like true ones. \"The question is, what is noise and what is real?\" said Dr. Steven Goodman, a biostatistician at Johns Hopkins University. In these studies, he added, \"you are guaranteed to find things,\" and almost always what is found is nonsense. Gene or protein patterns, said Donald Berry, a statistician at MD Anderson Cancer Center, \"are very difficult to get right.\" Finding them, he said, \"is like looking for a needle in a haystack when you can't tell the needle from the hay.\" Adding to the confusion is that the research requires a group of experts, each of whom has a different, highly technical skill. Each person on a team may be so specialized that no one is qualified to know exactly what his or her colleagues are doing. Dr. Pusztai's team, for instance, includes pathologists, molecular biologists and biostatisticians. \"No one person on the team sees all the pieces together,\" he said. For example, he said, just analyzing cancer tissue for a genomics study involves 200 to 3,000 steps and takes several days to complete. \"Any one of these steps can go wrong, and a good researcher should know what can influence the success of each step and control for the quality,\" he said. What comes out of this analysis is \"reams of numbers,\" Dr. Pusztai said. \"If one were to print these out it would amount to thousands of pages. The interpretation of these numbers is purely statistical and mathematical.\" Even when researchers find a real association, it may not be clinically useful. A genomic signature test that correctly identifies most tumors that will respond to a drug but incorrectly identifies others may not be of net benefit to patients. What is needed, and what rarely has been done, is research to see if a test based on a new biomarker does more good than harm. It's expensive and time-consuming, but it is the sort of evidence-gathering that is almost always done to see if a new drug is effective, Dr. Hayes noted. Yet there is little incentive to evaluate biomarkers, because the Food and Drug Administration does not require it and companies are not reimbursed as much for tests based on biomarkers as they are for new cancer drugs. \"There is a whole series of things in this cycle that need to be broken,\" Dr. Hayes said. One step that could make a big difference, scientists said, would be for researchers who think they have found a new genomic signature for cancer to publish enough of their data and analysis for others to verify their work. Surprisingly few have done so. The only reason the Duke research was discovered to be flawed, in fact, was that it relied on publicly available data sets and algorithms. Even so, unraveling the details of the work was so complicated that it took Keith Baggerly and Kevin Coombes, two statisticians at MD Anderson, 2,000 hours to find all the errors. Perhaps illustrating the perils of the needle-in-a-haystack approach, the only two genomic signatures for cancer that have been validated, used in the tests Oncotype DX and MammaPrint, were discovered in a very different ways. In both cases, researchers started with hundreds of genes that they had some reason to believe were important. They winnowed the collection down to those that seemed to be clinically useful. The Oncotype DX assay relies on 21 genes, and MammaPrint on 70. Both companies then rigorously tested their signatures to be certain that they were accurate in women with breast cancer. Oncotype DX showed its signature could predict prognosis and whether women would benefit from chemotherapy. Yet the two signatures used to make these tests have just one gene in common. \"What it means, as I suppose everybody is beginning to know, is that cancer is a very complicated thing,\" Dr. Berry said. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771834",
      "Title": "Important BC article..NY Times.... voraciousreader cycle-path"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Add Patience to a Leap of Faith to Discover Cancer Signatures By GINA KOLATA Are we outsmarting cancer? Or just ourselves? Over the past several years, scientists have begun looking not just for individual genes linked to cancer, but for collections of genes and molecules, like proteins, that form telltale patterns, or signatures, that can be used to identify a cancer cell and reveal what drugs might kill it. Signatures can be used to diagnose the disease, scientists hope, and to give a prognosis to patients who have cancer. But there have been few successes in this brave new world of cancer research, and some notable failures. Genetic tests devised at Duke University by researchers using the new methodology have turned out to be worthless, though they were once hailed as breakthroughs. Two new blood tests for ovarian cancer have also been abandoned. Despite the setbacks, researchers say they cannot give up on their quest for cancer signatures. Dr. Lajos Pusztai, a breast cancer researcher at the University of Texas MD Anderson Cancer Center, is one of them. How many new drugs, he asks, were approved for breast cancer treatment in the past decade? His answer: seven. None was much different from drugs already on the market. Yet in the same decade, he said, there were 8,000 publications in medical and scientific journals on breast cancer and more than 3,000 clinical trials at a cost of over $1 billion. \"What came out of this is seven ‘me too' drugs,\" Dr. Pusztai said. Yes, there have been studies showing single genes can go awry and fuel certain cancers, he and other scientists say. And yes, those studies have led to new drugs, so-called targeted therapies, that block the genes, extending the lives of some patients with some types of cancer. But for a major advance in the way cancer is diagnosed and treated, Dr. Pusztai and other researchers believe that work must continue on genomic signatures. It's a very different sort of science, an elaborate enterprise that involves complicated analyses of patterns of genes or other components of cells. The hunt for cancer signatures also is a type of work that requires a leap of faith. It is impossible for scientists to use their intuition to know whether a signature has any biological meaning - it is just a pattern, and the meaning comes from its statistical association with a result. By looking for these signatures, scientists are looking for a sort of next generation of biomarkers, and biomarkers have a troubled history in cancer research. About 15 years ago, when the world was simpler, the American Society for Clinical Oncology called together a group of experts and asked them to develop some guidelines. Which cancer biomarkers are useful for making clinical decisions? Dr. Daniel Hayes, a breast cancer researcher at the University of Michigan, was part of the group. \"We all kind of sat around and looked at each other and said, ‘We have no idea how to do this,' \" Dr. Hayes recalled. The field of tumor biomarkers, he said, \"had been so chaotic.\" All too often, researchers claimed to have discovered reliable ways to identify a particular cancer, but studies confirming they were valid had never been done. The group ended up writing a paper with what they called a \"level of evidence scale\" outlining the results they needed before they would believe a claim. Only a handful of tumor biomarkers met their criteria. Yet, Dr. Hayes said, \"during that time there had been hundreds of putative markers reported for breast cancer alone, let alone other diseases.\" With genomic signatures, the situation is more involved than it was 15 years ago, but the many of the same problems remain, Dr. Hayes and others say. Signatures can be used to identify cancer cells in the way a tartan can identify a Scottish clan, Dr. Hayes said. \"Each tartan is composed of threads of several different colors, but when woven into a single cloth, presents a distinctive pattern or signature that distinguishes one clan from another,\" he said. Yet the tools used to find signatures are so complex they can be misleading if the results are not tested properly. Investigators look for patterns in huge arrays of genes or proteins or RNA molecules, and they constantly find spurious associations with cancer that look for all the world like true ones. \"The question is, what is noise and what is real?\" said Dr. Steven Goodman, a biostatistician at Johns Hopkins University. In these studies, he added, \"you are guaranteed to find things,\" and almost always what is found is nonsense. Gene or protein patterns, said Donald Berry, a statistician at MD Anderson Cancer Center, \"are very difficult to get right.\" Finding them, he said, \"is like looking for a needle in a haystack when you can't tell the needle from the hay.\" Adding to the confusion is that the research requires a group of experts, each of whom has a different, highly technical skill. Each person on a team may be so specialized that no one is qualified to know exactly what his or her colleagues are doing. Dr. Pusztai's team, for instance, includes pathologists, molecular biologists and biostatisticians. \"No one person on the team sees all the pieces together,\" he said. For example, he said, just analyzing cancer tissue for a genomics study involves 200 to 3,000 steps and takes several days to complete. \"Any one of these steps can go wrong, and a good researcher should know what can influence the success of each step and control for the quality,\" he said. What comes out of this analysis is \"reams of numbers,\" Dr. Pusztai said. \"If one were to print these out it would amount to thousands of pages. The interpretation of these numbers is purely statistical and mathematical.\" Even when researchers find a real association, it may not be clinically useful. A genomic signature test that correctly identifies most tumors that will respond to a drug but incorrectly identifies others may not be of net benefit to patients. What is needed, and what rarely has been done, is research to see if a test based on a new biomarker does more good than harm. It's expensive and time-consuming, but it is the sort of evidence-gathering that is almost always done to see if a new drug is effective, Dr. Hayes noted. Yet there is little incentive to evaluate biomarkers, because the Food and Drug Administration does not require it and companies are not reimbursed as much for tests based on biomarkers as they are for new cancer drugs. \"There is a whole series of things in this cycle that need to be broken,\" Dr. Hayes said. One step that could make a big difference, scientists said, would be for researchers who think they have found a new genomic signature for cancer to publish enough of their data and analysis for others to verify their work. Surprisingly few have done so. The only reason the Duke research was discovered to be flawed, in fact, was that it relied on publicly available data sets and algorithms. Even so, unraveling the details of the work was so complicated that it took Keith Baggerly and Kevin Coombes, two statisticians at MD Anderson, 2,000 hours to find all the errors. Perhaps illustrating the perils of the needle-in-a-haystack approach, the only two genomic signatures for cancer that have been validated, used in the tests Oncotype DX and MammaPrint, were discovered in a very different ways. In both cases, researchers started with hundreds of genes that they had some reason to believe were important. They winnowed the collection down to those that seemed to be clinically useful. The Oncotype DX assay relies on 21 genes, and MammaPrint on 70. Both companies then rigorously tested their signatures to be certain that they were accurate in women with breast cancer. Oncotype DX showed its signature could predict prognosis and whether women would benefit from chemotherapy. Yet the two signatures used to make these tests have just one gene in common. \"What it means, as I suppose everybody is beginning to know, is that cancer is a very complicated thing,\" Dr. Berry said. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/771835",
      "Title": "Important BC article...NY Times voraciousreader mybee333"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Thomas Jefferson University ASCO:  Emerging trends in radiation therapy for women over 70 with early stage breast cancer ASCO Merit Award Patterns of radiation usage in breast conserving therapy for women 70 years and older with stage I breast cancer are changing: more women are opting for radioactive implants and those with estrogen positive tumors are opting out of radiation therapy, according to an abstract being presented at the American Society of Clinical Oncology annual meeting in Chicago by Thomas Jefferson University Hospital researchers on Saturday, June 4. The abstract (#6094) received an ASCO Merit Award. In another abstract (#1037), the researchers report that women with estrogen negative tumors were 91 percent more likely to die from breast cancer if they did not receive radiation therapy after a lumpectomy. Given the relatively recent developments in radiation therapy (i.e., an increased use of brachytherapy and external beams) and data supporting the idea that radiation isn't necessary for women with estrogen positive tumors, researchers wanted to see how actual practice patterns were impacted. Researchers found that there was a modest increase in the percentage of women with estrogen receptor positive cancers who did not get radiation therapy starting around 2004, and increasing use of radioactive implants, such the MammoSite, Contura, Savi or similar devices, since 2002. There was also a corresponding drop in women who received external beam radiation, according to Xinglei Shen, M.D., a resident in the Department of Radiation Oncology at Thomas Jefferson University Hospital. \"Among women with estrogen receptor negative cancers, there was not the same increase in frequency of women who did not get radiation, but there was an increased use of radioactive implants,\" he said. The consequence of those findings was determining what impact omitting radiation has on survival. While there is data that the omission of radiation therapy in women with estrogen receptor positive tumors who receive endocrine therapy, such as Tamoxifen, is not associated with a survival difference, limited data exists for estrogen receptor negative tumors in older women who undergo breast conservation. \"From the randomized trial data, we know that women with estrogen receptor positive stage I breast cancer have no detriment to survival by avoiding radiation, as long as they took Tamoxifen,\" Dr. Shen said. \"However, it is unknown if this would be the case in women with estrogen receptor negative cancer.\" Dr. Shen worked with Jefferson Medical College student Andrzej Wojcieszynski to examine survival in these women, and found that they were 91 percent more likely to die from breast cancer if they did not receive radiation therapy after a lumpectomy. (Abstract #1037). \"We have to be cautious when interpreting survival data from the SEER because of potential confounding variables, such as the health of the patients and use of chemotherapy,\" Dr. Shen said. \"However, these data do raise hypotheses for future study.\" \"Our conclusion is that adjuvant radiation therapy after lumpectomy reduces breast cancer mortality in women over 70 with stage I, estrogen receptor negative breast cancers, and that radiation is currently underutilized in these women,\" said Wojcieszynski. Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/770701",
      "Title": "ASCO Radiation for women above age 70 ER- voraciousreader voraciousreader"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Zometa Didn't Prevent Breast Cancer From Coming Back By Charlene Laino WebMD Health News Reviewed by Laura J. Martin, MD Dec. 9, 2010 (San Antonio) -- The bone-building drug Zometa does not appear to prevent breast cancer from coming back in most women, researchers report. Adding Zometa to standard therapy, usually chemotherapy, also did not extend lives, according to results of the study of more than 3,000 women. In women who were at least five years past menopause, however, the addition of Zometa improved overall survival rates by 29%, compared with standard treatment alone. \"This wasn't a small subgroup; 1,101 women fell into the category,\" says Robert Coleman, MD, professor of medical oncology at the University of Sheffield in England. \"The benefit was so great we don't think it's a chance finding,\" he tells WebMD. Still, the results of a subgroup analysis cannot be considered conclusive, Coleman says. Based on the findings, Novartis Pharmaceuticals, which makes the drug and funded the study, will withdraw U.S. and European applications for approval of Zometa to prevent breast cancer recurrences. Coleman presented findings of the study, dubbed AZURE, at the San Antonio Breast Cancer Symposium. A Visual Guide to Breast Cancer Earlier Studies Raise Hopes Zometa, given as an infusion, is a member of a class of drugs called bisphosphonates that help maintain bone strength. Animal and lab research suggests that bisphosphonates may fight breast cancer in a number of ways -- by directly killing tumor cells, by cutting off their blood supply, or by stimulating the immune system to mount an attack against the tumor, says Rowan Chlebowski, MD, PhD, a medical oncologist at Harbor-University of California, Los Angeles Medical Center. The new research builds on a study presented at the 2008 breast cancer meeting showing that Zometa appears to prevent breast cancer from coming back. Then, last year, Chlebowski presented an analysis of data on more than 150,000 women that showed that there were 31% fewer cases of breast cancer among women who took bisphosphonate pills than among women who didn't.   Zometa Does Not Appear to Prevent Breast Cancer Relapses The new five-year study involved 3,360 patients with breast cancer that had spread to the lymph nodes. A total of 404 women given Zometa plus standard therapy and 403 of those given standard treatment alone had a recurrence, developed a new cancer, or died before they had a recurrence. Altogether, 243 women on Zometa and 276 on standard treatment alone died, a difference so small it could be due to chance. Twenty-six women on Zometa had confirmed or suspected cases of osteonecrosis of the jaw, a side effect of bisphosphonates that causes the jawbone to decay. Routine Use of Zometa for Breast Cancer Treatment Not Warranted Since only women who were well into menopause appeared to benefit from the drug, Coleman says he suspects it works best in an environment of little or no estrogen. Commenting on the findings, Sharon Giordano, MD, MPH, of the University of Texas M.D. Anderson Cancer Center in Houston, says the scientific community has been waiting to hear these results. The bottom line, she tells WebMD, is that the routine use of Zometa to prevent breast cancer recurrence is not warranted at this time. As for its apparent benefit in postmenopausal women, Giordano says, \"Those findings are very intriguing, but not definitive.\" Four trials are under way that should better define bisphosphonates' role in breast cancer prevention, she says. The results do not affect Zometa and other bisphosphonates' \"important role in treating bone loss among women with breast cancer,\" Giordano says. Zometa is approved for the reduction or delay of bone complications across a broad range of cancers that have spread to the bone and multiple myeloma. It costs about $1,000 an infusion. This study was presented at a medical conference. The findings should be considered preliminary as they have not yet undergone the \"peer review\" process, in which outside experts scrutinize the data prior to publication in a medical journal. Top Picks Slideshow: Stress-Reducing Foods Health Check: Breast Cancer Treatment Options Interactive: Post Breast Surgery Exercises Join the Discussion in the Breast Cancer Community breast cancer newsletter There are new weapons in the fight against breast cancer. Know them. Sign up for the WebMD Breast Cancer newsletter and stay informed.View Article Sources SOURCES: San Antonio Breast Cancer Symposium, San Antonio, Dec. 8-12, 2010. Robert Coleman, MD, professor of medical oncology, University of Sheffield, England; consultant, Novartis Pharmaceuticals. Rowan Chlebowski, MD, PhD, Harbor-University of California, Los Angeles Medical Center. Sharon Giordano, MD, MPH, University of Texas M.D. Anderson Cancer Center, Houston.© 2010 WebMD, LLC. All rights reserved. Breast Cancer Home Breast Cancer News Breast Cancer Videos Breast Cancer Community Breast Cancer Questions and Answers Breast Cancer Glossary Breast Cancer Guide 1 Overview & Facts 2 Symptoms & Types 3 Diagnosis & Tests 4 Treatment & Care 5 Living & Managing 6 Support & Resources Related to Breast Cancer Breast Cancer Screening Breast Problems Breast Reconstruction Surgery Cervical Cancer Clinical Trials Hair Loss Ovarian Cancer Women's Health Common Treatments for Breast Cancer Arimidex Avastin Femara Herceptin Mastectomy Radiation Therapy Tamoxifen Taxol Vitamin A Xeloda More Drugs More Vitamins & Supplements Find Oncologists:Enter Location: e.g 60607 or Chicago, IL or IL Physician Directory Terms Hot Topics in Breast Cancer Elizabeth Edwards and End of Life Issues New Mammogram Screenings Guideline FAQ Quitting Smoking: Help For the First Hard Days Understanding Your Mammogram Results Breast Lumps: 7 Myths and Facts 8 Warning Signs of Breast Cancer Sleep Loss Can Affect Your Immune System Questions About Breast Cancer? Renowned oncologist Philomena McAndrew, MD, has answers. Close WebMD AnswersMore breast cancer questions? Ask Your Question What is breast cancer? Who is at risk for breast cancer? What should I know about breast reconstruction after breast cancer?   Choosing Mastectomy A study reveals why a high number of women with breast cancer still prefer to have the entire breast surgically removed instead of just the tumor.   Save 2nd Base Activists use humor as tool to fight breast cancer.   Detecting Stage Zero Breast Cancer Imaging Technology Advancement is Helping Doctors Find Early, Highly Treatable, Breast Cancer at What's Called Stage Zero.   Breast Cancer Side Effects Lymphedema causes painful swelling in the arm near the affected breast. A new study helps patients cope with the problem.   Breast Reconstruction Options A new type of breast reconstruction offers more choices for breast cancer survivors. It gives doctors added flexibility to create the most natural looking replacement. video library > Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Zometa Didn't Prevent Breast Cancer From Coming Back By Charlene Laino WebMD Health News Reviewed by Laura J. Martin, MD Dec. 9, 2010 (San Antonio) -- The bone-building drug Zometa does not appear to prevent breast cancer from coming back in most women, researchers report. Adding Zometa to standard therapy, usually chemotherapy, also did not extend lives, according to results of the study of more than 3,000 women. In women who were at least five years past menopause, however, the addition of Zometa improved overall survival rates by 29%, compared with standard treatment alone. \"This wasn't a small subgroup; 1,101 women fell into the category,\" says Robert Coleman, MD, professor of medical oncology at the University of Sheffield in England. \"The benefit was so great we don't think it's a chance finding,\" he tells WebMD. Still, the results of a subgroup analysis cannot be considered conclusive, Coleman says. Based on the findings, Novartis Pharmaceuticals, which makes the drug and funded the study, will withdraw U.S. and European applications for approval of Zometa to prevent breast cancer recurrences. Coleman presented findings of the study, dubbed AZURE, at the San Antonio Breast Cancer Symposium. A Visual Guide to Breast Cancer Earlier Studies Raise Hopes Zometa, given as an infusion, is a member of a class of drugs called bisphosphonates that help maintain bone strength. Animal and lab research suggests that bisphosphonates may fight breast cancer in a number of ways -- by directly killing tumor cells, by cutting off their blood supply, or by stimulating the immune system to mount an attack against the tumor, says Rowan Chlebowski, MD, PhD, a medical oncologist at Harbor-University of California, Los Angeles Medical Center. The new research builds on a study presented at the 2008 breast cancer meeting showing that Zometa appears to prevent breast cancer from coming back. Then, last year, Chlebowski presented an analysis of data on more than 150,000 women that showed that there were 31% fewer cases of breast cancer among women who took bisphosphonate pills than among women who didn't.   Zometa Does Not Appear to Prevent Breast Cancer Relapses The new five-year study involved 3,360 patients with breast cancer that had spread to the lymph nodes. A total of 404 women given Zometa plus standard therapy and 403 of those given standard treatment alone had a recurrence, developed a new cancer, or died before they had a recurrence. Altogether, 243 women on Zometa and 276 on standard treatment alone died, a difference so small it could be due to chance. Twenty-six women on Zometa had confirmed or suspected cases of osteonecrosis of the jaw, a side effect of bisphosphonates that causes the jawbone to decay. Routine Use of Zometa for Breast Cancer Treatment Not Warranted Since only women who were well into menopause appeared to benefit from the drug, Coleman says he suspects it works best in an environment of little or no estrogen. Commenting on the findings, Sharon Giordano, MD, MPH, of the University of Texas M.D. Anderson Cancer Center in Houston, says the scientific community has been waiting to hear these results. The bottom line, she tells WebMD, is that the routine use of Zometa to prevent breast cancer recurrence is not warranted at this time. As for its apparent benefit in postmenopausal women, Giordano says, \"Those findings are very intriguing, but not definitive.\" Four trials are under way that should better define bisphosphonates' role in breast cancer prevention, she says. The results do not affect Zometa and other bisphosphonates' \"important role in treating bone loss among women with breast cancer,\" Giordano says. Zometa is approved for the reduction or delay of bone complications across a broad range of cancers that have spread to the bone and multiple myeloma. It costs about $1,000 an infusion. This study was presented at a medical conference. The findings should be considered preliminary as they have not yet undergone the \"peer review\" process, in which outside experts scrutinize the data prior to publication in a medical journal. Top Picks Slideshow: Stress-Reducing Foods Health Check: Breast Cancer Treatment Options Interactive: Post Breast Surgery Exercises Join the Discussion in the Breast Cancer Community breast cancer newsletter There are new weapons in the fight against breast cancer. Know them. Sign up for the WebMD Breast Cancer newsletter and stay informed.View Article Sources SOURCES: San Antonio Breast Cancer Symposium, San Antonio, Dec. 8-12, 2010. Robert Coleman, MD, professor of medical oncology, University of Sheffield, England; consultant, Novartis Pharmaceuticals. Rowan Chlebowski, MD, PhD, Harbor-University of California, Los Angeles Medical Center. Sharon Giordano, MD, MPH, University of Texas M.D. Anderson Cancer Center, Houston.© 2010 WebMD, LLC. All rights reserved. Breast Cancer Home Breast Cancer News Breast Cancer Videos Breast Cancer Community Breast Cancer Questions and Answers Breast Cancer Glossary Breast Cancer Guide 1 Overview & Facts 2 Symptoms & Types 3 Diagnosis & Tests 4 Treatment & Care 5 Living & Managing 6 Support & Resources Related to Breast Cancer Breast Cancer Screening Breast Problems Breast Reconstruction Surgery Cervical Cancer Clinical Trials Hair Loss Ovarian Cancer Women's Health Common Treatments for Breast Cancer Arimidex Avastin Femara Herceptin Mastectomy Radiation Therapy Tamoxifen Taxol Vitamin A Xeloda More Drugs More Vitamins & Supplements Find Oncologists:Enter Location: e.g 60607 or Chicago, IL or IL Physician Directory Terms Hot Topics in Breast Cancer Elizabeth Edwards and End of Life Issues New Mammogram Screenings Guideline FAQ Quitting Smoking: Help For the First Hard Days Understanding Your Mammogram Results Breast Lumps: 7 Myths and Facts 8 Warning Signs of Breast Cancer Sleep Loss Can Affect Your Immune System Questions About Breast Cancer? Renowned oncologist Philomena McAndrew, MD, has answers. Close WebMD AnswersMore breast cancer questions? Ask Your Question What is breast cancer? Who is at risk for breast cancer? What should I know about breast reconstruction after breast cancer?   Choosing Mastectomy A study reveals why a high number of women with breast cancer still prefer to have the entire breast surgically removed instead of just the tumor.   Save 2nd Base Activists use humor as tool to fight breast cancer.   Detecting Stage Zero Breast Cancer Imaging Technology Advancement is Helping Doctors Find Early, Highly Treatable, Breast Cancer at What's Called Stage Zero.   Breast Cancer Side Effects Lymphedema causes painful swelling in the arm near the affected breast. A new study helps patients cope with the problem.   Breast Reconstruction Options A new type of breast reconstruction offers more choices for breast cancer survivors. It gives doctors added flexibility to create the most natural looking replacement. video library > Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    },
    {
      "AuthorID": "voraciousreader",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/103086/profile",
      "Content": "voraciousreader wrote: Zometa Didn't Prevent Breast Cancer From Coming Back By Charlene Laino WebMD Health News Reviewed by Laura J. Martin, MD Dec. 9, 2010 (San Antonio) -- The bone-building drug Zometa does not appear to prevent breast cancer from coming back in most women, researchers report. Adding Zometa to standard therapy, usually chemotherapy, also did not extend lives, according to results of the study of more than 3,000 women. In women who were at least five years past menopause, however, the addition of Zometa improved overall survival rates by 29%, compared with standard treatment alone. \"This wasn't a small subgroup; 1,101 women fell into the category,\" says Robert Coleman, MD, professor of medical oncology at the University of Sheffield in England. \"The benefit was so great we don't think it's a chance finding,\" he tells WebMD. Still, the results of a subgroup analysis cannot be considered conclusive, Coleman says. Based on the findings, Novartis Pharmaceuticals, which makes the drug and funded the study, will withdraw U.S. and European applications for approval of Zometa to prevent breast cancer recurrences. Coleman presented findings of the study, dubbed AZURE, at the San Antonio Breast Cancer Symposium. A Visual Guide to Breast Cancer Earlier Studies Raise Hopes Zometa, given as an infusion, is a member of a class of drugs called bisphosphonates that help maintain bone strength. Animal and lab research suggests that bisphosphonates may fight breast cancer in a number of ways -- by directly killing tumor cells, by cutting off their blood supply, or by stimulating the immune system to mount an attack against the tumor, says Rowan Chlebowski, MD, PhD, a medical oncologist at Harbor-University of California, Los Angeles Medical Center. The new research builds on a study presented at the 2008 breast cancer meeting showing that Zometa appears to prevent breast cancer from coming back. Then, last year, Chlebowski presented an analysis of data on more than 150,000 women that showed that there were 31% fewer cases of breast cancer among women who took bisphosphonate pills than among women who didn't.   Zometa Does Not Appear to Prevent Breast Cancer Relapses The new five-year study involved 3,360 patients with breast cancer that had spread to the lymph nodes. A total of 404 women given Zometa plus standard therapy and 403 of those given standard treatment alone had a recurrence, developed a new cancer, or died before they had a recurrence. Altogether, 243 women on Zometa and 276 on standard treatment alone died, a difference so small it could be due to chance. Twenty-six women on Zometa had confirmed or suspected cases of osteonecrosis of the jaw, a side effect of bisphosphonates that causes the jawbone to decay. Routine Use of Zometa for Breast Cancer Treatment Not Warranted Since only women who were well into menopause appeared to benefit from the drug, Coleman says he suspects it works best in an environment of little or no estrogen. Commenting on the findings, Sharon Giordano, MD, MPH, of the University of Texas M.D. Anderson Cancer Center in Houston, says the scientific community has been waiting to hear these results. The bottom line, she tells WebMD, is that the routine use of Zometa to prevent breast cancer recurrence is not warranted at this time. As for its apparent benefit in postmenopausal women, Giordano says, \"Those findings are very intriguing, but not definitive.\" Four trials are under way that should better define bisphosphonates' role in breast cancer prevention, she says. The results do not affect Zometa and other bisphosphonates' \"important role in treating bone loss among women with breast cancer,\" Giordano says. Zometa is approved for the reduction or delay of bone complications across a broad range of cancers that have spread to the bone and multiple myeloma. It costs about $1,000 an infusion. This study was presented at a medical conference. The findings should be considered preliminary as they have not yet undergone the \"peer review\" process, in which outside experts scrutinize the data prior to publication in a medical journal. Top Picks Slideshow: Stress-Reducing Foods Health Check: Breast Cancer Treatment Options Interactive: Post Breast Surgery Exercises Join the Discussion in the Breast Cancer Community breast cancer newsletter There are new weapons in the fight against breast cancer. Know them. Sign up for the WebMD Breast Cancer newsletter and stay informed.View Article Sources SOURCES: San Antonio Breast Cancer Symposium, San Antonio, Dec. 8-12, 2010. Robert Coleman, MD, professor of medical oncology, University of Sheffield, England; consultant, Novartis Pharmaceuticals. Rowan Chlebowski, MD, PhD, Harbor-University of California, Los Angeles Medical Center. Sharon Giordano, MD, MPH, University of Texas M.D. Anderson Cancer Center, Houston.© 2010 WebMD, LLC. All rights reserved. Breast Cancer Home Breast Cancer News Breast Cancer Videos Breast Cancer Community Breast Cancer Questions and Answers Breast Cancer Glossary Breast Cancer Guide 1 Overview & Facts 2 Symptoms & Types 3 Diagnosis & Tests 4 Treatment & Care 5 Living & Managing 6 Support & Resources Related to Breast Cancer Breast Cancer Screening Breast Problems Breast Reconstruction Surgery Cervical Cancer Clinical Trials Hair Loss Ovarian Cancer Women's Health Common Treatments for Breast Cancer Arimidex Avastin Femara Herceptin Mastectomy Radiation Therapy Tamoxifen Taxol Vitamin A Xeloda More Drugs More Vitamins & Supplements Find Oncologists:Enter Location: e.g 60607 or Chicago, IL or IL Physician Directory Terms Hot Topics in Breast Cancer Elizabeth Edwards and End of Life Issues New Mammogram Screenings Guideline FAQ Quitting Smoking: Help For the First Hard Days Understanding Your Mammogram Results Breast Lumps: 7 Myths and Facts 8 Warning Signs of Breast Cancer Sleep Loss Can Affect Your Immune System Questions About Breast Cancer? Renowned oncologist Philomena McAndrew, MD, has answers. Close WebMD AnswersMore breast cancer questions? Ask Your Question What is breast cancer? Who is at risk for breast cancer? What should I know about breast reconstruction after breast cancer?   Choosing Mastectomy A study reveals why a high number of women with breast cancer still prefer to have the entire breast surgically removed instead of just the tumor.   Save 2nd Base Activists use humor as tool to fight breast cancer.   Detecting Stage Zero Breast Cancer Imaging Technology Advancement is Helping Doctors Find Early, Highly Treatable, Breast Cancer at What's Called Stage Zero.   Breast Cancer Side Effects Lymphedema causes painful swelling in the arm near the affected breast. A new study helps patients cope with the problem.   Breast Reconstruction Options A new type of breast reconstruction offers more choices for breast cancer survivors. It gives doctors added flexibility to create the most natural looking replacement. video library > Doctor told me regarding my prognosis that I WASN'T on the Titanic! Hmmm...Really?....Okay! 02/2010 Pure Mucinous Breast Cancer, Oncotype DX 15, Stage 1, Grade 1, 1.8 cm, 0/2 nodes, ER+ 90% /PR+ 70% HER2- (+1) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761792",
      "Title": "Zometa - Latest News out of San Antonio Meeting voraciousreader Gitane"
    }
  ]
}