{
  "AuthorID": "vtealeaf",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187329/profile",
  "Posts": [{
    "AuthorID": "vtealeaf",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/187329/profile",
    "Content": "vtealeaf wrote: Hello everyone, I had posted a week or so back (community.breastcancer.org/for... and I'll try to give quick background, as I had an Ultrasound on my breast today and I don't feel good about how it went. Family history: Mom's sister was diagnosed with breast cancer, already \"baseball\" sized, at 26, and passed away in her thirties from it. (I thought she was diagnosed in her thirties, but my mom corrected me.) My problem: For about 6 months, in one breast, on the same side/area, I've had pain, and in the beginning \"deep\" itching. I've paid attention, and (I'm on Seasonale, only 4 periods a year) the pain comes and goes lasting anywhere from a few days to over two weeks, seemingly unrelated to cycle, diet, weight, etc. I was also awoken from sleep with a hot, intense burning in that breast a couple months ago. I'll be 23 in a few weeks. My doctor seemed to find something in the upper outer area of the breast that's been hurting (she didn't say \"lump\" though) and sent me for a mammogram. My tech asked me very quickly what's going on, and very gently went over the breast for the US, and kept saying that everything looked great. A doctor came in, didn't talk to me, he spent about 10 seconds on the breast, said \"normal\" and then walked out. He didn't even ask me what was going on or where it hurt! I was then lectured on wearing supportive bras (I ALWAYS wear nice, supportive, all cotton bras), not drinking too much caffeine, and was told it's probably because of periods and hormones related to them (keep in mind, I told them I only have 4 a year multiple times, and have been on the same pill for almost 8 years.) They then said \"We'll see you when you're 40!\" I don't feel better at all! It's been the same breast for 6 months regardless of what's going on in my life/ my body. The time it woke me with burning, I was not drinking ANY caffeine because I was on a vacation! What should I do or ask for? I was told they won't do a mammo since I'm young and they won't see anything anyway...I'm really bummed and worried, and I've had a bad feeling about it for months. :( The pain seems to have spread further up and starting into the area before my armpit, which also concerns me. How hard should I push for another test, or opinion, or what? Please advise! I feel like I've been totally brushed off and I'm sitting here hurting, still... Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "12/09/2013",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/810881",
    "Title": "Should I insist on another test? What kind? vtealeaf farmerlucy"
  }]
}