{
  "AuthorID": "walker2222",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
  "Posts": [
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Dec 31, 2010 02:55PM walker2222 wrote: I start my rads on Monday 1/3 30 treatments until 2/11.  I have a nice Valentines gift.  I will take me longer to get the onco office get undressed and on the table than the treatment lasts amazing.  I am working so you know where I will be for lunch. After rads I am going to deconstruct, had two failed attemapts on my right side with TE, left TE is fine.  The thought of any more recon surgery makes me ill and depressed.  So for me it was all or nothing.  At least this will be incentive to lose weight and keep it down. Happy Successful New Year to ya'll from TX.",
      "MessageIndex": 67,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 10, 2011 12:10PM walker2222 wrote: We got to and from appointment without mishap.  #6 done, 24 to go.  Yee Haw",
      "MessageIndex": 331,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 14, 2011 06:43PM walker2222 wrote: Everyone have a great weekend.  Got a bit red and uncomfy but put the Miaderm on feels better.  Put aloe on after the rads.  Saw PS today and he said he thought the skin looked good and about what he expected at this stage.  After my pow wow with him I have opted not to continue recon due to the past two infections and TE failures.  Will have to wait 3 months after rads to do any surgery but the end results would be if recon never happened.  I am at peace with this and it is what I want to do.",
      "MessageIndex": 469,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 4, 2011 09:59AM walker2222 wrote: It was easy breezy but all the machines were a bit unexpected but I made it through my MRI's so this was a walk in the park.  Went to my cancer care group at church last night and found out though a new attendee, we have the same RO.  He had nothing but praise for the people there at the office.  I am to tell everyone hi for him.  I know I am in good hands for this stage of my journey.  My RO said yesterday that it will be over before you know it.  I am sure of that as I had 8 rounds of chemo every two weeks and that just flew by.  Only this time I can't take a nap and it will take me longer to get there get ready and on the table than the whole procedure takes. I am so uplifted today as I reflect on what I have gone through, I think of my fav Scripture vs. Phil 4:13 \"I can do All things through Christ that strengheneth me.\"  Live, Laugh, Love Good luck to everyone today and Barbcard2 I pray that you do not have shingles and I have heard about the shot too.  I had shingles several years ago and it is not something I would look forward to again.",
      "MessageIndex": 121,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 5, 2011 10:17AM walker2222 wrote: I got my schedule when they did my initial scans and got my first tattoos.  I just go to the waiting area initial by my name.  They have a camera right over the schedule and call you in when they are ready for you.  Yesterday signed in and bearly sat down when they called me in and were ready for me after I changed, it was so quick.  This is with Texas Oncology, next to the Medical Center of Plano (TX).  I have been so impressed with them, they make you feel at home.  The only down thing is it is 20 to 25 min. from work.  I go at 1:00 for each of my appointments.  Since I am working, I am using that as my lunch break. I did my chemo with Texas Oncology but my Oncologist was in a different location but partners with the other location and referes all his patients to the Plano office for radiation.  #3 today getting ready to leave in 15 min.  I do not know if rads fatigue hit me yesterday after work, but after picking up my son from high school I took a 3 hour nap and then went to bed at 10:00 and slept all night long. Love to all",
      "MessageIndex": 154,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 17, 2011 12:11PM walker2222 wrote: suepen I was there two weeks ago and boy two weeks have flown by. #11 down for me, I am trying to count weeks now.  So after this week I will be 1/2 way through.  Seems to let the time fly.  I asked how long it takes for each zap.  The tech said it was not based on how long but what the dose is.  Environmental factors take place and the machine compensates for it, i.e. humidity, temp, b pressure etc.  So my dose is 180center grate for breast and same for lymph nodes.  Does anyone else know their dose?  Trying to see if mine is high, low or in between.",
      "MessageIndex": 515,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 5, 2011 06:48PM walker2222 wrote: Well 3 down and 27 more to go.  Is anyone else getting what is called a Bolus treatment? I will try to explain.  Every other treatment my RO wants this done, they put a heavy shield over my affected area.  The machine treats it as it would your top layer of skin so it would just radiate the area just under your skin.  The reasoning is to get a localized area at least that is how I understand it.  I have been pleased so far the treatments and staff.  I did ask about taking multivitamins and the nurse said those were fine. I asked the tech about my fatigue yesterday and she said it was to early for radiation fatigue so I guess it was coming off the holiday season rush and other issues that caught up with me.  She said most of the time if you are already an active person, you don't get tired.  I am not overly active.  She said it would show up after around two weeks, skin changes around three weeks.  Using my aloe everyday after treatments.  I have a prostheses for my right side that I have stopped wearing as it rubs the skin going to look uneven for a while. Just hope the weather doesn't turn bad next week here in TX because nobody knows how to drive in bad weather down here.",
      "MessageIndex": 175,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 18, 2011 06:58AM walker2222 wrote: Jo - your boost sound like my bolus treatment I get everyother day.  They use the gel pack covered in towel.  I see the RO today and ask about the difference.  My guess is the regular treatments encompas the whole breast whereas the boost is directed to the tumor site.  I am real red after the bolus treatment and lather up on my aloe after. The area under my right arm seems to be getting real tight when I lift my arms.  I can now tell the difference since I thought it was my joint issues from Femara.  When I lift both arms only the right one seems tighter.  I am exercising my arm almost every hour.",
      "MessageIndex": 552,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 6, 2011 12:52PM walker2222 wrote: Redninrah I have a prosthesis and work too.  I have been wearing sports bras ever since my last reconstruction attempt failed on my tumor side (right) prior to radiation.  I had a bi with reconstruction and the left side has no problems so right now I am lopsided.  I have taken out my prosthesis and put soft padding there to even out the shape and no rubbing.  My prosthesis was only suppose to be temporary but since the last failed attempt permanent as I will also have the left TE removed as we have not finished total recon.  I am done with reconstruction and as you can tell this is a sore subject for me.  Any how onward and upward.  4 down 26 more to go filling AOK.  Love all.",
      "MessageIndex": 205,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 19, 2011 05:03PM walker2222 wrote: Sherry/Barbcard - so sorry you are going through difficult time.  Barbcard I to hope you get relef too.  Even if your RO/techs has seen this a bazillon times it they should do something to see to your relef and get through your treatments.  We'll celebrate with you somehow.",
      "MessageIndex": 610,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 20, 2011 05:45AM walker2222 wrote: Sunangel - Huggs and prayers going your way.",
      "MessageIndex": 623,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 20, 2011 06:36PM walker2222 wrote: Dido from me.  I hope you all will be relief this weekend for a bit of a break. Sherryc/Barbcard - pray you both make it through this last bit with no more discomfort. Changed my pic with the new me.",
      "MessageIndex": 653,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 7, 2011 03:07PM walker2222 wrote: Omaz I am the same as you, I have lines on the sides, horizontal and vertical.  Sentinel area included.  I found out I will have 25 treatments and 5 boosts.  My tumor was on my right breast at around 11:00.  Felt a bit warm on the skin again and a bit red.  Put aloe on after the treatment.  My Dr. is old school aloe only because he said the creams could inflame or infect the area.  I did use my Miaderm yesterday and this morning, my skin felt better and had no SE.  Should I continue to use it even though he said no?  It felt so good.",
      "MessageIndex": 266,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 21, 2011 10:08AM walker2222 wrote: Congrats too JulieDee, I am glad for you.  Have a good well deserved trip.",
      "MessageIndex": 673,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 11, 2011 01:23PM walker2222 wrote: #7 today, energy seems zapped this afternoon, I think it is my Tuesday blues.  Happened last week for some reason.  Saw my RO today, walked in and said \"Hey Sweetness\", I wonder if he says that to all his female patients or just me.  Forgot to ask.  I ask next week.",
      "MessageIndex": 358,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 13, 2011 12:22PM walker2222 wrote: I get zapped from three positions, two per position if I count the zaps right.  Over right b, upper left side and down low on the right side.  Seeing the teeth move is a bit unnerving the first few times.  I found out the xrays are for positioning, I am sure everyone else knew this but me.  I can be a bit dense sometimes.",
      "MessageIndex": 432,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 14, 2011 12:29PM walker2222 wrote: Congrats to those who have finished, 2 wks down 4 more to go. Today when I raised my right arm (affect side) it was stiff and tight.  It maybe just my shoulder stiffness.  I am on Femara and my shoulder joints seem stiff this week.  Will be exercising lifting arm over head this weekend to see if that helps.",
      "MessageIndex": 460,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 27, 2011 01:36PM walker2222 wrote: rachel - I do go up and over a bit on my shoulder to get that area.  They did say you may end up with a spot on your back since the beam goes all the way through.  I have checked but have not seen one. Seem to be redder today under my arm, tech said skin texture looked real good at this stage with one more week of regular treatments.  Said the redness under the arm is due to friction with my arm rubbing against it.  Never would have thought of that.",
      "MessageIndex": 851,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 18, 2011 08:51AM walker2222 wrote: lestwin - I am jumping in this one, they say don't use aluminum based deodorants.  I use Toms brand aluminum free unsented extra absorbant.  I do not use it on the right side (tumor) as I have not needed to. Sherry - I hope you feel comfort soon. ",
      "MessageIndex": 561,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 4, 2011 01:40PM walker2222 wrote: Ginger, welcome to the group.  I have neuropathy in my hands and feet to.  I ended Chemo Oct 1st full round though.  I still have a little numbness in my finger tips but not as bad as it was.  Feet are doing better but still have some problems too.  I had some nerve damage in my legs that aggravated the neuropathy from an earlier condition so I am not for sure if it will totally go away for me.  Taking hot bath will help or soaking your feet in Epsom salt and hot water/then an ice plunge can also relieve the pain.",
      "MessageIndex": 133,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 2, 2011 04:02PM walker2222 wrote: Well due to bad weather my 5th week of rads has been extended.  I got in Monday and will be missing three days this week.  Hopefully Friday I will get in.  They were suppose to do scans for my boost treatments next week and give me more markers.  I guess I do not get my Valentines gift of no more rads.  Well at least my skin will have a break.  Saw a big change from the fourth week to the fifth week. About husbands and doing stuff - my neighbors daughter came over yesterday after the ice storm and said her garage door would not go down and did not understand why, I guess her mom was not home (dad past away a few years ago very said).  My DH went over to check it out, she asked if he was a handy man. He was not for sure how to take that but just smiled and said he just knew how to do stuff.  We the problem was snow had piled up against the sensors and he just cleared the path.  But he really is a handy man and handy to have around.  He did take me to all but two chemo treatments, drove me to appts post surgery.  He does not take me to rads since they are short and I do them on my lunch hour, but was going to drive me Tuesday when the roads were bad but they had closed anyway.  I will say in his own way has had a hard time dealing with my BC and my mood swings, but only complains when he is tired of doing stuff. Sorry for the long explanation",
      "MessageIndex": 1031,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 3, 2011 09:34AM walker2222 wrote: Kick2it - sorry to see you here but big hugs. RO office open today, have to give myself extra time to get there here in the deep freeze of TX.  I hope I get to see the RO today since I misse Tuesday which is the normal day I see him.  I want to show him my purple spot next the the SNB area under the arm pit.  It is bothering the heck out of me.  See if they have a gel pack like rancygirl recomended.  Put an ice pack on yesterday and it felt sooooo goooood!",
      "MessageIndex": 1057,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 3, 2011 04:31PM walker2222 wrote: Cann't wait to use the Palmers I got for post rads celebration.  bher - did the RO give you a time when you can start regular lotion after rads?  Just wondering.",
      "MessageIndex": 1077,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 7, 2011 06:41AM walker2222 wrote: Well I have 30 total treatments no body said anything about boost but I am going to check and see if it is the bolus treatment they have been giving me.  I got my Miaderm yesterday and tied it and felt sooo good last night.  I was a little pink and had a warming sensation when I got home and it helped.  One week under the belt, have my \"fought like a girl and won\" t shirt on today for jeans day.  Feel empowered.  Question should I just use the Miaderm or use it with the aloe vera too?  I am going to ask the RO or his nurse about the Miaderm today.  They only put aloe vera on my list to use.  I have been using Toms since I started Chemo it is has been great. We in TX are suppose to get the Polar Express in Sunday, that is all they talk of on the news, see it to believe it.",
      "MessageIndex": 240,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 7, 2011 09:54AM walker2222 wrote: Well I am going to ask if I am going to have an boost treatments since they did not mention it in my planning session.  #5 today. As for the weather, I don't mind the cold to much or the snow but when we have ice storms, thats when I hide under the covers.  Ice storms and TX do not mix.  It turns into black ice, no one knows where is starts or stops and drives crazy inbetween.  At least when the sun hits it, it goes away. Everyone have a grand weekend.",
      "MessageIndex": 252,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 8, 2011 02:34PM walker2222 wrote: I forgot to add per our insurance, since I go to the Drs office it is the specialty co pay of $40 per visit so total out of pocket will be $1200.  Billed every two weeks.  So it could be worse.",
      "MessageIndex": 304,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 9, 2011 11:48AM walker2222 wrote: Snow snow snow, maybe difficult to get to rads tomorrow since it is 25 min away.  Will call in advance to make sure they are open. I am on my DH insurance plan and once I reach 1k for myself it is 100% plan pay but your right Sherryc that does not include co pay.  We do a flex plan every year but it is hard to anticipate what you need, case in point last year.  It was eaten up by a few MRI's and sonograms before May started.",
      "MessageIndex": 312,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 10, 2011 06:44AM walker2222 wrote: Jo1955 - Frisco is 30 miles north of Dallas, was a small town of 27,000 when we moved here in 1999, before that a spec in the dust.  We are now over 100,000.  Made it to work (only 5 miles away) with no problems but a bit icy in patches.  Have my rads at 1:00 call the office before I go.  It is in Plano just south Hwy 121 and they said Plano was clear, amazing.  Delayed school for two hours. DH is taking son to school be fore he goes to work.  He works 30 miles away and has to take the freeways.  Wish I could post a pic of what our street looked like yesterday but having technical difficulties. SherryC - I know what you mean about TX weather.  If you blink it changes from one extreme to the next.",
      "MessageIndex": 324,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 27, 2011 08:12AM walker2222 wrote: Boy being off the tread for a couple of days you have a lot of comments to get through. Congrats to Sherry C and all the others who have finished rads. I'm 19 today, not the age but the treatments.  Noticed getting a lot redder that before, found bumps on the skins, asked the RO and he said to put some hydra cortisone on it with aloe vera.  Well found a rub on tube with aloe in it that goes directly to the affected area.  Carry the tube with me everywhere.  I am also getting my lymph node area radiated along with the breast area due to node involvement.  It looks like I have a heat rash on my collarbone.  Counting the days now not Feb. 11th.",
      "MessageIndex": 841,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 10, 2011 04:06PM walker2222 wrote: Sunangel - welcome and best wishes on your tests and progress.",
      "MessageIndex": 337,
      "PostDate": "10/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 28, 2011 12:25PM walker2222 wrote: Four weeks down two more to go, 1 regular week and 1 boost.  Tech noticed I was getting real red and crusty on the inside.  Got a prescription for some ointment, forgot the name.  Looking forward to getting it filled and get some relief.  And I was doing so well. Good wishes to those who are just starting.  Seems like yesterday I was having my tats done.",
      "MessageIndex": 870,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 13, 2011 10:14AM walker2222 wrote: I felt some redness or heat the first few treatments, techs said it would not happen until after a few weeks.  My tech told me Monday that would be the day they do the exrays.  Really would not have known the difference, it was just a different thingy they used to slide into the machine.  I have really been tired this week, kept falling asleep watching TV, gave up at 9:00 and went to bed.  #9 today.",
      "MessageIndex": 423,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 14, 2011 10:12AM walker2222 wrote: Irr4993 & rachel - I have had two boost and I have not seen any problems, due to weather issues my days have been split.  I did Thur & Friday and then Today thru Wed.  Then done.  I had a big change from week 4 to week 5 where I did get bad radiation burn, RO perscribed the Silver Sulfadiazine cream.  It took as week to go from red/purple angry burn to now mostly pink and some reddness.  check out with your DR if you are concerned.",
      "MessageIndex": 1362,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 07:52AM walker2222 wrote: #21 yesterday, I have just started my 5th week, today I was suppose to get more markers for my boost treatments next week.  So it looks like it might be delayed a couple of days.  Temp is in the 20's and wind chill is in the negative.",
      "MessageIndex": 963,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 14, 2011 09:23PM - edited Feb 15, 2011 10:23AM by walker2222",
      "MessageIndex": 1382,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 05:05PM walker2222 wrote: Grannydukes - sorry about your sister in law, you and your family will be in my prayers.",
      "MessageIndex": 985,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 15, 2011 01:07PM walker2222 wrote: Mariposa Have your RO check the skin. My skin fell apart between the 4th and 5th week. The dr gave me the silver cream. My RO stopped my bolus treatments on my last week of regular treatments because of it.",
      "MessageIndex": 1394,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 01:01PM walker2222 wrote: Maripose - the silvadene cream is a perscription cream for burns and wound care.",
      "MessageIndex": 1436,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 19, 2011 01:06PM walker2222 wrote: #13 for me today too.  Thought I had a blister appear, small but nonetheless.  Tech said it was just at bit redder in that area, more Aloe Vera should do the trick. My redness does diminish on the weekends but still looks like I was kissed by the sun.",
      "MessageIndex": 596,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 21, 2011 11:53AM walker2222 wrote: Half way done, #15.  The fatigue has hit me now, by the time I get home after work I want to take a nap.  Weekend here I come.",
      "MessageIndex": 675,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 27, 2011 09:56AM walker2222 wrote: marjie - keep plugging in eventhough you do not start until March, we love to know how each of us are doing.",
      "MessageIndex": 843,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 27, 2011 07:16PM walker2222 wrote: I was wondering about the big door too.  Lying their I imagined something like the wizard of oz, someone behind the curtain pushing all the knobs.  I do hear it opening and closing.",
      "MessageIndex": 861,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 2, 2011 04:07PM walker2222 wrote: I am 30 north of Dallas and it is 21 right now, the wind chill makes it 17, and it my snow again Friday. Yikes, this is no fun.  Did get into work today though (had a project due), roads were very icy but I live 5 miles from the office so went very very slow. ",
      "MessageIndex": 1033,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 3, 2011 02:15PM walker2222 wrote: Congrats on those who have finished, sighing with envy.  Did get in today and back to work with out troubles, took two hours though.  Most of it was on the road.  The RO stopped my bolus treatments since it was making my skin real red/purplish, only had two more of those any way.  Well three more regular treatments and the five boost, on the home stretch. Possibly more snow tonight or in the morning.  If the schools close, they will too.  Geish, can it stop now.",
      "MessageIndex": 1071,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 4, 2011 06:27AM walker2222 wrote: Missind rads today, schools closed 4 in of snow on the ground, staying in.  Found out the purple spot under the arm pit was burnt skin that broke open this morning.  Put the silver sulfadiazine on with gauze.  Glad for the break now.  See what Monday brings.",
      "MessageIndex": 1086,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 6, 2011 01:12PM walker2222 wrote: Polyana, sorry forgot to welcome you earler.  I started this week after the first day it will almost seem routine, at least it seemed that way today. Dear all, The American Cancer Socity has a catalog and web site for mastectomy products, bras, cammi's and such.  It is www.tlcdirect.org. I get a monthly email and catalog.  I have ordered from them before.  They maybe pricey but just tossing a bone.  I have a Target almost around the corner (who doesn't these days) and look for som soft cammis. Raincitygirl - amen to the great kind people I have at my rads, my chemo office was awsome too.",
      "MessageIndex": 207,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 6, 2011 02:19PM walker2222 wrote: I have had to be told not to help them move me to get in the right position for the treatment.  Gold star for today for not helping.",
      "MessageIndex": 219,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 9, 2011 08:19AM walker2222 wrote: Had my last regular treatment #25 cancelled today due to weather here in TX again.  So far have missed 4 treatments due to weather.  Well 6 more and I am done, the end is so near.  Was marked with a paint marker yesterday for my boost treatments, it rubbed off from the silver cream  so will have to be remarked again.  Hopefully can bet in tomorrow.  I am so ready for this to be done.",
      "MessageIndex": 1230,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 8, 2011 02:31PM walker2222 wrote: Omaz my biopsy was positive.  The first one they removed had mastested and was stage III on path report.  They took 9 more total of 10 and 4 more showed cancer cells. Glad about the underarm issue I was wondering about that myself.  When the tech marked me the first day, I was marked upper outside of armpit area. Our tumors were similar but mine ended up bigger than they originally thought.  Originally thought it was under 3cm but it was 5.5cm/4.3cm/3.6cm.  A bit larger than an golf ball. Jo1955 Thanks I will be using the Miaderm. I have been using Toms since my chemo treatments and have had no under arm issues.  I got a shaver for women with a bikini gard (does not work great) so I do not use it and use a mirror to guide me.  I understand the hair goes away after radiation per BS nurse.",
      "MessageIndex": 303,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 11, 2011 06:46AM walker2222 wrote: Michcon -  about my 4th treatment my skin was warm and red to the touch.  The aloe helped with the redness and Miaderm helped with the heat. I get these bolus treatments everyother day and seems to make my skin more red as it radiatiates just under the skin.  I am well prepared for those days now. A close friend who finished her rads treatments in December saw RO yesterday and he said he did not need to see her any more.  We have the same RO.  She had a two month head start on this journey.  Hope the same is with me not that I don't like him, but I am at a higher risk % of BC coming back than her, so I maybe different. Paula - Where is Center Valley, KS?  I grew up in Fowler, KS; SW corner near the OK border.",
      "MessageIndex": 348,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 15, 2011 10:25AM walker2222 wrote: Beacher - I deleted my earlier post because it was not beneifical to you.  Do what bher recomends with your PS, I know that is what I would do.  Hugs and prayers to you, you are not alone.",
      "MessageIndex": 1390,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 01:00PM walker2222 wrote: I AM DONE, can I say that again, I AM DONE.  No more photons or electrons being zapped into me.  I brought the techs cookies my DS made for me last night since I was so tired.  Dinner out tonight. Skin is looking a lot better with two weeks on the silver cream.  See the RO next month then adios amigos.",
      "MessageIndex": 1434,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 06:31PM walker2222 wrote: Great news Sue Irr you might need to use some hydrocortisone for the that is what my RO recommend to use. I used the silver cream and the techs commented on how well my skin looked after a week.",
      "MessageIndex": 1447,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 18, 2011 01:56PM walker2222 wrote: Rachel great news Omaz here's to Monday Sue only 5 more Have a great weekend all. Get your rest I know I am.",
      "MessageIndex": 1484,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 18, 2011 12:17PM walker2222 wrote: GuyGirl - congrats Just back from the RO, had a real nice talk feel good about my treatments.  He says things look real good for me.  I told him about the tightness under my arm and said that is expected about now in the 3rd week.  Exercise the arm a lot to stretch it out.  Ask about dose, he said standard for bc is 2gray for the breast area (which is on my chart) and 1.8gray for the lymph-nodes.  This is the same as 180/200 center grate and 2/1.8 rands or something like that.  He gave me a physics explanation for my bolus treatment using playing pool.  Basically when you make the first hit the ball in front stays in place but all the other balls scatter.  So the first ball is your skin and when radiation hits it nothing happens to it but all the molecules under the skin are broken up.  So the bolus or second skin is used to break up the molecules with in the skin.  At least he did not call me sweetness today.",
      "MessageIndex": 572,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 19, 2011 01:25PM walker2222 wrote: Lear - I was told by my RO that due to number of lympnodes and size of tumor is when you have radiation with MX.  Three or more lympnodes and radiation is recomended not for sure about the tumor size.  They thought mine was initially 2 cm, then 3cm and since it was over 3cm mx was recommended and the location, 11:00 position.  Mine was 5.5cm/4.3cm/3.6cm lumpectomy was not an option.",
      "MessageIndex": 599,
      "PostDate": "19/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 20, 2011 08:21AM walker2222 wrote: Sherryc - hang in there, hope you get healing and comfort soon.",
      "MessageIndex": 629,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 3, 2011 09:26AM walker2222 wrote: Start my Rads today at 1:00.  A past survivor gave me some Lady Venus Aloe Vera Pharmaceutical grade gelly.  She got it from a friend in Lubbock, TX.  (I live north of Dallas by the way).  It doesn't go on all wet and gooey and absorbs quickly.  She used it after her treatments and had no skin irritations at all and the Rad onco was amazed. I tried googleing it and came up with some werd stuff.  I will try to find out where she got it.",
      "MessageIndex": 98,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 4, 2011 01:29PM walker2222 wrote: Barbcard so glad it wasn't shingles.   I think I was on and off the table in 3 min. today but I could off.  I think I was at the office 10 min. total today.",
      "MessageIndex": 131,
      "PostDate": "04/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 2, 2011 06:17PM walker2222 wrote: My area around my SNB is purple, I have been wearing a cold pack under my arm all night to give me some relief.",
      "MessageIndex": 1039,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 4, 2011 08:21AM walker2222 wrote: Well taking it real easy today, keeping ointment on.  Lifting my righ arm has been hard as the skin is tight, but keep on doing it as I will have other problems if I don't.",
      "MessageIndex": 1096,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 8, 2011 09:54AM walker2222 wrote: I asked the tech about the creams since they prescribed the silver cream for my burn and she said as long as they could not see it on me I would be fine.  A friend had some soft cosmetic pads that I could put under my arm where my burn was, it felt so good.  I have my Aquaphor to put on after tx with the pad, working hard to keep my skin hydrated, two more regular tx and boost here I come.  I do see the RO today and have him look at my skin, he saw it last week and wanted to if it looked better.",
      "MessageIndex": 1218,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 11, 2011 10:16AM walker2222 wrote: Irr4993 - your boost sound the same as mine, only on the scar area only.  As with Jo,  they put gel looking mat to cover the area and then they move in real close to the area.  Not for sure if it is a electronic boost or not, something to ask today.  I have 4 more left counting today @ 1:10.  Will be so glad to get it over with so I can have my lunch hour back.  Have been real fatigued this week but my skin seems to be healing well with the silver cream.  Was real bad under my arm and outside of the breast area. Got a refund check from the place where I bought my wig and mastectomy bra.  There will be some celebrating this weekend, new outfit sound good.",
      "MessageIndex": 1291,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 24, 2011 10:01AM walker2222 wrote: Hi Lovemylab and marjie - as everyone said this is a great group with lots of information.  It goes real fast, I am halfway through and it seems like I started yesterday. The only restriction my RO put me on was lotions, deodorant and supplements.  Multi vitamins were OK.  After my last treatment Friday, I noticed a real red area under my arm and then how it lined up perfectly into my breast area.  Thought I put lots of aloe on that area.  Seems I might be getting a rash too where they are zapping the lymph nodes.  Need to have the tech check that area.  Other than feeling fatigued when I get home, it seems I have no additional SE.  Which is good as I am getting enough of those taking Femara.",
      "MessageIndex": 741,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Mar 1, 2011 12:59PM walker2222 wrote: Congrats Eloise and Suepen for finishing. Omaz - I am post two weeks and just getting over the fatigue.  My skin is slightly tan now and even looks better under the arm not as dark.",
      "MessageIndex": 1602,
      "PostDate": "01/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 07:39AM walker2222 wrote: No rads today the office closed due to bad weather.  My office closed too which is very rare.  RO office said if the Plano schools are closed tomorrow they will too.  Suppose to be below freezing tomorrow through Thursday. Got some camis yesterday before the storm came through, feel good now since nothing is scratching my skin.  Real red now, got a perscription for silver sulfadianzine cream.  It seems to be helping the chaffing but is messy. Well see what tomorrow brings.",
      "MessageIndex": 960,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 11:25AM walker2222 wrote: Omaz/Rachel - I saw a big change on Friday last week.  Between my Thursday and Friday appointment I started to blister.  I am red now on my breast area and lyphnode area.   Area under my arm pit where SNB was is purple and sore from the arm friction.  The lotion is helping, no more crispyness and bumps.  Overall things have not been to bad.",
      "MessageIndex": 968,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 7, 2011 09:47AM walker2222 wrote: I had so hoped this would be my last week but not.  Gotta add the three I missed last week.  Boy lots of activity this weekend, I was off the board this weekend as my skin was real irritated and burned under the arm.  Put my silver sulfadiazine on twice each day and alternated with aloe vera and Aquifera.  Better today, but still irritated, go to my appt in an hour.  Was glad for the break but would have rather had gone to the tx so I could get this over with. They put markers on me tomorrow for my boost treatments, those should start Thursday.",
      "MessageIndex": 1186,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 9, 2011 11:11AM walker2222 wrote: Well the RO office called after my last post and said they were open and if I wanted to come in today.  You betcha.  Went slow got in had my last regular treatment done.  Ready for boost treatments tomorrow.  ONLY 5 MORE!!!!!",
      "MessageIndex": 1244,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 14, 2011 10:21AM walker2222 wrote: Luvmylab - the total treatment for boost takes less that a min.  The techs bearly walk out the room then they are back in.  My next RO sighting is tomorrow, bring DH with to talk about what next.  I am already on Femara for treatment, no bad SE's yet. End is in sight and I feel like I can start planning something.  Only have one additional surgery but that wont be until May at the earliest.  They are going to take my TE in Left side out, tone up the skin on both sides, no more recon for me.  Cann't handle it.",
      "MessageIndex": 1366,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 20, 2011 03:18PM walker2222 wrote: My last rad was Wed and I am already seeing changes to my skin. It is patchy but the worst part is under my arm. I have been using the silver cream the RO prescribed twice a day. Just two weeks ago it was redish/purple. Now it is starting to look a healthy pink.",
      "MessageIndex": 1520,
      "PostDate": "20/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 21, 2011 02:22PM walker2222 wrote: Omaz Congrats it feel so good when you are done.",
      "MessageIndex": 1535,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 27, 2011 09:17PM - edited Feb 27, 2011 09:17PM by walker2222 Will shout for joy for you tomorrow. I mean today.",
      "MessageIndex": 1584,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 31, 2011 05:57AM walker2222 wrote: Boy took the weekend off and missed out on a lot. The prescription the nurse gave we was for silver sulfadiazine, used for burn patients and wound care.  I have to put it on twice a day.  Interesting fact is I already had some from surgery on my leg that did not heal well.  Seems to be helping, also using hydro-cortisone cream with aloe on the itchy spots alternating with the silver, and the aloe vera with Miaderm on the other areas.  The area next to my SNB area is really bothering me due to the friction with arm, trying to use cold compresses to help.  Expect another cold front to come in tomorrow in the DFW area just in time for Super Bowl festivities.  Hope is does not delay any of my treatments this week as it is my last for regular treatments. Welcome to the new sisters - sorry your here but we will take care of you.",
      "MessageIndex": 936,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 31, 2011 07:29AM walker2222 wrote: marjie - thanks for the offer but I will pass.  I was where you were, my last chemo was Oct 1, 2010, and I understand you not wanting to miss, neither would I.  Will do a happy dance for you on Wednesday.  I will be puting chains on my car so I can make my tx if I have to, only if the office is open.",
      "MessageIndex": 938,
      "PostDate": "31/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 05:00PM walker2222 wrote: Well I am going to miss tomorrows treatment too.  The schools are closed so the RO office is too.  I will have to go to work tomorrow, not looking forward to it.",
      "MessageIndex": 983,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 3, 2011 09:43AM walker2222 wrote: I guess it is normal to go through withdraw when you finish treatments.  I did when I finished Chemo and problably will with rads too.  Looking forward to the end and beyond.",
      "MessageIndex": 1059,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 07:26PM walker2222 wrote: Well sisters I found an area on my back where skin has been affected by radiation. About 5 by 3 in long. Some bumps but mostly tanned.",
      "MessageIndex": 1448,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 17, 2011 05:37AM walker2222 wrote: Omaz the part on my back is a bit larger than my lynphnode area the radidated. The did worn me and I had been looking up to this week. I think it is from my boosts. It is not sore or irritated just mostly tanned. Have my DH put lotion on it for me.",
      "MessageIndex": 1455,
      "PostDate": "17/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 24, 2011 06:35AM walker2222 wrote: I am one week out from boost treatments and the only residual effect from my break down area under my is that it is a bit more tanned than the other areas. You can see where the radiation burned more. I am now putting Palmers coco butter healing cream on it now.",
      "MessageIndex": 1565,
      "PostDate": "24/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/762365",
      "Title": "January 2011 Rads suzieq60 msjag"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 15, 2011 11:30AM walker2222 wrote: Our lives are filled with uncertainties, I also had good friend pass away right before Christmas.  He thought it was just a cold, he passed away in his sleep two days later. My sister gave me a healing Angel and here is her prayer as I am praying for all my BC sisters: Let the Lord stand near you as you call upon Him, and may He deliver you from sickness and restore your health. amen Sandee - I like what you say about 6 more.  That is what it takes.",
      "MessageIndex": 117,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 14, 2011 04:25PM walker2222 wrote: Faithful - your right we need to shout it out.  CURED.",
      "MessageIndex": 108,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 14, 2011 01:26PM walker2222 wrote: Look forward not back, pray for a cure for those who come after us.  I am not going to worry about my future, just take it one day at a time.  Hope those darn hot flashes, power surges ets do not keep you up at night.  There are many women like mmm5 step mom and her who are approching their 20 years and beyond.  Be an advocate for annual exams and mamos. Right now I am just managing to get through my treatments, 2 wks of rad done 4 wks to go, yeah. ",
      "MessageIndex": 104,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 14, 2011 11:37PM walker2222 wrote: allalone - even if I did not have my DH I would still try to keep a positive perspective on my daily walk with BC.  I find peace in talking with my fellow BC sisters.  I have great support group at church who pray for me daily and tell me how I have inspired them on how I am dealing with BC.  I do have my down times, like crying in the show and let it wash away, having a meltdown because my recon has not gone as exptected.  I want you to know that YOU are not alone we are here with you.  I cannot deal with % anymore, as my RO told me I had 55% chance of BC coming back.  I am surviving one day at a time. Hugs to you and hope you have a great weekend",
      "MessageIndex": 111,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 13, 2011 12:51PM walker2222 wrote: Life is full of uncertainties.  I call myself a BC survivor and will until the day I die.  I walked the Susan G 2 weeks after my last chemo.  I have a pic standing under the under 1 year survivor sign bald head and all.  The 40+ year survivors were way down the road on the survivor walk.  My RO has told me I am at a high risk of returning, 55%, due to size of tumor and lymph nodes affected.  I am not going to let that worry me.  I have my faith, loving DH and DS, strong support group at church, friends who are walking the walk with me and you all.  That is what gets me though day after day.  I have been told I inspire people because of the way I have handled myself, (they haven't seen me cry in the shower, or my one or two meltdowns), but I am glad.  I just want to be an advocate of yearly check ups and mamos, if I help one other person get through this that is my reward.  My DH had a co worker who had learned of my BC, all he said was make sure you get your check ups.  She did in December and they found a tumor and she is scheduled for surgery and treatments.  I expect to see my DS graduate, got to college, marry and have children.  All I can say is Live, Laugh, Love. Jessie",
      "MessageIndex": 74,
      "PostDate": "13/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/763208",
      "Title": "Never hearing the word Cured!!!! faithfulheart jennifer1"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 20, 2011 08:43AM walker2222 wrote: Well I did went topless this morning.  Asked my DH how I looked, he said beautiful.  Put some danglely ear rings on, and make up (usually go without).  So far everyone at work is giving me the thumbs up.  I did almost wiggout this morning, no pun intended.  Still not for sure about the color, grey is not my color as I am only 48.  We'll see.  The pic. on my profile is pre chemo.  I'll do a self portrait and see what you all think.",
      "MessageIndex": 7455,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 20, 2011 09:31PM walker2222 wrote: Well changed my pic with my new look.  Some people say I look sheik (sp), some like the pixie look.  My DH says I look beautiful.",
      "MessageIndex": 7467,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 21, 2011 08:15AM walker2222 wrote: westimom - no I have not had a hair cut yet, still contemplating coloring.  I am going this weekend and have her shave the neck hair that is sticking out.",
      "MessageIndex": 7472,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 21, 2011 11:39AM walker2222 wrote: Nikola - we had our last cemo about the same time, you look awsome.  Love the color, except for it being cold, I am enjoying being without the wig.  Not sure about my color yet, so used to the red in the wig.",
      "MessageIndex": 7480,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 27, 2011 11:47AM walker2222 wrote: Kitty - you will look great either way, you have such a beautyful face. I am still getting positive vibes with my hair.  They love both the length and the color, all natural baby. Had a random lady stop me at my RO's office and told me I had great hair, said she should know since she was a hair dresser.  That was a boost.",
      "MessageIndex": 7612,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 18, 2011 03:25PM walker2222 wrote: Ovation.com - from what I understand it promotes good hair growth, from brittle dry hair and quick growth.  It does not promote new growth where hair loss is aparent.  From what I understand it was first brought out to help cancer patients with hair growth.  It is advertized on the radio a lot down here.",
      "MessageIndex": 7424,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 24, 2011 01:14PM walker2222 wrote: Dominika - I love your short hair too.  I know it took me a long time to go without my wig but everyone I see since I went wiggless, loves the new me. emme - hang in there too. nodapearl - how long did you wait until after your EM surgery did you finish reconstruction?  You can PM me with your reply. ",
      "MessageIndex": 7547,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 21, 2011 09:48PM walker2222 wrote: Had my first hair trim to even out the rough spots. She couldn't believe how thick it was. I thought it felt thin. We talked about Jamie Lee Curtis and Judy Dench hair styles. She charged me for a man's cut. I also have thyroid problems and have loss enough hair from that. So far no hormonal blocker hair loss. Thick hair runs in my family (for the women at least) the boys have mo hope.",
      "MessageIndex": 7921,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 18, 2011 01:33PM walker2222 wrote: This is my first post here, but I felt like a chia pet between Halloween and Christmas.  When I went to the in laws at Thanksgiving, my DH step mom said to make myself comfortable and I did.  It was just growing in and very soft and downy.  I had just had surgery so I was not back at work at that time.  Since August I had been wearing hats and scarves since my wig was making my head scratchy and hot.  When I went back to work I was not brave enough to go without my wig so I am still wearing it.  I guess I am waiting for it to get to that just so length.  It is coming in grayish brown and I am self consciouses about that.  A friend at work said she would get the Paul Mitchell out and spritz it up for me.  I am now considering that since the wig is slipping and I have to keep adjusting. I have not read all the posts but has anyone thought about the ovation products?  Just wondering.",
      "MessageIndex": 7418,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 28, 2011 12:37PM walker2222 wrote: Carol - the last two rounds of chemo, I lost all my eye brows and most of my lashes.  My last chemo was Oct 1st.  I now have bushy eye brows and lashes are shorter and thiner than before but looks to be coming back now.",
      "MessageIndex": 7634,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 21, 2011 09:53PM walker2222 wrote: Libraylil had to be rescaned too, due to unexpected surgery. The did not have to re tat. Hope you do not have to.",
      "MessageIndex": 229,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Dec 31, 2010 10:25PM walker2222 wrote: Thanks for the feed back, I have contacted Timtam but we have a major filter on our computer that will let me log on but not access the site.  I have been very interested in getting this done.  My PS is kind and considerate but I think puts a lot into physical appearances. Probably most PS do.  I have to wait two weeks to see him and week and half to talk with BS.  But over all I am at peace with my decision, now waiting to talk about the plan.",
      "MessageIndex": 69,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 04:03PM walker2222 wrote: I AM DONE, can I say that again, I AM DONE.  No more photons or electrons being zapped into me.  I brought the techs cookies my DS made for me last night since I was so tired.  Dinner out tonight. Skin is looking a lot better with two weeks on the silver cream.  See the RO next month then adios amigos.",
      "MessageIndex": 159,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 18, 2011 04:52PM walker2222 wrote: Beacher - how is it going today did you get to talk to the Drs yet. Really really tired today, dr said it would take a couple of weeks before the affects wear off. Here's to a great weekend.",
      "MessageIndex": 211,
      "PostDate": "18/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 22, 2011 04:44PM walker2222 wrote: They do the xrays for positioning not for diagnostics.",
      "MessageIndex": 234,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 08:02PM walker2222 wrote: I am here too, on my fith week, (missing two due to bad weather closings).  As with grannydukes you can ask questions.",
      "MessageIndex": 3,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 4, 2011 11:53AM walker2222 wrote: Twozzs - I have worked through my treatments and what I do is go in early about 7am and leave at 3:30.  Go home and rest then pickup DS from HS.  Since you have an understanding supervisior, if need a day off to requp, I say do it.  I have taken a break from rads due to the weather which is nice since my skin has blistered under the arm.  Have three more regular tx and 5 boost, keeping the ointment on. Like it has aready been said, drink lots of water and keep ointment on your skin.  Aloe vera, Miaderm or whatever your RO recommends.",
      "MessageIndex": 27,
      "PostDate": "04/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 9, 2011 02:06PM walker2222 wrote: Well I made it to my last regular tx.  Went slow and got there in 35 min usally takes 20.  Not bad glad to get that part over with at least.",
      "MessageIndex": 102,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 8, 2011 05:18PM walker2222 wrote: dmorgan2 your are right I am not doing reconstruction not or later.",
      "MessageIndex": 48,
      "PostDate": "08/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/761077",
      "Title": "OK, I did it. Called the PS office and said, no thanks Annie62 walker2222"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Jan 7, 2011 06:27PM walker2222 wrote: I comend you all for your decision for no recon, of course it is a personal decision that only you can make yourself.  I chose to do recon and now regret it.  I had an infection after surgery and had TE taken out of tumor side, tried again and failed.  Next week I talk with both my BS and PS about my decision of no more recon and to take the left TE out.  I had my surgery in May of 2010 and needed both chemo and radiation treatments.  Finished chemo last year and starting rads just this week.  I feel like a weight has been lifted from my shoulder with this decision.  I guess my next step after rads is schedule the deconstruction.  My DH is behind me 100% and would have had me without it from the beginning.  I almost feel liberated.  No bras just cami if you want",
      "MessageIndex": 46,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/761077",
      "Title": "OK, I did it. Called the PS office and said, no thanks Annie62 walker2222"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 1, 2011 08:27PM walker2222 wrote:",
      "MessageIndex": 5,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 05:23PM walker2222 wrote: The rash is a part of TX just means you skin is changing. Keep a close eye on for minor bumps that could lead to blisters. The redness on the collar bone is due to them radiating the lymph nodes since you had positive involvement.",
      "MessageIndex": 161,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Dec 31, 2010 02:28AM walker2222 wrote: I guess this is my diary of sorts. I have decided to draw the line, I had my BMX with recon on May 11 2010.  Everything was great until I got an infection on the tumor side.  Left side no issues TE still in today uncomfortable at times. Took the right expander out had my chemo since my tumor was 5.5 cm and 5/10 had cancer 1 of the 5 metastasized next to tumor.  Last chemo Oct 1st yea, was scheduled to try to redo the TE in right side before Rads, Nov 9th was very uncomfortable during Thanksgiving. Returned to work on Nov 30th and found seepage on incision call PS got in found I had cellulitist and incision not healing.  On Dec 9th found a whole in the skin got bigger and had to take TE out again.  Start Rads on Monday so happy to get that started after lingthly delay.  Talk to BS on 1/12 about deconstruction and what to expect.  Talk to PS on 1/14 to give him my decision.  I plan on talking out TE on left side and smoothing out skin, whatever it takes.  Please Please do extensive research prior to your surgery.  I have problems with circulation and I know that was a contributing factor to my rejection of TE and I am not doing an LD Flap even though there are good success stories out there.  I know my PS will not be please with my decision since he has worked so hard on my recon.  What is important is your health and quality of life.  I thought it was a process, diagnosis, see Breast Surgeon (BS) about options (she felt I was a good candidate of BMX with recon) get tests done, had 2nd MRI with biopsy on left side due to some concerns, See PS.  Had surgery, did not see Onco until after surgery to remove first TE. Did not talk to the radiation onco until after my 2nd surgery decision  etc, my story is not positive or successful right now since I am still in the middle of it but it will work out in the end.  I work through most of this as well.  I have kept positive though it all (except this last surgery), and sometimes you have to go though pain to see your strength.  Trust God, listen to your DH (husband) and listen to your instincts.  Take lots of notes and research.  I did not do enough and I am working through it. You can let cancer be your curse or a blessing.  I choose blessing because it has made me stronger in my relationships with my savior, my family and my friends and made some awesome new friends that have gone on this journey before me.  Onward and upward.  God Bless all of you and sending positive vibes to each and everyone of you who are just starting your journey.",
      "MessageIndex": 66,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "May 5, 2011 07:10PM walker2222 wrote: Survivor - have qtips, 4x4 gauses and safety pins. I got post surgical cammies from the TLC web sit the American Cancer Society puts out. For my surgeries the hospital put on me stretchy/Velcro top that I was able to attach the drains with the pins on. Also, if you are able to take showers, get string to tie to the drains to and tie around your neck. PM me if you have further questions.",
      "MessageIndex": 78,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 2, 2011 06:47PM walker2222 wrote: Well due to bad weather my 5th week of rads has been extended.  I got in Monday and will be missing three days this week.  Hopefully Friday I will get in.  They were suppose to do scans for my boost treatments next week and give me more markers.  I guess I do not get my Valentines gift of no more rads.  Well at least my skin will have a break.  Saw a big change from the fourth week to the fifth week.  All I can say girls is keep the aloe vera/Miaderm or what ever you RO recommends on multiple times each day but not at least 2 hours before your treatment.",
      "MessageIndex": 14,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 16, 2011 11:32PM walker2222 wrote: Beacher I so wish I could help you. Would it help if your PS and RO put there heads together to come up with a solution. Sounds like you need a break from rads, I know they can allow it for a short time.",
      "MessageIndex": 174,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 21, 2011 11:16AM walker2222 wrote: Hope everyone had a good weekend. Keep lotioned up. Since I finished last Wed. I am really starting see the skin healing. I am still using the silver cream the dr prescribed. See him next month for the last time. Starting to fell good that I can have my surgery in May to take care of my recon issues.",
      "MessageIndex": 223,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 25, 2011 04:06PM walker2222 wrote: I am now 10 days post treatments and my skin is looking very good.  My major changes were between my 4th and 5th week where I saw all the red/purple burning.  RO gave me prescription of silver sulfadiazine to put on twice a day and I saw a marked improvement in the 6th week during my boost treatments.  Right now I shower with Dove moisturizing body wash and put Palmers cocoa butter formula with vitamin E three times a day.  It still looks tanned in some areas but is nice and smooth. Hope you all have a good weekend.",
      "MessageIndex": 268,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 3, 2011 05:20PM walker2222 wrote: Did get in today and back to work with out troubles, took two hours though.  Most of it was on the road.  The RO stopped my bolus treatments (it is for mastectomy patients and radiates only the skin area) since it was making my skin real red/purplish, only had two more of those any way.  Well three more regular treatments and the five boost, on the home stretch.  RO said to use the silver sulfadiazine cream they perscibed on the bad areas.  Asked the tech if I could put it on before the treatment, she said yes but only if she cann't see it.  So at least two hours before should be fine. Possibly more snow tonight or in the morning.  If the schools close, they will too.  Geish, can it stop now.",
      "MessageIndex": 24,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 9, 2011 11:27AM walker2222 wrote: Well I thought the RO office would be closed today, but they just called and said they were in.  I have already missed 3 due to the weather and I only have 6 to go so I want to get this done.  I'll try it but go real slow.",
      "MessageIndex": 96,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Feb 11, 2011 01:23PM walker2222 wrote: Well I am on the home strech, have my 4th of my 5 boost today. For the new girls, all I can say is keep the lotion on after tx to keep your skin hydrated.  I thought I did but got bad rad burn under my arm.  The silver cream the dr perscribed is working real weel.  Will be so glad to have my lunch hour back.  Like Rachel said, it is the drive everyday that can wear you out, but it will be worth it in the end, right?  Keep telling myself that everyday.",
      "MessageIndex": 123,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/764239",
      "Title": "February 2011 Rads ToriGirl Elisimo"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "May 9, 2011 01:08AM walker2222 wrote: Slight pain but big relief after. Take a deep breath right before they take it out.",
      "MessageIndex": 82,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/695426",
      "Title": "Diary of a bilateral mastectomy twinkly pinkvictory"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Dec 28, 2010 01:41PM walker2222 wrote: Dear HairSprayMom and others How long did it take you deconstruction surgery and recovery.  I have had two expander's on my right side removed and the last was taken out due to incision not healing and a whole in the skin that exposed the expander.  I did have a bilateral mastectomy and the left side has had no problems but still has the expander in.  I am not considering anymore reconstruction on the right side and want the expander out now on my left to be fully flat.  When they took out the last expander it was an outpatient surgery and recovery was a few days until I felt up to going to work.  So basically it was from Tuesday (surgery day) to Monday (return to work).  I did see the PS on the Monday I returned to work and he took out the two drains I had in.  I see him on the 19th to tell him about my decision but was getting an idea of what your deconstruction time/recovery took?  I am anticipating my time off work.  I still have radiation on my right side to start so I am thinking I will not be ready until mid May.  Do they tighten the skin or keep it a little loose?  Poking for information.  I have just made this decision after lengthy conversation with PH.  He has been so great, he just wants me healthy and happy, love him to bits. My deconstruction may fall around the 1st anniversary of my mastectomy on May 11th.",
      "MessageIndex": 39,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/761977",
      "Title": "Deconstructed and Happy about it! HairSprayMom mlp730"
    },
    {
      "AuthorID": "walker2222",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/116515/profile",
      "Content": "Dec 30, 2010 11:44AM walker2222 wrote: Thanks HairSprayMom for your story and encouragement.  Had my 3 month L Dex check up with Nurse Debbie and all good no signs of limphadema appearing.  Explained my situation since last  saw her and she completely understands.  She is a breast cancer survivor (lumpectomy) but has seen it all.  She said just think of your health and quality of life.  Upward and onward no looking back.",
      "MessageIndex": 43,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/761977",
      "Title": "Deconstructed and Happy about it! HairSprayMom mlp730"
    }
  ]
}