{
  "AuthorID": "Wanderingne…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
  "Posts": [
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 10, 2019 02:46AM Wanderingneedle wrote: Amarantha, I take l-glutamine to help with neuropathy. It’s an amino acid already in your body so I don’t think it will interfere with any of your treatments. Athletes use it for muscle recovery after workouts. I asked my doctor and he had no problem with it. Antioxidants he won’t allow me to take.",
      "MessageIndex": 2333,
      "PostDate": "10/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 11, 2019 04:27AM Wanderingneedle wrote: Sarah, does your insurance cover neulasta or something like it? I have Nivestym shots for three days following Halaven. It’s a CSF - colony stimulating factor. It’s keeping my numbers well within the normal range. Maybe you can ask your doctor if there’s something that would help",
      "MessageIndex": 2341,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 21, 2019 05:41PM Wanderingneedle wrote: Take the shot! Take the shot! As much as I hate the way they make me feel I’m glad I don’t miss any treatments. My absolute neutrophils last week were 4.8 and WBC was 7.1but my tumor markers were up after being down last month. 😕 I hope it doesn’t mean another progression for me. I’m frustrated that treatments don’t work for long.",
      "MessageIndex": 2346,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 14, 2019 12:44AM Wanderingneedle wrote: Scan results are in - size and SUV decreased on main tumor. Only one lymph node lit up and it also showed decreased size and SUV. The lesion on my pelvis still shows up but said it can’t be assessed on current exam. Had uptake throughout the bone marrow from the CSF shots I get. This is the smallest the tumor has been since I started treatment in January last year. I’m hoping the Halaven continues to work.",
      "MessageIndex": 2366,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 14, 2019 06:50AM Wanderingneedle wrote: Sarah, I’ve finished 4 cycles. I can’t believe how fast it worked for me. My other treatments worked well until suddenly they didn’t so I’m hoping these results stick for a while. I also get zometa and faslodex, and the shots I take for white blood cells cause pain for a few days but they let me keep going and I have lots to do. I watch my two granddaughters after school and my disabled son lives with us and my husband still works full time so the fun never ends at our house. Good luck with your time in the chair tomorrow. I know it sucks but it keeps you going. Are you able to get your blood test results before you go? All my blood test results are online so if there’s enough time before I get chemo I can see my results and can ask questions. The same with scans. I like to know what’s going on.",
      "MessageIndex": 2368,
      "PostDate": "14/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Jun 2, 2019 03:02PM Wanderingneedle wrote: How frustrating! I hope the rest of your time there has been educational. That looks like a really big conference. Is this your week without a treatment? What a way to spend your good days",
      "MessageIndex": 2397,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "10 hours ago Wanderingneedle wrote: Pooh on them for not helping you but hope you get sent some good info. I’ve seen a few pics and it’s a really huge conference! I don’t know how you don’t get lost! Do your feet hurt? My neuropathy has increased over the last two cycles. 😕 It will be interesting to hear how you do with two weeks off - side effects, mood, sleep, etc. And fun activities! The Piqray is on my list to ask my MO about. I’ll be staying on the faslodex after Halaven but he mentioned an AI also but not which one so maybe this will be somewhere in the mix. My SE’s after chemo/shots are extending into more days so would like to get that addressed. Now that school is out I really need my energy! 😂 Have a great time at your reunion! ",
      "MessageIndex": 2399,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 8, 2019 11:51AM Wanderingneedle wrote: Does anyone take something to build white blood cells? I’m on Leukine which is a shot for three days after chemo. The bone pain from the first set of shots was intense. I’m also taking l-glutamine for neuropathy along with the cold socks. I can feel that my tumor has started to shrink but I think it’s from the faslodex since I started it a month ago and I ohad my second dose of Halaven yesterday. Lulubee and KPW so sorry to hear about your progression. I understand that feeling of disappointment and moving on to a possibly harsher and more unforgiving treatment. I hope you both do well and get a good stretch of time from the new meds. 🤗 Hugs to you both.",
      "MessageIndex": 2306,
      "PostDate": "08/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 21, 2019 08:56AM Wanderingneedle wrote: I started my second cycle today. I’ve been noticing extra hairs in my sink so I don’t think I’ll be keeping all of my hair. I lost most of it on the last treatment (abraxane) and have been keeping it close to the skin and wearing a wig. I had a month between treatments and it started to grow back - the dark stuff, not the gray - but wouldn’t you know that’s what’s falling out? LOL! I’m going to see if I keep enough to wear it short without it looking scraggly before I shave it off again. It’s about 1/2 inch and my granddaughter likes to rub it.",
      "MessageIndex": 2315,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 23, 2019 04:34PM Wanderingneedle wrote: I’m shedding again. It doesn’t happen with every cycle and it’s not a lot but my sink looks like I’ve been shaving. My blood test on my week off is so normal! It’s amazing the changes with chemo happen so quickly. I hope everyone has a great day today! Dentist appointment and nivestym shot coming up and grandkids after school!",
      "MessageIndex": 2384,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 24, 2019 02:26AM Wanderingneedle wrote: Jaylea, I’ve seen you on the Ibrance and bone mets threads and was surprised by your esophageal met and how quickly it all happened. I still follow the Ibrance thread even though I haven’t been on it since September. There is a lot of info on that thread! It only lasted 7 cycles and then I went to abraxane until January and it quit. On to doxil and a bad reaction so then to Halaven and finally something that works! Nothing else has shrunk my tumor as much as this. I’m also on faslodex and my MO wants to pair it with an AI after the Halaven, hopefully after a few more cycles. I hope you get a good response from it and able to move to a hormonal. I understand about burning through treatments- this is my 4th in less than 18 months. Hoping the next one lasts longer!",
      "MessageIndex": 2388,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Feb 22, 2019 04:26PM Wanderingneedle wrote: Lulubee, thanks for that. My nurses are usually busy so it takes a few minutes from the time I sit down before they come over to hook up my port and then waiting for the meds. I’m having blood drawn this next appointment so that will give me an extra few minutes. They don’t request the meds from the pharmacy until I’m in the chair. I was hoping to avoid the cold socks because it’s cold out and the chemo room is cold.",
      "MessageIndex": 2296,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Feb 27, 2019 12:48PM Wanderingneedle wrote: I have a question - I put everything on calendar so anyone can see what’s going on. In the info they gave me on Halaven it’s says the nadir is approximately 13 days. Is that 13 days from the first infusion or second one in a cycle? I put this on the calendar so we can plan around activities. I also have to do leukine shots for three days after and I get blood drawn two days before so I’m in that office 5 days a week when when I have those infusions.",
      "MessageIndex": 2298,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Feb 27, 2019 03:33PM Wanderingneedle wrote: Pajim, my nurse gives me a printout from chemocare.com for each treatment I’ve been on. It’s not all-inclusive so I look in other places but haven’t found anything yet. Ibuprofen is a blood thinner and it’s avoided with lots of meds, almost everything I’ve had except Ibrance. An occasional dose will probably be okay but I liked using it daily. I had my first dose today and will have to try to track my se’s and figure out what comes from zometa, faslodex and Halaven. I watch my one granddaughter after school every day and my disabled son lives with us and his wife is divorcing him and we have both granddaughters every other weekend. My husband still works and drives 1 1/2 hours each way and he helps where he can but time is sure in short supply! Being able to plan around low days would help a lot. My vitamins have things like green tea extract and blueberry extract and high dose vitamins A and C and others. The doctor didn’t approve with the abraxane so I’ll have to ask about the Halaven since I can’t find anything. I don’t know anything about giving shots but I’m a good patient",
      "MessageIndex": 2301,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 21, 2019 12:07PM Wanderingneedle wrote: Amarantha, not the last treatment! What a bummer! I do get tired of wearing my wig sometimes but it keeps people from staring. I like to stay under the radar. I take my granddaughters to school and kids stare. It helps me be less noticeable. The girls were curious in the beginning but now it’s no big deal. The youngest likes to rub my head. My cancer clinic is small and doesn’t offer the cold caps. I take my own cold socks to help prevent neuropathy. I hope you have a long time with the Xeloda and many years of no side effects!",
      "MessageIndex": 2317,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 30, 2019 04:00PM Wanderingneedle wrote: Hopefully a weekend of rest will take care of it! A day off of work is always in order!",
      "MessageIndex": 2321,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 3, 2019 01:08PM Wanderingneedle wrote: Hi, Sarah, Hope you get a good response! I have only had two cycles but my tumor has shrunk more than on any other treatment. Abraxane didn’t do anything but make my hair fall out. My tumor marker CA 15-3 has dropped to its lowest ever. I use cold socks for neuropathy and also take l-glutamine. I have a little nausea but nothing bad. I take Nivestym shots for three days after treatments. It’s a colony stimulating factor for white blood cells. If I didn’t have to go back for shots I wouldn’t mind the treatment as much. Always remember to eat well when you can and take vitamins and drink lots of water.",
      "MessageIndex": 2323,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 6, 2019 02:19AM Wanderingneedle wrote: I get my steroids as a push with anti nausea meds. I hardly sleep that night and wired for half the next day!",
      "MessageIndex": 2329,
      "PostDate": "06/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 22, 2019 09:18PM Wanderingneedle wrote: I will get more blood test results this week. On my order from the doctor they weren’t supposed to do a full panel last week only CBC so everything will be done again today. I’m looking forward to seeing if there is another spike - or drop - in tumor markers. I may even have the results before I see my MO on Thursday.",
      "MessageIndex": 2351,
      "PostDate": "22/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 25, 2019 05:52AM Wanderingneedle wrote: Pajim, I’ll get the results in the morning - they’ll be online then. Today I turned 57 and had such a busy day I’m so glad it’s my off week! I was determined to have no appointments today! Sarah, I get nivestym shots for 3 days after chemo and they make my bones hurt but it means your body is making lots of white blood cells! They gave me hydrocodone but during the day I take ibuprofen and power through it with the grandkids here and sleep with the hydrocodone. The second week is worse than the first. After a few treatments you’ll get the feel of what causes which side effect and can treat them effectively.",
      "MessageIndex": 2355,
      "PostDate": "25/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 9, 2019 02:06PM Wanderingneedle wrote: I’m up early to have coffee before my 24-hour pre-scan. ☕️ I told my son it’s for his protection. I’m already wired from the steroids they give me with the Halaven. 😜 I like the 6 am check-in for scans so I’m in and out. People are usually focused for the first appointment of the day and not behind. I’ve had two instances of shedding since I started the Halaven in February but not enough to keep wearing a wig. I had shaved my head to make my wig fit better when on abraxane so it’s short but I’ve had short curly hair for most of my life only growing it longer in my 30’s. I don’t mind because not many people recognize me when I go out and that’s fine. I prefer to remain anonymous! Let’s me do what I need to do! I hope your stomach feels better today, skitzblitz - figuring out which treatment causes which side effect can be tiresome, and then figuring out what to do about it! Pajim, I hope you’re having a good time at your conference! I haven’t had mouth sores but some tender spots on my gums. I’m prone to fever blisters and have had 2 of those in a month. Do you have the magic mouthwash? I heard it works. Coffee is done, off to start my day. I love taking my granddaughters to school and having the youngest one after school. They are my delight. Have a good day everyone!",
      "MessageIndex": 2365,
      "PostDate": "09/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 15, 2019 02:19AM Wanderingneedle wrote: pajim, if you are comfortable with your scan schedule then you don’t need one more often. My MO is conservative preferring to go at least 6 months between scans. Because my tumor has been shrinking I asked for one so I could see if the mets were responding. I know some people go a year between scans because they’re stable and there’s nothing to see.",
      "MessageIndex": 2372,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 24, 2019 08:52PM Wanderingneedle wrote: NouzayO, I get Colony-Stimulating-Factor shots (csf) for three days following Halaven. I get nivestym, previously was on leukine, and they are similar to neulasta. It really helps me keep my counts up and keeps me going. I don’t like being at the onco clinic 4 days a week but it works.",
      "MessageIndex": 2390,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Feb 22, 2019 12:14AM Wanderingneedle wrote: Hello! I start Halaven next week since I failed on abraxane and reacted badly to doxil. Has anyone tried the cold socks/mitts for neuropathy and did it work? I used it for abraxane and didn’t get neuropathy until the 4th cycle but the study I read only mentioned Taxol. Since Halaven is such a short infusion I’m wondering if the cold socks will even affect it? I’m just trying to keep as much of myself intact for as long as possible. Thanks.",
      "MessageIndex": 2291,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Feb 27, 2019 01:14PM Wanderingneedle wrote: Stinky feet? I have competition in this house! Can’t wait for summer! I knit and crochet and bake so hoping to keep the feelings up and the tingling down. A friend on Twitter said her oncology nurse recommended l-glutamine so I’m trying that too. It’s an amino acid so doesn’t interfere. I couldn’t find any information about antioxidants with Halaven. I couldn’t take my good vitamins with abraxane and had to eat gummy vitamins. Has anyone had to avoid something because it interacts with the Halaven? I couldn’t find anything except ibuprofen but actual experience tells a lot",
      "MessageIndex": 2299,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 11, 2019 01:58AM Wanderingneedle wrote: Liwi, that’s interesting. My doctor won’t let me take any antioxidants because they interfere with the process of chemo. No green tea, no vitamins with antioxidant ingredients. Pajim, I don’t think my numbers are that low and they started me on this at the same time I started Halaven. Maybe it’s preventative to keep me able to stay chemo. He knows there’s a lot going on in my household and that I have to keep going. My tumor grows quickly (it’s big enough to see) when the meds stop working so we don’t want to stop it for something like low blood cell counts! MO said it’s the Halaven working because faslodex usually takes 6-8 weeks to show a difference. I’m hoping my achiness goes away during this week off. Don’t know which pain belongs to which medication but I would sure love for them all to go away. Good for you and tumor markers falling. That’s always a good feeling when the numbers go in the right direction!",
      "MessageIndex": 2309,
      "PostDate": "11/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Mar 30, 2019 06:04AM Wanderingneedle wrote: Sorry you caught a cold! Spring is just starting - could it be allergies? I finished my 2nd cycle Wednesday. Just starting to feel a little nauseous today. I had a bad reaction last week to the leukine shots so they switched me Nivestym and I’m hoping these don’t cause any problems. I have too much to do! I don’t think my side effects from Halaven have been too bad but it’s hard to tell with the problems I had with the shots. Granddaughters are at our house this weekend so hope I get through it okay.",
      "MessageIndex": 2319,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 11, 2019 01:39AM Wanderingneedle wrote: Sarah, I will continue to use the l-glutamine. Halaven is my 4th line since January of last year and nothing else has shrunk my tumor this much - in only 2 cycles no less - than this treatment. I started them both at the same time in February.",
      "MessageIndex": 2339,
      "PostDate": "11/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Apr 22, 2019 03:20PM Wanderingneedle wrote: Hi, Mark, Congrats to your sister for a great 6-year run! How wonderful you’ve been her caregiver A diet with plenty of fiber is helpful as well as lots of water. With summer coming a lot of in-season fruits and veggies will be easy to find and they are easier to eat when they taste good. Miralax is a stool softener, not a stimulant laxative and can be used often. Activity is also helpful. Good luck!",
      "MessageIndex": 2349,
      "PostDate": "22/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 2, 2019 01:43AM Wanderingneedle wrote: Thank you for the birthday wishes, pajim! I hope I get many more, too! Too many with this disease don’t get enough! And about all I drink is water! Lots of it! Oh what a long week! I forgot to post my blood test results. After having my granddaughter spend her spring break with me and my aunt and uncle coming in on the day she left, I was a bit tired. They left on Sunday. My WBC were 10.4 - almost high. Absolute neutrophils were high - 7.3 - but not much. The doctor didn’t mention it. Tumor markers were up - 35.5 vs 33 last week (they’ve never moved moved much but when they’re higher my current med has stopped working). Doctor said he didn’t know why they’re up but he thinks my tumor has shrunk more so I’m having a PET/CT scan next week. Another marker that went up but is still in the normal range - LDH. It went from 146 last month (that’s about where it’s been since I started) to 175 last week to 216. Don’t know what to think. I’ll wait for scan results and see what it shows. I’m hoping for a scan with no mets showing! ",
      "MessageIndex": 2361,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 22, 2019 04:53AM Wanderingneedle wrote: Hi, Sarah, Glad you made it through another round! I start round 5 tomorrow. I also still have my original tumor and on the scan the edges were “ill-defined” and the doctor said the SUV was almost low enough to be in the normal range and not even need to be reported. I’m talking with a surgeon next month to discuss surgery. My oncologist has said it’s unnecessary since it’s spread but the original tumor has always been an issue for me. Every progression it has grown larger and more painful and then the medicine shrinks it until it quits working but it has never gone away. I want to see if cutting out would keep it from seeding new mets. I may or not go through with surgery but I at least want to feel sure about the decision. I’m really sorry about your uncle. It’s hard enough to do this yourself but to watch someone so close go through it at the same time has to extremely difficult. And hiding it from your grandma! I wish you the best, Sarah, with this conundrum! I went to Disneyland yesterday and I’m exhausted today. Hard to get moving!",
      "MessageIndex": 2376,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "May 28, 2019 12:30AM Wanderingneedle wrote: I have some mints I bought in the dental care section - they have xylitol and help with the dry mouth. I have mints in my car, my purse, my knitting bag and my sewing room and take a water bottle with me in the car and drink water all day. 💦 I think the water would be harder if I was working but the mints are easy. Soak up all that info at ASCO and enjoy yourself",
      "MessageIndex": 2395,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "3 hours ago Wanderingneedle wrote: Please be careful! You can really get hurt from a fall! My feet are starting to tingle and feel like they’re falling asleep. I’m constantly wiggling my toes to try to wake them up even though I know it won’t work. My legs and now my arms feel numb on the outside like when you get really cold. They don’t hurt but I don’t like the numbness. It all came on during my previous cycle and this last one I’ve felt awful. I see my MO on Wednesday and I hope to hear some changes in my treatment plan, either starting something else or maybe asking for a break. I wouldn’t mind just skipping the next cycle! I hope your break gives you some relief and you’re able to enjoy yourself.",
      "MessageIndex": 2401,
      "PostDate": "04/06/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/762000",
      "Title": "Halaven - Day 1 PJB Wanderingneedle"
    },
    {
      "AuthorID": "Wanderingne…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/269982/profile",
      "Content": "Nov 23, 2018 01:29AM Wanderingneedle wrote: illimae, it must be the perfect place for a hike since the bear had the same idea! I haven’t spent time in west Texas besides driving through to get to East Texas but that is some beautiful country! Philly, any movement counts and a massage helps you keep your muscles ready to use when you can so you can be ready for that next workout! Katy, Canyonlands looks wonderful. I am a fan of mountains and wide open spaces! I go to a yoga class because I can find all kinds of things to do at home besides exercise. With chemotherapy I try to be active on my good days and look forward to one day getting off this treatment and having some sense of normalcy.",
      "MessageIndex": 2000,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/851580",
      "Title": "Stage V MBC Fitness zarovka FuzzySocks"
    }
  ]
}