{
  "AuthorID": "waynab",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
  "Posts": [
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Apr 7, 2009 02:36PM waynab wrote: Just got results - micro-calcs were benign!  Now I can begin to breathe again.  Thanks to all for the support and prayers.  Please know that you are all in mine.  Wayna",
      "MessageIndex": 8,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Apr 7, 2009 08:05PM waynab wrote: Thanks Prescottlady - I'm glad your biopsy was easy too.  I never really was sore.  I do have about a three inch incision on the side of my breast but no pain.  Please know positive thoughts are sent your way and my prayers are with you - the waiting is just awful!  FYI - I'll be out of town and not have access to a computer until Monday evening, but I'll be checking to see what your results are.  Waynab",
      "MessageIndex": 10,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Apr 2, 2009 12:12PM waynab wrote: Thanks, jpernot, for your reply.  I am going to have a needle guided surgery where they locate the micro-calcs prior to surgery and I am going to asleep when they do the biopsy because of the location - which the tech told me is what want because they are so deep. So sorry for you - you had to be sooo disappointed.  This is so hard to go through and to be all set for procedure and then not be able to have it has to be awful.  What is your next step?  I'll be praying for you.  waynab",
      "MessageIndex": 5,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "waynab wrote: Hello - what a great place to find out info!  I'm 58 years old and went for routine mammogram on March 13 (was I testing the gods or what? lol). Was told to come back for diagnostic mammogram and u/s.  Diagnostic mammo findings show \"increasing density posterior aspect of left breast and microcalcifications that appear more prominent\".  U/S will be performed.  U/S findings show \"in the area of concern, no significant mass or no architectural distortion is seen. No abnormal fluids collections are identified.\"  Opinion: \"In light of abnormal microcalcificatins, biopsy is recommended\".  I went to see surgeon to schedule biopsy for microcalcs and he found a lump during the examination!    I was told the microcalcs were close to chest wall and couldn't be felt.  I will have a needle guided biopsy for them.  I wasn't too worried until surgeon found the lump (which I cannot feel) and he said he will do a biopsy on that also.  I'm scheduled for surgery on Friday morning and I'm really surprising myself that I am not handling this very well at all. It seems like I am fine one minute and the next, I'm close to tears or crying.  I am just assuming I have cancer since there are two areas of concern now in my left breast. I have no history of cancer of any kind in my family but have read that doesn't mean much.  My question is what is 'posterior aspect'?  The lump the surgeon felt is in the lower outside portion of my breast. Could the lump be the density?  Thanks for any help! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Apr 1, 2009 03:46PM waynab wrote: Thanks bygrace and patoo for your replies.  I had no idea how much the support would mean to me.  The surgeon said I would not have results until next week, but will let you know how my surgery goes on Friday and what my results are next week.  Thanks again for your support, positive thoughts and prayers.  May God bless you both!",
      "MessageIndex": 3,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Apr 3, 2009 03:05PM waynab wrote: Got home from hospital a couple of hours ago.  I'm feeling really good! The needle guided \"thing\" (sorry I don't know all of the medical terms) they did to locate micro-calcs was a piece of cake! All I felt was a little sting from the medicine that deadened the area and then nothing after that.  Then it was off to surgery!! That only lasted about 45 minutes and recovery about an hour.  When surgeon examined me prior to surgery to find lump he felt on Tuesday, he couldn't find it (I never could feel anything) and believe me, I tried and tried!  No lumps or masses or cysts, showed up on any of the numerous mammograms I had, just micro-calcs and increased density  nor did anything show up on the u/s, Soooo, he only had to biopsy the micro-calcs!!  He talked to my daughter and said he was able to remove ALL of the micro-calcs and the dense area surrounding them and that it didn't look suspicious - just fibrocystic stuff (again, I don't know medical terms, sorry) but they were really, really tiny which I've been told all along.  I should have my results Monday afternoon. Have started to breath again, just not really deep (lol).  Just an interesting note, my radiologist, the head surgery nurse and my post-op nurse have ALL had biopsies and were ALL benign!  Thanks to all for their prayers and support.  I'll post again on Monday when I get results.",
      "MessageIndex": 7,
      "PostDate": "03/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/731766",
      "Title": "Scared, really scared waynab waynab"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "May 4, 2009 05:15PM waynab wrote: Dawn - I had a wire guided excisional biopsy last month for microcalcifications (they were very close to my chest wall).  They did inject me with lidocaine and I did not feel a thing - just a little sting from the injection. In fact, when I looked down at my breast, I was so surprised to see the wire sticking out!  I didn't watch the procedure and so I didn't know what they were doing and was shocked when they told me they were done.  They took several pictures to be sure the wire was correctly placed but the whole thing from start to finish took about 20 minutes. I hope your experience is as good as mine was. Glad to hear your first result was B9 and here's hoping and praying your next result is too. Good luck!",
      "MessageIndex": 3,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/733618",
      "Title": "wire guided excisional biopsy dm1991 cleomoon"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Mar 31, 2010 12:08AM waynab wrote: Great news, Jo!! So happy for you!",
      "MessageIndex": 7,
      "PostDate": "31/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750384",
      "Title": "Worried calcifications jo123 Lisa1962"
    },
    {
      "AuthorID": "waynab",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81665/profile",
      "Content": "Mar 28, 2010 12:34AM waynab wrote: jo123 - Just wanted to drop a note to let you know a year ago (March 13) I had calcifications in my left breast, close to the chest wall. They removed them and they were B9.  I just had my yearly mammo last week and it was all good. What the other women said is true - the vast majority of lumps, bumps, etc., are NOT cancer.  We just have to get them checked out to be sure.  The waiting was the very worst part but luckily for me, it was only 3 1/2 weeks from when they first found them to when I had the results. Lots of positive thoughts and prayers are being sent your way. ",
      "MessageIndex": 5,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/750384",
      "Title": "Worried calcifications jo123 Lisa1962"
    }
  ]
}