{
  "AuthorID": "waytooanxiousmommy",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261724/profile",
  "Posts": [
    {
      "AuthorID": "waytooanxiousmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261724/profile",
      "Content": "waytooanxiousmommy wrote: How soon did you have a biopsy after ultrasound and mammo? I am having out of control anxiety. I have a palpable lump and it was not marked highly suspicious but also not cleared as being benign after mammo and ultrasound. My obg/yn never called me with the results from ultrasound/mammo for a week but due to anxiety I made an appointment to see her 8 days after and she said biopsy is recommended. Waiting 8 days with no news was really hard. Concerned that if I had not made the appointment no one would have told me I needed the biopsy :( During my visit they made an appointment with a breast surgeon 3 weeks out. I am not sure if I will just see him or if I will have biopsy that day? My biggest issue is my anxiety. I can't sleep or focus on work Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/859593",
      "Title": "Anxiety. Have to wait 3 weeks to see breast surgeon for a biopsy waytooanxiousmommy waytooanxiousmommy"
    },
    {
      "AuthorID": "waytooanxiousmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261724/profile",
      "Content": "waytooanxiousmommy wrote: I had Taxol/Adriamycin for triple negative breast cancer ten months ago and while all other side affects have pretty much gone away my stomach still feels more easily irritated that it used to be before I had treatment. Is this normal or should I worry than something else is wrong with me? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869872",
      "Title": "Digestive issues 10 months after chemo waytooanxiousmommy Micmel"
    },
    {
      "AuthorID": "waytooanxiousmommy",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/261724/profile",
      "Content": "waytooanxiousmommy wrote: I have an aggressive grade 3 tumor which based on imaging is under 2 cm and by clinical exam and imaging lymph nodes appear to be cancer free. I am having neoadvujant chemo with Taxotere which will be followed by AC. By clinical exam the lump which was palpable has disappeared 6 weeks into my 5 month chemo regimen. My tumor is pretty much TNBC because its only 10% ER+ and negative for PR and HER2 I am thinking that even if I have PCR I think it would be important to radiate my lymph nodes given my aggressive cancer and so the only value of SNB would be to stage me. I don't feel like thats enough of a reason to increase my risk of lymphdema. Did anyone else refuse and how did the surgeon respond? Also my hospital has proton radiotherapy and since I have a left sided tumor, will have Adriamycin chemo (can damage heart), have high cholestrol and heart disease in my family I hope my insurance would let me have this type of radiotherapy. Anyone else have experience with how insurance responded to this? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/861868",
      "Title": "Thinking of refusing SNB waytooanxiousmommy waytooanxiousmommy"
    }
  ]
}