{
  "AuthorID": "WC3",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
  "Posts": [
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: I have a drain in each side and I am hoping to have them out by the end of the week. One drain, the one on my cancer side where I had the sentinel nodes removed (also the side where the drain insertion site leaks), is still putting out more than 20mL per day, while the drain on the other side is now putting out....almost nothing. About 12mL per day. So the question is, is the cancer side putting out more fluid because the lymph nodes are gone or is the other side putting out hardly fluid due to a clot in the internal portion of the tube? Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 6/1/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/15/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868585",
      "Title": "Drain Question WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 29, 2018 07:59PM WC3 wrote: Drains out :-)",
      "MessageIndex": 3,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868585",
      "Title": "Drain Question WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 30, 2018 01:54PM WC3 wrote: Rah2464: Thank you!",
      "MessageIndex": 5,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868585",
      "Title": "Drain Question WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 01:11PM WC3 wrote: Everyone will be affected a little differently. My first chemo was rougher than the others in terms of oral symptoms and stomach cramping mid cycle. My second chemo was worse in terms of muscle fatigue. My third chemo I switched IV nausea meds and had more nausea but less bad taste which enabled me to eat more. I had a few particularly bad days of weakness due to heat. By my 4th chemo I had my acid reflux under control and had a dose reduction because my blood labs weren't keeping up and my dose was too high due to weight loss. I had increasing muscle weakness but less stomach cramping. My 5th chemo I just had yesterday. I don't know if they decreased the dose again because my blood labs still plummeted after infusion 4 or it's too soon for the side effects to hit me but I don't really feel it right now other than the fact that water tastes bad from the IV Zofran and to some extent\" tge dexamethasone, and I am hungry but my blood sugar is too high to eat due to the dexamethasone. By tomorrow I will be in dexamethasone withdrawal and my throat/esophagus will get very tender as result, making it difficult to eat. By day 7 that will abate and between day 7 and 10 the stomach cramping will start and I will start to lose my sense of taste due to the chemo, but it will return quickly. My fatigue is cumulative but I start to feel better by the end of my cycle. But I can have random bad days where I think I am fine and suddenly I am not, and I have not been in good enough condition to work.",
      "MessageIndex": 1,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867209",
      "Title": "Chemo update Rhiannon061 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 16, 2018 07:18AM WC3 wrote: As far as water goes, I can only tolerate carbonated water in quantity for most of my cycle. When I was given IV Aloxi for nausea, water had a bad sweet taste and I could only tolerate lime flavored La Croix, which I normally hate. After I was switched to IV Zofran and Emend, regular water still tasted bad but the lime La Croix was too bitter, Perrier was too sweet until the end of my cycle but Pelligrino seems to be about right.  ",
      "MessageIndex": 6,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867209",
      "Title": "Chemo update Rhiannon061 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Feb 24, 2019 11:34PM WC3 wrote: Well if you get a lawyer to take the case, let me know, because I was flat out misdiagnosed when I actually had cancer and didn't get the \"You have dense breasts\" letter either.",
      "MessageIndex": 8,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/870019",
      "Title": "Misdiagnosed sugarfoot75 L-O-R-I"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Feb 25, 2019 12:03AM WC3 wrote: sugarfoot75: I did some light lawyer shopping before I started treatment and have only recently recovered enough to take that on again, which I will be doing tonight. ",
      "MessageIndex": 12,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/870019",
      "Title": "Misdiagnosed sugarfoot75 L-O-R-I"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Feb 26, 2019 07:52AM - edited Feb 26, 2019 07:53AM by WC3 KBeee: That's crazy. My sister has had two CTs and in the reports, the radiologists noted a healthy appendix...she doesn't have an appendix. She had appendicitis when she was a kid and had it removed. ",
      "MessageIndex": 19,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/870019",
      "Title": "Misdiagnosed sugarfoot75 L-O-R-I"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 12, 2018 11:40PM WC3 wrote: Evie: Sorry your mom had a rough time. My oncologist uses a strong anti nausea protocol so I'm not sure if it's that working or just me, but here is what they give me for nausea for comparison. 1. I take dexamethasone pills the day before and the day after infusion, 8mg twice each day. 2. The day of the infusion, to prevent nausea I am given IV dexamethasone and IV Aloxi. 3. At home I have Zofran pills to take, and compazine pills to take if the Zofran doesn't work. I normally need a Zofran in the morning on days 2 and 3 and sometimes in the evening but have not needed to take the compazine. I take the Zofran at the first hint nausea. Eating a light, easy to digest diet starting a few days before the infusion might also help. Some people do a fast or partial fast of sorts, but that is something that she would need to discuss with her doctor, as fasting or calorie restriction can be dangerous for some people or if not done in the right manner.",
      "MessageIndex": 15,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/843578",
      "Title": "Mom wants to give up on chemo after first treatment jerzygirl WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 28, 2018 07:19AM WC3 wrote: Expat2Uruguay: Side effects can come up fast. In a few instances I was fine and then they just came over me.",
      "MessageIndex": 7,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866869",
      "Title": "First chemo treatment and first vomit Expat2uruguay Fairchild"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 27, 2018 06:51PM - edited Aug 27, 2018 06:56PM by WC3  Expat2Uruguay: I am receiving taxotere and carboplatin for chemotherap. Here is what I am given to prevent nausea. The day before chemo and the day after chemo: I take 8mg of dexamethasone in the morning and 8mg in the evening. The day of chemo: I am given IV dexamethasone, and an IV anti emetic. Originally the anti emetic I was given was IV Aloxi (palonosetron) which worked the best for nausea...I had almost none, but the Aloxi gives me a bad taste in my mouth for most of my cycle so I was switched to IV Zofran (ondansetron) and then my infusion after that they also added IV Emend (aprepitant). On these I have bouts of nausea for the first week but it's manageable and I don't have as much of the bad taste. For nausea at home I have zofran tablets. On the Aloxi I just needed one the day after chemo and maybe one the next day. The key is to take it at the slightest sensation of nausea. I was given compazine tablets in case the zofran tablets don't work but I haven't needed them. If I start to feel sick while out and about I sit and rest...I could also take a zofran but a lot of times it's just my blood sugar dropping so I carry hard candies to suck on and some water. Additionally, the dexamethasone gives me acid reflux so I have been starting Prilosec (omeprazole) a few days before I take the dexamethasone and I stay on it until a few days after chemo then switch to Zantac (ranitidine HCl) to wean off of the Prilosec....a lot of people stay on the Prilosec, I don't because I develop a tolerance to it then get rebound reflux when I try to stop it.",
      "MessageIndex": 3,
      "PostDate": "27/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866869",
      "Title": "First chemo treatment and first vomit Expat2uruguay Fairchild"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 5, 2018 11:34PM WC3 wrote: I would think that if they got all of the breast tissue then they should not react to hormones extremely. I would run the question by your breast surgeon though.",
      "MessageIndex": 1,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868717",
      "Title": "Does hormones affect reconstructed breasts? danni3085 danni3085"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 19, 2018 03:00PM - edited Aug 19, 2018 03:04PM by WC3 duffyzmom: Thanks for the reply. I realized after my last infusion was delayed that the dexamethasone alone was giving me reflux so I started the Prilosec four days before the dexamethasone. I had my infusion Thursday, took the last Prilosec Saturday morning and a Zantac around 4am. I probably could have used another day of Prilosec because I am on the verge of reflux but hopefully another Zantac will put me in the clear later. Congratulations about being on your final round of chemo btw! I am on number 4 of 6 rounds of TCHP.",
      "MessageIndex": 2,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866456",
      "Title": "How often do you take Omperazole (Prilosec)? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: Do you take it daily or just around the time of your infusion. Because I get rebound reflux and develop resistance to PPIs the longer I take them, I have been starting the Prilosec the day before the infusion and continuing it for about five days but I get reflux anyway starting the day after the infusion and have to take Zantac as well, though not before my throat has been scortched. I'm wondering if I need to start taking it farther out. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 6/1/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/15/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866456",
      "Title": "How often do you take Omperazole (Prilosec)? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 20, 2019 07:04PM - edited Jan 20, 2019 07:05PM by WC3 Personally I would probably get a mastectomy in your situation because I would think that my breasts had a cancer supression problem.",
      "MessageIndex": 6,
      "PostDate": "20/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/869438",
      "Title": "HELP! I don't know what to choose! Jgargasz27 Jgargasz27"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 21, 2018 03:24AM WC3 wrote: I knew I had cancer the second I saw the 2nd ultrasound. The response in my head was \"aw sh!t\". I didn't hear a doctor say the actual word until I was on the 4th doctor.They seem to prefer to say \"carcinoma\" or \"malignancy\". There is a lot of assistance out there to help pay for cancer related treatments. You might contact a cancer center in your area and see if they have any resources for you. You might not need chemotherapy depending on your type. Mine is high grade triple positive and chemotherapy was standard for it. Is it fun? No, but honestly I've had worse from run of the mill illnesses like influenza.",
      "MessageIndex": 8,
      "PostDate": "21/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866037",
      "Title": "It's cancer. Jadedjo Jadedjo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 8, 2018 12:20AM - edited Sep 8, 2018 12:24AM by WC3 PatTheArtist: I had genetic testing once for an entirely different condition and after the doctor sat on the results for few weeks, I finally walked in there and asked for a copy and they gave them to me...in the U.S. they actually have to give you copies of your medical records but they can make you go through their official process. I'm sure some people don't want their results until they can talk to the doctor about them but I'm a \"give them to me now, we'll talk later if we have to\" type person, and my current doctors know this so they are usually pretty good about having them posted to my patient portal when they become available. I would probably just make an appointment if he wants to talk about them or walk in there in person at the end of the day when he is finishing up with appointments and ask for the results. ",
      "MessageIndex": 2,
      "PostDate": "08/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/867057",
      "Title": "Doctor has results for 2 days... PatTheArtist PatTheArtist"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 9, 2018 11:23PM WC3 wrote: I've developed \"the sunburn\" in the skin above between my breast reconstructions. The odd thing is, this is the exact sensation my mother and I have on the outer sides of our upper arms. She has fibromyalgia and thought it was from that, but I don't, and I have no muscle in the regions I have the pain. This kind of pain can also be caused by carbon monoxide poisoning, but we never had any major CO issues where we have lived.",
      "MessageIndex": 83,
      "PostDate": "09/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/860079",
      "Title": "Hypersensitive skin/nerves after mastectomy az2017 Silverpullet"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 21, 2018 02:58PM WC3 wrote: I started TCHP in June. I just wanted to say, may the chemo kill your cancer as fast as it kills your taste buds. I'm 6 days past my infusion and I could taste breakfast but barely lunch.",
      "MessageIndex": 13,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 1, 2018 07:49PM WC3 wrote: Tigerlily318: I agree. It is hard to know. There is a lot of conflicting advice out there about diet and cancer unfortunately. ",
      "MessageIndex": 72,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 29, 2018 06:43PM WC3 wrote: Tigerlily318: I have heard that it might not be good for people take fish oil supplements or eat fatty fish around the time of chemo infusions because (in mice) it was shown to convey a protective effect to the cancerous cells against the chemotherapy, particularly platinum based chemotherapies.  ",
      "MessageIndex": 51,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 2, 2018 11:51PM WC3 wrote: EZRunner: I have my 5th infusion next week and my hair is thinner on top than not but I'm not dissatisfied. I had initially planned to just let it fall out but there were a few reasons that was turning out to be more of a hassle than not and I'm on Taxotere which can cause permanant hair loss so that factored in to my decision. I would have forgone the cap if I were on Taxol instead as it does not cause permanent hair loss to the extent that the Taxotere can and I would not have been able to afford all of the capping sessions as I think Taxol is usually dosed weekly rather than every two or three weeks like Taxotere.",
      "MessageIndex": 87,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "May 18, 2019 05:40PM WC3 wrote: Personally I would avoid manicures/pedicures. Your nail beds/root are very susceptible to damage during chemotherapy.",
      "MessageIndex": 10,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871370",
      "Title": "Looking for a list of what I can and can't do April0315 Txladybe"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "May 18, 2019 05:42PM WC3 wrote: pingpong: I've heard that rosacea is actually caused by a reaction to skin mites that just about everyone has. I guess the chemotherapy killed them or wiped out the antibodies responsible for the reaction.",
      "MessageIndex": 11,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/871370",
      "Title": "Looking for a list of what I can and can't do April0315 Txladybe"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 1, 2018 07:43PM WC3 wrote: EZRunner: I'm using Dignicap and while it is cold and unpleasant, it's not a constant ice cream headache.",
      "MessageIndex": 71,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866656",
      "Title": "Chemo Starting September 2018 Tigerlily318 BrinkOfEternity"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: This Post was deleted by WC3. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865560",
      "Title": "What's causing the bad sweet taste? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 16, 2018 01:45PM WC3 wrote: dms5: My cancer was palpable and showed up on my first mammogram but was missed or not recognized by the radiologist. I had also had US on the same day. I don't know if it was invisible on the US or if they failed to image it or recognize it but I was told my lump was normal breast tissue when it was cancerous, and this delayed my diagnosis and treatment by nearly 2 years. If you think it's new or weird or different and and you can feel it, have an MRI and biopsy if possible.",
      "MessageIndex": 3,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867234",
      "Title": "I guess I am one of the worried ones Ann2018 Ann2018"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 11, 2018 11:25AM - edited Oct 11, 2018 11:26AM by WC3 Sometimes pathologists are wrong. You can ask for a second opinion. My slides were reviewed by at least two places and because my cancer came back HER2 positive by IHC at one facility, another facility confirmed it through FISH so I am pretty sure the pathologists got it right in my case. There was an incident of a woman who was misdiagnosed as having breast cancer by three different pathologists and then died from an accidental chemotherapy overdose but she had a rarw condition that can appear pathologically similar to a rare form of breast cancer which pathologists don't see much.",
      "MessageIndex": 3,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867708",
      "Title": "False positive biopsy? Raysal WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 12, 2019 07:59PM - edited Jan 25, 2019 01:20AM by WC3 The radiation from conventional rads is like light emitted from the machine. It does not travel with you. What will register on radiation detectors is the radioactive tracers from the bone scans because they are injected in to you and cause you to emit radiation until they decay in to something not radioactive or are excreted from your body. I was given a card to carry with me after my bone scan as proof I had a bone scan and was not smuggling radioactive material, should I happen to set off a detector.",
      "MessageIndex": 4,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/869304",
      "Title": "Will my radiated breast show up on an airport scanner? kksmom3 Hopeful82014"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 22, 2018 10:29PM WC3 wrote: I have pre pec TEs. I'm pretty sore right now...I just had surgery Tuesday, but the extra strength Tylenol has made it tolerable. I have oxycodone which might very well work better but I have to take three more pills when I take that to counter side effects so I'll save the oxy for later if I need it.",
      "MessageIndex": 3,
      "PostDate": "22/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868433",
      "Title": "Pre-pectoral Implants: Contact sports after only 6 weeks Rioghnach WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: Has anyone developed allergies during or after their treatment? My immune system took a beating during my first cycle and now it seems I have a new allergy. I went to open the spice container tonight, which had some grease residue on it and whatever particles were embedded in it, and almost instantly, the portion of my hands that made contact with the container turned red and began to itch. I washed my hands twice with hot, soapy water but six hours later they still itch. I haven't been this itchy since I put my head down on my pillow, not realizing that previously my cat hard curled up on it after rolling in grass pollen. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865871",
      "Title": "New immune system = New allergies? WC3 wallycat"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 23, 2018 06:32PM WC3 wrote: oxygen18: Thanks for the reply. Was neoadjuvant the standard where you went? WC3 = Wing Commander III. It's a great game I used to play when I was a teenager. But it can double as the WWW standard in honor of that as well.",
      "MessageIndex": 2,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866118",
      "Title": "What's the point of neoadjuvant chemotherapy? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 21, 2018 02:32AM WC3 wrote: elisa60: I'm glad to hear things went well. :-)",
      "MessageIndex": 3,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866629",
      "Title": "Hello everybody, Update on my first day of chemo elisa60 elisa60"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 28, 2018 12:09PM - edited Nov 28, 2018 12:10PM by WC3 I told most of my family because of our family history. With most others outside of my family, I started to look ill due to dropping a lot of weight and the hair loss/hats and people started to ask questions so I was just up front with them. I hope having it on their mind will save someone's life. ",
      "MessageIndex": 13,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868555",
      "Title": "Who do I tell? Suzyshacklechick AliceBastable"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Feb 25, 2019 08:55AM WC3 wrote: I did cold capping and still lost more than 50% of my hair but I did it because taxotere can cause permanent hair loss and I had not known about weekly taxol as an alternative to taxotere. My hair is growing back pretty well so far and being that was my primary goal, I'm happy with it. Additionally, that I did lose what I did, I know the chemotherapy got in to my scalp, which does make me less worried about mets developing there. You can see photos of my cold capping progress in the cold capping thread. ",
      "MessageIndex": 1,
      "PostDate": "25/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/870023",
      "Title": "Conflicted about starting Paxman cold cap lamb22 Meow13"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 16, 2018 03:53AM WC3 wrote: Amica: As an American, if I were close to Canada I would have gone to Canada for a full body PET/CT if my insurance denied it. The pre negotiated price for a full body PET/CT at my health care provider was $10,000 and the post negotiated price was $3400. I hear they are often not more than $1500 out of pocket in Canada.  ",
      "MessageIndex": 149,
      "PostDate": "16/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 7, 2018 06:08AM WC3 wrote: Thanks everyone for your input.",
      "MessageIndex": 9,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866118",
      "Title": "What's the point of neoadjuvant chemotherapy? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 14, 2018 08:34PM WC3 wrote: Hi Denise-G: Thanks for the reply. I hope I don't get any severe allergies. I've invested in a box of benadryl.",
      "MessageIndex": 2,
      "PostDate": "14/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865871",
      "Title": "New immune system = New allergies? WC3 wallycat"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 15, 2018 12:43AM WC3 wrote: Hi couragement: I've been doing ok today, how are you? My palms started itching today though after I touched some tools so now I'm trying to figure out what the spice container and the tools have in common. I'm thinking some pollen paricles maybe.",
      "MessageIndex": 4,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865871",
      "Title": "New immune system = New allergies? WC3 wallycat"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 16, 2018 05:10AM WC3 wrote: couragement: I made an attempt to make Lebanese stuffed grape leaves for dinner and to put a new hole in my belt as I've lost weight. I only succeeded at one of those things and it wasn't dinner, hah! I hate cooking :-) I'm almost halfway through chemotherapy. My hands didn't look or feel dry but I put some lotion on them anyway and that seems to help.",
      "MessageIndex": 6,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865871",
      "Title": "New immune system = New allergies? WC3 wallycat"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 22, 2018 08:50PM - edited Jul 22, 2018 08:58PM by WC3 Colleen: Sorry to hear the news. I see you are HER2 positive but was this confirmed with FISH? There was another member on here who had a false positive with IHC and was actually HER2 negative which is why her cancer wasn't responding to the HER2 positive protocol. I don't remember who it was but she changed centers and the new oncologist figured out she was HER2 negative and put her on a different chemotherapy which her cancer responded to.",
      "MessageIndex": 6,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 17, 2018 11:46AM WC3 wrote: Gingermiss65: Have you seen a neurologist and had an EMG and nerve conduction study done? Those two tests can detect nerve and muscle issues. Also, are you on statins? I know two people who were on statins who had to be switched to non statin cholesterol medications due to neuromuscular issues the statins were causing. In any case, I think a neurologist who specializes in neuromuscular issues would be obe of the kinds of doctors to see for your issues.",
      "MessageIndex": 1,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867242",
      "Title": "Not Neuropathy, Loss of Muscle? Gingermiss65 Gingermiss65"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: I'm halfway through neoadjuvant chemotherapy getting and getting kind of tired of having this cancer in my body and I would like it out. The center I go to does neoadjuvant chemo standard for my type of cancer...I wasn't thrilled about it for a few reasons and ultimately they said I could do adjuvant if I wanted to but it's a respectable facility and I decided to follow the protocol because I knew my knowledge might be lacking and I did not want to be at odds with my treatment team given that fact. But the more I learn I learn the more the rationale for neoadjuvant chemo seems to not apply to me... 1. A greater chance of breast conserving surgery: I'm not keeping the breast. I don't want it for a variety of reasons. 2. They can tell if it's responsive to the chemotherapy: I understand this. It has been, but I've read genetic testing can now determine this. Why do an experiment when you don't have to? 3. It allows them to test new drugs: I'm not a part of a clinical trial and no one is giving me experimental drugs even if I requested them. So moot point. 4. It allows them to predict survival rates: Some studies refute this and telling me my tumor shrunk x% so my chance of recurrence is Y is irrelevent to me because whether I have a 40% chance of recurrence or 10% of recurrance I will still have the same screenings with the same frequency. Am I missing something here? Is there a good reason for this or am I needlessly spending my summer existing with a lump of cancer in my body? Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/866118",
      "Title": "What's the point of neoadjuvant chemotherapy? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 11, 2018 02:15PM WC3 wrote: Neither my facility nor the one I had the biopsy at did the ki-67 test. My MO said they would do it after the surgery if enough of the tumor is left (I had neoadjuvant chemotherapy). There wasn't so they have to track down the original biopsy sample.",
      "MessageIndex": 6,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/868774",
      "Title": "High Ki-67, but low grade and stage? evily Renee9487"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: This Post was deleted by WC3. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867080",
      "Title": "Have you done TCHP without dexamethasone/decadron? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 9, 2018 03:28PM - edited Nov 9, 2018 03:29PM by WC3 Dancing Elizabeth: She is being thorough. I do the same with my thyroid tests. If my TSH goes up, I test again a little sooner so I have a better idea if it's an upward trend or fluctuation.",
      "MessageIndex": 4674,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 14, 2018 09:01PM - edited Oct 14, 2018 09:11PM by WC3 I just finished chemo and probably could have done it alone if I had to. My only absolute need was a ride home from the infusions because the Benadryl made me too sleepy to take the bus, but I could have taken a cab or a Lyft or Uber if necessary. One of my parents drove me and usually stayed a few days after, just providing some company, but they were typically gone by the time my worst side effects hit. I got in to trouble twice and I was alone both times. Once when I decided I was well enough to walk up to the market and then discovered I wasn't well enough to walk back, and the second time, when I was stuck in bed with unusually bad side effects as a result of my side effect management schedule getting messed up, but I had to pick up some anti influenza prophylactic my MO called in for me after potentially being exposed to influenza. I took an Uber home from the market, and made a desperate plea to my sister to drive across town to pick up and deliver my medication. If I were entirely alone though, I would have been sure to have had a pharmacy that delivered on my file. It's really not something to worry about doing alone though.   ",
      "MessageIndex": 20,
      "PostDate": "14/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867765",
      "Title": "Has anyone refused Chemo? SecretlyDistressed SecretlyDistressed"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 26, 2018 01:59PM WC3 wrote: I didn't have any pain during my biopsy. But I did have a lot of inflammation afterwards and I highly recommend ice packs.",
      "MessageIndex": 4,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867931",
      "Title": "18 Yr. old Daughter needs 3 Core Needle Biopsies? Sanddollar7 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 11, 2018 12:33AM - edited Dec 11, 2018 12:35AM by WC3 The radiologist missed my palpable lump on the mammogram and I don't know what they saw on the ultrasound, if anything, but they told me it was normal breast tissue...it wasn't. They should have done a biopsy or an MRI. I went misdiagnosed and untreated for almost two years after finding the lump. Hopefully that will not cost me my life.",
      "MessageIndex": 5,
      "PostDate": "11/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/868768",
      "Title": "Palpable lump not seen on mammogram or ultrasound Hodor Hodor"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 23, 2018 11:19AM WC3 wrote: cherd: I didn't get mouth sores with TCHP except when I accidentally bit my lip. Your mouth may become sensitive for a week or so though. I would consistently get an inflammed tastebud on the tip of my tongue from it hitting the back of my teeth. Normal toothpaste was irritating though so I used Biotene toothpaste...it can often be found away from the other toothpaste in it's own little area, and I would ice the inflammed tastebud with popsicles.",
      "MessageIndex": 126,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/868664",
      "Title": "Chemo starting December 2018 LillianGish nanette7fl"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 14, 2018 04:21PM WC3 wrote: Don't be afraid to ask questions or seek second opinions.",
      "MessageIndex": 22,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868297",
      "Title": "Your One Piece of Advice DiagnosisDisruption santabarbarian"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: I've lost too much weight for immediate natural reconstruction following BMX and am not a good candidate for permanent implants. I cannot have subpectoral implants due to muscle issues and my skin is thin, making subdermal implants non ideal. My BS (25 years of experience) and the first PS (6 years of experience) I consulted with say I need expanders/implants in the time between the BMX and reconstruction to prevent tightening and scarring issues. The first PS was going to protect the expanders/implants with alloderm. The second PS (25 years of experience) I consulted with was initially going to just leave me flat until reconstruction due to concerns about subdermal implants but when I mentioned the concerns raised by my BS and the first PS about going flat temporarily he relented and said he could put small expanders in just to keep some slack there. I'm curious, has anyone had good flap reconstruction results after being flat for a few months? Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867355",
      "Title": "Delayed Reconstruction Without Expanders/Implants? WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Feb 7, 2019 12:03AM - edited Feb 7, 2019 12:07AM by WC3 This is how it went for me. Day 1: Sleepy due to Benadryl. Bad taste starts due to Zofran. Day 2: Burning muscles starts. Mild nausea. Managed with Zofran. Acid reflux starts if I did not stick to reflux management schedule. Day 3: Face turns red and throat/esophagus becomes tender due to dexamethasone withdrawal. Day 4: Bone pain starts from Neulasta. Managed with Claritin and rest. Day 5: Bone pain peaks. Muscle burning and weakness peak. More nausea...not sure why it was always on day 5. Toughed it out to avoid prolonging the taste changes Zofran caused me. Day 6: Face no longer red, throat/esophagus tenderness is fading. Bad taste alterations due to Zofran is fading. Acid reflux, if present, is fading, but tongue is getting sensitive and tender. Food feels too rough. Day 7: Tip of tongue has enflamed taste buds. Food tastes partially normal. Stomach cramping starts. Managed with small portion sizes and Imodium but from this point on, restrooms must be nearby. Day 8 and 9: Much the same as Day 7. Day 10: Sense of taste starts to fade due to chemotherapy. Things start to taste bad again. Day 11: Same as day 10. Day 12: Can't taste much and most of what I can taste tastes bad. Day 13: Sense of taste starts to return. Tastebud inflammation going down. Day 14: Sense of taste improving. Getting strength back. Pulsating tinnitis develops. Day 15: Starting to feel like I'm getting back to normal except for the stomach cramping. (This gets pushed back with each infusion). Day 16 to until next infusion: Side effects continue to fade. Some notes: I was originally given Aloxi during my infusions for nausea and this controlled the nausea very well but altered my taste perception such that things, and particularly water, had a bad, linger taste and this lasted most of my cycle. I was switched to IV Zofran and Emend during the infusion. I had more nausea with this (the day 5 nausea) but it caused a far less lengthy taste alteration. Water tasted bad for most of the time I was on chemotherapy and I could only tolerate lime flavored sparkling water for most of it. I typically hate lime but my taste perception was altered by the Aloxi and Zofran such that lime flavored water tasted like unflavored water while unflavored water tasted bad. My urethra would get irritated and it would burn to pee. I think this usually happened around day 7. I got thrombocytopenia (low platelets) consistently and this would cause bruising/bleeding under my skin and any other place my blood vessles broke. Before I figured out how to get the stomach cramping under control, the cramping, plus the thrombocytopenia would cause me abdominal tenderness. I also developed pretty severe anemia and felt generally bad as a result. I am almost 4 months PFC and still anemic but recovering. I developed some vision issues probably from the anemia. Nothing major, just weird.",
      "MessageIndex": 9,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/869721",
      "Title": "THCP chemo side effect time line? Glittertits MinusTwo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 1, 2018 01:43AM WC3 wrote: Did anyone have bone mets that a PET/CT missed but a bone scan found? I had an 18F-FDG PET/CT in May that came back negative for bone mets (I hear 18F NaF PET/CTs are more specific for bone mets but we werw looking for metastasis in general), but a recent MRI shows increased vascularity in my sternum and the radiologist recommended a bone scan. I understand doing an 18F NaF PET/CT is probably off the table because it would be too soon after the previous one on terms of radiation exposure but would a bone scan really see something that a PET/CT didn't? I'm slated for a BMX and reconstruction soon but if it's stage IV then I would probably choose a different surgical option.",
      "MessageIndex": 4631,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 24, 2018 04:26PM WC3 wrote: I have the same type of cancer. I had TCHP which is taxotere, carboplatin, herceptin and perjeta, which is one of the standard treatments for HER+ breast cancer. Taxotere and carboplatin are the chemotherapies and herceptin and perjeta are the targeted therapies. I had 6 infusions at 3 to 4 week intervals and will continue with herceptin and perjeta for a year at 3 week intervals. I have no side effects from the herceptin and perjeta, other than a runny nose, but some people get diarrhea from the perjeta. An alternative to taxotere is weekly taxol. I don't think there is a significant difference between the two except taxotere, on occasion, can cause permanent hair loss and taxol is sometimes easier to tolerate for those who have a sensitivity to the taxotere. The C might also be different when taxol is used, though I am not sure if this is always the case. For the chemotherapy, I needed a ride home from the infusions because they gave me IV benadryl as one of the premeds, which made me sleepy. Some people are also given ativan, though it's optional. Fir TCHP, there is a risk of allergic reaction in the days immediately after the infusion, during which time my mother would stay with me, and my weakness would peak around day 5, during which time I was often alone but usually managed. I had to call my sister for help once when I got off of my side effect management schedule and needed her to pick up something at the pharmacy for me. I had a bilateral mastectomy and needed help after surgery getting my shirts on for a few days, and reaching a few things I had forgotten to take down from the cupboard before hand. I didn't do much cooking during chemotherapy and would have really liked a home chef. I made good use of hot food bars. It helps to have people around but you don't need a village. I would talk with your husband and get his input and also see which treatment facility you like best.",
      "MessageIndex": 10,
      "PostDate": "24/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868985",
      "Title": "Where to do treatment? Cindrelly hapa"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 24, 2018 12:15PM WC3 wrote: Johned9: You might just have to tell your daughter to back off even though she is well intentioned. I had to tell my sisters that to some extent. They had decided where I was going to have my treatment before I had a chance to think about it and were pressing me for a confirmation. Meanwhile my father was insisting I not go to the place my sisters wanted me to go because the hospital associated with that facility made a mistake that resulted in the death of a family member. The only people who could give me concrete compelling reasons as to where to go were the doctors.",
      "MessageIndex": 22,
      "PostDate": "24/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/866574",
      "Title": "Advice on telling family Dani444 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 15, 2019 05:17AM WC3 wrote: I'm now about 3 months PFC and I know this is far out. I thought my taste was back to normal. But I have a cold and my mom made a roast chicken for dinner...it still had a chemo taste. Not a strong one but it was definately there.",
      "MessageIndex": 10,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 25, 2019 01:27AM WC3 wrote: RosieRed: I ate a lot of those black canned olives the first few days after my infusion.",
      "MessageIndex": 17,
      "PostDate": "25/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 13, 2018 09:51PM WC3 wrote: Sorry Tammy, I don't have long distance calling and don't give my number out to people I can't meet in person due to the unfortunate abundance of scammers and phishers these days. I suggest you also refrain from giving your number out in online forums. If you wish to speak to others in your situation or a similar situation in person, there is likely a support group in your area. If you wish to speak to members here privately you can PM then.",
      "MessageIndex": 3,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 10:13AM WC3 wrote: Lula73: I am waiting for them to call me back but I do know they are out of network with my provider at best.",
      "MessageIndex": 9,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 15, 2018 04:42PM WC3 wrote: One thing I have come to accept about being human is that we can't always know if we have made the right decisions in life. I think you had valid reasons to make the choices you did. ",
      "MessageIndex": 3,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/867227",
      "Title": "Please help me LiveWellToday Morwenna"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 17, 2018 05:40AM WC3 wrote: Amica: I'm glad to hear your oncologist is willing to work with you to get the PET. I hope it yields some good news. One clinic I originally went to gave me a hard time about getting an outside order for an MRI when their own facility was booked for three weeks and their own radiologists were saying I needed the MRI within 14 days.",
      "MessageIndex": 158,
      "PostDate": "17/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/866087",
      "Title": "Anyone want to sit and wait with me? ColleenS80 Amica"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Nov 29, 2018 01:27PM - edited Nov 29, 2018 01:28PM by WC3",
      "MessageIndex": 940,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 15, 2018 09:08AM WC3 wrote: Runrcb: Yeah I was thinking people probably start gifting themselves those cosmetic surgeries around this time, and my surgery will be long. I do believe my medical team works together and communicates. That is one reason I chose the facility I did. It was set up to be a little more comprehensive than the others. I would just really like this out of me now. I was misdiagnosed initially at a different facility and it was allowed to grow in me for two years because of that. When I was properly diagnosed, my doctor who ordered the tests and who has been practicing for decades told me it needed to come out ASAP. Then the path report came back as aggressive as it gets, I find out they want to leave it in and do chemo first, it grows half a cm in the month before chemo and can be seen poking out from my breast, the chemo seems to shrink it, and then the PS wanted to push the surgery date way back during which time I won't have anything stopping it from growing again. It's been a bit nerve wracking and I really don't want my life taking a back seat to a nose job if that's what it is. ",
      "MessageIndex": 16,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 1, 2018 02:52PM WC3 wrote: Hi Roxanne: tl:dr I wouldn't worry but read on if you want to know why. The radiation from mammograms does not stay in your body at all. You can think of X-Rays from an external source like an X-Ray machine like light from a light bulb. It's emitted when the machine is on and goes away when the machine is off. The difference between X-Rays and light from a light bulb is that we are kind of translucent/transparent to X-Ray photons...the \"light\" that is the X-Rays can shine through us, but some of the photons \"collide\" with the molecules in our DNA and are high enough energy to knock some of the atoms off and damage it. This type of radiation is called \"ionizing radiation\". We are exposed to ionizing radiation in small amounts on a regular basis in the form of UV light from the sun, gamma rays from things in outer space, and various forms of ionizing radiation from small particles of radioactive minerals and elements in the environment from naturally occuring sources and nuclear testing and accidents. These sources of radiation contribute to what is called \"background radiation\". In most instances, when cells are damaged by radiation, they self destruct or are destroyed by the body. This is how radiation is used to treat cancer. But in some rare instances the damage constitues a mutation that causes the cell to become cancerous or sets it up for it or it's prodigeny to become cancers down the road. This is how radiation causes cancer. It should be noted that anything that damages a cell at the level of the DNA can result in cancer. The more often ionizing radiation cells are bombarded by, the greater the chance of a cancer causing event. The odds of cancer from one or even a few annual x-rays or mammogram are very low, especially today because technology enables them to use very little radiation. You are more likely to end up with cancer from sun exposure. The PET/CT is a different story. The CT part of the PET/CT is just like getting an X-Ray only you are getting a lot of them at once. The more of your body that is being imaged, the more the more X-Ray images have to be taken. How dangerous is this? The amount of radiation a CT scanner emits varies a lot between scanners and facilities but in the U.S., the risk of cancer is calculated to be 1 in 2000 from a typical CT which is not \"full body\". It puts it in the \"limit use\" category. The PET part of a PET/CT uses radioactive isotopes that are injected in to you. They are attached to a substance that hypermetabolic cells such as cancer cells uptake quickly an in large quantity, concentrating the radioactive isotopes and causing the radiation to be emitted from that spot at levels the detectors in the scanner can detect. That shows up on the images as a glow. The radiation from this substance dies off after a few hours. A PET and CT can be done separately but are often done together when looking for cancer. The radiation exposure from a whole body PET/CT is considered to be significant compared to how hoe much radiation we are exposed to on a regular basis. A whole body PET/CT in the U.S. exposes a person to about 8 years worth of background radiation and that puts them in the \"not for routine use\" category. But it's important to understand what is meant by \"significant\" with respect to cancer risk. Your risk of getting cancer from a single whole body CT or PET/CT in the U.S. is thought to be around 1 in 200 when you are 20 and declines with age. While the risk of cancer from a whole body PET/CT for any one individual is relatively small, the medical community has too look at it in terms of how it translates to incident among the populations. If 200 20 year olds have whole body PET/CTs they figure 1 will get cancer from it. If 1 million 20 year olds get whole body PET/CT they figure 5,000 will get cancer from it. Around 2 million PET and PET/CTs are done per year in the U.S. I would not worry about a few mammograms or conventional x-rays used in regular screen or for diagnostic purposes. I would not worry about a single full body CT or single full body PET/CT as they are typically only done when it is thought there is a more significant threat to your life or QOL from something else.          ",
      "MessageIndex": 9,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866325",
      "Title": "All That Radiation! Roxanne218 marijen"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 09:42AM WC3 wrote: Lula43: I'm aware of that center but my insurance only covers my state as far as I am aware.",
      "MessageIndex": 7,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 15, 2018 04:48AM WC3 wrote: NotVeryBrave: I tried to find out if the issue was particular to this PS as he does a lot of other types of procedures as well or if it is a department wide thing but didn't really get a direct answer...I'm not sure if she has direct access to the other PSs schedules. I do know I don't have enough tissue at the moment for what we wanted to do so maybe that is one reason he wanted to push out farther but I would rather get the cancer out sooner and do reconstruction later if that is the case.",
      "MessageIndex": 14,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 26, 2018 03:30PM - edited Jul 26, 2018 03:44PM by WC3 Jadedjo: Sorry about the news. Do you know what the grade is and when the receptor typing will be back? Can you call a breast center directly and explain your results and see if one can get you in sooner? Perhaps there is a member in your area who can help you expedite the process. When I originally couldn't get an appointment for an MRI for three weeks (which you need an order for in the U.S.) I called other facilities, found one that could see me sooner, called the breast surgeon's office for the order and then the receptionist and I argued about it for a while until eventually they said they would give it to me but by then my sister had called another breast surgeon I had consulted with and they had placed an order and had already set up the appointment.",
      "MessageIndex": 3,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866193",
      "Title": "Saw doc today. Jadedjo Jadedjo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 3, 2018 07:30AM WC3 wrote: Mine isn't stage 1 but I was 36 when I was misdiagnosed and 38 when I was properly diagnosed.",
      "MessageIndex": 908,
      "PostDate": "03/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 17, 2018 11:09PM WC3 wrote: Gingermiss65: An EMG is an electromyogram. It's a test where they stick a little needle in to your muscle and can see/listen to the electrical signals in them and detect any abnormalities or look for signs of myopathy.",
      "MessageIndex": 4,
      "PostDate": "17/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867242",
      "Title": "Not Neuropathy, Loss of Muscle? Gingermiss65 Gingermiss65"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 16, 2018 04:29PM WC3 wrote: If I have a lumpectomy I will have to have radiation, which I don't want for a number of reasons. Delicate skin, potential heart damage, the fact that I have been exposed to non negligible levels of radiation already due to a set of circumstance s. I also have a family history of bilateral breast cancer and I have very dense breasts...in fact my cancer was misdiagnosed for two years. By not removing the other breast I am taking a chance of getting cancer in it and having it missed again. ",
      "MessageIndex": 3,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867240",
      "Title": "Why majority choose mastectomy not lumpectomy?? Danaqtr Bagsharon"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 12, 2019 07:43PM WC3 wrote: I had a lot of chest soreness after my first and third port placement.",
      "MessageIndex": 4,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/147/topics/869305",
      "Title": "Pain after testing is this normal? gkidsnana gb2115"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 24, 2018 01:19AM WC3 wrote: I begged for Neulasta, and good thing too because my CBCs took a dive and my neutrophils dropped into the neutropenia zone weeks after my final infusion when the Neulasta wore off. I didn't have more than minor aches and pains with it...I did stay in bed those days though and I think that helped.",
      "MessageIndex": 6,
      "PostDate": "24/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/868972",
      "Title": "Refusing Neulasta JennieKeaton NotVeryBrave"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 28, 2018 10:07AM WC3 wrote: I had a palpable lump that I could feel just fine but others had difficulty feeling, my doctors thought it felt normal, and I was told was normal breast tissue after a mammogram/us. I should have been sent for an MRI instead because that lump turned out to be cancerous and was allowed to grow untreated in in body for almost two years and I can see it on the first mammogram but apparently I have dense breasts. A lump that is suspicious to you but has not been seen should never be designated as benign. Demand an MRI or see another breast surgeon for a biopsy and do not be afraid to help them find the lump.",
      "MessageIndex": 4,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866872",
      "Title": "Should I get a second opinion? Dancing_on_the_moon Erinashley19"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: This Post was deleted by WC3. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867739",
      "Title": "OMG he's sick and I'm immunocompromized! WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 08:59AM WC3 wrote: Sadlynews2018: I have seen the 3D nipples. I intend to have the 4D ones, which are reconstructions.",
      "MessageIndex": 12,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867148",
      "Title": "Single or Double Mastectomy Advice?? Megsed kista"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 26, 2018 07:17PM WC3 wrote: Jadedjo: Can you go to a facility in a different city? Are there breast cancer support groups in your area or breast cancer support organizations or charities that are active in the region or provide services in Canada that can assist with treatment related things you can't afford? I would try to really make use of any resources like that that might be available. Is there any place in your area with free wifi/internet access? If not, one thing you might look in to are small 3rd party wireless providers. They buy space on the towers of larger carriers and often offer cheaper rates but don't advertise widely. Here are some links you might find useful: Canadian Cancer Society Support Services Breast Cancer Society of Canada Here is a page of links to Canadian Breast Cancer Resources Canadian Breast Cancer Organizations ",
      "MessageIndex": 11,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/866193",
      "Title": "Saw doc today. Jadedjo Jadedjo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 1, 2018 05:10PM WC3 wrote: That fellow would have caught my cancer that the radiologist at the breast imaging center misdiagnosed.",
      "MessageIndex": 3,
      "PostDate": "01/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866954",
      "Title": "I learned an important lesson with this scare madalaine CindyNY"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 6, 2018 06:56PM WC3 wrote: I'm getting a BMX for multiple reasons. If I had a lumpectomy... 1. I would need most of the breast reconstructed so doesn't really make sense to keep it. 2. I would need radiation and have been exposed to a lot of radiation this year already. 3. I may have a high local recurrence risk. If I had a unilateral mastectomy... 1. It would be difficult reconstruct my the new breast such that it matched the healtht one. 2. There is a history of bilateral breast cancer in my family so if I am taking off one, I might as well take off the other one, get matching reconstructions and eliminate my chance of having breast cancer develop in the \"good\" breast. 3. I have dense breasts and my breast cancer was misdiagnosed the first time. It could happen again in the \"good\" breast if I keep it and it might not be caught in time....maybe this time it wasn't caught in time?  The reasons for me not to get a BMX would mainly be the risks associated with such a big surgery and the fact that trauma can \"wake\" dormant cancer cells that have metastastic capabilities. The potential for this may be minimized with the use of anti inflammatory drugs during surgery, which my doctors are willing to try. I may have done a lumpectomy though if my cancer had been properly diagnosed the first time when it was small.",
      "MessageIndex": 7,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867604",
      "Title": "Uni or double Samnjb MCBaker"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 6, 2018 08:18PM WC3 wrote: Samnjb: One of them is goes by the generic name Ketorolac. There is a bleeding risk associated with it so different facilities or surgeons might be wary about using it in some instances but by chance, they actually use it as a standard post surgical anti inflammatory at the facility I am having surgery at if a person's platelets are high enough.",
      "MessageIndex": 9,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/867604",
      "Title": "Uni or double Samnjb MCBaker"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: So my breast surgeon and myself wanted to do surgery within 4 weeks of my last infusion but I decided it would be wise to schedule 5 weeks out from my currently scheduled last infusion because I have had problems with low platelets and there is a chance my last infusion will be delayed by a week like the previous two. If it isn't, I would have surgery 5 weeks after, which I am ok with. They want to do immediate reconstruction to minimize complications. The plastic surgeon, however, said he schedules 6 to 8 weeks from the last infusion. Not thrilled but would do 6 max. I got a call from his scheduler bumping this to 10 weeks out!!!! I told her I was NOT ok with that! She finally said the soonest she could give me was just under 7 weeks out and tried to play this off as being in my best interest. I see this as dishonest and am not ok with that. My cancer is grade three, poorly differentiated and aggressive and I have have increased vascularity in my bones that make them easy for micromets to get to. My platelets completely recover 4 weeks out from my last infusion and are in the middle of the normal range by this point. Maybe this cosmetic surgeon is a good one but I am not comfortable with the time frame and do not appreciate the scheduler trying to pass this off as being in my best interest when I know it is not. I am considering going with a different cosmetic surgeon who can do it sooner. The catch is, I will likely have to go with a new breast surgeon and will likely have to transfer centers if I do this. If I go with a different cosmetic surgeon within the same system it would have to be with a colleague of the first and I worry that will cause hostilities against me and I don't want someone who dislikes me doing surgery on me ( I had a bad experience when shopping around for MOs somewhat related to this). So I am inclined to just leave the system for the surgery even though I like the breast surgeon and don't really want to have to do this. My other option is not doing immediate reconstruction. I don't care about being flat for a while but they believe it will make reconstruction more difficult. Opinions? Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 06:44AM WC3 wrote: NancyHB: I'm on Neulasta so my neutrophils and WBCs are the only things that have stayed up during chemo. The main concern would be my platelets but they come back up by week 4 after my chemo infusion. I was actually in the hospital before starting treatment, with a tube in my chest due to lung issues and it was very easy to see how someone can get an infection. It was very difficult to keep the tubes off the floor when I had to use the restroom and sometimes the tubes that had touched the floor would touch the bed sheets and I had to ask for my sheets to be changed a few times to avoid the contaminated bed sheets from making contact with my incisions. It seemed like I could do a much better job of keeping things clean at home but I was plugged in to a suction device in the wall. But I'm sure a lot of infections start in the OR. By week 4 after my infusion I am starting to feel back to normal. I'm anemic but my platelets arw fine and I can do a slow 2.5 mile walk. By 5 weeks I think I would be back to normal but so would the cancer cells.",
      "MessageIndex": 5,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 14, 2018 10:29PM - edited Sep 14, 2018 10:39PM by WC3 I spoke to the scheduler today and she told me that this is a busy season for surgeries for some reason, and the BS wanted 4 to 6 weeks past my final infusion and the PS wanted 6 to 8 weeks or possibly longer in to December, and the compromise was 7 weeks. If my final chemo gets delayed due to low platelets, as the previous two have, that will make the time between by final infusion and surgery 6 weeks, which is within the time frame the BS wants. There is some evidence that around 6 weeks might be best for those doing neoadjuvant chemotherapy and I am fairly anemic even at 4 weeks out from an infusion and my healing has been slow so maybe I do need more than 4 weeks to recover from the chemo. I also spoke to my chemo nurse and she thought it was better to do 6 to 7 weeks than schedule 4 weeks out and have to cancel it due to low platelet problems and risk not getting another date quickly. I'll run it by my MO at my follow up.",
      "MessageIndex": 13,
      "PostDate": "14/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867195",
      "Title": "We are not happy. WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: I had my BMX Tuesday and until yesterday, just had the standard soreness, but last night I suddenly developed a searing/pinching pain in the upper corner of my torso when I move my arm on that side or sometimes even stand in a particular way and this is really hanging me up. I'm wondering if the TE or drain might have shifted and is hitting a nerve. Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/868495",
      "Title": "Sudden searing/pinching pain after BMX with TEs WC3 WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Dec 22, 2018 11:06AM WC3 wrote: I like to know things so I would find out what genes you had tested specifically and see if there are any newer known genes they did not test.",
      "MessageIndex": 3,
      "PostDate": "22/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/868953",
      "Title": "Family history of breast cancer and new information. Smdelve Smdelve"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 29, 2018 09:42AM - edited Sep 29, 2018 09:45AM by WC3 mommck3: Have you talked with a conventional oncologist about this? When I asked mine if people ever had more than the standard 6 infusions of my chemotherapy or had any after surgery (I am having neoadjuvant chemotherapy...chemo before surgery) she said sometimes in instances where there is remaining cancer.",
      "MessageIndex": 1,
      "PostDate": "29/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867503",
      "Title": "Post chemo and still have cancer cells mommck3 Meow13"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jul 22, 2018 09:19PM WC3 wrote: I'm on TCHP. So far different variations of the same each time. The first cycle I had bad mouth irritation which I have not had since though. Day 1 sleep after the infusion...bad taste in mouth. Day 2 Muscle fatigue, reflux, red face, slightly swollen feet. Morning nausea, take zofran. Day 3 Sore esophagus, food is bland, \"scratchy\" and irritating. Day 4-7 Stomach cramping starts. Basically after this point my main concern becomes access to restrooms. I start to feel normal a few days before the next infusion and want to eat a lot, but my normal time window is getting smaller. I figured out how to get rid of the bad taste and I think I would feel a lot better if I could get more calories into me. All in all it hasn't been the most horrible experience of my life, but it's not fun either. One thing that's compounding my misery, is I've had to cut out some foods because of the type of cancer I have and the fact that ",
      "MessageIndex": 8,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/865874",
      "Title": "Please tell me chemo gets a bit easier dlittkemann WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 13, 2018 09:02AM - edited Sep 13, 2018 09:17AM by WC3 I have decided to do a bmx. I don't like cutting off healthy tissues but I feel that \"bad idea\" feeling when I consider keeping it. My paternal grandmother had breast cancer at the same age as me and did not have a recurrance but developed an \" entirely different\" breast cancer a few years later in her remaining breast. My second cousin on that side also has breast cancer. I do not know if she had it in both breasts but my great aunt on the other side did and possibly my great grandmother, also in her 30s or 40s. I apparently have \"very dense\" breasts and my cancer was misdiagnosed as benign the first time I had it imaged after finding a lump. So my breasts may just be prone to cancer in general even though I tested negative for mutations on a little over 30 genes tested. Additionally, despite my own vigilance, my cancer was originally missed/misdiagnosed after the first round of imaging. The breast cancer concordance rate among identical twins is low, interestingly, even when there is thought to be a genetic componant (other than BRCA1/2 mutations) but this isn't surprising because we see a lot of variation between twins in genetic tumor causing conditions, for example neurofibromatosis. In neurofibromatosis type 1, one copy of the bad gene is inherited, and for symptoms to manifest, the person must have the second \" good\" copy of the gene in some cells acquire a bad mutation. Additionally, epigenetics, the phenomena of genes being on or off, probably plays a part. When twins are born, they have most, but not all of the same genes on and off. The older they get, the greater the difference in their epigenome becomes due to natural variation, lack of a synchronicity, and different environmental factors, most probably minute. The functioning of the genome becomes quite heterogenous and even when a tumor associated genetic factor is present, it can be either directly or indirectly modulated by other genes and environmental factors which, even in conditions like neurofibromatosis, when both twins have the disorder, they do not necessarily have the same tumors in the same exact places. I don't want to cut off my good breast but I know six things. 1. My body facilitates breast cancer. 2. I have a family history of breast cancer in both breasts, at least one was not a recurrance but a second cancer. 3. I have dense breasts, making breast cancer more likely to develop and more difficult to find/spot. 4. Too many radiologists aren't as good as they should be (I conclude this not just from my own misdiagnosis but other instances of radiologists missing very obvious things with other family members...brain tumors, liver lesions, etc. 5. My cancer was missed due to 3 and 4 despite me finding a palpable lump and being concerned enough to have it checked. It almost killed me, might still kill me, and another miss in the future can kill me. So can surgery but now I have to have that anyway. 6. I controlled for most of the environmental factors that I could to prevent breast cancer. My grandmother and I have vastly different lifestyles and had vastly different pre cancer diets. I excersized regularly, ate no red meat and very little poultry...I was a vegeterian from the age of 10 to 20. I ate a ton of cruciferous vegetables...at least from 20 onward, some turmeric even though I don't like it, a fair amount of anti oxidants. I ate a low glycemic diet and was actually was close to dairy free for a number of years in my early 20s. I got cancer anyway. What else could I have done that I could reasonably have known to do? Now I have the option of removing the \"good\" breast and doing so is the only other thing I can do to take an active role in preventing cancer in it. True tamoxifen might reduce my chances of developing cancer in that breast but by how much really? And I may not be able to safely take that without a hysterectomy. If I had reason to believe my breast cancer was an entirely random fluke, had no compelling family history, and I had fatty breasts rather than dense breasts, I would keep the other breast.",
      "MessageIndex": 5,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867148",
      "Title": "Single or Double Mastectomy Advice?? Megsed kista"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 15, 2018 10:07AM WC3 wrote: If my mother and her mother had breast cancer, and both tested positive for a breast cancer associated mutation, I would have been tested as well and would have had also tested positive, I would have had a prophylactic BMX if it were within my reach. If everyone tested negative, I would also want a prophylactic BMX given the history and the possibility of an undocumented gene mutation. ",
      "MessageIndex": 5,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/866433",
      "Title": "Strong Family History...How do you deal with stress? ne0n WC3"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 27, 2018 09:26PM WC3 wrote: Vickki: I also wasted a ton of money on food I couldn't eat. I have my last infusion next week and then surgery a few weeks later and then I am going to spend the holidays fulfilling one of my life long fantasies; eating without restraint.",
      "MessageIndex": 5,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Jan 15, 2019 05:32AM WC3 wrote: Shellsatthebeach: I also craved mashed potatoes but my expectations were usually different than reality.",
      "MessageIndex": 12,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "May 18, 2019 08:35PM WC3 wrote: That sounds odd that he said not to mention it to anyone. At the facilities here the schedulers ask if you haveva lump. If you do, they will only schedule a diagnostic mammogram, which includes an ultrasound.",
      "MessageIndex": 4,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/871602",
      "Title": "Am I going about this the right way? dannysgirl djmammo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 15, 2018 12:31PM WC3 wrote: I didn't find mine in the shower but it was in a similar fashion. It's often said that malignancies are more likely to feel fixed but from at least one angle, mine did not, and whether or not a lump feels moveable shouldn't be used as a conclusive diagnostic technique.",
      "MessageIndex": 2,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/867781",
      "Title": "a bit concerned and I don't want to worry anyone I know jsdbsn Astrid"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 27, 2018 07:19PM WC3 wrote: Vickki: Funny you should mention pizza. I wasted two entirely good peices the other day. I have most of my taste back but for some reason they tasted really salty.",
      "MessageIndex": 2,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 10, 2018 02:59PM WC3 wrote: Last time I walked in to the hospital I only expected to be there for a few hours and ended up staying a few days with tubes in my body. I found myself wishing I had packed some clean changes of underwear and had an irrigation bottle..the kind with the bent nozzle and that can be squirted upside down, to clean myself off easily on account of the fact that I did not have access to a shower and they would only give me wipes to wipe down with unless I wanted a nursing assistant to give me a sponge bath. ",
      "MessageIndex": 4,
      "PostDate": "10/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867102",
      "Title": "Surgery and hospital newbie - help me decide Spiritedcharm Spiritedcharm"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "WC3 wrote: I’m curious to know what tastes/tasted good and bad to people during chemotherapy. I’ve discovered when I am at my “taste nadir” meaty things taste the worst to me and lemony or marinated things and sweet things taste the best to me. The catch is, sometimes I still have an irritated tongue and can’t eat the marinated and lemony things, of course Dx 2018, IDC, Left, 3cm, Grade 3, ER+/PR+, HER2+ (FISH) Chemotherapy 5/31/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Surgery 11/14/2018 Lymph node removal: Left, Sentinel; Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Targeted Therapy Perjeta (pertuzumab) Targeted Therapy Herceptin (trastuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/867453",
      "Title": "What tastes good and what tastes bad? WC3 Parrynd1"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Oct 21, 2018 08:47PM - edited Oct 21, 2018 08:53PM by WC3",
      "MessageIndex": 1908,
      "PostDate": "21/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Sep 8, 2018 09:35PM WC3 wrote: Jadedjo: Sorry to hear the doctors' office is not up on their game. Is there an office manager or a director you can speak to about the quality of care? If they are not scheduling according to guidelines, those who oversee the office should be made aware of it.",
      "MessageIndex": 4,
      "PostDate": "08/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/867073",
      "Title": "Got a tentative surgery date and I'm pissed Jadedjo Jadedjo"
    },
    {
      "AuthorID": "WC3",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275801/profile",
      "Content": "Aug 10, 2018 01:39AM WC3 wrote: laralee1955: I'm also on TCHP and had to deal with bad tasting water. I discovered that in my case it was from the anti nausea medication...IV Aloxi, and to a lesser extent, Zofran, not the chemotherapy. I am going to try Emend for my next infusion. Before I figured this out though, I found Lime flavored La Croix sparkling water tasted ok to me. It's typically too bitter for me when my taste buds aren't impaired.",
      "MessageIndex": 19,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/858362",
      "Title": "Completed 4 of 6 chemo cycles and want to quit Toughcookie lulabella"
    }
  ]
}