{
  "AuthorID": "we2texans",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79224/profile",
  "Posts": [
    {
      "AuthorID": "we2texans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79224/profile",
      "Content": "we2texans wrote: I got my follow-up mammogram and ultrasound radiology reports back today and am very grateful for the words BI-RADS category 2 - benign findings. However, after looking through these boards, and with the fact that my mother is a two-time breast cancer survivor -- I am not convinced that I should not have one or more of these cysts biopsied. Would some of you mind taking a look at this report and telling me your opinions? Should I accept this as great news and not be concerned -- and schedule my annual mammogram for next February? Or should I be a bit more cautious and maybe talk with someone (who?) about taking a biopsy of cyst(s) in each of my breasts? I have followed many of the stories of many of you on this forum -- and my heart goes out to all of you and I have the most positive thoughts for the best possible outcome for each of you. Thank you. June Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729042",
      "Title": "Both breasts chock full of cysts -- should I be concerned? we2texans we2texans"
    },
    {
      "AuthorID": "we2texans",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79224/profile",
      "Content": "Feb 16, 2009 07:51AM - edited Feb 16, 2009 07:52AM by we2texans Thank you for the replies, Ladies. It's not that I don't trust in the good people who have taken and read my tests -- or that I am not believing there is no cancer. Truthfully, I am just scared -- and my mother -- who has had breast cancer twice is just beside herself with fear that her oldest of two daughters is showing symptoms similar to what she had prior to being diagnosed. My mother's cancer was 30 years ago -- she has no referrals for me as far as BS go. I have terrific medical insurance that does not need a referral to see a specialist -- I will try different avenues to try to find a BS that comes highly recommended. Are there any websites that might help with this selection process? I do have one co-worker who is currently undergoing treatment, but she has been a bit quiet and reserved throughout her battle. I do not want to make her feel uncomfortable in the least if she just does not want to talk with people who are not close friends or family. Is there a correct way for me to approach her with this topic without seeming insensitive or nosy? I would hate to say anying that might upset this sweet lady. One other fear I have is that with all these cysts I will not be able to determine through self exam if any new ones come up, or if one or more is changing. Truly, I feel like I need to laminate the US report and put it in my shower to guide me around all the existing lumps -- sort of like a roadmap. I don't want to be taken as being paranoid and dismissed -- but I have promised both my mother and husband that I would do my best to get another opinion. Again, thank you for your responses...truly apprecaited! June",
      "MessageIndex": 5,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729042",
      "Title": "Both breasts chock full of cysts -- should I be concerned? we2texans we2texans"
    }
  ]
}