{
  "AuthorID": "WellWishes",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
  "Posts": [
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 6, 2017 06:13PM WellWishes wrote: Hi everyone. I hope that you are all healing and starting to feel better. I am doing a bit better this week; thankfully. I had my appointment with the PS yesterday and he took the tape off of everything; which felt like ripping off a Band-Aid in a really sensitive spot. lol... I am sure you can all relate. The BEST part though was that he told me I didn't have to wear that support bra anymore unless I wanted to. Yay!! On one hand, it is nice to have the extra support but oh my gosh, I was so tired of having that thing on 24/7, I could scream!! Still have the drain tube but the amount is gradually getting less and less. My doc won't remove until it is under 20ml for a couple of days so who knows. I was so mad this morning... I had emptied the bulb into the measuring thing and put it on the counter while I slung the bulb and tubing back over my shoulder. Somehow, I accidentally hit the cup and knocked it into the sink before I could measure it. :( Bahhh, so I just had to guess that it was about the same as yesterday; which is still averaging like 35-38ml per day. It feels like it will be forever before I will get below 20ml. Ugghhh! PS said that his results came back all clear but the oncologist hasn't received the results from that side yet so I am still waiting to hear back on what is next and etc. Gentle hugs to all. :)",
      "MessageIndex": 325,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 8, 2017 01:54PM WellWishes wrote: My heart literally hurts for all of us; especially after reading your results Lisa. I am so sorry.  I had my surgery on Aug. 25th and still waiting for pathology results and still have the drain tube. Ugghhhh!! I am praying/begging/pleading that everything comes back clear!",
      "MessageIndex": 344,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 8, 2017 06:46PM WellWishes wrote: Hi ruth. I certainly have a few of the well-meaning friends. My sister has been the one who has frustrated me the most during this though. IE: I have barely seen her, she doesn't call to check up (I have to call her), she hasn't really helped me at all... but she talks to all of her friends about it like \"we are going through this together!\" Hi beach... mine was diagnosed as ILC from the biopsy; which might be why my pathology results are taking (what seems like) extra time. *It is a sneaky bugger and they have to look more carefully for it because it is harder to see, from what I understand. ",
      "MessageIndex": 347,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 11, 2017 02:51PM WellWishes wrote: I loved your rant MrsWinnie and I don't think I could agree with you more. Ohhh, how I can relate to the electrical shocks felt every single time my shirt brushes over my chest. I now feel every step that I take when I walk... in my chest; which is weird. I can't stand up straight comfortably yet and if I lift my right arm (non-cancer side) too high... it feels like my boob is going to burst open. *PS did a lift and reduction on the right side so I am cut underneath, up the center, and around the nip on that one. The left side looks like someone punched my boob in. lol... I think my left side is more sensitive to touch whereas the right side hurts from the stitches/cut. They finally called me Friday with my results... all margins clear, lymph nodes 0/1. and sounded very positive. I have an appointment scheduled with the PS and Onc next week sometime so I guess I will find out what comes next at that appointment.",
      "MessageIndex": 357,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 18, 2017 07:38PM WellWishes wrote: Hi everyone. I am really sad to hear that MrsWinnie. :( I have an appointment with the surgeon and oncologist on Thursday; a little nervous about that but hopefully all goes well. My big thrill for today is that I am FINALLY cordless!! Thankfully, I got my drain removed first thing this morning. I was so sick of dragging that thing around, I could scream. It didn't really hurt at all coming out; just burned a little when he snipped the stitch but it has been burning SO bad non-stop anyway... it didn't really matter.",
      "MessageIndex": 410,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 19, 2017 06:17PM WellWishes wrote: Oh yeah, forgot to mention that I had my first fill yesterday; 50cc which brings me to 250cc (half-way there if I understood the paper correctly). It hurt a bit when he put the needle in but couldn't feel much else. Last night though, I guess as the weight was re-adjusting, the whole TE side was pretty achy and still is somewhat today. Not terrible... just somewhat annoying, like it is reminding me that it is there. Highlight today... SHOWER!! Holy mother of glory, the water felt both amazing and creepy at the same time. It hurt a little when the water hit the \"reduced breast\". I assume because that thing is tied up tighter than a balloon. The mastectomy side just felt really weird when the water hit it; it has an odd combination of dead spots and hyper-sensitivity. I was trying to make sure that the water didn't get in the drain hole too much but I also needed to shave my armpits. That is the highest I have raised my arm in over 3 weeks! Driving is strange too. I was able to drive for the first time yesterday and I usually always tuck my seatbelt under my boob. Well... that doesn't really work anymore cause I don't have much boob on that side to tuck under. lol... I also can't really use my left arm much to steer; just kind of to assist my right arm with turning the wheel. *I am sure that is not the safest thing in the world but it was like SWEET FREEDOM, I can drive again!!! Hope everyone is feeling better today. One day at a time... hugs. :)",
      "MessageIndex": 415,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Aug 28, 2017 03:02AM WellWishes wrote: Had my surgery on Friday, Aug. 25th; mastectomy on left with reconstruction, sentinel node biopsy, and right breast reduction for symmetry. Surgery went really well... so well actually that I didn't even stay overnight. Doc gave me the option of staying or going home so I decided to go home. *I would estimate my hospital stay at approx. 9 hours. Yesterday, I felt pretty good and did a lot more than I should have. Today, I woke up regretting that for sure... really sore today. Mostly just feels bruised and I can feel the cuts. Hope everyone else is doing well.",
      "MessageIndex": 255,
      "PostDate": "28/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Aug 18, 2017 08:58AM WellWishes wrote: Hi beach... thank you so much for your reply. Is the Oncology score something that comes from the path results?",
      "MessageIndex": 150,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 1, 2017 11:08AM WellWishes wrote: Thank you so much for your reply. I cannot even imagine what you (and others) must have been going through with multiple drain tubes at once. Bless your heart!! This one has been bad enough. :( I finally got my hair washed yesterday. Wow, that felt amazing. I hope that everyone else is having a good day today! Well wishes for all!!",
      "MessageIndex": 293,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Mar 20, 2018 01:01AM WellWishes wrote: Good evening to all. I hope that everyone is doing well. My reconstruction experience has been a nightmare and I am back to being flat again (2nd failed TE removed last Monday). *Honestly, I am leaning towards just staying flat at this point but doc is pushing me to keep trying. Original surgery Aug. 25th with immediate TE placement, got an infection in Nov. and had to have the first TE removed. The PS replaced the TE with a different kind on Dec. 19th and I had the drain until Tuesday, March 6th. PS decided he just needed to pull it due to infection risk; even though it was still slightly above the 20ML per day recommended. Within 2 days, I had redness and called PS who asked to see me first thing Monday, March 12th morning. Over the course of that weekend, it swelled up REALLY bad, was super red and just looked like it was going to explode at any minute. As soon as PS seen me on Monday, he pulled me into emergency surgery to remove the TE again. I have an appointment with him tomorrow and he is going to discuss the type of infection, next steps, etc. I am just over it. I am sick of surgery and just ready to give up!",
      "MessageIndex": 553,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Aug 18, 2017 08:55AM WellWishes wrote: Hi DallasDuck... I am not entirely sure what they decided on Grade level because I had another spot that was biopsied (came back benign). I want to say that the MRI showed Grade 1 but it might be a Grade 2. I had genetic testing done; went with the \"happy medium\" (17 genes + BRAC1 and BRAC2). All results came back negative. Thankfully, so this shouldn't have gotten passed down to my children! Whew!!",
      "MessageIndex": 149,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Jan 10, 2018 07:51PM WellWishes wrote: Hi everyone. I hope that this finds you well and everyone had a great holiday season. I need to vent a little about mine.. even though, I honestly feel ashamed for even complaining at all considering that my issues are nothing in comparison to others. But... nonetheless, it will make me feel a bit better and maybe help someone else. I had a mastectomy (left) with tissue expander placement and reduction (right) on Aug. 25th. I only had one drain but it was a really long time (probably 4-5 weeks) before it was ready to be removed. The doc started doing my fills and got me to the point where I was at 400cc and had only 2 more fills to go!! I was scheduled for my exchange surgery on Dec. 19th when, all of a sudden, it just had a \"blow out\". *I was working and noticed that my shirt was ABSOLUTELY DRENCHED all the way down the front. When I went to the restroom to take a look... I couldn't even believe what I was seeing. It was oozing the nastiest stuff and I had a hole in my breast about the size of a quarter. *You could actually physically see the tissue expander. I called the doc and explained what was happening and he asked to see me the following Monday (this happened over the weekend). When I went to his office, he said that I had a failed tissue expander due to infection and needed to have emergency surgery the next day to have the expander removed. He still wanted to keep my exchange surgery date though since I was so close and was hoping to get the implant on Dec. 19th. However, when I had this surgery, he decided to put another tissue expander in (back @ 200cc.. ugghhhh!!) and another drain. Fast forward 3 weeks later and my drain is still WAY too high to be removed and I have already had another issue with redness (potential infection again) that he treated with antibiotics and steroids. I am just sad and disappointed. Will my body even allow this to happen? Has anyone else had any experiences with infection and/or tissue expander blow out? :( I am ready to give up and tell him to take it back out and just leave it empty. ",
      "MessageIndex": 531,
      "PostDate": "10/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Mar 20, 2018 12:38PM WellWishes wrote: Hi MrsWinnie. Thanks for the response, caring and hugs. :) I really appreciate it. I am just frustrated with all of the surgeries and nervous about my first upcoming mammogram on the right side since all of this started last June. *I almost wish I had just gone with a total MX instead of just left side and then left them alone. *No reconstruction. I don't think many people would notice either; they don't now and I am half-flat but I am pretty good with putting cushioning on one side of a bra (when needed) so they look even. I wonder if I can just leave it alone now? *Or, do I have to have more surgeries even if I decide not to do another TE and/or implant? Trying to get a straight answer from my doc but he just keeps saying that he doesn't want to give up.",
      "MessageIndex": 555,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Aug 17, 2017 12:20PM WellWishes wrote: Hi, I am new to the site as well. I am 42 years old, diagnosed with ILC (infiltrating lobular) and I am scheduled to have MX with sentinel node biopsy on Aug. 25th. I am scared out of my mind about all of it. The surgery. Path results. Next steps. etc.. I was diagnosed in mid-June so it hasn't been too long of a wait but I am certainly ready to get it over with.",
      "MessageIndex": 144,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    },
    {
      "AuthorID": "WellWishes",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/254854/profile",
      "Content": "Sep 1, 2017 07:54AM WellWishes wrote: Hi, today marks one week since my surgery. I am feeling a little better but the past few days were really tough. *I spent 2 days laying in bed with terrible stomach cramps from constipation. Then, when that was finally relieved, I just couldn't stop crying. I cried like a baby for hours on end; sometimes, I wasn't even entirely sure why I was crying anymore. I wish I could say that it helped to let it out but it just gave me a headache and made everything just hurt more. I really wish that I could get the drain tubes removed. Does that process hurt? Unfortunately, I think I am stuck with them at least over the Labor Day weekend because I am still over 30ml per day. Doc said that they could be removed when I have 2 consecutive days of 20ml or less. I haven't had any post-surgery checkups yet. My first checkup with the plastic surgeon is on Tuesday and the oncologist said that they will schedule my checkup when they receive the path results; which could take 7-10 days. Ugghhh...",
      "MessageIndex": 291,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856126",
      "Title": "August 2017 Surgery Group MommyErin rljes"
    }
  ]
}