{
  "AuthorID": "WendyTY",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
  "Posts": [
    {
      "AuthorID": "WendyTY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
      "Content": "Oct 31, 2008 01:58PM WendyTY wrote: Hey All, I finished my second to last chemo today!!!!   I so excited that it will be over next week.  I will still have the herception for a year.  But, I will be glad to celebrate the end of chemo.  I hope you are all feeling well and enjoying the good times. Debbi5108 - I sent you a PM Nancy - I just got home from my benadryl induced sleep.  It is a much better to experience chemo sleep than sit around for 3 hours. debragohn - Congratulations of completing your chemo!  Hopefully the hard part is over.  I sent Debbi5108 some info on surgery if you are interested let me know. Happy Halloween!",
      "MessageIndex": 14,
      "PostDate": "31/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    },
    {
      "AuthorID": "WendyTY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
      "Content": "Nov 6, 2008 06:32PM WendyTY wrote: Keep counting down.  It will ended quicker than you expect.  I never thought I would be going to my last chemo tomorrow!  I'm actually going to miss seeing the girls at the center every week.  But...I definately won't miss the chemo.  I got what hopefully is my last shot to boost my counts today.  I'm a little concerned about how my counts will turn out tomorrow morning.  I haven't been feeling the greatest.  I think I'm fighting off an infection.  Debbi it was great to talk to you on Sunday.  I was wondering how your last treatment went.  Taxol does seem to be a little unpredictable.  Chemo brain...I think I slept better after I reached the half way point.  Until that time, I was bouncing off the walls.  I remember coming home and cleaning the carpets.  My husband thought I was nuts.  I couldn't stop myself.  I better go, I'm making a hoho cake to take with me tomorrow to celebrate another milestone! Hope everyone is doing well.  Keep fighting!",
      "MessageIndex": 17,
      "PostDate": "06/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    },
    {
      "AuthorID": "WendyTY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
      "Content": "Nov 10, 2008 09:15AM WendyTY wrote: Congratulations Springtime!!!",
      "MessageIndex": 20,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    },
    {
      "AuthorID": "WendyTY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
      "Content": "Oct 16, 2008 10:07PM WendyTY wrote: I've had 4 AC and 8 of 12 Taxol.  I would say that overall Taxol is much easier than AC.  I did have a few problems that were not typical with Taxol at the start.  I initially thought that it was nausea.  Unfortunately my onco was on vacation when I started having problems.  However, it ended up being heartburn and he prescribed Prilosec OTC.  It took care of the problem and I have been feeling great.  I'm playing golf, walking, and doing normal things again.  I've had a little bone pain off and on.  This week I started to have numbness and tingling in my hands and feet.  Knowing that I only have 4 weeks left makes it all easier.  Exercise/activity seems to make me feel better.  Taxol is definitely doable and much better than AC. As far as hair goes, mine started growing back in about three weeks after my last AC.  But my eyebrows and eye lashes fell out about the same time.  It seemed like they started growing back as soon as they came out.  It's been 8 weeks and I have about an inch of hair.  It seems to be holding and my onco said it wouldn't fall out again.",
      "MessageIndex": 7,
      "PostDate": "16/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    },
    {
      "AuthorID": "WendyTY",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66645/profile",
      "Content": "Oct 28, 2008 04:13PM WendyTY wrote: Debbi5108 - Hope your taxol continues to go well.  I have two left and I can't wait for it to be over.  My white counts bottomed out last week.  But, the shot seems to be working so hopefully I will stay on schedule.  For the most part, I am feeling pretty good.  The hair growth is so exciting!  I was diagnosed with stage 2b with 2 nodes positive.  I had a masectomy.  I actually think that the chemo is harder than the surgery was.  I had some complications with healing.  Start looking for some button down shirts.  I had a horrible time trying to find some this spring.  Have you decided on recon?  I had an expander placed and will have the final surgery in Dec/Jan.  My onco put me on Ativan.  I sleep like a baby. ",
      "MessageIndex": 9,
      "PostDate": "28/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/722706",
      "Title": "4 rounds of AC and want to skip Taxol lucky8 Springtime"
    }
  ]
}