{
  "AuthorID": "weshallsee",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140411/profile",
  "Posts": [{
    "AuthorID": "weshallsee",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/140411/profile",
    "Content": "Jul 18, 2015 02:37PM weshallsee wrote: Ariom, I would just like to say that I too have exactly all the same symptoms as itchy woman. For two years I went from doctor to doctor trying to get help. I am extremely sensitive to the sun ... instantly body swells, sensitive to multiple medications, sensitive to multiple foods, constant asthma attacks. Within 10 minutes of entering Doctor offices, clothing and grocery stores my body would swell and I would have difficulty breathing. I have been living in the dark for two years now and cannot work ... I even have problems watching the television ... I seem to be sensitive to visible light ... I cannot watch tv for more than 30 minutes without swelling and coughing. Finally, my second immunologist diagnosed me with angio-edema ... my most obvious swelling was in my hands, feet and groin, but my chest swelled and hurt the most and then my legs. Once I received the diagnosis I started trying to find what I was allergic to I suspected some inert ingredient in my medicine but food also caused me great difficulty. Thankfully reviewing some of my medical records I found out about the titanium clips used by my surgeons. In reconstruction diep flap they used at least 30 to 40 clips to support the blood vessel that will keep the flaps nourished. I asked my allergist to please test me for metal allergies. I was floored when the test results came back .. I was severely allergic to nickel, titanium, colbalt, and chromium and mildy allergic to aluminum. I immediately stopped all medicines with titanium, went on a low nickel diet. I could tell that his was definitely my problem my asthma symptoms eased up considerably, but I still had burning mouth, sun sensitivity and swelling. I used the testing to request the removel of the metal from my body. This was not going to be an easy surgery in fact it was a five hour surgery and the surgeon had to leave in a few clips but ultimately removed more than 30 clips from my body. Pre surgical testing revealed damage to my lungs and even more shocking damage to my mid-spine only (a most unusual place for damage) exactly where all the clips were in my body. I did not have that damage 2 years ago before mastectomy and reconstruction. I am currently a little more than two weeks from removal surgery right now and the swelling in my feet, legs, and groin have disappeared. I still have swelling in my chest of course I need more time to recover from the surgery but the severe pain I constantly had in my armpit where the majority of the clips resided is gone, the horrific muscle spasms around the armpit area gone too. My mouth burning gone except when I eat food with too much nickel which is really hard to avoid. I am still sun sensitive but I'm hoping with time that this will get better. Yes, this is somewhat rare but I believe there are many people out there suffering as I did not able to contribute their symptoms to metal implants because the type IV allergy reactions are delayed and usually occur six months or later after implantation.",
    "MessageIndex": 18,
    "PostDate": "18/07/2015",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813169",
    "Title": "Breast Biopsy Marker Clip Allergy 8y7hrt sas-schatzi"
  }]
}