{
  "AuthorID": "westb2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
  "Posts": [
    {
      "AuthorID": "westb2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
      "Content": "May 17, 2018 07:21PM - edited May 18, 2018 12:06PM by westb2 Thank you all for replying to me. I wish to best to you all",
      "MessageIndex": 984,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "westb2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
      "Content": "May 17, 2018 12:46PM westb2 wrote: Thank you both. I asked my surgeon about seeing an oncologist when I met him before my surgery. He said if I felt better, we could set up a consult with an oncologist but said to wait until after surgery. Now, since my results were benign, he doesn't seem to be worried. He said nothing about an oncologist. He said the best thing to do is self-exams and regular mammograms. I asked if I would then get one in 6 months, he said the radiologist would let me know. I don't have any family history of BC. I did take the pill for 20+ years and did not have children. Should I try to talk to my gynecologist or PCP or just set up a consult with an oncologist? I have the names good local ones. I had a stroke in 2011 so I don't think I would be able to take the medicines. My neurologist and my gynecologist both said no more hormones for me after my stroke.",
      "MessageIndex": 981,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "westb2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
      "Content": "May 19, 2018 10:25AM - edited May 19, 2018 10:30AM by westb2 Thanks cgs! That may be why, they got the microcalcs and ADH. My report says there are still calcs but doesn't say if they are micro or not. I think that after my first surgery, my surgeon is the one who said get mamm in 6 months. He wrote the orders for the first 6 month check and then my gynecologist did after that. But they found microcalcs in that first follow up, if that makes sense. My sister-in-law's fiancé is a prominent gynecologist in the Baltimore area (I live near Pittsburgh). I sent him my reports and he is going to review them for me. There is also a women's hospital in Pgh through UPMC that I may go visit. I feel for you girls with larger boobs. Mine are very small. Other that the scar, my rt boob actually looks better (a little bit smaller) that my left. Kind of like a mini lift, ha ha.",
      "MessageIndex": 986,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "westb2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
      "Content": "May 21, 2018 05:06PM westb2 wrote: I made an appt for 7/5 with Dr. Donald Keenan, breast specialist, Univ. of Pittsburgh Magee Women’s Hospital. He has a lot of experience and is very up-to-date with new treatments, etc. I am very happy. Thanks again to everyone who help answer my questions!",
      "MessageIndex": 987,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    },
    {
      "AuthorID": "westb2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/274132/profile",
      "Content": "May 17, 2018 09:37AM westb2 wrote: Hi! I am dealing with very little compared to most of you but I wanted your opinions. Diagnosed with ADH after needle biopsy on March of this year. Brief history: 3/25/15 - stereotactic guided core biopsy of clustered calcifications in rt breast. DIAG: fibrocystic changes with microcysts. Negative for malignancy. Had mammograms every 6 months after this until 9/16/16 when the micro calcificatins changed 10/11/16 - excision surgery, rt breast. DIAG: Fibrocystic changes with microcysts and micro calcification, negative for atypia or malignancy. My annual mammogram is in March. At next mammogram (3/2/17), there were grouped calcifications in same area. Suggested mammogram on that side every 6 months. 3/7/18 - calcifications changed (increased and varying sizes, some round) 3/13/18 - another stereotactic guided core biopsy. DIAG: ADH 5/1/18 - excision surgery, rt breast, same area as all other issues. DIAG: Columnar changes, focal usual ductal hyperplasia and calcifications. Biopsy changes noted. Negative for atypia or malignancy.  I know this is good news! I was wondering what the normal protocol if after this. My surgeon said the radiologist would let me know when next mammogram would be needed. I called the radiologist office and spoke to the nurse navigator. She pulled up the reports and said that unless I get a letter from them saying to go every 6 months, just go to next annual (which would not be until March 2019). She said there might not be anything they are worried about or watching. From reading these posts and from what I found on-line, I expected to at least have a mammogram on that side every 6 months. I do know it was just a very small area of ADH as the core biopsy got all of the cells. I am just worried about not having a mammogram until March. Thanks you all in advance for your thoughts on this.",
      "MessageIndex": 978,
      "PostDate": "17/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/773927",
      "Title": "ADH Club Chickenpants SarBar22"
    }
  ]
}