{
  "AuthorID": "Whateveritt…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
  "Posts": [
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Jun 28, 2018 10:27PM Whateverittakes wrote: Im using PRMA & I'm very happy with them!",
      "MessageIndex": 22,
      "PostDate": "28/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/856612",
      "Title": "PRMA or NOLA? Needing Info From Experienced Ladies TruffleShuffle Whateverittakes"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Jun 20, 2018 09:09PM Whateverittakes wrote: Cindymb, it may vary depending on the doctor, but for my pre-op I had a EKG, Xray, Pet scan, CBC and metabolic panel check they also confirmed my blood type just in case in needed any blood but I didn't require any. Praying all goes well. Sa",
      "MessageIndex": 22,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 7, 2018 02:55PM Whateverittakes wrote: I was recommended 10 years of it due to my age of 31. I'm only a stage 1b, my oncologist said it doesn't necessarily go by the stage but age. I have a larger increase due to being so young. It's been some stuides that's suggested 10 years is better than 5 & it's needed due to the first 10 years is the highest chance of reacurrance. I'm not sure how true that statement is so please don't quote me on it. I read a study at my cancer center. Some people it causes horrible side effects but I was warned we would work with any side effect because this medicine is the best chance at a lesser reacurrance. I'm only a stage 1a, onco score of 14, 9% reacurrance rate. I did have 5 cm of DCIS, and 3 other masses the largest of the invasive was 2.9 cm. Hope this helps, SA",
      "MessageIndex": 672,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 18, 2018 05:19PM Whateverittakes wrote: Hello! Very gorgeous picture! Just wanted to tell you I had horrible bruising (big spots) at first then they went to Tiny ones. I did have a hematoma & seroma, but the brusing finally went away after a few months. I still looked bruised in some places. Best wishes SA",
      "MessageIndex": 701,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Jun 20, 2018 10:28PM Whateverittakes wrote: I opted for a delayed reconstruction but my BS sent me to a plastic surgeon. They would combine and do the operation at the same time if you chose to do it immediately. I think only PS does the reconstruction part. Good luck SA",
      "MessageIndex": 26,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 15, 2018 10:55PM Whateverittakes wrote: I had a seroma and hemotoba develop in my left (foob) I guess it's what it's called lol. I had quite a few scans, had drains put back in & a 10 day dose of high powered antibotics. It took about 3 weeks & I was back to normal. Hopefully yours will heal even quicker!! best wishes SA",
      "MessageIndex": 686,
      "PostDate": "15/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 13, 2018 01:01AM Whateverittakes wrote: Ladies, I made a post the other day about us being able to receive free bras & breast forms 100% free no copay through our insurance! It's part of the MX law! Ask your doctor for prescriptions for them. I use a breast cancer supply store. It would had been 696.00 but insurance covered all! I just started being able to wear my bra & forms.also you get new ones every 3 months! YES every 3 months! I'm 31 it felt odd and uncomfortable, I couldn't wait to get home and remove it. I do have the chance to complete a reconstruction, I've just had so many complications from my BMX (double). I'm having issues getting my shirts to fit properly. Any ideas on what to wear or try, favorite designer for ladies with a MX? I also have brand new camisoles with bulit in drains, I have 2 of them one I tried on and it was way too small they wouldn't let me exchange I would love to give them to someone who needs them they are large & white but fit snug like a medium. I also have a brand new lace bra with the breast forms anyone can have it's brand new never used. I will ship them for free to any of my lovely sisters on here! Just send me a PM with your name and address. Best wishes to all Sa",
      "MessageIndex": 94,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/861492",
      "Title": "How have you adjusted to being Half Flat? sm627 MexicoHeather"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Jun 19, 2018 07:31PM Whateverittakes wrote: Hello I'm new here my first post even tho I've been reading your post for awhile. I'm 31 years old & have a BMX with skin & nipple sparing on June 13th. I only had cancer in me left but removed both due to my age. I wanted to say hello & I'm praying everything goes well for you on your surgery day! The nuclear injections wasn't as bad as I thought. I do have a brand new drain pouch & M camisole with drain holders that is brand new never used if anyone needs them just PM me.",
      "MessageIndex": 15,
      "PostDate": "19/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 8, 2018 08:37PM - edited Aug 8, 2018 08:37PM by Whateverittakes I used rubbing alcohol to remove the leftover tape residue. If it is painful to you when they remove them they have a kind of spray(can't remember the name) that instantly numbs you. Do not be afraid to ask for it. Best wishes SA",
      "MessageIndex": 192,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "Whateveritt…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275743/profile",
      "Content": "Aug 18, 2018 05:22PM Whateverittakes wrote: My oncologist didn't recommend me taking tamoxifen until most of all my surgeries were done. She explained it's to high of a risk due to blood clots. Then she stayed If I was to have any dental work or more surgery stop 7 days ahead, let her know & she would notify me when to restart. Hope this helps SA",
      "MessageIndex": 702,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864066",
      "Title": "May 2018 Surgery Support Group ReadyAbout SPDGirl"
    }
  ]
}