{
  "AuthorID": "WhichWay2ru…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106678/profile",
  "Posts": [
    {
      "AuthorID": "WhichWay2ru…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106678/profile",
      "Content": "Sep 8, 2010 11:14PM WhichWay2run wrote: Hi, arubajan05... I just bought some more Loreal Lash Serum....I'll try it first, then maybe the Latisse. MaryNY...yes, it will be interesting to see how the caps work.  I also joined the Cold Caps forum...there is a lot of information there.  Most use Penguin Cold Caps, I chose the Elasto-Get Caps....they are much more simple, and I like the fit. I can't wait til the medical world finds a cure without all these barbaric remedies.  All this seems too extreme for me....at the same time, I feel grateful we have what we have.",
      "MessageIndex": 5932,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "WhichWay2ru…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106678/profile",
      "Content": "Sep 16, 2010 10:59PM WhichWay2run wrote: Carrol2....  I am using Elasto-Gel Caps, and am very happy with them....but, I must say have had only 2 AC treatments of four, with 12 weekly Taxol to follow.  The are available online, and are manufactured in Kansas City, MO.  I paid $75.00 each and I own them, no deposits or rental, and received them in two days, thanks to my wonderful children.  I have posted on the Cold Caps Forum, and these caps are doing their job.  We shed, some more than others, but keep our hair, mine is much thinner, but I am comfortable with it, and am at a Day 20 where it is said that if I don't lose my hair in clumps by Day 21, I should just continue to shed, and the shedding does lessen....at least I sure hope so.  I will posting a before and after with baggies of my hair loss that has occurred over the last week....a bit scary, but you will see that I do have 'enough' hair still..... All my best to all of you very important ladies!!",
      "MessageIndex": 6019,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "WhichWay2ru…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106678/profile",
      "Content": "Sep 8, 2010 08:48PM - edited Sep 8, 2010 08:53PM by WhichWay2run Hi Everyone, I am a cold cap user (Elasto-Gel Caps) designed by Edward Stout. I have had one chemo treatment. AC x 4 (bi-weekly), then Taxol X 12 (weekly), then lumpectomy, then radiation. It is day 13 and so far no hair loss anywhere....maybe too early...but, I am thinking positively.  I chose the Elasto-Gel Caps because I thought the fit would be better, and it does fit tightly over the head.  I will let you know how it goes as my treatment continues.  I was given a Rx for Latisse, but I have blue eyes and hesitate to chance turning them brown.  I am very curious how often that happens.  One woman where I am taking my treatments told me that she uses the Latisse....al lot of the women there do....and to save money, she bought a small, thin artist's brush because the one that comes with the Latisse is so big, and her Latisse lasts her about three months, so the $98.00 (Walmart) is cut in third.  I may try it....and will let you know.  Oh, the lady's lashes are in good shape and long, she never lost hers, but she said they did thin out some, but the Latisse has lengthened her lashes, even longer than before chemo.  Sje had light green eyes and she said the color did not change. Loreal Lash Boosting Serum  --- I bought and used this on my lashes before I knew I had cancer, and I definitely did feel it worked well enough to buy it two more times.  I like it, and fell like it does condition and keep my lashes from being too dry.  There is a mascara that goes along with it.  I buy it at Walgreens for about $25.00.  You can buy the serum for about $13.99 and the mascara with the serum in it for about $12.00.  Usually you can buy one get one half off at Walgreens.  I stopped using it when I found out about the cancer....duh! I am taking large amounts of vitamins, especially Vit. D (which I am low in, as are most cancer patients.)   I do cut all but the Vitamin D out 10,000 IU daily two days before chemo, and start up again two days after. I also am using Vitamin D to rub on the scar I have from my port and it does look very good....but the rubbing of the scar is what really flattens it out....you need to rub your scars for at least two months a few times a day.  Vitamin E, can actually toughen and sometimes thicken scars, so I use it only internally.  Any oil or petroleum jelly works well on scars, but I prefer Vit. D, and petroleum jelly next, so my fingers can glide over the scar.  I concentrate on any 'high spot' on the scar while rubbing over the whole scar in many directions. Diagnosed:  July 2010  IDC Stage II, Grade II, Tumor Size .1.6cm, ER+, HER2- Treatments:  AC x 4 (bi-weekly, Taxol x 12 (weekly) then lumpectomy, then radiation Treatments so far:  Chemo 1 of 8  (AC) Worst Side Effect for me so far:  Nausea Regrets:  That I allowed my family and doctor to convince me to install the port.  (Yes, I know...it is easier...I just wish I hadn't.) I just thiought I would add this information, in case it helps someone. All my best!!",
      "MessageIndex": 5929,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "WhichWay2ru…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106678/profile",
      "Content": "Oct 11, 2010 05:34AM WhichWay2run wrote: I agree that the AC treatment is scary.....I have finished my 4 bi-weekly AC treatments and I have the same fears, but my lymph nodes and tumor cannot be felt now at all.  I am scheduled for 12 weekly Taxol, starting in two weeks.  I don't know what to do either, other than trust that these treatments are the best we can do right now.  Please don't be so frightened, and try your best not to worry about what has not happened.  Hopefully, it won;t happen at all.  I am in perfect health except for this cancer, and I fear for my future health, too......but, I am going to concentrate on today's battle, and getting well as quickly as possible. I know it is very hard not to think about what may happen, but we don't know what will happen and should deal with only what we have on our plate right  now.....you/we don't need any extra stress.  Please take care and try to relax as much as possible, and yes, I know how hard that can be....I am a champion worrier. Hugs and love, Peggy ",
      "MessageIndex": 38,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/757005",
      "Title": "Anyone taking Adriamycin for Chemo Lovelyface Lovelyface"
    }
  ]
}