{
  "AuthorID": "whippetmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
  "Posts": [
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 12:03PM whippetmom wrote: A new article....out this month.... http://journals.lww.com/plasreconsurg/Abstract/2011/08000/Human_Fat_Grafting_Alleviates_Radiation_Skin.6.aspx DUH??? ",
      "MessageIndex": 10,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 20, 2011 06:40PM - edited Jan 26, 2012 09:24AM by whippetmom",
      "MessageIndex": 33,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 9, 2012 08:46AM whippetmom wrote: \"bump\" : It just \"bumps\" this topic to the top of the forum list.  Everytime someone posts on a thread, it moves it to the top of that forum category, so that it is easy for someone to find when I refer them to the thread.",
      "MessageIndex": 45,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 26, 2012 08:50AM whippetmom wrote: Bumping for red...",
      "MessageIndex": 47,
      "PostDate": "26/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 11, 2012 10:55AM whippetmom wrote: Sherry: I would not have a breast procedure WITHOUT prophy antibiotics!",
      "MessageIndex": 64,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 8, 2012 10:12PM whippetmom wrote: Bump",
      "MessageIndex": 73,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 22, 2012 08:23PM whippetmom wrote: So glad to hear affirmation that this is a successful way to address irradiated skin issues.  Hope you are keeping a photo journal!",
      "MessageIndex": 77,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 28, 2012 10:53PM whippetmom wrote: I saw the pictures of your breasts and you need to do this. It might take two sessions. I think you will see improvement after the first to make you want to do it again. It is a safe and sane revision to undertake, especially if it allows you to keep your implants and avoid further invasive surgery.",
      "MessageIndex": 84,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 13, 2012 12:32PM whippetmom wrote: bumping for Dianarose",
      "MessageIndex": 90,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 3, 2014 06:01PM whippetmom wrote: bumping for newbies",
      "MessageIndex": 111,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 4, 2014 09:05PM whippetmom wrote: Babs.....please keep me posted on how you are doing after this procedure!",
      "MessageIndex": 112,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 29, 2009 07:04PM whippetmom wrote: With your BRCA2 positive finding, I personally would not hesitate to have bilateral mastectomies.  The interesting aspect of your already having 700 cc implants, is that the mastectomy to tissue expander procedure could be much easier for you.  You already have the expanded pectorals and nice pockets for the expanders.  You could get a very nice cosmetic result.  However, with rads, you might be more likely a candidate for an autologous donor surgery - a microvascular surgery such as a latissimus dorsi or DIEP or ...well...there are many such procedures.  Depends on what your PS thinks and what you want out of reconstruction. Finding the right plastic surgeon is HUGE.  I cannot stress [and I know others will concur] that you want to get it right from the get-go and so finding the best PS for you is so important at this juncture.  There is a pictures forum which is not part of bco.org but is maintained by a bco member.  Her name is Timtam and you will need to have posted a few times and spent some time on these boards to gain access - in order to protect the privacy and integrity of the site for those of us who have shared our reconstruction journey.  The pictures have been submitted by those of us who are members on these forums - and a few of the women had augmented breasts prior to the cancer diagnosis.",
      "MessageIndex": 1,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/741207",
      "Title": "BRCA2+ - Already Have 700cc Implants tlburke tlburke"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 29, 2009 07:06PM whippetmom wrote: How to contact Timtam - click on send a private message.... http://community.breastcancer.org/member/11047/profile",
      "MessageIndex": 2,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/741207",
      "Title": "BRCA2+ - Already Have 700cc Implants tlburke tlburke"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Oct 8, 2009 04:10PM whippetmom wrote: I second [or third?] Dr. Anne Wallace.  She was my sister's general surgeon and plastic surgeon.  My sister has had an excellent outcome. ",
      "MessageIndex": 8,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/741748",
      "Title": "Good Mx surgeon in San Diego? mlrbelle unklezwifeonty"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 23, 2009 09:29AM whippetmom wrote: There have been a number of posts in the past two days, appearing on various forums on breastcancer.org, which smack of something akin to spamming.  I personally believe that new_becca's is one of them.  Her post was created in order that you might click on her link [which you will see in every single post she has placed on these forums]  There is some payback feature - for everyone who clicks on that link from breastcancer.org.  Another new poster is doing the same thing - same website link.  I would be wary of any information she has posted until moderators have evaluated her account further. ",
      "MessageIndex": 15,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727691",
      "Title": "IDC and concern about bones momwholovessoccer Member_of_the_Club"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 29, 2009 07:47PM whippetmom wrote: You might want to come over to the Exchange City thread.  It is where we discuss breast implant sizes, breast reconstruction issues and a myriad of other aspects of reconstruction.  There is a gal whose name is Val there and she lives in Dallas and has a wonderful plastic surgeon.  She has had a beautiful reconstruction. Come join us!",
      "MessageIndex": 5,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/741207",
      "Title": "BRCA2+ - Already Have 700cc Implants tlburke tlburke"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 23, 2009 07:00AM - edited Jan 23, 2009 07:07AM by whippetmom Another very distinct possibility is that your sporadic spinal and hip complaints could be due to arthritis - or some other etiology, and this may be entirely unrelated to your cancer diagnosis.  If you have not had one, perhaps you could also ask your doctor to order a bone density [Dexascan] analysis - just to get a baseline.  ",
      "MessageIndex": 12,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/727691",
      "Title": "IDC and concern about bones momwholovessoccer Member_of_the_Club"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 5, 2011 01:21PM whippetmom wrote: Bump",
      "MessageIndex": 9,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 08:09PM whippetmom wrote: geewhiz:  I am so glad that this worked for you.  I thought you might have gone to Dr. Khouri.  Wish other plastic surgeons would get on the bandwagon....",
      "MessageIndex": 14,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 2, 2012 07:02PM whippetmom wrote: I agree, bodback.",
      "MessageIndex": 40,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 4, 2012 09:31AM whippetmom wrote: Bumping for pink",
      "MessageIndex": 41,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 30, 2012 10:21AM whippetmom wrote: bumping for Corrie",
      "MessageIndex": 49,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 28, 2012 05:54PM whippetmom wrote: dancetrancer - thank you for adding the link to the abstract.  The link worked for me, but some of these journal sites with abstracts work sporadically. ",
      "MessageIndex": 54,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 2, 2012 05:52PM whippetmom wrote: Sherry:  Excellent!  Cannot wait to have your report on this after the procedure.  What is your surgery date?",
      "MessageIndex": 57,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 25, 2012 04:25PM whippetmom wrote: Sherry:  Do you have an update for us on your surgery?",
      "MessageIndex": 72,
      "PostDate": "25/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 28, 2012 06:51PM whippetmom wrote: Bumping for mebmarj",
      "MessageIndex": 78,
      "PostDate": "28/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Oct 20, 2013 11:05PM whippetmom wrote: bump",
      "MessageIndex": 95,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 1, 2014 12:05AM whippetmom wrote: 4sewwhat:  I think I answered these questions in a private message....yes? ",
      "MessageIndex": 116,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 10, 2014 10:17AM whippetmom wrote: hjpz:  Send a private message to geewhiz.  A number of women have had fat graft transfer procedures performed PRIOR to the exchange surgery.",
      "MessageIndex": 125,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 10, 2015 07:58PM whippetmom wrote: 4sewwhat: Wish every plastic surgeon would take the plunge with FGT for a patient with a history of radiation.",
      "MessageIndex": 141,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 1, 2015 02:09PM whippetmom wrote: So glad to have helped you 4sewwhat!",
      "MessageIndex": 144,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jul 27, 2015 10:42AM whippetmom wrote: bum",
      "MessageIndex": 151,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Oct 17, 2011 10:07AM whippetmom wrote: Rose: Thank you for sharing this.  I wish that fat graft transfer was performed more of a matter of course with every rads patient, where possible, to improve the cosmetic outcome.  Addressing capsular contracture is yet another potential benefit of this process.",
      "MessageIndex": 25,
      "PostDate": "17/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 20, 2011 05:38PM - edited Nov 20, 2011 05:50PM by whippetmom Try this link: http://www.voiceamerica.com/episode/57715/fat-transfer-the-skinny-on-fat Kamran Khoobehi, MD is the one who speaks most about the use of fat graft transfer with post-radiation patients.  His portion is around the middle of the session.  Dr. Khoobehi is near New Orleans, LA.... http://www.khoobehi.com/",
      "MessageIndex": 29,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 6, 2012 09:20AM whippetmom wrote: Bump",
      "MessageIndex": 42,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 2, 2012 02:44PM whippetmom wrote: bumping for B123",
      "MessageIndex": 55,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 6, 2012 05:35PM whippetmom wrote: Fat graft transfer is performed by liposuctioning fat from your belly area, most typically, although fat from the thighs and buttocks is used if insufficient abdominal fat is not available.  After harvesting the fat, blunt cannulas are used to place the fat through approximately 2 millimeter incisions - pinpoint incisions - in the skin of the breast mound.  It is, in every circumstance I have known, performed under general anesthesia.  It is far less invasive and carriers fewer complication risks, as opposed to performing the type of revision which you are referring to, which would require opening up the original incision or creating a new incision via the IM fold. ",
      "MessageIndex": 59,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 15, 2012 08:40PM whippetmom wrote: bodback:  I am so encouraged to hear this!  Please keep all of us posted on your journey.",
      "MessageIndex": 68,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 28, 2014 11:21PM whippetmom wrote: Marianna: I am not so sure about implants. Definitely they would need to be submuscular - under the muscle - but I think I would consult with a breast surgeon and a plastic surgeon about this. I am happy that the fat grat transfer rendered such positive results though",
      "MessageIndex": 137,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 28, 2010 02:31PM whippetmom wrote: Bumping",
      "MessageIndex": 2,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 01:51PM whippetmom wrote: geewhiz:  Tell us about your skin.  Is it softer, a different texture, and did your PS inject the fat in various areas on the mound or just in the scar region?  I'm so glad it has all been successful for you!",
      "MessageIndex": 12,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 11, 2011 04:44PM whippetmom wrote: Jana:  Keep us posted on the changes after this second procedure. ",
      "MessageIndex": 16,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 2, 2012 12:21PM whippetmom wrote: trubff:  This is what bodback is describing above.  The fat graft transfer to the irradiated breast can soften the skin, allow it to relax and thereby can allow it to respond more like a non-irradiated breast.  It might require more than one FGT procedure.  Fat grafting is often utilized to correct lumpectomy defects.   Here is a link where you can find plastic surgeons discussing the use of FGT for irradiated skin and lumpectomy defects.  But you do need to go to a PS who has expertise in this arena. http://www.realself.com/question/Fat-transfer-breasts-uneven-lumpectomy",
      "MessageIndex": 37,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 10, 2012 01:27PM whippetmom wrote: Sherry:  Good to hear!  Thank you for updating. ",
      "MessageIndex": 75,
      "PostDate": "10/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 28, 2016 11:51AM whippetmom wrote:",
      "MessageIndex": 157,
      "PostDate": "28/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 20, 2018 07:08AM whippetmom wrote: imkopy2: Did you have your April FGT procedur? Eager to hear how you are doing.",
      "MessageIndex": 202,
      "PostDate": "20/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 13, 2011 01:10PM whippetmom wrote: Physician at MD Anderson in Houston using fat graft transfer for treatment of radiation damaged skin... \"ASPS member Elisabeth Beahm, MD, professor of surgery at the University of Texas (Houston) MD Anderson Cancer Center:....she has seen startlingly good results from stem cell therapy employed to repair skin damaged by radiation treatment.\"",
      "MessageIndex": 17,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 8, 2011 08:29PM whippetmom wrote: Sunone:  Yes, Gregory Scott, MD - Kaiser Permanente in San Diego.  He is a wonderful physician!  I will PM you!",
      "MessageIndex": 27,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 20, 2011 05:50PM whippetmom wrote: Thank you dancetrancer!",
      "MessageIndex": 30,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 28, 2012 01:16PM whippetmom wrote: Okay, never mind that I have been saying this for the past two years....a study released last month... \"Technique Provides New Option for Breast Reconstruction after Radiation Therapy\" http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html",
      "MessageIndex": 50,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 27, 2012 10:13PM whippetmom wrote: fragrantroses: I can envision what you are describing about the \"leathery\" feel and the sensation that the skin is adhering to the pectorals.  At this time, fat graft transfer is the only option to ameliorate the radiation defect, and I would personally not hesitate a moment to try it.  Please keep us posted about this.... Deborah",
      "MessageIndex": 82,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 9, 2012 07:49AM whippetmom wrote: redinrah: No, it really is not painful at all. You might have some feeling of fullness of the breasts afterwards, and some swelling and discomfort in the area where the fat was harvested, but it is certainly nothing like what you have gone through already. Fat will be harvested/liposuctioned from an area of your anatomy, e.g., your abdomen, and then in small droplets will be placed in areas on your breast mound to fill in defects such as rippling, step-off, etc.",
      "MessageIndex": 89,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 22, 2013 12:43AM whippetmom wrote: truebff:  That is interesting, because MSU has been testing the use of fat grafting (in previously irradiated patients as well} since 2010 and they report favorable results and do not question whether there will be untoward sequelae.  So I am perplexed.  It has been used with previously irradiated patients for over five years....and I never have read any reports which suggest that there is a concern as mentioned by your doctor. http://ps-rc.org/meeting/abstracts/2014/126.cgi",
      "MessageIndex": 106,
      "PostDate": "22/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 20, 2014 11:14AM whippetmom wrote: Bump",
      "MessageIndex": 113,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 4, 2014 09:30AM whippetmom wrote: Bump..... And geewhiz.....thank you!!",
      "MessageIndex": 130,
      "PostDate": "04/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 19, 2014 08:46AM - edited Dec 19, 2014 08:49AM by whippetmom Bump",
      "MessageIndex": 135,
      "PostDate": "19/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: I started this thread in 2009, and since that time, further data has been published regarding the efficacy of utilizing stem-cell enriched fat graft transfer in previously irradiated breast tissue.  Since links are often malfunctioning, I am posting the most recent information, so that you can easily cut and paste and print out to take to your plastic surgeons. Print out these articles: http://www.ncbi.nlm.nih.gov/pubmed/21987041 http://www.ncbi.nlm.nih.gov/pubmed/23158103 http://www.plasticsurgery.org/News-and-Resources/Technique-Provides-New-Option-for-Breast-Reconstruction-after-Radiation-Therapy.html Autologous Fat Grafting in Secondary Breast Reconstruction Losken, Albert MD; Pinell, Ximena A. MD; Sikoro, Katherine MD; Yezhelyev, Maksym V. MD; Anderson, Erica MD; Carlson, Grant W. MD Abstract Autologous fat grafting has become a common technique for revisional breast surgery. The purpose of this series is to review our experience with fat grafting for the correction of acquired breast deformities. A retrospective review was performed on 107 patients with a history of breast cancer between 1996 and 2010, who had autologous fat grafting at the time of secondary breast reconstruction. The indications were for improvement in contour, shape, and volume of the breast following transverse rectus abdominis myocutaneous (TRAM) flap reconstruction (n = 55), latissimus dorsi with or without implant (n = 20), implant reconstruction (n = 20), and breast conservation therapy deformity (n = 12). The average volume of injection was 40 mL (range, 5-150 mL), the most common location being upper and medial quadrants. Fat was harvested mainly from the abdomen, thighs, and flanks. Complications occurred in 11% of the patients, and included fat necrosis, erythema, keloid scarring, and pain. Complications were higher when performed with implant reconstructions. Repeat fat injection was performed in 25% (n = 27/107), which increased with the length of follow-up. Patients with a history of radiation therapy had an increased incidence of repeat injections (36% vs. 18%). Patients with >6 months follow-up reported an improvement of about 83%. Autologous fat grafting is a safe and effective tool for secondary breast reconstruction. It is helpful in all types of reconstructions to improve contour, volume, and overall breast shape and symmetry. Repeat injections are often required and this is more common in patients with longer follow-up and in those with a history of radiation therapy. The popularity of this approach in reconstructive breast surgery will likely continue to increase. © 2011 Lippincott Williams & Wilkins, Inc. Fat Grafting and Breast Reconstruction with Implant:  Another Option for the Irradiated Breast Cancer Patients. Salgarello M, Visconti G, Barone-Adesi L. Source Assistant Professor, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo A. Gemelli 8, 00168 Rome, Italy; Resident in-training, Department of Plastic and Reconstructive Surgery, Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\"- Largo A. Gemelli 8, 00168 Rome, Italy; Consultant Plastic Surgeon - Breast Unit - Catholic University of \"Sacro Cuore\" - University Hospital \"A. Gemelli\" - Largo Gemelli 8, 00168 Rome, Italy. Abstract BACKGROUND: In postmastectomy radiated patients, autologous tissue reconstruction is preferred over the implant one, because the latter is associated with a higher rate of postoperative complications. However, autologous tissue reconstruction is not always feasible and is sometimes refused by the patient. A challenge also arises in breast-conserving surgery patients, seeking breast augmentation with implant. In this paper, the authors present a further reconstructive option for irradiated breast cancer patients, consisting of fat grafting followed by implant placement. PATIENTS AND METHODS: The authors retrospectively reviewed sixteen cases of irradiated breasts treated with fat grafting and subsequent alloplastic reconstruction/breast augmentation. The evaluation methods were clinical and photography-based assessments. The BREAST-Q was used to quantify patient satisfaction. RESULTS: Sixteen patients, with a pre-treatment LENT-SOMA score of 1 and 2, underwent two to three fat graftings to achieve a LENT-SOMA score of 0. The placement of the breast implant had been performed in a separate stage at least three months after the last grafting session. The average follow-up was 15 months. The reconstructive outcomes were graded from excellent to good in 93.7 percent of patients. Patient satisfaction was marked high to very high. There were no short-term complications. A Baker grade 1 capsule contracture was found in all patients. CONCLUSION: The authors' experience shows that breast fat grafting followed by implant placement may represent a feasible reconstructive option in high selected patients with irradiated breasts. Fat grafting seems to reduce the radiation-induced complications in implants. Larger studies with a longer follow-up are needed. PMID: 21987041 [PubMed - as supplied by publisher] Lauren Greenfield, MD's blog [a California plastic surgeon] http://www.laurengreenbergmd.com/uncategorized/breast-reconstruction-after-breast-cancer-using-fat-grafts/ As you can see, there are numerous studies which have been performed to substantiate that fat graft transfer [even to a breast where the implant is already in place] can change the integrity of the radiated skin.  It can soften the skin and apparently can also reduce a higher grade capsular contracture which otherwise might require surgical intervention, to a Grade 1 which would require no intervention.  Fat grafting is also a method by which symmetry to the irradiated breast can be made to more closely match the non-irradiated breast. MASSAGING DURING EXPANSION  From an interview by D r. Weiss here on bc.org Maurice Nahabedian Yes. Also, in patients who've had radiation to implants (expanders) I recommend an aggressive massaging protocol to help maintain the soft consistency of the reconstructed breast. Marisa Weiss, M.D. Can you explain what you mean by this massage protocol? Maurice Nahabedian I recommend they use some sort of a moisturizing lotion and massage the breast two to three times a day to retain the moisture and also to help control the amount of scar tissue that forms around the implant/expander. DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 186,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 27, 2010 08:24AM whippetmom wrote: Out of the ashes of cancer and the sadness it brings, comes life anew and so beautiful as well.  What fabulous photos!",
      "MessageIndex": 54,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/747382",
      "Title": "Pics of Baby Kilian Pure Meece"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 25, 2010 05:22PM whippetmom wrote: Laura:  Capsular contracture in the higher grade can be VERY painful!  Please do not tell me your plastic surgeon has known about this and has let you agonize through this for years?  I think you need a new PS. ",
      "MessageIndex": 3,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753122",
      "Title": "wnt to have my implants removed lauralu Binney4"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 25, 2010 04:57PM whippetmom wrote: Laura:  If you have Post-Mastectomy Pain Syndrome - PMPS - there is a possibility that removing the implants might not help. Some women have pain after mastectomy - as many as over 50% - and often the pain does not manifest for sometime after the initial mastectomy, which is often about the time the exchange surgery takes place. But apart from that, and since you mention that pain commenced as soon as implants were placed, seeking consultation with another plastic surgeon might be helpful.  You might have something else going on which could be resolved or remedied.  Are your implants hard and are they misshapen at all?  I am just wondering if you have capsular contracture.  There is a thread on this website entitled \"Post-Mastectomy Pain Syndrome\" under the \"Surgery, Before, During and After\" forums.  You might read through the posts and see if you find some answers there as well.  I'll bump that forum up for you. I am sure there will be others who will come and offer their thoughts....hang in there...",
      "MessageIndex": 1,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/753122",
      "Title": "wnt to have my implants removed lauralu Binney4"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 9, 2008 10:03AM whippetmom wrote: A nodular density is description of a fibrocystic change which is most often benign.  Women with fibrocystic or dense breasts typically have findings of nodular densities in their breasts, hence the term:  \"lumpy breasts.\" As I mentioned in the \"not diagnosed but worried forum\" in reply to your post, the radiologist was comparing this current mammogram to a previous one which showed the same nodular density, although this time it appeared decreased in size.  This is a good thing. ",
      "MessageIndex": 1,
      "PostDate": "09/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/724079",
      "Title": "Nobular Density, can anyone tell me about what this means? Emmabell whippetmom"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 29, 2010 03:12PM whippetmom wrote: Joanne:  I am just reading your story.  I had goosebumps!  Amazing....what a blessing - a miracle of a blessing - that this mammo tech risked violating the \"rules\" and shared what she found.  Welcome also to bc.org!! Deborah",
      "MessageIndex": 2,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/757959",
      "Title": "My story--a mam.tech saved my life Joanne58 Joanne58"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 21, 2009 04:37PM whippetmom wrote: I had a very similar-to-your-description bright red spot on my breast also one week after surgery - not hot and the PS deemed it must be a pressure sore - like a blister.  Apparently it can take very little friction to occur when we are dealing with a skin flap and mine were pretty thin.  Hope is turns out to be nothing at all....",
      "MessageIndex": 4,
      "PostDate": "21/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/727685",
      "Title": "bright red area on foob kalyla swimangel72"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 11, 2008 03:43AM whippetmom wrote: simvog, I spoke with my oncologist today and mentioned your diagnosis of being ER positive on biopsy and the path of the tumor biopsy reported it as ER negative.  She felt that it was \"very rare\" that this would occur, especially since your ER was so \"strongly positive\" at 90%.  But she said that it can happen...it can be that the original biopsy was incorrect as to the ER receptor status.  Here is what Susan Love notes in her website about ER positive/PR negative tumors: \"Whether your nodes were negative or positive, it may be helpful to have the Oncotype DX test done on the tumor tissue. This test can help assess your recurrence risk, and thus help you and your oncologist decide if you should have chemotherapy as well as hormone therapy.\" IYou might want to ask about that test.  Your need for chemotherapy [I read one of your previous posts] is probably necessary more due to the fact that the PR receptors are negative than tumor size.  Grade may come into play, but it appears to be the fact that there is a \"negative\" in the assessment.  But it will be very interesting to see how the two facilities \"reconcile\" your results.  I would never hesitate to ask for an independent opinion, if the discrepancy is not settled to alleviate your concerns. I can certainly appreciate how frustrating this is...waiting for answers.   Praying that you get some clarification and SOON!",
      "MessageIndex": 1,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 5, 2008 04:31PM whippetmom wrote: Digger, digger, digger!  What do you mean \"ugly on the inside?\"  The inside is your heart, your soul, your spirit - untouched by surgery!  This is what draws people to us - not our physique and especially not our breasts.  Those folk who are only drawn by outward beauty ought to be last on your list for inclusion into your life.  And I mean LIFE - because you have a grand one ahead of you if you seize the challenge!  Also, you are only two weeks out of surgery. Once your sutures are out you can start massaging your breasts, using many of the remedies mentioned on this forum, e.g., Palmer's lotion, Bio-Oil, Kelocote and start working on those scars.  I can tell you have not visited the pictures forum where you can see some before, during and after photos of some pretty gorgeous breasts, posted by women of this forum who have had the same surgery you have had.  I am only one week out of surgery and I have the same ugly wound you have, and I will have some residual scarring, but I am going to look dynamite in clothes and a bathing suit and, for the first time since I was 20, I will have breasts which can hold up a tube top!!  This is a journey - a long one for many - and yet there is so much for which we can be grateful.  Time does heal all wounds and it will heal some of those scars as well.  Hugs going out to you...",
      "MessageIndex": 6,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725500",
      "Title": "Is my mx scar normal? digger BethNY"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 5, 2008 11:48AM whippetmom wrote: What does your surgeon say about the issues you are having at this time?  You say it is \"not super red and hot\" - which suggests it is hot to some degree, which might mean infection.  Do you have a fever at all? I check my temp twice a day.  The scar being \"angry looking\" might be subjective, because I saw plenty of pictures of post-surgical reconstruction with expanders and so I was prepared that it would not be a pretty site.  I am going to have my DH take some photos of my breasts tonight and I will post them on the picture forum.  You might check tomorrow morning and see how mine look in comparison to yours.  You are one week on the heavier guns antibiotics and it seems you are due for a follow-up evaluation.  Is one scheduled?  Other than this, and I am eight days post-surgery, I have a lot of bruising and the suture line is dark red and I imagine will darken.  But if I had even a miniscule amount of \"redness\" and/or \"hot\" spots, I would be on that phone so fast to the doctor my little head would spin.  You are your own healthcare advocate and sometimes, when it comes to this major surgery we have gone through, you have to really be on top of what is going on with your body and have your health care team involved in every little nuance which might worry you.  You and I want the very best outcome and sometimes it means we must be very assertive to make sure this goal is achieved. Hoping you find some answers...others on this forum might have had a similar complication and can identify the symptoms as you have described.",
      "MessageIndex": 1,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725500",
      "Title": "Is my mx scar normal? digger BethNY"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 15, 2008 02:08AM whippetmom wrote: simvog:  So what you are saying is that the hospital where you had the mastectomy, WHERE you were told you were triple negative, has NOW told you they ran this through again and now determine you are ER positive?  In other words, the two facilities concur you are ER +?  This is good news, if this is the case....",
      "MessageIndex": 6,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 15, 2008 03:51AM whippetmom wrote: auriga:  You can find out if your healthcare provider will cover the Oncotype DX test - which will show your liklihood of cancer recurrence and also the degree to which your cancer will or will not benefit by chemotherapy.  You can read about the test here: http://www.breastcancer.org/symptoms/testing/oncotype_test.jsp You can also google and find the actual Oncotype DX website and I believe they have a list of health care providers and/or insurance companies who will cover this procedure. My friend was ER+ and PR- and had the test and found that chemotherapy would only minutely [something like by 1 or 2 points] improve chances of recurrence, and so it was easy for her to decline.  Others on this list have taken the test, but again, as with all of these tests, it will be a waiting game for the results.  Isn't it always a waiting game with this disease?  But you are THROUGH the surgery - hooray!  Hope you are recovering well.",
      "MessageIndex": 8,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 15, 2008 08:59PM whippetmom wrote: Yes auriga, Thanksgiving Day in the hospital.  I suppose I know already what I'll be getting for lunch.  Hope you get some more clarification from your oncologist. I'll ask my own oncologist's thoughts on the PR negative issue when I see her next Thursday.  Deborah",
      "MessageIndex": 11,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724213",
      "Title": "Pathology results different from biopsy results. Please help! havehope ZEKE"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 10, 2008 01:29PM whippetmom wrote: I am also searching for pillows to use in bed after surgery.  I found one of those reading pillows at Target's online store which I think might work - two of the three reviewers of the product used it post-surgery and all ratings were positive.  I just wonder if there is some concern about the arm rests on such a pillow - if it will somehow interfere with the drains.  Anyone have any thoughts about this?  Here is the link to the pillow: http://www.target.com/Bed-Rest-Pillow-Tan/dp/B000M8GZHW/sr=1-3/qid=1226351659/ref=sr_1_3/188-9908928-2542755?ie=UTF8&index=target&rh=k%3Areading%20pillow&page=1",
      "MessageIndex": 8,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724028",
      "Title": "BedLounge back rest pillow rayhope SandyinSoCal"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 19, 2008 02:59PM whippetmom wrote: No, I do not consider myself sick in the least!  I received many \"well-wishes\" and \"get well soon\" cards from friends, but the only odd one was from the next door neighbor who said, \"we recently heard of your illness....\"  I had never and would never consider cancer as an \"illness\" for some reason.  I don't quite know HOW I would categorize my breast cancer - calling it a \"disease\" even seems odd. ",
      "MessageIndex": 49,
      "PostDate": "19/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 8, 2009 11:37AM whippetmom wrote: Jancie - Many women do have chemotherapy before reconstruction - to reduce the size of the tumor - typically those who want a lumpectomy only.  Many women just want the tumor out and have the mastectomy, then chemo and delay reconstruction until after treatment. Some women  - a growing number with the advent/availability of the Oncotype Dx - [mentioned below] have mastectomy and immediate reconstruction with the expanders, have chemo and wait until chemo is completed before exchanging to implants. It is true that if you have a mastectomy you would not need radiation - unless you have positive lymph nodes and if the oncologist feels radiation is necessary, they would direct the rads to the axillary/armpit area.  You are asking sensible questions and trust me, it helps so much to be armed with as much information as possible, so that you can pose these questions to your doctor.  Since you are ER positive, ask your doctor about the Oncotype Dx test.  This test will determine your risk of recurrence.  If your results indicate that you fall within a low-risk category of recurrence, chemotherapy might not be necessary and your doctor would determine what other type of treatment would be appropriate.  Of course, this would require surgical removal of the tumor before taking the test.  So many other factors come into play - this test is not the tell-all prognosticator. This is just additional information which you can take to your next appointment with your oncologist.  You can present all of your data, but listen to what he recommends by way of addressing your particular case.  Read about the test here: http://www.oncotypedx.com/PatientCaregiver/IsOncotypeRight.aspx?Sid=8 In order to gain access to the pictures forum, you need to email Timtam and request permission for entrance.  It is a very private and protected website, so that women can feel comfortable and safe in posting their reconstruction photos. I will PM you the link. ",
      "MessageIndex": 41,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726815",
      "Title": "I am scared -just diagnosed jancie traceyz"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 7, 2009 03:02PM whippetmom wrote: Welcome skippyrcris! I recall doing a little computing in October when I was diagnosed - just out of curiosity - wondering what the cost would be if I had to pay out of pocket for my upcoming procedure. Calculating the cost of bilateral mastectomy with immediate reconstruction, hospitalization, radiology, anesthesiology, and came up with a low and very conservative estimate of around $15,000 for hospital expenses, $25,000 for surgeons  [I had a surgical oncologist and a plastic surgeon], $5,000 for the anesthesiologist [which is really just a guess, as on the web I could not find easily any cost factors for this specialty] and radiology and pathology - I bulked together at $2,000 - probably very conservative.  So my very cursory and \"doing it just for fun\" total came to $47,000. This does not take into consideration surgical complications, additional hospitalization for such complications or other ancillary expenses. Perhaps someone else has some more concrete figures for you.  If you have a \"good\" breast guy who is covered by your insurance plan, it would be good to meet with him and find out more about him.  God bless!",
      "MessageIndex": 2,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726902",
      "Title": "newbie here skippyrcis whippetmom"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 9, 2009 11:59AM whippetmom wrote: Carol:  Thank you so much for posting this data!  Hopefully it will help others \"searching\" through the archives for this information.  I have saved it also to my personal files. I am blessed also to have very good insurance. Deborah in California",
      "MessageIndex": 8,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726902",
      "Title": "newbie here skippyrcis whippetmom"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 18, 2009 07:02AM whippetmom wrote: skippyrcis:  How did your appointment go last Monday?",
      "MessageIndex": 12,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726902",
      "Title": "newbie here skippyrcis whippetmom"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 9, 2009 03:28AM whippetmom wrote: CAZ:  Holy mackerel!  Thank you for posting this!  Do you have the breakdown you could post as well, e.g., the hospital costs, surgeon fees, anesthesiology, etc? You know, I knew it was upwards of 100K for what we are going through - but I posted the sum which one might be able to find in the lowest socioeconomic city in the US.  I was afraid if I posted what I THOUGHT it would cost, I would be laughed right off the forum!  My calculations did not include the followup costs or cost for exchange to implants.  Unfortunately, the original poster does not appear to be reading these responses, but I hope she does do so, before making any committments to a private pay practitioner.",
      "MessageIndex": 6,
      "PostDate": "09/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726902",
      "Title": "newbie here skippyrcis whippetmom"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 7, 2009 09:46PM whippetmom wrote: Hi Jancie:  In answer to your question about 30 minutes ago - you absolutely could have a bilateral mastectomy with reconstruction.  Many women on these forums have elected to have a mastectomy, instead of lumpectomy, with a prophylactic mastectomy on the healthy breast.  I am one of those women.  I was diagnosed in October. My tumor was quite small - less than 1 cm, and I was a candidate for lumpectomy.  However, there is a family history of breast cancer and I just did not want to ever have to go through this again!  I also knew that the healthy breast would have had to be surgically lifted or augmented to obtain symmetry, and so surgery was going to take place on that breast no matter which way I went.  It is a very personal decision and many women just feel very strongly about not taking a healthy breast.  So these are options you can research further and come to the decision which gives you peace of mind.  There is a picture forum [which requires permission to access], so that you can see the cosmetic result after mastectomy with immediate reconstruction.  Immediate reconstruction infers for most women that expanders will be placed during surgery to expand the skin and muscle and then will be removed at some point and replaced with permanent implants.  I am glad you are feeling the same sense of relief I did - by joining a forum such as this one!",
      "MessageIndex": 37,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/726815",
      "Title": "I am scared -just diagnosed jancie traceyz"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 3, 2010 09:07PM whippetmom wrote: Julia:  It is fearful and it is overwhelming and it is a powerless feeling to have no control over the hours or days or the outcome.  We know, we know, we know.  Just hang in there! ",
      "MessageIndex": 4,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 23, 2010 03:54PM whippetmom wrote:",
      "MessageIndex": 44,
      "PostDate": "23/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 12, 2010 01:00AM - edited Feb 12, 2010 02:06PM by whippetmom Fog:  If these women in the UK would like to come to bc.org and join this thread, I think that would be fabulous for them.  You know, I have women in the UK and now one in Australia contacting me about breast reconstruction issues and they all say that there is absolutely nothing for them like bc.org in their respective countries.  I do not know if it is the level of communication we have going on here - our fervor for research and wanting every shred of information we can find regarding PMPS.  For some reason, it is not that easy for women in other countries to find bc.org.  I think it would be wonderful for you to invite them to share this thread with us.  I think that you should be very much involved with this thread - one of the \"moderator\" of sorts -  and perhaps it would be a springboard for you to start a website down the road.  But it would be nice to extend the invitation to these other women hungry for information on PMPS. Deborah",
      "MessageIndex": 174,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 3, 2010 01:20PM - edited Apr 3, 2010 01:21PM by whippetmom FOR LYMPHADEMA SUFFERERS: Have you heard of a procedure called \"Lymphovenous Bypass\"?  I was doing my regular research into plastic surgeons and found this reference to Dr. Lisa Jacob in New Jersey: \"With her microvascular experience, Dr. Jacob is able to offer a new surgical technique in the treatment of lymphedema. This minimal invasive procedure called Lymphovenous Bypass attempts to reroute blocked lymphatics into the venous system and reduce the symptoms of Lymphedema.\" Please cross-post if desired....  ",
      "MessageIndex": 355,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 1, 2010 04:38PM whippetmom wrote: Bumping",
      "MessageIndex": 422,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 15, 2010 06:01PM whippetmom wrote:",
      "MessageIndex": 533,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Sep 26, 2010 11:04AM whippetmom wrote: Deeds:  Your implants are sub-pectoral AND under the rectus abdominus and serratus muscles - a complete submuscular.....so I just wonder if that adds even more to the \"iron bra\" sensation?",
      "MessageIndex": 543,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Oct 16, 2010 09:06PM whippetmom wrote: Bump",
      "MessageIndex": 566,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 8, 2011 08:10PM - edited May 8, 2011 08:10PM by whippetmom Cori:  I had that same piercing pain for two weeks but it was relieved as soon as I had a subsequent fill.  The ribcage can be compressed with tissue expansion.  Just guard your upper extremity movements to avoid further trauma to the ribcage. ",
      "MessageIndex": 669,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 02:59PM whippetmom wrote: While researching this topic, I came across this scholarly article regarding trials of using fat graft transfer to relieve PMPS - performed with considerable success.  http://journals.lww.com/plasreconsurg/Abstract/2011/08000/Autologous_Fat_Graft_in_Postmastectomy_Pain.3.aspx",
      "MessageIndex": 707,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 04:39PM - edited Aug 10, 2011 04:49PM by whippetmom beacher:  You need to get a referral to an anesthesia pain specialist.  An anesthesiologist who deals with pain issues.  I don't get why these doctors act as if they have never heard of this.  Heck, it has been a known and documented complication and diagnosis for thirty plus years! http://www.medscape.com/viewarticle/715640 ",
      "MessageIndex": 711,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 25, 2009 04:08PM whippetmom wrote: Frankly, my husband and I cannot bear to be without a dog in the family!  They bring such joy and will give you such an incredible outlet for activities!  Getting the kids involved in puppy training, taking the dog to the park, throwing the ball, hiking, perhaps joining a meetup group with others who have your same breed of dog. But with all of the craziness surrounding those of us with cancer, finding every, single solitary way possible to enrich our lives is just paramount!  A dog can do just that!!  You obviously have my vote!!!",
      "MessageIndex": 17,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/729686",
      "Title": "Kids Getting a Dog SpunkyGirl SpunkyGirl"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 15, 2012 06:17PM - edited Jan 15, 2012 06:18PM by whippetmom MaritimeMom: My sister, Deeds, who started this thread, had acupuncture treatment for her PMPS symptoms, and her radiating arm pain completely resolved.  I would really research and ask around to find the most reputable acupuncturist - someone who you can fully trust.",
      "MessageIndex": 833,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 3, 2013 02:21PM whippetmom wrote: Some doctors are now calling PMPS, \"upper quarter dysfunction\".... A syndrome called upper quarter dysfunction — its symptoms include pain, restricted immobility and impaired sensation and strength — has been reported in over half of breast cancer survivors and may be more frequent in those who undergo breast reconstruction, according to a 2012 study in the journal Cancer. well.blogs.nytimes.com/2013/05...",
      "MessageIndex": 1144,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 1, 2015 05:04PM whippetmom wrote: SoniaToronto: How many times did they do this procedure?",
      "MessageIndex": 1286,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Oct 2, 2016 07:41PM whippetmom wrote: peyton.....It should absolutely be a covered revision. It is all a matter of proper \"coding\" and this is a surgery which would address a medical complication, namely, PMPS. However, research has shown that PMPS typically results from damage done during the initial mastectomy. I will post again something to discuss with your PS....rather than surgery.... From my post, April of this year: ASCO News re: Treatment for PMPS I have not been to this thread for awhile, so I apologize if this is \"old\" news. In the event it is not, it is worth pursuing as a solution to chronic PMPS pain. A non-surgical, non-invasive treatment and so simple if it works. Deborah",
      "MessageIndex": 1545,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "whippetmom wrote: Inquiring for my aunt, dx'd for the third time and who will likely not be a candidate for reconstruction: She cannot stand her heavy breast prostheses - just wondering if any have ordered from this company and like the products? http://www.new-attitude-inc.com/ Thanks for your thoughts! Deborah DISCLAIMER! Please read my biography under my personal profile. I am not a physician or medical professional. The information provided is my own personal opinion. You must discuss every aspect of your reconstruction with your plastic surgeon. Dx 10/15/2008, IDC, 1cm, Stage IA, Grade 2, 0/1 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/729132",
      "Title": "Breast prosthesis from \"New Attitude\" whippetmom Erica"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 5, 2010 01:10AM whippetmom wrote: Well, they knew about the advantages of a Herceptin plus chemo regimen back in 2005....two years before your first diagnosis.... http://www.cancer.gov/newscenter/pressreleases/HerceptinCombination2005",
      "MessageIndex": 16,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753654",
      "Title": "Attorney in the house? lisa34lisa lisa34lisa"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 28, 2010 09:41PM whippetmom wrote: My mother was 58 years of age at the time of diagnosis - invasive breast cancer in both breasts.  She died at the age of 80 of an unrelated illness.",
      "MessageIndex": 17,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/750429",
      "Title": "80 years old......???? Mamita49 ruthbru"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 4, 2008 09:45PM whippetmom wrote: Sue: Ironically, I commented on this topic on your other post and then saw this one! I predicted this one might be a real connundrum.  Good idea about planning the challenges in advance.  Sitting on your lap will be difficult - she cannot lean back on your breasts.  Sitting next to each other on the sofa will work.  I asked my surgeon today how soon I could lift our 30 pound 2 year old grandson and she said in about one month, but I could not lift him into a car seat for a couple of months.  You just cannot lift anything above 5 pounds until your drains come out and then you can start the range of motion exercises.  My ROM exercises are going to simulate lifting a child with graduated weights!  We resume babysitting next week! Deborah ",
      "MessageIndex": 6,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725339",
      "Title": "Experiences after BM with small children susan13 iwannabefree"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 11, 2008 11:32PM whippetmom wrote: Yes, you can take Lorazapam on an \"as needed\" basis.  This is really the preferable mode of self administration - to use it for those times and situations where your anxiety level might be elevated.  I have had anxiety meds dispensed to me since October 15th and I have only taken 2 out of 20 pills.  I would not use it during the day - especially since it sounds as though you are teaching - until you know how you will react to the medication.  You could take 1/2 a tab at night - early enough in the evening to see how you feel after taking it.  It takes about an hour to feel the full effects.  Most people just feel very calm and relaxed, but it also might make you sleepy.  Hope you find some relief soon....and get a surgery date very soon.",
      "MessageIndex": 3,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/725790",
      "Title": "anxiety and meds jillisucat jillisucat"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 15, 2008 03:40PM whippetmom wrote: \"Tears and bad mood\"  Is that all!  Harumph!  If it happens to me I will rip off my top and run screaming through the hospital corridors. But in all honesty, I am so sorry.  This indeed is something we all fear might happen.  But there is always a good reason for everything.  I frankly would prefer to have surgeons operating on me who are fresh and not frazzled because of so many unplanned emergencies, or docs weary from working on prolonged surgical procedures. You would not have wanted to be \"squeezed in\" to fit a tight schedule.  You want it to be just the right timing. I will be praying your surgery will be very soon!",
      "MessageIndex": 3,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724506",
      "Title": "surgery postponed sunflower45 BrendaD"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 3, 2010 03:07PM whippetmom wrote: Julie:  Next time you need to pick a better parking lot!!!! Right?  Well, this is the pivotal scary part for most of us....the very first indication something might be amiss....the ultrasound....the biopsy...It can be crazy-making stuff indeed.  I also have a family history like yours, quite a bit more extensive into other generations - but I had lumpy, bumpy breasts and especially in my 40's it seems.  The MAJORITY of lumps and bumps are negative....not cancer.  So right now, in the waiting \"abyss\", you are weighing HEAVILY on the negative side of the spectrum.   Just keep that in mind.  And I think what most of us came to realize is that we could do nothing about the horrible waiting period and so it is better to find ways to otherwise occupy your mind and your time and try not to let this consume you.  You can find a lot of information at the FORCE website, which is for anyone with a familial or hereditary risk of breast cancer. http://www.facingourrisk.org/ And keep asking questions and searching through these forums and staying involved and informed.  Being informed and seeking the support of those who have forged the way before you will be a comfort and a source of encouragement and strength.  Hang in there.  Let us know the results from your US this week... Deborah",
      "MessageIndex": 1,
      "PostDate": "03/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752131",
      "Title": "I'm petrified but bravo to all of you! juliaflood Lisa1962"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 10, 2008 12:39PM whippetmom wrote: I am 58 years of age with a very strong family history of BC [negative BRCA 1 or 2].  My mass is less than 1 cm, Grade 1, ER+ and I am a good candidate for lumpectomy.  However, this is out of the question for me.  For the past twenty years I have talked to doctors about having a prophylactic mastectomy and they were willing to do this, but nearly all of them kept thinking that I should wait...you know...\"the cure is right around the corner.\"  Well, I waited and now they are coming off.  Like so many others who have responded to your question, I do not want to go through this again.  One of my aunts opted for lumpectomy and she had a recurrence ten years later, with another lumpectomy and one month ago was diagnosed a third time.  This time she has to have bilateral mastectomies and she has had so much radiation with the last two lumpectomies, her surgeon says she is not a candidate for reconstruction.  She told me last week that she will always regret that she did not have her breasts removed with the first bout of BC.  But this is not the course for everyone.  It is a huge decision to make.  Many women choose lumpectomy and go through life without any recurrence.  It all depends on where you are in life, your family history of this disease, and how much you can deal with at the time of diagnosis.  A lumpectomy for me would be a simple surgery with minimal recovery time.  With bilateral masts and reconstruction I am looking at a year or more committment of recovery, possible complications, pain, social limitations, etc.  But this is the option I choose.  I know you will make the right decision personally.  You are asking a very critical question.  I wish this forum had been available for my mother and my aunts so very many years ago.",
      "MessageIndex": 26,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/724088",
      "Title": "For those who \"could\" have Lumpectomy.... why choose Mast? Estepp sbmolee"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Feb 2, 2009 03:11PM whippetmom wrote: MRI found my IDC.  The mammogram six months earlier did not detect it.  I have....oops....I HAD extremely dense fibrocystic breast tissue.  However, the MRI showed TWO lesions - biopsy confirmed one was benign but one was malignant. ",
      "MessageIndex": 10,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/728360",
      "Title": "What has been your experience with MRI and dense breast tissue? helene333 helene333"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 22, 2010 09:37PM whippetmom wrote:",
      "MessageIndex": 33,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 28, 2010 05:50PM whippetmom wrote:",
      "MessageIndex": 94,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 29, 2010 01:36PM - edited Jan 29, 2010 01:39PM by whippetmom This Scotland study is worth reading.  It depicts a follow-up of women originally assessed in 1996 in Scotland with symptoms of PMPS.  Forward to 2002, and these women were again assessed at a mean average of 9.0 years after their symptoms originated.  You need to read the entire article....it's not too long: http://www.nature.com/bjc/journal/v92/n2/full/6602304a.html Apparently being old and thin is a good thing. EDITED:  To correct dating issues",
      "MessageIndex": 103,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 9, 2010 09:56PM - edited Mar 9, 2010 10:11PM by whippetmom Doctors have known about the use of paravertebral nerve blocks for a long time....so I am wondering how a paravertebral block differs from the procedure mentioned by our Canadian sister, Souad?  Did some of us, all of us, none of us receive this paravertebral nerve block prior to mastectomy? Published in 1998: Ann Surg. 1998 April: \"Use of paravertebral block anesthesia in the surgical management of breast cancer: experience in 156 cases\" . E Coveney, C R Weltz, R Greengrass, J D Iglehart, G S Leight, S M Steele, and H K Lyerly  http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1191303/ Published in 2006.... Preincisional Paravertebral Block Reduces the Prevalence of Chronic Pain After Breast Surgery http://www.anesthesia-analgesia.org/cgi/content/abstract/103/3/703 Published 2008: \"ACUTE AND CHRONIC PAIN FOLLOWING BREAST SURGERY\" Authors: Serene H. Chang, Vivek Mehta, and Richard M. Langford Barts and The London NHS Trust, United Kingdom Received 16 July 2008;  revised 9 December 2008;  accepted 2 January 2009.  Available online 10 February 2009. Summary Background Successful acute pain management after breast surgery remains challenging, and if not achieved, may increase the likelihood of subsequent chronic pain. Aims This article aimed to evaluate the evidence for varied techniques described for peri-operative pain management in breast surgery, and to review the literature on chronic pain after breast surgery and particularly ‘post-mastectomy pain syndrome'. Method A Pubmed search was performed, with the key words \"mastectomy\" and \"pain\" for articles in the English language in the adult human population (age > 19 years), looking specifically for different analgesic techniques that have been evaluated. Results Thirty-three peer-reviewed publications with pain outcome data were included, ranging from 15 to 289 patients per study (total n = 2104). Twenty three were randomised controlled trials and the rest were prospective or retrospective audits and case series. Inconsistent trial methodology precluded a meta-analysis. Paravertebral local anaesthetic nerve blockade resulted in lower pain scores and fewer side effects than opioid-based regimens. Three risk factors emerged predicting chronic pain post-mastectomy: higher post-operative pain scores, age <65 years and inclusion of major reconstructive surgery. Conclusion Paravertebral block should be considered for use in major breast surgery. Pain control should be optimised/a priority for both acute care and to potentially reduce chronic pain.",
      "MessageIndex": 282,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 4, 2010 11:11AM whippetmom wrote: Fog:  I do not think I would ever want to come home, if I were you!  Well, I would come home, but I would be followed by a container of french antiques and architectural finds....and FABRIC!  I love fabric! Okay, on to issues relative to this thread:  My sister told me that your  Dr. Robert Wascher is at Kaiser in Irvine, CA.  That is my medical facility - I am a Kaiser member and that is my hospital.  But I do like my oncologist now - have no complaints.  But I certainly have entertained the thought of transferring over to him, just to be on the cutting edge of treatment when it comes down the pike.  It sounds like he \"gets it\".... Anyway...bonjour and hurry home, because this thread misses you! Deborah",
      "MessageIndex": 395,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 3, 2010 10:42PM whippetmom wrote: CLEAR PASSAGE THERAPY:  CAUTIONARY STATEMENT.... Okay, I have been researching this for the past twenty minutes only and I have come up with some comments regarding this \"patented\" treatment - and I would suggest that you withhold divesting any of your hard earned cash into this until further notice.  One medical doctor's blog states as follows: http://doctorandpatient.blogspot.com/2006/01/clear-passage-therapy-taking-infertile.html I am sure I will find some others.....",
      "MessageIndex": 427,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 9, 2010 12:03PM whippetmom wrote: Ashlynn:  Thank you for clarifying.  I think that members can explore further the PT options you provide if they are inclined to do so.  It may well be that someone could benefit from the services you provide. However, you joined bc.org with the express purpose of posting and advertising your services, which really is inappropriate.  All of your posts have been referable to promoting Clear Passage PT. Your posts have been in violation of Breastcancer.org policies, to wit: These guidelines remain in place for the protection of bc.org members.",
      "MessageIndex": 440,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 5, 2008 10:54PM whippetmom wrote: Danielle: What does your oncologist recommend?  I have a history just like yours - maternal grandmother, mother, maternal aunts, but negative for the BRCA gene.  I am 58 years old and was recently diagnosed and went through bilateral mastectomies with reconstruction.  I do agree with loracc that you are very young, but you are wisely asking the appropriate questions.  At what age were your maternal family members diagnosed with BC? Have you met with a breast cancer genetics counselor to discuss your risk potential?  You are absolutely doing just what you should be doing.  Asking questions, exploring options and making every effort to ensure you come to the right decision. ",
      "MessageIndex": 12,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/722886",
      "Title": "I have the Gene-Is Surgery the Answer? dandee354 Bronwen"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 23, 2011 07:48PM whippetmom wrote: bumping for dragonflymary",
      "MessageIndex": 637,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 8, 2011 07:10PM whippetmom wrote: kitkat....I have been researching the scar tissue dilemma.  I am a proponent of fat graft transfer for post-radiation complications and for repair of post-mastectomy defects.  A BH doctor has apparently found success with this.... http://www.stem-cell-lift.com/post_cancer_stem_cell_reconstruction.html",
      "MessageIndex": 688,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 12, 2011 01:27PM - edited Aug 12, 2011 01:40PM by whippetmom Lee:  My own PS did it the same way that Dr. Khouri does - just in smaller quantities, to fill in contour defects, not build a mound.  As I stated, it is all a matter of \"refinements\"...in the manner in which the fat is applied to the mound.  Edited to add: In my case, the fat was applied in many locations for purposes of shaping the mound, filling in ripples and other contour defects.",
      "MessageIndex": 725,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 14, 2012 12:00AM - edited Jan 14, 2012 12:01AM by whippetmom mlp730:  The data you request is posted on Page 27 - one page back on this thread - half way down the page. kriserts:  Would you mind PM'ing me the name of your doctor?  I would like to add him to my referral list.  I am very encouraged that he is doing this in his practice. Deborah",
      "MessageIndex": 824,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 17, 2013 11:57AM - edited May 17, 2013 12:03PM by whippetmom I have been researching updated materials re: PMPS.  I think that it is, by now, pretty clear that the incidence of PMPS could be avoided if the breast surgeon avoids dissection of the intercostobrachial nerve during the mastectomy procedure.  This could reduce the incidence of PMPS from 50% to 25%.  The studies prove that this is a huge leap in improving the odds of the patient developing PMPS.  This is an issue which should be discussed with the breast surgeon PRIOR to mastectomy. http://archive.ispub.com/journal/the-internet-journal-of-surgery/volume-23-number-2/evaluation-of-the-role-of-preservation-of-the-intercostobrachial-nerve-on-the-post-mastectomy-pain-syndrome-in-breast-cancer-patients-of-north-india.html#sthash.Nmd3TckD.dpbs Deborah",
      "MessageIndex": 985,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 28, 2015 09:14PM whippetmom wrote: ASCO News re: Treatment for PMPS I have not been to this thread for awhile, so I apologize if this is \"old\" news. In the event it is not, it is worth pursuing as a solution to chronic PMPS pain. A non-surgical, non-invasive treatment and so simple if it works. Deborah ",
      "MessageIndex": 1281,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 3, 2011 08:01PM whippetmom wrote: Does your mother's insurance have coverage for the Mayo Clinic in Scottsdale?  All of the breast surgeons there are pretty fabulous.  You can click on this link and make an appointment...or at least obtain further information. http://www.mayoclinic.org/breastclinic-sct/appointments.html I'll ask on my thread and see if some of the other AZ gals can help as well... Deborah",
      "MessageIndex": 4,
      "PostDate": "03/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/777459",
      "Title": "Breast cancer surgent in Arizona? A1B1 A1B1"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 26, 2010 07:55PM whippetmom wrote: Hip - Don't go out and buy a tens unit or any other kind of gadget.  You should have a physical assessment before anyone recommends some mode of treatment which results in an out of pocket expense or some piece of equipment which might not be appropriate for your issues.  Also, the jury is out whether it is or is not a variant of LE.  Some qualified, exemplary pain medicine experts believe there is some relation.  So just make sure your guy is qualified as a LE physical therapist.  I think we have to be careful about massage also.  My neighbor just two weeks ago went to an overly aggressive massage therapist and came home in extreme agony.  She went to the doctor the next day and learned she had a rotator cuff tear.  We don't want to add insult to injury here....",
      "MessageIndex": 70,
      "PostDate": "26/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 1, 2010 06:22PM whippetmom wrote: souad:  Amazing....utterly amazing.  I did a little googling and the first thing I came up with was this article linked below.  Does the word \"PREVENTING\" just jump out at you?  There is plenty of information out there available and so why are these preventative measures not being performed?  Certainly cost is the most obvious factor.  Perhaps there should be a thread started which reads, \"WARNING:  BEFORE YOU UNDERGO MASTECTOMY, READ THIS\"....with information of this ilk so that patients can print and provide this information to their care providers. http://www.rsdfoundation.org/en/Preventing_RSD_Mastectomy.html",
      "MessageIndex": 230,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 2, 2010 12:06AM whippetmom wrote: Shoshi:  Go to someone who will RX antibiotics right now if you need them and worry about who to see thereafter for other issues. ",
      "MessageIndex": 236,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 31, 2010 07:41PM whippetmom wrote: Laura:  I had no idea!!!  My sister emailed me to let me know what was going on with you.  I am so, so sorry.  You will be in my daily prayers my dear friend....",
      "MessageIndex": 420,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jun 3, 2010 10:50PM whippetmom wrote: From another infertility clinic M.D. with warnings against certain therapies, under which Clear Passage was listed: \"9. Physical therapy and massage therapy to remove adhesions. \"Clear passage\" at www.clearpassage.com claims to achieve excellent success rates with \"site-specific\" massage, which they believe \"decreases adhesions and increases function of the organs.\" This is an excellent example of quack therapy ( to learn how to identify quackery read www.quackwatch.com). However, it's all just clever marketing ( what a lovely name they have selected !) . Their claims that their \"medical studies \" were \"recently honored with induction into the US Library of Medicine\" will unfortunately mislead naïve patients into believing that this therapy works, when every surgeon know that it's impossible to remove adhesions without surgery - after all, scar tissue does not melt because you knead it ! Not only do all these treatments waste time, money and energy, they also cause patients to get fed up and frustrated, so that they end up losing confidence in doctors - and in themselves ! The worst kind of hope is false hope - and these treatment offer unsuspecting patients just that, and nothing else. The only antidote against this is information and education, so you can protect yourself from such harmful treatments.:",
      "MessageIndex": 428,
      "PostDate": "03/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 17, 2010 04:35PM whippetmom wrote: Bump",
      "MessageIndex": 519,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 18, 2010 10:39PM whippetmom wrote:",
      "MessageIndex": 522,
      "PostDate": "18/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 04:42PM - edited Aug 10, 2011 04:46PM by whippetmom Dawne-Hope - Fat grafting is all the same.  It all depends on the refinements to the fat [e.g., harvesting stem cells from that fat, as in what Cytori Therapeutics is doing] and the amount of fat taken for the purpose intended.  It takes far less fat to fill in a step-off deformity than it does to create a presentable mound on the chest wall, the latter representative of what Dr. Khouri is doing.  I think it is pretty darn marvelous that our own fat which we might have abhored for decades, can give back to us when we need it most. ",
      "MessageIndex": 712,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 12, 2011 03:46PM - edited Aug 12, 2011 03:47PM by whippetmom Plastic surgeons have differing opinions on the method of FGT, but the premise is all the same.  Harvest fat and apply it to another location on the body.  It is the methodology of extracting or applying, and/or refining of of the fat which differs... http://www.realself.com/question/how-does-fat-transfer-work But it was in 1984, that Mel Bircoll M.D. \"introduced micro injection of fat grafts using liposuction techniques.That development allowed more plastic, dermatological and cosmetic surgeons to offer their patients fat transfer for cosmetic reasons.\" Micro fat graft transfer is a technique used by many physicians. ",
      "MessageIndex": 726,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Nov 7, 2011 02:03PM whippetmom wrote: RNjules:  Instead, ask your PS to refer you to a Pain Mgt specialist. They are the ones to address PMPS.  I would ask specifically for either Jamie Miles, MD at Kaiser/Woodland Hills or Patricia Harrison, MD at Kaiser Sunset.  Woodland Hills is closer for you. ",
      "MessageIndex": 785,
      "PostDate": "07/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 14, 2012 12:35PM whippetmom wrote: Here is the link for clicking...[hint: when you want to insert a highlighted link, go to the end of the link and hit your \"enter\" key and it will highlight... http://www.ncbi.nlm.nih.gov/pubmed/21788826",
      "MessageIndex": 826,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 18, 2011 12:56AM whippetmom wrote: I see my oncologist every 6 months for five years. ",
      "MessageIndex": 25,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/766265",
      "Title": "survey: how often do you see your oncologist? kristinpianista Lena"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 1, 2010 03:19PM - edited Mar 1, 2010 03:21PM by whippetmom Fog....You need to contact Oprah!  Or Dr. Oz!  Get this on national television!!! Dr. Oz... http://www.doctoroz.com/share-your-story-topics",
      "MessageIndex": 228,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 1, 2010 06:42PM whippetmom wrote: But then if any of us thought of contacting the Dr. Reuben, who penned the above research article, for further information, we might have to think again.  We might be writing to him in prison.  What a disappointment! http://www.naturalnews.com/028194_Scott_Reuben_research_fraud.html Of course, this is NOT to state that the research Dr. Reuben provided regarding the prevention of PMPS was not valid....or was fraudulent.  But this is sort of crazy-making stuff....",
      "MessageIndex": 231,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 10, 2010 09:09PM whippetmom wrote: Fog:  Your da woman!  I like it!",
      "MessageIndex": 284,
      "PostDate": "10/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 4, 2010 06:06PM whippetmom wrote: Really Binney?  I am so sorry to hear about that.  I am a bit perplexed anyway about Dr. W's role in PMPS...because he is a surgical oncologist.  Is this an arena - pain management - something oncologists typically address?  I ask, because my own oncologist seems like she is only interested in pharmacology. ",
      "MessageIndex": 397,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 28, 2010 05:47PM whippetmom wrote: Bump",
      "MessageIndex": 412,
      "PostDate": "28/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 30, 2011 12:38AM whippetmom wrote: Bumping",
      "MessageIndex": 639,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 4, 2011 10:36PM whippetmom wrote: veggiegal: When it comes to remedies and treatments for PMPS - it is a subjective issue.  Pain is a subjective issue.  What works for some, will not work for others.  So try a TENS unit.  Try any non-invasive, non-addicting remedy, - as something might help relieve the pain.  If narcotic pain meds do not relieve the pain, do not use them. ",
      "MessageIndex": 654,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 10, 2011 05:32PM whippetmom wrote: I must add re: fat graft transfer, that the skill of the surgeon performing the procedure is also very important.....",
      "MessageIndex": 716,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 13, 2011 03:22PM whippetmom wrote: beacher:  Oh my goodness, yes I have two plastic surgeons in mind.  One of them is in San Diego and the other Santa Monica.  I'll PM you....",
      "MessageIndex": 730,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Dec 2, 2011 09:54PM - edited Dec 2, 2011 09:56PM by whippetmom Did I ever post this?  Seems like I posted it once before, but it bears repeating.  A study published in August, 2011: Plastic & Reconstructive Surgery:    August 2011 - Volume 128 - Issue 2 - pp 349-352        doi: 10.1097/PRS.0b013e31821e70e7Breast: Original Articles AUTOLOGOUS FAT GRAFTING IN POST-MASTECTOMY PAIN SYNDROME Background: Mastectomy with axillary dissection is still one of the most common procedures in oncologic surgery. Unfortunately, a condition of neuropathic pain, termed postmastectomy pain syndrome, can appear after mastectomy. Although evidence regarding the epidemiology of postmastectomy pain syndrome is well researched, an effective therapy is still unknown. The aim of this study was to assess the clinical effectiveness of lipoaspirate graft in the treatment of postmastectomy pain syndrome. Methods: From February of 2006 to August of 2008, a total of 113 patients affected by postmastectomy pain syndrome and severe scar retractions were enrolled for this clinical study. Seventy-two patients were treated with autologous fat grafted in painful scars, and 41 patients did not undergo any further surgical procedure. Pain assessment was performed using a visual analogue scale before and after treatment, with a mean follow-up of 13 months. In addition, antalgic drug intake was recorded in the 34 patients who received a surgical treatment. Results were analyzed using the Wilcoxon rank sum test. Results: A significant decrease in pain according to the visual analogue scale was detected in patients treated with autologous fat graft (3.23-point reduction, p = 0.0005). Twenty-eight of 34 patients stopped their analgesic therapy with a significant follow-up (13 months). Conclusions: Autologous fat grafting is a safe, relatively noninvasive, and rapid surgical procedure. The authors' results suggest its effectiveness for treatment of postmastectomy pain syndrome.",
      "MessageIndex": 800,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 23, 2015 02:34AM whippetmom wrote: Sorry for the delay in responding....but no, I do not know anything about the differece in location. Something to discuss with your physician. Let us know if it helps!",
      "MessageIndex": 1288,
      "PostDate": "23/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 20, 2010 12:07AM whippetmom wrote:",
      "MessageIndex": 9,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 20, 2010 08:24PM - edited Jan 20, 2010 08:30PM by whippetmom RE: Shoulder pain:  Dr. Burton told me during our conversation that many women with PMPS develop \"frozen shoulder\" syndrome after mastectomy and that this is one of the complications of PMPS to watch for.... fogandroses...Good for you sending that letter!  We need to bring this topic and syndrome out of the closet!!! Interestingly, Washington Hospital RECOGNIZES this as a valid syndrome and calls it a \"newly recognized pain syndrome\".....amazing...and it was written about and well-documented in 1998....perhaps earlier..... http://www.whcenter.org/body.cfm?id=558137",
      "MessageIndex": 14,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 20, 2010 09:23PM whippetmom wrote: Thank you Faith....let those gals know about this thread....it is all \"connected\"... Another article..... http://www.rsdfoundation.org/en/Preventing_RSD_Mastectomy.html",
      "MessageIndex": 17,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 21, 2010 06:15PM whippetmom wrote: michiganmom:  Here is the contact info for Dr. Burton at MD Anderson. How kind of you to write to him to acknowledge him in this regard.  I am also going to PM you... http://faculty.mdanderson.org/Allen_Burton/",
      "MessageIndex": 29,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 29, 2010 09:30PM whippetmom wrote: Boy howdy do I agree!  But I want 60 to be the new 40!!!  ",
      "MessageIndex": 109,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jan 30, 2010 06:12PM whippetmom wrote: An older article....an axillary hematoma possibly being culprit for PMPS....looking for more current data: http://www.painjournalonline.com/article/S0304-3959(03)00492-5/abstract For those who have yet to undergo mastectomy....worth mentioning to your breast surgeon: http://clinicaltrials.gov/ct2/show/NCT00913003",
      "MessageIndex": 119,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Apr 25, 2010 06:09PM whippetmom wrote: Bumping",
      "MessageIndex": 383,
      "PostDate": "25/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 25, 2010 07:58PM whippetmom wrote: Bump",
      "MessageIndex": 410,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 7, 2011 03:17PM whippetmom wrote: lisaelder:  There are several doctors in the U.S. who are now performing lymph node transfer with success in some women with lymphadema.  Dr. Marga Massey of NOLA [offices in Charleston, Chicago and New Orleans, I believe] and Dr. Julie Vasile - in New York - are combining this with autologous flap procedures.  http://www.drmarga.com/whatlymphedema.html http://www.julievasilemd.com/pages/lymph-node-transfer I would pursue anything which might give you some relief, if your symptoms are as unbearable as you describe.  You have every reason to live and survive this.  I am praying you find some answers here!",
      "MessageIndex": 665,
      "PostDate": "07/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Jul 14, 2011 01:30PM whippetmom wrote: Bumping...",
      "MessageIndex": 701,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Aug 13, 2011 01:00AM whippetmom wrote: Beacher: Good for what procedure? Fat graft transfer??",
      "MessageIndex": 728,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "Mar 30, 2013 02:34AM whippetmom wrote: Maggie, I have sent you a private message.",
      "MessageIndex": 973,
      "PostDate": "30/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "whippetmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/74680/profile",
      "Content": "May 17, 2013 12:03PM whippetmom wrote: From another study..... PATHOPHYSIOLOGY Postmastectomy pain syndrome (PMPS) is caused by direct nerve injury (eg, severance, compression, ischemia, stretching, retraction) during the breast cancer operation or from subsequent formation of a traumatic neuroma or scar tissue [5,6,14,16-18]. Breast cancer operations can damage the brachial plexus, intercostobrachial, lateral cutaneous branch of the second intercostal, long thoracic, and medial and lateral pectoral nerves that innervate the breast, chest wall, and ipsilateral extremity (figure 1 and figure 2 and figure 3) [6,16]. In particular, surgical procedures in the upper outer quadrant of the breast and axilla, where major nerves traverse the operative field, are particularly vulnerable to nerve injury [17,19]. In addition, local radiation treatments and neurotoxic systemic therapy (eg, taxanes, platinum agents, vinca alkaloids) can also exacerbate PMPS [6-8,14,20,21].              ",
      "MessageIndex": 986,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    }
  ]
}