{
  "AuthorID": "whisperingw…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127657/profile",
  "Posts": [
    {
      "AuthorID": "whisperingw…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127657/profile",
      "Content": "Jul 23, 2011 03:33PM - edited Jul 23, 2011 03:41PM by whisperingwolf I start radiation on Wednesday the 27th of July. This Wednesday. This Monday, the 25th,  I have a \"re-marking appointment\" (some of the markings from my simulation came off along with the adhesive over them); Tuesday, the 26th, I have a \"confirmation appointment\" where they'll take x-rays to make sure everything's right and tattoo and such; and, then my actual rads treatments begin on Wednesday. Wednesday afternoon, I hope, as I'm mostly useless in the mornings. I hadn't worried about this stage of treatment at all. Out of everything, radiation was the least scary part going into this ( I was diagnosed in Dec. 2010 ). I've already been through all my chemo (AC + Taxol), which lasted December through April. I had a double mastectomy w/axillary node dissection on the right in mid-May; then, I had my expanders (for reconstruction) fully inflated (still in - will have exchange surgery post-rads) during June-July; and, now, it's time for radiation to begin.  And, I am freaking completely out.  I just took a Xanax - an Rx I didn't need before I had this da*n cancer diagnosis. But, why NOW am I freaking out about radiation? Right now, I don't want to go, I'm scared to death!  Even though my rational mind knows it is not a big deal ( I'm having rads M-F for 7 weeks, daily, four or five fields will be irradiated, an extra 1/2 week was added on to the original 61/2 weeks because 1 of my 5 axillary nodes were + with cancer ), I'm having one anxiety attack after another. My anxiety disorder was bad enough before cancer; cancer doesn't do much to help it. I, at this point have \"no evidence of cancer\" post-surgery: margins all clear ( though the one by my chest wall was only 1mm away! Thank God for good timing! ). So the rads are preventative / precautionary because my cancer was so aggressive and I'm at high risk for recurrence ( BRCA2+ & young & grade 3 & Stage IIIa at diagnosis & estrogen+ & her2+ ). So I am absolutely grateful there is no visible or \"findable\" cancer in my body right now. Soon I will also begin Herceptin treatments and Tamoxifen to help prevent a recurrence or metastases. In 10 years or so, I'll have my ovaries removed to prevent ovarian cancer, as well. Then I start wondering, will rads even make any difference at all? My doctor said he estimates my chance of recurrence, including rads and everything, to be 20-25%. But as to rads. I was never worried about them. So why now?! Is there anything anyone can suggest to help me calm down? Please? I haven't worried about this at all - in fact, I was looking forward to it, because it would mean the \"hard parts\" were behind me. But now - freaking freaking out so much. I can barely breathe. I've tried Xanax & exercise, watching TV, nothing is working to distract me. Thank you thank you thank you thank you!",
      "MessageIndex": 350,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "whisperingw…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127657/profile",
      "Content": "Jul 23, 2011 04:04PM whisperingwolf wrote: Barb, that helps very much just to read that I'm not the only one to have this reaction to it. I don't know why I'm feeling this way - I'm crying off and on, as well. Seven weeks isn't terribly long, and I know I shouldn't worry so much. But I do. Thank you for your prayers, and I'll be praying for you also. ",
      "MessageIndex": 352,
      "PostDate": "23/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/769895",
      "Title": "July 2011 rads Merilee jankc"
    },
    {
      "AuthorID": "whisperingw…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/127657/profile",
      "Content": "Jun 16, 2011 07:30PM whisperingwolf wrote: Hi Vivie, I agree with what Irr4993 wrote - just after getting diagnosed, is the hardest part. I'm just a little older than you, I'm 30, and I'm hard of hearing - so wear hearing aids (or am supposed to LOL). The way you found your cancer is a lot like how I found mine - I found it myself, when something hurt a little bit on my right breast. Turned out to be cancer. I never expected it, especially not at 30.  I never thought about that, how a CI would impact different types of imaging. But I am sure your doctors will be able to find alternative ways of getting the information they need! And if you ever don't feel comfortable with one doctor or like what he or she has to say, don't hesitate to get a 2nd opinion, if you can. I did, when it came to my reconstruction, and I was so happy i did; the doctor I ended up with was so wonderful compared to the first.  If you have any questions, please ask! This is a great site.",
      "MessageIndex": 3,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/770423",
      "Title": "Just dx'd Vivie Vivie"
    }
  ]
}