{
  "AuthorID": "whitelight-…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287731/profile",
  "Posts": [
    {
      "AuthorID": "whitelight-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287731/profile",
      "Content": "Apr 3, 2019 02:40AM whitelight- wrote: Cecyc,  I am so pleased for you and sorry that cancer took your brother, of course that would have brought up so much emotion.  xxx Good ho xxx",
      "MessageIndex": 15,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    },
    {
      "AuthorID": "whitelight-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287731/profile",
      "Content": "Apr 2, 2019 08:45AM whitelight- wrote: Cecyc, I am waiting too. I do have a definite appointment for the 10th of April, which is fine by me. I wouldn't want to be told over the phone, that is brave of you to ask. I will go alone to get my results but want to be able to ask questions then and there, over the phone would feel so cold and impersonal to me. I shall have some questions written down and shall take a note pad with me. I had the biops on Saturday 30th March - went straight to buy a packt of cigarettes ( having stopped I absolutely needed one then!) came home and went to bed with healthy sandwiches and ginger and turmeric tea and watched who-done-its until I went to sleep. The next day I was out and about but yesterday only did what I had to do and back in bed with junk tv - ditto today, so far. I am not thinking about it all of the time but of course it is always there - I am sure my lumps are not benign but am now resisting 'researching' anymore on line. We shall both know soon enough and 'it' will or will not have a specific name. Our medics will tell us what treatment they can offer, if we need it, we can then go away and do some specific research and decide what we want to do. Tomorrow I have arranged to go for a long walk with dogs and a friend but for most of the time, I know that I will just curl up. The waiting game is alway tough, isn't it? The waiting always ends though and meanwhile we just have to get through as best we can - anyway we can. The Artist's Way by Julia Cameron - or some such, is not a bad idea at times like this --- I think I might do it again tomorrow but I just feel wounded at the moment - and need to just curl up. Love be with you all xxx ",
      "MessageIndex": 8,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    },
    {
      "AuthorID": "whitelight-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287731/profile",
      "Content": "Apr 2, 2019 02:33PM whitelight- wrote: Let us know xxx",
      "MessageIndex": 13,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    },
    {
      "AuthorID": "whitelight-…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/287731/profile",
      "Content": "Apr 2, 2019 02:32PM whitelight- wrote: Strength comes in many forms. I am using this waiting time to let 'it' sink in slowly - 'it' not being certain but possible and in my case probable. I am allowing myself a sort of freedom, a freedom to do what I feel like doing as opposed to what I should be doing but in that I am lucky, lucky that, apart from darling pups, I live alone and have no everyday responsiblities now that I have deferred my studies until this adventure/ordeal is over - I do think I might be a bit grumpy to live with at the moment so it is just as well I'm alone. For those of you who have loved ones at home it must be terribly hard in other ways than it is being alone with it.",
      "MessageIndex": 12,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/870751",
      "Title": "How do you cope? cecyc cecyc"
    }
  ]
}