{
  "AuthorID": "white4",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286282/profile",
  "Posts": [
    {
      "AuthorID": "white4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286282/profile",
      "Content": "Apr 2, 2019 07:10AM white4 wrote: Hi Lilahope777. Mom is stable. Still on the ventilator. Dialysis is going well also. We are still awaiting the results of her bone marrow biopsy. For her pancytopenia all they are really doing right now is transfusing with platelets or RBC when her number drop below a certain threshold. They can’t find any cause of her levels continuing to drop. They haven’t said to much about the kidney failure. Other than it could be from all the antibiotics and medications she was given at first to treat the pneumonia. It’s so frustrating because I jut feel like I’m not getting gettjng all answers I need",
      "MessageIndex": 3,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870726",
      "Title": "To sick for treatment white4 lilahope777"
    },
    {
      "AuthorID": "white4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286282/profile",
      "Content": "white4 wrote: Hi everyone! I’ve been reading these threads the last few months religiously. I havent felt the need to post until now. My mom was diagnosed with stage IV MBC just three short months ago with mets to the bone and liver. She has been pancytopenic for about a month now with constant of platelets and blood. Her doctors are just now doing a biopsy of bone marrow and we are awaiting those results. She has been to I’ll for treatment other than a few weeks of radiation in a few weeks of Letrozole. We were told yesterday that her kidneys were failing and they started dialysis. She also has a hospital acquired infection in her lungs (pneumonia) from being placed temporarily on a ventilator. I guess I’m just hoping for someone with s similar story that could shed some hope or light. I’m devastated and don’t even feel like I have had tome to even process that she has cancer. I just want more time with her. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "31/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870726",
      "Title": "To sick for treatment white4 lilahope777"
    },
    {
      "AuthorID": "white4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286282/profile",
      "Content": "Apr 2, 2019 03:09PM white4 wrote: Hi SandiBeach57. Thank you for the encouraging words. They are definitely needed!! My mom is the strongest person I know and if anybody can fight this it's her. I'm just feeling so discouraged by everything her providers are saying. I wish someone would just try some type of treatment her chemo. What do we have to lose?",
      "MessageIndex": 6,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870726",
      "Title": "To sick for treatment white4 lilahope777"
    },
    {
      "AuthorID": "white4",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/286282/profile",
      "Content": "Apr 2, 2019 03:07PM - edited Apr 2, 2019 03:09PM by white4",
      "MessageIndex": 5,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/870726",
      "Title": "To sick for treatment white4 lilahope777"
    }
  ]
}