{
  "AuthorID": "whoablaze",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57910/profile",
  "Posts": [
    {
      "AuthorID": "whoablaze",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57910/profile",
      "Content": "Oct 25, 2007 03:18AM whoablaze wrote: Ladies, it is so nice to read your accounts!  I am having treatment in Germany and don't speak the language.  In turn, I don't get the individualized information and questions answered.  If I had not found information on these sites, I would have no idea what was to come.  I'm filling in the broken English with info I have picked up online.  I'm starting radiation today, and have already had my markings done.  I thought it odd they marked me with a marker, and put tape over it.  I've been worried the whole time I would lose the tape and have to go thru the marking appointment, again!  One thing I didn't know about is the special deoderant.  I wonder if my doctors will fill me in on that one...! Thank you for all of your info...in my case, it's more than just chat! ",
      "MessageIndex": 147,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "whoablaze",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/57910/profile",
      "Content": "Nov 30, 2007 10:06AM whoablaze wrote: I am having radiation now and use a razor every day.  I don't see any ill effects from it...haven't been told by the doctor to go without it, either.  I also have never been told to stop using my deodorant.  Maybe in Europe they don't have the same fears regarding razors and deodorant?  It does not seem to have harmed anything, yet.  I only have 12 or so treatments left.",
      "MessageIndex": 10,
      "PostDate": "30/11/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/689111",
      "Title": "Anyone use regular razor on pits during radiation? Stressin67 GardenGirl65"
    }
  ]
}