{
  "AuthorID": "Whovian05",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165364/profile",
  "Posts": [{
    "AuthorID": "Whovian05",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165364/profile",
    "Content": "Feb 15, 2014 04:55PM Whovian05 wrote: I have already posted in the \"Not yet diagnosed stage 4 but concerned\" sub-forum. I was initially diagnosed at age 33 with breast cancer eleven years ago. I had an aggressive tumor, which was ER+ and PR+. It was Her1 and Her2 negative. I did lumpectomy, chemo, radiation and tamoxifen. I had a baby, my only child, at the age of 40. I had an abnormal mammogram in November 2012 that showed atypical cells in my left breast (the breast with the original cancer). I had consulted with a breast specialist/plastic surgeon, only to have him refuse to do a mastectomy (long story there) in the summer. I decided to wait a couple of months before getting a second opinion. I had the bilateral mastectomy with expanders placed on December 19, 2013.The PS felt I would be a good candidate for expanders/implants because of how well the breast healed from radiation and the fact I had rads over a decade ago.  Because of the fact I had radiation to the left breast a decade ago, the plastic surgeon had to put Alloderm to help anchor the expander. The expanders feel like lead weights on my chest, making it harder to breathe deeply. In mid-January, I had only gotten two fills on my left side and three fills on my right side when I got a bad cold. After about three weeks, I still had the cold-low grade fever of about 99F, chills alternating with hot flushes, weakness, never-ending post nasal drip and coughing, along with bad shortness of breath and the feeling I couldn't breath in very deeply. I went to a six-month follow-up and had an x-ray that showed moderate pleural fluid. I had a thoracentesis a week and a half ago. The pulmonologist that I was referred to told me the pathology report showed atypical cells that were suspicious, but not diagnostic, for metastatic lung carcinoma. The fluid was cultured and tested negative for bacterial pneumonia. In other words,the results were not definitive, so I still don't have any answers. The pulmonologist is still leaning towards me having the pleural effusion due to viral pneumonia because the breathing problems didn't start until after the bad bout with the cold. I had another x-ray that shows I still have pleural fluid in my left lung. I also have mild swelling on my lower left ribcage and the feeling of pressure and pulling. I don't know how much of the pressure/pulling is also from my tissue expanders. I am scared that I have lung mets. How can I have all this pleural effusion from viral pneumonia???? I am feeling better, with the exception of the pleural fluid and post-nasal drip, along with the cough. I am so scared and depressed right now. I feel like going through with the mastectomy was a big mistake and all for nothing if I am now stage 4 with lung mets. I just want my life back-I want to be able to take care of my daughter, my dogs, and do all the things I was used to doing for myself before all of this. I wished I could just get my boobs back, at least I'd have something to fill out the dress that I'd be wearing in the casket. Thanks for reading all the way to the end of what seems like a long book.",
    "MessageIndex": 2078,
    "PostDate": "15/02/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
    "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
  }]
}