{
  "AuthorID": "Why2015",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233818/profile",
  "Posts": [
    {
      "AuthorID": "Why2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233818/profile",
      "Content": "Sep 17, 2017 03:24PM - edited Sep 17, 2017 03:24PM by Why2015 Sorry for your pain. I truly understand how to dejected you must feel. Take care of yourself and just take it minute by minute hour by hour, and the days will pass and hopefully you'll get your mobility back. This is the sisterhood I would never have wanted to be part of if given the choice",
      "MessageIndex": 17,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/851740",
      "Title": "Neck and shoulder pain - feeling so dejected jules72 jules72"
    },
    {
      "AuthorID": "Why2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233818/profile",
      "Content": "Sep 17, 2017 03:21PM Why2015 wrote: Hi, Sorry to hear you have been having pain. I have had neck pain and now have been diagnosed with a frozen shoulder. The pain is horrendous and I can't lift my arm or stretch it without experiencing severe pain. The PA indicated it's a result of breast cancer, surgery, and radiation. This damn cancer is the diagnosis that just keeps giving. I've had lymphedema and cording. Quality of life has gone from 9 to 3. I don't sleep nights, and I still have to work having a 12-hour day as a result of my commute back-and-forth. I am on tamoxifen which is giving me a big fat stomach and prevents me from sleeping. I'm so disgusted I could just break down and cry so fucking discouraged.",
      "MessageIndex": 16,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/851740",
      "Title": "Neck and shoulder pain - feeling so dejected jules72 jules72"
    },
    {
      "AuthorID": "Why2015",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233818/profile",
      "Content": "Jun 29, 2016 02:52AM Why2015 wrote: Your hair is beautiful and it will most likely grow back! There are many synthetic wigs you can buy which will look natural for about a fifth of the cost. Most people I've talked to who have lost their hair due to chemo have used synthetic wigs. I'm using one and I get compliments on it all the time. I can't say that any wig is comfortable to wear especially in the summer. You might check into having some fittings at a local hospital that may have a wig shop. Human hair wigs a sold as well. Best of luck to you and rapid healing   ",
      "MessageIndex": 9,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/845530",
      "Title": "Has anyone made a wig from their own hair? Lisey Lisey"
    }
  ]
}