{
  "AuthorID": "wilson33",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
  "Posts": [
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 16, 2012 10:56PM - edited May 16, 2012 10:56PM by wilson33 Hi I can't really comment on your post as I have little knowledge.  I do know the site has it's busy and quiet times. I hope you get to the bottom of it and a biopsy will help.  Try not to get too stressed about it and don't visit doctor google (through my own experience and anxiety)",
      "MessageIndex": 2,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787582",
      "Title": "Nipple retraction and a lump on an US- SCARED!! bea82590 Joanne58"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 18, 2012 03:06PM wilson33 wrote: Sommer43 is totally right and I couldn't of put it better if I tried :) Itchiness comes and goes and I am no longer embarrassed with good scratch in public, I say it is the new trend haha, I caught the bus driver have a nose at me once when I was being descret clearly need to work on the descret lol. I hope all goes well for you I am going to be taking a  long overdue holiday soon with the kids can't wait.  I am going to do a 1000 peice jigsaw after I tidy up a little.  Good luck with it all, there are many a people I wish I had for neighbours on this site they are kind and caring and answer all your questions.",
      "MessageIndex": 7,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787676",
      "Title": "Awaiting tests stickyspaniel stickyspaniel"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 18, 2012 02:07PM wilson33 wrote: Hi stickyspaniel, I have had an itchy nipple for 8 months with no outward sign too to my viewing or the gp's. I have had a scan and all came back clear :) I am no on steroid cream for the flacky itchyness I have had and fingers crossed it will work for me.  How are you feeling about it all?",
      "MessageIndex": 3,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787676",
      "Title": "Awaiting tests stickyspaniel stickyspaniel"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 13, 2012 01:11PM wilson33 wrote: yay - you must be delighted :)",
      "MessageIndex": 1,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789060",
      "Title": "Biopsy results pp729 wilson33"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 25, 2012 02:24PM wilson33 wrote: I WANT your doctors please, I like thorough.  I hope you get to the bottom of things and what the people above said.  Sending you happy thoughts and prayers, which ever you are into :)",
      "MessageIndex": 3,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788036",
      "Title": "Mammo, ultrasound, now MRI...What happens next? Denoby1030 CLC"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 2, 2012 02:44PM wilson33 wrote: I have had a second opinion within the same clinic and wel you know doctors they talk, so they all have me down I am sure on their computer as \"neurotic\".  I think a change of surgery might be the answer.  All becuase I don't have a lump or like the pictures in the text book I am so so so upset and so so so angry.  I really am hoping it isn't but I have exhausted all other possibilities. It is a case of sit and wait for the dermatologists appointment.  I can't take this anymore. Thank you for your help and advice.",
      "MessageIndex": 2,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 3, 2012 11:42AM wilson33 wrote: Hi Sommer43 I have to say I was over the moon when the ultra sound came back was not so happy with the attitude the satff had toward me but was very happy.  Since then the itching, burning pain has been getting worse, it really is affecting me on a day to day basis, it itches I pinch, I pinch it hurts but it beats scratching my nipple off.  It is a long time for the appointment with the dermatologist but yesterday I as reactive and not proactive with my post. My GP knows me and I see the same one.  I just fee with the gp's I have seen no one ever thinks outside the text book or pictures, as I do understand this doesn't happen very often.  I think it is a case of pure frustaration rather than anything else and it is something I need to deal with that myself. I went yesterday to see if she could push my dermatology appointment as urgent and she wasn't prepared to do that, which in turn is fair enough. I don't really need to prove what I feel I have as I am not medically trained. I feel I have exhausted all other possiblilities that the gp can give me without a referal.  I don't feel vitamin d defficency can cause this pain, itch, burning neither a thyroid gland.  I need to be cool and calm I get it, proactive not reactive, but if I can't vent here where can I vent? I am sorry if I have anoyed anyone but like all here we all want answers and I know patience isn't a strong point for myself, maybe I can do 1000 peices jigsaw and look after children with special needs, but waiting for an appointment is so hard.   Thank you for help",
      "MessageIndex": 8,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 22, 2012 02:51PM wilson33 wrote: I am intrigued by it too but don't know how it will pan out other than I know it is not a diagnosis but a step closer to look at a diagnosis.  I have drove myself insane and back again and now I am mediocre thanks to you nad your helpful uidance and advice and self knowledge it has been a balance level beem for me to kinda bring me back to earth, poltely and kindly :) I can't tell you how much I apreciated it then and now :) If doctors knew how much easier it would be on us for us to be felt as \"heard\" and \"listened to\" would make so much difference physically and mentally.  But no I think they like to dish out the \"chillax\" pills as it is written on the pen they use to sign the precription hahaha. I also commented in that thread how much of a help you have been and how I know how she feels as I have done it been there and still googling allternatives to what might be the problem, even down to dermatology I am open and just want the cause of it to be sorted and me have a happy breast again.  I believe I am not on a cancerous path but I am on a path and all leads led to this, so while I feared and felt the worst I am feeling optomistic and so much better and in a happier place, I hope it lasts - time will tell :) Thank you summer and I hope I can help you out at some point :) Thank you for your interest and insight and comfort :) big (((hugs)))",
      "MessageIndex": 87,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 22, 2012 03:19PM wilson33 wrote: I have found more bedside manor in the secretaries and nurses than I have from consultants, and some nurses who wish they were consultants but I always go in with a positive attitude and then I put my notes etc forward and then I get brushed off as the consultant has about 30 people to see and leaves me with a nurse to settle me down.  It is different yet the same in all hospitals but we are all human too at the end of the day and have good days and bad days but the reception staff are the best and always get my posh telephone manner lol and the cakes I make too :) process, protocol and all like you wanting to get to the bottom of it patiently, calmly and not let it take over my time from my kids and any more mental space in my head, but I know now all possibilities but my gut is saying something isn't quite adding up - so following my gut with a happy smile today :) I hope your pain is ok for you today :) ",
      "MessageIndex": 89,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "wilson33 wrote: Hi, well after 2 months of continuos tooing and frowing to the doctor with an itchy nipple and given thrush cream, didn't work, antibiotic cream, didn't work, stronger antibiotic cream still didn't work I still have the problem of an itchy nipple sometimes round my breast.  the pain increases after sex and the itching is to the point where I want to get the cheese grater for a bit of relief! I am told by my gp that it is snothing to worry about.  I have no disscharge and no pain under my armpit but chronic back ache between my shoulder blades and that started the same time a my itchy nipple.  I am now  in a place where I really wish it is thrush but nothing is working am I right to be getting a bit uptight? I am going on ym third month with this and it doesn't get any easier in fact I really want to buy some sandpaper :/  I do get some shooting pains across the top of my breast from outside in. Can anyone advise or help my mind from thinking the worst? Thank you Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 16, 2012 09:15PM wilson33 wrote:",
      "MessageIndex": 4,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 16, 2012 10:46PM wilson33 wrote:",
      "MessageIndex": 10,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 16, 2012 10:48PM wilson33 wrote: Coolbreeze, I have treid all of these before going to the doctor even had new bras, now I feel more comfortable without, my kids aren't too happy with the no bra situation, tried detergants and every cream possible I feel like a walking cream machine lol :)",
      "MessageIndex": 11,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 20, 2012 02:18PM wilson33 wrote: Lago, my doctor is convinced nothing serious is going on and I think my friendship between the doctor is going and I am loosing faith in her. I will try these things and give it a month, but what scares me is if I leave things too long and it turns out it is, can it progress too quickly? I will give it 3 weeks tops and a menstrual cycle. The hormones seem to kick it off more and my migraines are killing me :(  7 days before hand then when I have my cycle :(  I am speaking to her later with regards to my daughter so will ask her for one then if no luck will swap doctors -- thank you for your ongoing support :)",
      "MessageIndex": 22,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 28, 2012 08:12AM wilson33 wrote: Kaara, what can I say the doctors feel if you don't tick the boxes then it can't be (hoping it isn't) but I have been told it's nothing serious.  I have had 2 sorts of anti biotics (unfortunately I am alergic to penacylin and trimethaprim) before all this kicked  off for an ear infection that wouldn't shift. I am waiting for an appointment to come through but don't know if my doc says I can go or not only time will tell.  I am sure I could get a kick a** lawyer if things work oout for the worst.  I am doing everything else in the meantime to rule out as many options as possible as I shall sit at the hospital and not move until I am happy - if I get there!!  I don't know if we do thermograms here.  I have been looking into private care and not sure how it works or what I have to pay I just don't know. Prayers are always welcome and if the kids didn't keep me busy I would be doing my nutt.  What happened with you? Was it a fight for you to get seen?",
      "MessageIndex": 51,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Mar 18, 2012 06:27PM wilson33 wrote: Hi guys.  I have my appointment through for Thursday 22nd at 2pm. I have been spending much time sleeping and feeling sick of late, I think it's the new diet for lent! Dropped 2 dress sizes so can't be too bad. I now take the cheese grater to bed I am having to scratch round the itch now as I am so sore and bleeding I can't scratch it anymore.  I hope all gets sorted and will speak to you after my appointment x",
      "MessageIndex": 70,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Mar 22, 2012 07:15PM wilson33 wrote:",
      "MessageIndex": 71,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 16, 2012 02:49PM - edited May 16, 2012 02:49PM by wilson33 Nothing, he told me 6 weeks of the cream and I wil be as good as new so nothing I am cured well will be after 6 weeks :)",
      "MessageIndex": 77,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 12, 2012 12:30PM wilson33 wrote: oh ok, so that test is different from the one with the pertruity gland. I was wondering because my nipple is inverted but not when it wrinkles up when it is cold and my hormone level is up but was a different test.  Thank you for the input and I really hope you get to the bottom of your breast situation and all is well :)",
      "MessageIndex": 16,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 12, 2012 01:59PM wilson33 wrote: you too and thank you for helping me put my jigsaw together it is nearly complete that is how I am seeing everything :) I hoep all goes well with you to, will keep a watch on you :) in a non stalking way :)",
      "MessageIndex": 18,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 15, 2012 08:53AM wilson33 wrote: ElleBee I am so sorry but I can say this you are in good hands with support help advice and guidance here.  i wish you all the best I am sorry i can't advise other than prayers and (((hugs))) x",
      "MessageIndex": 20,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 20, 2012 02:45PM wilson33 wrote: Ok I need to be more assertive, I about broke down in the doctors saying enough is enough, so thursday I shall seek another opinion.  3 more weeks of itcching and pain and disscomfort I think I will loose my mind, thank you all",
      "MessageIndex": 25,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 22, 2012 07:44PM wilson33 wrote: I am sorry I can't be more assertive - I got told off, told it was nothing serious and now my armpit on the left side is itchy and feel like when my arms are down I have small golf balls in the way under my arms.  My left breast has started to burn and it hurts but it is not constant pain.  Could this be just an infection I am so worried :( I don't want to naff my doctor off or undermine her by having a second opinion I am a wimp :( 3rd night of oil of primrose supposed to wait another 3 weeks and 4 days before going back to the doctors I am crying I don't know what to do",
      "MessageIndex": 26,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 22, 2012 08:53PM wilson33 wrote: My husband is worried about me being worried about it. I don't like upsetting people or naffing them off but I think I need to oh jimminy cricket I could scream.  I can't take the burning feeling it is like white hot but not constant.  My daughter tickled me under my armpits this evening and I have never cried so much as my goodness it was soooooo painful my armpits were throbbing it wasn't her fault. I think I will take hubby or a a chaperone with me to the doctors and get it sorted, I shall go on Thursday when my usual GP is off - if no joy then private.  Thank you for your help all of you I am in such a pickle :(",
      "MessageIndex": 34,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 22, 2012 09:12PM wilson33 wrote: I have to say my daughter has got shingles at the moment, but I have no blisters - it was just my nipple that was itchy now it is the area around it and burning on the top of my breast just still on one of them.  Could be something to mention to the doctor.  I will let you know and keep you updated, thaank you all for your support",
      "MessageIndex": 37,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 28, 2012 10:34AM wilson33 wrote:",
      "MessageIndex": 53,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 28, 2012 12:03PM wilson33 wrote: OK spoke with the reception at the doctors and a referal has gone through to leicester glenfield hospital, so just waiting to hear from them.  We have mobile units that go round places doing screening but guess what here in the UK you have to be over 50!!!!!!!!!!!!!!!!!!! I am getting more and more concerned the more I read on the internet, so I am not going to do that and sorry if I sound lame.  I know something isn't right, I know it isn't in my head and I also know in my gutt there is nothing serious I don't know why I just do.  You all have been so supportive and can't thank you all enough",
      "MessageIndex": 54,
      "PostDate": "28/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 16, 2012 03:04PM wilson33 wrote:",
      "MessageIndex": 79,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 22, 2012 02:02PM wilson33 wrote: Summer I honestly can't answer that question becuase I don't know, and that makes me an airhead and a control freak like being in control of all situations. I now feel deflated :/  one day at a time :)",
      "MessageIndex": 85,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 19, 2012 11:25AM wilson33 wrote: Wishing you b9 results, everything crossed for you :)",
      "MessageIndex": 1,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789332",
      "Title": "Biopsy 6-18, Now I'm Waiting... Luke22_42 Luke22_42"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 12, 2012 12:01PM wilson33 wrote: what is dhea-s?",
      "MessageIndex": 14,
      "PostDate": "12/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787094",
      "Title": "A lump, and other \"lady issues\" ElleBee ElleBee"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 10, 2012 03:13AM wilson33 wrote: Hi teaalorca11, I too am waiting for my dermatology apoitment for next wed and the wait is the mot worrying time then the wait for results. You are in a good place here, I too have struggled to put me first and feel awful I need time off work to get to my appointment.  A holiday for me is taking the children i care for on holiday with me as I don't like letting people down.  I have turned the tables now because if I don't ook after me no one else will it seems selfish to think like that but it isn't. I have felt such relief since my appointment came through and feel I am going to get some answers :)  I hope you get to the bottom of it and keep us posted :)",
      "MessageIndex": 3,
      "PostDate": "10/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787235",
      "Title": "Freaking out about multiple health issues while waiting tealorca11 Blessings2011"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "wilson33 wrote: Hi, well after 2 months of continuos tooing and frowing to the doctor with an itchy nipple and given thrush cream, didn't work, antibiotic cream, didn't work, stronger antibiotic cream still didn't work I still have the problem of an itchy nipple sometimes round my breast.  the pain increases after sex and the itching is to the point where I want to get the cheese grater for a bit of relief! I am told by my gp that it is snothing to worry about.  I have no disscharge and no pain under my armpit but chronic back ache between my shoulder blades and that started the same time a my itchy nipple.  I am now  in a place where I really wish it is thrush but nothing is working am I right to be getting a bit uptight? I am going on ym third month with this and it doesn't get any easier in fact I really want to buy some sandpaper :/  I do get some shooting pains across the top of my breast from outside in. Can anyone advise or help my mind from thinking the worst? Thank you Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 24, 2012 08:12AM wilson33 wrote: Fergy that sounds so neat how one machine can detect that. I will of course share my findingd with you all but my ultra sound said I was in the clear. Good news or bad news?! Yesterday hit 25 degrees here in the UK to me and the fellow UK'ers it is hot, I stayed in all day apart from a couple of drives I needed to do, hubby got home, the kids got picked up and we went on our way.  1 hour and 20 mins in the car and finally arrived, she took some images but they were all RED becauase this muppet (me) didn't think to cover my chest and I got caught with the sun on the way there, I waited an hour to cool down on my own, the images were sent to america and were accepted but didn't know this until half way home and was crying my eyes out I feel like it is one step forward and two steps back.  I won't be able to know much because I am having another one in 90 days to compare.  I felt such an idiot. Although I would recommend one of these thermographs to everyone, was not invasive or uncomfortable and for me to be topless for over an hour I nearly charged her! lol. For those of you who can please it is so simple, it picks up fibro, dcis all sorts.  Will post data when I have it :)  Have a great day :)",
      "MessageIndex": 94,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 12, 2012 07:38PM wilson33 wrote: OK - been to the new GP as it was a quick appointment I only got to talk to him about one thing, so discussed my thyroid levels. I have an appointment on the 23rd or something for my breast issues. He listened to me, he asked me what I wanted to do and I broke down and cried. I explained I didn't want to leave my previous doctor who I have had for 10 years and briefly explained why. I also explained that my vitamin D level was down and he asked me how much I was taking and how long I said 1000 iu.  His eyes about popped out of his head and I paniced and thought I had overdosed, he told me with the defficency I have I should be on 10,000 iu, then my eyes about popped out of my head!!! Repeat bloods in July and vitamin D ordered from the net, and I am quite comfortable that I have fibrocycstic breasts and nothing serious, thermography test in August should comfirm my reasoning, or the doctor when I go see him. I am in a happier place but still so blooming tired.  Thanks for putting up with me and helping and supporting me.  (((hugs)))",
      "MessageIndex": 109,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 17, 2012 05:41PM wilson33 wrote:",
      "MessageIndex": 17,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 29, 2012 10:19PM wilson33 wrote: I have had a really bad couple of days with the burning behind my nipple, come you appointment! I hate waiting games, I am patient enough to look after children with special needs but why am I not patient when it comes to waiting for things for myself? I have brought myself a cross stitch and going to deliberately keep myelf busy.  So blooming tired",
      "MessageIndex": 59,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Mar 2, 2012 08:16AM wilson33 wrote:",
      "MessageIndex": 60,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "wilson33 wrote: Hi, well after 2 months of continuos tooing and frowing to the doctor with an itchy nipple and given thrush cream, didn't work, antibiotic cream, didn't work, stronger antibiotic cream still didn't work I still have the problem of an itchy nipple sometimes round my breast.  the pain increases after sex and the itching is to the point where I want to get the cheese grater for a bit of relief! I am told by my gp that it is snothing to worry about.  I have no disscharge and no pain under my armpit but chronic back ache between my shoulder blades and that started the same time a my itchy nipple.  I am now  in a place where I really wish it is thrush but nothing is working am I right to be getting a bit uptight? I am going on ym third month with this and it doesn't get any easier in fact I really want to buy some sandpaper :/  I do get some shooting pains across the top of my breast from outside in. Can anyone advise or help my mind from thinking the worst? Thank you Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 20, 2012 11:36AM wilson33 wrote:",
      "MessageIndex": 20,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "wilson33 wrote: Hi, well after 2 months of continuos tooing and frowing to the doctor with an itchy nipple and given thrush cream, didn't work, antibiotic cream, didn't work, stronger antibiotic cream still didn't work I still have the problem of an itchy nipple sometimes round my breast.  the pain increases after sex and the itching is to the point where I want to get the cheese grater for a bit of relief! I am told by my gp that it is snothing to worry about.  I have no disscharge and no pain under my armpit but chronic back ache between my shoulder blades and that started the same time a my itchy nipple.  I am now  in a place where I really wish it is thrush but nothing is working am I right to be getting a bit uptight? I am going on ym third month with this and it doesn't get any easier in fact I really want to buy some sandpaper :/  I do get some shooting pains across the top of my breast from outside in. Can anyone advise or help my mind from thinking the worst? Thank you Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 23, 2012 02:22PM wilson33 wrote: OK bit the bullet and went to ask another doctors opinion whilst sobbing my heart out feeling I had let my doctor down.  It isn't shingles :( Something in me really wished it was.  I am now on the wait to see if I meet the criteria for a scan or mammogramme!?!?! Criteria, so if you don't have a lump you can't get a mammogramme?  I am now deeply confused and await to hear from my GP to see what is going to happen.",
      "MessageIndex": 39,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 27, 2012 09:07PM wilson33 wrote: I am having really bad burning sensation tonight :( can't lie on my front my nipple hurts me a lot today waiting to hear from the hospital for an appointment unless head GP says no because I don't tick all the boxes :( what a rigmarole to always have a fight for what you need reasurrance in :(",
      "MessageIndex": 49,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 14, 2012 06:57PM wilson33 wrote: Oh my gosh I found my original post.  I am seeing the dermatologist on Wed morning what questions do I need to ask and what should I prepare myself for? Has anyone been through this?",
      "MessageIndex": 73,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 16, 2012 03:44PM wilson33 wrote:",
      "MessageIndex": 81,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 22, 2012 01:15PM wilson33 wrote:",
      "MessageIndex": 83,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 29, 2012 10:21PM wilson33 wrote: Husband and I are going to see the GP tomorrow, we need answers and appointments made, something isn't right and I need support as I can't take you guys with me, please keep me in your thoughts and prayers because I feel like I have given up before I get there and that is not a good place to be :/ I am struggling right now :(",
      "MessageIndex": 95,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 4, 2012 09:15PM wilson33 wrote: Summer, I really believe I have fibrocystic breasts, I think because my hormones may be all over the place it is difficult to say it is cycilic.  I shall be giving these questions etc I have with my new GP and get an appointment with the nurse, but where I am you need a doctors referal for the nurse to take bloods to know what they are looking for. I am up North - Angel of the North to be exact :) mother and father in laws, peaceful, and so relaxing, until you have a day like I had which isn't much compared to others but when you have a day when lots of little things go wrong I had a mini breakdown and cried and was so in shock of my breakdown on the A1 with the kids :(  All behind me now, shall wait to see GP, nurse nad second thermography test :) thanks for helping me out, if you get chance to help me out some more if you could please help me with the best websites to look at as I have just googled and only looked at wikipedia.  Thanks. South is good I love paignton devon, gorgeous there :)",
      "MessageIndex": 102,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 5, 2012 08:54PM wilson33 wrote: This holiday was just what I needed, I sat at seaham beach today with the tide in sitting on a rock watching the waves for nearly 2 hours, and in those 2 hours everything was safe, at ease, peaceful, my mind was aghast at the beauty and blankness, the sound, the smell it was perfect :) I think with the thermography testing, showing signs of fibrocystic changes, blood tests etc, changing gp's I am feeling confident along the fibrocystic breasts.  I have a diary and have for the last 3 months of my menstrual cycle but pain, has been a bit all over the place because my menstrual cycle has been. Shall get bloods done at new gp's thermography test should confirm all and hopefully a gp who will not think me neurotic and all I want is for the pain to go, I can live with lumps and bumps but the pain jeesh it is unbareable. Thanks for the read, I shall read it when I get home I am going to enjoy my last 2 days of holiday, I love it up here and if I won the lottery I would buy a big house and do respite care and still childmind but more with children with special needs.  I feel at home here and so relaxed :) I have reduced so much I think my body is in shock haha, also doing weight watchers, I do think dust has a lot of salt in it lol. I am in control and on top of everything (at the moment) thank you all for being my rock and help and guidance I really don't know what I would do without you all :)",
      "MessageIndex": 105,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 11, 2012 12:43PM wilson33 wrote: I being of sound mind and actions today and very little pain, but exhaustion has got the better of me and feel so drained.  I had my TSH levels come back elivated but my thyroid level was normal but my pituitry gland was working overtime to make sure my thyroid levels were working.  I am in the process of changing GP's so they might do a full over MOT/service on my blood work. Can having your thyroid levels out of sink cause fibrocyctic breasts? Is it mainly to do with fluctuation of hormones? Or am I just feeling greedy and have both? Vitamin D levels too make you feel doppy tired. If I had one quarter of my kids energy I would be up 24 hours for 7 days and my home would be tidy! I am having achy bones in my left shoulder and hips but nothing some pain meds can't relieve. I hope you all had a good weekend :)",
      "MessageIndex": 107,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "wilson33 wrote: I went to my GP I went in through the door and burst into tears asked her for a hug. I went over te pain and things I have been having stil and can't take it anymore and wondered if she could do me an urgent referal.  She asked me what I was most worried about I said \"pagets\" she looked at me and said \"no way\" I have seen it on a 60 year old lady and is nothing like yours. I said has she ever had a case out of textbook or the one syptom for something that was totay out there.  She carried on telling me that I am neurotic and it's all in my head.  I am still sobbing now. I have been given diazepam adn told to chill until my appointment, i think she wants me locked away in a padded cell.  I am so hurt and feeling pretty crappy right now, angry doesn't even cut it Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 3, 2012 07:49PM wilson33 wrote: I woulld like to point out that I wrote this comment straight after seeing the GP and was reactive and felt very upset and angry. I have no intention of seeking legal advice as I feel my doctor has done everything she could.  I am just impatient and should really start being proactive. I have read through the comments and am embarrassed and ashamed of myself for being such a birk. As you can tell not handling many things very well at the moment and need to collect myself.  I would like to thank you guys so much for pointing out things that I need to take on board and now I am upset with myself. So like a dog with it's tail behind it's legs I will bid you a goodnight and a thank you.",
      "MessageIndex": 13,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 22, 2012 07:10AM wilson33 wrote: Summer you are a happy bunny and thank you. Youngmumoftwo - I did exactly what you did I hold my hands up and no shame, in fact I am still looking for alternatives but you put breast in google and most sites say cancer it is trying to find the ones that don't say it I am looking for. Not becuase I feel I do or don't have bc but other possibilities I can try before coming to the last resource and in need of a straight jacket.  I am not looking for me to say \"I told you so\" to the doctor either.  I am have thermography done tomorrow which is non radioactive and you don't get your boobs squished it is an alternative but you have to pay. It is whatever you want to do for peace of mind, but my advice is listen to summer she is now my mum and my guardian angel in disguise, so full of words of wisdom and understanding :) thank you summer and good luck youngmumoftwo :)",
      "MessageIndex": 6,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787870",
      "Title": "the girl who cried lump: trusting yourself vs. professionals youngmomoftwo youngmomoftwo"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 23, 2012 05:08PM wilson33 wrote: My last cup of coffee (decaff) before my thermography appointment I don't know how I am feeling. Positive thoughts, vibes and prayers, been praying a lot lately.  I haad lunch with my mum haven't done that for over 20 years just her and I was lovely. I hope all is well with everyone today :)",
      "MessageIndex": 91,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 30, 2012 07:02PM wilson33 wrote: Hi Fergy and Sommer, yes i go back in 90 days round about August time but on my sheet it showed possible fibrocystic and needed a follow up with the GP, so I did what it said, I also went to the doctors to get repeat meds as I am going out of the area for a week and didn't have enough to last me. What I had in mind was seeing her showing her the images and maybe just maybe possibly think I need referring back to the breast clinic, this is how it went. The thermography test was a waste of my money and time she looked at them and said it means nothing to her. Explained that there was something new on the right that seems to be getting bigger since I have noticed it and shows through my t-shirt bra's. She told me straight up \"I am not sending you for any more referals, no more.  There is nothing wrong with your breast apart from pain due to stress.  I can send you to a stress management councel but apart from that nothing\" My little one was with me and was wanting to go on the bed his dad said no, dad said no again, then I piped up no and if you continue the doctor will tell you off. Then the doctor told me my children cause mayhem, they are constantly being told off by reception (which they are not) they are unruley and I have no control over them and that is what my problem is.  I was like wth!!!!!!!!!! I am now at the point the pain is dragging me down, I am stressed because no one can sort this out, if I had no pain I wouldn't be stressed and yes I know it is a visious cycle but come on, am I being stupid? Is it me? Is it something I have done? Is it something I haven't done? What more can I do? What can I take? This is all my fault and I have gone beyond wanting to upset my GP now and thinking about complaining but don't know if my head is right, I know what my gut is saying and that is there is nothing serious going on but something. I shall wait for the second thermography test but in the mean time I am filling in forms for another practice.  Am I doing the right thing?  I am so confused and don't know how I am holding everything together",
      "MessageIndex": 98,
      "PostDate": "30/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 3, 2012 06:22PM wilson33 wrote: In the process of changing doctors surgeries :) am on hols :) I have a couple of questions to do with fibrocystic breasts.  Does this interferre with your menstrual cycle? I have been a week late the past 2 months and bled for 9 days, now I have started a week early, can anyone help as to what is going on? would I need to have bloods tested again with new gp practice? I am just tired and fed up of feeling all these things if anyone can help I would apreciate it - thank you",
      "MessageIndex": 100,
      "PostDate": "03/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 16, 2012 09:14PM wilson33 wrote:",
      "MessageIndex": 3,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 22, 2012 07:55PM wilson33 wrote: Is the burning constant or does it come and go I really am going to have to get this sorted but don't like upsetting people :( especially my doctor",
      "MessageIndex": 28,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 22, 2012 08:47PM wilson33 wrote: I am 33, 3 children and I childmind.  I have not had a mammogram, but however have ruled out everything else creams for all sorts and now on tablets to see if it is in my head :(",
      "MessageIndex": 32,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 23, 2012 10:13PM wilson33 wrote: ok so the doctor called me back trying me to try the creams again because there was no outward sign or feeling of heat or colour change. So after a long day of waiting we ddecided I have tried all the creams possible and to stick with the oil of primrose and amatripyline and she is going to refer me to a specialist who will then decide if a scan or mammogramme will be necesarry now I am in such a state because I have to fight for something I know doesn't feel right.  I am not thinking I am dying but know something isn't right and am sobbing because they think it is in my head. It is uncomfortable, and burns and my nipple is still itchy but not as itchy.  Have I done wrong because I feel I have :(",
      "MessageIndex": 40,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 23, 2012 10:40PM wilson33 wrote: Thank you so much - I have been looking at other things that may not be cancer related and can see where the doctor was going, thinking I had cyclical breast pain. I am disgusted I have to fight every step of the way.  Will see what happens and how long I have to wait for my appointment to come through. Thank you again for your warmth and support x",
      "MessageIndex": 44,
      "PostDate": "23/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 24, 2012 04:48PM wilson33 wrote: Breast has been a little less painful today but my goodness my under arms on both sides are hurting me, it's like when my arms are down I have 2 ping pong balls 1 under each armpit but my left one is worse. Is it related or am I just being extremely paranoid about everything now?",
      "MessageIndex": 46,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Feb 24, 2012 05:37PM wilson33 wrote: I have reccently had a sinus infection so could be that. but jeez you notice it when your arms are down, hopefully now as I get my pj's on and bra off I might have som comfort and relief :) thank you for that you have made my night :)",
      "MessageIndex": 48,
      "PostDate": "24/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Mar 4, 2012 07:41PM wilson33 wrote: momo3esb I am sorry to hear about you itching I know all too well that a cheese grater can sometimes look like your best friend!!! My itching has calmed down but I am burning something wicked.  I have been crippled with migraines and am off to bed now with one and hope the kids want an early night. I am looking forward to an appointment soon, but know deep in my gutt it is nothing serious.  Everyone on here I can't imagine what you are all going through, you are all so supportive to people who have concerns and if I could take this all from you I would in a flash. God Bless you all and tight hugs to those who don't believe. Night all",
      "MessageIndex": 68,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 16, 2012 02:34PM wilson33 wrote: I am pleased to say I am not moving forward but feel I am stepping backwards and someone just nicked my jigsaw piece.  I saw the dermatologist today and he was lovely and gentle and straight forward.  he said by sight there is nothing serious going on I kinda cried with relief and then cried some more when he gave me cream I have already tried but stronger dose.  I have to be on dermovate cream for 6 weeks the description is \"very potent steroid cream\"  I shall be applying and praying I have hope :)",
      "MessageIndex": 75,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/782773",
      "Title": "Itchy left nipple wilson33 Gingerbits"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 8, 2012 09:42AM wilson33 wrote: That is good news, how do you feel about it all?",
      "MessageIndex": 6,
      "PostDate": "08/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/788615",
      "Title": "Painful thickened Area in Breast...scared to death georgiehopper Sommer43"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 3, 2012 02:10PM wilson33 wrote: Thank you so so much for taking the time out of your day to help me with my worries, concerns and frustration.  You really have put things in perspective for me and managed to calm me tremendously. Thank you again.  I feel the doctor has done all she can to the best of her ability and now I must keep my head as screwed on as hers and follow your advice.  I can't diagnose myself and we are illiminating all the possibilities and out of all this could be something so silly and small. I will not be loosing any sleep over this anymore.  I have been filed a harrassment form from Dr Google as I have followed him everywhere lol all the connections I have looked at are now all pink!  Google I might add is now banned from my computer, a little less time on here wouldn't hurt. Patience and serenity I think and a cup of coffee :) Thank you again - smiling through tears here.  ",
      "MessageIndex": 10,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 3, 2012 08:40AM wilson33 wrote: Hi Sommer43, I wrote that yesterday after seeing my GP it is the morning after. I have been going to the gp for 7 months, I had to cry and shout to go to the breast clinic I have had an ultra sound scan and it was all clear, which I was expecting to be honest. I have been referred to a dermatologist, I went to see the GP yesterday to see if she could make it an urgent case as I have been told I can wait up to 17 weeks.  I have exhausted all possible explanations now and am really struggling with the pain, disscomfort and pure missery. I asked the doctor what she thought it was and she told me she thinks it's in my head, which upset me beyong belief. I said I think I might have pagets, she blatently said \"NO way\" quoting \"I've seen pagets on a 60 year old woman and you don't have it\".  While I understand she isn't quite understanding my frustration and misery, refused to class my appointment as urgent so I am now trying my hardest to be as patient as I can, it is hard knowing I have to wait so long. I was so cross I really felt ignored.",
      "MessageIndex": 6,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 2, 2012 09:28PM wilson33 wrote: You are right. I am going to sit tight for now and cope the best way I can, not sure what that is yet.  Does anyone know if you have pagets does your periods start going funny like missing one or being late? I can't find info on it anywhere.  Thanks and thank you al for your support my mind is just in a cloud that wont cear and the more I flap the worse the cloud gets :( x",
      "MessageIndex": 4,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/786795",
      "Title": "Saw gp - think legal advice is needed wilson33 marie5890"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 17, 2012 12:44PM wilson33 wrote: Hi Wazzle1, I too have had the same on the left side but with it an itchy nipple to the point of shear distraction, I do believe I have fibrocystic breasts, but am still in the process of getting things sorted but feel I am on a non concerous path, although the concerns have brought me here. Have you had your bloods done at the GP's? I hope you are ok today and the worst thing I did was google - although it educated me in some ways it scared me silly in others.  Stress is a major part of pain like lightning pain it started with then burning inside.  Try and relax about it (easier said than done) I hope all goes well at the breast clinic on Thursday keep us posted and if you have any worries or concerns everyone here will help, this is one big family on here :)  Enjoy the rest of your Sunday :) (((hugs)))",
      "MessageIndex": 8,
      "PostDate": "17/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789190",
      "Title": "Could it be? wazzle1 wazzle1"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "May 23, 2012 01:57AM wilson33 wrote: www.meditherm.com/default.htm maybe soemthing to look at :)",
      "MessageIndex": 9,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/787870",
      "Title": "the girl who cried lump: trusting yourself vs. professionals youngmomoftwo youngmomoftwo"
    },
    {
      "AuthorID": "wilson33",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/145206/profile",
      "Content": "Jun 21, 2012 06:15AM wilson33 wrote: I am feeling your frustration (((hugs))) although 8 weeks seems far away at least they are following you up.  I was disscharged after my first and only appointment. Keep us posted x",
      "MessageIndex": 11,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/789190",
      "Title": "Could it be? wazzle1 wazzle1"
    }
  ]
}