{
  "AuthorID": "windy1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278341/profile",
  "Posts": [
    {
      "AuthorID": "windy1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278341/profile",
      "Content": "windy1 wrote: I am 61 years old. Over the last week I have had symptoms of redness on my right breast, warm to the touch and sore. I went to the dr yesterday and today I had a diagnostic Mammogram and an ultrasound of the breast. The radiologist said she found one mass near the spot of soreness and one under my nipple. She started me on an antibiotic and scheduled a punch biopsy in 10 days. I am very nervous and scared about it. I am actually a lactation consultant and deal with mastitis all of the time with the nursing moms. I have nursed four children and never had any issues. Now at this age??? Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866497",
      "Title": "curious about mastitis symptoms? windy1 Erinashley19"
    },
    {
      "AuthorID": "windy1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278341/profile",
      "Content": "Aug 14, 2018 06:32AM windy1 wrote: Happy to meet another IBCLC! My symptoms are completely gone, no redness, no pain, no warmth to touch, feels normal now. I have an appointment on August 21st. I believe the plan is to ultrasound my breast and if the mass is still there I will have a biopsy. I wonder if it is mastitis, would a pocket of infection show up on an ultrasound, the 6mm mass that was found on the 9th? I usually don't ever want to hurry time along, but I sure do now! If I do have the biopsy, I will know the results by the end of that week. Hopefully a party will ensue to celebrate after!",
      "MessageIndex": 5,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866497",
      "Title": "curious about mastitis symptoms? windy1 Erinashley19"
    },
    {
      "AuthorID": "windy1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/278341/profile",
      "Content": "Aug 10, 2018 08:51AM windy1 wrote: I have just started my antibiotic. No other skin changes, just redness and sore. It just seems so odd to me to have mastitis now at this point in my life. I have no flu like symptoms or fever. I am sure hoping for mastitis though! The alternative is so scary!",
      "MessageIndex": 2,
      "PostDate": "10/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/866497",
      "Title": "curious about mastitis symptoms? windy1 Erinashley19"
    }
  ]
}