{
  "AuthorID": "Winterpeg",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
  "Posts": [
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Winterpeg wrote: Hello friends, I am looking for some reassurance about my current treatment and/or information to prepare me for my next meeting with my MO. I have completed 3x FEC and just had my first of 3 rounds of Taxotere/Docetaxel last Tuesday (txs once every 3 wks).  I felt very jittery during the infusion and in the hours following and did quite a bit of sleeping that afternoon and night.  I awoke on Wednesday feeling good with lots of energy.  However, by Wednesday night, I had jolts of pain everywhere in my body like someone was playing ping pong with my bones.  I also had pins & needles in my right foot.  By the time I spoke with my MO's nurse on Thursday, I was also having pains in my head and behind my eye.  I was told that I could take Advil or, if that did not work, T3s.  The nurse also told me that, at my age, 43, I am getting the maximum dose I can get and that the early onset of the side effects is good because it means my body is metabolizing the Taxotere. It has been exactly one week since my treatment and I am still having jolts of pain all over my body, mild headaches, and my hands feel like they are developing mild arthritis (or what I imagine it would feel to have arthritis).  The fatigue is also very bad but does not worry me.  While I have not experienced the nausea that I had with the FEC, I am really worried about the Taxotere side effects of bone/joint pain and neuropathy which, I understand from reading these boards, can sometimes be permanent. Has anyone else had a similar experience with the side effects with Taxotere?  If so, did the SEs go away and when? Also, what did the nurse mean when she said that the immediate side effects meant that my body was metabolizing the Taxotere?  I thought it was the opposite, not getting side effects meant that your body was metabolizing the chemo drug well.  I have also read that the existence of and/or severity of side effects is not an indication of how the chemo drug is working. I would really appreciate your input as I am starting to worry about whether my next treatment should be a reduced dose of Taxotere or another drug altogether.  Thanks.          \"Run when you can, walk when you have to, crawl if you must; just never give up.\" D.K. Dx 4/14/2011, IDC, 1cm, Stage IIA, Grade 2, 1/8 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772570",
      "Title": "Taxotere Side Effects - Should I be worried? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Aug 2, 2011 06:43PM - edited Aug 2, 2011 06:44PM by Winterpeg Thank you Deb and Special K and Elmcity. I think I am more worried because most of what I read on taxotere threads indicated that side effects occurred 3-5 days after treatment and mine were so immediate (about 28 hours later). People also reported the side effects getting better after a few days except those people who seemed to have permanent or long term SEs. I went out to buy l-acetyl carnitine but was told it is not over the counter in Canada. I purchased l-glutamine and have taken 2x 500 mg capsules this afternoon and evening. I will ask onc about B6. I just took my T3 for the night and hope that tomorrow will bring a SE free and worry free (as much as possible under the circumstances) day. I feel so fortunate to be going through BC at this point in time when I can turn to this website with you wonderful women for comfort and knowledge. Thanks again!!",
      "MessageIndex": 6,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772570",
      "Title": "Taxotere Side Effects - Should I be worried? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Aug 2, 2011 03:46PM Winterpeg wrote: Hi Deb, no neulasta shot or pre-meds.  I received a dexamethosone pill just minutes before the infusion and that was it.  No presciption or OTC meds were prescribed for after the infusion.",
      "MessageIndex": 2,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772570",
      "Title": "Taxotere Side Effects - Should I be worried? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Aug 2, 2011 08:55PM Winterpeg wrote: Hi Deb, I don't believe I was infused with any meds other than the taxotere. Most posts I have read about taxotere are by Americans so you may have a very good point about earlier side effects without these extra meds. You have made me feel a lot better. Thank you so much.",
      "MessageIndex": 8,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/772570",
      "Title": "Taxotere Side Effects - Should I be worried? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Aug 17, 2011 07:09AM Winterpeg wrote: Thanks for all of your replies. A big congratulations to you Robyn on having completed chemo and, especially, on having avoided the dreaded docetaxel/Taxotere SEs. I tried purchasing l-carnetine but was told Health Canada dictates it cannot be sold over the counter and I doubt my MO would give me a prescription. Perhaps, if you could provide me with a link or reference to research to its effectiveness on neuropathy, I could convince him to provide a prescription. Thanks.",
      "MessageIndex": 5,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770973",
      "Title": "Strange sensations. Carola32 Carola32"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Aug 15, 2011 09:05PM Winterpeg wrote: Hi Carola, I came across your post as I was trying to find out if anyone else experienced numbness in their face following Taxotere. Since my first Taxotere three weeks ago (second of three is tomorrow morning) I have had lots of pain and pins & needles. Today I have felt my cheek getting numb just below my right eye along my cheek bone. I am very concerned about neuropathy and discussed stopping chemo early with my MO's nurse but she convinced me to try at least one more. I was wondering if your facial numbness resolved and how long it took to do so? How are your fingers and feet? Did you take any vitamins or supplements during or after chemo to help avoid or treat neuropathy? Any info you can provide would be much appreciated. Thanks!",
      "MessageIndex": 1,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/770973",
      "Title": "Strange sensations. Carola32 Carola32"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Winterpeg wrote: I am still trying to recover from BMX with SIEA flaps surgery which took place less than 4 weeks ago but instead of just focussing on and appreciating the improvements I've made, in the past week I've spent hours each day doing online research on things like chemo meds, wigs, infusion rooms, working through chemo etc. I'm scared of the side effects I might experience. I'm concerned about what fears my 9 year old daughter and 7 year old son might feel as they see me lose my hair and, possibly, suffer with the chemotherapy side effects. How will I possibly distract and take away from my baby sister's wedding day this summer? So many questions... Is anyone else at the same stage of her BC journey? \"Run when you can, walk when you have to, crawl if you must; just never give up.\" D.K. Dx 4/14/2011, IDC, 1cm, Stage IIA, Grade 2, 1/8 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768397",
      "Title": "Recent BMX with imm. recon.-chemo is next....anyone else Winterpeg nikola"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "May 2, 2011 06:53PM Winterpeg wrote: Thanks dlb for the kind words and advice. I'm sure there is a lot of great information on existing threads but I am finding it kind of overwhelming attempting to catch up on threads with hundreds or thousands of posts. No destination wedding thankfully. I'll try to schedule chemo backwards from the wedding so that I'm at the 3 week post chemo period, if I can. Thanks again for responding - it means a lot.",
      "MessageIndex": 2,
      "PostDate": "02/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/768397",
      "Title": "Recent BMX with imm. recon.-chemo is next....anyone else Winterpeg nikola"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 14, 2011 01:01AM Winterpeg wrote: Maggie, I wish you all the best for your surgery tomorrow. It sounds like you are very well prepared physically as well as emotionally. Today is day 8 post-op for me and I can tell you I feel like a million dollars compared to the first 5 days of pain & anxiety. I am looking forward to the next milestone which I understand comes at about day 14 post-op. Take care and hope to hear you are doing well when you are next able to post.",
      "MessageIndex": 121,
      "PostDate": "14/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 16, 2011 09:14PM Winterpeg wrote: Cathy, I'm very sorry to hear about your adverse reaction and surgery delay.  Hopefully you will have a new date and plan for SNB biopsy soon. I had my BMX and SIEA reconstruction on the 5th and thought things were going well until having to spend 10 hours in emergency on Apr 14/11 where I had CT scan, chest x-rays, EKG, and other tests to determine whether a blood clot was causing the extreme pain I had trying to breathe.  It turned out no blood clot but fluid in lungs (pleural effusion) which was likely causing the problem and which was not an uncommon complication of surgery.  I am having an easier time breathing without pain now but am scheduled for another chest x-ray next Wedn. Other than the effusion and back pain from walking hunched over, I appear to be healing well.  I do laps around the main floor of my home for exercise and hope to move my walks outside next week.  It just snowed today and I woke up to everything covered in white.  I'm hoping for nice warm and dry weather next week. Is anyone who had surgery with reconstruction this month driving yet? ",
      "MessageIndex": 136,
      "PostDate": "16/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 1, 2011 08:12PM Winterpeg wrote: Hello ladies, April 5/11 is my date for a BMX with immediate bilateral DIEP reconstruction. I was set for a uni left mx on March 22 which was pushed back 2 weeks when I was dxed with IDC and DCIS in the \"good\" breast on March 17/11. Strangely my BS is still more concerned about the extensive (8+ cm) and agressive DCIS in the left breast. It's certainly comforting knowing you are not alone and that there are so many wonderful people in the same predicament willing to answer your questions or to simply offer support. The list of prep item for surgery posted above was great. I had a few items to add which I found on other threads: 1. Lip balm 2. Water/hydration pack (holds lots of water with a built in straw/tube) 3. Electric recliner (for DIEP) Good luck to everyone and I look forward to comparing notes and sharing tips on recovery.",
      "MessageIndex": 72,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/765377",
      "Title": "April 2011 Masectomy IllinoisNancy Beaglesgirl"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 12, 2011 09:39AM - edited Apr 12, 2011 09:40AM by Winterpeg Thank you for your responses. I was finally able to sleep for the first time last night - 6 hours only broken up by a bathroom break about at the 3 hour mark. Meditation CDs with lots of relaxation massage on my head and feet did the trick, I think, or maybe the general anesthesia and IV meds finally made their way out of my system or maybe it was a combination of both. All I know for sure is that I did not wake up with the feeling that I am losing my mind. I am very grateful and am hoping for another good night of sleep tonight. With all the research I did before surgery I did not come across anything about the post-op anxiety which I now know is not uncommon. I am feeling almost back to my old self.",
      "MessageIndex": 5,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767319",
      "Title": "Fear, anxiety, pain... immediately post-surgery-what is normal? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 13, 2011 02:22AM Winterpeg wrote: Thanks for the pointer in the right direction. I had done a lot of pre-op reading and researching on this site and others and had not read anything, that I can remember, about people's immediate emotional reactions to surgery, anesthesia and pain meds. It never occurred to me to read anything on the Depression, Anxiety and Post Traumatic Stress forum in preparation for surgery as I assumed it dealt with emotional & psychological problems which people were experiencing long after surgery. I hope others like me might come across this thread as they prepare for surgery so they may at least be aware of these issues and, if they do experience them post-op, will know they are not alone.",
      "MessageIndex": 9,
      "PostDate": "13/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767319",
      "Title": "Fear, anxiety, pain... immediately post-surgery-what is normal? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Winterpeg wrote: I just had a 9 hour surgery - BMX with immediate DIEP reconstruction - 4 days ago. Surgery went well and with no complications, so why do I feel so anxious, fearful and unable to sleep? Is this normal? I hope others will share their experiences in the days, weeks, and months, immediately following surgery. \"Run when you can, walk when you have to, crawl if you must; just never give up.\" D.K. Dx 4/14/2011, IDC, 1cm, Stage IIA, Grade 2, 1/8 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767319",
      "Title": "Fear, anxiety, pain... immediately post-surgery-what is normal? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "Apr 12, 2011 01:33PM Winterpeg wrote: Thanks, Goldlining. Physically, I am still in pain and much discomfort especially from the abdominal binder I must wear for the weeks to come. Also, I am finding it hard to sit comfortably. My DIEP actually turned into a SIEA which meant no need to cut into the abdomen and therefore a speedier recovery is expected. I was very happy about that and also the fact that the bi-lateral SNBs resulted in 0/6 nodes being involved. I wish you all the best with your PMX and DIEP.",
      "MessageIndex": 7,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767319",
      "Title": "Fear, anxiety, pain... immediately post-surgery-what is normal? Winterpeg Winterpeg"
    },
    {
      "AuthorID": "Winterpeg",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124904/profile",
      "Content": "May 18, 2011 03:29AM Winterpeg wrote: Asking about all of the medications they are giving you after surgery (both IV and oral) and especially the side effects might be a good way to prepare yourself for what may come your way.",
      "MessageIndex": 10,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767319",
      "Title": "Fear, anxiety, pain... immediately post-surgery-what is normal? Winterpeg Winterpeg"
    }
  ]
}