{
  "AuthorID": "wiseseeker",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230536/profile",
  "Posts": [
    {
      "AuthorID": "wiseseeker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230536/profile",
      "Content": "Apr 19, 2016 01:46PM wiseseeker wrote: Hey Ms. Lover of Poodles! Who is your BS? Dr. Amanda Morehouse by any chance? Did Dr. Ma say, by any chance, what the smallest current breast size would be to be feasable for Goldilocks mast? (I'm a C-Cup and don't mind being reduce to a large A as I am short.) I am in Atlanta too and while Dr. Ma was recommended to me by Dr. Morehouse, Dr. Ma has some very scary / bad reviews on some of the websites. Am still consulting with surgeons to find the right one who can do at least skin-sparing. THANKS!",
      "MessageIndex": 5,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/839712",
      "Title": "Goldilocks Reconstruction mustlovepoodles Luckynumber47"
    },
    {
      "AuthorID": "wiseseeker",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/230536/profile",
      "Content": "May 13, 2016 03:24PM wiseseeker wrote: It is May 13, 2016 and I am home from my wire localization, incisional biopsy and nipple-ectomy due to Paget's disease. I was anxious all night only about the wire procedure and guess what, ladies? It was nothing to worry about at all! The absolute most painful part was prior to even being injected with anything they had to take a picture on the mammo machine and she stretched my breast so much and smashed it so hard inside the paddles that it hurt for about a minute really bad. The lidocaine shot going in was quick and nearly painless and from there I felt no needle or wire. Also, I had this idea that the wire should be sticking out of my shirt or something and no, it was virtually all inside the breast as I was taken to pre-op. I confess I took a 5 mg tab of valium about 30 minutes before the localization because of my nervousness and that may have helped a little, but it is not for pain. Also, to explain further, I was diagnosed with DCIS Stage 3 in an apparently large area but I finally found a surgeon and radiologist who think it is simply \"enhancement\" and benign calcifications, so that is why I opted for the incisional biopsy, which my surgeon felt was logical to do at the same time as the nipple removal for the Paget's so it was one operation. Praying that pathology will be on my side. Plus, I got a second opinion from Dr. Laigos in California, the widely respected pathologist, who concurred that my suspicious calcifications may indeed be benign, so woo-hoo! Hope this helps calms your fears out there...!",
      "MessageIndex": 3,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/842789",
      "Title": "Wire Localization and Pain PJKuser wiseseeker"
    }
  ]
}