{
  "AuthorID": "wlo002",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
  "Posts": [
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "wlo002 wrote: Today I had my sentinel node biopsy and port put in. I'm happy to say that the nuclear injection for the sentinel node wasn't near as bad as stories I had heard...just burned for a few seconds. The surgeon did the dye injections while I was under anesthia thankfully. Since waking up, my breast is throbbing though. I have no pain from the port or node biopsy sites. Is it normal for the breast to hurt for a while after the injections? Dx 4/11/2018, IDC, Right, 5cm, Stage IIB, Grade 3, 0/1 nodes, ER-/PR-, HER2+ (FISH) Surgery 4/26/2018 Lymph node removal: Sentinel Targeted Therapy 5/8/2018 Perjeta (pertuzumab) Chemotherapy 5/8/2018 Carboplatin (Paraplatin), Taxotere (docetaxel) Targeted Therapy 5/9/2018 Herceptin (trastuzumab) Surgery 9/12/2018 Mastectomy: Left, Right; Reconstruction (left): Tissue expander placement; Reconstruction (right): Tissue expander placement Radiation Therapy 11/11/2018 External: Chest wall Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/864273",
      "Title": "Pain after Sentinel Node Injection wlo002 pingpong1953"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "May 24, 2018 08:54AM wlo002 wrote: Thanks for your input ladies - I let my son handle the clippers and all went great! Tomorrow I turn 42, it's a 3 day weekend and the extreme dry mouth & taste changes are suddenly gone...I'm a happy girl!",
      "MessageIndex": 170,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Aug 29, 2018 03:04PM wlo002 wrote: Woohoo! Had my last chemo today and got to ring the bell! I went in thinking my labs would still be too low because I have petechiae on my legs and bleeding gums but the platelets had jumped to 166,000. It was a great surprise...and I got to return the favor by answering questions for a newbie who was just starting her chemo.",
      "MessageIndex": 336,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jun 5, 2018 03:46PM - edited Jun 5, 2018 03:48PM by wlo002 Hi everyone! I had infusion #2 on Friday...thankfully, it was only a repeat of the first side effects. My MO did reduce my Taxotere a tad because I had chemo rash and symptoms of neuropathy. On the plus side, my mass shrank from over 5 cm to 1 cm!! Talk about wanting to dance in the doc's office! Clare-I've had a crazy runny nose! I thought it was a side effect of the Herceptin, but my MO said it may be just dryness. She suggested a humidifier. InnaB-I'm 42 and working through chemo (I work from home). I only get infused every 3 weeks and I have a couple days of fatigue so extreme that my husband says he's glad breathing is involuntary. I've only missed 3 days so far...we'll see as it goes farther. I'm afraid it's beginner's luck! I'm pushing to work as much as possible knowing I still have surgery and radiation to go. I work for a company that won't blink an eye at letting me go if I reach 12 weeks of FMLA leave. Ingerp-love the puppies! I have 2 miniature aussies and they are family. They insist on staying in the room with me during my fatigue days that put me to bed.",
      "MessageIndex": 218,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jun 14, 2018 04:26PM - edited Jun 14, 2018 04:28PM by wlo002 This week I've added yet another appt to my routine...this time physical therapy. I only had 1 node removed for sentinel node biopsy, but I've developed cording in my right arm. It's been a painful experience! The therapist was able to break a couple cords today which has improved my range of motion thankfully, but I'm a little worried since I haven't had breast surgery yet and that can cause even bigger issues. Anyone else have experience and advice? ClareCo-I had a horrible rash on my face and scalp with my first infusion. Within a couple days, both began peeling almost like I'd had a chemical peel. My MO said it was related to Taxotere. Because of the skin issues and tingling in my hands, she reduced my dosage a little and the next infusion was better. I do notice that the break out on my scalp now seems to be follicles that still have hair and they fall out shortly after the rash. Almost like ingrown hair, I guess. Proud Patriot-I have low BP issues around days 4 and 5. That's also when my fatigue hits. I almost passed out a few times with my first infusion, but it improved with the second. Frog on the lily pad - sorry for the late response...my mass is in the RUQ of a severley deflated breast and I'm just lucky that it can easily be felt. I can't wait to have scans in August to see what they show!",
      "MessageIndex": 246,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "May 23, 2018 10:05AM wlo002 wrote: 2 weeks to the day...my hair is coming out in clumps. No worries, it's only hair, but I'm definitely buzzing it tonight so it's less of a mess to deal with. When I first told my kids that I had cancer, they didn't talk much...my 14 year old was exceptionally quiet. It's hard being a teenage boy and this just added to his stress. I found humor and little ways to get him talking...one of which was telling him he could buzz my head when the time came which resulted in the biggest smile on his face. My mom has voiced that it would be a negative memory for him and that I'm crazy to let him do it. Thoughts?",
      "MessageIndex": 158,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jun 1, 2018 08:48AM wlo002 wrote: Hi InnaB. Glad your first infusion went well! The dry mouth is rough. Mine lasted about a week and a half after my first infusion and then I got some \"normal\" days that were wonderful. I'm in infusion today but met with my oncologist this morning. She said that sometimes the Biotene can make the dry mouth worse (who knew?) and to suck on hard candy as well as keeping well hydrated. Just thought I'd pass that along.  Hope everyone has a good weekend!",
      "MessageIndex": 196,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "May 15, 2018 02:37PM wlo002 wrote: Hi All. Just checking in since my first treatment and let me just say, as prepared as I was, I was NOT prepared. Days 3 and 4, my body pretty much shut down completely. I even tried to pass out sitting in a chair! I'm on the upswing now with just some body aches, tender mouth and horrible lack of coordination. I drove a short distance today and quickly decided that I should not be driving...my reaction time felt delayed and I almost felt a little motion sick. I really didn't expect this and it will most definitely be an issue with 2 kids in school Yellow tulip - I've had some pretty intense back pain, too. I wondered if part of it was all the laying around on top of the pain from meds. Taxotere seems to be a major cause of bone pain in addition to the neulasta. Mianola-hope today went well!! Clareco-way to take charge!",
      "MessageIndex": 111,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jun 26, 2018 07:03PM wlo002 wrote: Heatherautumn-Not sure if anyone has mentioned it, but ask your MO about magic mouthwash. It's a lifesaver for the mouth sores. I'm just coming out of round 3 of 6 and this is by far the hardest yet...I've had more nausea and fatigue and just taking longer to recover from it. Trying not to wallow but chemo is mentally exhausting. My family has decided to take our planned summer trip to the beach and I can't wait...11 days until I smell the ocean",
      "MessageIndex": 271,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jul 2, 2018 06:47PM wlo002 wrote: That is exciting Ingerp...the end is in sight! Big peaches - I have the eye twitch, too. On another blog, I saw that several women getting TCHP/THP complained of eye twitches. Crazy question - After most of my hair fell out, I used the clippers without a guard and cut the remaining down to stubble, but didn't shave it. It hasn't grown any since. I have new hair coming in (it's soft and baby fine...I love it! And I don't have a clue why it's coming in while I'm still getting chemo.) It's now longer than the original hair. So what do I do? Do I clip it and keep in all short? Do I shave it down to skin so only the new hair grows and I don't have the bristly leftover hair? ",
      "MessageIndex": 284,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Aug 23, 2018 07:19PM - edited Aug 23, 2018 07:21PM by wlo002 Tomorrow would have been my last TCHP, but my labs yesterday didn't go so well. My platelets are at 65,000 so chemo is a no-no. We're trying again next Wednesday. If they are still too low, I'll get my HP but hold off of my last chemo until after my BMX that is scheduled for Sept 13. My MO thinks its worth getting it late to still get it in. Congrats Hybrids! That's a milestone!",
      "MessageIndex": 330,
      "PostDate": "23/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "May 7, 2018 06:00PM wlo002 wrote: Hi everyone! I decided I would join in for May starters...makes me feel a little less alone out here. I'm starting neoadjuvant TCHP Wednesday 5/9. I'm anxious to get started and scared as heck at the same time. I've spent the past 2 weeks preparing for every possible side effect...yes, I'm a little OCD when it comes to planning, but it's better than sending my husband on 50 trips to Wal-mart. I was told that the first infusion would be 7 hours (yikes!). Anyway, glad to be here and looking forward to learning from everyone!",
      "MessageIndex": 70,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "May 30, 2018 12:39PM wlo002 wrote: Hi Hybrids! You and I are on a similar schedule for TCHP...I have my 2nd infusion Friday. Hope all goes well tomorrow!! I was told to start Claritin the day before chemo. Not sure if it makes a difference or if it just coincides with the start of my steroids and easier to remember. I had pain for about a week, too. There's no way to know if it was caused by the Neulasta or Taxotere, though, since both can cause bone pain. I took Claritin until the pain was gone just in case.",
      "MessageIndex": 188,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Aug 9, 2018 01:47PM wlo002 wrote: How is everyone feeling? Hope you're having a good week! Friday I had chemo 5 out of 6 and it was a doosie. I'm pulling out of the usual early side effects, but my body still aches...feels like I'm bruised everywhere. Anyone experience this type of pain? My blood counts were a lot lower with this cycle so I want to attribute the pain to that, but not sure. On a happier note, I will have my last chemo Aug 24...I've never been so excited for something to be over. 2 weeks later, I have a BM planned...not so excited about that. Each step is progress, though!",
      "MessageIndex": 312,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/864236",
      "Title": "Starting Chemo May 2018 ClareCo cccmc2"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Aug 29, 2018 05:58PM wlo002 wrote: Fairchild - I can't say for sure but Her2+ is considered to be aggressive form of cancer so that might be the reson. I think Her2+ always gets chemo and Herceptin.",
      "MessageIndex": 201,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/864904",
      "Title": "July 2018 surgery Debsmisto Vermonster"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 18, 2018 04:28PM wlo002 wrote: Hi Aisling. I'm not sure what the norm is but I had surgery the 13th with TEs placed and I see my PS tomorrow and BS on Thursday. It does seem a little odd to me that the PS wouldn't want to see you, too, but I don't know much about the direct to implant process.",
      "MessageIndex": 49,
      "PostDate": "18/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 4, 2018 04:58PM wlo002 wrote: WigLButtz, hope everything went well today and that you have an easy recovery. I have to know...is the name related to australian shepherds? I have 2 minis so that's the first place my mind went. Frogonthelilypad, I hope the injection goes well today. I was all worked up when I had mine and it wasn't bad at all. Good luck today and tomorrow!",
      "MessageIndex": 15,
      "PostDate": "04/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Nov 12, 2018 02:16PM wlo002 wrote: I was supposed to start radiation today, but got a call that the machine I was planned on was down. My anxiety is working OT and I didn't need that today. To be honest, I don't feel like I'm prepared to start. Neither my RO or anyone on the team has discussed skin care. When I asked about it at the planning appt, one of the techs handed me a small tube of lotion and said I could use it right after treatments. That's it... I had my simulation Friday and as I'm walking out, the tech says \"oh, yeah, we'll be putting this wet towel on you everyday during treatment to direct the beam\". It was said almost like an after-thought. I made the mistake of researching the the wet towel (called a bolus) and of-course, find all the horror stories and studies showing that it typically causes more skin damage than without. I can't explain my anxiety other than just not feeling informed enough. I've gone through chemo and BMX and never had this kind of anxiety over either. Sorry ladies, I just needed to vent a little. I'm hoping I get to see the RO tomorrow (I was supposed to today) and I'm not leaving until I feel informed.",
      "MessageIndex": 77,
      "PostDate": "12/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Oct 31, 2018 09:46PM wlo002 wrote: Hello! I'll be joining you in radiation this month. I had my planning appointment today. Simulation is the 9th and first treatment the 12th. I'll have 25 treatments so I'll finish up the the week before Christmas. My center schedules a week at time so each Friday you get the next week's schedule. I really wanted late afternoon appointments so I wouldn't miss so much work but it didn't sound very hopeful. My company has been great about me needing time off but I have a 45 minute drive each way to the cancer center and it'll add up fast. I was given a tube of Secura cream at my appointment so I guess it's the lotion of choice here. I was told I could use any deodorant as long as it didn't have aluminum in it. Anyone else dealing with tissue expanders and reconstruction after radiation?",
      "MessageIndex": 11,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Nov 15, 2018 07:42PM wlo002 wrote: I'm 3 days in and my anxiety is getting better, thankfully. The tech (is that what they are called??) that does my treatment has been really great. He took the time to answer all of my questions and even gave me some skin care suggestions based on what he sees. Linda2119 - I'm sorry you're having a hard time. I'm using the towel daily, but I'm only getting started. Can I ask how far in did you start to have skin issues? Everything I've read has me scared of how bad it can get. I haven't seen my RO since my consult 6 weeks ago. I kind-of feel like I was thrown in blind AliceBastable - I get to go Sunday morning (7:00!) instead of Friday, too. I'm ready for a few days with family, not thinking about work or cancer treatment and where I need to be when!",
      "MessageIndex": 110,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Dec 3, 2018 01:39PM wlo002 wrote: Congrats to everyone finishing up! That is a milestone to celebrate! I hit my midway point Friday. Everything is going really well - only mildly pink and it's gone by morning like a mild sunburn. I also have a rash starting and it itches a little. I picked up some hydrocortisone cream yesterday so hopefully it'll help. I have some mild discomfort in my ribs and the RO said it's just inflammation...take advil if needed and it'll go away when radiation is over.",
      "MessageIndex": 264,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Dec 21, 2018 12:48PM wlo002 wrote: Hi ladies. Glad to see so many finishing up radiation! I finished Wednesday and I'm so happy it's over. Driving an hour and a half each day was taking it's toll as my fatigue increased. I made it through radiation with a good pink burn and I could feel the skin cracking under my arm and foob although I couldn't see anything. Yesterday, those areas turned dark and feel like sandpaper. I'm keeping aquaphor on it but I feel sure I'll be losing skin in those areas. Just glad it didn't happen during treatment! I still have Herceptin and Perjeta infusions until May but the end of this mess is in sight! Best of luck to everyone and happy healing!",
      "MessageIndex": 347,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Jun 18, 2018 05:32PM wlo002 wrote: Hi Aussieprime. I'm Her2+ and I'd be happy to share my experience so far. I had a large mass and my surgeon suggested chemo first and contacted my oncologist who agreed. She felt that disturbing a large aggressive mass wasn't the best idea. That being said, I know other women who did have surgery first, but don't know the reasoning. Each case is different, I'm sure. I'm on TCHP and after the first infusion, my mass shrank from over 5 cm to about 1 cm. Because I've had such a good response and I have large breasts, I have been given the choice of lumpectomy with oncoplasty or mastectomy. I'm currently meeting with my surgeon, plastic surgeon, etc to make an informed choice. I will have radiation with either choice because my mass was so large. I wish you the best of luck!",
      "MessageIndex": 6,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/865282",
      "Title": "Diagnosis details after surgeon meeting today - gd 2-3 DCIS/IDC Aussieprime wlo002"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Dec 8, 2018 08:23AM wlo002 wrote: Spoonie - I've never heard of the fibrosis, but I'm glad it isn't anything worse! Wised - hard to be excited about moles, but yay, glad it's nothing more! It's kind of crazy the damage we do to our bodies in order to beat this thing!! 18 of 25 done! Fatigue is definitely becoming an issue for me. No where close to chemo fatigue, but by 7:30, I'm ready for bed. I do have to say that I'm sleeping better than I have in months, though. I'm grateful to only be burning a little so far. Everything I read about using the bolus had me scared! Any other suggestions for the itchy rash other than cortisone cream? Anyone else having trouble finding your Christmas spirit this year? I'm usually listening to Christmas music and decorating by Thanksgiving and it's just not there this year. Gonna have to get motivated for my kid's sake!",
      "MessageIndex": 307,
      "PostDate": "08/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/868068",
      "Title": "November 2018 Starting Radiation Appyfan Lavenderlee"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 15, 2018 12:58PM wlo002 wrote: Hey ladies. I had my BM on Thursday with TEs placed and it all went great. I had a lot of pain Thursday night and Friday but I would describe today as uncomfortable. The 4 drains are most definitely the worst part. I've had some phantom nipple pain...it's crazy to feel something that isn't even there anymore. The PS put about 200ml of saline in the expanders so I have a little boob instead of being completely flat. I'm pleased with the incision sites...nice and straight. I'm eager to see how they progress!",
      "MessageIndex": 37,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Aug 29, 2018 11:11AM - edited Aug 31, 2018 09:11AM by wlo002 Hi everyone! I'm sitting in my last chemo treatment today and I'm scheduled for BMX on Sept 13 with tissue expanders placed. I hate we're all here, but I have found so much support on these threads. I was diagnosed in April at age 41. I'm married with 2 boys - 13 and 15. My mass was large when I found it but Herceptin has shrank it til it can no longer be felt. I'm really hopeful for pcr. Best of luck to everyone. I look forward to hearing about your journies through this next step! ",
      "MessageIndex": 6,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 13, 2018 06:06AM wlo002 wrote: I hope all of the Sept 10 ladies are doing well. I'm up today...and surprisingly not that anxious or stressed. Ready for this to be over with, though! It just feels like another step closer to being done.",
      "MessageIndex": 29,
      "PostDate": "13/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 16, 2018 05:47PM wlo002 wrote: Hi ladies. I'm doing pretty well post-op. I only spent one night in the hospital and had a little trouble with pain control in the beginning but today I've been spacing out my meds a little further to start weaning myself. I highly recommend a recliner for sleeping! I dont think I could have propped myself up in bed and still have been comfortable. The TEs are what causes me the most pain. I don't have any pain around the incisions. I see my PS Wednesday and I'm hoping to have a couple of the drains removed. Two of them are putting out less than 5ml at each dump. Best wishes for everyone having surgery this week!",
      "MessageIndex": 43,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 21, 2018 07:41PM wlo002 wrote: Hang in there Annie60 and Palimom...it does get better every day. I was able to wean off the pain meds about day 4 or 5 and just use Tylenol...not saying I was totally comfortable but the pain was doable. And yesterday I drove for the first time. Today I saw my MO and she had my pathology back...I got a 97% chemo/immunotherapy response rate which was awesome. I won't lie, though, I was disappointed when I didn't get the complete response. Studies showed that my regimen and receptor status results in about 80% getting complete response. Meeting with the RO next to determine if radiation will be needed. Fingers crossed...",
      "MessageIndex": 59,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 26, 2018 04:26PM wlo002 wrote: Britspeech - I was given 2 surgical front close bras at the hospital so you may want to ask if your hospital does the same. Yay for getting those drains out Palimom!! I got my last 2 out yesterday and had my first fill of the expanders (90cc each)...holy muscle spasms! My PS gave me valium to help with those. Having the drains out and valium...best night of sleep I'd had since before surgery . I have to wear my surgical bras at least another week to make sure I don't get fluid build up since the drains are gone. I can deal with that...and then freedom!! ",
      "MessageIndex": 73,
      "PostDate": "26/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    },
    {
      "AuthorID": "wlo002",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/272266/profile",
      "Content": "Sep 3, 2018 06:33PM wlo002 wrote: Anyone feel like you're not dealing with the emotional side of surgery in the best way? I've felt so positive through treatment so far but suddenly I just have this anger that's coming from out of nowhere. I find myself snapping at family and friends and although I can see it happening, I can't seem to stop. Maybe it's just the stress and anxiety of the unknown...I have to find a better way to deal, though.",
      "MessageIndex": 9,
      "PostDate": "03/09/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/866842",
      "Title": "September 2018 Surgery Support Group aisling pritchs04"
    }
  ]
}