{
  "AuthorID": "wmk1541019",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106547/profile",
  "Posts": [
    {
      "AuthorID": "wmk1541019",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106547/profile",
      "Content": "Aug 11, 2010 10:40PM wmk1541019 wrote: Hi everyone, Thanks for the information that I received. I feel that there has to be someone that will take blood from my foot. Kara, I will follow-up with all the information you provided and I will contact the lymphedema researcher.Also, the message from OneBadBoob gave me encouragement. I am new to this message board and I have spent several hours just locating the messages. I guess I will improve. My good computer is being fixed and now I am using an old one that is very, very,,,,,slow.I will keep in touch, thanks again.....diane",
      "MessageIndex": 16,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737032",
      "Title": "How to get a foot draw? moogie TNBCWarrior19"
    },
    {
      "AuthorID": "wmk1541019",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/106547/profile",
      "Content": "Aug 10, 2010 10:58AM - edited Aug 11, 2010 09:54PM by wmk1541019 lessagb: Thanks for your information. My drs. will not draw blood from my foot and the phlebotomists have informed me that it is not legal for them to do it. I don't think I will be able to get a dr. to write \"Draw from foot only\" on their prescription(blood) forms. Another writer said this worked for her. I have lymphedma (slight case) in my left arm from bc 18 yrs. ago (30plus lymph nodes removed post.) and I recently had another mastectomy (new cancer) on my right side.l ymph nodes 18 removed andneg.. Dr. said I should have blood drawn from right arm if I cannot find anyone to take blood from my foot. In the hospital, the nurses and drs.used my foot for blood work, IV's etc. This was not painful. I live in New York City and it seems impossible that this has become such a problem. However, I do understand that the phlebotomists have to follow certain guidelines.I appreciate any information. Thanks.diane",
      "MessageIndex": 13,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/737032",
      "Title": "How to get a foot draw? moogie TNBCWarrior19"
    }
  ]
}