{
  "AuthorID": "wndrwmn",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
  "Posts": [
    {
      "AuthorID": "wndrwmn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
      "Content": "Apr 22, 2015 10:15PM wndrwmn wrote: This is my first contribution to the board. I have learned a significant amount of information from postings the past twenty- one months. Thank you to those of you have shared your stories. I had my third Kadcyla infusion this week, after being on Herceptin for the prior fifteen months. Yesterday, I had a CT scan. The nurse called me to tell me today there hasn't been any progression of my cancer from the neck down. In October 2014, I had WBRT for mets in the brain. Two weeks ago I had a brain MRI. There were only 6 out of the original 13 tumors left. And 5 of the 6 have decreased (and have decreased every month) in size and definition. The 6th was originally the largest in size, in my occipital region. It caused light shows in my vision. I haven't had that side effect for over 30 days. My radiologist wasn't able to tell definitively what was tumor and what was healed tissue. So I am choosing optimisim, that tumor is disappearing also. I am feeling renewed hope concerning my length of life.",
      "MessageIndex": 655,
      "PostDate": "22/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "wndrwmn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
      "Content": "Apr 24, 2015 08:39PM wndrwmn wrote: Thank you Smiley47 for your kind welcome. I hope the feedback from your MRI is good. I always get anxious waiting to hear the news from the doctor. I will be sending positive vibes your way. Thank you also The DivineMrsM for your greeting. I appreciate your response to my post.",
      "MessageIndex": 658,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    },
    {
      "AuthorID": "wndrwmn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
      "Content": "May 25, 2015 09:28PM - edited May 25, 2015 09:32PM by wndrwmn Diagnosed July 2013, Stage IIIB Diagnosed October 2013 Stage IV after CT reviewed and bone mets found on spine. Mets were missed on original July 2013 CT. Diagnosed September 2014 w/ Brain Mets (13 tumors)",
      "MessageIndex": 51,
      "PostDate": "25/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/831838",
      "Title": "How long have you been Stage IV? goldie0827 dormouse"
    },
    {
      "AuthorID": "wndrwmn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
      "Content": "Jun 11, 2015 08:52PM wndrwmn wrote: Bosco, very happy to hear your news.",
      "MessageIndex": 426,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/830226",
      "Title": "Having a scan? Waiting on results? The waiting room is open! exbrnxgrl gramen"
    },
    {
      "AuthorID": "wndrwmn",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/213749/profile",
      "Content": "Sep 17, 2015 11:39PM wndrwmn wrote: bestbird  Thank you for posting this. After reading this, I researched the clinical study. I have had WBR and Cyber Knife treatment. Sadly I learned of progression early this month on 2 spots that had responded well to WBR. I undergo Cyber Knife tomorrow. I meet w/ a doctor from the study Monday to see if I qualify for this study. After initial contact it looks hopeful I can join the trial in the next few weeks. They will put me back on Herceptin, on Xeloda and Ont-380. I was on Herceptin and Tykerb prior to Kadcyla. The Tykerb did not work for me. Had many difficult side effects I am hoping this new drug will halt/reverse progression in my brain.",
      "MessageIndex": 1,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832148",
      "Title": "Encouraging Phase I ONT-380 Study Results for HER2+ MBC Bestbird wndrwmn"
    }
  ]
}