{
  "AuthorID": "wobyon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
  "Posts": [
    {
      "AuthorID": "wobyon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
      "Content": "Jul 11, 2011 08:38PM wobyon wrote: If I were you, I would put off the hysterectomy for awhile if you can.  That's a lot to deal with all in one surgery.  I'm BRCA2 and will face an ooph eventually, I just haven't done it yet.  I had my bilat mx in January of this year.  I was very fortunate that I was eligible for immediate recon using DIEP.  Still, it has been difficult to feel sexy with my nipple-less boobs.  I bought a couple of pretty nighties that made me feel good, and they were cute enough that I didn't necessarily have to take it off if I didn't feel like it when the time came.  Having to see the scars just kills the mood for me sometimes.  I think even without recon, you could find some nighties or tanks that would work.  I won't lie to you, drains are gross.  My husband had to do mine for me (I had four).  Even with him emptying them, I still needed zofran so I wouldn't barf.  But I got through it.  So will you.  You can do this.  Best wishes. <3   ",
      "MessageIndex": 5,
      "PostDate": "11/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771341",
      "Title": "Emotionally and physically scared of bmx bak94 del4"
    },
    {
      "AuthorID": "wobyon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
      "Content": "Jul 12, 2011 11:38AM - edited Jul 12, 2011 11:39AM by wobyon I was diagnosed with DCIS, grade III, with comedonecrosis last fall.  Due to the large area of disease (13x9cm) and being BRCA2 positive, my treatment was mastectomy.  I waited 8 weeks from my diagnosis to have my surgery for several reasons and had my bmx in January of this year.  If the docs say you're okay to wait, then go forth and enjoy your vacation.  Best wishes!",
      "MessageIndex": 3,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771490",
      "Title": "Please Help me with this pathology report! rn4babies wobyon"
    },
    {
      "AuthorID": "wobyon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
      "Content": "Jul 12, 2011 01:58PM wobyon wrote: barbe1958 - My husband was also somewhat obsessed with my drains.  He was SO accurate with measuring and charting the output.  Seeing the fluid itself didn't bother me - it just looks like pink-ish clear-ish fluid.  It was the stitches and the tube coming out of me that made me queasy, especially when he would strip them and I could feel it tugging.  But hey, they sent me home with Zofran, so it's all good.    Another good point is that I remember very little now from those first couple of weeks post-op.  It wasn't fun when it was happening, but it does pass, and it does get better.  You can do this, bkj66.  (hugs) ",
      "MessageIndex": 7,
      "PostDate": "12/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/771341",
      "Title": "Emotionally and physically scared of bmx bak94 del4"
    },
    {
      "AuthorID": "wobyon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
      "Content": "Jul 14, 2011 08:57PM wobyon wrote: Also, motheroftwins - before you hit the big guns to try and sleep, give benadryl a shot.  My doc recommended I get the children's liquid benadryl, and then figure out exactly how much I needed to sleep.  Turned out I needed very little.  If it doesn't work, by all means, get some Xanax.  Best wishes.  ",
      "MessageIndex": 27,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    },
    {
      "AuthorID": "wobyon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/132134/profile",
      "Content": "Jul 13, 2011 07:47PM wobyon wrote: The phone call and the subsequent wait for a consult with the surgeon was the worst part for me.  After that, I was focused on choosing my treatment plan and team of doctors, and then even more focused on carrying out the plan.   I highly recommend getting copies of EVERYTHING.  All your reports and films...everything.  I hand carried my pathology slides to two different hospitals when I was deciding where to pursue treatment.  No one cares about your stuff as much as you do.  I have a gigantic accordion file with all my medical reports that goes with me to every appointment, and it has come in handy several times.   This board is wonderful.  You'll find lots of support and encouragement here.  (hugs) ",
      "MessageIndex": 12,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771591",
      "Title": "In shock motheroftwins SoCalLisa"
    }
  ]
}