{
  "AuthorID": "Wonderingwanderer",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197793/profile",
  "Posts": [{
    "AuthorID": "Wonderingwanderer",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/197793/profile",
    "Content": "Wonderingwanderer wrote: Hello all, I posted here a week or so ago with some concerns, which are still here, unfortunately. (After about a month of ongoing pain/itchiness/discharge) I went to follow up with my PCP after an inconclusive mammogram/us (dense breasts), and she put me on an antibiotic for 10 days to see if there is an underlying infection (and not bc).  Well, I have been on the antibiotics for 3 days with little change in symptoms. Still pain, itchiness. The only thing that has been alleviating my symptoms is OTC pain medication and dietary changes. (no sugar/carbs). Something that is consistent is the on/off pain, a lump (squished grape-size), and swollen lymph nodes. My left side is the only side affected. I am in my early 30's no familial history of bc. I am also having a yellowish nipple discharge after showers/baths in that breast. It is like pale/honey/whitish in color. (pus?) The mammo and ultrasound did not reveal anything, but was told that I have ductal inflammation. ( & calcifications on the mammo) Originally when I posted here I was worried about IBC, but my condition doesn't seem to be worsening, so I am thinking that that type is unlikely. Still doesn't rule out many other types though. Based on what I have described, what do my symptoms seem like? I have an appointment to see a BS about my problem on the 1st of April. Hoping they have a better idea of what is going on with me. What should I do? Biopsy? Can they take samples of my nipple discharge instead?  Thanks for any ideas---pointing in the right direction. :)  Wishing you all well, take care. Log in to post a reply",
    "MessageIndex": 0,
    "PostDate": "21/03/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/819387",
    "Title": "Pain in Left breast, nipple discharge, swollen lymph nodes Wonderingwanderer Wonderingwanderer"
  }]
}