{
  "AuthorID": "wonderfullymade",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125986/profile",
  "Posts": [
    {
      "AuthorID": "wonderfullymade",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125986/profile",
      "Content": "wonderfullymade wrote: My pathology showed mass to be that pf a fibroadenoma. I am very high risk for developing bc, over 40%. High risk clinic suggesting 6mos mri and alternating digital mammo and tomaxofin. Should I have the mass removed? How about the tomax? I am 37, FYI. Thanks for sharing your thoughts:) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/767195",
      "Title": "Have a small fibroadenoma..13mm wonderfullymade Lisa1962"
    },
    {
      "AuthorID": "wonderfullymade",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125986/profile",
      "Content": "wonderfullymade wrote: High risk 37 year old with 40% risk factor. Onco says he highly reccomends tomax for me and mri and mammo's ulternating every six months. I am having a fibroadenoma removed soon and have a couple of thickened areas under close watch. Looking for feed back on the tomax. I am finished with having children. I have two boys with autism and am hopefully fostering another special needs child in the mear future. I just am not sure whether or not to ake the tomax...need your input ladies:) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/767329",
      "Title": "To Tomax or not to Tomax, that is the question... wonderfullymade Rennasus"
    },
    {
      "AuthorID": "wonderfullymade",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/125986/profile",
      "Content": "wonderfullymade wrote: Calling my sweet cyber mom, I could use a voice of encouragement on here and have seemed to have lost you! I hope this message finds you in good health and cancer free! I am having an mri guided biopsy on Tues on a thickened tissue area that is showing multi focal asymetry, oy! So the whole process begins again and I feel I just went though this yesterday! So, I miss you and would love a note:) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/767884",
      "Title": "Where is my cyber mom???? wonderfullymade wonderfullymade"
    }
  ]
}