{
  "AuthorID": "wondering7",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
  "Posts": [
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 4, 2008 09:18AM wondering7 wrote: To priz 47 You are having surgery. Your system is about to be upset for awhile. In order to heal faster you need to give in. I have had other unrelated surgeries and I know the body needs time to find itself, to speak to you.This is Sunday. I stopped the pain meds because they were narcotic and I feel at most only a 1 on a 0-10 pain scale but I am also not doing excessive things. I could probably drive today or give in and let my son drive us for groceries. With any surgery you have to heal and not break your stitches literally. I am not sure what you do for work but a few days off would only make you feel better. My unrelated surgery, I was told to allow myself 6 weeks to feel like myself again. Today I am having some of those memories because I cannot physically do what I want because my body is telling me to go slow and steady. We don't have to be superwomen all the time. Plan on being slowed down and listen to your body. Clean up the worst parts of your house before surgery so you can relax in peace. I have a large bruise on my right shoulder from the port and my chest feels a little stiff. You are not going to jump out of bed and save the world girlfriend so take a break and let others know you may need their help and understanding. Give yourself a chance. W",
      "MessageIndex": 3,
      "PostDate": "04/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704971",
      "Title": "sentinel node biopsy wondering7 wondering7"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "wondering7 wrote: After an endless wait I had my SNB on May 1st and had a port put in. I am waiting on the results and trying to have some quality family time because it is not just about me, they are equally stressed. For those of you who want to know how it feels----I did the injection on Wed and it was simple (lump biopsies were the worst, like bee stings but tolerable and VIP)The injection shows up on a computer screen like small ears and the doctor locates the spot with this process. I was anathesitized. It took maybe an hour to do the surgery but recovery was a couple of hours as I was groggy. I also had a port put in. I am bruised in both places but have slacked off the pain meds until the evening but don't wait for pain, use your meds if you need them. I am not lifting anything  of any weight and am not wearing a bra only button up shirts for air and comfort. I slept on the couch with pillows to prop me up and that helped. I try to stay positive because it feels better than being the opposite. I find that my family is very stressed by this so I try to switch off and be normal as much as possible. Best Luck. I will try to ask or answer questions if it is helpful. W Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704971",
      "Title": "sentinel node biopsy wondering7 wondering7"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 5, 2008 07:57AM wondering7 wrote: I am not sure what this biopsy is but I can tell you that the medical team is very aware of your stress levels. Most people are very stressed so they are used to it and science is progressing as fast as it can to be painless and scary. Try walking out your energy, get lots of sleep. not too much caffeine. They may do a local anathestic on the area to numb the pain. Talk to them about the procedure, they will explain the pain levels. Practise breathing. Start thinking of nice thoughts to think of when you are in the procedure like a sunset, waves crashing at the beach, a friend and take your focus away from from your fears. They really want to help you so you must relax so that they can do the procedure accurately and only once!!You have to help them do the best job that they are trained to do. Results can take 3-5 days. They will give you pain meds if you need them. You will be fine. Just believe in yourself. W",
      "MessageIndex": 2,
      "PostDate": "05/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/705045",
      "Title": "questions about stereotactic biopsy PugMum ozwiz127"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 24, 2008 02:03PM wondering7 wrote: Go for the biopsy, it is the only way to know what is going on. The core needle biopsy I believe and wait for the pathology reports and try to take your mind off of it with friends, movies, fun. Have a nice weekend.!!W",
      "MessageIndex": 6,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/705935",
      "Title": "It's all happening so fast.. abrede Looneymom"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Apr 6, 2008 10:26AM wondering7 wrote: I am overweight now and am just starting to get a clearer picture of all this. I will be doing chemo first before surgery and do not know all my stats yet. I feel frustrated with my stomach weight but the nutritionist said not to lose weight. I am thinking that the suggestions of fiber and protein and no white stuff and walking /cycling should help but I am positive and still slightly shocked by all of this new lifestyle and slowing down to cater to me. Getting an exercise routine in my head would be good. I used to be athletic and dance but I am slower now. Any words of encouragement are welcomed. I a 58 ( hard to believe!) and have to be careful with low back amd circulation issues but I am not ready to give up anything except rollercoaters and waterslides!!!!",
      "MessageIndex": 32,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/702196",
      "Title": "Weight Firelady snowyday"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 18, 2008 09:57AM wondering7 wrote:  I am sorry you had such pain. Each case is different. They should have offered you pain meds script. Don't forget you are interrupting your body with these procedures so you have to give in and rest but it is better to find out the truth then not to and take some pain meds. W7",
      "MessageIndex": 5,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/707511",
      "Title": "Core Biopsy Pain Estepp suems"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 24, 2008 09:21PM wondering7 wrote: Don't guess. Get the biopsy. It will tell you your personal history and will take 3-5 days for results so schedule a callback appointment with the doctor to learn what your personal history is so you can make informed decisions, not scare yourself with guesswork. Good luck.W",
      "MessageIndex": 3,
      "PostDate": "24/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/705950",
      "Title": "confused...biopsy Tuesday cmdw wondering7"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 16, 2008 12:42PM wondering7 wrote: Hi  I am starting May 20. Don't have all my info handy. My SNB was negative and we are working toward a lumpectomy. Four rounds. Can't decide about a wig. Bought some scarves. Went to a makeup class. Contamination and catching illnesses seem to be important to keep a heads up about. Am a little nervous about so many meds but some of you sound so on top of it. W",
      "MessageIndex": 284,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 16, 2008 11:30PM - edited May 16, 2008 11:31PM by wondering7 Good Morning I don't have all my stats because I had an SNB only with negative results and am doing chemo for a lumpectomy hopefully and do not have a complete pathology. The tips about mouth sores and constipation were good so that should help me. I  will be taking A/C, compazine, ativan, emends, dacradon, neulasta. I was told to take only Tylenol because ibprofen (Advil) is a blood thinner and you want your blood counts to be good. If you need a painkiller ask the doc for something especially to sleep at night. I live with my husband and son. They just want me to get better but they do not want to hear about side effects or hair loss so I try not to upset them, so this forum will help me. I have a good medical team that I trust as much as possible so I try to listen to them and filter out what does not apply to me, as they keep telling me everyone is different and it may not be so bad. Hard to imagine!!! But I did tell several nurses that I am nervous about chemo and that helps them to respond to me as nice as possible and to keep the emergency phone number handy. So talk to them nicely. They have so many of us to deal with. I was one of four women in surgery the other week and that was just one day out of five for them. I learn more by being nice to them because they are also very stressed trying to save us and it is a bit like gambling, no one knows for sure. I try to stay positive and strong because the other choices are not as good. My husband just counts the days until chemo is over like \" its only 67 more days til the last one\" and he keeps me up that way. Anyhow I am rambling and I have a lot to do to get organized, like food shopping for me,  paperwork, cleaning up. Thanks for the welcome. I hope I am this cheerful for the rest of the ride!! PS I was told if you are estrogen positive  soy products and high fats work to feed your cancer so keep that in mind. W",
      "MessageIndex": 295,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 16, 2008 01:58PM wondering7 wrote: Under Chemo tips someone said to use Aleve but I would stick to Tylenol for me.W",
      "MessageIndex": 287,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/704215",
      "Title": "Starting Chemo May 2008 KristyAnn Nico1012"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 16, 2008 09:56PM wondering7 wrote: Bump",
      "MessageIndex": 35,
      "PostDate": "16/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jul 5, 2008 11:14AM wondering7 wrote:  Bump while I work through my neulasta. Stay calm. Stay positive. W7",
      "MessageIndex": 79,
      "PostDate": "05/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Aug 26, 2008 09:44AM wondering7 wrote: Bump Let's hear it for the girls of summer 2008!!!!!! You all rock!!! W7",
      "MessageIndex": 140,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 12, 2008 10:26AM wondering7 wrote: Bump! Going for Neulasta #2 tomorrow. Quiet weekend ahead! W7",
      "MessageIndex": 22,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 16, 2008 10:32AM wondering7 wrote: Bump for Monday W7",
      "MessageIndex": 34,
      "PostDate": "16/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 27, 2008 11:38AM wondering7 wrote:    Bump",
      "MessageIndex": 60,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jul 7, 2008 04:43PM wondering7 wrote: My doctor gave me a script for Claritin but I did not use it. I take tylenol for the ache and temperature. This was a long slow weekend for me on Neulasta. One more round in late July!!W7",
      "MessageIndex": 85,
      "PostDate": "07/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 15, 2008 08:52AM wondering7 wrote: You beat me for the bump rockthebald!!!",
      "MessageIndex": 28,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 15, 2008 08:59AM wondering7 wrote: Rebump W7",
      "MessageIndex": 29,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 18, 2008 09:14AM wondering7 wrote: Bump",
      "MessageIndex": 40,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Nov 12, 2008 03:44PM wondering7 wrote: Hi  I don't. I am in Florida. The best I can offer you at this moment is to try to calm down because it helps you to think better. Also get some exercise to burn off the anxiety or go to the movies. I have just finished a mastectomy and breast reconstruction at 58 and did chemo over the summer. It has been an endurance test of a year. The strangers on this site are probably the most honest women you can talk to and there are lots of us all wondering why us? And how do I proceed? The good news is that you are on your way to be taken care of and yes it may take over your year so at least realize that and understand you can do this. You can fight. I did and I am glad I did. So is my husband and 19 year old son. It seems cancer is not just for old people anymore. It is a not a them problem but an us problem. I am also an aquarian and saw my year pass by once I knew . Don't blame yourself, just open your mind up to the possibilities that you will continue to go on the right path. Be strong. Get angry. Fight back. You can do this. And the doctors want to help you very much. They care. I have met a lot of great doctors and medical staff this year who saved me and that makes them feel good. Relax, accept , listen, talk, take action, survive! You could ask the medical staff or American Cancer Society about support groups or just google your area. That would be the starting point and good luck and God Bless You. wondering7",
      "MessageIndex": 13,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/723060",
      "Title": "I'm 29 and I'm really scared!!! jen29 wondering7"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "wondering7 wrote: In preparing myself for  a masectomy I realize that I would want breast reconstruction but may not be able to afford it through medicaid, so I am looking for resources that I can research quickly because I don't want to delay what should happen in the next week or two. I need to talk to a plastic surgeon for advice who could possibly talk to my surgeon before surgery. I am in Orlando. FL. I will want to wait  on the second surgery to make sure that I am clean or in treatment, but I realize that I will feel upset without my physical appearance and want to research this quickly. Thank you and God Bless all of you who have this problem. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702320",
      "Title": "before surgery and breast reconstruction concerns wondering7 BethNY"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "wondering7 wrote: I feel badly reading how panicked and upset  we are trying to cope so I would like to suggest a list of things to do to relax and stay focused. I'll start it and and anyone is welcome to add to it or organize it as a list. Here are a couple of suggestions: 1. Go to an uncrowded movie with a friend, take a bag with water and raisins, purell, emergency phone# 2. Start a 1000 piece jigsaw puzzle for the summer that others can sit and help you with when you feel low. 3. Help your children do.......... 4.Exercise at doing ........... to burn off energy while waiting for tests results. 5.Music 6. Audio books This is good in the chemo section but also applies to other sections so please pass it around. If we are calm we are focused and can make better decisions, and can enjoy the people around us who really are trying to understand also and may not know how, so it helps them also if you can relax. W Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706241",
      "Title": "How to Stay Sane during this part of your life wondering7 beachmom13"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 5, 2008 10:48AM wondering7 wrote: Hey that's the spirit! W",
      "MessageIndex": 9,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706241",
      "Title": "How to Stay Sane during this part of your life wondering7 beachmom13"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 18, 2008 09:47AM wondering7 wrote: Get the facts. Get the biopsy. Fear  and denial are the major roadblocks to solving cancer. The biopsy feels like a bee sting but the pain of not knowing the patholgy is far worse. Get the facts. Get healthy. Go for the biopsy. Don't waste time. W7",
      "MessageIndex": 6,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/707464",
      "Title": "needle biopsy??? Any Risk? LyLy08 Justlin"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "May 29, 2008 08:49AM wondering7 wrote: Great! It is nice to see we are thinking through this with ways to pass the time so we don't overthink ourselves. I started to overthink yesterday and got upset but it was also a reaction to the drugs and I got a headache. Today I am better and am focusing on the next couple of days with some ideas to stay busy, out of the sun and with relaxation available when I need it.W7",
      "MessageIndex": 4,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706241",
      "Title": "How to Stay Sane during this part of your life wondering7 beachmom13"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 4, 2008 01:12PM wondering7 wrote: Also I carry a crossword puzzle book  in my carry bag to fit chemo brain and keep me busy while waiting in cars or offices. W",
      "MessageIndex": 5,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706241",
      "Title": "How to Stay Sane during this part of your life wondering7 beachmom13"
    },
    {
      "AuthorID": "wondering7",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64185/profile",
      "Content": "Jun 5, 2008 10:30AM wondering7 wrote: I started walking yesterday because I had more energy. I think 2000 steps is a mile so pace out a place near your house and walk in early day or after 4 when it is not too hot.W",
      "MessageIndex": 7,
      "PostDate": "05/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706241",
      "Title": "How to Stay Sane during this part of your life wondering7 beachmom13"
    }
  ]
}