{
  "AuthorID": "worriedinto…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66005/profile",
  "Posts": [
    {
      "AuthorID": "worriedinto",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66005/profile",
      "Content": "worriedinto wrote:  I posted this in another sectin of the forum and have realized it probably belongs here... I am 29 years old, and about 7 months ago i found a lump in my left breast.  I don't have a fmaily doctor (bad, i know), so i went to a walk-in clinic.  The doctor said they were fairly confident that it was a fibroadenoma (sp?), and sent me for an ultrasound to confirm.  The ultrasond did confirm this, but they told me to do a followup in 6 months just to make sure. So i went for the followup ultrasound on Apr 16, and to my shock they said they think the \"lump\" MAY have grown, and wanted to do a biopsy.  They did the biopsy that day (which was scary as it was totally unexpected), and now I am still waiting.  I feel like I am going out of my mind with fear.  It has been a full week and still no results.  I feel like i can't cope with even one more day of not knowing.  I am just floating through the days feeling stuck in limbo. I am getting married in 9 months and have finally gotten to a good place in my life.  I can't handle this being something bad.  I called the hostpital that the biopsy was done on Wed and was told that pathology was backlogged so results would likely be Fri (today) or Mon.  This is day 9 of waiting.  My whole life feels on hold. My fiance has been great but I just feel like I don't want to talk to anyone about uit.  I just want to sit on my couch and let it swollow me up.  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704555",
      "Title": "Losing my mind worriedinto leaf"
    },
    {
      "AuthorID": "worriedinto…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/66005/profile",
      "Content": "Apr 26, 2008 03:19PM worriedinto wrote: Results are in, and it is BENIGN!  THank god!  THey called me at 12pm yesterday to let me know that results were in, and said that they were closing at 1pm so could come in before then or wait until the next day.  Obviously i dropped what i was doing and rushed over.  Much wine was consumed last night in celebration of the results. I haven't been a very active poster on these boards but reading everyones posts have been a great help.  There are some very strong women on here and I wish everyone well. ",
      "MessageIndex": 4,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/704555",
      "Title": "Losing my mind worriedinto leaf"
    }
  ]
}