{
  "AuthorID": "WorriedDaug…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
  "Posts": [
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 19, 2015 01:04AM WorriedDaughter91 wrote: Amen",
      "MessageIndex": 364,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 28, 2015 03:13PM WorriedDaughter91 wrote: Amen",
      "MessageIndex": 327,
      "PostDate": "28/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 26, 2015 03:18PM WorriedDaughter91 wrote: Amen. And prayers for you all and all your families.",
      "MessageIndex": 320,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 29, 2015 03:16PM WorriedDaughter91 wrote: Amen \"Wait on the Lord: be of good courage, and he shall strengthen thine heart: wait, I say, on the Lord.\" (Psalms 27:14) ",
      "MessageIndex": 331,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 31, 2015 02:36PM WorriedDaughter91 wrote: Amen",
      "MessageIndex": 335,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 10, 2015 11:36PM WorriedDaughter91 wrote: Amen",
      "MessageIndex": 353,
      "PostDate": "10/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/832394",
      "Title": "Power of Daily Prayer MusicLover MusicLover"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 24, 2015 01:59PM WorriedDaughter91 wrote: Just an update about mum. She had her MRI and all that the radiologist could tell is that the situation seems to be overall unchanged. Anyway we hope to talk with the onc as soon as possible in order to see what's the next step. I hoped for something more, but considering that the last biopsy said \"equivocal\" her2, I suppose I couldn't have expected anything different. Prayers for you all.",
      "MessageIndex": 297,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 11, 2015 05:06AM WorriedDaughter91 wrote: Dear Woody, thank you for you answer. She seems to feel a little bit better now. She has drunk some tea and eaten some bread and she says she doesn't feel nauseated (yesterday she had nausea since breakfast until she threw up), nor she feels pain. She has taken paracetamol for the fever, but it's too soon to see if it's working. Since it's Sunday we cannot contact her onc nor our doc, but if the vomit will occur again I'm gonna ask dad to bring her to the ER. Maybe I'm just over worrying (I'm very anxious), since a lot of people in our town have had flu with similar symptoms, but I've learnt that with this disease you can never know. I just pray God that mum is going to be fine. Prayers for you and for all the other women who are fighting against this awful disease.",
      "MessageIndex": 323,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 16, 2015 04:57PM WorriedDaughter91 wrote: Dear ladies, I'm writing for my mum. As I wrote in some other posts, last year mum found out she had a liver met. She had six rounds of Herc/Perj/Taxol, which made her stable and then she had a liver resection. During surgery, the surgeon found other very small mets, too small to be detected by a scan. He left three of them. After that mum started Kadcyla. She had three infusions and next week she is going to have the fourth. By the end of August she is going to have a MRI in order to see if the therapy is working. Anyway it happens sometimes that she feels some slight stitches where the liver is. It doesn't happen often and it isn't painful, but I'm worried. The doctors seem to be confident about the therapy, but I'm afraid that it isn't doing its job, since her last biopsy was her2 equivocal and Kadcyla is for her2+. Have you ever experienced anything like that? May it be just a consequence of the surgery? Prayers to you all.",
      "MessageIndex": 2197,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Nov 13, 2015 05:31PM WorriedDaughter91 wrote: Dear all, we just got mum's MRI results. Slight progression of the three known mets (they are less than 2 cm) and three new mets (smaller than 1 cm). Oncs decided to stop Kadcyla and start Afinitor/Aromasin. I'm quite worried for this combo, since I read about very unpleasant/bad se. Moreover I really don't get their plan. They gave her Kadcyla (even though according to her latest istologic exam she is ER 90% PR 10% and HER2 neg (FISH)) and now this... I'm so scared by this situation... It's so hard to be strong when you know that there has been progression. Do you have any advice or experience to share? Prayers for you all",
      "MessageIndex": 2481,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 12, 2015 01:36PM WorriedDaughter91 wrote: Hi Denise, by the end of August mum is going to have a MR in order to see if Kadcyla is doing its job. I just pray God that this drug is working for mum. I hope that it's going to work for you as well and for many other women. I know that all that we can do is being patient, but, as you said, it's really hard. Hugs, Laura",
      "MessageIndex": 296,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 8, 2015 12:04PM - edited Sep 8, 2015 12:24PM by WorriedDaughter91 Dear Sarah, thank you for your answer. I'm sorry that you are dealing with these symptoms and I hope that you'll soon get better. Unfortunately I have no information about the procedure you talk about, but maybe there is somoeone else on this board that can help you. Dear Sandilee, SUV stands for standard uptake value and it's a value you get when you have a PET scan. It should indicate metabolic activity of the mets, though I have no idea about the values (what is considered high? and what is low?). Prayers for you all.",
      "MessageIndex": 2238,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 10, 2015 06:07PM WorriedDaughter91 wrote: Dear all, today, a week after her fifth dose of Kadcyla, mum is experiencing some digestive problems and had ended up vomiting all she has eaten during the day. Her blood tests last week were ok, the MRi she had a month and half ago showed stable disease (3 mets in liver less than 1 cm each) and the in PET she had about a month ago nothing new showed up (liver mets' SUV was 5.7). She says she hasn't pain in the abdomen area. I'm really worried, since I know that vomit may be a symptom of liver mets getting worse... When she had a bigger liver met before resection she had never experienced vomit. I know that you're no doctor, but your wisdom and experience could be very helpful. Do you think we should get worried? Or maybe she has eaten something that caused her this? Prayers to you all",
      "MessageIndex": 2336,
      "PostDate": "10/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 31, 2015 08:39AM - edited Aug 31, 2015 09:17AM by WorriedDaughter91 Dear all, I write here to have some infos for my mum. She has discovered one liver met about a year and a couple of months ago, after her first dx in 2009. She has had 6 months of Herc/Perj/Tax, which made her stable, than she had a liver resection, but during the surgery 6 more mets were found, very small mets, but still... Four mets were taken away and she was left with three small mets. Then she has started Kadcyla and after four infusion we have just found out that it made the liver mets stable, but now some lymph on the breast/sternum area are inflammed, which means, according to them, that ther should be some activity somewhere else. In 2009 she was ER + PR - HER2 + and her liver biopsy had the same result, while the biopsy of the mets resected was ER + PR - HER -. Now the onc told her that she has to do chemo again, but they don't know which kind of... I still wonder why they decided to give her only Kadcyla, since she has become HER2-. I'm so worried and scared. Is there any of you who could share their own experiece, if similar? I really need some encouragement. I always try to stay positive for mum, dad and my little sisters, but there are some days in which it's really hard. I really hoped and prayed for some good news this time :(",
      "MessageIndex": 2227,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 1, 2015 06:46AM WorriedDaughter91 wrote: Dear dunesleeper, As far as I've understood those lymph are slightly inflammed and she had her last scan about three months ago, so this inflammation should be something really recent (or at least I hope so). I don't know exactly when she's going to have a scan but the docs want to start chemo in ten days without waiting for a scan in order to stop whatever is going on as soon as possible and in the meanwhile they are going to plan a scan. I really do hope that this new chemo will help in getting rid of her three small liver mets and stop whatever is going on anywhere else. As far as it concerns my mum's liver mets, the docs haven't told her to stop eating anything in particular. Just not to eat a lot of fried food or too many sweets. Mum's mets have always been asymptomatic (and I hope they're going to stay asymptomatic in they have to stay there) and her blood test never showed anything at all, so I can't help you about that. I hope that scan and meet with the onc will bring you some good news. Prayers for you and all your family. ",
      "MessageIndex": 2230,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 17, 2015 01:12PM WorriedDaughter91 wrote: Dear BabyRuth, Last April mum had a liver resection. According to scan and PET she had just one met. During surgery they found out she had 7 more lesions, all very small, that (for some reason) didn't lit up on PET and weren't visible on scan. Surgeon resected 5 mets on one lobe, but didn't touch the other lobe, so she was left with 3 small mets ( 7mm and 9mm). Total recovery took few weeks. Since then, thank the Good Lord, nothing new showed up nor in the liver nor anywhere else and the 3 mets left are stable according to last MRi. And I pray God that Kadcyla will keep working for a very long time. I hope I have been helpful and if you need more information just ask. Prayers to you and all your family",
      "MessageIndex": 2357,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 23, 2015 01:02PM WorriedDaughter91 wrote: Dear all, Mum has just had her 7th dose of Kadcyla and next week she's going to have MRI. Scanxiety is already here, since last MRI showed stability in liver, but a couple of lymphs in the sternum area a little bit enlarged (about 12-13mm). They didn't show up in PET, but still... Her blood test are good but her TM are not reliable. I pray God that Kadcyla is doing its job and keeps working for a long time, since for mum its SEs are not too bad. But I keep thinking about those swollen lymphs... Prayers to all of you, especially for who's having a hard time and is going to change therapy",
      "MessageIndex": 2393,
      "PostDate": "23/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 6, 2015 04:43PM WorriedDaughter91 wrote: Hi everybody! I'm writing here to get some info for my mother. She has had her third Tdm1 infusion a week ago and she is going to have a scan in a few weeks. I'm so scared, since I'm afraid that the therapy is not working, even though her blood tests seem to be ok. I've been feeling so useless lately, since I can't do anything to help her getting rid of her mets, so I'm trying to get as many info as possible (even though I know that everybody is different). She's er+, slightly pr+ and her2 equivocal (but her two previous fish were her2+). At first she was triple positive. She's been on taxol and herceptin for about six months (perjeta was added after sometime) for a single liver met. After a scan we found out that there had been just a very small regression, she was stable. During surgery (liver resection) the surgeon realised that there were about 7 more very small mets. Now she's on Tdm1, hoping to get rid of the three small mets that the surgeon has left. Is it possible that Tdm1 works better than Herceptin+Taxol+Perjeta combo? Is it possible to be on hormonal therapy and tdm1 at the same time? (Just wondering why the docs haven't given anything to mum for her hormons) Thank you all! (and sorry for my bad English)",
      "MessageIndex": 292,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 9, 2015 04:09PM WorriedDaughter91 wrote: Denny123, thank you for your kind words and for sharing your experience. I try to be positive, but there are some days in which it's really hard. This uncertainty scares me. And I really don't understand why mum is only on Tdm1 and not on an hormonal therapy as well. Thank God, she seems to manage Tdm1's SE (some fatigue, slight nausea and constipation), I just hope that it works, that's the right therapy for her. Prayers for you all!",
      "MessageIndex": 294,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 31, 2015 08:28AM WorriedDaughter91 wrote: Today mum has talked with her onc and there were no good news :( Appearently Kadcyla has made her liver mets stable, but now there are some nodes in the breast area which are inflammed. Now they have to decide what to do, if change thearpy or add something else... I really hoped for some good news...  ",
      "MessageIndex": 299,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Aug 17, 2015 02:48AM - edited Aug 17, 2015 01:39PM by WorriedDaughter91 I'm sorry, I didn't explain very well the biopsy part. She had a first biopsy, when we discovered the met and it's result was er+ pr+ her2+. After te surgery they did a biopsy of the mets and the result was er+ pr+ and her2 (FISH) was very borderline, equivocal according to ASCO guidelines. I have read that Tdm1 could give a good result even in these situations, but still... I can't stop thinking that maybe the Herc/Perj/Tax combo didn't work at its best because she's no longer her2+. As far as I remember, she never felt anything like that during the previous treatment. Her TM are not very reliable, during this whole time the only \"wrong\" value was her d-dimer, but after four months it finally seems to be fine. I pray God that those stitches are shrinking as you said. Thank you very much for sharing your experience. Prayers to you all.",
      "MessageIndex": 2199,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 8, 2015 06:57AM WorriedDaughter91 wrote: Just received the PET scan results. From what I've understood reading the report, there's nothing new. It only talks about the three mets in liver we already knew about, so I hope that mum can go on with Kadcyla whitout starting chemo again. However well'have to wait to talk with doc in order to know what's next. I'm just a little bit concerned about the SUV... It's 5.7. Is it considered high? I hope that everyoneis doing fine. Prayers to you all",
      "MessageIndex": 2234,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Sep 11, 2015 05:07AM - edited Sep 11, 2015 05:41AM by WorriedDaughter91 Dear all, I've got a new question since oncs don't agree on what's next. According to PET mum's situation is stable, nothing was signaled except the liver mets (SUV is a little bit high, since it's 5.7, but that's all). According to MRI liver mets are stable, but a couple of lymph in the sternum area are slightly inflammed. They are about 12mm-13mm. Bloodworks are ok (TMs not reliable). Mum's onc talked with another one from a different hospital and they agreed that, if the PET showed stable, mum had to go on with Kadcyla and had to keep the lymphs under control. Though today mum's onc wasn't there and she talked with another one, who said that it would have been better to change therapy and start chemo. I'm no doctor and I think that high SUV is not good, but, since there is nothing new and the mets are stable why start chemo? Prayers to you all",
      "MessageIndex": 2247,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 12, 2015 04:06AM WorriedDaughter91 wrote: Dear sandilee, thank you for your help. It turned out to be a bad flu, but mum already feels better. I was very worried because I never saw her feeling that sick. Thank you again. Prayers for you and all your family.",
      "MessageIndex": 2338,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 11, 2015 04:05AM WorriedDaughter91 wrote: Dear all, I'm getting really worried... Since yesterday mum was feeling weird. She had nausea and yesterday night she vomited 3 times... now she has fever (about 100) and flu like symptoms. Her blood tests on Friday were fine (platelets, white and red) and previous week too (complete blood tests). She never had anything like that after treatment, just some slight constipation, slight nausea and (sometimes) low platelets... Is it possible that it's Kadcyla side effect after 8 days? Anyone experienced something similar? Prayers to you all",
      "MessageIndex": 321,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "WorriedDaug…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/219172/profile",
      "Content": "Oct 12, 2015 04:01AM WorriedDaughter91 wrote: Dear all, I would like to thank you for your kind words and your support. It seems that it really was the flu. Mum is feeling way better: no more fever, nor vomit and she's not feeling nauseated. I'm sorry if I got really worried just about a flu, but I never saw her feeling bad like the other night, not even when she had chemo. Thank you again. Prayers for you all and your families.",
      "MessageIndex": 327,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}