{
  "AuthorID": "worriedsick…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144505/profile",
  "Posts": [
    {
      "AuthorID": "Worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144505/profile",
      "Content": "Apr 1, 2012 06:53PM Worriedsickinpa wrote: Hi msmpatty, Thanks for getting back to me about your experience.  Today is the first day that I haven't had to take the vicodin. I am also pretty happy with my decision so far. As far as the radiation, I have read a lot of horror stories about it, but as you said it only lasts a few weeks.  Thanks again, Terry",
      "MessageIndex": 12,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784730",
      "Title": "Help! Lumpectomy taking the nipple. kem510 Worriedsickinpa"
    },
    {
      "AuthorID": "Worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144505/profile",
      "Content": "Mar 27, 2012 07:45PM Worriedsickinpa wrote: Dear Kem510, I am 48 and through a digital mamogram and subsequent mamotome biopsy discovered that I had DCIS (ductal carcinoma in situ) grade 3. This is different than what you were diagnosed with. DCIS is non-invasive cancer cells that have not spread beyond the location, (in this case the milk duct).  They also do not have the ability at this stage to spread. BUT my grade was 3 and that means that it could possibly change into invasive CA and then spread into the breast tissue,  become invasive. So at first I thought I was having a lumpectomy until I talked with the surgeon. Because my DCIS was so close, right behind the nipple he highly suggested that they remove the nipple and enough tissue to get clean margins. He also did a Sentinel node biopsy and the same time. This is done to make sure that no cancer cells have traveled to the lymph nodes. Since DCIS is non-invasive it shouldn't have spread to the lymph nodes. But I was told that because mine was a grade3, the highest grade before invasive, that it was a precaution.  I found out last week that he did indeed get clean margins and that there was nothing in the lymph nodes. The surgeon told me that in my case a mastectomy was not needed, but that he would do what I wanted him to do.  My surgeon did a pretty good job still keeping the shape of my breast minus the nipple. All in all I wanted the cancer gone and that was the most important thing.  I am still recovering but doing pretty well. Oh, also I will be having radiation for 6 weeks  and taking Tamoxifen for 5 years to prevent any new occurences in the surgical breast and also the other breast. I hope this give you a little insight even though out cases are not the same. Good luck to you whatever you decide",
      "MessageIndex": 1,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784730",
      "Title": "Help! Lumpectomy taking the nipple. kem510 Worriedsickinpa"
    },
    {
      "AuthorID": "Worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144505/profile",
      "Content": "Mar 29, 2012 05:56PM Worriedsickinpa wrote: Dear kem510,  I thought as you are thinking that a MX is a way to be absolutely certain that they get all the cancer and the there is then no chance of it coming back or developing a new cancer. I have read more than one article stating that is not true. Here is the link to just one of those articles. www.hopkinsmedicine.org  I hope this helps you to make a more informed decision.",
      "MessageIndex": 8,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784730",
      "Title": "Help! Lumpectomy taking the nipple. kem510 Worriedsickinpa"
    },
    {
      "AuthorID": "Worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/144505/profile",
      "Content": "Mar 29, 2012 08:57AM Worriedsickinpa wrote: Hi msmpatty,  I am almost 2 wks post-op, my details in post above. My question is how long were you in pain. I'm still taking vicodin most days.I'm wearing a sports bra and continue to pad it with a washcloth as my doc advised to prevent seroma from forming. Everything just seems so overly sensitive.  I don't know if my pain is coming from the breast or the snb i had done. I really don't like taking the vicodin but it's the only way I can get through the day.",
      "MessageIndex": 5,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/784730",
      "Title": "Help! Lumpectomy taking the nipple. kem510 Worriedsickinpa"
    },
    {
      "AuthorID": "worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133489/profile",
      "Content": "Aug 3, 2011 11:32PM worriedsick33 wrote: Thinking of you. The stress is awful I barely ate for days.remember, 80% are benign.",
      "MessageIndex": 13,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772505",
      "Title": "New lump, here we go again Lavender250 Linda-n3"
    },
    {
      "AuthorID": "worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133489/profile",
      "Content": "Aug 2, 2011 12:36PM worriedsick33 wrote: I just can't stop. I am constantly touching and squeezing the lump. What if.... It just can't be. I am so sick with worry. Please please please be B9. Why did the surgeon have to say \"it could be cancer\" that's all I heard. The mass is different than my other boob. Now harder I think from the core biopsy. I so wanted more reassurance from the DR.",
      "MessageIndex": 3,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772504",
      "Title": "Worried Sick can't stop the google worriedsick33 Wicked"
    },
    {
      "AuthorID": "worriedsick…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133489/profile",
      "Content": "Aug 3, 2011 01:16PM worriedsick33 wrote: Missed the call but thank god she left a message that said \"good news\". I'll update when I know all the details. Finally feel like I can breath.....",
      "MessageIndex": 8,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772504",
      "Title": "Worried Sick can't stop the google worriedsick33 Wicked"
    }
  ]
}