{
  "AuthorID": "worryocd",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181437/profile",
  "Posts": [
    {
      "AuthorID": "worryocd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181437/profile",
      "Content": "May 25, 2014 05:56PM worryocd wrote: Hi!  I have had a preventative hysterectomy-laperscopic assisted vaginal hysterectomy.  The only pain I felt was in my shoulder from the gas they fill you with so they can see in the abdomen.  The doc told me to take it easy for two weeks and slowly go back to regular activity.  Well I am 38, and have three small kids.  I did too much too soon and had a bleeding complication.  I needed to go back to OR for a re-sewing of my vaginal cuff. So listen to the doc when they say to rest.  Don't lift or bend in weird ways.  Walk around during the day but be sure to rest.  Build up the endurance for longer walks slowly.  Having a laperscopic hysterectomy left me with two small scars on the lower half of my abdomen and an incision in my belly-button which is not visible. The recovery is quicker but it is still a major surgery.  So allow your self more time....just to be safe and don't do too much too soon.  ",
      "MessageIndex": 3,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/821392",
      "Title": "Hysterectomy questions following ER+ BC lala1 lala1"
    },
    {
      "AuthorID": "worryocd",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/181437/profile",
      "Content": "May 17, 2014 12:02PM worryocd wrote: Hi!  I know this response is late but I also tested positive for braca1 mutation about a year and a half ago.  I since had a hysterectomy as I am 38 and finished having children.  My mom was diagnosed with late stage ovarian cancer at age 46.  My aunts died from bc in their fifties.  I watched my mom have chemo and battle the disease. She died seven years later.  When learning about the mutation I decided without a doubt to do the surgeries.  I passed my mammo and MRI(Thank God).  My PBM is next month.  So far I am not worried about missing my breasts. I am scared about going under.  I hope and pray that my pathology is clean.   I don't want my kids to see what I saw as a  child...not if I could help it.  These decisions are so difficult.  I just pray that I could give my kids a disease free mommy for as long as possible. ",
      "MessageIndex": 10,
      "PostDate": "17/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/800483",
      "Title": "BRAC2+/DCIS not convinced to do BL Mastectomy Jojogal123 Aditi321"
    }
  ]
}