{
  "AuthorID": "worried_hus…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80048/profile",
  "Posts": [
    {
      "AuthorID": "worried_hus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80048/profile",
      "Content": "Feb 26, 2009 02:09PM worried_husband wrote: Thank you very much. I was 100% sure that it will just be milk or fat deposits. I was always told that she's too yound, no one from her family never had anything etc, so there she is not in the risk group. Now we're there, in a breast cancer clinic with a specialist that ask us to sit down and tell that he doesnt know anything...Maybe I was just to sure about milk and this was too much of a surprise... Core biopsy was done the same day and we will get the results on tuesday. I would't try our luck and leave it as is - biopsy was also not an option. We were told to do it and agreed as this will give us an answer.Now her breast is bit sore, it was all red yesterday but getting better now.  I really dont know why people are more concerned about the biopsy than the result... I am so worried, worried about her. She went throught the pregnancy, then give a birth to our baby, which was really painfull and stressful, she is also a great mum and my loving wife and my life guide. And now this... Artsci1 - did your doctor told you the result of the first test? Our said that they dont know what it is and all they found were inflamed cells (said that it's the same thing when you have a sunburn or bee sting). They have to analyse what's that and why it;s inflamed. Fist I thought it's just an infection but he also mentioned that my wife has to be prepared to stop breastfeeding if they will have to cut it. This worries me the most... Momof4stars - at what age was the cancer diagnosed? (if you dont mind my question) There is also one more thing I am worried about - she found this lump when it was about 2cm big, so is it possible that it had grown so fast  since she started breast feeding or did she just missed that? She used to check her breast regurally and I think she would find something earlier. I am bit superstious so will not ask for any options, best and worst. Just have to wait ang gather more information...  Thanks again for all your help and support.",
      "MessageIndex": 3,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729783",
      "Title": "Core Biopsy - some advice worried_husband NeoPat"
    },
    {
      "AuthorID": "worried_hus…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/80048/profile",
      "Content": "Mar 4, 2009 07:26AM worried_husband wrote: It's solved now. We went to hospital yesterday and had to wait extra 30 minutes - longest 30 minutes in my life. After that we were invited to a room where my wife was asked to take her shirt and bra off, assistant put a white cloth and we had to wait another few minutes. All bad thoughts were flying by - why, what's that for if they know how it looks like, are they going to find the best place to cut breast? ... and many others. Finally after few minutes (I felt like centuries) another (3 one we've met) went in. She checked breasts, asked same questions which got me even more suspicious. Then she asked my wife to put her clothes on and she will then tell us about the biopsy. She started about breasts, what's inside etc and then said something about fibro... (don't remember). This holds it all together and apparently it caused the problem. There is no cancer, nothing to be worry about. It looks like a scar. They want to see her after 4 months to check if it'll shrink when she will stop breastfeeding. After reading so many websites about breasts (not porn :) ) I think it might be due to breast mass increase and intensive milk production. Maybe some cells were not that flexible and got tear. Don't know but this makes me think how good breastfeeding really is. Last week was really scary for us, but looking at time they reacted and different tests they did, I am happy. Back in Poland, where we used to live, women wait few weeks for needle biopsy! Now I am more aware or how money, job and other material things cannot compare with health. Big problems are now nothing important and I am confident that I can get over it. Healt is something we underestimate, till it's too late or we're worried - and then we think how stupid we were to chase all those things that cannot really give us a happiness. It's like Freddie Mercury - he scored everything and died in glitter of fame and fortune. Thank you once again for all your help and good luck ladies.",
      "MessageIndex": 4,
      "PostDate": "04/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/729783",
      "Title": "Core Biopsy - some advice worried_husband NeoPat"
    }
  ]
}