{
  "AuthorID": "Wrinklequee…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
  "Posts": [
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 6, 2015 09:25AM Wrinklequeen wrote: Hopefulmom6, Have you heard anything yet? Let us know when you hear something. I'll be praying for you! :) Love & Hugs, Wrinklequeen",
      "MessageIndex": 4,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829179",
      "Title": "Waiting for the phone call Wrinklequeen Hopefulmom6"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 6, 2015 07:05PM Wrinklequeen wrote: gypsyjo, Thanks so much! I did call the Breast Diagnostic Center and talked to the nurse there today. She pulled up my report and could not find any wording in the report to worry about. She did not see the word \"atypical\" either, she said. She thinks the issue w/ wording is referring to what to do next. I am leaning towards a lumpectomy to just get it out of there so I don't go through all of this every 6 months, and stress as I am a HUGE worrier! She gave me a list of surgeons they work with to call for a consult. I'm thinking of calling next week and setting up the consultation. The mass was only 5mm, so I wonder if they will think that is too small to do anything with? I think your plan of the lumpectomy plus the special type of radiation sounds like a great way for you to go. :) I can feel your power, determination, and sense of peace down deep when I read your posts. :) I'm so glad I heard back from you. :) One thing I feel bad about is getting a dx of benign, while other new friends on this site did not get a similar dx. I find it hard to celebrate while others are having to walk a very different path. I wish everyone could hear those same words; benign. gypsyjo, thanks again for your reply, it gave me a smile! :) Wrinklequeen, P.S: Here's hugs & hopes, good wishes & prayers to everyone still waiting for their diagnosis, and also to everyone who is no longer waiting to hear. My thoughts and my heart are with all of you. All that is within all of us will help others summon the drive, determination, and sheer spirit that will carry you through this. Hundreds and hundreds of prayers are spoken, mumbled, or shouted every day for our new friends we have found here - and hopefully we can gain some strength from the prayers and well wishes from others on our part. Hugs & love to all of you...today, tomorrow, and always. :)",
      "MessageIndex": 8,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829179",
      "Title": "Waiting for the phone call Wrinklequeen Hopefulmom6"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 6, 2015 09:23AM Wrinklequeen wrote: They called to say the results were benign, but that there were a few wording issues so they would have to wait until the Dr got in next week to look it over, and then she would meet me with me to let me know what's next. I asked if I could see the report, and the Nurse said they didn't have it yet, but that was what the Breast Diagnostic Center said. She went on to say that the results said it was benign, and not cancer. So...what does this really mean? Anyone else ever heard this wording from a Nurse sharing the results before? I'm not sure if I should be guardedly happy, or just plain old HAPPY? :) Love & Hugs, Wrinklequeen",
      "MessageIndex": 3,
      "PostDate": "06/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829179",
      "Title": "Waiting for the phone call Wrinklequeen Hopefulmom6"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 7, 2015 08:49PM - edited Mar 7, 2015 09:22PM by Wrinklequeen ballet12, I'll hear from the Physicians Assistant, who the results go to, this week (hopefully) when her nurse calls me once she reviews my report. The nurse said it looks like the extra wording might have to do with what to do next - have a lumpectomy or watch and wait were options that were brought up. The nurse at the Breast Diagnostic Center, where the ultrasound & core biopsy were done, said I might want to get a consult w/ a breast surgeon to see what he thinks. When I asked if I should wait to hear from the Physicians Assistant she said no, thinking the appt would probably be a while out. She also said those Drs would have access to my report, so I didn't have to have the report in hand when I went for a consult. I have met with this Surgeon before, and I do trust his judgement. She wasn't surprised that I might just want to go ahead and get a lumpectomy so I don't continue to worry about it. (I thought a lumpectomy and an excisional biopsy are called the same thing, that's why I referred to it as an ex. biopsy.) I guess I figured when they take it out they'll biopsy it, I would think. ( I had a lumpectomy 20 years ago that turned out to be benign in the other breast.) I know I'll worry about it every 6 months before the mammo and ultrasounds that will be scheduled. Thanks for your response. It gave me something to think about. I guess I won't know everything until I see a copy of the report, or hear everything that is on the report. I looked online at the BD Center, but it's not posted yet. I'll wait to hear what the report says, and then see what the Physicians Assistant and the Surgeon both have to say about what the next step should be. Thanks again for sharing. As a newbie, my experience and wisdom is very limited. :) Hugs & Prayers to All, Wrinklequeen",
      "MessageIndex": 6,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829235",
      "Title": "Anyone? DX as benign, find out later it wasn't Wrinklequeen ballet12"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 7, 2015 08:56PM Wrinklequeen wrote: Thanks, grammakathy. I'm a newbie, so I'm open to all the wisdom and experience others are willing to share! :) Hugs & Prayers. Wrinklequeen",
      "MessageIndex": 8,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829235",
      "Title": "Anyone? DX as benign, find out later it wasn't Wrinklequeen ballet12"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 7, 2015 08:54PM Wrinklequeen wrote: nmh35, What happened when the MRI biopsy came back w/ those results? Was it a wait and see, or did they do surgery? Thanks for sharing. :) Wrinklequeen",
      "MessageIndex": 7,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/148/topics/829235",
      "Title": "Anyone? DX as benign, find out later it wasn't Wrinklequeen ballet12"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 11, 2015 07:49PM Wrinklequeen wrote: bendi, Do you need a core needle biopsy, or a surgical biopsy? I had the core needle biopsy, and it wasn't bad at all. Let us know when you get scheduled & when you hear something! :) Sending prayers your way! Hugs & Love & Prayers, Wrinklequeen",
      "MessageIndex": 6,
      "PostDate": "11/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829378",
      "Title": "Darn it! After a long wait.... Bendi Bendi"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 5, 2015 01:01PM Wrinklequeen wrote: Staara, I think the waiting is making us ALL insane! At least that's how I feel. :) Sending good thoughts your way, and littleblueflowers, too. I know you are both expecting results today. :) Love & Hugs, Wrinklequeen",
      "MessageIndex": 5,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829142",
      "Title": "Waiting sucks Staara alicki"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 5, 2015 12:18PM Wrinklequeen wrote: littleblueflowers, Saw your post from 12 minutes ago. Doesn't it seem like time is standing still, or at least going super, super slow?!!! Let me know when you hear something! Love & Hugs, Wrinklequeen",
      "MessageIndex": 3,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829142",
      "Title": "Waiting sucks Staara alicki"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 5, 2015 11:48AM Wrinklequeen wrote: Staara, Here's to hoping you get your results soon, and that they are good news! :) I'm waiting for my results after my core biopsy on Tuesday. I figure Friday or maybe early next week it will be my turn to hear the news. Good thoughts and prayers sent your way. :)",
      "MessageIndex": 1,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829142",
      "Title": "Waiting sucks Staara alicki"
    },
    {
      "AuthorID": "Wrinklequee…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/212067/profile",
      "Content": "Mar 5, 2015 01:22PM Wrinklequeen wrote: littleblueflowers, Just remember that it was posted on here that some places have you come in for results, positive or benign. I'll be thinking of you and praying SUPER HARD for you, my friend. I'm tearing up right now thinking about how worried you must be. I'll be walking beside you today as you go in for your results. Please let me know how it goes. :) Prayers, prayers, and more prayers are headed your way, along with tons of hugs! :) Love & Hugs, Wrinklequeen",
      "MessageIndex": 7,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/829142",
      "Title": "Waiting sucks Staara alicki"
    }
  ]
}