{
  "AuthorID": "Xantippe",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52623/profile",
  "Posts": [
    {
      "AuthorID": "Xantippe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52623/profile",
      "Content": "Oct 26, 2007 06:15AM - edited Oct 26, 2007 06:16AM by Xantippe Hi all, I am new to this forum, and look forward to exchanging our experiences during radiation. I finished my chemo treatment yesterday (4DD AC and 12 weekly Taxol/Herceptin). I will continue the Herceptin every 3 weeks through 8/08. I have a follow-up appointment with my surgeon today, who wants to be involved in deciding the radiation treatment. On Monday I have my first visit with the radiation oncologist. I am hoping to get started in two weeks or so. The chemo was a long haul, and for now I see the radiation as the \"easy part\". I hope I am right! I have a question for those of you who are ER+/PR+: Are you starting the hormone treatment during radiation or waiting till after? I am not sure yet what to do. And a question for those of you who have had chemo: Are you being offered new scans after finishing the chemo? My oncologist advices against new scans unless I have specific symptoms that need to be checked out, and says that frequent scans just cause the patients more anxiety. I am trying to feel comfortable with his point of view. I wish everyone a great day, and look forward to your comments. Lise",
      "MessageIndex": 150,
      "PostDate": "26/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/690526",
      "Title": "Anyone start rads in October? Motherbeartosix Helenhsm"
    },
    {
      "AuthorID": "Xantippe",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/52623/profile",
      "Content": "Apr 6, 2008 07:38PM Xantippe wrote: Waking up after surgery was something I worried about also. My lumpectomy in May was my first surgery. I was disoriented at first, and felt a bit nauseated. I was not in any pain. I went home a couple of hours after I woke up, after having a light meal of crackers with cheese, and juice. I felt sleepy and out of energy, and spent the rest of the day in bed relaxing and sleeping. I was able to eat some light food, even if I didn't feel hungry. The following day I felt a lot better already. All in all the experience was less scary than I had anticipated. Good luck on your surgery!",
      "MessageIndex": 4,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    }
  ]
}