{
  "AuthorID": "XRAYestInMA…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99564/profile",
  "Posts": [
    {
      "AuthorID": "XRAYestInMA…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99564/profile",
      "Content": "May 11, 2011 08:16PM XRAYestInMA wrote: Hello.... I have had 3 custom Radiant Impressions prostheses made within the past 6 years. If anyone has any questions about them, I would be happy to share what I know about them, including costs and durability. Send me a PM with any questions and I will be happy to get back to you.",
      "MessageIndex": 37,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/619772",
      "Title": "Anyone have Radiant Impressions breast form? Steph54 BoobsinaBox"
    },
    {
      "AuthorID": "XRAYestInMA…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/99564/profile",
      "Content": "Mar 4, 2011 11:16AM XRAYestInMA wrote: When I was diagnosed with BC in 2005, I found out that my ca was triple positive. After 6 months of chemo, (AC and then T), I was started on a five-year plan of Tamoxifen, in addition to a year of Herceptin. I was 37 at the time and no where near menopause. While my periods did stop for a while during the AC, they came back during the Taxol time and never went away again. I had zero side effects with the Herceptin and zero side effects with the Tamox. Once the 5 years were up, my Onc. suggested a BSO as my next step. I had those out in Dec. 2011 (laparoscopically is the way to go if you can), and opted to leave the uterus in since I had a U/S prior to the ooph and it was normal. I had 2 consults with 2 different OB/GYN's ...the first one acted as though I had lost my mind by wanting my O's out being that I was 43 and had no GYN issues (apparently she didn't get the BC and ovary connection)...the second one had no problems with scheduling me for what is basically an elective surgery. My insurance had no issues paying for it either (BC/BS of MA at the time), since it was nothing compared the the $$$ they already dished out for the tests, surgeries, and chemo. The surgery itself was a breeze - in at 10:30 , surgery at noon, discharged home at 4 pm - 2 little scars in my abdomen and one hidden one in my umbilicus. A little nauseous once I was home and uncomfortable for a few days...was given a script for Percocet but never filled it as Motrin 800mg seemed enough to take the edge off. I was up and about doing housework/laundry by the 3rd day and back to work 2 weeks later. The surgeon recommended 4 weeks off from work but I felt good enough after 17 days off. I went back on \"light duty\" which for me equated to no lifting patients over 10 lbs (so basically no lifting of patients at all) and no wearing of lead gowns for 2 weeks. Overall not an unpleasant experience as surgeries go...now the surgical menopause was a tad difficult to deal with (but that's another story, LOL).",
      "MessageIndex": 19,
      "PostDate": "04/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/765600",
      "Title": "What are the reasons for taking out ovaries? geogal nikola"
    }
  ]
}