{
  "AuthorID": "xtina",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154095/profile",
  "Posts": [
    {
      "AuthorID": "xtina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154095/profile",
      "Content": "Jan 10, 2013 10:35AM xtina wrote: I had a lumpectomy in August, and because I had overall saggy boobs from a big weight loss I had a reduction/lift on both breasts at the same time for symmetry, etc.  The extent of any pain/recovery time will depend on the extent of your lift.  I had quite a bit to lift and reduce so my incisions were around the nipple, straight down from nipple to the bottom of the breast, and under the curve of the breast. I had pain that was tolerable with painkillers for a week or so, and then I just needed a Motrin here or there.  I did have a drain on one breast for two weeks.  I also had 6 week limitations on exercise and limitations on what type of bras to wear for several months, but that's about it.  All in all I am extremely happy with the results and would do it again in a minute. You just need to weigh the pros and cons, and ask yourself if you would be happy with any amount of asymmetry you may (or may not) have as a result of not doing the lift.  Also, depending on what size you are and what the volume of each breast will be after surgery, it may be worthwhile to figure out bra sizing. It may sound silly, but if your results from not doing the lift would be such that you will have differing cup sizes and may need to wear an insert/form, that may make a difference to you.",
      "MessageIndex": 4,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/798617",
      "Title": "Anyone have a lift on their healthy breast mrenee68 Kay_G"
    },
    {
      "AuthorID": "xtina",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/154095/profile",
      "Content": "Jan 16, 2013 08:11AM - edited Jan 16, 2013 08:12AM by xtina Hi Big Shirley!  I have been reading your posts about the SNB.  I was also diagnosed with DCIS and had a lumpectomy with SNB. My surgeon(s) explained to me that 20% of the time with DCIS invasive cells are found when they perform the final pathology on the tissue removed.  If invasive cells were found, they would need to do the node biopsy anyway.  Performing the SNB at the time of surgery is far simpler than having to open you up again and perform it later, and an SNB has less associated risks of LE.  If I am remembering correctly (and someone plz correct me of I'm not) the chance of LE with an SNB is like 3% compared to 17-20% with a full node dissection which is far more invasive.  They literally are looking at just one or two nodes here. For myself, I just decided that since the risk of LE was so low, and the incidence of finding invasive cells was 20%, so like a 20% chance I would need to have it done anyway, that it would benefit me more to have the SNB done at the time of surgery, and to prevent myself from having to be opened up again.  It's one of those things where either way you are taking some amount of risk, you just have to decide which way is better for you.  Never easy!  Good luck with your decision. ",
      "MessageIndex": 11,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/798888",
      "Title": "biopsy result question bigshirley Binney4"
    }
  ]
}