{
  "AuthorID": "yearbooktea…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102272/profile",
  "Posts": [{
    "AuthorID": "yearbooktea…",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102272/profile",
    "Content": "May 20, 2010 07:04AM yearbookteach wrote: Thank you ladies. Deep down I know this is what I have to do to to put my mind at ease OR find out what the problem is. Mary: I'm in Texas and thank goodness I still have insurance. From my understanding, MRI is covered as long as deemed necessary by a specialist.  Nekk1977 and Hattie and Laurie: Thank you all for the encouragement.  Cancer is just scary ... lost my mom to non-small cell lung cancer (adenocarcinoma) 5 years ago. That was tough to see her suffer so. The thing is, she knew something was wrong. But kept going to the doctor and getting disgnosed with bronchitis. A chance X-ray found her cancer. And her dad died of colon cancer. I know that these are probably not in the \"cancer-relationship\" to BC category, but the mind is a powerful tool at working the paranoia. My \"other mom\" (my aunt on my dad's side) is now suffering and getting treated from liver cancer and lymphoma.  As for other family history, I honestly just don't know. I come from a family where older people still whisper the word. People have had it and died from it, I just don't know what kind. On another note, I picked up my films reports yesterday and noticed that I only got the last two reports. Both of these are normal. Now I could've sworn that I had one that was \"normal\" but the report skirted over some little calcifications to watch. Shouldn't that be on subsequent reports? And also, they only gave me the last two years of films. They told me that the particular breast surgeon I am  going to prefers the last two years only. Hmm... I don't like that. I'm going to call his office to find out. If I'm going to do this, I want him to have all the info. This started at 33 and I'm now 36, so it's not like I have a ton of film for him to look at.  Well, off to work and I'm going to try to keep my internet research down to a minimum for the next week as I can get wrapped up for hours. Hope you all have a wonderful day. ",
    "MessageIndex": 5,
    "PostDate": "20/05/2010",
    "ThreadURL": "https://community.breastcancer.org/forum/83/topics/752838",
    "Title": "Did you ever think you were overreacting? LONG! yearbookteach wallycat"
  }]
}