{
  "AuthorID": "yogamom2",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283143/profile",
  "Posts": [
    {
      "AuthorID": "yogamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283143/profile",
      "Content": "Dec 12, 2018 02:14PM yogamom2 wrote: Thanks for everyone's helpful replies. Glad to know this seems standard of care. The need for a second surgery after pathology was what concerned me, but I'll trust my surgeon and hope for the best. I had looked at the DCIS thread as well and didn't see anything noted there. Since I'm newly diagnosed, and new to this forum, I started here. If I post again I will make sure it's to that thread. Good luck to all.",
      "MessageIndex": 6,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868811",
      "Title": "no lymph node removal for early DCIS?? yogamom2 Jelson"
    },
    {
      "AuthorID": "yogamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283143/profile",
      "Content": "yogamom2 wrote: Hi all, I am 60 years old, just diagnosed, had my meeting with the surgeon on Monday and will have lumpectomy in early Jan. Mammo & Biopsy reports state: DCIS stage 0: small (5mm), well contained, intermediate nuclear grade, cribiform, associated w/ calcifications found on mammogram with no mass or symptoms. Of course that stage could change with the pathology following Jan.surgery. My surgeon has ordered an ultrasound and said if that doesn't show anything new I won't need lymph nodes removed or radiation. I asked about the OncoType test but she said that's not usually used for stage 0 DCIS. She is considered a breast specialist in our area and spent the last week at a BC conference in TX. I will need to see a medical oncologist for hormone blocking medication because my biopsy showed 95% positive for both estrogen & progesterone receptors. Has anyone else had similar advice, esp re: lymph nodes & Oncotype? Thanks for your thoughts Dx 11/2018, DCIS, Left, <1cm, Stage 0, Grade 2, ER+/PR+ Surgery 1/8/2019 Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868811",
      "Title": "no lymph node removal for early DCIS?? yogamom2 Jelson"
    },
    {
      "AuthorID": "yogamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283143/profile",
      "Content": "yogamom2 wrote: Hi all, Just diagnosed via stereo-tactic biopsy w HR+ DCIS, found on mammo as small linear micro-calcification cluster. Radiologist thinks it's very early and said surgery / pathology to confirm margins is next step. Reading a lot about over treatment of very early DCIS. Right now head is spinning. Suggestions appreciated for specialists/surgeons in the NW Phila suburbs (bucks/ mont) and any questions I might not think to ask during consult. Doctors/ hospitals to avoid would be equally helpful. Thanks. Dx 11/2018, DCIS, Left, <1cm, Stage 0, Grade 2, ER+/PR+ Surgery 1/8/2019 Lumpectomy: Left Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868752",
      "Title": "new DCIS diagnosis yogamom2 yogamom2"
    },
    {
      "AuthorID": "yogamom2",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/283143/profile",
      "Content": "Dec 12, 2018 06:58PM yogamom2 wrote: hormone receptor--means influenced by estrogen/ progesterone or both. Good Luck! Hope they find nothing.",
      "MessageIndex": 2,
      "PostDate": "12/12/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/868752",
      "Title": "new DCIS diagnosis yogamom2 yogamom2"
    }
  ]
}