{
  "AuthorID": "YramAL",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
  "Posts": [
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 27, 2012 09:02PM - edited Feb 27, 2012 09:13PM by YramAL I wish I had seen this when I was going thru rads 2 years ago. It would have helped me understand more what was going on with my body. I have no complaints about my radiation oncologist, as some do. He was(and is) a very kind, compassionate person. I had severe \"burns\" under my breast towards the end of treatment, and not once did he dismiss my symptoms and discomfort. His nursing staff was wonderful as well. As far as those hydrogel pads? Lifesavers! Here is the brand I used. http://www.sterlingmedical.com/EXT/SMS/SterlingProducts.nsf/catalog/3811 I got them from the rad onc's office. I would sort of wedge one under my breast and use a soft bra to keep it in place all day. I don't know how I would have gotten through the last couple of weeks of treatment without them. Mary ",
      "MessageIndex": 9,
      "PostDate": "27/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Apr 4, 2014 10:06AM YramAL wrote: Thinking of you today, Chickadee. I'm so glad you are home and getting to enjoy all the birds. Wishing you pain free days and restful nights. Mary",
      "MessageIndex": 153,
      "PostDate": "04/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819674",
      "Title": "Hospice for me. Chickadee Jac53"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 28, 2011 02:02PM YramAL wrote: Here's a discussion of humming during ultrasound right here on BCO: http://community.breastcancer.org/forum/62/topic/747887 Mary ",
      "MessageIndex": 2,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764081",
      "Title": "humming during ultrasound mudd YramAL"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 27, 2010 11:33AM YramAL wrote: The way it was explained to me was that the Oncotype test addresses the risk of the cancer metastisizing to other parts of my body, such as the lungs, liver, bones, etc. My score was 11, so I chose not to do chemo. Radiation is for reducing the risk of a local recurrence-in other words, it helps get rid of any unseen cancer cells in my breast that were not totally removed in my surgery. It helps to keep the cancer from coming back in that breast. My doctor showed my the CT scan of the area that is being treated, and the range of the radiation. In my case, it totally misses my heart and barely, barely skims a small portion of my lung. I started my radiation 9 weeks after my lumpectomy. My radiation oncologist said the ideal time is 6-8 weeks after surgery, but I was waiting for the results of my Oncotype test. If I had had to have chemo, I would have done that first.",
      "MessageIndex": 3,
      "PostDate": "27/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/749013",
      "Title": "Recently Diagnosed and Concerned about Radiation hopie NatureGrrl"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Nov 9, 2010 03:11PM YramAL wrote: Stella-I do not share a similar story but you might get more responses to your question if you start a new topic. Go to the \"Forum Index\". Find the forum that best fits your question-perhaps the \"Not Diagnosed with a Recurrence or Metastis but Concerned\" forum. Click on the forum name and it will give you an option to start and title your own thread. I wish you peace of mind and hope that this new thing in your other breast really is nothing. Mary",
      "MessageIndex": 16,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/736596",
      "Title": "How long recovery from lumpectomy? Anxiousmama RMlulu"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 8, 2010 08:27PM YramAL wrote: Ezscrriibe- My feelings exactly. My Bravo Sierra detector was beeping as well. Shame on Sepahunt/Medvetz for playing with people's emotions and sympathies like that. ",
      "MessageIndex": 25,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/751841",
      "Title": "Looks Like I'll Have To Take My Wife Out Of The Country Sepahunt22 CathyB"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 1, 2011 05:58PM YramAL wrote: I work at an elementary school, and we have had some students show up wearing the \"I <heart> Boobies\" bracelets. I asked our principal what the school's policy was about something like this, and he told me that if they don't cause a distraction to instruction, the students can wear them. If, on the other hand, they disrupt learning, we can ban them.  I find that the students who wear them the most, and have them taken away the most for inappropriate behavior, are 11- and 12-year old boys. There is absolutely no breast cancer awareness in chanting, \"I love boobies! I love boobies!\" over and over again in response to one of the boys wearing a bracelet. I took the bracelet away, and the boy said, \"But that's for breast cancer awareness!\" I said nothing-the students have no idea I'm a breast cancer patient. My husband asked me why I didn't say anything to the boys about my breast cancer, and I told him that I didn't think they would care one bit-it was all about being able to say \"boobies\". Mary ",
      "MessageIndex": 49,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/768271",
      "Title": "Since we all love a good rant Fitztwins WingsofHope"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jul 21, 2010 05:31AM YramAL wrote: Thanks for the inspiration! And congratulations! Mary ",
      "MessageIndex": 14,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/755284",
      "Title": "10 Year Anniversary Today! LindaLou53 gutsy"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 21, 2011 12:55AM YramAL wrote: I have insurance and my biopsy was about 3 weeks after my mammo/ultrasound. I agree with all the posters here who say that it is probably a matter of scheduling. In the big picture-3 weeks really isn't going to make any difference in your diagnosis and/or treatment, but I know that the waiting is awful. Try to do some special things for yourself in the meantime. Mary ",
      "MessageIndex": 10,
      "PostDate": "21/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765194",
      "Title": "Is it because I'm young or because I have no insurance. karamelspice karamelspice"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Mar 27, 2012 06:34PM YramAL wrote: I had a similar experience, but after my presurgery MRI. My surgeon came in right before my surgery and sort of offhandedly remarked,\"You have a mass on your left kidney, it could be a cyst or something you've had since birth. We'll check it out with ultrasound.\" Here I was, definitely with breast cancer, and now I had this to worry about! I had an upper abdominal ultrasound and it turns out I have what is called an \"accesory spleen\"-an extra spleen. Who knew? Nothing to worry about and not all that uncommon. I guess my point is, even if your letter isn't some sort of mistake, it could be other things besides cancer that they are looking for. Mary ",
      "MessageIndex": 3,
      "PostDate": "27/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/784789",
      "Title": "Please Help, I'm Worried iamastar iamastar"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 16, 2010 05:47PM YramAL wrote: Correction-the Carradress dressings are 4' by 4'. You can purchase them online, but they are quite expensive. I got them just for asking from my rads doctor. Here's the Amazon.com listing. http://www.amazon.com/CarraDres-Hydrogel-Sheets-sheet-CRR101053Z/dp/B000K6LULC Mary ",
      "MessageIndex": 4,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/752703",
      "Title": "Skin Breakdown - how long to heal? suzieq60 grdnslve"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 17, 2010 07:33AM YramAL wrote: I don't know if facedown would make much of a difference. I know that my \"floppy boobs\" retained a lot of heat under them for quite some time after treatment each day and I'm sure that had something to do with the sore I got. I'm thinking it was pretty much unavoidable. As my rad tech said to me on my first day of treatment, \"Large breasts, fair skin.....honey, you're a recipe for a skin reaction.\" She told me later, when my breakdown started to happen, that she hated being right. Mary ",
      "MessageIndex": 8,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/752703",
      "Title": "Skin Breakdown - how long to heal? suzieq60 grdnslve"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 17, 2010 07:43PM YramAL wrote: Suepen- You'll know the area is starting to heal when you see patches of white under there(instead of angry red!). As my rad onc explained it, those white areas are the new skin growing-he called them \"islands\"-and before you know it, they start to expand, and pretty soon they meet, and voila! You are healed!  Mary ",
      "MessageIndex": 10,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/752703",
      "Title": "Skin Breakdown - how long to heal? suzieq60 grdnslve"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 25, 2010 01:47PM YramAL wrote: I have a friend who had a 9 cm. DCIS. I have no idea how DCIS can be that big and still be DCIS! She did end up having a mastectomy because it was so large and her breast was so small(AA cup) that a lumpectomy would have been impossible. Mary ",
      "MessageIndex": 1,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/753107",
      "Title": "Dr.'s words: \"I am more concerned than not concerned\" ebarb mom3band1g"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jul 19, 2010 02:49PM YramAL wrote: I saw my rads onc 5 weeks after I completed treatment, and he and I both agreed that my medical oncologist could schedule my followups as needed. I'm almost 4 months out from completion, and I'm sure I would call my rads onc if I felt I was having rads complications, but I'm OK with not seeing him again. Mary ",
      "MessageIndex": 3,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/755575",
      "Title": "Rads Onc Follow Ups: How Many? FCB ruthbru"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 16, 2010 04:59PM YramAL wrote: I went to 2 different oncologists after my cancer diagnosis and the first one did not believe in the validity of the oncotype test but said she would order it anyways if I wanted it. The second oncologist was a firm believer in the value of the oncotype test. I went with the second doctor. I figured if I was going to put my faith in the oncotype test, I should go with a doctor that believes in it as well. Got an oncotype score of 11, so...no chemo for me. Mary ",
      "MessageIndex": 3,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/759452",
      "Title": "Use of Oncotype lola12 kira1234"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 20, 2012 01:09AM YramAL wrote: I am in love with my Shark steam mop. I use it on my vinyl and tile floors, and every once in awhile on my hardwoods. I'd marry it if I could.  Mary ",
      "MessageIndex": 21,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782869",
      "Title": "it's cleaning day apple K-Lo"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Sep 29, 2013 10:13PM YramAL wrote: Shoppygirl-My 27 year old daughter had a thyroid nodule last year that had both cystic and solid qualities. Apparently, having both indicated a higher risk of malignancy. She had a biopsy and it was benign. She said the biopsy itself was not painful, but the recovery afterward was. Not out of control painful, but painful, none the less.  Best wishes to you for B9. Mary",
      "MessageIndex": 11,
      "PostDate": "29/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/811514",
      "Title": "Thyroid Nodule. shoppygirl shoppygirl"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Dec 8, 2012 05:19AM YramAL wrote: I also had a score of 11, grade 2 tumor, 1.8 cm.  I was told that with my score, chemo would not be beneficial, in fact, the risks outweighed the benefits. I chose not to do chemo. I think my oncologist would have given me chemo if I had insisted, but I didn't.  Mary",
      "MessageIndex": 3,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797383",
      "Title": "Low Oncotype score- Will Chemo give extra insurance? neugirl voraciousreader"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 20, 2012 02:56AM YramAL wrote: I am such a housekeeping nerd. I love this thread. Mary ",
      "MessageIndex": 27,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/782869",
      "Title": "it's cleaning day apple K-Lo"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jul 16, 2011 02:20AM YramAL wrote: I was told that my tumor, while not DCIS, did not appear overnight, and that I had plenty of time to make informed decisions regarding my care.  I understand that urge to do something IMMEDIATELY but I would venture to guess that you going on vacation, and waiting until September for your surgery would not hurt. Mary ",
      "MessageIndex": 1,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/771682",
      "Title": "AM I REALLY THAT STUPID?? NEED LOTS OF ADVICE! rn4babies rn4babies"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 16, 2010 05:36PM YramAL wrote: Suepen-I had the exact same thing happen to me as happened to you. The skin under my rather large breast broke down during the 5th week of my 6 1/2 weeks of treatment. My rads nurse gave me some gel pads called Carradress and they saved my life. I sort of wedged them in under my breast, over the sore area, and kept them in place with my bra. Once I was switched to my boost treatments, that area got a break and healed in about a week. I'm 7 weeks out from rads now, and the area that was broken down is still discolored, but it is totally healed. Believe me, when I was going through it, I thought it was never going to heal.  Ask for some gel burn pad dressings. They're about 3' by 3' and they were a lifesaver for me. Mary ",
      "MessageIndex": 3,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/752703",
      "Title": "Skin Breakdown - how long to heal? suzieq60 grdnslve"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 17, 2010 03:15PM YramAL wrote: I had 4 removed-no lymphedema so far. I was told that all \"lit up\" with the tracer dye used to locate the sentinel node, and that's why 4 were taken instead of 1. Mary ",
      "MessageIndex": 9,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/754259",
      "Title": "Totally confused about sentinel node biopsy results LtotheK LtotheK"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Mar 22, 2010 12:30PM YramAL wrote: Laurie- I also had a breast MRI after my diagnosis of IDC back in December. I was told ahead of time that an MRI may show up areas of concern that later turn out to be nothing because the MRI is so sensitive. I did not have any further breast issues turn up, but my MRI showed a possible mass on my kidney. Talk about scary!!! I had a followup ultrasound on my kidney and it turns out I have an accessory spleen-a totally benign condition.  My breast MRI did show my axilary nodes. They appeared to be disease free on my MRI, and in fact, they were, as shown by my pathology report following my surgery. Best of luck. Keep breathing.......I know you are going through a scary time right now, but I promise you it will get better once you know exactly what you are dealing with and can make a plan. Mary",
      "MessageIndex": 2,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/750135",
      "Title": "Breast MRI questions lauriez lauriez"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 22, 2010 10:15PM YramAL wrote: I had an Onco score of 11 and did not do chemo. I had, however, decided before I got the results that if I got a score above 18 I would do chemo.  Mary ",
      "MessageIndex": 7,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754443",
      "Title": "Got Onco Score of 19 - now what? Lindy323 don23"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Apr 17, 2012 06:42PM YramAL wrote: From one Mary to another........ ((((((Apple))))))). You are one of my favorite people on here. I hope things look a bit less dark tomorrow. Mary ",
      "MessageIndex": 15,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786011",
      "Title": "crying tonite apple banjobanjo"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 29, 2012 09:22PM YramAL wrote: Meg-I don't have any advice for you but I'm bumping this up so that someone else might respond.  I'm so sorry you and your mom are going through this. (((hugs))) Mary",
      "MessageIndex": 1,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795654",
      "Title": "Worried about my Mom meg56 exbrnxgrl"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 16, 2011 10:08PM YramAL wrote: Bumping this up so that hopefully someone will see it and be able to help.",
      "MessageIndex": 1,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/763478",
      "Title": "Growth on nipple? ebent01 Snobird"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 18, 2010 06:13PM YramAL wrote: I have not seen my surgeon since the followup visit after my surgery. I see my oncologist every 3 months, get a mammogram every 6 months, and at this point, that is enough for me. I don't have a lot of faith in external exams anyway. My general practitioner did not feel my lump, my breast surgeon could not feel my lump(even though she knew exactly where it was) and I could not feel my lump. The mammogram is what caught my cancer. Mary",
      "MessageIndex": 5,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/759540",
      "Title": "Follow up with surgeon for 5 years? Why? Halah Mantra"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 28, 2012 12:03AM YramAL wrote: Susan-if nothing else, you need to find an oncologist that you feel comfortable with. Whatever course of treatment you decide to take-and it IS your decision, made with info from your doctors-you will be seeing this person for a long time to come.   The oncologist I went to for my first opinion had much of the same dismissive attitude towards the Oncotype test. She made pretty much the same comment your doctor made about if the cancer comes back you won't survive. I didn't like that she dismissed my questions so easily.  I went to another oncologist for a 2nd opinion, and he was very open to the idea of the Oncotype test, and I'm grateful that he was, because my score came back at 11, so no chemo for me. I also like him because he is a very personable guy who lets me ask as many questions as I want to ask, and I never feel rushed or unimportant. I definitely went by my \"gut\" feeling, accompanied by good, solid medical info, of course.  Mary",
      "MessageIndex": 5,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 28, 2012 06:23PM YramAL wrote: Maryah930-I know exactly where that is. I live near the Costco, in the Echo Lake neighborhood. Small world! Best wishes for your onc appointment. I didn't have a mastectomy, so I didn't have drains, but I can guess that they are no fun.  Mary",
      "MessageIndex": 14,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 28, 2012 11:29AM YramAL wrote: Hey maryah930! I see you are a fellow Shoreliner(Shorelinan?) I think you're the first one I've seen on these boards! Mary",
      "MessageIndex": 9,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/795532",
      "Title": "Chemo??.... awaiting the oncotype DX test- any advice?? susancats frankp"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 28, 2012 09:57PM YramAL wrote: Oh my goodness-the waiting for results is hard enough without throwing Frankenstorm in there! Hang in there and stay safe! Mary",
      "MessageIndex": 1,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/795597",
      "Title": "Damn Frankenstorm . . . Mommy23boys organa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Aug 6, 2012 10:39PM YramAL wrote: Just make sure you go for your followup checkups. Can't get too confident with this cancer stuff.  I don't mean to be so bossy.   Mary ",
      "MessageIndex": 39,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791295",
      "Title": "23 Years Old And Very Scared justegan justegan"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 21, 2011 10:24PM YramAL wrote: I had my first one this past October. They removed a fairly large polyp (benign, thank goodness). That polyp and the fact that I have a history of breast cancer, gets me a call back in 2 years. If I hadn't had a polyp, it would have been 5 years. Mary ",
      "MessageIndex": 8,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/763755",
      "Title": "frequency of colonoscopies? meg970 barbe1958"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 13, 2010 03:39PM YramAL wrote: No, the insurance not paying does not hold up the testing. Don't worry, it will all work out. Mary ",
      "MessageIndex": 10,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754020",
      "Title": "Oncotype-not covered by insurance hopeful34 LisaAlissa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 13, 2010 03:43PM YramAL wrote: No, the insurance not paying does not hold up the testing. Don't worry, it will all work out. Mary ",
      "MessageIndex": 11,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754020",
      "Title": "Oncotype-not covered by insurance hopeful34 LisaAlissa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Mar 4, 2012 04:28PM YramAL wrote: I wonder if the mods could pin this one to the top of the forum? I think this is a great idea. I don't have any questions, though. Mary ",
      "MessageIndex": 11,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Aug 6, 2012 10:22PM - edited Aug 6, 2012 10:23PM by YramAL I don't mean to scare you, but you need to know that a mastectomy does not guarantee that you won't ever have breast cancer again. My sister-in-law had a double mastectomy, and had a recurrence in her mastectomy scar.  I'm not telling you not to have a mastectomy-just know it doesn't mean you never have to worry again. I wish for you pain free surgery, treatment and recovery. You are way too young to get this-but you don't need me to tell you that! I was 49, and my oncologist calls ME young! Mary ",
      "MessageIndex": 36,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/791295",
      "Title": "23 Years Old And Very Scared justegan justegan"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 27, 2011 11:06PM YramAL wrote: WeeSee- My mom always told me how painful her mammograms were, so that when I went to have my first one, I was really scared that it would hurt. It wasn't nearly as bad as I thought it would be-sure, it wasn't anything I would call fun-but it was mostly just a feeling of pressure when they squeezed my breast between the paddles. I usually take tylenol or ibuprofen before going for my mammogram. One of my breasts-the lumpectomy/rads one- is extra tender, but to me, a little pain is worth it. My cancer was caught on my annual mammogram. I was 49, and had been having mammos for 9 years. Never felt a lump, nothing. Yet there it was.   Best of luck to you. I've been following your struggles on the other thread. I sure hope you get some answers. Mary ",
      "MessageIndex": 2,
      "PostDate": "27/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/765529",
      "Title": "breasts are killing me now! How do i prepare for mammogram pain? WeeSee mrsnjband"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 15, 2010 06:27AM YramAL wrote: Glad to hear that Allison! Best of luck and wishes for a low score! Mary ",
      "MessageIndex": 17,
      "PostDate": "15/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754020",
      "Title": "Oncotype-not covered by insurance hopeful34 LisaAlissa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 13, 2010 05:24AM YramAL wrote: I'm starting radiation next at Swedish, but I will be going to the Northwest Hospital satellite location. I'll have to check out the Seattle board! I was fortunate to not have to have chemo, since I got a low Oncotype score.  Mary",
      "MessageIndex": 4,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/748264",
      "Title": "Anyone in Seattle doing, or have done, Rads at Swedish? 3monstmama YramAL"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Mar 4, 2012 04:36PM YramAL wrote: Duh. Should have checked first before posting........ Mary ",
      "MessageIndex": 13,
      "PostDate": "04/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 27, 2010 01:49AM YramAL wrote: Kim- I was told that ideal time for rads is about 6 weeks post surgery. I started my rads 10 weeks after surgery because I was waiting for the results of my Oncotype DX test to find out if I needed chemo. The test was not ordered at the time of my surgery, but a few weeks later by the onco I decided to go with. I ended up not getting chemo because of my low Onco score, but my rads were delayed for a few weeks. My onco said that in the big scheme of things, the wait is not significant, and I'm choosing to trust him and move forward. I'm also taking Tamoxifen and have been for about 12 weeks with no major side effects. I'm so sorry your rads are interfering with your family fun this summer. Hopefully your doctor will OK the wait until after your reunion but I don't think I'd go in August. Maybe your family could plan a vacation later? My husband and I went to Disneyland when I finished my rads and had a great time!  Mary ",
      "MessageIndex": 1,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/754619",
      "Title": "How long after surgery can you wait to have rads? Houndmommy YramAL"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Oct 31, 2011 08:35PM YramAL wrote: Congratulations tacichon! I've been on Tamoxifen for 18 months with some minor side effects-hot flashes, minor muscle and joint pain. I'm sure some others will come by with their stories. Mary ",
      "MessageIndex": 1,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777334",
      "Title": "Finished with Rads today!! tacichon pam53"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Mar 7, 2012 10:02PM - edited Mar 7, 2012 10:05PM by YramAL Yay, Anne for the good news! From a fellow \"Hoarders\" fan, Mary  Edited to add: You should have had him look up BCO and shown him the pictures you posted here. ",
      "MessageIndex": 95,
      "PostDate": "07/03/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783699",
      "Title": "PET Results CoolBreeze ruthbru"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 5, 2012 08:56PM YramAL wrote: I actually found out by email from the nurse navigator at the breast center, but that was because I just kept emailing her with questions like, \"Can the radiologist be fairly certain of a diagnosis based on the ultrasound?\" and \"Does the fact that the radiologist left a marker in at the site of my biopsy mean that she thinks it's probably cancer?\" and other questions I can't even remember-I was just so stressed out. She emailed me back and said something like, \"I think you already know the results of your biopsy-please give me a call...\" I work at an elementary school and can't take calls during the day unless it's an emergency, but I went right to my principal's office and told her, \"I think I have breast cancer. I need to call my nurse.\" My principal started to cry and told me,\"You'll get through this. Whatever you need, I'm 100% behind you.\" I called the nurse navigator, and sure enough, she told me I had IDC. I think I had already mentally prepared myself for the news, so it wasn't really all that shocking to me. Wow-this post brought back a lot of memories. In a post-traumatic stress kind of way. I don't think I've thought about that day for quite some time. Mary ",
      "MessageIndex": 36,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/780533",
      "Title": "How did you hear biopsy results--phone or appt? frazzledmom schoolmom"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 5, 2010 12:03AM YramAL wrote: I'm not an attorney but the part about not even taking Tamoxifen bothers me. I have several friends with varying stages and types of ER+/PR+ breast cancer, and every single one of them has or is taking Tamoxifen, even the one that had DCIS that was treated with a mastectomy. I don't think you're sue-happy. Mary ",
      "MessageIndex": 4,
      "PostDate": "05/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/753654",
      "Title": "Attorney in the house? lisa34lisa lisa34lisa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 28, 2011 09:22PM YramAL wrote: Ash- I second Irr4993 in saying waiting for the results of the biopsy was worse than the biopsy itself, and when I found out I had cancer, it was almost a relief-very strange, but true. I think when I knew what I had, I could start planning what to do next. I drove myself to and from my biopsy, which was pretty much as everyone else has described. I only told my husband and one of my friends that I was having the biopsy because I didn't want everyone else to worry too much. Unfortunately, I turned out to have cancer. But you know what? I'm OK.  The odds are in your favor that your lump will be benign-I hope that's so.   Mary ",
      "MessageIndex": 12,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764094",
      "Title": "new member and very stressed ashisonfire ashisonfire"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jun 13, 2010 05:53AM YramAL wrote: I had the Oncotype test back in January of this year. When my doctor submitted the test, Genomic Health called me and let me know that if my insurance denied my claim, they would appeal it up to 3 times on my behalf. If that failed, they would see if I qualified for their financial assistance program(the income limits were quite high, IMO, as I recall), and if all else failed they would take payments on a schedule that I could afford. All this was moot in the long run since my insurance covered the test. Covering the test actually saved my insurance company boat loads of money in the long run because I probably would have had chemo, almost solely based on the fact that my tumor was 1.5 cm. I received a low Oncotype score of 11, so decided not to do chemo. I understand that chemo runs thousands and thousands of dollars.  It's too bad you can't call Genomic Health today(Saturday) because I really do think they will ease your mind quite a bit.  Mary ",
      "MessageIndex": 7,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/754020",
      "Title": "Oncotype-not covered by insurance hopeful34 LisaAlissa"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jul 31, 2011 09:46PM YramAL wrote: I wore my underwire bras all the way through treatment. I don't know how large your breasts are, but I'm a DD and I needed the underwire to lift and separate the girls so that I did not have skin on skin contact.  Mary ",
      "MessageIndex": 2,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/772409",
      "Title": "Bras during radiation pat01 teriholmes"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 12, 2011 09:24PM YramAL wrote: Stage 1, Grade 2, Tumor size 1.5 cm, no lymph node involvement, Oncotype score of 11. No chemo for me. Mary ",
      "MessageIndex": 77,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/762764",
      "Title": "If you were stage I, did you get chemo??? mdg SusansGarden"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Apr 16, 2010 01:33AM YramAL wrote: Yes, that is true. You can only have radiation treatment to the same breast one time. But if you do have the radiation treatment, the chances are better that the cancer would not come back to that breast than if you had not. Why wait for it to come back? Mary",
      "MessageIndex": 1,
      "PostDate": "16/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/751330",
      "Title": "Radiation Treatment Debwa100 kittycat"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Feb 7, 2011 06:14PM YramAL wrote: Ash-Just checking in on you and wondering how your biopsy went on Friday.... Mary ",
      "MessageIndex": 17,
      "PostDate": "07/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/764094",
      "Title": "new member and very stressed ashisonfire ashisonfire"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "May 8, 2013 12:12PM YramAL wrote: momofgirls-I too, live in the Seattle area. I have no experience with the Overlake Breast Cancer Center.  For a second oncology opinion, I recommend Dr. Doug Lee. He's associated with Puget Sound Cancer Center, located at NW hospital.  Mary",
      "MessageIndex": 1,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/804395",
      "Title": "Just Diagnosed - Overlake Breast Cancer Center - Docs & opinions momofgirls Denise-G"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Aug 8, 2010 11:52PM YramAL wrote: kane- I second what MHP70 says-I have had high ocular pressure for years. I have to have a visual fields test and pictures taken of my optic nerve every year just to be safe, but I have not been diagnosed with glaucoma. My opthamlogist says that some people just run high.",
      "MessageIndex": 2,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/756507",
      "Title": "Lymphedema and Glaucoma kane744 LtotheK"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Dec 4, 2012 10:55AM YramAL wrote: My sister in law, who has implants following a double mastectomy, found several small round lumps near her scar line. She had a biopsy and they turned out to be benign. So yes, it does happen, and yes, you can have a biopsy with implants. Mary",
      "MessageIndex": 7,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/797195",
      "Title": "I found a lump Pure Pure"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Nov 26, 2011 12:57AM - edited Nov 26, 2011 01:07AM by YramAL Philosophy makes a body wash called \"Pure Grace\" I was given a sample at the rads center when I was in treatment. I really liked it. Also, good old Ivory soap, or sometimes, when I was really raw, I used no soap in the area at all-just rinsed with warm water. Mary ",
      "MessageIndex": 3,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/778641",
      "Title": "Fragrance free soap PKathleen FireKracker"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Aug 13, 2011 09:51PM YramAL wrote: Ann-I don't have any advice for you. I'm just sorry you're feeling so bad. I hope you get some answers and start to feel better. I can only imagine how scared and sick you must be feeling. Hugs, Mary ",
      "MessageIndex": 1,
      "PostDate": "13/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/773118",
      "Title": "Leukine put me down for 24 hours CoolBreeze jenn3"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Apr 8, 2010 04:58PM YramAL wrote: I would get a second opinion. Your tumor was large, you are young, your grade was 3, and 17 is almost borderline(18). If I was you I would definitely get a 2nd opinion, and I would probably choose chemo. That's just me. Mary",
      "MessageIndex": 4,
      "PostDate": "08/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/751000",
      "Title": "StageIIA, Oncotype 17- NO CHEMO, Are you Agree? yunlee72 ColoGal"
    },
    {
      "AuthorID": "YramAL",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/96801/profile",
      "Content": "Jan 4, 2012 11:00AM YramAL wrote: I'm glad you were able to switch oncs, but I'm sure I'm not the only person here who is a little taken aback by your term \"asian doctor\"......unless of course, you are in Asia. Best wishes to both of you.",
      "MessageIndex": 4,
      "PostDate": "04/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780434",
      "Title": "How do you change oncologists this AM? Chemo starts in 3 hours lovehertons lovehertons"
    }
  ]
}