{
  "AuthorID": "yuyueno",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
  "Posts": [
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 14, 2008 04:59PM yuyueno wrote: Hi, Genia. It is great to hear that you have a doctor that seems to care and know what he is doing.  How are you doing?  I was just diagnosed also.  I am not sure what kind or what stage, etc.  There are so many unknown at this time.  I am going to see my surgeon this afternoon, I only met him once but he is the one who informed me that I have BC.  I am hoping that he will be the type of doctor who is encouraging and caring.  Hugs and Prayers Yuyu",
      "MessageIndex": 1,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/719528",
      "Title": "What a day.... Genia Shirlann"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "yuyueno wrote: I posted this on IBC forum also, but I greatly appreciate if anyone can give me any feedbacks.  About two months ago, I found a large mass/lump on my right breast. It appeared out of nowhere, and it was pretty large (about 4-5cm on right side of my right breast).  My breast was swelled, warm to touch, and nipple was itching. So, I went to OBGYN and was sent to do mamogram and ultrasound while waiting for an appointment with a surgeon a few weeks later.  First momogram was inconclusive, so they sent me to do another one and ultrasound.  My OBGYN also gave me an antibiotics to see if swelling and pain will go away. A few weeks l later, I saw a surgeon.  At this time, my breast was still painful, warm, and itching.  The lump was still there and large.  The surgeon told me that my mass/lump seems to be just an infection/mastitius since there was no abnormality found in mamograms and ultrasound.  He gave me antibotics and said my breast will always be \"lumpy\" anyway so not to worry if the lump does not go away.  But, he told me that small calcifications were found in other area completely separate from the lump in my right breast.  He said he will send me to do biopsy for these small calcifications, but saiid it is less likely that they are cancerous since I am young (34).  That was about three weeks ago.  My breast is still swelled and large, and antibiotics helped very little or nothing.  My right breast is clearly bigger and plumpier than the left.  So, I just completed my biopsy (done by a different doctor from my surgeon) today. From what the radiologist told me, it seems that they just took tissues from these small calcifications found in my right breast, not my large lump.  I guess here is my question: Would my doctor be that ignorant not to biopsy my large lump I originally went in for?  From what I read on the internet, it is a possiblity I may have IBC.  I wish I knew about IBC sooner so that I could insisit on biopsy on my lump.... Dx 8/12/2008, IBC, 5cm, Stage IIIB, Grade 2, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719234",
      "Title": "Large Lump and Scared yuyueno TheQu33n"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 12, 2008 04:47PM yuyueno wrote: Doctor called me today to give me a bad news.  I have breast cancer.  He does not know how far or bad it is, but said it may be IBC due to fast growing tumor/mass in my right breast.  He told me I at least need Lumpectomy (sp?) to even know what stage it is.  I don't know what to do.  I just started new job, no sick time, no medical insurance just COBRA.  I am 34 and no family hx of cancer.  I'm devastated.",
      "MessageIndex": 8,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719234",
      "Title": "Large Lump and Scared yuyueno TheQu33n"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 10, 2008 08:46PM yuyueno wrote: Thank you everyone for feedbacks and support.  I am waitiing for the biopsy results over the weekend, and Gosh, the waiting part is so hard!  I am trying not to worry about it since it is the weekend and I can't do much, but I often get panicky thinking the worst case scenario.  I am such an emotional wreck this weekend.  My lump is inflammed (I think) after the biopsy and my right breast is more swallen and painful  now. Now, my right armpit is swelling and hurting, too.  I went to an urgent care yesterday and they gave me antibiotics which does not seem to be helping much.  I think I agree with what others have said, I plan to ask for a referral (Sadly I have HMO and need referrals for every little things) to Breast Sepcialist even the biopsy results may come back benign.  I do not like having a big lump in my breast (who does?)!  I felt completely dismissed when the surgeon told me not to worry about the lump since I will always have lumpy breasts! ",
      "MessageIndex": 7,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719234",
      "Title": "Large Lump and Scared yuyueno TheQu33n"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 14, 2008 08:23AM yuyueno wrote: Hi, Thank you for your support.  I am still in shock, I hear what my doctor said, \"you have breast cancer\", over and over in my head.  I go see him this afternoon, he said he will talk more in details about my treatment options. I find myself feeling very depressed.  I knowI shouldn't go there, but I wonder if my life will be cut short soon.  I wonder if I am able to have a family of my own, children, etc.  I get scared and lonely.  I don't have any family in this country.  My parents and family are all in another country (9hrs flight away!), and I am not sure if or when I should tell my parents.  I do not want to break their hearts.  I am lucky since I do have a few friends + ex-husband that are very suportive of me and are willing to help me in anyway they can.  I also have a new boyfriend of three months who has told me he will be committed to fight all the way with me.  I am trying to see ansd think of the positives.  But, I still feel depressed and scared.  Maybe I need to find a support group in the area.  I'm sorry for rambling, but I appreciate all your support.  I feel like this is the place I don't feel so alone since many of you have went through similar experiences.   What is Lampectomy like? Overnight stay?  Will my breast look normal after? If Masectomy is done, do most of the poeple have reconstruction surgery to make breasts look normal? ",
      "MessageIndex": 12,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719234",
      "Title": "Large Lump and Scared yuyueno TheQu33n"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 13, 2008 01:19AM yuyueno wrote: Renny85, I got my results from doctor today, and I have a breast cancer.  He said it is IDC.  Please do not assume that's what your sister has, every case is different.  I am also concerned about insurance as I am on Cobra and will be paying $300+ mo.  I pray for your sister.",
      "MessageIndex": 6,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719335",
      "Title": "Clueless and worried!!! Please help me.. renny85 renny85"
    },
    {
      "AuthorID": "yuyueno",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/70564/profile",
      "Content": "Aug 10, 2008 11:36PM yuyueno wrote: Hi, Renny.  Your sister's case sounds just like mine.  I have a large hard lump/mass in my right breast and it did not show in mamograms or ultrasound.   The doctor diagnosed me with Mastitus and gave me antibiotics, but the lump is still there after a couple of weeks of antibiotic treatment.  I was also told my the doctor that my had area/lump is not fluid but tissues.  I just completed biopsy last week and am waiting for results. After the biopsy, my right breast is swelling and the lump /hard area feels firmer and bigger from inflammation.  My armpit has been also hurting after the biopsy. Please let us know the update as to how your sister is doing, as I will do the same.  It's great that you are on top of everything for your sister and I wish I was able to go to a place like UCLA breast center. ",
      "MessageIndex": 4,
      "PostDate": "10/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/719335",
      "Title": "Clueless and worried!!! Please help me.. renny85 renny85"
    }
  ]
}