{
  "AuthorID": "Yvette10052…",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
  "Posts": [
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jan 5, 2013 07:00PM Yvette10052011 wrote: hi ladies & happy new year to all! so good see familiar names & new ones too :) it's been several months since i posted but recently started logging in again. between my exchange surgery in September, the holidays, a 2nd break-up [why i ever took him back i will not know!!] & work drama - i suffered a lot anxiety & depression. feeling better now & so happy to have 2012 in the rear view mirror... love seeing all the pics of the beautiful hair growth we all have desired from the minute we lost it due to f'ing chemo!! juneaubugg - i relate to your fustration so well!! my last chemo was march 22, 2012 & you're hair is growth is about at the same stage i was at 12wks. mine is now a little less than 1/2\" past the bottom of my earlobes. it's MUCH thicker [it was thick before] than pre-chemo & there seems to much more of it so that is a relief!! some parts are shorter near the crown but for the most part i can say i'm finally sporting a Bob style & way past a Pixie. can't wait until it's chin length so i look more like ME again. take care all & happy weekend!!",
      "MessageIndex": 18418,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Apr 9, 2012 06:48PM Yvette10052011 wrote: i gradually started losing my eyelashes about one week before my 4th/last Taxol (3/22) & most are gone now. the eyebrows started falling out after my last chem & i now look ridiculous if i don't fill them in. i attempted to use MAC false lashes yesterday but what a disaster, lol!! a bit too much glue & the lashes didn't seem long enough. i couldn't get them in the proper spot close the lash line either. i decided that during the week while i'm at work i'll only wear eyeliner + shadow & give my lashes a break :)  i'm going to start using use Latisse for lash (& brow) growth next week - i need to get an rx for it.",
      "MessageIndex": 14838,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 03:02PM Yvette10052011 wrote: thank you Momine & DivineM!! o how i'd love to be wearing this dark version of Mia farrow in Provence or NY... that would be splendid!!! however, it's the SF Bay Area in CA for the time period :) i will say, i wore it to the office last week for the first time & everyone was really supportive :) several thought i cut my hair after my recent *holiday* (aka part 2 of of my bilateral mastectomy -> some holiday!!) & were in shock when i explained it's regrowth from going through chemo. i worked during that time & i thought i looked like Hell (thank G for great cosmetics!!) but must have fooled a few. we are truly most critical of ourselves...",
      "MessageIndex": 15776,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 03:14PM Yvette10052011 wrote: whatashocker, Kellogs & myleftboob - thank you so much!! i should have posted a pic sooner, all your + comments have brought a smile to my face :) i'm so happy to have hair again but wish i had some longer pieces in the front. feels like it's been forever & there are days when i wake & hope to see instant growth, lol!! patience Yvette, patience... my last chemo was March 22. 4 dd of A/C followed by 4 dd of Taxol. i had it dyed just before going in for surgery on May 15 but very due again for another dip of color for my roots. again, thank you for all the positive feedback!! no one understands this like we do...  ",
      "MessageIndex": 15777,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 04:01PM Yvette10052011 wrote: Kelloggs - i've had my hair dyed professionally for ~10years. i started going gray in my late 20's so once the semi-perm color wouldn't take any more, i decided a professional needed to take on the job :) i will say it was rather shocking to see i'm 90% gray at the ripe age of 44. i felt like such an old man but as soon as the color went on it was MUCH better. i had a baseball hat on later that day & my BF said i looked like a boyscout. the look i must have flashed him because then he tried to say the color made me look so young again... i changed topics at that point, lol!! & that's great about only having the hot flashes!! i've had those too from chemopause + a laundry list of lovely SE's that chemo left behind. i'm still on the fence about Tamoxifen but good to know not everyone is having a hard time with it :) that gives me hope!!",
      "MessageIndex": 15786,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Apr 11, 2012 01:23PM Yvette10052011 wrote: borntosurvive, thanks for asking about the prickly scalp feeling as the stubble grows in.  i too have felt it (very similar to when i lost my hair) & was scared i might start losing what little i have :) good to know those ahead of us felt it too as their hair grew in -> PHEW!! FABULOUS hairs pics too ladies!! thank you so much for posting as it's very encouraging & helps so much in what to expect. i'm 3 weeks PFC tomorrow with 1/4 growth (white/silver & black in color). for olive oil, i'm massaging it on my scalp nightly & letting it soak in. i've only been using it for 3 nights so no results but i'll try just about anything at this point!! i ordered Biotin pills, shampoo & BioSil pills from Amazon a few days ago... eagerly awaiting arrival!!  ",
      "MessageIndex": 14879,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Apr 28, 2012 01:51PM Yvette10052011 wrote:",
      "MessageIndex": 15079,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "May 3, 2012 05:33PM Yvette10052011 wrote: i'm six weeks PFC & saw my dermatologist today. she asked why i don't dye my hair & ditch the Halo/hat combo. i didn't think i had enough hair but she said it was thick and growing fast. driving back to work, i made an appointment with my colorist for next wednesday. showed a few ladies in the office, they all agree -> it's time!! hopefully my lashes will be back soon... i'm nervous & excited but so over wearing a wig!! MamaV - how EXCITING!! congrats on the new bangs :)",
      "MessageIndex": 15137,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 19, 2012 02:58PM Yvette10052011 wrote: i've been offline for a week but catching up today :) lots of reading. AEM - you really look amazing!! you're eyes just shine & you do indeed have lots of coverage for 8 weeks. you certainly nailed it with the description of feeling: unrestricted!! o what a feeling :D",
      "MessageIndex": 15997,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Apr 9, 2012 04:03PM Yvette10052011 wrote: i'm new to this forum & find it super encouraging to see pics of new hair after chemo!! i had 4 DD's of AC & then 4 DD's of Taxol - my last was March 22. i noticed regrowth (peach fuzz) March 18 & now have just about a 1/4\" (oh yes, i measured it) of many white & some dark brown super soft hairs. i've only worn my full wig once because i feel so strange in it. my friends tell me it looks good but i think it just screams: look at me, i have cancer & lost my hair!! i DO wear a Halo with a cute cap but i must say that now i'm into month 4, i'm really getting tired of the same look every day (i have multiple caps & two Halos). when it comes down to it, all i want is for my hair to grow so i can *topless*. i'm now massaging olive oil on my scalp each night, ordered Biotin pills, Avalon Organics Biotin shampoo & hope to start Latisse next week.",
      "MessageIndex": 14834,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Apr 13, 2012 01:00PM Yvette10052011 wrote: i have an eyelash update... i'm seeing my PS medical assistant on Monday for Latisse. i understand it could change/darken my eye color but my eyes are very dark brown so not a big deal + i understand a large amount has to actually get into my eye for this to happen. anyway, i bought two set of MAC eyelashes from Nordstrom a few weeks ago. i wasn't able to wear the lashes because their too difficult to apply + i heard the glue is bad for new lashes growing in. i brought them back to Nordstrom yesterday and the sales girl would not take them back (i had the receipt). i explained that i asked if i could return them when i bought them & was told: yes. she then said: well, not if they've been worn!! i then said i tried to apply one & it didn't work. the other set has never been worn. she held it up the package & examined it. i repeated that i was surprised by this & that the second set has not been worn. she sighed & said: well, i'll return one set this time only but not the one that's been worn. i looked at her & said: i only bought then because my lashes fell out during chemo. i have breast cancer & using the lashes with glue could impair regrowth. she looked at me with a blank stare & said: would you like the credit back on your Master Card? UGH!!! so much for the We Take Anything Back Reurn Policy at Nordstrom...",
      "MessageIndex": 14926,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 03:38PM Yvette10052011 wrote: truth be told, i only put the glasses on because when i'm nervous i have major *crazy eyes* look in pics!! lol :) i say you get the gumption up (or a pair of sunglasses) & snap away i've heard Heceptin can slow growth too. i'm not on it - trying to determine if i'll take Tamoxifen or not. i'm an ER+1 but all else negative so basically it won't offer me too much except a long list of SE's which i had them ALL during A/C & Taxol. and yes, i'm smiling now  thanks again!!",
      "MessageIndex": 15781,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 03:50PM Yvette10052011 wrote: whatashocker - AM I EVER!! i've had fast growing hair most of my life so i know it's helped. however, my hair did thin a few years ago due to underactive thyroid - it took a long time get thick again. with chemo taking all my hair i was not taking any chances & after hours & hours of research i bought: Natures Bounty High Potency Biotin 1000mg - i take 3 tablets a day BioSil Hair Skin Nails vegetarian caps - i take two capsules daily Avalon Organics Thickening Shampoo Biotin B Complex Avalon Organics Thickening Conditioner Biotin B Complex drink tons of distilled water daily to flush any left over Taxol from my system. also, up until a week ago i massaged extra virgin olive onto my hair/scalp nightly. i read it too can promote growth but i think it the massaging that stimulates the follicles hope this info helps :) i orderedeverythingfrom Amazon & found the BioSil to be most pricey but at this point i'm willing to spend to see growth!!",
      "MessageIndex": 15783,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 12, 2012 10:28AM Yvette10052011 wrote: love the ultra blonde Mags - beautiful!!",
      "MessageIndex": 15805,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 12, 2012 11:41AM Yvette10052011 wrote: Seagrover - i have fine facial hair (from cheeks to jawline) too!! i never had this before & didn't notice until my BF pointed it out. i had it waxed ~4 weeks ago & plan to have it waxed again. i've read that it can either fall out on it's own (i didn't have the patience for that) or if it's removed it comes back only one or two times. Farida (my waxer) told me many women who've had chemo come in to have it removed & they only need one or two waxing treatments.",
      "MessageIndex": 15808,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 9, 2012 05:05PM Yvette10052011 wrote: hi ladies!! i was just catching up on the last several pages here because i was out of commission. i had my second mastectomy on May 15 & just finished my first week back at work. long story but i went into cardiac arrest during surgery in Nov '11 so they could only take my nodes, one breast & insert the expander. had to wait until after chemo to finish what they started. so excited to see Divine's hair time line!! gorgeous :) & very encouraging for all of us!! for all who are asking about losing eyebrows & lashes -> get Latisse - it's like steroids for eyebrows & eyelashes!! if i had known it's preventative loss factor, i would have started using it during chemo!! don't worry about it changing your eye color - that can only happen IF you apply large amounts directly into your eyes over a long period of time. i lost all my lashes & most of my brows by the second week of completing chemo (i had 4 DD of AC & 4 DD of Taxol). i started using it in april & within 4 weeks had ALL my lashes & brows back!! i only use Latisse one a week on the brows (they were growing TOO MUCH, yes TOO MUCH) BUT continue to use nightly on my lases. a girl can never have too many lashes. i know lashes and brows can fall out as many as 3 more times so i'm going to keep up this regimen. went back to work *topless* for the first time on Monday & was SUPER nervous!! i really felt like i still had the chemo head/look but my friends told me it was time & that i look like i have a short pixie cut. for me, i look a bit boyish & miss my thick shoulder length hair. i definitely have hair envy - even of kids :) my office can be a tough crowd & i was convinced i'd get many stares...  to my GREAT surprise i received tons of happy faces, compliments & the best of all --> i love your new haircut!!  i laugh at that because this is not a choice nor a cut - it's all the hair i have so i guess it must look OK :) my growth started VERY slow during Taxol but it's going fast now. i'm 11 weeks PFC but it looks ~15 to ~18 weeks PFC from the pics i've compared mine to on this forum.hoping this rate of growth continues!! i'll try to take a pic & post tomorrow!! happy weekend to all :)",
      "MessageIndex": 15719,
      "PostDate": "09/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 02:10PM Yvette10052011 wrote: Elizabeth & Momine looking great!! Momine, i saw your previous pic a few months ago & thought: she looks amazing!! when i get *there* it's off with the Halo!! last week was my first time out & about with good feedback :) yesterday i met some ladies for brunch (some knew i had BC & others didn't) with my new pixie hair. i felt so uncomfortable in my own skin... ironically, i finally reached an age last year (44) where i very confident & BAM!! BC hit me like a two ton truck & smashed my self-confidence. i've NEVER had short hair so as much as every tells me it looks great, i still feel so unfeminine & boyish. due for color (TONS of gray peeking through but i use a washable coverage that is applied like mascara). all i can say is: GROW HAIR GROW!! here's what a few days shy of 12 weeks PFC looks like on me:       ",
      "MessageIndex": 15768,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 02:37PM Yvette10052011 wrote: whatashocker, i lost mine too but got Latisse from my plastic surgeons office - it's not over the counter. i didn't need a prescription but i had to sign a waiver. i paid $132 for one 3ml kit (solution + applicators) & they gave me a second kit for free. i started the using it on April 16 & just finished the first bottle last night.tip: it comes with multiple applicator brushes. you can use one brush for both eyes rather than one brush each eye. this will save on running out of applicator brushes :) also, many are nervous to use it becasue it can darken or change your eyecolor to brown. this is true BUT only if it's apllied directly into the eye (which you won't do) at great amounts. once i started using it nightly on my brows (the area where they one were!!) & lash line they grew back fast!! so fast that i only use it on the brows once a week now :) good luck!!",
      "MessageIndex": 15770,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 04:10PM Yvette10052011 wrote: Gemmie - check with your onc but i would start as soon you start chemo. it may not keep your lashes from falling (they fall regardless just not in big amounts, thanks chemo!!) but it will promote new growith & thickness. if i had known, i would have started sooner :) and yes, hurray for big sunglasses!! i couldn't wear mine until recently (they would get caught in my Halo) so i'm loving them more than EVER!!  i'll keep an eye out for the young hunks too - that would be a bonus",
      "MessageIndex": 15788,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 11, 2012 04:31PM Yvette10052011 wrote: the BioSil Hair Skin Nails vegi capsules are online (a little pricey) but i found Amazon to have best price + free shipping.",
      "MessageIndex": 15791,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 12, 2012 04:58PM Yvette10052011 wrote: Sandy - i'm curious, how long ago did you use the CVS version of Nair? i may try that instead of another wax session :) Thanks!!",
      "MessageIndex": 15827,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jun 12, 2012 06:05PM Yvette10052011 wrote: whatashocker, please try not to feel too bad (i KNOW how hard that is!!)... i had an appointment with my colorist ~5 weeks ago & she  told me i didn't have enough hair :( i was devastated & cried all night!! it was 5 days before going back to complete my double mastectomy & i was determined to not be in the hospital looking like an old man!! my niece was visiting (she's a professional) & dyed it for me. i felt better but i still looked like chemo head :) in fact, i just measured it & it's only 1inch long & it does have areas that are thinner than others. i use a touch-up colored stick to fill it in. big hugs!!",
      "MessageIndex": 15831,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jul 17, 2012 01:21PM Yvette10052011 wrote: hi ladies!! haven't posted for a bit (work has been crazy, trying to keep up on home stuff & dealing with painful Taxol side effects) but wanted to drop in :) so much action here & loving ALL the pictures!! EACH & EVERYONE of you looks AMAZING!! just a few random comments about various posts i've read... 1 - do not fear if the top is not filling in - in my experience it fills in very slow. mine looks less full when it's wet & i'm 16wks PFC 2 - nails - i lost 4 fingernails after they lifted & one toenail. i thought it would take 6 months or more to look normal but it only took 3 months. i take Biotin, BioSil & drinks tons of water so that may have helped 3 - hair dye... i dyed my hair ASAP. my ONC said it was safe and i was tired of looking like an old man. i say go for it if your ONC is OK (most are) 4 - i ran (on the treadmill) for the first time Sunday since last October. it was FANTASTIC!! i was really nervous because i still have expanders in but to my delight it didn't hurt a bit. i felt MUCH better after too :) happy day to all!!!   ",
      "MessageIndex": 16615,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "Yvette10052…",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/147344/profile",
      "Content": "Jul 17, 2012 11:07PM Yvette10052011 wrote: hi Momine - nails falling off isn't permanent (but very unsightly). i lost both thumb nails, pointer fingers & a baby toe nail!! i heard it takes a year to grow back new nails but not the case for me. it's been four months and all nails are back. some had little small nails starting to grow at the time when the original nails fell off others didn't. i really believe it's all the water, Biotin & Biosil i was taking that helped them grow back so fast :) Dianesfight - i rubbed olive oil on my head & where my brows WERE after chemo & it think it helped. i know massage can encourage hair growth so perhaps that did the trick, not sure but my hair came back fast & soft too :) ",
      "MessageIndex": 16631,
      "PostDate": "17/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}