{
  "AuthorID": "Zaborowski",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224324/profile",
  "Posts": [
    {
      "AuthorID": "Zaborowski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224324/profile",
      "Content": "Nov 14, 2015 01:56PM Zaborowski wrote: HI All, I am 56 and was diagnosed with Stage 1 IDC Breast Cancer last month. I have been to all of the doctors , had all of the tests and now it is time to make a decision and I am at a loss on what to do?? I sure could use some advise/information to help me make my decision. I have a chose between a lumpectomy/sentinel node biopsy or a double Mastectomy and yesterday I saw the final two doctors which was a Radiation Oncologist and Plastic Surgeon. Deep down inside I have always felt that I would get this news one day and it is because I watched my mother at age 50 get diagnosed with breast cancer and then 2 years later it spread to her lungs and she had a lung removed and then in 11/96 she was told she was cancer free and died in 02/97 full of cancer!!. That was 3 months!!!. My Great Grandmother also had Breast Cancer. I watched my mother take her last breath and I cannot express to you my feelings, I was very close to her , I numbed my pain with Drugs for about 10 years during which time i was raising two kids and had a husband. Just only recently I feel that I can finally move on and then this !! I would not even get a mammogram for about 10 years after she died because I was so afraid of getting it. I am so so afraid of getting it again if I have a Lumpectomy and the IORT Radiation at time of surgery. When the doctor was discussing my options she felt I would be a great candidate for this but yesterday I was informed that it is still in a Clinical Trial Stage and I would have to join the trial if I want to proceed with this? I also had Genetic Testing done and was Negative for BRAC 1 and 2 and waiting on the other 13 panels to come back. I truly believe in my heart that my cancer is hereditary and our family is one of many unknown hereditary genes. My older sister is driving me completely crazy , she is like a dog with a bone and is telling me that they are not telling me everything I need to know about my survior rate and wants me to get a mastecomy. This is also making it harder for me as she is texting me day and night since I finally told her i was not going keep taking her calls because all we do is get in an argument and the last time I spoke with her which was yesterday I told her that whatever my decision is she MUST SUPPORT IT AND THAT IS THAT!! I know my sister and she will never support my decision if it is not for a mastecomy. If there is someone out there that has gone thru this , seen someone else and can enlighten me with their opinions and facts please please reply back  Debbie",
      "MessageIndex": 23,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836597",
      "Title": "Newly diagnosed and feeling out of control demarie Moderators"
    },
    {
      "AuthorID": "Zaborowski",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/224324/profile",
      "Content": "Nov 14, 2015 02:08PM Zaborowski wrote: Hi Demarie, I can totally relate to what you are going thru!!. You are going to have Options and decisions to make and it is scary!!. I would for sure get a 2nd opinion from another doctor because you cannot be to careful with making decisions that are life and death decisions. I have been to two surgerons, I went with my 2nd opinion doctor because she is a woman and I can relate to her better, I have had a breast and lymphnode biopsy, genetic testing, an MRI, an Ultrasound, I have seen a Radiation Oncologist and a Plastic Surgeron all of these since I was diagnosed on 10/07/15. Everything seems to go so fast and that makes me nervous. do you have a family history?? because that is also a deciding factor for you to think about. I told the doctor I would make my decision by Monday and I still do not know what I am going to do. The two options are so different, one is totally invasive, will have probably three surgeries including reconstructive surgery and recovery will take much longer. but after that I no more mammograms and not as much worry for reoccurance. The other one is an out patient surgery with a clinial trial radiation therapy , which involves several visits to the research team and continue with mammograms and I will ALWAYS have fear !!!  Debbie ",
      "MessageIndex": 24,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/836597",
      "Title": "Newly diagnosed and feeling out of control demarie Moderators"
    }
  ]
}