{
  "AuthorID": "Zenful",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184423/profile",
  "Posts": [{
    "AuthorID": "Zenful",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/184423/profile",
    "Content": "Jan 6, 2014 05:01PM - edited Jan 6, 2014 05:06PM by Zenful I was diagnosed with triple negative last February.  I could have lumpectomy with radiation or mastectomy with no radiation as long as my LNs were clear.  I chose to have a bilateral mx and knew from the start that was my choice.  I had a sentinel node biopsy to see if I needed radiation.  They were negative, so no radiation.  In September, I had a bilateral skin sparing, nipple sparing mx with immediate DIEP and GAP flap surgery in NOLA.  I would absolutely do it again.  I didn't have to sacrifice my muscles and didn't want implants.  Psychologically, I don't feel as if I had a mastectomy at all.  I woke up and looked down at two breasts with cleavage that looked very much like my original breasts.  It's a big surgery, but honestly not much pain.  It is uncomfortable but not painful.  I didn't have any narcotics during or after the surgery.  At first they felt very heavy, but after several weeks they soften, and now they feel as soft and warm as my original breasts, and they bounce!  They look very good in clothes, and I am going back next month for a revision to lift and reduce a bit, so I imagine they will look better naked when I'm done.  Absolutely the right choice for me. I probably should have indicated that my decision for double mx was based on the fact that my breasts were very dense.  After I found the lump (6 months after mammo), they could not see the lump on repeat mammo nor ultrasound.  It did show on MRI, but It didn't  make sense to keep them if lumps were that difficult to see and I would have to go one year between MRIs.",
    "MessageIndex": 6,
    "PostDate": "06/01/2014",
    "ThreadURL": "https://community.breastcancer.org/forum/91/topics/816529",
    "Title": "2014 Making the Decision on Type of Surgery Tettel bdavis"
  }]
}