{
  "AuthorID": "zenith4289",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
  "Posts": [
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "zenith4289 wrote: Anyone having blurred vision? I had catarat surgery after chemo & 2 mths later right eye started going blurry. Any solutions?? ILC in both breasts. Stage 2a for both. Arimidex for 5 years. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780062",
      "Title": "eye problems after chemo zenith4289 mumito"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 27, 2011 06:01PM zenith4289 wrote: mary 624 - i had teariness and blurry vision while on chemo A/c and taxotere.  my last tx was 12/23/10 and i had vision problems after.  opthamologist said chem made cataracts grow so i had cataract surgery.  all was well from april - july then in july i started to have blurry vision in the right eye. ",
      "MessageIndex": 5,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780062",
      "Title": "eye problems after chemo zenith4289 mumito"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 6, 2010 05:08PM zenith4289 wrote: Does anyone know how long to expect a BMX with no recon and SNB surgery to last?  I plan to call my bs ofc tomorrow but thought i'd get a rough idea from you folks.  i usualy post on july as my date is july 8.  thanks.",
      "MessageIndex": 588,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/752670",
      "Title": "June 2010 Mastectomy jsmiley60 reneemac"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 27, 2011 05:58PM zenith4289 wrote: thanks everyone for your input.  I have had a lot of tests and changed opthamologists.  both think it is dry eyes and chemo related.  a second surgery was mentioned and i know there is a laser surgery for a secondary cataract that sometimes occurs after cataract surgery.  someone on another thread said their dr told them the muscle behind the eye was weakened with chemo.  my right eye will be fine for 6-7 days then goes blurry for 3-4 days.  i also have ingrown eyelashes since chemo.  they hurt and i have had them removed upteen times and they keep growing back in the wrong way.  I am using GenTEal eye gel for severe dryness but that doesn't seem to help with the blurriness.  i have tried going off all my meds - one at at time for a week and off arimidex for 2 weeks but the blurriness continues.  all the tests are negative for tumors, strokes, etc so i know it's nothing big.  just wish i could get the problem solved.....",
      "MessageIndex": 4,
      "PostDate": "27/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/780062",
      "Title": "eye problems after chemo zenith4289 mumito"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 26, 2010 09:06AM zenith4289 wrote: seems like when i break down crying its when i think of all the bad things i have been through he past few months or worries about metastases or recurrence.  when that happens i try to think of myself as a horse with blinders on and i can only see the path in front, that is the next treatment or test.  I also keep telling myself that I will have a granddaughter and take her shopping at the mall and especially to victoria's secret when she is old enough! ",
      "MessageIndex": 923,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 31, 2010 06:49AM zenith4289 wrote: LIZZYMACK1 - my Third AC tx is scheduled for Sept. 9th and the 4th and final will be on Sept. 23.  Thereafter i'll have weekly Taxol for 12 weeks but not sure if i'll start the week of Sept. 26 or the next week.  Does anyone know?  i'll ask the NP this friday.  Also I still have some pain and soreness on the port side especially if i move my arm a certain way.  Is this normal?  since i had bmx and nodes removed on both sides I have no \"good\" arm so I am glad I have the port. ",
      "MessageIndex": 1102,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 9, 2010 09:00AM zenith4289 wrote: LADYINBABA - I had the shot almost 2 weeks ago and today after shopping my hips and upper legs really hurt.  I haven't had that pain before so I'm chalking it up to neulasta.",
      "MessageIndex": 1430,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 26, 2010 07:09AM zenith4289 wrote: DebJ - Your story is so very heartbreaking.  It was 15 years ago that I lost a dog to a car.  He got out the wrong door and in to the street.  Death deprives us of love.  You never get over it you just keep going day by day until living without the loved one becomes habit.  I have been putting off getting another dog with one excuse or another until finally last week I decided it doesn't make sense that I couldn't spare some time, energy and money to rescue some needy dog.  aSorry that you had to lose your loved in in such a horrific way.  You are definately dealing with PTSD.  I'm sure you know professionals are available if needed.  Anger is natural and one of the grief stages which you will experience in the coming days.  Healing thoughts.....Zenith",
      "MessageIndex": 1968,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 29, 2010 04:17PM zenith4289 wrote: Katherinenaomi - that is so cool.  Do you like public speaking?  Oct. is breast cancer awareness month so I'm bracing for an onslaught of tv ads, newspaper articles, etc.  A friend of mine stopped getting her mammo in Oct. because of all the reminders.  Hair - I buzzed mine off before it fell and had to redo it a couple of times due to some growth patches but it's pretty much gone now.  Eyebrows and eyelashes are hanging in there.",
      "MessageIndex": 2058,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 3, 2010 01:20PM zenith4289 wrote: Omaz I have had the dry and watery eyes since round two.  I also have had headaches and bad ones that my $5 per pill migraine medication couldn't even touch!  Why are we blaming everything else when it is obviously chemo related?",
      "MessageIndex": 2153,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 8, 2010 05:29PM zenith4289 wrote: What a difference a few hours make!  The dog seems to have settled down today and is not so needy.  The committee met and approved my sick leave extension.  I took a nap.  My coworkers raised money EXCEEDING all expectations so my short pay check is moot!  Plus they brought goodies to eat, flowers and balloons!!! ",
      "MessageIndex": 2282,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 31, 2010 08:00AM zenith4289 wrote: Ginger I am on taxotere and since Sun or Mon I have had moderate to severe pain in my big toes, balls of feet and sides of heels making it difficult to walk.  Today is the first day the pain has lessened a bit.  My feet were also red.  Lisainglem suggested L-Glutamine or Neurontin. I haven't tried either but not really wanting to add another RX (neurotin) to the mix.  I had to take oxycodone since infusion and took one dose today as I still have some soft tissue pain in my port area. ",
      "MessageIndex": 2820,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 29, 2011 11:48PM zenith4289 wrote: Lizzie I know you will be worried until results are in but try to remain calm.  Remember when you told me not to worry about a spot on my rib?  Well that turned out to be nothing and all the worry and lost sleep was not worth it.  It will be what it is and you will go on from there....the strong and beautiful person you are.  I loved \"the help\" and just recently finished listening to the audio book.  I saw the movie on dvd but as usual the book adds so much more depth to the characters!  I felt close to the skeeter character in that i am always wanting to be accepted by the cool kids, the in crowd even tho i know intellectually that that is not necessary.  Well gotta go call in sick.   left work sick yesterday with a slight headache and blurred vision but woke up with a monster migraine this AM.",
      "MessageIndex": 7432,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 9, 2010 06:39AM zenith4289 wrote: Snow just keeps falling and I always start to feel imprisioned when the decks are impassable.  Luckily my DH is keeping the back deck and a small grassy area clear for me and my rescue mutt.  I am so happy I got him and glad I powered thru the first rocky weeks as he is such a great dog!  I can't wait until it's spring and we can go for walks.  Tingling in fingers is getting worse.  I decided to just keep taking oxycodone and stop worrying about addiction for now.  It helps with the all my aches and pains.  I am happy I don't have to go to work but now that I am on leave without pay I have to deal with how to pay all the little extras like life insurance that just automatically came off my paycheck.  I found out that I DO NOT have to pay the union dues!!! ",
      "MessageIndex": 3655,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 29, 2010 02:16AM zenith4289 wrote: Lizzy i hope you are on the road to recovery and that your last tx won't be postponed.  Calam I hope you can get some rest!  Ladyinbama - i procrastinated calling about my eyes and now they are not teary but the left one is blurry.  I am just so weary dealing with home and car insurance issues.  Also my BS office will not get back to me to schedule port removal and/or gall bladder surgery and I am just so done with that surgeon!  I want her to take out the port then I will probabaly try to find another surgeon for the gall bladder and put it off for a few months/year.  My port area REALLY hurts  and I just want this thing OUT!!  Of course the snow and cold don't help either but at least the power hasn't gone out! ",
      "MessageIndex": 4017,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 11, 2011 11:06AM zenith4289 wrote: Cal - I am hoping that you get only good news tomorrow!  I am doing the ultimate in multi-tasking as I am having a complete hysterectomy tomorrow plus my BS is taking out my gallbladder and port!!  Today I had to do a bowel cleanse and am on clear liquids.  I am HUNGRY and never noticed before how much people on TV eat!  Even though things still don't taste quite right I could go for a slice of pizza right about now!  At least with chemo I could eat - well except for about 2 weeks after taxotere when things tasted lousy.....  I am hoping for a minimum of pain as both surgeries are laproscopy. ",
      "MessageIndex": 4352,
      "PostDate": "11/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 16, 2011 09:22AM zenith4289 wrote: sptmm - you can check out more info at gammagram.com.  A GammaGramTM is a molecular breast imaging technique that goes beyond mammography, MRI, and ultrasound to detect cancer even in women with difficult-to-diagnose breasts. This advanced imaging technology is the next step after a questionable mammogram to provide the earliest detection of breast cancer.  They inject radioactive material and take pictures of your breasts using a machine much like a mammogram but without painfully conpressing the breast.  It takes a couple of hours and I sat and watched a movie during the test. ",
      "MessageIndex": 4435,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 20, 2011 01:42AM zenith4289 wrote: Omaz - yes i had the right eye done Monday and back to work on thursday.  first eye is good.  I have to wear glasses still and the only ones that work right now are some old aviator glasses my DH had in the 80's.  I can't get a new rx for a month so have to go around looking like gloria steinem for awhile.  Hair started coming in the male pattern baldness areas but  it is short and I still have to use the wig.  Hope to get to bad haircut status soon then i will go wigless....  Now if I can find a solution to the arimidex hot flashes and the post bmx pain!  Why can't we have it all?",
      "MessageIndex": 5210,
      "PostDate": "20/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 23, 2011 10:47PM zenith4289 wrote: I am now getting email alerts but they are in a weird style and I have to scroll horizontally to read them in my email.  Anyone know how to fix or who to complain to?",
      "MessageIndex": 5294,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 1, 2010 11:23PM zenith4289 wrote:",
      "MessageIndex": 94,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 5, 2010 10:20AM zenith4289 wrote: I was supposed to start AC tomorrow but the bone scan I had on tuesday revealed a \"spot\" on my rib.  the Onc wants me to get it biopsied.  I have spent the last 24 + hours crying and miserable with pain from the port and just not knowing what to think or do or where to turn.  I don't want to be stage IV.  I don't want more test, more doctors.....  I was resigned to getting chemo and even got a decent wig.  Now what? ",
      "MessageIndex": 179,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 28, 2010 11:01PM zenith4289 wrote: Ann97 I had bad back pain with my first neulasta shot.  kept me in bed or chair all day on day 3.  Today is day 3 of my second round and i have no pain.  I took claritin this time yesterday before the shot and this AM.  I am not getting steroids except for with the infusion.  I take ambien cr to sleep and i sleep good.  LIZZYMACK1 - you were so supportive when I was freaking about my rib spot and two radiologists reported back it was probably an old fracture but there is no getting around the worrying - just stay off the stage IV blogs and you'll be OK.  We all know waiting over a weekend is horrendous!!.  I ordered the micro bead prosthetics from TLC and a bra.  they are great! The company that i have to use with my insurance doesn't have them and it's going to be 2 weeks before i get the bras and prosthetics that are 100% covered by my insurance.  I am saving the insurance co so much money by not doing recon they should be paying me!!!",
      "MessageIndex": 1019,
      "PostDate": "28/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 1, 2010 08:42PM zenith4289 wrote: SO MANY BLESSINGS - I am shocked that there is not more financial support for canadian women!  There is a forum for canadian women on this site.  Perhaps one of the sisters there can help you navigate the red tape and get some help from somewhere.  You do have support from family and friends and that is a positive.  It is not good that you can't eat or drink after chemo so address this with your onc or NP ASAP.  The american cancer society has helped me out financially - maybe there is a similar organization north of the border?  I hope things get better for you soon.",
      "MessageIndex": 1149,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 3, 2010 04:50AM zenith4289 wrote: CALAMTYKLE - I had that SE where i felt like my upper body was bruised.  it was painful for even the slightest touch.  maybe it's the neulasta. ",
      "MessageIndex": 1217,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 17, 2010 10:27AM zenith4289 wrote: ONEMONGA - I was feeling weepy today too.  Maybe cuz i woke up with a headache and had nausea all day.  I don't know why but I resisit taking ativan and compazine until it becomes really apparent that I need it!  I'm gonna work on that.  Didn't sleep well last night either but worked in a couple naps this PM!  I am feeling better now and focusing on not getting sick.  Saw onc today and i have neutropenia but I had to go to the grocery store and DH and i always eat out when we go to \"the city\" for treatment.  Next week is my last AC tx and onc says that taxol will not be as \"bad\"  I'll believe it when i experience it because we all know SE's are different for everyone!  I found out i was eligible to get a few vouchers for free alternative treatments.  i picked up a brochure on acupuncture and have decided to try it.  I seem to have constant pain in my neck and shoulders ( had b4 bc).  I just don't want needles in my arms as i don't want lymphedema - anyone know how/if they can get around this?.  I don't think i'll be able to draw on eyebrows.  Mine are hanging in there but think i'll order the glue on ones just in case. ",
      "MessageIndex": 1710,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 20, 2010 09:15PM zenith4289 wrote: welcom e elizabeth!  so sorry you have so may se's.  hope the rest of your tx is not so bad.  i have been told taxol (my next tx) is \"easy\" compared to the ac i'm finishing up but i used to be from the \"show me\" state so i'll believe it when i see it.  Lizzy thanks for hanging in there and the poems.  Ginger good luck today.  I have my last ac tx on thursday if my wbc are good.  Went to the ER again saturday night - waiting room full of sick/drunk college students.  but they took care of me and isolated me right away.  I'm on cipro with a slight sore throat and hoping those wbc's get busy!  LIZZY - my dh suggested we leave the bedroom door open last night to get some fresh air in there.  I asked him if it had a weird chemo lady smell and he denied it but I have noticed something too so will air it out all day today, change sheets, etc.  I decided to look into getting a dog.  i haven't had one for years and really miss having one.  i'm going to look into a company that installs the electric fences and trains the dogs as we have no fence.  advice?  i know now is probably not a good time but if not now when?  it will be easier to convince dh by playing the cancer card too!  Rachel i too have having trouble reading due to concentration and dry eyes.  luck to all having treatments this week!",
      "MessageIndex": 1786,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 21, 2010 08:22AM zenith4289 wrote: LIZZYMACK1 - Great Rant!!  So sorry you are having SE's.  I use biotene all the time and have only had 2 or 3 mouth sores during a treatment cycle.  I would not use listerene because it dries out the mouth.  I forgot about dry eyes and dry mouth and woke up one morning almost unable to blink and eyesight blurry for two days.  My mouth was so dry it hurt even though I didn't have sores that time.  Now i use artificial tears every couple of hours and during the night when i wake up to use the  restroom.  yeah, biotene is mild but you will probably appreciate it when you need it.  I also use the biotene mouth spray. ",
      "MessageIndex": 1814,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 21, 2010 11:23PM zenith4289 wrote: TEXAS - When you have a family member or friend who has a mental illness no amouot of logical advice or reassurance from a friend is adequate to correct their distorting of reality.  Loving, common sense advice or ass kicking does not change a person's distortions when mental illness or personality disorders are involved.  They need a professional who can communicate to them in a specialized way so as to help them cut through their defenses and look at themselves logically and make appropriate changes.  You are only in control of yourself and your behavior.  Hope the rest of your journey is smooth and peaceful.",
      "MessageIndex": 1838,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 23, 2010 09:29AM zenith4289 wrote: KATHERINEN - great poem.  thanks. Kimmie I have have tx #3 AC and yes it is a hard regime.  my WBC's got too low the last two times and I had to go to the ER with a fever then home with cipro.  This week I have a cold so my 4th and final AC is postponed until next week :(  I will be starting taxol for 12 weeks after AC.   I have had upper body pain the last two tx and NP said it was newlasta SE.  I too have to lurk and skim through many posts but I hope everyone is getting the strength they need from this group to continue.",
      "MessageIndex": 1883,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 27, 2010 07:41AM zenith4289 wrote: Lizzy my last AC is this thursday the 30th.  postponed because of the viral cold i had last week.  Taxol will start on the 14th if all goes well.",
      "MessageIndex": 1993,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 4, 2010 10:16AM zenith4289 wrote: Gingerbrew - I start taxol oct 15th so am interested to hear how your experience goes.  I had a horrible cold too but it ended.  My last AC was postponed a week because of it. ",
      "MessageIndex": 2180,
      "PostDate": "04/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 21, 2010 05:51PM zenith4289 wrote: Now I am worried about my first taxotere tomorrow.  I forgot my cell phone and the onc office left a message that there are \"some changes\" and I need to pick up a steroid RX and take it tonight.  Now I'm worried I won't sleep even with the ambien and of course the office is closed so I don't know what the changes are and won't know until 8 am tomorrow!",
      "MessageIndex": 2532,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 29, 2010 08:55AM zenith4289 wrote: Hi everyone.  I had an acupuncture session today but it doesn't seem to have helped.  In fact my lower back is in spasms.  I had to take an oxy and am taking tylenol.  The onc office doesn't want us to take tylenol because it masks a fever but I am not going to go to the ER again.  I went Tuesday because of a fever and they never find a source of infection adn in fact my wbc's were good so no cipro.  I know i'm just fighting a viral infection as my son has it now.  Since my wbc's will be low on Saturday I'll probably be sick then.  Slept a lot today.  gotta go find a more comfortable chair.  This acupuncture was free thanks to a grant and i made another appt which i'll have to pay for but I don't think I will go.  Sorry for all the se's you all are experiencing.  I knew the onc was being overly optimistic when he said taxotere was \"easy\"",
      "MessageIndex": 2749,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 11, 2010 05:37PM zenith4289 wrote: ckptry - it is unfair that we should have to fight with drs, insurance companies, other medical personnel, billing depts, and the SCHOOL OFFICIALS too!  This is what causes me to have meltdowns these days especially when the insurance denies something (prosthesis) that I know are 100% covered.  I had to waste a hour of my time only to have them \"resolve\" it and promise a check within 15 days.  Why can't we just say \"I have cancer and am in chemo tx\" and have everything resolved?   lizzy is Blink a rx?  I started steroids today and had to drive to the city to see the BS.  my dh notices that I am a more aggressive driver and calls it \"roid road rage\"  He drove home because I got REAL nauseated after lunch and had to take an ativan.  Port area still hurts but BS had no solution other than to say she will take it out when my Onc says it is ok and maybe when I have the hysterectomy in Jan she can do this at the same time.  The surgeon said he would want an IV line as well as the port when I have surgery because the port doesn't always respond as quick as it should so i'm thinking why even have the port for this surgery when i'll have to put my arm at risk for lymph edema anyway?   gonna check my blood sugar with dh equipment tonight or tomorrow am! ",
      "MessageIndex": 3051,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 3, 2010 09:13PM zenith4289 wrote: LISASINGLEM - thank you for the info on the living strong/living well program.  I went to the website and found there is a program in a city near me so i signed up for more info.  I would really like to do this once i'm done with chemo.  It takes awhile to recover from the last tx.  They scheduled my hysterectomy for about 4 weeks after last tx.   #3 of 4 today and i'm awake due to steroids!",
      "MessageIndex": 3533,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 5, 2010 08:28AM zenith4289 wrote: GINGERBREW - so sorry you have been experiencing such bad SE's.  I hope the neuropathy is not permanent.  What chemo will you be on in Jan?  I could not tolerate taxol and taxotere has been worse than AC for me in regards to SE's but nothing as bad as what you have described.  My last is scheduled for Dec. 23 so I told everyone we would not be doing a xmas dinner cuz everything will taste like shite for at least a week so we can do a dinner for new years.  i can tolerate mint or lemon tea and yoplait lite.  everything else tastes like it has bug spray in it.",
      "MessageIndex": 3564,
      "PostDate": "05/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 30, 2011 09:58AM zenith4289 wrote: I did some online research and found out that it is the steroids that can cause cataracts.  I was taking dexamethasone orally with the taxoterrible and it was also part of the infusion.  I don't know if dex was part of the AC infusion but anyway I may have had cataracts before bc but the steroids made them grow faster!  i can see ok out of the right but left eye is very blurry and it is hard to read.",
      "MessageIndex": 4638,
      "PostDate": "30/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 10, 2011 01:49PM zenith4289 wrote: Ginger - I thought I needed new glasses after chemo only to find out that the steroids made my cataracts grow like wildfire.  Cataract surger on the left eye is complete and right is scheduled for mon.  it is a relatively \"easy\" surgery but another bump in the bc road!  Hope all you need is new glasses!",
      "MessageIndex": 5111,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 19, 2011 10:39AM zenith4289 wrote: Lady - don't know how to solve your problem.  I had set up to get email notifications of new posts and now I am not getting them so something must have changed.  I going to try removing email notifications then adding them..... First two days back at work weren't too bad.  I miss having my little dog by my side or in my lap though.  Poor baby will be alone most of the day next week as DH goes back to teaching.",
      "MessageIndex": 5207,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 10, 2010 10:58AM zenith4289 wrote: Good news today.  Probably not a tumor on my rib - per radiologist - so I can go ahead with the chemo ACx4, taxol x12.  Never thought i'd be glad I could start chemo.  Will update with a start date as soon as I know.  My onc  only had the first biopsy report when we first met and the first thing he said was he recommended mastectomy.  I had to inform him I had already had a bilateral masectomy and gave him a copy of the post surgery pathology report. ",
      "MessageIndex": 316,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 10, 2010 01:14PM zenith4289 wrote: I am starting chemo Thursday Aug. 12.  I am amazed how many ladies on on this thread now!!  Best wishes to all of you.  I hope our high expectations fit with our realities.  If not we just have to adjust because reality always wins.  We have to adapt and not be unhappy and disconnected.  I am going to learn to do this chemo stuff and practice it until I am good at it.  No magic words, no magic tricks and no magical thinking.  My husband says a jackal dies a thousand deaths but a lion only dies once.  I am trying to be more of a lionl ",
      "MessageIndex": 344,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 6, 2011 06:49AM zenith4289 wrote: Lizzy - i don't remember how i got the bruise on my forehead but think I was trying to take a synthroid pill and dropped it and hit my head on the table near my bead.  I had swelling and a bad bruise but can't remember a thing!  Anyway I have to get off the ambien so gonna try next fri and sat night.  may have to chuck the gabapentin too 'cuz i don't see any appreciable pain relief.  i am now going to a pain dr as i have the chronic post masectomy pain syndrome and he injected a cortosteroid into my port scar and also a muscle area that has always been painful since mascectomy.  not seeing any appreciable relief there either.  hot flashes have decreased from 24 a day to 3-4 a day on arimidex so it is managable now.  I am sorry you all have insurance problems.  my dh's insurance is great.  paid 100% for chemo, 100% for surgery, $60 copay for 1 day surgeries, etc.  although the copays add up it is managable.  also they said they wouldn't pay for my post cataract lenses then they did, and they said they wouldn't pay for my lymphedema specialist physical therapy as she was not in the network but then they did.  They will pay for reconstruction but i have opted not to do that for now.  He is in the teacher's union in NY and of course all politicians are blaming the unions for everything now so our young workers better prepare for a fight or they will lose all our hard earned benefits.  Omaz - we have a house in az we are moving to once we retire (2015).  i'm thinking now we might want to keep the ny house to live in during the summer but not sure we could afford both.  maybe we should get a cottage or summer place in northern az.  my hair came back curly and fine.  it looks like billy crystals hair when he was younger!   my face has definately taken on more wrinkles and a masculine look - no estrogen?  anyway i think i look like art linkletter (probably most of you won't know who the hell he was) good day and hope you are all thriving.",
      "MessageIndex": 6376,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 28, 2011 02:46AM zenith4289 wrote: Texas - did any dr say if ur eye mite return2 normal? Mine said it was chemo & dryness that is causing this. Liz i had 2 rid myself of all preop bras. Can u deduct on ur taxes? We cant do sch. A anymore. I had a hell of a time getting a mascetomy swimsuit...(no recon) finslly got one.",
      "MessageIndex": 7425,
      "PostDate": "28/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 19, 2010 06:02AM zenith4289 wrote: lizzymack1 - my dh is a diabetic and gives himself insulin shots daily.  I asked for a RX to have him give me the shot at home and after the 1st one the onc ofc was willing to do it.  we have 3 already loaded needles in the fridge.  he watched the nurse do it the first time and it is not any different then what he does daily.",
      "MessageIndex": 627,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 19, 2010 12:32PM - edited Aug 22, 2010 12:03AM by zenith4289 I only had to pay a $40 copay for $30 total.  anyone still having surgical pain i.e. pain in the breast (or non breast area) and/or pain in arms?  I am still taking 1-2 percocet a day because it hurts and wearing the postsurgical camisol hurts even tho it is soft it presses against the foobs. ",
      "MessageIndex": 643,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 25, 2010 08:05AM zenith4289 wrote: ONEMONGA, ZACHSMOM, ANNIN, TSW19, AND KATHERINENAOMI - best wishes to all of you for a relatively managable and SE free treatment.  I was so scared of SE's (still am) but the first round was managable.  My next time in the ring with the champ (chemo) is thursday.  not looking forward to it but know that i have to go with it if I want to beat this thing and live.  I will try claritin for the newlasta pain this time - anyone know when to start?  before the shot?  I buzzed the hair off - maybe prematurely - but i am ok with it and the wig i got is fine. ",
      "MessageIndex": 870,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 26, 2010 09:31AM zenith4289 wrote: KIMMIE68 - I am on medical leave.  I work in foster care and of course the kids are always sick and the caseworkers use up their sick leave and come to work sick so i decided it was better.  Besides i have a union sick leave bank that will pay my salary but it's complicated if I come back to work part time so it is just easier this way.  I will have to be on leave without pay sometime starting in Dec.  I expect i'll be granted LWOP as it is part of our union contract.  I will ask if i am getting a  low dose of taxol.  I was told i would lose my hair so i had it buzzed and bought a wig, hats, etc.  i got some from ACS too.  The wig shop had a chemo specialist and she was able to pick out one that matched my color and style.  the nurse told me to stay on top of the nausea this time and take ativan and compazine at 2 hour intervals for day 2 and 3.  I will also start to take percocet friday night and not wait for any pain before starting it. ",
      "MessageIndex": 927,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 26, 2010 09:39AM zenith4289 wrote: KIMMIE68 - I am 56 and postmenopausal.  and yeah, sometimes crying is the only answer in any given moment. ",
      "MessageIndex": 929,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 29, 2010 03:43AM zenith4289 wrote:",
      "MessageIndex": 1033,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 29, 2010 01:39PM zenith4289 wrote: A bit about me - I have two adult children ages 31 and 25.  My 31 year old is a pharmacist (loads of info on these drugs) and 25 year old is a computer specialist who lives with us.  We have a 5 year plan to retire and bought a retirement home in phoenix AZ where the 31 year old lives in Feb. of this year.  My DH is a college professor and I am a foster care supervisor. DH has diabetes and high blood pressure but he is a \"model patient\" and it is under control.  When I got the BC DX it really rocked my world.  Things seemed to be going smoothly then, bam - test after test - so many other shoes dropping you'd think I was a caterpillar.  The 31 year old just got divorced too so that was a major loss.  No grandkids yet.  My eldest son decided to rent our retirement home from us rather than manage renters and that helps.  My 25 year old is somewhat of an introvert and except for going to work he doesn't leave the house much.  He plays the world of war craft but doesn't have much of a social life.  I don't have a pet but plan to have a dog or two in retirement.  I have to be a \"fearless leader\" at work but find that BC often brings out the pessimistic and dark humor side of my character.  I am on medical leave until Feb. as I have to have a complete hysterectomy after chemo is done.  DH of 34 years has been my rock.  He is from another country and all the relatives on that side are far away.  My mom chose to live near us and moved here when we did.  She's not in the best of health but refuses to see a doctor for over 4 years now. ",
      "MessageIndex": 1052,
      "PostDate": "29/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 2, 2010 08:55AM zenith4289 wrote: I went out shopping in the heat today with my franceluxe scarf.  I really like it even tho it to was a bit hot and uncomfortable at times.  My onc ofc has chemo mentors and my mentor told me she would put a damp washcloth on her head, then a wig liner than then wig.  I haven't tried this yet.  I feel guilty reading other's posts because my SE's seem to be minimal right now.  1st round i had horrible back pain for 24 hours.  I still have a bit of nausea but ativan under the toungue works quick.  I had a routine mammo on april 23 at a different facillity than my usual.  they had a question on the questionaire about feeling if the skin is thickening.  I remembered that I had felt something \"different\" and answered yes.  I saw the breast surgeon on May 6 so it didn't take too long.  I am so glad I didn't go to my usual facility as I don't think they ask that question and with ILC there is often no lump.  A gamma gram found a small tumor in the right breast as well so i opted for a bmx which I had on july 8 along with node biopsies.  I was shocked it had gone to the nodes and scarred to death of chemo.  my hospital experience was bad.  there was a lady on the floor who was dying and she screamed \"help me\" 24/7.  I felt like I was in a bad nursing home and I have complained to the hospital.  Today I got a letter from the hospital asking for a donation - fat chance! ",
      "MessageIndex": 1186,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 1, 2010 11:28AM zenith4289 wrote: LIZZYMACK1 - glad you have FINALLY been given a tentative start date!",
      "MessageIndex": 1141,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 5, 2010 08:18AM zenith4289 wrote: CALAMTYKLE - I am still having queasiness around 1030 am and sometimes early afternoon.  an ativan under the tongue helps.  I am on day 10 and next chemo is thursday.  Everyone - Robert Schimmel died in a car crash.  He was a comedian and not for everyone but I enjoyed his comedy.  He also had cancer and wrote \"Cancer on $5 a Day\"   If only it were true.......  I read an article somewhere that cancer is the most expensive disease you can have.",
      "MessageIndex": 1320,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 5, 2010 01:26AM zenith4289 wrote: SOHARDBNME - It is not an ideal way to spend your birthday I agree.  As for me my next time in the ring with Mike Tyson (what I call chemo) is Sept 9 and my birthday is Sept. 12.  I was scheduled to go to a free camp for women with cancer on a beautiful lake Sept 10-12 but decided against it due to having to deal with SE's even tho they are minimal I just didn't want to risk having bad bone pain, etc.  I can go next year they say.  I did get a massage at the onc office yesterday and it was heaven.  I'm going to see about scheduling one every month.  Anyone done Rikki (sp)?  they offer that, acupuncture and some other non traditional healing stuff. ",
      "MessageIndex": 1306,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 10, 2010 09:42AM zenith4289 wrote: I am 75% done with the AC tx!  Hot flashes - I forgot to mention this se to the np so am writing this down this time.  some nausea.  slept 3 hours this pm.  not feeling too bad but trying to get the last of the water down.  DH to give me neulasta tomorrow.  My NP says she has seen big strong lumberjack type men weeping about the se's from neulasta.  It is hard to believe we all have different reactions to everything but so long as the outcome is NED i'll take it.  CALAMTYKEL I was in a twilight sleep for my port and sort of remember being pushed around but no one asking me to hold my breath.  My port is still sore.  The NP poking around looking for it today and i nearly jumped out of the chair!  She says \"oh does it still hurt?\"  Yeah even with the emla cream!  so I am wondering if there may be some infection around the port?  I will see the onc next week and bring this up.  Anyway hope your anxiety about the port was worse than the procedure.  She also asked if I had any hair loss - I was wearing the wig and told her it was gone - which it mostly is. ",
      "MessageIndex": 1459,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 13, 2010 06:40AM zenith4289 wrote: Day 4 after 3rd tx and I am very tired.  Lots of upper body pain too.  It's my birthday and i'm just quitely enjoying a huge bouquet of flowers sent by friends far away.  treated myself to somethings too.  Texas - glad to hear of your progress.  Glad to hear from sohardbnme.   I mostly read all the posts but can't seem to answer all that I want to.  My arms hurt when I type so gonna go.  Am taking nausea meds to keep at least the water down.  Hope I feel better tomorrow so i can go to the look good feel better class. ",
      "MessageIndex": 1562,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 13, 2010 10:39PM zenith4289 wrote: Hi everyone.  I am feeling better this AM.  Plan to go to the look good feel better class at 5 this pm.  My eyes are dry and sore though so i won't be using any eye makeup.  My brows and lashes are hanging in there.  I need some exercise so plan to go walk in the mall before the class.  Good luck to all having tx this week! ",
      "MessageIndex": 1589,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 23, 2010 03:46PM zenith4289 wrote: Scrabblelady - my wbc were low even with neulasta.  i had to go to the hospital er with a fever twice.  No infection could be found and they sent me home on cipro.  My 4th tx was postponed this week because I have a cold and I swear it is worse than any SE I have had so far.  I don't know if claritin helps but i have been taking it. ",
      "MessageIndex": 1909,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 24, 2010 07:44PM zenith4289 wrote: I adopted a wonderful calm lap dog today!  He is small and cute and very obedient. I feel sorry for whoever had to give him up.  I felt bad about playing the \"cancer card\" with DH in order to do this but we talked it over and he really wasn't opposed.  I will be having my 4th AC tx next thursday.  My cold is so much better today! ",
      "MessageIndex": 1946,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 28, 2010 08:23AM zenith4289 wrote: Calamtykel - Thanks for asking the hard questions and posting your onc's answers.  I try to focus on the next thing only but admit I did way too much board reading and googling in July!  I haven't had much relief from the port pain but will see if the steroids in my AC cocktail on Thursday help a little!  I had a bmx and the side without the port is tender too so I think that contributes to the pain and uncomfortableness on the port side.  Meanwhile I can't believe how great my new dog is!  He is housebroken, calm, obedient and loves to sit in my lap!  Rescue dogs rule!  I feel sorry for whoever had to give him up and think it had to be the economic situation.",
      "MessageIndex": 2016,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 29, 2010 06:41PM zenith4289 wrote: MVL2356 - My dx was ILC and it was found in both breasts so not only am I in a minority of breast cancer types but to have it in both breasts at the same time is unusual.  My regime is ACx4 then Taxol x12. ",
      "MessageIndex": 2064,
      "PostDate": "29/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 30, 2010 09:38PM zenith4289 wrote: I don't know if it was a mistake but the nurse explained that there is a metal piece coming out of my port that is close to the shoulder joint so that may be causing discomfort.  I had heard nurses discussing my port on another occassion and I gleaned from their conversation that their practice places it differently.  My BS did the port.  I don't complete range of motion in my left arm since surgery  - bmx and nodes removed on both sides.  anyway gotta go deal with hot flash.....",
      "MessageIndex": 2107,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 3, 2010 11:27PM zenith4289 wrote: Omaz artificial tears helps somewhat and warm compresses on the eyes.",
      "MessageIndex": 2159,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 8, 2010 12:47PM zenith4289 wrote: I have been weepy for 2 days now.  Cried at the onc's office when the port nurse palpitated for the port and it HURT!  I just feel like I am not making good decisions.  My wbc's are low so i'm stuck in the house.  Just had a meltdown over slipcovers that I ordered that are CRAP and now I have to send them back.  I'm not making anymore decisions to buy anything for awhile.  I should be overjoyed because i'm done with the heavy chemo (AC) but just feeling awful.  I have been really second guessing myself about the dog and worried about whether I can take care of him adequtely but knowing everyone will hate me if I send him back to the rescue!  Also lamenting over having to fight with the insurance co, the billing depts, my union committee can't seem to get together to approve more sick leave so my check was short, ad nauseum.  Isn't having cancer bad enough?  Work is having a bake sale and raffle for me today and I can't put in an appearance!  I am glad for the support but feel weird about it!  Anyway I don't have a cold or anything right now so my first Taxol is sheduled for next Friday. ",
      "MessageIndex": 2275,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 8, 2010 01:03PM zenith4289 wrote: Ladyinbama and Rachel - so sorry you are/were in the hospital.  Sweeney thanks for your sharing - you got it right!  Ckpty sounds like you handled the playground situation with grace.  Chickens?  Last night my son says he heard a coyote.  He was walking the dog who of course was to scared to do his \"business\" outside.  They would make a small snack out of him.  I am not looking forward to trying to get him to go outside in the snow.  I am worried he will not be able to handle being home alone when I got back to work (Feb?)  I can't afford doggie daycare (well maybe one day a week but not 5) and there doesn't seem to be any dog walkers in our small town.  I know I am dwelling on the negative so going to sign off and watch a comedy movie and forget about my son and new girlfriend coming next week and how much work needs to be done to clean up this house before then because I am just too depressed and tired to do anything about it now. ",
      "MessageIndex": 2278,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 10, 2010 08:09PM zenith4289 wrote: Texas - so glad to hear about your good scans.  Lizzy - I start Taxol Friday the 15th.  I stayed home all weekend and didn't end up in the ER!! Had a fever last night but it never went above 100.5 which is the magic number wherein we are to call the on call onc just to be told to go to the ER, spend 5-6 hours there racking up lab, xray and er copays only to be sent home with one cipro and a RX for more!!  I'm feeling pretty good except for occassional nausea and fatigue.  Dog's behavior continues to improve and DH and son are helping out a bit more.  Son is great at grocery shopping but DH cannot find brands names if his life depended on it.  He has to get a worker to help him.  Could't find starbucks ground coffee and if I don't specify a brand name he tends to buy the most expensive and not generic. ",
      "MessageIndex": 2329,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 16, 2010 07:51PM zenith4289 wrote: jsw - my onc did mention abraxane but said it was very expensive and my insurance wouldn't approve it.  I found this quote on this site when i did a search - \"The drug, moreover, is not approved except in people who have advanced, metastatic breast cancer. More practically, the drug is usually not covered by insurance except in rare circumstances in people without metastatic disease\". So I would be interested to know how your onc got it approved.  Costs - i haven't looked at our benefit statements in detail except to look at the bottom line - patient pays and it is always zero.  I had argued with the office from the beginning that the insurance covers at 100% but they still charged copays.  Now we should have about $120 credit.  I am planning to call them next week to see when we will get an itemized bill and repayment.",
      "MessageIndex": 2437,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 21, 2010 07:15AM zenith4289 wrote: RE: watery eyes - I only got a half dose of taxol last week and my eyes have been watery all week.  The left more that the right.  Right eye is red.  I am not looking forward to a full dose of taxotere this Friday! ",
      "MessageIndex": 2508,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 22, 2010 05:59AM zenith4289 wrote: I apologize for using this board mostly to vent and not too much to support you all.  I do read most of your posts and wish everyone the best.  Calamity, wherria, texas you inspire me.  I kept wondering about the steroid problems and now I know the joys of hot flashes and sleeplessness.  Ginger i tried calling the oncall onc but was told i had to wait until tomorrow.  I didn't get my RX until 7 pm and the instructions on the bottle said take two pills twice a day with food and 8 oz of water.  I took 2 at 8 and 2 at 11.   ",
      "MessageIndex": 2537,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 23, 2010 07:46AM zenith4289 wrote: Ginger - the NP told me yesterday that taxol is considered to be the better tx for early stage breast cancer but if it can't be tolerated then the switch to taxotere is appropriate.  I hope you don't have an allergic reaction to it.  Good Luck to you on Monday!  Woke up with face beet red and it is still red after taking 2 bendryl.  I have rosacea.  I was able to sleep pretty good last nite with help from ambien and benedryl.  NP said I would start to feel better taking the taxotere within a couple of weeks and I am actually feeling better this AM!  Not sure how to feel about my appetite coming back because I lost 30 lbs since dx and don't want to gain any of it back!",
      "MessageIndex": 2562,
      "PostDate": "23/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 25, 2010 11:44PM zenith4289 wrote: OK so on this \"easy\" regime of taxotere I am hurting from my head (headache) to my toes (neropathy  pain in both big toes).  Knees, ankles, port area, chest, shoulders, neck, well you get the picture.  plus i just started feeling nausea so gonna go take meds.  Newlasta shot this afternoon,  yeah!",
      "MessageIndex": 2628,
      "PostDate": "25/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 27, 2010 02:12AM zenith4289 wrote: Lizzy thanks for the link.  Good luck to all having infusions this week and dealing with se's.  My pain is a little less today and i'm hoping to feel better by friday.  Yea for oxycodone!  DH has a cold and we are trying to stay apart but I think when my wbc's go low i may get it too.  NP said wbc's go low around day 9 or 10 which would be this saturday for me.  I am bored and can't pick up even a washcloth with my left hand (port side) without pain.  DH slept in the living room last nite which can't be good for his cold but he insisted.  My new rescued dog is working out better than I expected. He is really sweet and I just had to learn that he only wants 3 things:  food, outside for elimination, and up in my lap or attention.  Much easier than a baby.  He is only 8 lbs (chihuahua + pug = chug) but it still hurts to pick him up sometimes.  Everything tastes bad - even bottled water.  I have to force myself to drink.  I do try to keep up with everyone's posts and enjoy reading the good and the bad.   ",
      "MessageIndex": 2691,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 30, 2010 06:28AM zenith4289 wrote: Well it is day 8 since my first taxotere and along with everyone else on this board I feel like shite!  I know we're not all doing taxotere!  Pain, fatigue, mouth sores, awful taste, nausea.... Anyone have bad toe and feet pain?  I mean it hurts to walk pain!  Called the onc office and they just suggested moisturizers.  Anyone have a better way to deal with feet pain?  Oh and the acupuncture didn't help one iota.  Maybe after all this chemo is done I might try it again but those tiny needles are no match for modern medicinal poison.  In ten years I hope something better than chemo is developed and the world will be tsk tsking at all the torture cancer patients went through! ",
      "MessageIndex": 2773,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 2, 2010 08:58AM zenith4289 wrote: Ladyinbama - I did have very bad muscle, lower back, knee and ankle pain after my first taxotere and took oxycodone every 6 hours for about 6 days.  I saw the NP and onc today who both felt that was excessive pain plus I developed red sore feet and yesterday I noticed a blister on the side of my foot.  Today the onc thinks it is a se of the chemo and rx'ed an antibiotic.  They are reducing my dose for the next infusion too.  I know it was the chemo because i got the pain almost immediately - infusion friday, pain friday night sat sun.  newlasta on monday so it wasn't the newlasta.  i have been running a fever off and on since last tuesday too.  The onc said if I couldn't tolerate the lower dose then he would have to stop the chemo.  I'm not sure how I feel about that...... I would LOVE to stop chemo but I also don't want to wonder \"what if?\" down the road should there be recurrence or metastasis.",
      "MessageIndex": 2864,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 10, 2010 02:48PM zenith4289 wrote: Calamtykle - sounds like a really insane morning.   Maybe the kids are just acting out because they are worried about you?  In my job we see a lot of kids refusing to go to school because they think they need to stay home and protect mom.  You have so much on your plate then to have BC and chemo se's on top of that just seems to be to much!  I hope you can relax and take care of yourself for awhile.  Hope you have a nice and understanding new neighbor too. ",
      "MessageIndex": 3023,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 12, 2010 09:05AM zenith4289 wrote: Sweeney yes please post pics and let us know if they can be bought online!  Texas, lizzy so glad to hear positive results coming from cancer.  I have learned who is a true friend and that my coworkers and union brothers/sisters really can be counted on in a pinch!  Am Cancer society has been very helpful - reminds me I have to donate!  On steroids so up at 430 today.  feeling energized but not too excited about tx today.  I had a cup of coffee and then I had about 15 min of fast heart palpitations so guess i'll have to switch to decalf on roid days.  Ginger I am hoping that I won't have as much pain this round but am armed with oxycodone just in case.  I found that the acupuncture really didn't help so cancelled my second appt.  Massage helps but only while i'm getting the massage and for about 30 minutes after. lizzy i am glad conan is back and have been recording it. ",
      "MessageIndex": 3062,
      "PostDate": "12/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 13, 2010 12:16PM zenith4289 wrote: My taxotere was reduced by 20% and I still had a face flushing issue right before the end of the infusion.  It is so weird because the nurses all come running as if I'm having a heart attack and stop the drip and give me benedryl and call the onc or np.  Face was red this am too but no breathing problems and I don't have the bone an muscle pain like with the 1st infusion so thankful for that and hope it continues but DH is giving me neulasta tonight!  dry eyes and blurry vision are my second worst se after the pain.  haven't been able to read a book since sept.   Lizzy i am so sorry your company treated you like crap.  Are you still employed there and going back?  I am taking advantage of this good weather in the NE and actually took the dog for a walk downtown this am.  Never thot i'd be able to do that in Nov!  Plan to do the same tomorrow. ",
      "MessageIndex": 3088,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 8, 2010 02:00AM zenith4289 wrote: I wish I could be a positive person and just be glad I get to stay home out of the horrific snow we're having and just deal with chemo SE's.  I find myself obsessing over how I am am going to get back into the routine of having to go to work everyday.  My hysterectomy has been pushed up 2 weeks to Jan. 11th and I am nervous about this as it doesn't give me a full 3 weeks after the last taxotere (dec 23) to recover however I do want to get this all over with as I am now on leave without pay.  I should get a small disability check however.  My DH says the onc clearly told me I wouldn't have to do rads and I think with the amount of lymph nodes removed I shouldn't need it either.  Meeting with onc on the 16th and will get clarification.  Meanwhile life goes on and we have to deal with plumbing problems in our retirement house!  Sometimes it is all too much.......  Just have to keep telling myself that bankruptcy is not as bad as a metastasis so get my priorities straight!",
      "MessageIndex": 3611,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 20, 2010 07:25AM zenith4289 wrote: Ladyinbama - I have had teary, blurry eyes off and on almost since the first tx and this is the first that I have heard that an opthamologist might be able to help!  I am calling mine tomorrow AM.  My onc and np never mentioned anythingabout tear ducts despite my complaints.",
      "MessageIndex": 3838,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 23, 2010 08:38AM zenith4289 wrote: Heading for last tx today, yeah!  On steroids so the drive in should be exciting!  Forgot that caffeine and steroids make my heart pound so had some heart pounding moments this AM!  SPTMM I think from here on out every little pain, every test is going to put us into high anxiety mode and it is really unnecessary until like lizzy says we know the facts!  Ann97 I has a bmx and was told i could not have mammos or mri or gammagram because there is so little tissue left (no reconstruction)  so I just have to check for lumps, etc and will see the Onc every 3-6 months while on arimidex.  my tumors were not near the chest wall, margins clear and no radiation.  I have what I call \"banana boobs\" as it looks like two small bananas on my chest.  There is enuf tissue for reconstruction my bs tells me i can still do reconstruction anytime but at age 57 i don't really care and if i can continue loosing weight i won't need the size d prosthesis to balance things out.",
      "MessageIndex": 3916,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 14, 2010 03:45AM zenith4289 wrote: Well here we are wading thru the mire to the end of the year, the end of chemo, the end of whatever.... JUST END already!  I meed with my Onc this thursday and thought today would be a good day to make a list of questions for end of chemo start of arimidex, etc.  So will do some research on BCO and other sites.  Suggestions?  I am just getting a deli tray for xmas dinner as everything will taste bad to me anyway.  My fatigue has been culumative.  I will probably eat yogurt and tangerines.  DH gives his last finals tomorrow so I will have his help at home for a month - yeah!  I lost my big toe nail and the other one is barely hanging on.  I remember having a crying fit in Aug when I read that losing nails could be a side effect but at least I wasn't surprised by this when it actually happened.  fingernails are sore but hanging in there!  Healing thoughts to all of you. ",
      "MessageIndex": 3724,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 19, 2010 12:03AM zenith4289 wrote: Healing thoughts going out to all of you!  I saw my Onc this week.  There was no change in my bone scan and he is near 100% certain the \"spot\" is an old rib fracture.  I can get my port out as soon as I want to after my last tx (dec 23)!!!!  No radiation is recommended!  I will start arimidex after my hysterectomy!  I am looking forward to:  food and water tasting good again, hair eyebrows and eyelashes, not feeling tired or sick, an end to watery blurry eyes and vision!  Well those are just a few of my favorite things and I know they won't happen overnight.  There is light at the end of this tunnel!! ",
      "MessageIndex": 3829,
      "PostDate": "19/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 5, 2011 06:13AM zenith4289 wrote: I just can't understand why I am so weepy now that chemo is over.  I am also much more nauseous but I have a cold/flu bug so that could be the cause.  Lizzy i am glad you are home and on the mend.  Calam I hope for the best news for you.  Texas -great news.  Ginger - good luck with rads.  I hope I can get cleared for surger on the 11th tomorrow.  I started feeling the cold/flu on Friday so hopefully i'll be recovered by this friday.",
      "MessageIndex": 4190,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 29, 2011 10:24AM zenith4289 wrote: I went to the opthamologist today and she says that chemo caused a cataract in my left eye and that is why I have the blurred vision.  she says there is one on the right too.  so I scheduled surgieries but am just so depressed taht his crap is not over with yet!  has anyone heard of chemo causing cataracts?  My vision will be better after  the surgeries but now I have to figure out whether I want to try to go back to work or just say to hell with it and ask my BS for another back to work statement taking me out of work until mid march!  She will do this i'm sure cuz she said if i felt like i needed more time to let her know.  Lizzy - well we have have a record amount of snow this year we were just spectators to your latest nor'easter Lisa - great news about rio!",
      "MessageIndex": 4631,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 14, 2011 01:16PM zenith4289 wrote: This snow and cold sucks!  I am glad I am on medical leave even tho I am an leave without pay right now!  lady - sorry you have to wait for your surgery.  Libra sorry you have to have additional surgery but hope all goes well Cal healing thoughts heading your way. sptmm - i too had ILC and they found it in my right breast with a gammagram. I could not do an MRI and the gammagram was easy.  I had a bmx.  I am home from the hospital after my multitasking surgeries.  I am happy to be done with treatment and very hopeful that every cancer cell in my body has been cut out or killed off so I never have to deal with any treatment again! I am feeling sore but not as bad as coming home from the bmx last july!   Now I have to heal and get started on the arimidex.  Onc said to wait a couple of weeks after surgery to start.  My taste buds are coming back but surgeon that did the gallbladder said no spicy food or alcohol.  I have to call tomorrow and ask for how long cuz i was so planning on mexican food and margueritas! ",
      "MessageIndex": 4417,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 24, 2011 10:53AM zenith4289 wrote: Lizzy - glad to hear you will finish chemo soon.  Hope your se's a minimal this time.  Since my last chemo on dec 23 my taste and appetite has returned.  I still have neuopathy in the fingers and toes and am losing toenails.  My hair is growing back but not on top so I look like Larry David from \"curb your enthusiasm\" if you can imagine him with really short hair!  Male pattern baldness sucks!  It really has to grow back in everywhere or i'm suing someone!  I am returning to work the end of Feb.  Glad to spend these sub zero days inside.  I am so grateful to my DH who takes my little dog outside and shovels a path for him.  Dog prefers grass!  Dog's little feet get soooo cold and I have tried various \"booties\" all of which fall off and/or too hard to get on.  We own a retirement home in Phoenix AZ but I can't retire until 2015 so we just have to endure this cold!  I'm seeing an opthamologist this week as I still have blurry vision in the left eye.  I hope I won't need anything drastic like surgery! To all my aug chemo sisters - It takes time to heal and your recovery is the most important thing.  Healing thoughts to you all.",
      "MessageIndex": 4566,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Feb 13, 2011 10:41AM zenith4289 wrote: Omaz - thanks for the lymphedema list.  I finally got to see a PT who specialized in LE.  She said that a high BMI, infection and injury are the 3 things that are related to getting LE.  While I lost 40 lbs last year I still am considered obese so have to work on getting my BMI lower.  I don't have LE but do have pain in upper arms and chest at night so am going to do PT for awhile. Lizzy sorry to hear about your BIL. Texas - great to hear you are better after your surgery Lady - sorry to hear about your new DX.  When they told me I had a 30% chance of having uterine/ovarian cancer I was scared the path report would come back positive for something but relieved it did not.  I hope they got it all and you don't need any further tx. I am waiting for cataract surgery - hoping not to get sick and have it cancelled.  I preregistered and all for the LE PT but when I got to my first appt.  they tell me they don't take my insurance and want me to sign that I would pay whatever my ins didn't.  Well after traveling 35 miles in bad weather to be there plus all the hassell and wait i went thru for the appt.  i signed.  I found out the next day the insurance won't pay any of it because i have to pay my 250 deductible and the bill was for 240.  However my insurance negotiated with them and now they will accept and i just have to pay my 20 copay for future appts.  It would have been nice if they had told me when i preregistered that they didn't take my insurance and maybe i could have got the negotiations started before hand.  Maybe ambushing me at the 1st appt was the plan??????  Moral - always ASK if they take your insurance and don't assume they do just because they don't say anything at preregistration!",
      "MessageIndex": 4796,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 15, 2011 05:26PM zenith4289 wrote: mommichelle- i read somewhere about chest lymphedema.  i am so afraid of getting LE as i am at risk on both arms.  I learned how to do lymphedema massage.  You might ask for a referral to a le therapist.  I am done with cataract surgeries and will be going back to work this week.  I am having lots of hot flashes on arimidex so not sure if i can stick with it.  my hair is coming back slowly so still have to wear the wig. ",
      "MessageIndex": 5174,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Mar 23, 2011 10:45PM zenith4289 wrote: Lady - Sending healing thoughts your way.",
      "MessageIndex": 5293,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 25, 2010 09:51AM zenith4289 wrote: I am assuming I will start chemo in august.  met with onc friday and recommendation is AC 4 treatments and 12 weeks of taxol.  I need a ct scan, bone scan, mugga test and port placement first.  You could put me down for aug 15 with the question mark.   I plan to shave my head, get a wig, scarves, hats, etc.  I am not a positive person and can't see that changing now. ",
      "MessageIndex": 36,
      "PostDate": "25/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 31, 2010 02:10PM zenith4289 wrote: Today I learned about my drugs (AC + T) and all the nasty side effects that of course they will try to minimize.  Couldn't do the CT scan as they couldn't find a good vein so they want to try on Monday after I get the port.  I had BC in both breasts and had 18 nodes removed on the right and 12 on the left so trying to avoid lymphedema is a nightmare as is trying to explain that I have no \"good\" arm for blood pressure, draws, etc.  They tentatively want to start first infusion on Aug. 5th which is scary early but might as well get it over with.  feeling somewhat healed from surgery.  I don't want to look or feel sick and this more than anything is why i dread the chemo.  my BC didn't make me look or feel sick but now the aftermath will.  my dh keeps referrign to this a a \"mopping up operation\"  I am not sure i like all the war analogies but i went with it and joked that each hair on my body was a soldier who will be sacrificed. sohardbnme - i hope we are both lucky ones with little side effects. ",
      "MessageIndex": 80,
      "PostDate": "31/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 16, 2010 05:37PM zenith4289 wrote: Hi everyone and welcome to the many new ladies!  Are we supposed to NOT use deodorant and/or antiperspirants?  I broke down and used my old antipersperant today as I just couldn't stand it anymore.  Washing and cornstarch just doesn't cut it.  I am not having radiation.  I can call the Onc's office tomorrow but thought i'd see what everyone else is doing too.  there is nothing in writing that the office gave me saying not to use it.",
      "MessageIndex": 539,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 22, 2010 03:14AM zenith4289 wrote: LIZZYMACK1 I will still be doing chem in dec as i have taxol x12 after the AC.  second AC is coming up this thursday.  NP told me yesterday I was losing too much weight.  This is the first time ANY medical professional told me that!!  I should have asked her to put it in writing, sign and date it so I could frame it!! ",
      "MessageIndex": 772,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 26, 2010 08:53AM zenith4289 wrote: KIMMIE68 -  I am doing ACx4 then taxol x12.  SE's for the first round - severe back pain on day 3 (newlasta shot probably) but it was ok on day 4,  1 bout each day day 3 and 4 of nausea and vomiting.  I was on a trial so I don't know what they gave me for nausea.  for the next treatments i have ativan, compazine and emend.  bit a nausea on days 11,12,13 but ativan under the tongue stopped that.  Diareahea day 13.  one or two mouth sores that seem to have gone away.  dry eyes and blurry vision day 9 and 10 - ok now if i constantly use artificial tears.  The first access to the port was painful but i hadn't really known where it was and didn't hit it good with the emla cream before hand.  not so bad when accessed for blood test last friday.  2nd round in the ring with the red devil is tomorrow.  Now tell me about Taxol?  Welcome to the group.",
      "MessageIndex": 922,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 26, 2010 05:51PM zenith4289 wrote: CKPTRY - I hope you are doing better.  I am so sorry for your 5 year old.  Do you have a counselor for him?  Does your oncology office have a social worker?   It might  help to let him discuss this with a professional - I know just one more expense - but maybe ACS can help?  I was completely discouraged on day 3 of my first tx with back pain so bad i stayed in bed or the lazy boy.  it went away on day 4 and that was the worst SE.  2nd was today and i am drinking water as much as possible.  hugs, zenith.",
      "MessageIndex": 954,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 31, 2010 08:15AM zenith4289 wrote:",
      "MessageIndex": 1106,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 1, 2010 11:26AM zenith4289 wrote: WHERRIA - today I put a pencil in the refrigerator.  Now I might have done this before BC and Chemo but now I can blame it on chemo brain.  Great story about the extra clothing! ",
      "MessageIndex": 1140,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 4, 2010 11:03PM zenith4289 wrote: LIZZY - so sorry you have to wait again.  GINGERBREW hope you have having a nice weekend with the granddaughter!!  My WBC was low so I was told to stay away from crowds and sick people so I am pretty much housebound this weekend.  Don't want to get sick though.  I was also told my \"baby\" WBC was low too!  Didn't know there were babies!  CKPTY thanks for sharing your father's story. ",
      "MessageIndex": 1303,
      "PostDate": "04/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 6, 2010 03:17AM zenith4289 wrote: I spent 5 hours in the ER last night since my WBC was low on Friday and I had a fever last night.  They couldn't find the source of infection but sent me home with cipro.  Does anyone have an opionion about if my onc will cancel Thursday's infusion because of this?  I am fine now.  Fever down but finding it hard to take cipro 2 hours befor or 6 hours after dairy products!  happy birthday zacksmom!",
      "MessageIndex": 1338,
      "PostDate": "06/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 8, 2010 07:27AM zenith4289 wrote: I am feeling better and the fever didn't come back.  Not real sure where the infection is/was but still on cipro.  Called onc today and if I continue to be well I will get the third AC this thursday.  they do a blood test first.  Hard to get protein in when the window for dairy while on cipro is only 8 hours a day!  I am watching reruns of \"sex and the city\" on TBS and of course they are on the story line where samantha gets breast cancer.  Makes me cry a little but of course they don't get into anything too heavily. ",
      "MessageIndex": 1399,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Sep 30, 2010 05:55PM zenith4289 wrote: Port pain - the side where my port is and my shoulder have been really aching lately.  I had to take a pain med last night.  I talked with the chemo nurse today and it was hurting after she accessed it.  She couldn't see any sign of infection.  She send me for a dye test to make sure it was working properly and it was.  Curiously now that the infusion is over it feels better so it could be anxiety or it could be pain from surgery too.  I can't wait to get it out but know I need it to prevent lymphedema.",
      "MessageIndex": 2101,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 8, 2010 06:20PM - edited Oct 8, 2010 06:23PM by zenith4289",
      "MessageIndex": 2289,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 15, 2010 10:59PM zenith4289 wrote: During my 1st Taxol tx today I had an allergic reaction.  No breathing problem just redness in my face, neck, shoulders and  a hot flash.  Onc decided to stop the treatment and try taxotere starting next Friday.  Now that puts my end date in Janurary :( :(.  I forgot to ask what happens if I am allergic to taxotere?  Anybody have a clue?",
      "MessageIndex": 2425,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Oct 22, 2010 10:19PM zenith4289 wrote: Started taxotere today.  Will have 4 tx 3 weeks apart.  Have to have newlasta :(.  Had facial flushing reaction at the very end of infusion today and have had a bit of facial flushing tonight.  Didn't have time yesterday to take the decadron correctly.  Hopefully next tx will not have any reaction.  I should be done by Xmas!  Rads are not being recommended at this time.  With the change to 4 TX I am now more than halfway done!",
      "MessageIndex": 2559,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 7, 2010 10:12PM zenith4289 wrote: Calamtykel - I saw the NP and the onc last monday.  I went to get a blood draw first and they told me they have a new policy that because of increased risk of infection with increased access to ports they would not do blood draws through ports unless patients specifically request this.  Even though I am at risk for lymphedema on both arms i let them draw from my hand because I couldn't find my emla cream at home and it has to be put on 1 hour before access.  My last infusion was painful as the nurse had trouble accessing the port.  When I see the NP tomorrow I will ask for a blood draw through the port because lymphedema scares me more.  I found the emla.  Sorry to gross anyone out but has anyone had an infection under their toenail after getting the taxotere?  I noticed an infection friday night under the big toenail and ALL the skin on my toe peeled off almost in one piece like peeling an egg!  UGH!  Wherria thanks for the lymphedema info.  My BS was supposed to refer me to an education group and they still haven't so I will call and bug them starting monday.  Second taxotere is scheduled for Friday.  Onc is reducing it by 20% because of my side effects and allergic reactions.  I am still very apprehensive about it! Wish I could afford a housekeeper because DH has been doing most of the heavy lifting around here and he is still sick with a cold and cough.  Friends came over Friday so that meant Thursday we had to do some cleaning and neither of us were in the mood.  On weight - I lost 30 lbs since DX and last monday i had lost another 8 because this taxotere makes everything including water taste horrible for the first week!  My appetite has improved so i think i've gained.  good luck to everyone having tx this week!",
      "MessageIndex": 2965,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 10, 2010 09:09AM zenith4289 wrote: Texas, Lisa, Lizzy, sptmm, and iowa your strength and humor are an inspiration.  I am on the \"good\" week before tx #2 this Friday.  Toes and fingers still hurt some but antibiotics cleared the infection.  Saw my surgeon for the hysterectomy this week and we scheduled it for Jan. 25th.  If all goes well i should be able to go back to work by march 1.  Never thought i'd look forward to that but I do.  If i can just stay healthy so chemo #3 and 4 aren't delayed!  My mom is having surgery next week and will be in hospital overnight.  I hope she has no complications and that this exploratory surgery takes care of the pain she has had (it is probably a hernia).  Sohard - love your picture!",
      "MessageIndex": 3021,
      "PostDate": "10/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 16, 2010 03:04PM zenith4289 wrote: SE's from taxotere are way worse than with A/C!  My legs and joints ache.  I am doing neulasta too but didn't have this bad pain with the A/C.  Constantly taking oxy and tylenol.  Found out that I can drink mint or lemon tea but water and just about everything else tastes poisionous.  Salt tastes VERY WEIRD so I've stopped using it.  I feel bad that I can't walk like I should but my lap dog doesn't seem to mind.  He is getting to be so lazy.......  I hope I am a little better tomorrow as i'll be in the hospital with my mom.  Hot flashes and cold sweats at night.  Fatigue......  Xmas eve can't come soon enough.  Gonna go pay some bills online now b4 i forget.",
      "MessageIndex": 3149,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 2, 2010 10:39PM zenith4289 wrote: I can't figure out how to add my diagnoses. ",
      "MessageIndex": 83,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 6, 2010 07:13PM zenith4289 wrote: does anyone know how long to expect the surgery for bmx with sentinel node biopsy to last?  I plan to call my bs tomorrow but thought i'd get some idea so i could tell my mom tonight.  she went with me to get post surgery camisole last week.  30 + years ago we were shopping for my wedding dress.  i am glad she and my groom are still around.",
      "MessageIndex": 136,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 7, 2010 08:08AM zenith4289 wrote: Have been getting many cards, emails, and well wishes.  One card I am reading over and over \"what lies behind us and what lies before us are tiny matters compared to what lies within us.\" - emerson.  wishing all the luck and strength in the world to this reluctant sorority.",
      "MessageIndex": 147,
      "PostDate": "07/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 9, 2010 01:48PM zenith4289 wrote: surgery is over.  some pain under arms.  more anxiety as nodes on both sides were positive and i have to do chemo.  node shots were not painful.  dr said he just started using lidocane inthe shots 2 months ago. still in hospital probably out tomorrow.  still have to learn drains. ",
      "MessageIndex": 185,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 12, 2010 01:12PM zenith4289 wrote: sepsebadger so sorry to hear of your dad's passing.  I can't imagine getting thru surgery with other family members terminally ill.  When I piss and moan i can think of all the other people on this site and others who have elderly parents or small children to deal with.  Many people have little or no support either.  hope all goes well for you today. ",
      "MessageIndex": 222,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 17, 2010 04:29PM zenith4289 wrote: Drains out yesterday - yeah it hurt from a 3 to a 6 scale.  VERY glad to get them out though.  Only 2 nodes on right and 1 on left were positive.  Still have to do chemo.  Meet with Onc. next friday.  BS said I would probably have to have a port (one day surgery and I will not be awake for this) and will probably lose my hair.  More tests to see if it has spread - bone scan and CT scan.  I'm somewhat worried my osteoarthritis in the knees might be cancer and hope the bone scan can clear the doubt.  BS said tumors in both breasts were probably stage 2.  Still some pain under arms and in arms.  have to take percocet every once in awhile.  The chemo will delay my hysterectomy - don't know how long - BS said she's giving my employer a return to work date of Feb 1.  I hope it won't take that long but I know I can't do my job during chemo (though i know some people do continue to work)  I can't do my job and have a compromised immune system.  feeling better and am planning to go out.  will wear my cami with the fiberfill.  wore it yesterday and it was ok.  katherineNaomi thanks for the node positive links.  good luck to all who are having surgery later this month.  One tip - don't know where i found it - but instead of pinning the drains to your shirt or gown tie a robe belt around your waist, pin them to it and put your shirt or gown on over that.  not attractive for out of the house (what is?) but works well at home.",
      "MessageIndex": 270,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 3, 2010 08:13PM zenith4289 wrote: anyone else having horrific port pain and pain in the nect and shoulder on the port side? ",
      "MessageIndex": 121,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Aug 16, 2010 08:20AM zenith4289 wrote: on my fourth day, first treatment.  backache kept me in bed yesterday.  still sore today but getting around.  resolve to walk on treadmill is out as  i can't manage the stairs in this disability unfriendly house of ours.  some nausea but not really wanting to eat.  I can't imagine doing this and working and taking care of children.  I am on medical leave until feburary and my children are grown.  I want to live to see a grandchild and retire to our house in scottsdale az.  getting my hair buzzed next friday.  have 3 wigs, some hats, not scarves as i could never learn to tie one as an accessory and don't want to end up with something else to cry about. ",
      "MessageIndex": 486,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 11, 2010 12:06PM zenith4289 wrote: the camisole with drain holders is extremely useless.  glad my insurance paide for it 100 %.  does anyone who makes these things actually look at a post surgical paitien with 4 drains?  can probalby use it after drains are out.  just pinning them to gown now.  i forgot a case for my glasses.  dh was able to protect them somehow in his backpack so they didn't come back scratched. some lady was on my same floor screaming for help 24/7.  heard she was dying so the earplugs and mp3 player plus ambien and ativan really helped.  felt like i was in a bad nursing home as the hospital gown didn't fit.  toilet was not high enough for someone with knee oa and the comode was not big enough either.  i know i am overweight but hey they do gastric bypass at this hospital and should have had size friendly gowns and comodes.  nurse seemed overwhelmed and complained about being kept overtime.  she seemed put out that we wanted training on how to do the drains!  acs info came in the mail and there was info in there about arm exercises.  guess the hospital doesn't think it's important to know.  i just know i'm going to have to fight my dr office for a decent appointment, get the drains out and get the chemo going.  my surgeon was late for surgery and i overheard nurses saying that she was going to be 10 minutes late but \"you know \"smith's (not her real name) time is different from realy time.\"  she was 40 minutes late.",
      "MessageIndex": 207,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jun 27, 2010 06:28PM zenith4289 wrote: sespebadger and in_cognito - thanks for the info.   i am supposed to be at the hospital at 7 am and surgery is scheduled for 1130 so to me that says they are planning to inject the tracer shots 1st and wait a couple of hours.  I faxed questions to my BS and they are well aware I want answers about this.  I will check out the newbie thread.  I did a gammagram instead of a mri because i couldn't tolerate the stupid table (not sure I could have done the closed mri anyway) which was like lying on a bbq grate.  i know some women say the tracer shots were not bad and i tolerated the core biopsies - i just want to know what they are planning and I will refuse to go ahead if they don't use lidocaine.",
      "MessageIndex": 41,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 4, 2011 10:01PM zenith4289 wrote: Hi all - I can't keep up with this group since starting back to work in march my computer time has vastly decreaced and I still haven't upped the exercise time, which I HAVE to do.  Hair is still butch short - I hear you Lizzy!!! It is too short to do anything but too long now to go for a spikey look!  Also I am too old to pull off the really short looks that look so good on the movie stars.  I need a few more inches!!  I woke up with a bruise and knot on my forehead a few days ago and don't remember anything about how i got it!  Don't know if I should blame the ambien, arimidex or gabapentin.  Another gift from chemo is neuopathy in fingetips that is painful at times.  Onc just says \"well I told you that could happen\"  Well gonna go enjoy what I can of this day.  I'm on liquid diet and laxatives for a colonoscopy tomorrow - just routine as i had one 10 years ago but my mom did have a malignant polup over 10 years ago.  Lady - wishing you well as you finish up your chemo.",
      "MessageIndex": 6366,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 24, 2011 12:18PM zenith4289 wrote: Hi everyone.  I am sorry I don't keep up and post anymore.  thot i would today cuz i year ago today i finished chemo.  I have enough hair now even tho it is different - straight and fine on top- very curly in the back.  toenails are not quite back to normal.  my right eye has been going blurry on me on and off since july.  i have been through evey test known to modern medicine and no major problem but no cure either.  my second opthmalogist just says my eyes are dry.....but none of his suggestions for that are helping.   i am discouraged and typing this with my right eye closed as it is blurry today.  still pain in former port area.  pt said it could take 3 years or more for the nerves to recover.  read a few random posts and seems like y'all are doing fine.  hot flashes from arimidex drive me crazy as well as the joint pain.  On the positive side I have no recurrence, no mets so just have to keep taking a little pill for 4 more years.  back to work, making money....oh and i may be a grandmother next year!!!  merry christmas and happy new year to all of you!",
      "MessageIndex": 7415,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Nov 28, 2010 12:56PM zenith4289 wrote: I'm still lurking around mostly reading all the posts!  JSW I too am somewhat jealous of those whose chemo is ending or has ended!  This taxotere every 3 weeks is too much waiting but it does take about 1 1/2 weeks for the worst of the SE's to end.  I hate everything tasting like bug spray and of course the pain and neuropathy.  Has anyone had skin peeling from one or both feet?  My toes are very sore from neuropathy, nail changes and skin peeling!   Yeah I can relate to whomever said they are at the end but looking more like a cancer patient because of the eyebrow/eyelash loss.  I never used to like to see women with drawn on eyebrows but now I am doing it.  I bot stencils.  I guess the LGFB class didn't really help me because I look bad and feel worse.  I did buy glue on eyebrows and they were a joke!  the glue is white like elmers and if you get too much they you have to try to remove it then that part of the brow is loose - what a hassel!  I have #3 of 4 taxotere scheduled this friday and was just realizing that #4 would fall on xmas eve and with xmas being saturday i'm sure the onc office will be closed that friday and maybe thursday!  I don't want to wait another week to get #4 in so i'm calling 1st thing monday to see if i can't get it done on wed. also waiting on bone scan results.  in aug 2 radiologists said my rib spot was probably an old fracture but wanted to redo the scan in 3 months.  waiting waiting waiting...... my mom had her hernia surgery and is on the mend though very slow.  I took her home last week and started having chills and a fever, lots of fatigue so I don't know who was feeling worse!!! well ok enough of the pity party.  glad everyone seems to have had a nice thanksgiving.  Ours was small and quiet - just the way i like it!",
      "MessageIndex": 3406,
      "PostDate": "28/11/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 25, 2010 11:43PM zenith4289 wrote: Hope everyone is having an good Christmas!  Since my taste buds are out of whack we're just doing a deli tray at my mom's with plenty of citrus and yogurt for me!  We don't decorate for the holidays anymore as we are not Christian but used to when the kids were young.  We used to go out for chinese on xmas eve and then through the park lights and when we got home \"Santa\" had already been to our house!  Mom decorates and gets into the spirit.  TEXAS - how did the soup eventually turn out?  I know I couldn't cook anything and know how it actually tasted right now.  Made chicken salads yesterday and guys ate them - seemed to like them but for me the chicken, lettuce, tomatoes, dressing, croutons all tasted weird.  Oh well, I am planning a night out to a good restaurant in about 3 weeks!",
      "MessageIndex": 3973,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Dec 31, 2010 01:12AM zenith4289 wrote: Spent a loooong day at pretesting.  They started turning people away as they had overbooked but I was glad to stay until 6 PM to get everything done.  Maybe my complaining to the hospital administer after my july surgery had something to do with it but everything got done.  I now have two surgeons on board to do 3 surgeries on 1/11/11 (auspicious date?)  I will have a hysterectomy (with ovaries), gallbaldder removal and port removal!  I feel like with the bmx, the hysterectomy and arimidex that I am actually doing a sex change operation that I never wanted!  Lizzy any word on your last tx?  hope it is soon.",
      "MessageIndex": 4060,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 5, 2011 12:55PM zenith4289 wrote: Sweeney - Thank you so much for your kind reply.  Thanks to all for your understanding.   Calamtykl - Glad to hear you have some good news and as always thanks for your information.  I have learned a lot from your posts. Lizzy - I get hungry but don't really want to eat anything because it still tastes bad - especially if it has salt and I am almost 2 weeks away from my last chemo.  I have eaten a lot of yogurt as it's taste hasn't changed.  I have an adversion to soup as this was my first food after chemo and I had vomitting with the first chemo.  I force myself to eat protein.  Cottage cheese doesn't taste good but I force myself to eat some.  Oranges and clementines are the best!  Lemon or mint tea instead of water are ok.  I force myself to eat an egg for breatfast with toast.  I can't wait for food to taste better and to eat hot spicy food again!  I have avoided my favorite mexican and indian foods because of the mouth sore problem but plan a trip to a new camboian restaurant in the near future.",
      "MessageIndex": 4205,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jan 24, 2011 10:56AM zenith4289 wrote: Lizzy thanks for the info on tamoxifin and raloxifene.  I haven't started arimidex yet. ",
      "MessageIndex": 4567,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 30, 2010 09:02AM - edited Jul 30, 2010 09:12AM by zenith4289 I had a mugga test today and should have taken ativan beforehand as it was somewhat claustrophobic. I hope the short time i was trying to squelch my sobs didn't ruin the scan.   ct scan tomorrow.  port placement on monday then bone scan on tuesday.  this is happinging way too fast.  Got a free wig today and it is horrible.  Will call the wig shop tomorrow and pay for something better.  meeting with NP tomorrow for \"chemo teach\" so better go make a list of questions to ask. ",
      "MessageIndex": 63,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/755208",
      "Title": "August 2010...anyone starting chemo besides me?! 1WonderWoman 1WonderWoman"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jun 29, 2010 09:40PM zenith4289 wrote: Found out today the tracer shots will have lidocaine.  Nurse went from \"oh it doesn't hurt\" to finding out at my insistance that yes indeed it is painful and they will do topical lidocaine and lidocaine with the tracer shots.  It doesn't hurt to ask and insist. ",
      "MessageIndex": 53,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 4, 2010 07:01PM - edited Jul 4, 2010 07:20PM by zenith4289 Having a better day today.  I tried to sleep without ambien Friday night and only got in about 4 hours so hence the bad day and pain Saturday.  today was better.  will try to kick the ambien habit after all this is over.  34 years ago my mom helped me shop for a wedding dress.  Wednesday she went with me to shop for a post mastectomy camisole.  Glad she's still with me anyway and I am married to the same guy.   My BS never told me my cancer stage (but i never asked)  the pathology report says there's no evidence of lymphatic involvement.  I have cd's of my mammo and gamma gram.  the gamma gram has software that lets you measure the tumor.  i measured the largest one at 1.3 inches or 3.3 cm.  the pathology reports said 7 mm but the doctor did say that was probably not accurate.  I'll know for sure after the surgery if there is node involvement.  Is anyone having more than a sentinel biopsy?  I'm am assuming the surgeon will ask permission before surgery to remove more lymph nodes if the sentinel has some cancer.  Has anyone decided if they will sign for this and what helped you decide? ",
      "MessageIndex": 99,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 4, 2010 07:15PM zenith4289 wrote:",
      "MessageIndex": 100,
      "PostDate": "04/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 11, 2010 11:50AM zenith4289 wrote: SEPSEBADGER:  so where can i find info on what new hell awaits me with the chemo?  so far all i get is hope then a kick in the gut from my surgeon and doctors so i expect they'll be telling me i'm stage 4 with not much hope anyway.  wish they'd stop blowing sunshine up my dress. ",
      "MessageIndex": 206,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jun 25, 2010 07:18PM - edited Jun 25, 2010 08:17PM by zenith4289 My date is July 8.  BMX no recon.  Met with prothesis fitter today for a post surgical camisole.  Glad I have organizational skills because I also have to have a complete hysterectomy as soon as I am able for a precancerous condition. ",
      "MessageIndex": 27,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jun 27, 2010 06:40PM zenith4289 wrote: hi scrabblelady, i too have been married 30 + years and my husband is so supportive.  he's getting a taste of what it will be like now as arthritis has really flared in my knees and i can barely walk so he has to do a lot of housework and running for me.  i too am on the verge of crying almost all the time.  had a meltdown with my adult son who i think was just teasing me this morning.  so yeah, trying to stay postive with all the support in the world doesn't prevent the crying jags so guess we'll just have to go with the flow.",
      "MessageIndex": 42,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 3, 2010 07:01PM - edited Jul 3, 2010 07:07PM by zenith4289 Went shopping today for things needed after surgery and to take to the hospital.  Since my DX I became temporarily (I hope) disabled with arthritis and am walking with a cane.  Can't do many things I could do just 2.5 months ago so am depressed and having a hard time coping.  Have to have a complete hysterectomy as soon as possile after BC surgery due to a precancerous condition.  Will also have gallbladder surgery with the hysterectomy.  Trying to cope with 4 medical conditions all at once is just too much.  Having to do the disability and FMLA paperwork for the disabiling conditions is way too much.  Juggling three surgeons and a gynecologist is too much.  Oh yeah, and I just got info that my job may be offerring a early retirement incentive to persons over 50 and I have to decide by Dec. 1!!  DH is taking on a whole lot.  He always has a positive attitude but sometimes it's irritating. ",
      "MessageIndex": 92,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 11, 2010 07:16PM zenith4289 wrote: sespebadger thanks for your posts and info.  i did get the \"exercises ater breast surgery\" from acs in the mail.  i hope i don't have to wait long for my next bs appointment and the path report.  i just want to know how they are going to tell if this has metastised to the bones, liver or brain.  Will a ct scan tell?  i can't seem to find anything on this site about that or on the web.  thanks for taking the time out to answer me on what i know is a very emotional day.  I know I am not the only one with multiple problems and am sorry to hear about your folks.  My mom seems ok but has refused to go to a doctor for the last 4 years so i worry about what is actualy going on with her but hey i can't do much to help her now if she were to deterioriate rapidly from something.  I just feel like i'm getting the shaft from my doctor and hospital and regretting not taking extra time to find a second opinion and surgeon.   If any of you july ladies are a size 2x or above INSIST they have gowns, wheelchairs, comodes, etc that will work for you BEFORE you check in. ",
      "MessageIndex": 213,
      "PostDate": "11/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jul 19, 2010 10:15AM zenith4289 wrote: calamtykel - I had lymph nodes removed on both sides and it is still painful under the arms and when raising my arms or reaching down for something.  I am doing some minimum exercises, taking percocet, tylenonl, and celebrex.  (arthritis dx b4 bc dx).  when it gets too painful i rest with cold compresses under both arms.  At night I have been taking ambien cr and it never fails to get me to sleep and to stay asleep for at least 7 hours.  Percocet just makes me a little drowsy and never gets me to sleep.  I hope your pain subsides soon.  I don't have the rug burn sensation but am still numb on the left. ",
      "MessageIndex": 282,
      "PostDate": "19/07/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    },
    {
      "AuthorID": "zenith4289",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/104077/profile",
      "Content": "Jun 27, 2010 01:59PM - edited Jun 27, 2010 02:00PM by zenith4289 I am worried about the tracer shots with the sentinel node biopsy.  Described elsewhere as excruciatingly painful.  My PS said she would do a sentinel node biopsy on each side and remove one node but she didn't tell me i'd have to get shot up with radioactive material and dye before the surgery to do this.  Nor did she say anything about what they would do for the pain - if anything.  I had my husband call the office to ask about this and PS is on vacation.  I go for preop next week and will bring it up then.   Also I am very confused with all the acronyms on this site - PS, BS, etc.  i think i understand some of them but is there a dictionary somewhere?  also what is all this i read about having wires inserted in the tumor without anesthesia?  is that just for lumpectomy?",
      "MessageIndex": 35,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/753998",
      "Title": "JULY MASTECTOMY orchidgal rosesrx"
    }
  ]
}