{
  "AuthorID": "Zgirl66",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141011/profile",
  "Posts": [
    {
      "AuthorID": "Zgirl66",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141011/profile",
      "Content": "May 26, 2012 11:47PM Zgirl66 wrote: I feel exactly the same way. I took a pain pill last night. Still have been given no script just samples. Nothing soothes. Now have open red raw skin. My shirt sticks to my body. Given cool packs that help for a few minutes. Sooooooooooooo uncomfortable. Have 11 more and just do not want to go back next week.",
      "MessageIndex": 96,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/777460",
      "Title": "\"Easy\" part of treatment? MY A**! BlueCowgirl Tazzy"
    },
    {
      "AuthorID": "Zgirl66",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141011/profile",
      "Content": "Jun 23, 2012 07:02AM Zgirl66 wrote: Babette54 good luck! I just finished 6/12. Apply proper moisturizing creams early and often. I had very tough time finding anything that worked well, but think I'm exception. I used iPod to block sounds which relaxed me and allowed me to get my head out of room. Be strong! This too shall pass.",
      "MessageIndex": 6,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/789386",
      "Title": "July 2012 Radiation Belinda977 graced"
    },
    {
      "AuthorID": "Zgirl66",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141011/profile",
      "Content": "Dec 12, 2011 01:58PM Zgirl66 wrote: Thank you Rock. Funny, those are a lot of the things I've been craving. I've had one chemo (T/AC on 12/6). I would like to hear from those farther along. I realize everyone is different, but I would like to have an idea of whether my first reaction to chemo and shot (two days later to increase blood cell count) will simply repeat, or if side effects worsen as you go along. I felt worse after the shot than the actual chemo treatment, but I understand it takes a while to get into your system. I will have six cycles every three weeks, then radiation. Anyone care to share. My greatest issue right now is the UNKNOWN. I hate not knowing what is going to happen. Will I have energy or fall into a black hole of fatigue at any moment?",
      "MessageIndex": 719,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/706846",
      "Title": "More Tips (and a Shopping List) for Getting Through Chemo rock MinusTwo"
    },
    {
      "AuthorID": "Zgirl66",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/141011/profile",
      "Content": "Apr 8, 2012 08:36PM Zgirl66 wrote: I am sorry. I have 4 sisters, one is a 10 year breast cancer survivor. I can only imagine how deeply sad you feel.",
      "MessageIndex": 63,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785463",
      "Title": "My Sister Passed Away Tonight Curlylocks kaycancer"
    }
  ]
}