{
  "AuthorID": "zinny",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
  "Posts": [
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 8, 2015 06:00PM - edited Dec 8, 2015 06:02PM by zinny Hi folks - dropping in from the fall group on my last day of rads - I have had bilateral lumpectomies and had right sided radiation to axillary, cervical and thoracic lymph nodes, as well as right breast. Wanted to show you how things look for me at the end of treatment. The picture is a little forgiving, in real life, it is a little more red ( especially after a hot flash or a good laugh or a moment of child induced frustration). Wishing you all well!  Oh, btw, My shoulder looks lightly sunburned as well.  \"Wooohooo. Done rads!! Bit anticlimactic, really. I have been lucky to have the skin sparing approach as I still have a BMX and recon to go, and other than a bit of itch, my skin is holding up well. My last three treatments were boosts, so the most irritated bits are now 5 days since treatment, and if things max out at day 10, I hope things will be ok. Hope this is helpful to the newbies, to see some of the milder outcomes.\" ",
      "MessageIndex": 167,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Oct 3, 2015 02:41AM zinny wrote: Hello all. Wheee...have a treatment plan! Will start rads in a couple of weeks, start Goserlin next week. I might be an elbows out sweaty witch just in time for Halloween. Have tried to think positive on the rads til now, but seeing all of your pics and hearing your stories makes me feel like a bit more caution is in order, though hopefully my protocol ( 28 treatments so that I can have BMX post) is gentler... ",
      "MessageIndex": 578,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Oct 30, 2015 01:30AM zinny wrote: Hi all - congrats to the finishers! love the sticker, Keys. I have the F-cancer Embrace Life Bracelet too, and I wear it every day, and it reminds me that I am powerful! Especially killing it on the elliptical with sweat pouring off my menopausing body! Started rads today - one down, 27 to go!!! Surprised to feel a little tender here and there on that side already. Weird, our centre doesn't care about aluminum or anything in your deodorant, and is vague on post Rx topical treatments - so much variation! They only suggested I avoid lotions with ***SPARKLES*** What shall I do? ;) Thanks for all being here as a resource and wealth of information.",
      "MessageIndex": 1243,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Oct 30, 2015 12:18PM zinny wrote: Georgie - sorry to hear you are so isolated - at least it is good that you can log in and virtual visit with us. You and I are the same start day. Espanola too. Go warriors, we are stronger than this thing! Bought some Aveeno moisturizer, now looking at all of your posts and obsessing over my need for calendula... now I can spend the next hour reading what you all said was the best ;) Hard morning. Picked up my Letrozole. Didn't think it would feel emotional to take that first pill, but ooof there it is! Oh well, down the hatch, bye bye Estrogen. AND BYE BYE bad cells.... Rainyc, I am with you on a therapeutic vacation - if you find that insurance clause, let me know ASAP! Dreaming of Italy...",
      "MessageIndex": 1252,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 6, 2015 06:05PM zinny wrote: wooohooo. 7/28 done:) 1/4 of the way there. This slow going protocol is good so far - not expecting S/E for a week. ",
      "MessageIndex": 1404,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 23, 2015 05:50PM zinny wrote: Hi all - congrats to those who have charged or limped over their finish line! Well done! Hooray! I have had a complicated week as my pathology has been reread and once I am done rads, i am going to start chemo. Crazy. So, I have a question for those still following who are done - I have now had 17/28 rads and I only have the tiniest bit of itchiness on my upper back. I am really hoping to go skiing just before Christmas, and was trying to book a trip. The first day would be 9 days after my rads are done. Am I crazy? Can I guess that if my skin is good so far, I should be ok. I do have a high pain tolerance and pretty tough skin. I ran 10k the other day, and my energy is still good - appreciate your thoughts.  Also, re the nausea - I was super nauseated at the 14 treatment mark. I got into a pattern of nausea, not eating, more nausea - also taking letrozole, could have been that, also metformin, could be that too, and calcium et. Once I made sure I ate regularly and was more aggressive with drinking water, it has been much much better.",
      "MessageIndex": 1760,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 25, 2015 12:26AM zinny wrote: Dreaming of Italy:) Congrats on being done, Sandy!  ",
      "MessageIndex": 1793,
      "PostDate": "25/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 1, 2015 04:46PM zinny wrote: Hello lovely ladies:) Keeping up with you but not posting much these days. Cheating on you all with the chemo forums too, now that that is in my future;) Today was #22 of 28, the last 3 being boosts - Getting close! Just getting itchy and pink this week. Being more fastidious with the Aveeno lotion, which is what I was recommended. Seems like getting my heart rate up and sweating every day or so is helping keep my energy up. And my spirits. Since many of you have been down the chemo path, what are your thoughts on buying wigs? I have looked at the wigs page, but those people feel like strangers, *laugh. I have a large head, selection is limited in the shop at the agency, can't go hat/bald as my little boy is really afraid of me being bald - poor love can't look at me after a drastic haircut in \"real\" life. Going to try the cold caps but not sure that with ddAC/T it will work well enough - guess we will see!",
      "MessageIndex": 1851,
      "PostDate": "01/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 1, 2015 04:54PM zinny wrote: Thanks Trvler!    ",
      "MessageIndex": 1853,
      "PostDate": "01/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 1, 2015 05:45PM zinny wrote: Thanks rainyc:)",
      "MessageIndex": 1855,
      "PostDate": "01/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 13, 2015 12:51AM zinny wrote: Bon Voyage, ChiSandy! For all who are dealing with LE, I happened to find a great video on how to do massage/drainage yourself. I had a vaccine on my non-radiated but had lx and node bx side, and my arm got tight and felt like the cording was returning…but i also had a birthday, drank more red wine, ate more salt and exercised less for a few days;) anyhow, it went away, but I did try the massage. Not going to hurt! Lymphedema massage video",
      "MessageIndex": 2029,
      "PostDate": "13/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 1, 2015 03:31PM zinny wrote: Sloan - Riverdance! Awesome geeky. These days, I am trying to do things that give me joy. Because that's really what it is all about :) So I say go for it, and if you don't feel like sitting through the whole show, then leave partway through, but go for it. And, yeah, ask DH to drive. And do Gentleman's Guide in January:) ",
      "MessageIndex": 1277,
      "PostDate": "01/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 3, 2015 02:29PM zinny wrote: Hi ladies! Congrats to the finishers, Sloan and almost Molly. I can see the finish line! Today is last regular one before 3 boosts and I am done. Creative Vintage, I was exhausted for a day 2 weeks in, and realized I was not drinking enough - water, that is;) Make sure to stay really hydrated. Also, I wasn't interested in eating, and I think got behind on my food. Starting my morning with a third of a can of Rumble seemed to help. And, counterintuitively, do a little exercise that gets your blood pumping - seems to help me, anyhow. Anxiety and worry. I, too, get down if I come on here too much. It's a catch-22 of support and anxiety induction. When I am getting more tense, I visit less and meditate and walk more. A very good friend, good enough that she could say this, said to me \"You are not dying.\" It might be harsh, but if you stop and think about it, and really examine your fears, it helps. It sure helped me. Because ultimately, that is our fear, isn't it, that it either we can't get rid of it, or it will come back, and we will die from this. But, we are not dying now, we are nowhere close to dying, we are a very long way from that. What we are doing is living. So, live your best life right now. Save worrying about the scarier stuff for when it is time, which is likely to be a very long time away from now. It also helped me be less irritable with my kids, because if what I fear most is my/their loss, it puts a new perspective on how upset to get about those dirty socks/uncleared dishes/cranky responses. That's it for my deep thoughts today. Hugs to all. ",
      "MessageIndex": 1896,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 8, 2015 03:52PM zinny wrote: Wooohooo. Done rads!! Bit anticlimactic, really. I have been lucky to have the skin sparing approach as I still have a BMX and recon to go, and other than a bit of itch, my skin is holding up well. My last three treatments were boosts, so the most irritated bits are now 5 days since treatment, and if things max out at day 10, I hope things will be ok. Hope this is helpful to the newbies, to see some of the milder outcomes. ",
      "MessageIndex": 1963,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 9, 2015 12:27PM zinny wrote: Outrunning, you rock star! Even feeling exhausted, you knocked it out of the park. Creative Vintage, lots of people don't have the bad side effects in the pictures - I am just back from #8 of 28, and honestly, I question if the machine is even working because there is no difference at all between the sides. That being said, I am doing the tissue sparing longer cycle so that I heal better when I have my mastectomy/recon, so they are being gentle with me, and predict my s/e to show upon another week, but they are expected to be mild. The actual rad treatment is like getting a fancy Xray with a bit of noise like an MRI machine - mine treats three lymph node areas and the whole breast and takes 5 minutes. I read all of this stuff and got all stressed and spent a bunch of money buying creams on Amazon…and then when I went for my sim, they gave me very specific instructions to use only water based unscented creams like the Aveeno one, to avoid anything with petrolatum, and that there was no evidence that Aloe made any difference…so, I suggest not worrying/preparing too much in advance! Itchers ( thankfully no one's name!) Benadryl is only one of many antihistamines. It is the quickest acting, which is why people chose it first, but causes way more sleepiness than all of the new \"2nd/3rd generation\" ones. Ask your doctor/pharmacist/NP for the non drowsy alternatives - some are OTC and some are prescription - some people have mentioned Atarax ( prescription) which is usually very effective, there are a bunch of others like Reactine which work, too.",
      "MessageIndex": 1435,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 23, 2015 05:57PM zinny wrote: Hi Molly - so, my insurance included a second opinion that was done by Dana-Farber. I had a 5 cm mass of DCIS with LCIS mixed in, and and ILC in the middle of that. I had two independent path reports here which felt that the DCIS was not invasive, but the Harvard folks disagreed. The got more blocks of tissue ( in addition to the 152 slides already done) and saw more stuff, I guess. Our team said that year ago, they would have given chemo for ILC but that now the feeling was there was no added benefit with micromets, and so we went for aggressive hormones and radiation. I was very \"for\" chemo and they would have given it if I had asked, but the oncotype quoted worse outcomes with chemo, which sold me. So, doing things a little backwards. Better to know and treat than not. ",
      "MessageIndex": 1762,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 24, 2015 10:26AM zinny wrote: Merry Christmas everyone. Hope that you all can love, laugh ( and eat ) with abandon over the holidays. Wishing you all a much better 2016!!! Rainnyc, I am so sorry to hear of you painful wounds. Speedy healing. Off to make a Pavlova:)",
      "MessageIndex": 2148,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 9, 2015 02:47PM zinny wrote: Bra trauma fix! Right after my lumpectomy, when my newly regenerated nipple nerves made it feel like fire when anything touched them, I bought some of those silicone nipple protecters for those who go braless. I have just tucked them into the line where my sports bra leaves a mark, and I am hopeful that they will be the magical cushion I need!",
      "MessageIndex": 1441,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Nov 23, 2015 05:58PM zinny wrote: Oh, and Dana-Farber was in agreement with the initial plan based on ILC alone…. ",
      "MessageIndex": 1763,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 3, 2015 01:51PM zinny wrote: ",
      "MessageIndex": 1895,
      "PostDate": "03/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 8, 2015 12:06AM zinny wrote: Yeah Molly!! Octogirl, I have been recommended saline soaks - the Ocean sounds like a giant saline soak to me",
      "MessageIndex": 1948,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 8, 2015 05:55PM zinny wrote: queenmomcat, I thought that might be a good idea:)",
      "MessageIndex": 1968,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 9, 2015 01:52AM zinny wrote: Go One Bad Boob. Dance your self silly! Embrace the joy :) ",
      "MessageIndex": 1980,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/834004",
      "Title": "Fall 2015 Rads queenmomcat HappyHammer"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 13, 2015 12:55AM zinny wrote: For all who are dealing with LE, I happened to find a great video on how to do massage/drainage yourself. I had a vaccine on my non-radiated but had lx and node bx side, and my arm got tight and felt like the cording was returning…but i also had a birthday, drank more red wine, ate more salt and exercised less for a few days;) anyhow, it went away, but I did try the massage. Not going to hurt! Lymphedema massage video",
      "MessageIndex": 17,
      "PostDate": "13/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/788452",
      "Title": "Lymphedema Treatment 101 - Questions from a Newbie guitarhero25 glennie19"
    },
    {
      "AuthorID": "zinny",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/221670/profile",
      "Content": "Dec 8, 2015 06:01PM zinny wrote: My centre says this - Dove soap only, nothing scented or perfumed. I used Aveeno lotion in the pump bottle twice a day. My skin was way better the days I went to rads with clean unmoisturized skin, IMHO, so I tended to wait to slather until after or take a late shower...",
      "MessageIndex": 168,
      "PostDate": "08/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}