{
  "AuthorID": "zoey1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
  "Posts": [
    {
      "AuthorID": "zoey1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
      "Content": "Dec 10, 2010 03:52AM zoey1 wrote: I can sooo relate. Sometimes at work when the microwave buzzard goes off I jump because it reminds me of the radiation machine. I had my last radiation treatment four and a half years ago!",
      "MessageIndex": 11,
      "PostDate": "10/12/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/761725",
      "Title": "Stupid mammogram made me cry kimber3006 Gitane"
    },
    {
      "AuthorID": "zoey1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
      "Content": "Apr 15, 2010 09:37AM zoey1 wrote: I am stage 1 for the second time. Initially diagnosed 4 years ago, had lumpectomy and radiation. Refused Tamoxifen. Second diagnosis, same breast, new primary, January 2010: stage 1, 6mm, no nodes available but Oncotype testing revealed low probability of recurrence or it spreading. April 5th bilateral mastectomy with immediate DIEP reconstruction. Currently taking Tamoxifen with few side effects. Doing really well!",
      "MessageIndex": 2425,
      "PostDate": "15/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "zoey1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
      "Content": "Apr 17, 2010 05:12PM zoey1 wrote: Hi There, I was originally diagnosed 4 years ago, stage 1, and had a lumpectomy and radiation. My second diagnosis came this January (not a recurrence but new primary in the same breast) and I opted for a bilateral mastectomy with immediate reconstruction (DIEP). I am now 2 weeks post-surgery and doing really well. Sure there's some pain but it's absolutely manageable even without pain meds. I really like my new breasts and will not miss the anxiety of mammograms and MRIs. Having said this, many other women I've talked to really struggle with loss regarding their breasts and would have preferred to keep them if given the option. I'm just not one of them. Best of everything to you. Warm Regards, Karen ",
      "MessageIndex": 19,
      "PostDate": "17/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/751379",
      "Title": "Just diagnosed and I need advice! 1WonderWoman goodvibesonly"
    },
    {
      "AuthorID": "zoey1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
      "Content": "Apr 10, 2010 08:03AM zoey1 wrote: Karen: Bilateral mastectomy April 5th with immediate DIEP. 6mm IDC, stage 1. Tamoxifen",
      "MessageIndex": 126,
      "PostDate": "10/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/749757",
      "Title": "april 2010 masectomy rayofsun jessamine"
    },
    {
      "AuthorID": "zoey1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/31976/profile",
      "Content": "Apr 12, 2010 11:54PM zoey1 wrote: Interesting...I am one week post mx and DIEP. I felt awful after being pumped up with morphine and percosets and took myself off all pain meds except Tylenol and felt better. I also asked the nurses to bring me a cup of coffee in the morning as I suspected I also was experiencing coffee withdraw; this helped a lot. I'm doing okay but do have itchy rash on my back which I was told was from being on the operating table so long. Now I wonder if it is an allergic reaction.",
      "MessageIndex": 4,
      "PostDate": "12/04/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/750936",
      "Title": "Sensitivity to Morphine - anyone have this? Joanie207 JO-5"
    }
  ]
}