{
  "AuthorID": "zoomom1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83603/profile",
  "Posts": [
    {
      "AuthorID": "zoomom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83603/profile",
      "Content": "Mar 25, 2010 10:25PM zoomom1 wrote: Hi TrueBee, I have had Stage llb, Triple Negative IDC in Apr.08.  One breast was not salvagable and the other had areas of concern, a double mast and chemo were the recommendations.  With my family history (my mom passed in 92 of BC) it was a no brainer, I had the double mast with chemo.  I am glad your sister-in-law wants to get together before her treatment.  Follow her lead as to conversation that evening (you could ask her if and what she wants to talk about if anything-my recommendation would be not to push), maybe have her favorite foods, snacks and deserts.  I would also plan to have games such as cards, poker etc (whatever she likes to play or do).  You can talk while playing and it may not seem as formal, more of a casual thing, be prepared for a great party!!  There is nothing better than knowing people care and will be there for you.  My cousin and her husband surprised me by flying in during my chemo.  It was great!!  I had not seen them for a long time. If asked your opinion, research the question before giving an opinion off the cuff (you can be honest and tell her you would like to do some research and have a better educated opinion).  There is a lot to digest.  She may be offered to be in a variety of studies, some may be right and others not so.  Example: Due to my diagnosis I was asked to be in a study for chemo.  The study was weekly chemo for six months or a more potent chemo every other week (which was standard at the time).  They were trying to figure out if a little less chemo weekly was better than the standard protical for my diagnosis.  I took the standard of care at the time after meeting with a a small group of family members.  Those that I choose were into doing more research and could be more objective/one was had more knowledge due to being an Anesthesiologist Nurse (who passed suddenly during my treatment-he was my buddy because he also had a serious illness and understood feelings others could not-I took it hard.  He was also the one I asked to help me choose a Doctor.)  I also choose not to tell other members of the family that I did have this little group because I did not want hurt feelings.  Some of the reasons I choose the standard of care at that time was several fold and I will tell you why so that you can see some of the options you may have.  Reason:  It was the best proven option at that time.  Reason:  It would have taken me further into the flu season.  I do have to tell you, before I took the time to meet with the group I had chosen I was bound and determined to be in every study there was.  Since then I have taken part in several studies.  All but one of those studies were to donate blood, tumor samples etc.  One study is a three year study that includes one pill a day, blood every three months so far. Don't forget the suggestions Makraz offered.  Food, house cleaning, laundry, movie night, help with shopping, a mani/pedi will all be appreciated.  Do not forget this is a process help would be appreciated for a longer period than you may realize - four surgeries, and four months of chemo later - it takes a toll on the body.  I still do not have the same amount of energy I did before it all began.  Sorry if I am babbling - it is late - going to bed.  I hope this helps.  I will say a prayer for her!   ",
      "MessageIndex": 14,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/750239",
      "Title": "Family member about to have mastectomy - family gathering before TrueBee ferretmom"
    },
    {
      "AuthorID": "zoomom1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/83603/profile",
      "Content": "May 12, 2009 11:37PM zoomom1 wrote: Shannon56 I was dx 4/08, TNIDC, going through reconstruction now (did three surgey/chemo-last surgery is jun/july 09).  I still go through the motions (not much support from spouse-his way of dealing is ignoring).  Anyway, I live nearby if you need an ear to bend we can have coffee. ",
      "MessageIndex": 21,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/733918",
      "Title": "When does it feel real? PS73 Makratz"
    }
  ]
}