{
  "AuthorID": "zpdx",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134779/profile",
  "Posts": [
    {
      "AuthorID": "zpdx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134779/profile",
      "Content": "Aug 22, 2011 08:52PM zpdx wrote: I felt the same way, and felt like I was the only person to ever react that way. I got through chemo and surgery, but radiation is the one that seems to be freaking me out the most. The fear and anger has been overwhelming. I rescheduled my \"simulation\" twice. Finally I asked to see another rad onc, but they really didn't like that idea and made that process super difficult. I knew the second would also say I had to do it, but I still had so many questions that my rad onc wasn't answering. My fear hasn't been so much about the short-term side effects, but the long-term risks, but no one seemed to hear me saying that over and over. The idea that I could go through all of this and then have the treatment cause more problems has been one that has been literally keeping me up nights. Lung damage, heart damage, secondary cancers, lymphedema. I don't sleep at all these days unless I take Ativan. Trying to sort out what to do and how it might affect the rest of my life has been anything but a simple equation. I am more than this breast cancer. Getting rid of this breast cancer is only one of many things to weigh out here. None of the doctors seem to get that, neither do most of my friends or family. I did finally go. I had my third treatment today. We get through this the way we get through it all, we show up. One foot in front of the other. Breathe. Hope for the best, deal with whatever comes. I've started walking an hour a day. At least it makes me feel like I'm actively doing something to battle the inevitable fatigue that's coming in a few weeks.",
      "MessageIndex": 9,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/773522",
      "Title": "I don't want to go to my planning rads tomorrow bedo Lissa123"
    },
    {
      "AuthorID": "zpdx",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/134779/profile",
      "Content": "Feb 1, 2015 06:33PM zpdx wrote: Next month will be 2 years since I started Kadcyla. My cancer had gotten very aggressive and Kadcyla stopped it cold. My liver mets healed and my bone mets stopped progressing. Unfortunately it doesn't cross the blood/brain barrier and I have many brain mets, but cyberknife has been really successful. SEs have been mostly lack of appetite, nausea, dry mouth, nosebleeds and neuropathy in my fingers. Some days it really gets to me, but most of the time I'm grateful that it's not nearly as bad as some other chemos I've been on and that it's keeping my body STABLE! The lack of appetite has been the most difficult and persistent SE for me, but I'm lucky enough to live in a state where marijuana is legal so I vape marijuana to get an appetite going - it works like a charm.",
      "MessageIndex": 237,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    }
  ]
}