{
  "AuthorID": "zuri43",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206415/profile",
  "Posts": [
    {
      "AuthorID": "zuri43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206415/profile",
      "Content": "Nov 19, 2014 09:23AM zuri43 wrote: Thank you for starting a November chemo club!  I had my first treatment on Nov. 4th with everyone's horror stories whirling through my head and scared half to death.  Very happily I only had a couple of days of mild nausea.  Very important to take your anti nausea meds as instructed!  I did unfortunately get constipated though.  Ended up having to drink a bottle of magnesium citrate.  Not fun!  So now I have a daily regime of of miralax in the morning, 4 dried prunes for an afternoon snack (even when food is the last thing on my mind,) and stool softners before I go to bed.  Had my 2nd treatment yesterday (11-18) and no nausea yet.  Maybe I will be one of the fortunate ones and not be sick in that way.....I lost my first clump of hair in the shower this morning.  Made everything very real. I was expecting it but it still kind of shook my foundation.  Husband said he would shave my head for me whenever I'm ready. The sooner it falls out the sooner it will grow back in right?!?  OK I'm outta here for now. Gonna take a little snooze!",
      "MessageIndex": 299,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/825813",
      "Title": "November 2014 Starting Chemo Crew enlm20Erica amylsp"
    },
    {
      "AuthorID": "zuri43",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/206415/profile",
      "Content": "Nov 1, 2014 12:31AM zuri43 wrote: Hello!  I live in Kennewick WA on the other side of the mountains from you!  I start my chemo on Tuesday Nov 4th.   I'm nervous about it as I'm sure you are.  I've been told to pack something to read, some water, music, crackers, and hard candy.  After the first treatment then we will know more about what to add or take away.  Good luck to you!  ",
      "MessageIndex": 436,
      "PostDate": "01/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/824699",
      "Title": "Starting Chemo October 2014 kerensa75 Becca9800"
    }
  ]
}