{
  "AuthorID": "blue63002",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
  "Posts": [
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Thanku so much for your comments. I'm a gemini and we are born survivors so it better come true for me now! My 23yr old grandaughter is having my great-grandaughter in the Spring and thats a positive thing for me to remember....I need to be as strong as is possible and i will be....i'm just so scared of all thats to come right now. Thanks again, Blue :-( x Report",
      "MessageIndex": 2,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Thank you for the words of support. I have kept to myself today trying to not cry every time i think of this horrible thing. I will know when i'm having the lumpectomy probably on monday then thats the next step to deal with. I really appreciate the support of women who know. I live alone but have a few close friends and a son and daughter locally who are all shocked but will do what they can. Things is tho that they don't understand this horrible fear, fear of all thats to come...thank you and stay well. Blue :-( x   Report",
      "MessageIndex": 4,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Yesterday I went for 'further tests' as I was re-called after my routine mamogramme. Had the lot, more mamogramme, needle test and biopsy and then told that they are sure it's a cancer that I will have surgery (lumpectomy) then radiotherapy. I am to be honest devastated and my determination and strength has deserted me right now. I also have to stop the HRT i've been taking for many years and I know that will add the horrific 'flushes' into this current mix. I've been reading so many posts here and admire all you ladies for being so brave. I just don't feel brave at all and have no idea what my future is going to be. A little reassurance would go a long way if there's anyone out there!! Stay well, all of you. Blue :-( 1 like, 14 replies Report 1",
      "MessageIndex": 0,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "hi Sylvia ​Thank yo for taking the time to message me. I had my surgery last Monday and yesterday returned to find out the results. I'm glad to report that my lymphnodes are CLEAR which is the best news but I unfortunately have to have a second surgery a week on Monday as the margin betweeen the cancer lump and the healthy tissue was a bit too small so to be extra cautious, i'm having to go through the breast surgery again so am upset about that. ​On the whole though I realise this is good news and I WILL beat this. My radiotherpy treatment will now be put back a couple of weeks which is also a bit of a disappointment as I'd hoped to perhaps be through that by xmas. But yes, i have a GREAT-grandaughter coming in March and saw a scan of her the other day and am very excited and determined that there is more to me than my wonky boob!!! I hope you are getting there too and feel better soon. Family & friends will see us through!! ​take care and thanku again, Blue :-) Report",
      "MessageIndex": 8,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "hi, ​feels a bit like one step forward on this journey then 2 back at the moment but off course I want them to be as sure as possibl that they have 'got it' so to speak. I have only the greatest respect for how I've been seen and treated all within a few weeks. Can't fault them at all. ​I was told i'd get 3 weeks of radiotherapy mon-fri and i do believe the side effect of the treatment is fatigue. Will this hit me the first week or further on and have you any advice on how to 'prevent' or just deal with that? I hope to drive myself to my daily appointments, is this advisable? thank you Blue :-) Report",
      "MessageIndex": 10,
      "PostDate": "24/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "Seren66anji blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/seren66anji-897896",
      "Content": "I cannot imagine how you are feeling right now,it must have been a tremendous shock for you and is every woman's worst nightmare. Please be strong and try to stay positive and throw everything you can at this. I wish you lots of love and blessings and am here if you ever need support. I hope that you have loving people around you to help you through this terrible time. Xxxx Report",
      "MessageIndex": 1,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Thank you again for your encouraging comment and yes, I will let you know how it's all going. The sun is shining this morning here and I feel my determination to be positive IS coming.....then the tears fall again and I feel so helpless. Perhaps once I get the surgery over with will be when I can really feel that things WILL be ok. Have a good day and stay well! Blue :-( Report",
      "MessageIndex": 6,
      "PostDate": "23/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "thanks for that Denise. Home from 2nd surgery yesterday and i feel ok. Wee bit sore and tired but thats normal. I too have a dog to walk and yes, the daily toddle with him will be my regular exercise! My weeks wait to see if this time the surgeon is happy that he got it ALL then radiotherapy will begin in a few weeks. Your comment is very positive so thanku for that. Stay well and keep looking after yourself! Blue :-) Report",
      "MessageIndex": 12,
      "PostDate": "04/11/2015",
      "ThreadURL": "https://patient.info/forums/discuss/just-been-told-yesterday-i-have-a-breast-cancer-my-world-is-crashing-and-i-need-some-advice-plea-479123",
      "Title": "Just been told yesterday I have a breast cancer.....my world is crashing and I need some advice plea"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "hi Julie, I'm in a similar boat right now. I had a recall from a routine mamogramme and here I am 4 weeks later having just had breast surgery (lumpectomy) last week, and sadly have to have another op a week on monday as the surgeon is being extra careful about a small area within the 'healthy tissue' he removed. Good thing for me though is that my lymphnodes are clear and thats such a relief. Have a bit of pain today and been a tad emotional, and am sure you will be too. Everyone's great at telling us it will all be ok but it's only YOU thats going through the journey. I'll cross everything for you and hope things are not as bad as they seem right now. Take care, Blue Report Hi Blue. Thank you for replying. Sorry to hear your news but it sounds like you'll be in the clear! I hope so anyway. I'm not any good at replying so I'm sorry if I offend you in anyway! I'm not sure what to write ! I'll be glad when next Thursday comes as the hard bit is waiting and then I'll no the answer. I may well find out tomorrow from my blood test results. I dunno. I'm just a mess at the moment as are many others. I'll post results once I find out at some point. Thank you very much Blue for taking time out to reply to me. Julie Report Hi Julie, ​I had a very weepy day yesterday so just go with the flow so to speak. Talk to family and friends when you feel the need and cry when it all gets too much. I was just beginning to get my positive head on when they hit me with the 2nd surgery a week on Monday. Think thats why yesterday was a down day for me. We are all on this journey but each one will be differen for each person and although we can try and support each other because we too are travelling on the same road, our individual experiences will be different. I've been a singlton for a very long time and consider myself a strong independant woman but this hs just taken the wind out of my sails so to speak and some days I have to stop myself from going totally mad!! I haven't got to the \"why me\" because the way I see it, I have 2 grown up daughters and 2 grandaughters and I woud rather this be happening to me than it be any of them.....that helps keep me positive. You are right, the waiting is soul destroying but hang in there. When you know exactly what you are deaing with you will find the courage and strength to fight it. You are stronger than you think you are....I've found that out lately!! Take care and eep in touch :-) x Report Hi Blue. Sorry you were so down yesterday. Hope you not today and am feeling bit better!. I haven't told my kids well..grown ups as don't want them to worry! I've had enough today. I spoke to my gp and she told me my liver isn't working as it should and I have to have another blood test in January and if the same results I've gotta have investigation. I don't drink anymore. Haven't done so in years and I know the liver can heal itself that's if it hasn't had too much damage which I hope not! I have stage 3 kidney disease too which is stable at present but with what could be cancer too I'm worn out mentally. I never say 'why me' it isn't fair anyone having to go through anything! You are right in the sense that I will find the courage if and when is needed. Thank you again Blue. Take care and I'll keep in touch. x Report Hi Blue. I found out Thursday I do have breast cancer. I'm having surgery on the 10th of Nov if all goes to plan. It hasn't hit me yet but all I'm doing is thinking about the future. Will it come back and everything else which I should imagine everyone with cancer thinks and worries the same. How are you doing? Have you had the 2nd op yet? Good luck and all the best Blue. Reply if you feel up to it but I understand if you don't. Julie x Report Hi, I was diagnosed in July with breast cancer and had sugery in September. Fortunately they got all the cancer and my lymphnodes were clear too. I have had 3 weeks of radiotherapy and have finished the treatment except for anti hormone tablets which I will have to take for a while.   I feel fine, not 100%, but really good. I have tried to stay positive through as there is not really a lot you can do about the cancer. It is good to talk about it and also on these forums for advise on side effects etc.   Everyone's case is different but the results for surviving breast cancer nowadays is really good so try to stay positive. Good luck. Denise Denise Report",
      "MessageIndex": 6,
      "PostDate": "22/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/waiting-for-results-for-breast-cancer--482730",
      "Title": "Waiting for results for breast cancer."
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Hi Julie, ​I had a very weepy day yesterday so just go with the flow so to speak. Talk to family and friends when you feel the need and cry when it all gets too much. I was just beginning to get my positive head on when they hit me with the 2nd surgery a week on Monday. Think thats why yesterday was a down day for me. We are all on this journey but each one will be differen for each person and although we can try and support each other because we too are travelling on the same road, our individual experiences will be different. I've been a singlton for a very long time and consider myself a strong independant woman but this hs just taken the wind out of my sails so to speak and some days I have to stop myself from going totally mad!! I haven't got to the \"why me\" because the way I see it, I have 2 grown up daughters and 2 grandaughters and I woud rather this be happening to me than it be any of them.....that helps keep me positive. You are right, the waiting is soul destroying but hang in there. When you know exactly what you are deaing with you will find the courage and strength to fight it. You are stronger than you think you are....I've found that out lately!! Take care and eep in touch :-) x Report",
      "MessageIndex": 8,
      "PostDate": "23/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/waiting-for-results-for-breast-cancer--482730",
      "Title": "Waiting for results for breast cancer."
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "hi Julie, Am so sorry to hear you have joined this very unsettling journey. I go in tomorrow morning for this second surgery and am praying all will be well and I can proceed to the next part of my journey, the 6 week countdown till the radiotherapy can start. Thats scares me so much too but am being assured all will be fine with it. Have they told you the size of any lump, or a 'stage' your cancer is? You'll get loads of support and info from your breast cancer care nurse and she will be there at all your future appointments and always at the end of the phone or email to answer ANY questions. Ask away....no question is too unimportant. I know this is a different journey for each and every one of us girls but hopefully we CAN still support each other all be it by these messages. Am packing my bag for the morning and starting to get the butterflies once more but hopefully i'll be able to report in very soon that i'm ok! Take care and keep an eye on the emotional side, thats whats got me.Am up and then down totally at random!! :-( Blue x Report",
      "MessageIndex": 12,
      "PostDate": "01/11/2015",
      "ThreadURL": "https://patient.info/forums/discuss/waiting-for-results-for-breast-cancer--482730",
      "Title": "Waiting for results for breast cancer."
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "Not sure why your post came up as I see it was 5 months ago. I hope you are recovered and that all is well with you. I'm sitting here at 5am really terrified as in just a few hours I will be in hospital about to have a lumpectopmy following my breast cancer being found at a routine mamogramme. I'm told it's stage 2, is small and that they are going for cure, but right now this is the scariest place i have ever been. I will have radiotherapy 6 weeks after the lumpectomy. It's breast cancer awareness week so it's just everywhere i look and is overwhelming. Report Sorry you're going through this, have fait, everything will go well. Rest a lot and take one day at a time, being diagnosed with cancer it's not easy, many things go through your mind but were strong children of God, and you're not alone. God bless you. Report surgery over and now the wait for the results. Thank you for your message. Blue Report",
      "MessageIndex": 6,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/breast-cancer-403802",
      "Title": "Breast Cancer"
    },
    {
      "AuthorID": "blue63002",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/blue63002-897801",
      "Content": "surgery over and now the wait for the results. Thank you for your message. Blue Report",
      "MessageIndex": 8,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://patient.info/forums/discuss/breast-cancer-403802",
      "Title": "Breast Cancer"
    }
  ]
}