{
  "AuthorID": "caz1967",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
  "Posts": [
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "When finding something not the same as you always have how do you know what your feeling is a lump,or swelling mass? I can feel something odd like a  firm bag of worms , between breat and underarm, with a specific spot furth under my arm thats very sore. Then on my forarm a lump which is long in shape not mobile and on pressure a little sore. Which i did see the doctor about but she barely looked let alone examined it some months ago before any thing else found. ANY IDEA IF I NEED TO PUSH DOC TO SEND ME FOR TESTS, or is it more likely to be  harmless?  Thanks for any advice.Carol xx 0 likes, 5 replies Report",
      "MessageIndex": 0,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://patient.info/forums/discuss/how-do-you-know-the-change-is-a-lump-to-concern-you--605917",
      "Title": "how do you know the change is a lump to concern you?"
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "UPDATE.... I went for another mammogram in October, when I was having the ultrasound after I caught sight of the screen. There are dark shadows around the bottom of the right breast, after this was finished I was sent back to the clinic and saw the consultant again who came through to me, mumbled nothing to concern you yet! and out he went. Ive worried on and off, so I went to my GP April and told her what id clearly seen and what the Consultant had said. She pulled up the report on the computer and told me that changes had been found but it wasn't to be worried over, as it had been decided that these changes weren't malignant, no further biopsy's nothing yet this decision was made. I told the GP I wasn't very confident in the way they were so positive the changes were nothing. Then out of nowhere Saturday morning I received an appointment to go for yet another mammogram on the 22nd June. this has myself and my hubby confused and worried. Ive so had enough of the amount of concerns mammograms ive had over this past 3 years, I had my first mammogram around 6 years ago for the exact same reason I had my last done .Ive also noticed a weird type of rash on both breasts and no matter what I apply its getting gradually slightly worse, Im starting to think they don't know what THEY ARE DOING, I WONDER IF I SHOULD ASK IF HAVING A DOUBLKE MASETOMY WOULD BE BEST IN MY CASE??? ANY ADVICE GUIDANCE I WOULD APPRFECIATE IT. Report Reply",
      "MessageIndex": 6,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://patient.info/forums/discuss/how-do-you-know-the-change-is-a-lump-to-concern-you--605917",
      "Title": "how do you know the change is a lump to concern you?"
    },
    {
      "AuthorID": "hypnocool caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/hypnocool-461486",
      "Content": "I got a lump it was sore. I went to the dr then he made me go get ultrasound, then mammogram.  It's still a toss up though... so going to see Surgeon next week for biopsy.  Pretty scared right now. If you're really concerned. Just go to another dr.  Or just request to get an ultrasound... but that mammogram squishes your boobies.  I had mine since May.  I could still there but it move since or it went smaller...  Report 1 Reply",
      "MessageIndex": 1,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://patient.info/forums/discuss/how-do-you-know-the-change-is-a-lump-to-concern-you--605917",
      "Title": "how do you know the change is a lump to concern you?"
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "Hi Ive had mammogram about 18months ago, so yes im in agreement its an awful examination, especially if your large busted. My concern with this is where ive got the concern is not where they get with the mamaogram, and ive heard the ultrasound isnt very good at picking up problems, iI am seriously considering making an apt this coming week to see my doctor, it should be a check a woman can book without needing referal from GP.mine hasnt any confidence in her own jusgement, when i went last time she could not decide what to do and told me she would let me knowm her decision. I still don thave any idea what she decided. I had requested hydrotherapy for the disc problems in my back she considered physio to be better but said shed let me know. I hope everything works out for you and you recieve the best possible news. regards Carol Report Reply",
      "MessageIndex": 2,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://patient.info/forums/discuss/how-do-you-know-the-change-is-a-lump-to-concern-you--605917",
      "Title": "how do you know the change is a lump to concern you?"
    },
    {
      "AuthorID": "caz1967 Tlynn1",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "I have had this happen on a couple of occasions, however it would depend on what is determined as a rash, my problems turned out to start form a scab, which has left scarring, the gp informed me it was a bacterial skin infection When I enquired about the info id read regarding inflammatory breast cancer, I was told it would be a definite rash, similar to nappy rash. I hope you will find the same or similar result and be reassured by your gp. ​good luck  carol   Report Reply",
      "MessageIndex": 1,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://patient.info/forums/discuss/itchy-rash-on-both-breasts-642114",
      "Title": "Itchy rash on both breasts"
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "Hi Lynn, Did you resolve the rash problem? I do hope nothing has come of it.  Regards Carol Report Reply",
      "MessageIndex": 2,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://patient.info/forums/discuss/itchy-rash-on-both-breasts-642114",
      "Title": "Itchy rash on both breasts"
    },
    {
      "AuthorID": "alex35210 caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/alex35210-1194433",
      "Content": "black areas could be breast cysts or even your ribs or areas of normal breast tissue the lobules in the breasts can look like little pockets. if the big black areas were of concern a biopsy would of been done. cancer is not necessarily obvious on an ultrasound and takes a lot of training to pick it up. He obviously just doesn't have a very good bedside manner. hope this helps Report Reply",
      "MessageIndex": 1,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://patient.info/forums/discuss/breast-ultra-sound--643674",
      "Title": "Breast Ultra sound."
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "Ive has a few issues with lumps but thank god till now ive been told they are something called lumpy breast syndrome. However I was again referred as my Gp felt it worth getting checked again. I had only the right side checked by ultrasound, whilst performing the scan I could see the screen and was concerned to see  black areas of different sizes, Once back with the specialist he said id nothing yet to be concerned about, I then asked what the black areas id seen were? He did not respond, just shuffled out quickly. Since then it has been playing on my mind, but trying to get a GP apt takes so long 3 /4 weeks for a routing apt. so ive not bothered. Should I ? has anyone else ever seen these black areas when they've undertaken a ultrasound? 0 likes, 1 reply Report",
      "MessageIndex": 0,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://patient.info/forums/discuss/breast-ultra-sound--643674",
      "Title": "Breast Ultra sound."
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "Sweetheart, I live in the UK so I only know our procedures and charities. Go online find your local cancer support unit .This is devastating news and whether its close friends or family you'll need plenty of supportive loving people there for you. We have a few national.charities which work on behalf of any one connected to cancer  I wish you my heartfelt sympathies and will remember you in my prayers.   ALL THE VERY BEST Carol Report Reply",
      "MessageIndex": 7,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://patient.info/forums/discuss/terrified-i-have-breast-cancer-662922",
      "Title": "Terrified I have breast cancer"
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "I just have to wish you well, I pray for you to come through. Ive hd lots of family pass with cancers all had different cancers, I worry myself about breast cancer as ive been told ive lumpy breast syndrome which makes self examination a nightmare.. ​best of luck  carol Report",
      "MessageIndex": 3,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://patient.info/forums/discuss/stage-4-breast-cancer-metastecised-to-lungs-bones-and-now-in-brain--551720",
      "Title": "Stage 4 breast cancer metastecised to lungs, bones and now in brain."
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "pleased to hear your feeling well. hope your results are good. regards carol Report 1 Thank you xx Report",
      "MessageIndex": 3,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://patient.info/forums/discuss/operation-612128",
      "Title": "Operation"
    },
    {
      "AuthorID": "caz1967",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/caz1967-1041988",
      "Content": "Afternoon Nicci, I also have had the same sort of thing on my right breast on 3 seperate occasions, which have left substansial scarring, In all cases they start looking like a sort of dry spot which quickly chnage to a sore which can weep , when i went to doctor i was told it was down to antibodies and bacteriea which he gave me hibbiscrub for, i always use Dove or Sanex. So it got me quite upset thinking i had caused it not showering enough, but doc said it had more to do with me having quite large breasts and the skin rubbing together and the bacteria everyone has on the skin. Ive since had one on my underarm which again left scarring. He did call it something but i carnt remember the name , sorry. It get me down as they are do unsightly . I hope you sort it out and your doctor is more use than mine was,  regards Carol Report",
      "MessageIndex": 5,
      "PostDate": "12/08/2017",
      "ThreadURL": "https://patient.info/forums/discuss/could-it-be-cancer--596317",
      "Title": "Could it be cancer?"
    }
  ]
}