{
  "AuthorID": "jayneejay simbatipps",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/jayneejay-49980",
  "Posts": [
    {
      "AuthorID": "jayneejay simbatipps",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/jayneejay-49980",
      "Content": "Thiking of you, big hugs, and chin up, all may be fine, they just being thorough.. i am 50 aswell, now post menopause of 18 months. had a few problems, as have three bulging disks in my back, ( nothing to do with menopause) and had been feeling achey and unwell for weeks, turns out I had shingles, had a few shingles rash/ blisters  flare up on my butt cheek, again, did this at xmas and i ignored it. Came back again, and its second shingles in two months.. but, i ache from head to toe.. remember hun, we all have niggles and things to worry and drive us mad,  take care  sweetie - let us know how you get on 😊 jay xx Report",
      "MessageIndex": 1,
      "PostDate": "24/02/2015",
      "ThreadURL": "https://patient.info/forums/discuss/mammogram-recall-screening-and-biopsy-372692",
      "Title": "Mammogram Recall Screening and biopsy"
    },
    {
      "AuthorID": "jayneejay simbatipps",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/jayneejay-49980",
      "Content": "Hello Simba try not to worry too much, sometimes the xrays are not clear and they may call you back to get clearer images .. if the xray was fine to start with then surely if it was something of real concern your doctor would be calling you ... Maybe .. i have heard before of some ladies going back / recalled due to need clearer images, as maybe the others were not as good as they could be. try not to worry, i understand your worry though.. try and keep positive  good luck simbatipps jay  Report",
      "MessageIndex": 1,
      "PostDate": "21/02/2015",
      "ThreadURL": "https://patient.info/forums/discuss/mammogram-recall-362367",
      "Title": "mammogram recall"
    }
  ]
}