{
  "AuthorID": "lisa43476",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/loral-896835",
  "Posts": [
    {
      "AuthorID": "Loral lisa43476",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/loral-896835",
      "Content": "Wait for the mammogram results it could and probably is a fatty cyst. Best wishes! Report",
      "MessageIndex": 1,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://patient.info/forums/discuss/armpit-pain-and-lump-in-breast-495769",
      "Title": "Armpit pain and lump in breast"
    },
    {
      "AuthorID": "lisa43476",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/lisa43476-595651",
      "Content": "Hi I started getting some pain in my left armpit on and off in August. Saw my gp a couple of times about it as it persisted but no lumps. He didn'the think it was of concern. Then just after Christmas I found a lump in my left breast. It moves little. I saw my gp who initially said wait until after my next period to see if it disappeared as I am only 31 and there is no history of bc in my family. Lump did not disappear though so have been referred and now waiting for Fri when I have appointment at breast clinic. I am trying to keep positive but deep down am really scared as what might be found. Especially as I have 2 very young children. It's worrying me more that as well as the lump I have had pain in my armpit for a while. Maybe totally unrelated but I also keep getting chills for no apparent reason. Any positive stories appreciated. 0 likes, 9 replies Report",
      "MessageIndex": 0,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://patient.info/forums/discuss/armpit-pain-and-lump-in-breast-495769",
      "Title": "Armpit pain and lump in breast"
    },
    {
      "AuthorID": "lisa43476",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/lisa43476-595651",
      "Content": "Thank you both for your replies. Yes I read that most lumps are nothing to worry about so hoping mine is one of those. I am still breastfeeding my youngest but have cut down a lot over last couple of months so maybe it could be linked to that. I guess Fri will have the answer. Report It is awful having to wait. I don't think doctors realise the stress people go through. Report",
      "MessageIndex": 3,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://patient.info/forums/discuss/armpit-pain-and-lump-in-breast-495769",
      "Title": "Armpit pain and lump in breast"
    },
    {
      "AuthorID": "lisa43476",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/lisa43476-595651",
      "Content": "Thanks very much for your response Sylvia. I am glad to hear you are doing well now and thanks for sharing stories of others you know. I have been trying to prepare myself mentally either way, good or bad news. I understand your point about the gp. I actually saw a different one about the pain in my armpit to the one who referred me for the lump. The gp who referred me for the lump didn't seem to think there was any significance to the pain in my armpit eother though. Maybe because the lump is near my breastbone, but guess we wait and see. I will update you with how I get on, on Friday. Thanks again Lisa Report",
      "MessageIndex": 6,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://patient.info/forums/discuss/armpit-pain-and-lump-in-breast-495769",
      "Title": "Armpit pain and lump in breast"
    },
    {
      "AuthorID": "lisa43476",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/lisa43476-595651",
      "Content": "Feeling very thankful tonight after examination and ultrasound at breast clinic today everything is normal. Doctor said it is just some normal breast tissue. Thanks to everyone for their positive comments and wishing you all good health. Report Hi Lisa, I'm SO happy for you!!  Best wishes to you for continued great health!! Sylvia Report",
      "MessageIndex": 7,
      "PostDate": "05/02/2016",
      "ThreadURL": "https://patient.info/forums/discuss/armpit-pain-and-lump-in-breast-495769",
      "Title": "Armpit pain and lump in breast"
    }
  ]
}