{
  "AuthorID": "Merry19451 tammy76379",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/merry19451-596809",
  "Posts": [{
    "AuthorID": "Merry19451 tammy76379",
    "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/merry19451-596809",
    "Content": "Hi Tammy, Reassuring news is that the you are going to get through this with a wonderful husband, and you caught this before it spread throughout your body. I want you to know that the medical people who work with breast cancer patients are great. They know how scary this is. My twin and I were diagnosed at the exact same time three years ago with an identical Intraductal Carcinoma, same breast, same time, same markers, same everything. Somehow, because it was caught early, we were not anxious. We both had partial mastectomies and radiation, plus are on Exemestane as the tumors were Estrogen POS, Progesterone POS, Herceptin neg. We had the partial mastectomies due to the calcifications. The tumors were 7mm. There were no involved lymph nodes. I know it wasn't carcinoma in situ, but...we both said, we just wished it was just ourself, so the other twin didn't have to go through it. You will find tremendous support for whatever you do go through, I assure you. If you have the lumpectomy with radiation, I found the best bra to wear is the Bali Cami. BTW, I found that out by asking at the Breast Center where I had my initial mammogram. A lady came out who worked there and told me where to go to buy them. It slips over your head, actually you step into it, because you cannot raise your arm after a lumpectomy, but the microfiber is like silk. I still wear them three years later. You do not feel the bra on you. You join a sisterhood, essentially, helping others through the treatments as you help yourself. Tammy, where do you live? How old are you? I know you will get tremendous care, as all breast cancer patients do. I am a Nurse Practitioner in the States. Please feel free to ask more questions.... Best Wishes Merry Juliana Report 1 Reply",
    "MessageIndex": 1,
    "PostDate": "20/09/2018",
    "ThreadURL": "https://patient.info/forums/discuss/just-diagnosed-with-dcis-ductal-carcinoma-insitu-678913",
    "Title": "Just diagnosed with dcis-- Ductal carcinoma insitu"
  }]
}