{
  "AuthorID": "pebbalita",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
  "Posts": [
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "BRAVO Janet... I am a 16 year BC survivor . with implanr 5 years after mastectomy,  (which is just now causing trouble hardening from old age ) Like me Doctors told me then, after 2nd op and malignent lymph nodes I would not last 1 year ..who says they know better than the man upstairs? Yes  MacMillan Nurses are angels indeed Bless them they helped me laugh my way back  to health... keep on surviving hon Blessings xxx  Report",
      "MessageIndex": 5,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://patient.info/forums/discuss/mammogram-results-450345",
      "Title": "mammogram results"
    },
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "DawnDicko Are you OK hon? whatever the results I am living proof after 16 years BC is not a death sentence... but try to stay poisive as I did .With treatment and positive outook we  WILL survive! PLEASE let us know ...you have our survivor support... email me at if you want to chat one on one  Deb Emis Moderator comment: I have removed the email address as we do not publish these in the forums. If users wish to exchange contact details please use the Private Message service. http://patient.uservoice.com/knowledgebase/articles/398331-private-messages Report",
      "MessageIndex": 8,
      "PostDate": "19/07/2015",
      "ThreadURL": "https://patient.info/forums/discuss/mammogram-results-450345",
      "Title": "mammogram results"
    },
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "HI  I am  BC survivor for 17 years ,,So if in these days it was BC it is no longer a deaath senance ,,BUT if you have ANT small lunp Hard an painless even I would see an Oncologist and let him/herdecide whether you need a biopsy..IF it were a cyst they usually are painful..more risky are the hard no pain type lumps,,Probably not seroius but I would ease my mind and re check it with a knowedable Oncologist . My BC was mis diagnosed by FOUR doctors for 7 years BECAUSE it hurt,,IF it HURTS they now know it COULD e cancer,,,So the old fashioned idea of if it hurts it is just a cyst is NO LONGER true,,but do not stress THAT causes many illnesses ..Just get a second opinion or.and an ultrasound Blessings Deb Report",
      "MessageIndex": 5,
      "PostDate": "06/09/2015",
      "ThreadURL": "https://patient.info/forums/discuss/lump-on-bra-line-dr-dismissed-it-extremely-worried-and-need-advice--477182",
      "Title": "lump on bra line, Dr dismissed it, extremely worried and need advice."
    },
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "Excuse typps I WISH HERE  we could as in FB hit edit to fix errors got those of us impationt enter hitters Report",
      "MessageIndex": 3,
      "PostDate": "30/08/2015",
      "ThreadURL": "https://patient.info/forums/discuss/what-is-this-rash-under-my-armpit-could-it-be-breast-cancer-i-m-19--466452",
      "Title": "What is this rash under my armpit? Could it be breast cancer? I'm 19?"
    },
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "LAYLA don't panic HON,,As a 16 year BD survivor I have NEVER heard of BC. starting with a rash...usually a lump which also may be a benign cyst BUT should be checked with Momogram and more important an ULTRASOUND which didcovered mine (Mam9os missed it for 7 years I hink a rash is just from sweat glands BUT I am no doctor so if it does nnot go away after a few days go see a dermatologist Good Luck Gin sunds minor but check it ouy Blessings  Report Excuse typps I WISH HERE  we could as in FB hit edit to fix errors got those of us impationt enter hitters Report",
      "MessageIndex": 2,
      "PostDate": "30/08/2015",
      "ThreadURL": "https://patient.info/forums/discuss/what-is-this-rash-under-my-armpit-could-it-be-breast-cancer-i-m-19--466452",
      "Title": "What is this rash under my armpit? Could it be breast cancer? I'm 19?"
    },
    {
      "AuthorID": "pebbalita",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pebbalita-818026",
      "Content": "Hi Sue 'I am an 18 year BC survivor who was diagnosed and MIS diagnosed for 7years when I KNEW my body and insisted on an ultrasound no matter what the oncologists were telling me it was a tiny benign lump.. but I had a private Ultrasound and Voila stage 4 BC..So do not take any chanv=ces hon I guess I had God and a good sense f humor on my side cos I am still here ,,AND it may be benign BUT check it ASAP .Remember the faster it is discovered IF ot is Malignant the SOONER you can start being cured ..Good Luck sweetie and we v=can only give you support and encouragment BUT an ONCOLOGIST . will be the way to go....mamos did not find mine but an ultra sound in a GOOD lab done by a doctor not a Tachnician caught mine .My prayers are with you 'Good Luck do it NOW but do not panic even if bad news I am proof it is not a death sentence ESPECIALLY 18 years later thaan my diagnosis ..they know so much more now...Keep us informed xxx Report",
      "MessageIndex": 4,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://patient.info/forums/discuss/small-hard-lump-under-armpit-bit-worried-527248",
      "Title": "Small hard lump under armpit? Bit worried"
    }
  ]
}