{
  "AuthorID": "pranavi441",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pranavi441-1148578",
  "Posts": [{
    "AuthorID": "pranavi441",
    "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/pranavi441-1148578",
    "Content": "A new mole or change in an existing mole Even though moles are more seen as an indicator of skin cancer, there are times when they maybe a sign of breast cancer. When pigment cells grow in clusters, there is development of moles. These are small growths that can be pink, brown or black and uneven. It is also said that women with more moles are at a greater risk of the disease. Lumps in the breasts Breast tissues in general are of a bumpy texture. However if there is a lump formation in one of the breast that does not seem natural, it might be a sign of concern. It may be the sign of a benign cancer condition so it’s best to not leave it unattended. This lump is irregular in shape, can be painful and definitely needs to be checked by a doctor. Lumps can also develop in armpits and it’s not good if they don’t go away even after the menstrual cycle. This may mean that the cancer has spread to the lymph nodes. Change in the shape or size of the breast Check for puckering, dimpling, thickening of the breast skin that can be indicators of risk. This is sometimes referred to as Orange peel skin. There might be redness, increase in warmth or swelling of the breast. If there is an itching in the breasts, there might be an inflammation that needs immediate attention. Discharge from nipple There can be unusual discharge from the nipples sometimes that can be completely non-cancerous but check for blood stains or crusting. If it happens only in one breast and without any squeezing, there might be chances of an ulcer in the nipple. One of the best ways to prevent breast cancer is regular self-examination of breasts. Keeping these tips in mind is necessary as an early detection is the best way to counter the harmful effects of breast cancer.  Report",
    "MessageIndex": 6,
    "PostDate": "09/02/2018",
    "ThreadURL": "https://patient.info/forums/discuss/could-it-be-cancer--596317",
    "Title": "Could it be cancer?"
  }]
}