{
  "AuthorID": "sonjak",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/sonjak-1033802",
  "Posts": [
    {
      "AuthorID": "sonjak",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/sonjak-1033802",
      "Content": "Lynda, You couldn't have said it better! The Universe did take out the garbage. I was naive and young to admit it to myself so it was done for me. I am so much more happier now.  My prayers and positive thoughts for you and Tina as well.   Report",
      "MessageIndex": 17,
      "PostDate": "18/03/2017",
      "ThreadURL": "https://patient.info/forums/discuss/lymph-nodes-breast-lumps-563171",
      "Title": "Lymph nodes/breast lumps"
    },
    {
      "AuthorID": "sonjak",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/sonjak-1033802",
      "Content": "Lynda and Tina, I was reading through the forums and found this discussion. I too have experienced Lymphoma when I was 24.  Tina,I can tell you from experience what you are feeling is quite normal and any form of positivity will be good for you. Lymphoma is treatable and you can fight whatever you are faced with.  I was engaged and left my home in  the caribbean to be with my fiance and his family in the US.I've never been outside ofmy country before and I felt all alone.  When I found out what I had I didn't really have the reaction of a normal person. I didn't even cry. Sad but true.  I told my fiance and his family whenI got home. My soon to be father in law told my fiance, \"you should decide what you are going to do because you will be left with huge medical bills\". After my first chemo I came home and they all moved out. I didn't know where they moved to but they called a few times and that was it. I was with my fiance for 6 years.  Whatever life hands you, it will make you stronger! It did for me. It's just a path that we have to walk through.  Th worst part in this is the \"waiting game\". Meanwhile do the things you like and be aroundsmiling people.  xo, Sonja Report",
      "MessageIndex": 15,
      "PostDate": "18/03/2017",
      "ThreadURL": "https://patient.info/forums/discuss/lymph-nodes-breast-lumps-563171",
      "Title": "Lymph nodes/breast lumps"
    }
  ]
}