{
  "AuthorID": "stacey1986",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/stacey1986-936732",
  "Posts": [
    {
      "AuthorID": "stacey1986",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/stacey1986-936732",
      "Content": "I had a sudden shooting pain in my right breast and it made me scream out. It only lasted 2 seconds but it happened another 3 times that night. The next day I examined my breast and found a lump, I made an appointment with the doctor who confirmed the lump and found another on the opposite side of the same breast. She said to wait until after my next period and if they are still there to go back. My period isn't due for another 2 weeks but I have since discovered a third lump on the same breast. They aren't painfull to touch but every night I have woke myself up crying out in pain, the same shooting pain I had the first time. My nanna is also suffering from breast cancer and just had her breast removed last week. I do get painful breasts a week before my period but it isn't the same kind of pain and my period isn't due. Has anyone experienced anything similar and what was the diagnosis? Should I go back to the doctors about the 3rd lump or wait until after my period like she said. Thanks for reading. 0 likes, 2 replies Report",
      "MessageIndex": 0,
      "PostDate": "15/04/2017",
      "ThreadURL": "https://patient.info/forums/discuss/cysts-or-cancer--586143",
      "Title": "Cysts or Cancer?"
    },
    {
      "AuthorID": "lynda20916 stacey1986",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/lynda20916-925206",
      "Content": "I would suggest you go back to your doctor and tell her you have a family history of breast cancer, if she doesn't already know.  Because of your family history, it's best to investigate what's going on sooner rather than later, I think. Best of luck to you, please let me know how you get on.   Report",
      "MessageIndex": 1,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://patient.info/forums/discuss/cysts-or-cancer--586143",
      "Title": "Cysts or Cancer?"
    }
  ]
}