{
  "AuthorID": "teresa18635",
  "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/teresa18635-542874",
  "Posts": [
    {
      "AuthorID": "teresa18635",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/teresa18635-542874",
      "Content": "Thank you Marina Dee hugs right back at you It's movable but large, but I can't quite say it's completely smooth. Did you have one of these? If you did any info would be appreciated.thanks for taking the time to reply ! blessings Report",
      "MessageIndex": 2,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://patient.info/forums/discuss/fibromendena-breast-lump-545221",
      "Title": "Fibromendena breast lump"
    },
    {
      "AuthorID": "teresa18635",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/teresa18635-542874",
      "Content": "Hi I'm 51 and found a breast lump . I always go to my mama grams and have lumpy breast my whole life. But I'm scared as I have been referred to get a mamagram and ultrasound because my gyno couldn't tell me what it was. She suspects fibromendena lump . But she would not tell me it wasn't not cancer which scares me. It's a weird firm lump which I can move with my fingers but it's large. I noticed pain during period but after pain went away it was still there. It's not a cyst. Wondering if anyone understands these types of lumps or has any advice how to calm down. Lost a sister to breast cancer Blessings everyone thanks Teresa 0 likes, 4 replies Report",
      "MessageIndex": 0,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://patient.info/forums/discuss/fibromendena-breast-lump-545221",
      "Title": "Fibromendena breast lump"
    },
    {
      "AuthorID": "Marina_Dee teresa18635",
      "AuthorURL": "https://patient.infohttps://patient.info/forums/profiles/marina_dee-8343",
      "Content": "If the lump is smooth and mobile it is probably a fibroadenoma as your gyno has suggested.  She cant tell you it isnt cancer because until she gets the result of the mamogram she doesnt know.    You must attend for the mammogram and ultrasound,so a proper diagnosis can be made. As you have a family history of breast cancer I understand how frightening this must be for you as I have been in the same position myself. Please try not to worry...it sounds as though you are in good hands. Big hug wherever you are.x Report",
      "MessageIndex": 1,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://patient.info/forums/discuss/fibromendena-breast-lump-545221",
      "Title": "Fibromendena breast lump"
    }
  ]
}