{
  "AuthorID": "adventureswithcancer",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
  "Posts": [
    {
      "AuthorID": "adventureswithcancer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
      "Content": "Given that it seems like first line treatment is failing you, I would investigate clinical trials. You are young. I recommend contacting the intake nurses at the NIH. The MATCH trial is a screening trial to see if you are a candidate for the many trials that are available. If you qualify, the NIH pays for your travel. You just have to pay for the first visit. Here is the link to the trial. https://clinicaltrials.gov/ct2/show/NCT02465060?term=nih+and+mat...",
      "MessageIndex": 10,
      "PostDate": "13/02/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/any-input-would-help/",
      "Title": "Any input would help"
    },
    {
      "AuthorID": "adventureswithcancer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
      "Content": "I would talk to your onc. Maybe you need pain/nausea meds. Maybe you need to try a different treatment. I did not have any SE's from Zometa and haven't really heard about many from Xgeva. Don't just suffer in silence. Call your onc.",
      "MessageIndex": 1,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/how-to-cope-4l1q5r/",
      "Title": "How to cope ?"
    },
    {
      "AuthorID": "adventureswithcancer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
      "Content": "Hmm. Interesting. I have been reading the Nature article about the TIL trial that cured me and really trying to understand why it worked for me and not others. I know. It's the million dollar question. In my case, my immune system generated eleven different T-cells targeting four different mutations (the T-cells were both CD4 and CD8 cells). Apparently, this is sort of an average number for when this treatment works. However, my cancer expressed 64 different mutations. So, how do we know which mutations should be targeted? Assuming you could engineer T-cell receptors, would you create T-cells to go after all 64 mutations? I don't know. I still think this is such a complicated disease with millions of different permutations (some curable with standard treatments, some not). My T-cells were going after mutant proteins, not receptors at all. So, I am not even sure that receptors are a great target. Clearly, if you have a huge amplification of ER receptors or HER2 receptors, you may have hit the jackpot. I was in a trial for an FGFR1 inhibitor due to my amplification of FGFR1. But the side effects quashed the trial. Other than receptors, what do you target? Again you are back to protein mutations. Also, if you really start to engineer T-cells to go after every mutation, will you have some sort of auto-immune response? I don't know. It gets scary sometimes.",
      "MessageIndex": 6,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://www.inspire.com/m/fighterm/journal/new-cancer-breakthroughs/?group_id=200170",
      "Title": "New cancer breakthroughs"
    },
    {
      "AuthorID": "adventureswithcancer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
      "Content": "Francine, Here is the link to my trial. https://clinicaltrials.gov/ct2/show/NCT01174121?term=nih+and+til",
      "MessageIndex": 20,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://www.inspire.com/m/fighterm/journal/new-cancer-breakthroughs/?group_id=200170",
      "Title": "New cancer breakthroughs"
    },
    {
      "AuthorID": "adventureswithcancer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/adventureswithcancer/",
      "Content": "Beth, Sorry to hear that you are dealing with this crap. I am a cheap date and little things like Benadryl completely knock me out. Cancer sucks. Big hugs, Judy",
      "MessageIndex": 11,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/dexamethasone-and-chemo/",
      "Title": "Dexamethasone and chemo"
    }
  ]
}