{
  "AuthorID": "chipofbags",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/chipofbags/",
  "Posts": [
    {
      "AuthorID": "chipofbags",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/chipofbags/",
      "Content": "There is often a lot of confounding tumor genetics and hereditary genetics. Brian, I think your post kind of propitiated that by not drawing out that distinction more - they can both be discussed as part of the same topic (if that was your intent - I think it was because you allude to both) but I think many people don't really know they're distinct things.",
      "MessageIndex": 10,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/gene-testing-precision-medicine-and-shared-information/?group_id=200170",
      "Title": "Gene testing, precision medicine, and shared information"
    },
    {
      "AuthorID": "chipofbags",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/chipofbags/",
      "Content": "xavo, just one voice in the fugue here. Not to turn this into a referendum on FighterM but from my observation I would point out that fighterm's posts have not been universally acclaimed regardless of how many accolades she does receive. There also may be a silent majority of members who are passive tolerators, maybe even some disenfranchised by irrelevance. What she really should do is adopt a subscription not junkmail, er broadcast, model. It's bad enough to have to scroll past John2's site-wide dogma every day. And what if multiple people adopted her approach? If you want to blog, there are better ways to do it.",
      "MessageIndex": 5,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://www.inspire.com/m/fighterm/journal/pd1-pd-l1-is-the-superstar-checkpoint/?group_id=200170",
      "Title": "PD1/PD-L1 is the superstar checkpoint"
    },
    {
      "AuthorID": "chipofbags",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/chipofbags/",
      "Content": "For some diseases seems like you could come up with a strategy that involves mixing up the treatments over time, rechallenge etc. One article pondering that: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4540602/",
      "MessageIndex": 15,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://www.inspire.com/m/fighterm/journal/drug-resistance-in-oncology/?group_id=200170",
      "Title": "Drug resistance in oncology"
    },
    {
      "AuthorID": "chipofbags",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/chipofbags/",
      "Content": "Fighterm, I don't think I conveyed you were the author. I get that you're creating derivative work (I'd even argue that's what most bloggers do!). I'm laughing because three of the top five threads on my Inspire start page today are yours. To be clear, I'm neutral on the utility of your threads, but that's not the point. Like I said, if three / five / ten users started broadcasting prolifically, we'd have a different situation, and I'm not sure who'd be the arbiter in that case.",
      "MessageIndex": 16,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://www.inspire.com/m/fighterm/journal/pd1-pd-l1-is-the-superstar-checkpoint/?group_id=200170",
      "Title": "PD1/PD-L1 is the superstar checkpoint"
    }
  ]
}