{
  "AuthorID": "Clinkjet",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Clinkjet/",
  "Posts": [{
    "AuthorID": "Clinkjet",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Clinkjet/",
    "Content": "I do not want to give false hope - we share a disease that lands differently in every body (even with the exact same dx), plus the treatment results can vary widely...nonetheless...I was dx stage IV exactly 7 years ago. My most aggressive treatment was in 2012 (six months of chemo cocktail followed by lumpectomy). For the two years or so past that, I continued Herceptin infusions. I also began a daily oral treatment (Tamoxifen for a couple of years, then switched to Letrozole, which I am still taking). I have been NED since 2012. My life has still changed dramatically, and things have been difficult for me (I'm poor, etc)....but my cancer situation has been unbelievably blessed. Hang in there. Stay strong! On my darkest days (I still have them, for other life reasons plus their connections to my new stage 4 world), I allow myself to be a blob. I cuddle with my kitty on the couch and watch Star Trek, cooking shows, Cspan, Netflix, or sports. On blob days, I keep my life simple and PASSIVE!. I try to keep an eye on my blob days so that I do not drown in them, but I allow them. Over time I have shifted from trying to maintain my old life *despite my cancer....to adjusting to a new life where I do less, but still find much to enjoy and work toward. Even though my health and mental state have improved, I still allow myself my \"blob\" time. At the very least, \"frivolous\" TV keeps me rested, distracted, entertained. On better blob days, I engage media that demands more brain work - eg Cspan history/book programs, movies that require mental investment, or best of all, reading books. All of these activities still involve my couch! I'm fine with that! On other days I aim to engage life without my couchdom. But overall, I have been letting go of maintaining my old lifestyle, while creating a new one that better fits the demands of living with cancer. I figure, the more I find a comfortable but scaled-down lifestyle, the easier my transition will be when my tumors grow again and I go back to aggressive treatment. I think you made a good choice reaching out here - I have found this site to be of great assistance to me. I hope you find answers that help you so that you can keep your spirits hanging in there, and keep going!",
    "MessageIndex": 5,
    "PostDate": "01/04/2019",
    "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/depression-f3w9l6/",
    "Title": "Depression.."
  }]
}