{
  "AuthorID": "DBeahmer",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/DBeahmer/",
  "Posts": [
    {
      "AuthorID": "DBeahmer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/DBeahmer/",
      "Content": "Thank you Hannahd1. I know how aggravating and painful the H&F syndrome can be. People had said that a way to keep a handle on it is to put lotion on 6-8 x's a day. Unfortunately I work full time and have to type, use a pen, answer phones (we own our own business) and if I used lotion that much during the day, I would be slipping and sliding all over the place (both hands and feet). LOL So I use it maybe 3 times a day. First thing in the morning, again in early afternoon and at night before I go to bed. The night time routine is 4 x's a week I lather the hands up really well (use O'Keefe's Working Hands or Gold Bond Ultimate \"Healing\" lotion with aloe) and then put the plastic hospital gloves on and go to bed. It seems to take away some of the pain from the cracking and peeling and they aren't quite as dry. If I do my feet, I do the same at night (or during the day if I wear sneakers) and wear socks to bed. Hope this is a little help for your wife. I honestly can say, I feel for her. I know what she's going through. I have faith that God is watching over me. I know He has already cured me, just not sure if it will be in this lifetime or in His presence. I'm OK either way. Have a Blessed Day! Debbi",
      "MessageIndex": 4,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/switching-from-xeloda-to-kadcyla/",
      "Title": "Switching from Xeloda to Kadcyla."
    },
    {
      "AuthorID": "DBeahmer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/DBeahmer/",
      "Content": "Good Afternoon All! I am going off of Xeloda (yeaaaa) but starting Kadcyla this coming Friday. I was on it quite a while back (about 1-1/2 yrs ago) and after 8 treatments, my oncologist took me off because I developed neuropathy in my feet so bad I couldn't get out of bed for a month. I was told by a friend (2x BC survivor and 2x multiple myeloma survivor) to start taking 2 Alpha Lipoic Acid capsules and 1 Super B Complex pill (both vitamins) a day and in 30 days I wouldn't have the pain. She was right. So I have been on the two above vitamins for that last 1-1/2 yrs and I am doing great where neuropathy is concerned. Of course, with Xeloda I had the hand/foot syndrome which was just as bad. Anyway, just wondering if anyone out there has taken (or is currently on) Kadcyla and what possible side effects I could keep an eye out for. I have, of course, checked out the web to see about side effects. I have had a few already with Xeloda. Just trying to steer my wondering mind where it needs to be. Thanks for any help. Debbi Beahm (Beahmer).",
      "MessageIndex": 0,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/switching-from-xeloda-to-kadcyla/",
      "Title": "Switching from Xeloda to Kadcyla."
    },
    {
      "AuthorID": "DBeahmer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/DBeahmer/",
      "Content": "I extend my condolences for your loss. If there ever is a plus side to cancer, it is that she is cured of it now.",
      "MessageIndex": 1,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/in-memoriam-new-challenges/",
      "Title": "In Memoriam, \"New Challenges\""
    },
    {
      "AuthorID": "DBeahmer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/DBeahmer/",
      "Content": "That is great news Julesxx! Today IS a brand new day. Keeping you in my prayers, Sister Warrior!! Debbi (DBeahmer)",
      "MessageIndex": 15,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/pretty-good-news-julesxx/",
      "Title": "Pretty good news Julesxx"
    }
  ]
}