{
  "AuthorID": "EV11",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
  "Posts": [
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "I got 42 cycles out of I/L... the last 39 at 75 mg. There is post-marketing evidence that the results are nearly identical across all three doses. Based on cell biology and how these meds work, you will get more benefit from being able to complete full cycles and starting the next cycle on time with a lower dose than skipping doses or delaying the start of the next cycle. Go for it! Plus, you may find your fatigue is less. Quality of life is important too.",
      "MessageIndex": 7,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/doctor-is-proposing-a-dose-reduction-of-ibrance-advice/",
      "Title": "Doctor is proposing a dose reduction of Ibrance...advice"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "I looked into this trial last summer. It uses atezolizumab (a PD-l1 inhibitor, a type of checkpoint inhibitor) plus any number of targeted therapies. I really liked a few of the arms-- I did not have \"measurable\" disease so I couldn't enroll. Ate alone is not the most promising of immunotherapy meds, but in comb with one of these targeted medications it may have some efficacy. I'd seriously consider it...I can't do it now that I have measurable disease since I had Xeloda as my most recent treatment, and one line of chemo in the metastatic setting is not allowed per enrollment criteria...so I'm trying to get into a nivolumab (PD-1)/ipilibumab (CTLA-4)/bicalutamide (anti-androgen) trial....should hear any day if I am in. Hopefully one of these immunotherapy combos proves effective against ER+ MBC.",
      "MessageIndex": 1,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/clinical-trials-morpheus/",
      "Title": "Clinical trials; Morpheus"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "Thanks to anyone who visited the site and took the survey...we need a many lobular patients giving input as possible! In gratitude, Elizabeth",
      "MessageIndex": 1,
      "PostDate": "29/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/lobular-breast-cancer-patients-resource-and-survey/",
      "Title": "Lobular breast cancer patients-- resource and survey"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "Search either of these 2 titles (copy and paste them into your browser) for reports of 2 studies that examined the results of 7/7 as compared to 14/7 cycles. Decreased gastrointestinal toxicity associated with a novel capecitabine schedule (7 days on and 7 days off): a systematic review Karen A Cadoo, Devika Gajria, Emily Suh, Sujata Patil, Maria Theodoulou, Larry Norton, Clifford A Hudis & Tiffany A Traina npj Breast Cancer volume 2, Article number: 16006 (2016) Abstract A69: Efficacy of alternative 28-day capecitabine dosing schedule in metastatic breast cancer My onc was a fellow at Memorial Sloan Kettering when one of these trials was being conducted - she puts almost all of her patients on the 7/7 regimen. I've been on it since September with very tolerable side effects-- no GI problems, mild hand/foot symptoms. I hope you are successful in convincing your onc to switch you to this-- although there's nothing to prevent you from doing it this way on your own. I get my CBC and CMP labs drawn at random times-- sometimes at the immediate end of the 7 day \"on\" week, sometimes at the end of my 7 day \"off\" week-- and those labs are almost identical every time....unlike with the CDK4/6i meds there doesn't seem to be 'telltale' lab results that correspond to being on or off the medication at the time of the lab draw. Let us know how it goes with your onc. Elizabeth Edited May 1, 2019 at 10:01 pm",
      "MessageIndex": 1,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/written-info-on-one-week-on-one-week-off-with-xeloda/",
      "Title": "Written info on one week on one week off with Xeloda"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "4 years (this month) de novo MBC-- innumerable bone mets, bone marrow mets, ovarian, colon, peritoneal and bladder mets-- and possible orbital mets. (Yes, I have lobular MBC...it metastasizes to unusual sites.) Doing so much better than one would expect with this kind of extensive disease. For which I am very very grateful. Elizabeth",
      "MessageIndex": 2,
      "PostDate": "24/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/calling-5-plus-years-ned-with-mets/",
      "Title": "Calling 5 plus years NED with mets"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "Yes, Jules, pretty good news indeed! It is so nice when the heaviness lifts for a bit and we get to live in the land of lightness and hope. I'm wishing that you get to be there for a very long time! Blessings-- and enjoy the dawn of a brighter day... Elizabeth",
      "MessageIndex": 12,
      "PostDate": "26/02/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/pretty-good-news-julesxx/",
      "Title": "Pretty good news Julesxx"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "I am so sorry for your loss. May was a remarkable woman, obviously vibrant and talented. My heart aches for you. Thank you for taking the time to tell us about your wife's death. My life partner died very unexpectedly a few years ago, and I remember the bit of shock that came from every message I sent about her death. May your memories of happy times together bring you some measure of comfort in the days ahead. Peace... Elizabeth",
      "MessageIndex": 5,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/in-memoriam-new-challenges/",
      "Title": "In Memoriam, \"New Challenges\""
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "Hi, nuttman-- It was approved YESTERDAY!! YAY!!! Hope your wife gets to try it and has a long, durable response.",
      "MessageIndex": 5,
      "PostDate": "25/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/alpelisib-pi3k/",
      "Title": "Alpelisib, PI3K"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "“summer” is the closest I have heard. It has had excellent results in patients with a PU3K alpha mutation. It’s worth waiting for if your wife isn’t in a visceral crisis.",
      "MessageIndex": 1,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/alpelisib-pi3k/",
      "Title": "Alpelisib, PI3K"
    },
    {
      "AuthorID": "EV11",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/EV11/",
      "Content": "Hi-- I just want to be sure that patients/supporters/caregivers for patients with lobular breast cancer are aware of the Lobular Breast Cancer Alliance. Visit their website for lots of information about early and metastatic lobular breast cancer: https://lobularbreastcancer.org After you have perused the site, please take a minute to complete the survey about how to improve the site/ what topics to consider/ resources to add. There is much that patients and clinicians don't know about lobular breast cancer and this organization is working to educate people about ILC. Thanks for taking the time to check out this valuable resource. Elizabeth",
      "MessageIndex": 0,
      "PostDate": "27/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/lobular-breast-cancer-patients-resource-and-survey/",
      "Title": "Lobular breast cancer patients-- resource and survey"
    }
  ]
}