{
  "AuthorID": "ITGuy",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/ITGuy/",
  "Posts": [{
    "AuthorID": "ITGuy",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/ITGuy/",
    "Content": "One of the things that I've come to realize is that there are different paradigms, worldviews and gaps in knowledge behind any medical advice. The western medical paradigm is a collection of diagnostics and protocols that can be useful, but is over-dependent in pharmaceuticals and procedures, and is more focused on symptom management and biomarkers than on root causes and cures. The medical/scientific research paradigm is interested in how the body and its systems work and how it responds to certain interventions. The research world produces a lot of information that could improve western medicine if it was adopted, but there's an enormous lag between medical research and clinical application. Chiropractors, Osteopaths, Naturopaths, acupuncturists, massage therapists, ayurvedic doctors, Chinese traditional medicine practitioners, nutritionists--they're on the fringe of our medical world, but there are some therapies in that space that work, as well as some that don't. The scientific community is global, so you can find studies on therapies from all those different perspectives. Based on my reading of the scientific research, we are early in the process of shifting to a redox homeostasis model of health management where we make sure the body's antioxidant capacity and oxidative stress levels are appropriately balanced. If not, we address the source of the oxidative stress and bolster antioxidant capacity. This is now how I think about my medical decision-making: have I addressed the sources of excess oxidative stress? What feedback is my body giving me about what intervention is necessary? Is it acute and urgent that I intervene immediately? Do I have strategies where I can solve this myself? The more I learn, the more self-sufficient I become because addressing redox imbalance is an early intervention that typically prevents damage and dysregulation before it becomes complex and difficult to untangle. There will obviously be times in the future where I will need help from the medical community, but a redox health model, with its focus on prevention and early intervention, is designed to minimize that need. This is obviously a much bigger topic than this one post, but if you're interested in learning more or collaborating, friend me and message me. Best wishes.",
    "MessageIndex": 15,
    "PostDate": "24/11/2016",
    "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-do-you-make-medical-decisions/?group_id=200170",
    "Title": "How do you make medical decisions?"
  }]
}