{
  "AuthorID": "JudyMargolis",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
  "Posts": [
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Yep mets to pleura of left lung and mediastinal nodes. I have a neighbour with the same! Also a couple of people on a Facebook group MBC group I follow. Stage 2 BrCa in 2000, metastatic BrCa diagnosed 2017. So far on Arimidex only (4 months of Ribocyclib then stopped due to liver toxicity). No change in the pleural tumours since Dx, but some increase in the mediastinum, indicating probable resistance developing to Arimidex. Looking at changing to another hormone treatment after new scans in a couple of weeks. I’m ER+ HER- . Best wishes.",
      "MessageIndex": 2,
      "PostDate": "24/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/mbc-mets-to-the-pleura/",
      "Title": "MBC Mets to the Pleura"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Yes Patsy weird is right 🤪",
      "MessageIndex": 12,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/mbc-mets-to-the-pleura/",
      "Title": "MBC Mets to the Pleura"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Hilltopper it must be very hard to see your daughter going through this. It’s great that you’re reaching out for information and support. There are likely to be breast cancer support groups in your area, and that face to face support with others sharing the experience can be reassuring and informative. The most important thing, in my opinion, is to have a medical team your daughter trusts and respects, who listen to her and act as equal partners in her treatment. Self advocacy delivers better outcomes in my experience. If she doesn’t like her oncologist or GP, find one that’s a better fit. As far as treatment goes, there are well tested as well as new treatments available for stage IV hormone receptive breast cancer. HER status (+ve or -ve) will be taken into account as well as degree and location of metastases, and other factors. For hormone +ve HER -ve MBC (metastatic Breast Cancer) look at CDK 4/6 inhibitors (Ibrance, Kisqali, Verzenio) which are paired with aromatase inhibitors (anastrazole, letrozole etc). Your daughter’s oncologist should be aware of current relevant clinical trials and they are usually listed online so you can check. There is time! This is a long road with many twists and turns ahead. Warmest wishes to you and your daughter.",
      "MessageIndex": 6,
      "PostDate": "10/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/cutting-edge-treatments-and-clinical-trials-for-stage-iv-breast-cancer-info/",
      "Title": "Cutting edge treatments and clinical trials for Stage IV Breast Cancer info"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Cathy I think terminology is important because it influences the way we think about our disease. I wonder if in Australia, where I am, different terms are used? So far my oncologist has said I’m “relatively stable”, except when my largest tumor grew quite a bit between scans. But that growth hasn’t continued for the following the three months. Meanwhile CA1-53 continues to rise. So I’m not actually stable, just relatively 🤪😂. I do find it confusing, but my oncologist is more interested in how I’m feeling, what clinical signs and symptoms I have, side effects of treatment etc. as well as blood tests and scans. I think any definite statement is avoided. Do others find that too?",
      "MessageIndex": 8,
      "PostDate": "10/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/cutting-edge-treatments-and-clinical-trials-for-stage-iv-breast-cancer-info/",
      "Title": "Cutting edge treatments and clinical trials for Stage IV Breast Cancer info"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Kathy I’ve also had tremendous relief through chiropractic massage and physio prescribed exercises. I was experiencing severe persistent chest and back pain, which turned out to have a musculoskeletal cause (Costo Chondritis). It was my oncologist who suggested this as a possible diagnosis for the pain, then confirmed when I followed up with the chiropractor and physio. Definitely worth considering. I find that once you have cancer, it’s easy to blame every pain and problem on the cancer. Sometimes we just have other issues! Best wishes.",
      "MessageIndex": 7,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/mbc-mets-to-the-pleura/",
      "Title": "MBC Mets to the Pleura"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Just a note about Ricola sugar free pastilles. I looked into these, as I’m trying to find a sugar free cough lozenge. Unfortunately these include Aspartame which has its own adverse effects! So far I’m unsuccessful finding one that is Aspartame AND sugar free 🤨 Any suggestions welcome!",
      "MessageIndex": 5,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/coughing-w35lfo/",
      "Title": "Coughing"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Hi Maria. I’m still on first line treatment, (ER+ve HER -ve) only on Arimidex. I had 4 months of Kisqali as well but developed liver toxicity that took 6 months to normalise after stopping. My onc feels trying an alternative ie Ibrance is too risky to my liver. I’m doing ok on Arimidex, have had increase in largest mediastinal tumour but no progression elsewhere. CA 15-3 has increased in recent months but tumour seems to have stabilised again. Left lung and pleura tumours haven’t changed since Dx. I know of a couple of other people with mediastinal mets. Not as common as lung and other sites. If my next scans show further increase I’ll be switching to aromasin or afinitor. IMy cough comes and goes - it’s annoying but not too awful. I’ve had other symptoms related to the biggest mediastinal tumour, affecting swallowing, voice and what feels like heartburn but isn’t! Hope you can find something that eases your cough. Best wishes 💖",
      "MessageIndex": 9,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/coughing-w35lfo/",
      "Title": "Coughing"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "Hi. I have lung, pleura and mediastinal mets and have had an intermittent dry cough since the get-go! I believe this is a common experience for us. It’s important that your oncologist is aware and checks your lungs at each visit. I manage the symptoms as suggested here. If it gets worse please speak to your onc so you can check for infection. Just because we have MBC doesn’t mean we can’t get bronchitis!",
      "MessageIndex": 4,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/coughing-w35lfo/",
      "Title": "Coughing"
    },
    {
      "AuthorID": "JudyMargolis",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JudyMargolis/",
      "Content": "You’re so welcome. Happy to stay in touch here. Best wishes 💖",
      "MessageIndex": 10,
      "PostDate": "12/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/cutting-edge-treatments-and-clinical-trials-for-stage-iv-breast-cancer-info/",
      "Title": "Cutting edge treatments and clinical trials for Stage IV Breast Cancer info"
    }
  ]
}