{
  "AuthorID": "KLeeR",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
  "Posts": [
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I don't know if the diets I have tried really helped, although I survived 11 months on Gerson therapy without chemo. I got worse , then needed chemo -just like when my chemos failed, I needed a new one. Recently I've been low carb vegan since January. I wanted to lose weight to help my knees from the stress of a blood clot which weakened my right leg. The doctor said each 1 pound lost takes 4 pounds of pressure off the knee. I've lost 38 pounds, so almost 160 pounds pressure off each knee. I feel much better in my legs, the clot pain is gone and I can walk without my cane although I get tired. I also got sciatica and other pain in my left leg which is okay most of the time with the weight loss. I could not lose weight on chemo. I have gained on every chemo. I lost 10 pounds on the Gerson therapy but was already slim before starting chemos. On the following chemos I've gained. I lost the 38 pounds while off chemo doing laetrile. Laetrile only stabilized me 3 months, about the same as gemzar for me, but my blood numbers look good, my weight is in normal range and I feel ready for the onslaught of chemo again. Now if I could just get over my sinus infection, asthma and get my tooth pulled, I'll be totally ready. A few more days should do it. I am set for a low dose methotrexate plus IP6 and high dose liposomal vitamin c . I also hope to fast 14 hours before chemo to increase it's activity. Then I will eat carbs on the chemo day, switching back to low carb the next day. It is a feast famine protocol showing quite a bit of success. I have been blessed to be able to walk 2/3 of the time for the last 6 years , so that is my main exercise!",
      "MessageIndex": 5,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/question-for-mbc-5-years/",
      "Title": "Question for MBC 5+ years"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "Abraxane got rid of the cancer in my lungs 4 years ago.",
      "MessageIndex": 1,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/anyone-with-a-secondary-breast-cancer-in-lungs/",
      "Title": "anyone with a secondary breast cancer in lungs ?"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I tried opdivo and had a severe reaction , causing my body to attack my glands and not necessarily the cancer. I was hospitalized 5 days with the worst headache possible for 5 days. I was also on ativan and that probably caused my out of control blood pressure at the same time. A number of people have had their pancreas completely shut down with no warning, causing them to go into abrupt diabetic shock, whether or not they were ever diabetic. It caused my thyroid tsh to go over 100. I don't know if it is my adrenal gland or thyroid affected. I recently read that all the mice in original research that were overweight or elderly , died while on it. THAT is something I would have been glad to have seen before taking it, because I am somewhat elderly and was somewhat overweight at the time. I read that the percentage of side effects is much higher than originally presented.",
      "MessageIndex": 1,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/has-anyone-been-treated-with-immunotherapy/",
      "Title": "Has anyone been treated with immunotherapy?"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I am very glad to read this worked so well for you.",
      "MessageIndex": 6,
      "PostDate": "30/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/graduation-day-clinical-trial/",
      "Title": "Graduation Day Clinical Trial"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I take info from many sources. My husband and I listen to the doctor and do research and then make a choice, if I am well enough to make a choice. In dire circumstances, it is usually a hospitalist I am working with in addition to my husband. I have been especially impressed with all 4 of the hospitalists I have had experience with. Two saved my mother's life and 2 have had a major impact in my survival. The opinions of my 3 children are also very high on my list, but they are very careful about giving advice and rarely do. I appreciate the opinions of many on Inspire and often follow the threads they attach to various research articles.- KLee.",
      "MessageIndex": 11,
      "PostDate": "24/11/2016",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-do-you-make-medical-decisions/?group_id=200170",
      "Title": "How do you make medical decisions?"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "This is great news ! Thank you for letting us know.",
      "MessageIndex": 9,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/new-approved-drug-for-hr-her2-mbc-with-pik3-mutation/",
      "Title": "New Approved Drug for HR+, HER2- MBC with PIK3 Mutation!"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I agree with so many of these comments. Getting out of the house to my scrabble club or to church or shopping help me. So do walks and prayer. I take ativan(lorazapam) to stop chain thinking that won't stop. For me it takes only one pill and my mind moves on to more productive thoughts. I have been a bit depressed myself lately because nothing seems to be helping that I've tried, but my radiologist pointed out that I have already beaten the odds several times, especially having started with nuclear grade 3 cancer 10 years ago, which is usually fast growing, I say \"usually\" because I refuse to give cancer any credit for being fast growing! I hope you feel better soon. It really is hard at first. If I knew more way back when, I would have gotten counseling, especially when both my parents passed away only 2 months apart. I would get counseling away from my cancer center though, because how can a person be honest when everyone on \"the team\", \"shares\" everything. I have always felt \"in house\" counselors were like legal defense front runners for the hospitals, used to put out brush fires. But that is just my opinion.KLee",
      "MessageIndex": 12,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/depressed-tnbc/",
      "Title": "Depressed...tnbc"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I got numbness in my chin two days ago. I also started to get pain on the back of my skull yesterday. I have a new chemo set up in 2 weeks, but the pain is pretty bad. These things always happen on a weekend when no regular docs are in. We set my chemo out 2 weeks so I could get a tooth pulled and also over a sinus infection. I hope I get those fixed before I can't take the pain of an unbearable headache. I am taking hydrocodone to cope.",
      "MessageIndex": 20,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "Oh dear, both Beth and Anne! That is really scary to lose a vocal chord, but I am glad it can improve. The sinus med and rinse is good to know about. I still perform and compose music so I may think twice about the radiation for my numb chin that my rad onc recommended yesterday. He is getting me an mri as soon as possible because of the skull met pain. I may wait for the chemo instead , before going ahead with radiation.Thanks for your help Beth in getting me motivated. I think it is strange that pain that has been bugging me, making it very difficult to sleep without pain meds ( that I almost never take)thank God! , suddenly gets better before getting in to the oncologist. I am thinking maybe the upper back tooth extraction done yesterday, or being almost done with the doxycycline for a sinus infection may have somehow helped the pain across the back of my head? At least the mri will show if anything is worse. My hubby is on the 4 th day of severe kidney stone pain, so we are grounded at home today. We had to stop several times driving to rest.",
      "MessageIndex": 5,
      "PostDate": "30/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-herceptin-my-drippy-nose-and-my-throat/",
      "Title": "Kadcyla/Herceptin, my drippy nose, and my throat"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "My back is hurting badly after driving my hubby and getting in and out of the car so much off the ground. I feel like I am falling apart. My ca 15-3 came back another 100 points higher today at the GP. I called and asked them if they could move the chemo up a week at the cancer center, which is totally NOT me. I even threw up my Cancer Care Oncology meds so had to go off my low carb diet to keep anything down. I may have to go full on high dose chemo if I can't take supplements or liposomal c. I had to tell my husband I was \" crying uncle\". He didn't know the phrase, being raised in Scandinavia.",
      "MessageIndex": 6,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-herceptin-my-drippy-nose-and-my-throat/",
      "Title": "Kadcyla/Herceptin, my drippy nose, and my throat"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I understand too. We are okay or maybe not! I am waiting for my CA 15-3 to come up online. My liver numbers were up way over normal last month and the alp is up a little. Then I got my liver tests yesterday for this month and hallelujah one dropped 200 points and the other dropped over 100! I had stopped cimetidine and 2/3 of my niacin dose because they can cause occasional liver problems. And I skipped 3 days between laetrile shots instead of 2 in case that can raise liver numbers. My alp is up only 4 points above normal. So I am back pretty close to okay except for waiting on my CA 15-3. It has been increasing and like the liver numbers it jumped last month. I think that everything was due to the flu, a bad case but I also changed as much as I thought might help. The flu also went to the lungs as asthma for a month and I was on albuterol on my machine four times a day and at night. But that is over, so everything could be okay but if the CA 15-3 is worse the doctor already scheduled a scan. Isn't this a roller coaster! KLee Edited May 3, 2019 at 2:05 am",
      "MessageIndex": 4,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/id-rather-bet-on-the-stock-market-than-my-tumor-markers/",
      "Title": "I'd Rather Bet on The Stock Market Than My Tumor Markers"
    },
    {
      "AuthorID": "KLeeR",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/KLeeR/",
      "Content": "I am so glad you are doing better.",
      "MessageIndex": 1,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://www.inspire.com/m/WorriedTooMuch/journal/thank-you-inspire-friends-for-helping-me-get-to-this-point/?group_id=200170",
      "Title": "Thank You Inspire Friends for Helping Me Get To This Point!"
    }
  ]
}