{
  "AuthorID": "mandyhiero",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
  "Posts": [
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Hi everyone! I don’t know that I’m in the right place as I do not have a diagnosis of breast cancer. But I just wanted to know what everyone thinks based on your experiences. Long story short, or as short as I can make it, about a year and a half ago, I found an indention on my breast about the size of a 50 cent piece. After seeing my ob/gyn she sent me for an ultrasound and mammo. Those came back clear. I still wasn’t convinced I didn’t have breast cancer so my ob/gyn referred me to a breast oncologist. She looked at the indention and did a breast exam and said it looked fine, and if the tests came back fine, she thought i didn’t have anything to worry about. I went for a few months trying to convince myself that she was right. I just couldn’t feel good about it but just continued to try to go on as though I was fine. I put it to the back of my mind, but last November, I woke up with my chin and lip feeling kind of weird. I would get a zapping feeling in my lip about 20 times a day. After googling, I found out about numb chin syndrome. It scared me so much because the main cause is metastatic breast cancer. My nurse practitioner ordered an MRI of my brain to rule out MS and it was clear. So I went back to the breast oncologist and she ordered another mammogram to be done. It was benign findings and showed benign calcifications. Once again, I put it out of my mind and tried to forget about it. Well, now here I am 6 months later, with a somewhat numb chin, almost like dental anesthesia is wearing off and you just start to get the feeling back, and every time I smile, I get a zapping feeling in my lip. I saw my nurse practitioner and cried my eyes out to her about what was going on and she ordered an MRI of the mandible. I went to get it done and they said they don’t do them of the mandible, so they changed it to a soft tissue neck MRI. It came back clear, even stating that the mandible was unremarkable. You would think I would feel fantastic after hearing that, but I’m so afraid they didn’t do the right test to see cancer and they’ve missed something. I’m terrified. I’m 36 with 2 little girls and I’m so afraid I have breast cancer they never found and I’m gonna leave my two babies motherless. I have an appointment Wednesday with an oral surgeon to see about getting my impacted wisdom tooth cut out, so they’ll be doing panoramic xrays showing my jaw, but what else should I be doing? I also have a neurologist appointment in july but that seems like forever away. Edited May 20, 2019 at 10:39 am",
      "MessageIndex": 0,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Hi VikingWarrior! I actually asked for an MRI but was told insurance wouldn’t pay if I didn’t have a palpable lump. Which is the pits because I understand that lobular cancers don’t always show up on mammo and ultrasound.",
      "MessageIndex": 9,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Thank you for sharing stephbos! I’m scared to death that there’s a tumor in my mandible. I’m actually at an oral surgeons office now to set up surgery to get my impacted upper wisdom tooth out. They’re getting ready to do xrays. I’m so scared it’s going to show a tumor. This morning my chin started to tingle. It’s only done that a couple of times and not for this long. I’m praying it’s something simple that the oral surgeon can tell me is causing it.",
      "MessageIndex": 11,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Hi jlhigbie! Thank you for your advice! I did ask about a biopsy also but she said since there wasn’t a lump then they couldn’t biopsy. The breast surgeon said without a lump that insurance wouldn’t pay for MRI. I’m at a loss as to where to go from here.",
      "MessageIndex": 8,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Thank you! I had my panorama X-ray at the oral surgeon’s office and he said everything looked normal and that MRI would have picked up any tumors soft tissue or in my mandible. I’m still scared because I still have the tingling in my chin. I could forget about it if it didn’t tingle all the time. I called the neurologist office to see if I could get in sooner and she said they’ve not had any cancellations so I still can’t get in until July. I’m so frustrated because everything I’ve read on numb chin syndrome says it should be handled as emergent because of the grave prognosis. I’m sorry. I know all of you who are battling breast cancer have way bigger things to deal with. I appreciate that you all are taking time out to answer my questions and give me advice.",
      "MessageIndex": 14,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Unfortunately I asked and they said that was the soonest with the neuro that is in network with my insurance. I’ve called every day to see if they’ve had any cancellations and no such luck. I’m praying because I just want answers. I have aches and pains all over and every time I worry that it’s cancer that’s spread to my bones. My anxiety is in high gear these days. My primary care doctor started me on Wellbutrin 3 weeks ago but so far it hasn’t helped me. I’m just scared.",
      "MessageIndex": 16,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "I called and finally got a sooner appointment to see the neurologist. I go June 18. It still feels like forever away, but it’s so much better than July 23! I’ll keep you all posted on what’s going on. Thank you all for your advice and kind words!",
      "MessageIndex": 19,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Hi Worriedtoomuch! Thank you for your advice! I also worry too much. I have anxiety which makes all of these matters worse. I do have pain in the breast with the indention. My breast surgeon said that it’s nothing to worry about. I respect her because she’s a great doctor and actually a breast oncologist, so she does see breast cancer every day, but I still have a gut feeling they’ve missed something by not doing an MRI. When I mentioned it she told me that the insurance wouldn’t pay unless I had a palpable lump. I just don’t know what else to do if they won’t order the MRI.",
      "MessageIndex": 7,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    },
    {
      "AuthorID": "mandyhiero",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/mandyhiero/",
      "Content": "Thank you, beatez! I’ll definitely look into that. I’ve been doing an anti-inflammatory diet following a guy named Dr. Josh Axe. His mother had breast cancer and it has metastasized and that diet and following her doctor’s advice she is now cancer free. She did do chemo too, but I believe the diet helped a lot. So, I do want to do whatever I can to keep it at bay if this is indeed cancer. My pain is in different spots for the most part but it does tend to show up In the same spots at times. Like in my upper thighs and arms. It’s just unnerving when you think it could really be cancer. I also think maybe I’m hyper-sensitive to the pain because it’s always in the back of my mind, no matter what.",
      "MessageIndex": 18,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/numb-chin-icsabo/",
      "Title": "Numb chin"
    }
  ]
}