{
  "AuthorID": "Nigelsmom",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Nigelsmom/",
  "Posts": [
    {
      "AuthorID": "Nigelsmom",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Nigelsmom/",
      "Content": "It came without fanfare, no marching band & 12 weeks early (I guess you could call me a premie). Two years ago in April of 2017 I was diagnosed with MTNBC. The cancer had spread to my lungs, pelvis, ribs & spine. Yeah, devasted was my heart after suffering through a lumpectomy, T&C chemo, pulmonary embolism, infection & finally a double mastectomy (all of which happened in 2015). Oh & how could I forget the park ave plastic surgeon who abandoned ship in the middle of reconstruction. My lil heart was hardened. Ice cold. So, when I received my diagnosis in 2017, I was cold, steadfast...a product of 2015. Change, I needed it. I required it. Walking away from my original team who found no value in genomic testing & did not think I could get into a trial was scary, but necessary. The second & third opinions provided info I had never heard before. “You have lots of TIL’s”, “If your going to try for a trial, go for a double agent”, “You’ve got a 15%” chance” “Tumor Mutational Burden Matters”. So off I went, on my own. Found a trial, immunotherapy only double agent (IL 2 & Opdivo) & entered 12 weeks after diagnosis. Eight weeks later first scan showed reduction. Fast forward almost 2 years later & scans continue to show scaring, but no progression. Lungs, spine & ribs clear. First 10 months on trial were a lil rough (side effects arthritic pain, skin peeling & severe fatigue for 72+ hrs). Second half of trial, smoother with 1 down day (benedryl), because I was only on the Opdivo & stopped IL2. Finally, I started having some short term memory issues. Losing my train of thought & inability to immediately recall a name, or rember incidence. Cognitive...I was a lil fuzzy for the first 72 after treatment. It reminded me of chemo brain. I played games, dialed telephone numbers & studied research, to keep my mind sharp. Eventually the PI and I together made the decision to stop early. 12 weeks shy of the 2 year completion date. The PI believes that I’ve had a complete response. It was the very first time he’d used those words. I was humbled & grateful. My clinical team supported the decision, we knew the day was coming. They just we’re a lil bummed to see me go. They were an excellent team and I’m forever grateful for their expertise and accompanying me on this journey. Lastly I like to say to all the folks here that you all inspire me. I move around the country now, sharing my story and I often mentioned that our community is a educated and resilient one. We just want the chance to thrive and survive with a decent quality of life. As patients we are no longer just going to sit by & accept a diagnosis. We have questions, share information & do tons of research. We are active, and I’m part of a very special support group. And to all my TNBC peers I was on the west coast recently. After my presentation a woman joined me. She was a 16 year TNBC thriver. I hugged & rubbed her arm for good luck. I could not stop staring at her. You see she had a reoccurrence 5 years after her primary diagnosis. The cancer had come back in her chest walk & lymph nodes. She was treated “off label” & has been in remission for 11 years. I always knew, we are out here! I just needed to get out & see it for myself. For now, I’m in monitoring stage with s scan every 3 months. So, I’m going to try and get on with life (a lil exercise, yoga meditation & music) and continue to try and make a difference.",
      "MessageIndex": 0,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/graduation-day-clinical-trial/",
      "Title": "Graduation Day Clinical Trial"
    },
    {
      "AuthorID": "Nigelsmom",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Nigelsmom/",
      "Content": "Thank you for posting this rUBZebra. Personally this article is the most eye opening, I’ve read this year. I’m totally engrossed with the subtypes, differences and grabbing a firm understanding of what this means. Very interesting. Especially the C3 subtype. Once I looked up the meaning of adaptive immune system, the bell in my head rang! It’s going to take me s while to reread & break it all down, but THIS is very interesting, especially in regards to future therapeutic targeting.",
      "MessageIndex": 4,
      "PostDate": "26/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/hopefully-good-news-for-tnbc/",
      "Title": "Hopefully good news for tnbc"
    }
  ]
}