{
  "AuthorID": "Pambayer",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
  "Posts": [
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "Thanks lisa. So good to hear. Kenz was feeling so down after the second failure this year. Will hopefully start next week. Will let you know",
      "MessageIndex": 3,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "Any problem with hair loss?? KenZ lost all when she was 21. Was hard. Hope not again.",
      "MessageIndex": 4,
      "PostDate": "02/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "Hi. Will head to dan farber again tomorrow. 61/2 hour drive. Will have bunch of tests and brain mri. She hasn’t had one in several years nor complete pet scan. Worried since her2 pos. Often mets to brain. If all is good can start on this drug which is supposed to work even if her2 low and even after failure on tdm1 and herceptin. She is used to the diarrhea fatigue and nausea from current drugs. Hoping it will get her cancer under control until they come up with a immunotherapy that actually has success in breast cancer. Pam",
      "MessageIndex": 7,
      "PostDate": "05/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "She is at Dana Farber, she is Her 2 low I believe though this is not entirely clear as no one actually says this. I am not sure of her dose though she is in DS 82001a trial. I will try to find out.",
      "MessageIndex": 16,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "So kenz has had first dose and is 4 days out. Terrible headaches and feeling nauseous but not throwing up. Hopefully will get better if figure out what will help with side effects Trying acupuncture next week. Weed seems to help some. So far can tolerate but going to be a hard drug. Any suggestion for head aches??",
      "MessageIndex": 12,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "thank you, I am not sure if they are giving her anything at the infusion for nausea. Does the acupuncture work for headaches and nausea? Where are you being treated? So how are your scans? Does it appear to be working? I am hopeful and wish that we could add on an anti PK-1 drug to assist the immune response. They are doing this in clinical trials in Japan and in a couple here in US. https://adcreview.com/news/nivolumab-ds-8201-evaluated-her2-expr... https://clinicaltrials.gov/ct2/show/NCT03523572 Would love to know if anyone is involved in this study. thank you again.. will keep in touch pam",
      "MessageIndex": 14,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "lisa, what are you using for the nausea- we can't seem to get it under control.. now on a patch for motion sickness but no good either. Her tumor shunk very little but will get another CAT next month and will have had 4 sessions by then. Side effects are very hard for her - very tired and throwing up constantly for almost 2 weeks, third week is fine. Also getting significant depression during first 2 weeks. Any thoughts.. ??",
      "MessageIndex": 19,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    },
    {
      "AuthorID": "Pambayer",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Pambayer/",
      "Content": "my daughter is going to start on this drug in 2 weeks at clinical trial at Dana Faber.. I would appreciate any additional information on how it is working for any of you and side effects? She failed on TDM-1 and is Her2 low, Er+, Pr- , Pik3CA mut, FGFR-1 mutation. I have done as much research as I can find on this drug and the clinical trials that are on-going. Would like to know if the trial with Nivolumab combo has started and if anyone in this. She is stage 4 and only 27 (not Braca) - still looking at other options but this does look very promising. Thank you Pam",
      "MessageIndex": 0,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/ds-8201/",
      "Title": "DS-8201"
    }
  ]
}