{
  "AuthorID": "saintrose",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/saintrose/",
  "Posts": [
    {
      "AuthorID": "saintrose",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/saintrose/",
      "Content": "Hi Jeanette, I have been on Faslodex and Ibrance 75 mg. for 18 months. I started on 125mg, then 100mg and now 75mg. The dose was changed because of low Absolute Neutrophil count. My hair started to thin quite a bit at first, but as time went on got less and less. Also, the texture of my hair changed and the color got darker, I do have fatigue, but nothing that I can't manage. I had a cat scan after one year and everything remained stable, my tumor marker numbers have gone up , even though no increase in activity occurred. I have mets to lungs and bones. The Faslodex injections can be a little uncomfortable, I always remind the nurse to please stay away from the sciatic nerve, you may have two lumps on your butt after the injections but that is normal. All in all this combo is the best I have been on. I hope you have great success with this and that we both can be on it for a long time. Also, my appetite has been great on this combo, I can eat anything with no problems. Best of luck to you !!! Saintrose",
      "MessageIndex": 9,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/faslodex-and-ibrance-t7gjup/",
      "Title": "Faslodex and IBrance"
    },
    {
      "AuthorID": "saintrose",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/saintrose/",
      "Content": "HI moonbeam, I have had that cough for years, I also have mets to the lungs. I was on Faslodex and Ibrance but now have progression, so don't know where I go from here. My doctors have told me, there is not much they can do about this cough, it is so annoying to myself and every one else. I have a prescription for Tesalon Perles that does help somewhat with the cough. Of course I live on cough drops, also take Prilosec for acid reflux. It is just constant and sometimes quiet severe. My onocologist thinks it is because of where the cancer is located in my right lung. I have tried so many different things with no relief, I hope yours goes away on it's own , or you can find something that works for you. saintrose",
      "MessageIndex": 10,
      "PostDate": "05/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/coughing-w35lfo/",
      "Title": "Coughing"
    }
  ]
}