{
  "AuthorID": "shoofoo",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
  "Posts": [
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I have been through a similar nightmare. In 2007 I had a single sided mastectomy. (In retrospect, how I wish I had had a double mastectomy and just gone flat back then, but nobody was even mentioning that option). In 2008 a silicone implant was put in the right side. It was never right. The blob kept rising higher and higher. I felt disfigured and was very lopsided. As well as in a lot of pain. Finally, in 2012, I got my insurance to approve DECONSTRUCTION surgery. The plastic surgeon tried to convince me to let him put in a smaller implant and see how that worked out, but I was so fed up with both how I looked and how much it hurt, that I just wanted it out. I didn't care about having a breast. So, I had the silicone breast taken out. 10 days after that surgery my hip started hurting, and that was the beginning of my metastatic diagnosis. After that, nobody wanted to talk about \"cosmetics\". I still wish I had both breasts removed at the beginning and I was just flat chested. My oncologist says that any surgery for me now is risky and keeps advising me to not do it. I'm not happy with being a uni-boober now. But I guess it's the least of my worries. I would never put more silicone implants in. Nor would I go through the flap procedure. Lord knows that would wake up more cancer cells in me. Edited May 23, 2019 at 3:04 pm",
      "MessageIndex": 3,
      "PostDate": "23/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/explant-surgery/",
      "Title": "Explant Surgery?"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "Thanks all. I am still getting the Kadcyla every 3 weeks but have convinced the powers that be that I can get by without the Dex. I find that I may be a little head-achy for a couple of days after the infusion, but overall I am in much better shape without the Dex than with it. I do take the Benadryl and Zofran. Everyone is different, I guess, and I am super sensitive and don't sleep well from at least a week if I get the Dex. That, in itself, makes me miserable.",
      "MessageIndex": 14,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/dexamethasone-and-chemo/",
      "Title": "Dexamethasone and chemo"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "Keep reaching out, angelical. This is a very depressing disease. When I was first diagnosed I heard talk of total hip and pubic bone replacement. I thought I was crumbling and wondered how a person lived without a pelvis. Like you, I could not think about anything but this horrible fate that had befallen me and an awful death that was coming soon. In order to get some kind of control I chanted mantras. All the time. Whenever my mind started down its obsessive and ruminating road, I picked up the mantra. I had friends who were supportive, but I felt very alone with my thoughts and sickened with worry. I think the mantra what got me through those first few months. Hang on. Lots of love, shoofoo",
      "MessageIndex": 3,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/depressed-tnbc/",
      "Title": "Depressed...tnbc"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I was on Kadcyla 3 years ago for 6 months and had a very hard time with fatigue and headaches. I am now on Kadcyla again (since Dec 2018) and it is going a bit better. I still struggle with headaches and nausea for a few days post infusion, but the fatigue is not so bad. I almost feel \"normal\" the 2nd and 3rd week after infusion. I had nose bleeds and mouth sores before, but not this time around. Could my body be getting used to it? Also no neuropathy problems so far, but this is the side effect my oncologist always asks me about, so I assume it is common. Good luck with it. I don't especially like Kadcyla, but I'm trying to get my head around the notion that I'm going to be on it long term. Or until it stops working, and then I'll be on something that is worse as far as side effects go. love to all of us, Beth (shoofoo)",
      "MessageIndex": 3,
      "PostDate": "21/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/switching-from-xeloda-to-kadcyla/",
      "Title": "Switching from Xeloda to Kadcyla."
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I am pretty wiped out the first few days after Kadcyla infusion, but by the 2nd week I'm ok. I've found that exercise helps me to keep up. Even as little as 20 minutes on a treadmill or a 20 minute bike ride will pull me out of a fatigue. Swimming is really good too. I don't do anything strenuous, and sometimes I have to force myself to move, but it's becoming my 1st answer to the fatigue of Kadcyla.",
      "MessageIndex": 2,
      "PostDate": "30/04/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-avzi9p/",
      "Title": "Kadcyla"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I remember, just after my reconstruction surgery in 2008 (which I eventually had deconstructed), I was in a sporting goods store and tried on a \"sports\" shirt. It was then that I realized that I would never be \"normal\" again. This kind of clothing would never work for me. I was forever changed. I think that was the first time that I became totally unglued and cried about my breast cancer diagnosis. Then in 2012 the metastatic journey began, and I have been chemo'd and scanned regularly for these last (almost) 7 years. There have been highs and lows. I never thought I would live through 2014 (brain mets). And there have been times I think that I'm going to live to an old age. I'm trying to get used to the every-three-weeks-stuff, but I never do. I'm always aware, at some level, that death could be just around the corner. \"Normal\" seems to be relative for me. I get your sensitivity WorriedTooMuch. There is so much waiting around, half naked, in examining rooms, poking and probing of my body. Sometimes I wonder how we get through this medical jungle. Thanks for sharing so honestly. Beth (shoofoo)",
      "MessageIndex": 1,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://www.inspire.com/m/WorriedTooMuch/journal/the-clerk-called-me-sir-and-my-visit-to-memorial-sloan-kettering/?group_id=200170",
      "Title": "The clerk called me \"Sir\" and my visit to Memorial Sloan Kettering."
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I think that my problem is the dexamethasone. I have been on dex many times over the course of my MBC journey. To decrease brain swelling and with chemo. I seem to be especially sensitive to it, in that it wires me out and I generally cannot sleep properly (or at all) until it is mostly out of my system. I am now on Kadcyla and getting 10mg of Dexamethasone as a premed. I asked for the lowest dosage. I also get Zofran and Benadryl. I understand that the Dex is to control nausea and inflammation. I admit that for a couple of days after the chemo I have more energy than usual, but I don't get more than 2-3 hours sleep, and that is after taking 1/2 of a .25 mg Xanax. My face and chest appear flushed and though I may not be nauseous, I have terrible indigestion. I feel totally wired and out of sorts. It is only after 5 or 6 days post chemo that I feel like I am somewhat returning to \"normal\". What are others experiences with Dex? Can I ask to do the chemo without it? Thanks, Beth (shoofoo)",
      "MessageIndex": 0,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/dexamethasone-and-chemo/",
      "Title": "Dexamethasone and chemo"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I do the best I can to eat well and exercise. Some days are better than others. I try to stay away from sugar and junk, eat good (organic) vegetables and fish or meat that is local and fresh. I've drastically cut down on wine - I used to have a glass of wine most every night; now I only have a glass about once a month when we go out. I try to keep my stress levels controlled. I do some easy yoga and breathing meditations. Again, some days are better than others. I try to do some kind of exercise every day. I don't like to walk because of hip replacement, so I alternate bike riding, swimming, and gym weights. It seems I don't do anything \"religiously\", but I think I'm staying on top of things as best I can. My weight is mostly the same + or minus 5 pounds. What I'm running low on is ENERGY. I think chemo takes its toll. Some days I feel like I'm pushing against a very thick fog. Best to all of us, Beth (shoofoo)",
      "MessageIndex": 6,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/question-for-mbc-5-years/",
      "Title": "Question for MBC 5+ years"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "If there is one thing that my MBC diagnosis has taught me, it is that every day is a gift and a wonder, and that we are all going to die. I treasure each day, and the people that I love, but I also am acutely aware that death is part of life. Every month people that I have come to know and love mysteriously slip away. People on this forum. I don't know the answers, I don't know where they go, but I know that there is no use in avoiding death. It is better to accept it. These brave people show me the way. When it becomes clear the the medications are no longer working for me, I don't intend to be a martyr, just to stay alive a few days or months longer. My family knows this, especially my husband. I tell him that when I can no longer be conscious or comfortable, to please let me go. And that my love for him will always be with him.",
      "MessageIndex": 6,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://www.inspire.com/m/WorriedTooMuch/journal/choosing-life-aa20mk/?group_id=200170",
      "Title": "Choosing Life"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I thought I would share the story of my drippy nose and my throat. Since 2012, when I was diagnosed with HER2+ metastatic breast cancer, I have been getting (among other things), either Herceptin or Kadcyla. Every 3 weeks for almost 7 years. As most HER2+ people know, these drugs can cause drippy nose. I thought it was just one of the lesser side effects, and I had to just live with it, and keep wiping my nose on my sleeve. About 8 months ago I started having a voice problem. Like, I sounded gravelly, low. And if I talked too long, I started coughing, I always had this tickle in my throat. I talked to my oncologist about it and she suggested I go to my ENT. My ENT said that my right vocal chord was paralyzed. They looked to see if there was any cancer in my throat, and there wasn't, so everybody gave a sigh a relief and sort of forgot about it. And yet my throat kept bothering me. And I kept coughing. Last week I went back to the PA at my ENT's office - Jared. Jared is the best. He listened to me and looked again down my throat. He said my right vocal chord was still paralyzed and my 3rd tonsil was irritated and very enlarged. He said I had an awful lot of dripping in my nose. He gave me a prescription for a nasal spray to dry out my drippy nose, he told me to gargle 3 times a day with a mixture of hydrogen peroxide and water and salt. And he gave me a prescription to see a speech therapist to improve my voice. Lo and behold, my throat is finally, after 8 months, getting better. My mouth and throat don't feel so \"dry\". The tickle in my throat has gone away and I'm not coughing anymore. I haven't started with the speech therapist yet, but I will soon. What I learned: DON'T PUT UP WITH THE DRIPPY NOSE!! This nasal spray - IPATROPIUM BROMIDE NASAL SOLUTION 0.03% - somehow dries up my nose so that my mouth and throat stay moist. The Kadcyla dries out my mouth and throat while causing the drippy nose. I thought this was a minor side effect, but it became major for me.",
      "MessageIndex": 0,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-herceptin-my-drippy-nose-and-my-throat/",
      "Title": "Kadcyla/Herceptin, my drippy nose, and my throat"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "$^%&%$&^ the Nurse Navigator! There are some people in this world who are so full of themselves that they need to be blown off. They are not worth our time or our attention. The Nurse Navigator sounds like one of these people. She didn't respond to you when you were at your most vulnerable. She's not worthy of any more of your thoughts. It's hard, I know. But you have to find your own dignity and worth within yourself, and she is in your way. Blow her off, royally. (and I would report her to your oncologist. Complain!) shoofoo",
      "MessageIndex": 9,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/depressed-tnbc/",
      "Title": "Depressed...tnbc"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "I hope things start getting better for you KLeeR. I know how it is to have those awful days (and nights), and \"cry Uncle\"! This is one scary disease.",
      "MessageIndex": 7,
      "PostDate": "31/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-herceptin-my-drippy-nose-and-my-throat/",
      "Title": "Kadcyla/Herceptin, my drippy nose, and my throat"
    },
    {
      "AuthorID": "shoofoo",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/shoofoo/",
      "Content": "Bestbird, did your paralyzed vocal chord wake up? In the last couple of years my right supraclavicular node as well as nodes in the mediastinum have been lighting up on Pet Scan. I had the area radiated. After radiation was when my voice started going. I had a good scan, so they discounted radiation or cancer causing the vocal chord to go. Then it all started lighting up again on Pet Scan. I started Kadcyla. Last Pet Scan (2 weeks ago) shows everything calmed down. Nothing really lighting up but a little bit of the supraclavicular node. We've discussed damage to the laryngeal nerve from either radiation or a tumor pressing against it. I had an expert throat guy look at the Pet Scan and he saw nothing that was affecting the nerve. But -- they tell me that once the laryngeal nerve is damaged, it rarely will heal itself, no matter what caused it to go. They say that my right vocal chord will likely always be paralyzed. My best bet is to work with a speech therapist, they say. My voice does, indeed to be getting better. (They say that my left chord is learning how to compensate for the paralyzed right one). Is your vocal chord working again? Thanks, shoofoo",
      "MessageIndex": 3,
      "PostDate": "30/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/kadcyla-herceptin-my-drippy-nose-and-my-throat/",
      "Title": "Kadcyla/Herceptin, my drippy nose, and my throat"
    }
  ]
}