{
  "AuthorID": "Stillhere-1",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
  "Posts": [
    {
      "AuthorID": "Stillhere-1",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
      "Content": "Thank you for your thought-provoking post. It makes me sad that there are people out there who think that life is no longer worth living. Perhaps it's that devastating \"no cure\" statement given by our Oncs that make us fight so hard. Around 8 years ago I remember talking with my young breast surgeon ( I had a slow descent into stage 4 with several local recurrences and at that stage was \"curable\") I told her that if I got mets I would stop treatment. She told me that she felt the same about palliative treatment. 6 years ago I did turn stage 4! I have never wanted to live more...I will go through any treatment to stay on the planet and will fight on with all my strength! The last 6 years have been the most precious gift and new drugs and therapies are happening. I am lucky that my hospital is not only a specialist one in UK but is also a major trials centre. We always have the option of saying \"enough\", but I would prefer the option of saying \"I choose to live for another 20 plus years\" as healthy people do.",
      "MessageIndex": 1,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://www.inspire.com/m/WorriedTooMuch/journal/choosing-life-aa20mk/?group_id=200170",
      "Title": "Choosing Life"
    },
    {
      "AuthorID": "Stillhere-1",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
      "Content": "That's interesting Bestbird. I have a PIK3CA mutation, not sure what exactly as it was part of a UK trial. I've written before that I have had 3 years out of a Taselisib/ Palbociclib combo trial where I believe Taselisib is a similar drug to Alpelisib. For some reason mine has, I think been discontinued which is sad as it worked exceptionally well for me despite being heavily pre-treated. Let's hope that the new one works for lots of people x",
      "MessageIndex": 4,
      "PostDate": "28/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/new-approved-drug-for-hr-her2-mbc-with-pik3-mutation/",
      "Title": "New Approved Drug for HR+, HER2- MBC with PIK3 Mutation!"
    },
    {
      "AuthorID": "Stillhere-1",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
      "Content": "Thanks Bestbird, Alpelisib certainly has much less toxicity and a slightly better outcome so I hope will be a success. It's been a relief to stop buying truckloads of Imodium Instants certainly!!",
      "MessageIndex": 7,
      "PostDate": "29/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/new-approved-drug-for-hr-her2-mbc-with-pik3-mutation/",
      "Title": "New Approved Drug for HR+, HER2- MBC with PIK3 Mutation!"
    },
    {
      "AuthorID": "Stillhere-1",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
      "Content": "Hi, I am also in U.K., in Sussex and dip into this forum as well as Breast Cancer Care. You might find that one helpful if you haven't already? I think we all get depressed at times...with good reason, lets face it!! A massive hit physically and mentally at once. It really helps sharing on forums and knowing that we are not alone. I also have actively searched for ways that help me cope, different for everyone I know. For me it is the outdoors, nature, my animals..dogs and horses and obviously my family...maybe not in that order!! I am lucky that, even after nearly 6 years stage 4 I am physically in quite good shape so can exercise a little. Hope this helps a bit...and there are lots of us out there who wish you well. Take care x",
      "MessageIndex": 4,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/depression-and-breast-cancer/",
      "Title": "Depression and breast cancer"
    },
    {
      "AuthorID": "Stillhere-1",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Stillhere-1/",
      "Content": "Hi, I have nothing written but I am treated here in UK at a top cancer specialist hospital and they put me on 7/7 regime which was successful for 2.5 years with very manageable SEs. I was told that in their experience it made no difference to its effectiveness and was preferable to reducing the dose due to adverse reactions.",
      "MessageIndex": 3,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/advanced-breast-cancer/discussion/written-info-on-one-week-on-one-week-off-with-xeloda/",
      "Title": "Written info on one week on one week off with Xeloda"
    }
  ]
}