{
  "AuthorID": "10Marie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/10Marie",
  "Posts": [{
    "AuthorID": "10Marie",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/10Marie",
    "Content": "Surgery, six months of chemo, radiation, then Femara. I was told I must remain on the drug for a lifetime, unlike most for a period of five years. I experienced all the unpleasant, painful effects of Femara, to the point where standing from a sitting position and walking became difficult and painful.  I was switched to Arimidex.  During this period, I expected to see significant hair growth.  My hair grew back, much thinner than my long, thick, brown mane.  I began to see a lot of scalp up top and my hair ceased to grow on top, while becoming thinner and thinner.  It was explained to me by the dermatologist that while the Femara and Arimidex was doing it job, so was the tostosterone.  It was behaving as it would in a man's body.  The hair loss on top is typical of the manner in which a male will lose his hair.  There is no remedy, except for Rogain, which must be applied twice a day.  I have not begun the use of Rogain.  I would be interested in an update of your situation. On 10/18/2005 Lynnzbug wrote: I started taking Femara in January 2005 after five years of Tamoxifen. About June, 2005, my hair started to fall out in massive amounts by September I had bald spots on my head. I used to have very thick hair, now I look like a scare crow with scraggly thin hair. I stopped taking the Femara for about a month now and the hair is still falling out. Although I must say that all the bone and joint pain has stopped. I used to feel like my feet were just stumps on the bottoms of my legs. They were totally numb and I had a hard time walking. That has totally gone away as well as the knee pain and other aches. I've seen a number of doctors about the hair loss because at first I didn't associate it with the Femara. No one seems to know why this is happening. Anyone else with this problem?  ",
    "MessageIndex": 6,
    "PostDate": "05/12/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3201,0.htm",
    "Title": "Femara & Hair Loss"
  }]
}