{
  "AuthorID": "2younglinda",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/2younglinda",
  "Posts": [
    {
      "AuthorID": "2younglinda",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/2younglinda",
      "Content": "I was diagnosed in July with stage1 grade 3 IDC breast cancer at age 32.  I thought I was too young for all of this.  Guess again...  I thought I was doing well, I had a lumpectomy (0 of 4 nodes), 33 treatments radiation, and am about to have my second of 4 treatments of AC.  I thought I was on the uphill of all of the treatments, but after reading several of these postings it seems like, Guess again.....  I came to this message board for some hope and encouragement and I guess I received that in a sense.  You have given me hope that it could be much worse I should feel lucky.  What I really feel is that this is just the beginning of a very long disease that will never be won.  I read almost 30 of these postings and it doesn't sound like anyone is winning this battle.  Everyones seems to have come back and even worse.  Am I fighting a losing battle?",
      "MessageIndex": 0,
      "PostDate": "26/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8457,0.htm",
      "Title": "Guess Again"
    },
    {
      "AuthorID": "2younglinda",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/2younglinda",
      "Content": "Jelly, Thank you so much for your reply and support.  I think you are very correct about the survivors and maybe that will help me to come back to these sites when I am \"cured\" to give hope to those that are surviving.  I think I am just a little down and having a pitty party for myself.  I see that you are a patient.  What is your story if you don't mind me asking? I am having another one of those down days.  I just had my 3rd treatmet of AC today and the doctor has now advised that I continue treatment with 4 treatments of Taxol following.  I thought I was almost done (1 treatment left after today) and the rug was pulled out from under me (\"Guess Again\").  She say's that it is purly preventative based on the fact that I am handling the AC so well and that I am so young that I should do all I can to increase my odds. Instead of 2 weeks left I now have at least 11 weeks.  I know for many that's not much, but for me it was a major step backward.  Take Care and Bless You, 2Young",
      "MessageIndex": 2,
      "PostDate": "17/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8457,0.htm",
      "Title": "Guess Again"
    }
  ]
}