{
  "AuthorID": "500smwhr",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/500smwhr",
  "Posts": [
    {
      "AuthorID": "500smwhr",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/500smwhr",
      "Content": "You cannot help but worry. It's natural.  If my head hurts my first though is brain metastisis.  Every ache seems to bring a worry of some sort, but we have to move past it.  Just try to remember... we all die in some way or another.  It's inevitable.  Cancer only makes us look at the reality of it before most people. It makes us think about it, and most people never think about it at all. I have adenocarcinoma of the lung, Stage IV, and was told I'd be lucky to live a year at 42.  I will be 46 in December.  I posted once before and you may have missed it.  I knew of a woman who had breast cancer, radical mastectomy, chemotherapy, radiation, post-meds, etc.  She fought for years.  When she finally felt better she decided to go back to work. She was killed in an auto accident her first day back.  What I'm trying to say is.... we will all go, some how, some way.  We cannot waste our moments worrying.  For every moment we waste worrying, we've lost a moment of living. I am on Tarceva and the side effects are miserable.  I just try to look at it in a positive way.  Chronic diarreah every single morning of my life. I stop two or three times just on my drive to work.  Without being too graphic... I just think to myself \"there go the little cancer cells, right down the toilet\". It's the only way you can make it through all of the effects that come with everything.  I have bone pain from chemo, chest and back pain from radiation, stomach aches from God knows what... but I just keep telling myself...  the alternative to the side effects is death.  And I'm fighting way to hard to die. Try to eat right and try to get strength spiritually.  A hypnotist told me \"when an oncologist tells you that you are going to die, your subconcious heads in that direction because it listens to authority\". But we can control that.  We can choose to think otherwise.  We can demand control of our care. My oncologist said I had a year.  I replied \"you don't know me\".  And I meant it.  They only know the disease. They don't know the fighter behind it. Stay positive, and try to turn the side effects into something good as well. There's a silver lining in every cloud. Most importantly.... take control of your life.  You are the only one who truly can. ",
      "MessageIndex": 5,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17158,0.htm",
      "Title": "Recurrance"
    },
    {
      "AuthorID": "500smwhr",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/500smwhr",
      "Content": "You've been through so much already, there's no way you can't get past the rest.  I am a lung cancer patient - 47 years old, told I would live less than a year, five years ago. It's all in the mind.  Be strong, think positive, eat right, and try to read encouraging things and stay away from the \"statistics\".  A book that might give you some inspiration is \"Lynn Front to Back\", and is sold on Amazon. I love it. Even though I am not a breast cancer patient, her book gave me alot of inspiration, and the drive to move forward and not believe everything my oncologist told me. If I'd have listened to him, I'd have been dead four years ago.  Keep the faith and think positive. ",
      "MessageIndex": 3,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30440,0.htm",
      "Title": "Need a pep talk"
    }
  ]
}