{
  "AuthorID": "addison41",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/addison41",
  "Posts": [{
    "AuthorID": "addison41",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/addison41",
    "Content": "  On 6/18/2007 Daughterdb wrote: Hi. I am a daughter of a mom with metastatic breast cancer to her liver. She is only 53. Its been a few years now since she was diagsnosed with stage 1 lobular cancer. she was put on tamoxifin and had a double mastectomy...awhile later she returned to show 3 spots on her liver. the doctors read them out as hemangiomas. three months later she came back, she had full blown mets in her liver. just telling that makes me so angry...anyways, back to it. she did the minimal chemo, she believes in organic foods, good nutrition, supplements, alterative treatments. to say the least chemo made her feel horrible and she felt horrible putting that into her body. so she began alternative options and  started to lose support from the conventional docotrs which is a whole other story, that also frustrates me...well she did her own treatments, and felt great, looked great, sounded great...but 5 weeks ago she had a CT and it is progressing, so she agreed to go on femara. now she feels horrible, the pain is intense, her belly is bloated, and i feel so helpless....not to mention scared. i feel sometimes like the anger is overwhelming these days. why my mom, why any of us? why is it so hard to find a good doctor? why is life so unfair?   Any advice out there would be much apprecitate Well, like many of the others who have responded, I am right there with you.  I am 38 and my mother is 58 and Met.Br ca in spine, shoulders, tail bone, hips,live and right aux. lymph nodes.  This is her second time fighting breast cancer.  IN 2002, she was diagnosed with breast and ovarian caner at the same time and with treatment went into remission..then December `05 found out it metas.to her spine.  She had immediate back surgery to remove a tumor in her spine but had been doing well until just a couple months ago.  Now she spends her days on the couch in pain, can't hardly get around,etc.  What do I do?  I can't stand seeing her like this. She is such a beautiful, Christian lady.  she is praying for a healing touch from God.  God can heal her, but I don't know if that is His plan.  She is all I have.  My dad was killed in a trucking accident when I was a young child.  My mom and I are very close and I can't stand it that his ishappening to her to our family.  She doesn't deserve it...she was on Arimidex but it stopped working and she now is on Aromasin.  I too feel helpless and hurt that she is hurting.  I love her so much.  I feel your pain...I am sorry I don't have advice as I am right there with you.  I am trying to help myself..so any advice from anyone would be appreciated. Rona",
    "MessageIndex": 9,
    "PostDate": "29/08/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13594,0.htm",
    "Title": "Help. Its my mom..."
  }]
}