{
  "AuthorID": "alady",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/alady",
  "Posts": [
    {
      "AuthorID": "alady",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/alady",
      "Content": "Hi, I've posted on the prostate cancer site as my husband had that.  He was cured using HIFU, years ago.  They use HIFU in Europe, the UK, Japan, Korea, China for breast cancer.  HIFU is high intensity focused ultrasound, it is very similiar to lazer, the only difference being the length of the sound wave is longer than with lazer.  So, they treat brain, pancreatic, liver, etc. with HIFU.  It won't work for lung cancer as the sound wave gets lost in the air.  There is a cure for cancer!  It was invented in 1941 in Indianapolis, Indiana for cancer.  The French recreated the device 23 years ago and now have hundreds of HIFU centers in Europe.  The USA will only allow HIFU in clinical trials, and then the hospitals that have the trials don't tell any patients about the choice, so the trials are empty.  The company who owns the HIFU device funds the trials, so it doesn't cost the hospital anything.   There is one hospital which tells people about the trial they have, and it has been completed, they have 95% success.  It's in NYC.  If HIFU fails, then you just do it again.  I've never heard of not getting all the cancer the second time. Quite a few American doctors travel outside the USA to treat men using this, this is how my husband got the treatment.  He got it in Puerto Vallarta, Mexico.  There's no cutting, no pain, and no side effects.  Dr. Stephen Scionti from Boston does this.....he could tell you stories...he treated my husband. It's sickening how the USA treats us.  I even went to a MD Anderson lecture on cancer and asked them about HIFU durning the Q&A session, they said they didn't know about it - because they didn't want to discuss it !!  (It was in trials at their hospital !)  The next year I went to the lecture again and brought the subject up again....once again they shut me up quick.  The next year I went to the lecture .....this time they wouldn't allow any audience questions or participation. You go girls, this chesiumchloride sounds interesting....is it like MMS?  I will google it now. The reason I am here --- is now I have breast cancer, so I'm looking around.  I've been thinking of going to Europe or the UK for HIFU, but you girls have me thinking of these other ideas.  I will not do radiation or chemo under any circumstances.  And going on a crazy diet doesn't fit with me, I am slim. I also wonder how long does it take to kill?  Is it like prostate cancer and take 20 years?   Did you all quit hormones?  There's some chance I'd end up in prison if I quit them!! (: Thanks for the posts ladies, you got me up from feeling down.  I am not alone.",
      "MessageIndex": 13,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68740,0.htm",
      "Title": "untreated breast cancer for around 8 years. What next?"
    },
    {
      "AuthorID": "alady",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/alady",
      "Content": "Spring flowers, I keep reading what you said, \"cancer cells cannot live in a alkaline enviornment\" But I have a friend who spent his life working in a hospital lab, and he says its pure nonsense, that you cannot change the PH of your insides.  You can eat all you want to try but it will correct the PH instantly, or you would die. Anyway, thanks, I went to the lazer center and read everything, it looks good, HIFU also is a hour procedure and you are back at life, but it cooks the cancer and leaves the ash inside.  Lazer takes it out.  Amazing that only one doctor does this! I heard on the news that the average take for a cancer patient is one million dollars.  gulp, and then you are dead. I really thank you for your interest and post, and I think you are great for being here helping.  Best to you in life!!  I'll keep you posted. The orginal poster on this thread probably had a cyst....",
      "MessageIndex": 16,
      "PostDate": "29/10/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68740,0.htm",
      "Title": "untreated breast cancer for around 8 years. What next?"
    },
    {
      "AuthorID": "alady",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/alady",
      "Content": "Merck has a write up about how sonogram, a form of ultrasound is used instead of mamogram.  When they find something with the sonogram then they do a mamogram for percision location. I think this is how it should be done, as sonogram is so much less painful and it's cheaper, and as you found out - it sees more! Bottom line - most likely $$$, they make more money doing mam first.",
      "MessageIndex": 1,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68655,0.htm",
      "Title": "ultrasound for breast cancer!"
    }
  ]
}