{
  "AuthorID": "Allybally",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Allybally",
  "Posts": [
    {
      "AuthorID": "Allybally",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Allybally",
      "Content": "I had a mastectomy and reconstruction (diep flap) in February this year. I am very disappointed with the result as the inside area of the breast has what I've been told is fat necrosis. It basically looks like a chunk of my breast is missing and the skin quality there is awful, I am 49 but that area of the breast looks like it belongs to a woman of 80. My surgeon has told me that I can have a fat injection to fill out that area which basically involves more surgery and liposuction. She didn't fill me with confidense when discussing it and implied that the operation has risks and I may not get the result I am looking for. Has anyone else had anything similar and what was the result? I got the impression that my surgeon would like me to leave it as it is but I feel very depressed about it. I have to be very careful what I wear and I am always conscious of it. I also find it very difficult seeing other women in their low cut t-shirts, I know that I will never be able to dress without worry again. Shopping for clothes is not something I enjoy doing anymore.",
      "MessageIndex": 0,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61146,0.htm",
      "Title": "Fat necrosis after diep flap reconstruction"
    },
    {
      "AuthorID": "Allybally",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Allybally",
      "Content": "Thank you. I'm not sure how I stand getting a second opinion as mine was done by the NHS. I'll have to do some research. Good luck with yours.",
      "MessageIndex": 2,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61146,0.htm",
      "Title": "Fat necrosis after diep flap reconstruction"
    }
  ]
}