{
  "AuthorID": "ally10home",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ally10home",
  "Posts": [
    {
      "AuthorID": "ally10home",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ally10home",
      "Content": "Would love to hear from anyone who is on Faslodex inj. combined with daily Femara.  Diagnosed at 28, now 43, this has been my treatment for the last 3yrs.  Side effects seem to be worsening such as joint stiffness, bone pain, back pain, sleeplessness, etc.  My doctor has no plan of stopping this treatment as long as it is working and I understand b/c my cancer is so sensitive to hormonal manipulation. Advil does not help much.  I'm just tired and worn out!",
      "MessageIndex": 0,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37253,0.htm",
      "Title": "Faslodex injections combined with Femara"
    },
    {
      "AuthorID": "ally10home",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ally10home",
      "Content": "I have been on anti-estrogen therapy for 13 years.  This is my second round with Femara.  For the last 3yrs I have been on Faslodex monthly injections along with Femara daily.  I thought my most recent side effects were related to the long term Faslodex but I'm beginning to think maybe it is the Femara.  I would love to hear from anyone else who might be on this same treatment.  I'm 43 and have lived with re-occuring breast cancer for nearly 15years. I try to walk 45 min nearly every day and push myself to stay busy and not give in to the aches. Most recent PET scan was clear. In the last few months I've noticed more and more lower back pain, joint stiffness, nerve pain shooting into my right leg, and just overall bone pain in my legs.  I have actually lost weight and the last few months have only been sleeping about 3-5 hours a night even with sleep Rx.  My doctor is great and I know she has extended my life way beyond the statistics but I'm beginning to get discouraged and she has already told me as long as this is working she has no plans of taking me off.  I have not talked with her about the recent increase in pain b/c of course there is some fear about stopping the treatment.",
      "MessageIndex": 8,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    }
  ]
}