{
  "AuthorID": "ankak",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ankak",
  "Posts": [
    {
      "AuthorID": "ankak",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ankak",
      "Content": "Take a dental floss and pass it trough your teeth after several hours of your last time you brushed. Smell it.  If it smells like old people/death, and that is also the smell of your partner, that is a sign of low immunity/low oxygen/fermentation.l that allow widespread infection of some bacteria that live in the mouth and usually keept under control. But with ageing and low immune system it can colonize the whole body and bring coronary diseases,  cancer, organs infections. Cut all sugars, flours, meats. Prefere raw vegetables. Flush liver, take a good mix of live probiotics non stop for many months, sunbathing to stimulate immune system.  Look into fasting. That will create a huge die off of bacteria and fungus.",
      "MessageIndex": 1,
      "PostDate": "26/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88123,0.htm",
      "Title": "Bad smell in my partner"
    },
    {
      "AuthorID": "ankak",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ankak",
      "Content": "Hello, looking for some hints about Femara prescription, especially considering the side effect. My friend is almost 70 years old, just had a tumor mass removed from her breast 15 years after the first one. Now she has not metastasi and chemio was not prescribed because the tumore was too close to the hearth and she was had surgery to heart before. Her test result negative to estrogen and progesterone receptors but still got femara prescribed. Is there any reason to ptescribe femara in such conditions?",
      "MessageIndex": 0,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,87939,0.htm",
      "Title": "negative to estrogen receptors but got Femara prescribed"
    }
  ]
}