{
  "AuthorID": "Annamaria",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annamaria",
  "Posts": [{
    "AuthorID": "Annamaria",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annamaria",
    "Content": "  On 10/17/2007 annalittlebit wrote: I was diagnosed with breast cancer in 2003--I underwent surgery for one breast, chemo and radiation. I have been taking arimidex since. Although I try not to dwell on the possibility of recurrance I find that sometimes I worry a great deal about the cancer coming back.  I also think at times that I want to stop arimidex due to the side affects which I live with daily. Does anyone have input to , or share my concerns??  Please respond. I just stumbled upon this website this morning and am hoping it is a good place to be.  Friends who have not shared my experience cannot relate to my feelings on these matters.   Hi Anna, I too have had surgery, chemo and radiation for breast cancer and like you, I take Arimadex daily. Along with my surgery 39 lymph nodes were removed. Everyone worries, in our situation about the likely hood of cancer returning. Every day is a gift. I am lucky not to have any serious side effects with taking Arimadex. Quite honestly I would be scared not to take it. I eat mainly vegetables and fruit with a little chicken or fish at times. Of course I enjoy the occasional freedom from my diet and enjo life. Before my dance with cancer I was a size 14 and now, with diet and a healthy lifestyle I am a size 6. I am having my port removed in december and my oncologist told me that if my cancer markers were negligible in May I will not have bloods drawn unless a problem arises. What good news. There have been so many success stories and with God's help you will be one of them,  God Bless,  Annie ",
    "MessageIndex": 2,
    "PostDate": "18/10/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17158,0.htm",
    "Title": "Recurrance"
  }]
}