{
  "AuthorID": "Anna6890",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Anna6890",
  "Posts": [
    {
      "AuthorID": "Anna6890",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Anna6890",
      "Content": "I am going through something similar now. I'm 37, my mom had a very aggressive form of breast cancer when she was 42, hers started as a small spot they found on a mammogram at the beginning of one mine the, they did a biopsy 2 weeks later and found it was cancer, then they did a lumpectomy 2 weeks later and it had spread and covered all the margins, and they had to do a full mastectomy within 6 weeks of the original mammogram. I got my first mammogram March last year and everything was fine. Then last month I noticed a small lump in my left breast near my armpit. I didn't think much of it because I had a hysterectomy about 5 years ago so I'm not sure of my cycles, but my daughter got her first one about the same time. I figured I'd just monitor it. About 2 weeks ago I checked again and it was still there and I had also noticed it was a little sore. I even had my husband check it and he felt the lump too. It's small but definitely there. I called my doc and last week she did an exam and was also able to feel it. yesterday I went in for the diagnostic mammogram and ultrasound. They gave me the option of having them mammogram both and I figured it'd be a good idea just to be safe. When they did the left breast it hurt a significant amount. Right breast didn't really phase me. The radiologist told me after that everything was normal. They didn't tell me what it was and I just figured maybe it was a fatty deposit or something. They did tell me to follow up with my doc. Today my doctors office called and just from sheer curiosity I asked what was causing the lump. The nurse told me the results showed dense breast tissue and calcification patterns and that I should get my next mammogram next year but they weren't real sure what the lump was. Needless to say I have questions now so I go in next week to see the doc and get questions answered. Do any of you have done recommendations if what I should ask? I am concerned because if family history plus it is really starting to hurt, almost burning. I want to be as prepared as possible. Thank you for any advise.",
      "MessageIndex": 67,
      "PostDate": "08/02/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    },
    {
      "AuthorID": "Anna6890",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Anna6890",
      "Content": "On Feb 17, 2017 5:38 PM Jules775 wrote: Hi Anna. Did you go for your dr. Appt? What was the outcome?At the follow up the doc told me there was calcification, but they think it's benign. Problem is though, my mom had the same type of results when she was 42 and it ended up being a very aggressive form of breast cancer. They are sending me to a breast surgeon for a biopsy just to be safe. I'm sore where the lump is constantly, I'm not sure if that matters at all, it's just bothersome. I'll be glad once the doctor referral comes in and I can get the biopsy done and get more definitive answers.",
      "MessageIndex": 69,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    }
  ]
}