{
  "AuthorID": "Annielb",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annielb",
  "Posts": [
    {
      "AuthorID": "Annielb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annielb",
      "Content": "Hi Julia, I am new to this site my name is Ann and I am 50 years old. I was diagnosed with Breast Cancer in May 2003 I went through surgery, chemo, radiation, and more chemo. I had herceptin for 52 weeks, I was cleared of cancer in Dec. 2004, however I got really sick in December of 2005 and that is when I found out the cancer went tt my liver, I too am now taking herceptin and navelbine, it sounds like this treatment worked for you. Did you have many side affects while on this tratment. I was so scared when my cancer returned and still am, so it is realy nice to chat with someone who has gone through the same thing as me. Although I have a wonderful and supportive family they can't answer these types of questions. Julia, you sound like you are doing remarkably well. Thanks for letting me chat. Take Care Ann Brideau",
      "MessageIndex": 24,
      "PostDate": "13/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1311,0.htm",
      "Title": "Breast Cancer Metastasi to The Liver"
    },
    {
      "AuthorID": "Annielb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annielb",
      "Content": "Hi Julia, I live in southern New Hampshire. Thank you for responding I feel the same as you it is nice to talk to someone who knows what we are going through. I am still on the hereptine and navelbine. The only side effects I get extreme lower back pain and headaches. I work part time, however I am hoping to go back to work full time soon, as I love my job. I believe I have a pretty good attitue most days, but then there are days I get frustrated becasuse I get so tired. I get a shot of procrit every week for my red blood cells, and my husband me gives me a shot (nuprigene) on Sat and Sunday's for my white cells, everything seems to be working just fine. My e-mail address is --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html ---- Take care and hope to hear from you soon. Ann",
      "MessageIndex": 26,
      "PostDate": "15/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1311,0.htm",
      "Title": "Breast Cancer Metastasi to The Liver"
    }
  ]
}