{
  "AuthorID": "Annie_v",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
  "Posts": [
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hello, I know you are scared, but I am a 3 1/2 year survivor of stage 3-A breast cancer. I also had two tumors in my right breast, the largest over 5-cm. I had one lymph node involved of the 20 they removed. I was 34 years old when diagnosed and had no family history. I am doing great and cancer-free. I also have a dear friend who just finished her treatment of a 7-cm mass, and has been declared cancer-free.  You can absolutely beat this cancer! I became very depressed when I was undergoing treatment, but the cancer institute I was treated at had a psychologist on staff who specialized in cancer patient depression. I cannot tell you what a difference it made to talk to an outsider. It was difficult to express my fear and sadness to my family, because I did not want to further upset them. My family was terrified, so I tried to seem upbeat around them, while I was crying inside. After my diagnosis, we adopted a chihuahua puppy (Josephine), she gave me a reason to get up every morning and refocus my energy. After we received her AKC papers in teh mail, I realized she was born the same day I found the lump in my breast. I feel she was meant to be my little angel and she never left my side.  Going through treatment will stink for about a year, but payoff will be well worth it. It makes me mad when doctors do not take a patients fear into account. Oncologists tend to be very matter-of-fact and in my experience are not necessarily compassionate.   Keep your chin up, you will have many, many years of life. When you look back on this years from now, it will be a distant memory.  ",
      "MessageIndex": 14,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18890,0.htm",
      "Title": "SO Scared!"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hello, I know you are scared, but I am a 3 1/2 year survivor of stage 3-A breast cancer. I also had two tumors in my right breast, the largest over 5-cm. I had one lymph node involved of the 20 they removed. I was 34 years old when diagnosed and had no family history. I am doing great and cancer-free. I also have a dear friend who just finished her treatment of a 7-cm mass, and has been declared cancer-free.  You can absolutely beat this cancer! I became very depressed when I was undergoing treatment, but the cancer institute I was treated at had a psychologist on staff who specialized in cancer patient depression. I cannot tell you what a difference it made to talk to an outsider. It was difficult to express my fear and sadness to my family, because I did not want to further upset them. My family was terrified, so I tried to seem upbeat around them, while I was crying inside. After my diagnosis, we adopted a chihuahua puppy (Josephine), she gave me a reason to get up every morning and refocus my energy. After we received her AKC papers in teh mail, I realized she was born the same day I found the lump in my breast. I feel she was meant to be my little angel and she never left my side.  Going through treatment will stink for about a year, but payoff will be well worth it. It makes me mad when doctors do not take a patients fear into account. Oncologists tend to be very matter-of-fact and in my experience are not necessarily compassionate.   Keep your chin up, you will have many, many years of life. When you look back on this years from now, it will be a distant memory.  ",
      "MessageIndex": 10,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18890,0.htm",
      "Title": "SO Scared!"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "I was diagnosed with stage-3 BC in 2004 at the age of 34. I have no family history, and was too young to have had a single mamm prior to finding the lump in my right breast. I had right breast mastectomy  (cancer was over 5 cm), aggressive chemo and radiation. Now I wish I would have been more aggressive in my wish to have both breasts removed. However, at the time I was very distraught and confused. I listed to my Oncologist's recommendations and had only the cancerous breast removed. I cannot take hormone suppression therapy, because I developed severe blood clots in my juggular vein and down my right are 3-weeks into treatment with Arimidex. Needless to say, I feel like my left breast is a ticking time-bomb. I did (against my oncologists wishes), have my ovaries removed to cut down on the estrogen in my body since I can not take the Arimidex, which was supposed to be a big part of my treatment plan. I have approached my oncologist about having my remaining breast removed and he shuts me down and will not really discuss it with me at all. My oncologist is an older male, and has been doing this a long, long time, so I wonder if he is right, or if I am. The mental stress this causes alone should be reason to have this done. I never want to go through this again, and have no reason to keep my left breast. I do not even care to have reconstructive surgery, even though I have discussed it at length with two top plastic surgeons in the state; it is just not that important to me. My husband is just glad I am here and does not care about my missing breast (he is a leg man anyway). I was not even given the opportunity to have gene testing done, which bothers me too. I have a mother, sister and niece, so the gene testing is important for them too. I think when I see the oncologist in January, I am going to request gene testing and go from there. We have a new, wonderful female surgical oncologist in the area, and I will get a second opinion from her if needed. However, I am afraid of offending my current oncologist. If my cancer would come back, I would most likely receive treatment from him, and I hate to burn bridges. Can anyone offer guidance here?",
      "MessageIndex": 5,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17396,0.htm",
      "Title": "Bi-lateral Masectomy"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "I started on Arimidex after chemo and radiation, and in about 3 weeks, I developed blood clots in my juggular vein and right arm. I can no longer take hormone-suppresive meds, so I feel a little like a sitting duck. I had estrogen-receptive cancer, and was supposed to be on Arimidex for 5 years. I had a surgeon remove my ovaries to help lessen some of the estrogen production. My cancer was very large, over 5-cm, and I was only 34 when diagnosed. My Oncologist will not even speak with me when I try to discuss having my other breast removed, he just shuts down the conversation. It is very upsetting since it is my body, and the other breast feels like a ticking time bomb to me. ",
      "MessageIndex": 5,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "I know what you mean about feeling better. After all the treatment, I felt as though I lost some of myself (beside my breast). I wanted to feel better physically, so I could feel better mentally.  The chemo put me in full-blown menopause, which was horrible. After the treatment, I had my ovaries removed, and went right back in menopause (a bit difficult when you are only 35).  I do thank god for each day; I am so grateful I am still here enjoying life. Happy New Year to everyone! ",
      "MessageIndex": 7,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Because of your BC history, I would demand a biopsy immediately. I had stage-3 BC 3.5 years ago, and if anything odd shows up on my mamm, I want it looked into right away. The mental stress it is causing you alone is reason to get it looked at right away. If the radiologist feels it is nothing, he/she is probably right, but for peace-of-mind, I would demand it be acted on quickly. Once you know for sure it is nothing, you can relax and enjoy the upcomming holidays.",
      "MessageIndex": 2,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18564,0.htm",
      "Title": "what should I do"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hello, I was also diagnosed with stage 3 BC in 2004 (doing great now). After Mastectomy, chemo, rad I was put on Arimidex. I was supposed to be on Arimidex for the next 5 yrs, but within 3 weeks, I developed blood clots from my juggular vein all the way down my right arm. The doctors do not know if the clots were caused by the Arimidex or the radiation. The right side was my cancer side, so my chemo port was in my chest area on the left. I was on blood thinners for 6-months and doppler image is clear. However, I am a little anxious about not being on hormone suppression therapy as originally planned. This was supposed to be a big part of my treatment plan, so I feel a bit like a sitting-duck. I did have my ovaries removed even though my oncologist felt it was unnecessary. I was only 34 with no family history when I was diagnosed. I cannot say what caused your clot, but my guess would be your chemo port. I was told when they put mine in that clots often form around the port. A piece of a clot may have broke loose in your case and adhered to the wall of your vein. I was a little freaked out when I first found out about the clots, but they got the situation quickly under control, and I am fine now. Keep your chin up!",
      "MessageIndex": 1,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18496,0.htm",
      "Title": "Blood clots after chemo?"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "I posted a reply to this a moment ago, but forgot to mention. When I had my clots, another patient of my Oncologist had another lady with the same problem. This must not be all that uncommon of an occurance.",
      "MessageIndex": 2,
      "PostDate": "06/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18496,0.htm",
      "Title": "Blood clots after chemo?"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "I am glad I could help.  I sometimes think this happened to me so I could help others.  For me, going back to work has been a blessing. I do not dwell on the illness, and it got my life back to a level of normality I desperately craved during the dark days.  Let me tell you a little story. When I was first diagnosed, I had been contemplating getting another dog, having lost my precious little doggie to cancer a year or so before.  We did get my dog (Josephine), she is a chihuahua.  That little angel made me have to get out of bed everyday, because she needed my care. She never left my side during my entire ordeal.  When I got her AKC papers, I realized she was born on the same day I found the lump in my breast. She was sent here for me.  Not long after I received my first breast prosthesis, I looked down the hall, and here she came carrying my boob in her mouth.  Now, this dog never does things like that, it was way up on my dresser for heavens sake.  Although I was pretty horrified, I still got a pretty good laugh out of the whole thing.  The teeth marks are forever implanted in my right boob. The morale of the story, try to find the little things in life that make you happy, the big things do not come around all that often anyway. Thinking of you, and wishing you well, Ann ",
      "MessageIndex": 5,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11394,0.htm",
      "Title": "going back to work"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hi Anita,<> Next month, I can officially say I am a three-year survivor!  I can also say, I am also a very different person than I was before this disease, but in a good way I think.  I took baby-steps back into working full-time (my boss was extremely supportive). I also started going full speed toward my Bachelor degree, and graduated last spring. When I started back to work a couple of years ago, I was taking hormone suppression therapy, and developed blood clots from my jugular vein all the way down my right arm, and was back off work for a couple of months. Because of the clots, I cannot take the therapy any longer, so I had my ovaries removed about a 1 1/2 years ago.  Some patients never go back to work, and that decision needs to be yours; you should do what is best for you and your life at this time. I am also reminded by my family and friends of how strong I am, but some days, I feel like it is a mask I wear, other days, I do feel strong. Right now I am seeing my oncologist every 6 months. It seems so wonderful when I hit that point in time when my appointments begin to spread further apart, I feel an accomplishment in that. I remember when I had to go each week, then each month, then once every 3 months, now once every 6 months.  I get pretty nervous about two weeks prior to my check-ups, but I suppose that goes with the territory. Keep your chin up and make sure to do something fun each day. You made it through the dark days, enjoy some of the light now.  ",
      "MessageIndex": 3,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11394,0.htm",
      "Title": "going back to work"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hello Anita, Your message really hit home for me. I was diagnosed with stage 3A breast cancer in 2004 at the age of 34. I underwent mastectomy, dose-dense chemotherapy and radiation. I was off work for a little more than 9 months, and when I went back, I fell into a terrible depression. The chemo threw me into an immediate medical menopause, which was just one more thing to pile on at the time. I feel into a deep depression, and could not hardly stand to be in my own skin.  I should also mention that in 2001, I was diagnosed with multiple sclerosis, and I never thought fate would deal another terrible blow as it did.  The cancer institute where I received my treatment has a psychologist on staff who specializes in treating cancer patients, so I began seeing him every other day for several weeks. I had already been on antidepressants for the MS, but went off the meds when I was diagnosed with cancer, I had to begin taking so many new medications, I needed some pill relief.  I began my taking the antidepressants again, and little by little, I began to feel a bit better. It was so bad for a long time, I was not sure I wanted to continue to live with the constant fear of relapse. I also was disgusted with the way I looked. I was missing a breast, no hair on my head, eyebrows and eyelashes gone, my skin was like tissue paper, and I had sores in my mouth. I felt horrible, and thought I looked horrible. I can remember removing my glasses before I would undress to take a shower, and turning away from the mirror, because I was so unhappy with my appearance. The depression will get better, you must think of it like driving a car down the road at a high rate of speed, when you begin to veer off the road into the gravel, you have two choices, turn the wheel a bit and get back on the road, or loose control and end up in the ditch.  You went through so much to survive this disease, do not let the depression get you now. I think when my treatment was all over, I felt like my safety net had been jerked away, and the cancer was free to go crazy. I thought I would be so happy when I took my last chemo treatment (I had gotten incredibly sick over the months of taking it), but my emotions surprised me instead. I became anxious, depressed, and the fear I felt became all consuming.  If you have an opportunity to speak with someone who specializes in this type of treatment, I recommend you do.  I believe he put me on the road to mental recovery, by just listening. It is different when you can tell your fears to an outsider, we are more guarded with our families, because they are scared and hurting too and we want to protect them.  It is ok to feel scared, depressed and even sorry for yourself from time to time throughout this process, just don't let it get the best part of you. In no time, I began to see glimpses of my old self again,and I was glad I was back (I missed me). I took the wigs off, decided my stubble was my badge of courage, and I went back to work. ",
      "MessageIndex": 1,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11394,0.htm",
      "Title": "going back to work"
    },
    {
      "AuthorID": "Annie_v",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Annie_v",
      "Content": "Hello, After chemo and radiation, I developed blood clots from my jugular vein, down my right arm. If your vein hurts and you are having pain and odd sensations, you may want to have a Doppler done to rule out a dangerous blood clot. ",
      "MessageIndex": 5,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20851,0.htm",
      "Title": "question about radiation side effects 11 mo. later"
    }
  ]
}