{
  "AuthorID": "anniew",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/anniew",
  "Posts": [
    {
      "AuthorID": "anniew",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/anniew",
      "Content": "On Jun 28, 2014 3:32 PM Rainy22 wrote: I had breast cancer six years ago, and I had radiation.  I was burned so bad .   Now I have severe scarring on my liver.  The doctors will not admit that it was caused from the radiation, but my cancer was in the right breast and that your liver is located right behind the right breast.   I cannot believe that as bad as I was burned, that it did not also scar my liver.   I was told several years ago that my lungs were scarred from the radiation, so why couldn't my liver of been scarred too.  I have never drank, but trying to convince a doctor that my liver damage is not from drinking is impossible.  I am scheduled for liver biopsies in two weeks.   Has anyone else ever had this happen after having radiation as a followup for breast cancer? I had breast cancer last year,  just finished 16 radiation treatments end of October.  I was burned badly too.  I remember them telling me it would be like a mild sunburn, ha!!  lies!!    I've been concerned about damage from the radiation too, but since I'm 70 in Sept.....and damage usually crops ups years down the road,  I'm hopeful.  In the meantime, I'm trying to help my immune system with the budwig protocol, and even thinking about organic coffee enemas......spose to be very cleansing for the liver, so it appeals to me. has anyone done this??",
      "MessageIndex": 6,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78054,0.htm",
      "Title": "Liver damage after having radiation for breast cancer"
    },
    {
      "AuthorID": "anniew",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/anniew",
      "Content": "On Jan 21, 2015 9:00 PM RaiderGirl wrote: I am horrified to read that you were so burned after 16 rounds. I had 35 rounds with the last 5 with booster. My skin was pink, I had fatigue but burned absolutely not. The machine and all surrounding it was set up specifically for me. There was a body mold made just for me to have me stay always in the same position. I am told I have recieved the maximum allowed. I did not have chemo so surgery , rads and hormone therapy are my treatments. Sometimes I wonder if MD's all the the same medical books. Remember not all graduated top in the class either. Coffee enemas is a bunch of malarkey. Clean foods rich in antioxidants, pleanty of clean water,rest and exercise is the only recognized ways to recover. Good luck and I send you a gentle hug. They didn't do a mold for me,  just the tatoos so they'd hit the mark......and I had burns in places that shouldn't have.  When its just one breast as in my case, they seem to come at it from an angle, instead of straight on, and so my underarms got badly burnt, and my chest as well, but its all healed now of course, and seem to be none the worse for wear.  They warned me about fatigue, but it really never happened to me,  maybe 1 or 2 days, that was it.......  My oncologist wanted me to have the booster at the end, but the other doctors said I didn't need it, and so I just had the surgery and rad,  but no hormone therapy. Do you find it hard to eat clean ALL the time ?? ",
      "MessageIndex": 14,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78054,0.htm",
      "Title": "Liver damage after having radiation for breast cancer"
    },
    {
      "AuthorID": "anniew",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/anniew",
      "Content": "Rainy, did you get the results from your liver biopsy??  I haven't had my liver checked since my radiation, but I do feel well now. That was a LOT of radiation you had,  did they do it every weekday, without a break, aside from weekends?  Did you get any blistering? I wish you good health in the future!",
      "MessageIndex": 10,
      "PostDate": "22/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78054,0.htm",
      "Title": "Liver damage after having radiation for breast cancer"
    }
  ]
}