{
  "AuthorID": "ashleysch1987",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
  "Posts": [
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "No I haven't breast fed my youngest child will be four this yr! A few months ago I had thyroid cancer I had a knot in my neck which that knot and this knot feel the same! I have never had me kind of infection",
      "MessageIndex": 2,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72431,0.htm",
      "Title": "can this be breast cancer"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "i have recently found a lump under my armpit bottom part closer to my breast its hard and does not move its about the size of a nickle my breast are tender and i have been for a while now! I am a 25yr old female!!",
      "MessageIndex": 0,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72431,0.htm",
      "Title": "can this be breast cancer"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "yes i had sugery had my whole thyroid taken out! and i do have appt with my ocologist tue for my thyroid which i have to see a doctor for the rest of my life for that for blood work and have to take meds for the rest of my life due to no thyroid ",
      "MessageIndex": 4,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72431,0.htm",
      "Title": "can this be breast cancer"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "Biopsy came as nothing but now I have a swollen lymph node under the other arm some in my bikini line and my neck I can't eat cause feeling like I get full after a few bits then makes me sick when I try still having terrible night sweats itching and have lost about 4 pounds in a month so what in the world is going on with me?",
      "MessageIndex": 6,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72707,0.htm",
      "Title": "Could this be breast cancer??"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "I am 25 yrs old and i have 2 lumps under my left arm in the armpit they have been there for about 2 months now they dont not hurt even to touch! My left breast is very itchy mostly around the nipple area and they are sore! i had a hystorectomy almost 2 yrs ago and had my thyroid removed about 4 months ago due to cancer! I have been having really bad nights sweats were i wake up with my bedding soaked! I do have friborcystic breast so my breast are always lumpy but i do have this one lil lump next to my nipple its pea size and hard do to have the same knot on the other breast which most of my knots are the same in both cause of the fibrocystic! I know nothing can be told over the internet just looking for input i do have a doctors appt. i think im just going to go ahead and request a biopsy of the lumps under my arm in stead of going through tons of test! ne input is apperciateted ",
      "MessageIndex": 0,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72707,0.htm",
      "Title": "Could this be breast cancer??"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "Thank you the past few yrs have been hard on our family i have 3 kids and after each one my health has gone down hill i dont have ne energy to do much with them and i feel horrible about that! some mornings i dont even feel like getting out of bed and its also hurting my marriage! i had a ct scan the other day but the doctor sai it was normal but i still have these knots and i havent have a cold or ne infection for them to be there its just werid for them to be there when i just had cancer removed 4 months ago! I do have a appt monday with my obgyn so hopefully he can shed some llight as to why they are there!!! ",
      "MessageIndex": 2,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72707,0.htm",
      "Title": "Could this be breast cancer??"
    },
    {
      "AuthorID": "ashleysch1987",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ashleysch1987",
      "Content": "I am waiting on biopsy results now",
      "MessageIndex": 4,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72707,0.htm",
      "Title": "Could this be breast cancer??"
    }
  ]
}