{
  "AuthorID": "AZRider",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/AZRider",
  "Posts": [
    {
      "AuthorID": "AZRider",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/AZRider",
      "Content": "Hi, Sorry to hear about your diagnosis.  It's so hard--especially at first. I had a tumor similar in size, no node involvement, grade 1, IDC, estrogen positive over 2 years ago.  Opted for a double mastectomy because they found a suspicious mass on the other side and I did not want radiation.  My oncologist at the time wanted to put me into chemo immediately, but I balked and requested an oncotype test.  My oncotype came back with a 3, so I said no to the chemo.  I later found out that my doctor owned the cancer center and pushed chemo on all of his patients.  (so you may want to check that out). I also tried to take all of the post surgery drugs, but they affected me so badly, I had to stop.  I decided to do my best to stay in shape and eat healthfully to help mitigate recurrence.  So now I exercise 6 times a week, get 7-8 hours of sleep, and eat a diet low in sugar and all the fresh fruits and veges I can handle.  I feel great and so far, so good!  My new oncologist is awesome and she supports my decisions and healthy lifestyle.  She even sent me to an exercise physiologist and nutrionist to help me get started and there was no cost at Banner Cancer Centers.  She told me that when you eat right, exercise and get your sleep, you cut down chances of recurrence as much as 80%.  That was good enough for me and I feel good about my decision. Good luck to you.  I know this is not an easy decision.",
      "MessageIndex": 3,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77926,0.htm",
      "Title": "Breast cancer treatment"
    },
    {
      "AuthorID": "AZRider",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/AZRider",
      "Content": "Hi Gigi56, I think you are asking me who my oncologist is.  Her name is Mary Cianfrocca and she works at the Banner Cancer Center in Gilbert, AZ.  She's wonderful.",
      "MessageIndex": 6,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77926,0.htm",
      "Title": "Breast cancer treatment"
    },
    {
      "AuthorID": "AZRider",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/AZRider",
      "Content": "Hi Teri, I'm so sorry to hear this.  I'm 3.5 years out and still have the pain you describe.  It has gotten better but for the first 2 years I almost lost my mind.  Most surgeons don't tell you to expect this and many plastic surgeons don't know how to deal with it.  I tried everything and was uanble to take the pain meds.  I deal with it with exercise, stretches and biting my lip. Unfortunately I was not able to work so had to retire early.  And for me, applying for disability was a total waste of time.  I tried for over 2 years and just gave up. It wore me out because  PMPS is not recognized as a malady worthy of disability.  Plus, after I was forced on to Obamacare, I could not afford the pain treatments because the coverage is so bad and deductible so high.   I just did the best I could to heal myself. It's totally ridiculous because the pain is real and it's debilitating.  But I have heard of others in our situation who were awarded disability--they probably had good lawyers and doctors who went to bat for them because they understand the problem.  So my advice is find a plastic surgeon who gets it.  Find a good pain doctor and try gentle stretches.  Get a lawyer and fight for what's yours.  Best of luck to you.",
      "MessageIndex": 1,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88929,0.htm",
      "Title": "post mastectomy pain from oct 2014 and still going"
    },
    {
      "AuthorID": "AZRider",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/AZRider",
      "Content": "On Jun 08, 2013 9:37 PM muskans wrote: Hi,  My mom had a radical mastectomy on Dec. 10, 2012, and had lymph nodes removed as well. (it was a stage 3a cancer). The surgeon had said to do exerise till she gets full range of motion, which she did after the first 15 days in January. She then did not do the exercises. Her chemo subsequently began in the end of January, and was 8 sessions. In April she started exercising again. About a month ago she started experiencing tightness in the surgical area. The Last couple of weeks it has turned into an excruciating discomfort.  These are the things she is describing:  -The tightness is like an iron bra that is pulling and tightening where the mastectomy happened -The tightness has recently spread to the underarm (armpit) area -It feels like the skin is sticking and pressing against the chest wall, and the ribs. Almost as if its constricting her lungs.  -She also feels like the muscles are contracting in that area, and feels like there is a rock under the skin, and everything is a frozen block.  She is on round the clock pain killers to handle the discomfort (excrutiating discomfort not \"pain\"). She was on Percocet to manage it before, but it stopped being effective. She is now on Dilaudid.  The pain doctors at stanford have felt that it is potentially a nerve issue, and prescribed neurontin and desiprimine. The pain doctors at UCSF feel its more of a muscular issue. So she has also just recently started physical therapy.  We read in a previous post from 2009 on a forum, that some of the symptoms we are describing may be caused by scar tissue adhesions. None of the doctors have talked in depth about this aspect. But it sounds like it can definitely be that, with maybe a combination of muscles issues. We just feel so frustrated and helpless, since we arent getting any clear answers.  Though her tightness and pressure began 4 months after the surgery. Did you guys also have to take pain killers? Also after how many sessions generally should she start feeling some result of the physical therapy? We arent sure if who we have is good/the right one.  The UCSF pain doctor also recommended trigger point injections, and if that works then botox shots, to relax those muscles. Thoughts?  Her radiation just started this week as well, so she cannot undergo any procedures with injections till after it is over. We are worried, because radiation is just suppose to increase the tightness, and she is already starting in such a bad condition!  PLEASE HELP! Hi,  I'm so sorry your mom is going thru this.  Doctors don't usually discuss post mastectomy pain syndrome before surgery and many don't even acknowledge the pain post surgery!  It's so frustrating because 25-40% of us going thru mastectomy have some form of post mastectomy pain syndrome (PMPS).. Yet most surgeons don't know much about it. I have been searching for an effective treatment for over 8 months.  My pain worsened about 3 months post surgery.  I had a lot of scar tissue that had to be removed after my implants were put in.  The scar tissue release helped for a few weeks, but pains came back--same as your mom's but I also had severe burning in each breast and armpit.  Some possible causes are: Scar tissue Nerve pain from damaged intercostobrachial nerves during surgery. (doctors won't admit to this, but it's very common) Implants may not be the right size for the pocket. Everything is too tight. failure to use dermal matrix as a sling for implants thus pulling the tissue downward. I've tried PT (25 sessions) with some relief. ASTYM to break up scar tissue was unsuccessful.  Yoga, stretching and meditation helped a bit. Pressure point massage helped for a few days, but it was so expensive I had to stop.  I've been to many specialists and I finally was prescribed Lyrica.  The Lyrica works the best, but I don't tolerate it well so I am trying other things.  I'm now taking 3 Nerve Shield pills a day to help regenerate the nerve casings and I do belief it's helping.  Plus I have my surgeon researching if fat grafting around the implant will help so I can get off the Lyrica. PMPS is elusive and insidious.  I certainly hope your mom finds relief soon.   Let me know if you have questions. Good luck!",
      "MessageIndex": 1,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72129,0.htm",
      "Title": "EXTREME TIGHTNESS, Pressure against chest wall - Post Mastectomy"
    }
  ]
}