{
  "AuthorID": "BabsNC",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BabsNC",
  "Posts": [
    {
      "AuthorID": "BabsNC",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BabsNC",
      "Content": "I have been on the other drug, Arimidex, for almost 7 years and I have all kinds of pain every day and my bones are deteriorating. Also, my once thick hair is very thin now & my scalp shows. I am going off it regardless of what my oncol. says.  I suspect Aromasin has similar side effects but for the first 3-4 years I was on Arimidex, I only had back pain. Considering that I had 3 herniated discs, I blamed the pain on that.  I lost all sex desire after going on Arimidex.  But had no hot flashes or any headaches.  No one knows what the long term effect of our taking these drugs are.  I am going off mine.",
      "MessageIndex": 216,
      "PostDate": "20/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "BabsNC",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BabsNC",
      "Content": "Get off all those drugs.  They are killing you.  You had a very low chance of recurrance and your life has been made miserable because of the FEAR FACTOR.  They want us to keep taking these drugs because the pharmaceutical companies make MILLIONS off them.  Many of us women in our 60's would not have gotten breast cancer had they not prescribed those synthetic hormones made from pregnant horse urine.  I am in a group of thousands of women who got breast cancer after being prescribed those. Doctors only do what they are urged to do...Write prescriptions. But they don't walk in our shoes or know the pain we are suffering.  Start eating real well and take a good Multi-Vitamin, Calcium Supplement and 6,000 to 8,000 units of Vit D-3.  I hope you improve and can enjoy life.",
      "MessageIndex": 44,
      "PostDate": "20/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    }
  ]
}