{
  "AuthorID": "Barbara_119",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Barbara_119",
  "Posts": [{
    "AuthorID": "Barbara_119",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Barbara_119",
    "Content": "My, your sister is so young, but cancer has no age limit. Here is just a brief bio on my cancer. I was diagnosed with colon cancer in June 04, had surgery and then chemo. I was allergic to the chemo, but the doctor did not listen to what I was telling him so I ended up with pulmonary fibrosis. That is a serious lung disease that you can die from. Only 1% of people on oxaliplatin for cancer in the world get this lung disease. Rober Goulet died jan. 08 of pulmonary fibrosis from colon cancer chemo. I was put on prednisone for a year and oxygen 24/7. I gained 70 lbs, from the prednisone and therefore got diabetes and osteoporosis. Sooooo I am telling you this for one reason.....I WOULD NOT GIVE UP!! It has taken 3 yrs, but I only use oxygen for exercise and I am off all lung medicine. Now, my lungs are permanently scarred, but somehow my breathing has gotten a lot better. My pet scan still shows a great deal of scarring.I am now 3 1/2 yrs cancer free.  So what I want you to do for your sister is to tell her to be happy, laugh a lot, think positive thoughts, and will herself to get better. I really believe attitude is more then half your battle. Rent funny movies as laughter is the best medicine. So many people have told me that they are inspired by my attitude. I just look at the glass as half filled not half empty. Oh one other thing. I have read many times that cancer feeds on sugar, so she should avoid sugar. Also ask about the stem cell therapy being done at the Cancer Centers of America. Good luck!!!! Barbara",
    "MessageIndex": 6,
    "PostDate": "04/12/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30804,0.htm",
    "Title": "Stage IV Breast Cancer??? Questions"
  }]
}