{
  "AuthorID": "Ben_C",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ben_C",
  "Posts": [
    {
      "AuthorID": "Ben_C",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ben_C",
      "Content": "Kathy, Thank you so much for taking the time to reply and I am delighted to hear good news and some improvement for your sister. Ben received a second shot today of Lovenox and started on Coumadin, he is to continue having these shots daily we were told and would probably be on coumadin for the course of his chemo. He had his first chemo August 8th and neuropathy set in right away in his fingers and feet. They felt that was too early- but by the day of the second chemo since it had worsened they changed his mix of carbo and taxol to taxatere (sp?). The oncology nurse told us that it was better about not causing neuropathy but swelling could accumulate over time and there was little they could do about it, so not to be surprised. Well- I can't imagine how any more COULD accumulate with succesive treatments, because he has blown up like a balloon- his face, his hands and his feet and legs. Even his lips are swollen and protruding to the point they are cracking. I believe this is what brought on the blood clot due to creating such poor circulation to and from the feet. So it is frightening to think if next Tuesday's chemo increase more swelling. We of course will talk to the doctor about it before they start the treatment. We also will ask about a filter- the only filter I know of is a vena cava filter. I would be somewhat concerned for an invasive procedure after receiving blood thinners. Was this discussed with regards your sister? Where was the filter inserted and what type of procedure did it entail, if you don't mind my asking. I feel so badly for Ben as each day or at least each week some other affliction besets him. And he never complains- I would be hard pressed to be as pleasant as he is. Of course he was in such bad shape by the time chemo was started, they didn't think he could even withstand trying. So- I guess he takes improvements like being able to lie down and sleep without having the horrible cough and gagging and a constant low grade fever, he had lost 40 lbs and had sores in his mouth-and all of this went on for 3 months before we could finally get a diagnosis. We were watching him deteriorate before our eyes daily. His cough is gone, he finally sleeps and is eating much better. I went to a nutitionist and he laughs and says the weight gain is due to all the pills, powders and potions I poke down him! I don't know if they help, but you feel you have to do something that might help. He's had a heart condition for years that has been under control, but with his metabolism and chemistry results, I know that all of this is creating havoc with that as well- so the thought of a clot is rather an immediate concern. They did tell us today when I asked how long before he would realize some improvement, and could bear to stand on that foot? That it would be at least a month to six months! That was not what I had expected- I thought with agressive treatment and the meds, we might see results in a week or two!! Poor guy- once so active and independent and now he is unable to work, on oxygen all the time, loss such muscle mass, so his arms and legs are already so weak -then this. In the spring until late May he was out on the little league field helping with our grandson's team. Now the days are so long for him while everyone else continues with their life and routines- but of course for me the nights are awful! Thanks for listening and sharing- only people who are fighting this and seeking tidbits of information from each other understand the frustration as we stand by and watch the destruction from the disease as well as the treatment it creates in our loved ones. They have the disease and we become consumed with it. I really appreciate your responding so quickly and that your sister is doing much better. That news coupled with the information helped a lot. She is fortunate to have such a caring sister. May God's grace be bestowed on both of you. Laura",
      "MessageIndex": 4,
      "PostDate": "19/09/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,889,0.htm",
      "Title": "Blood Clots"
    },
    {
      "AuthorID": "Ben_C",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ben_C",
      "Content": "Kathy, we are learning our way around this site, and I did not see your question when I posed one for Ben and blood clots. I noted the date you wrote was Aug 14, have you had more satisfactory explanations or further information since then that you would care to share? And if you would or could explain the filter you referred to? What do they tell your sister the reason is for the blood clots? Thank you so much for sharing in anyway you can, it will be appreciated. God Bless you and your sister. Laura",
      "MessageIndex": 2,
      "PostDate": "18/09/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,889,0.htm",
      "Title": "Blood Clots"
    }
  ]
}