{
  "AuthorID": "Bernadine_T",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bernadine_T",
  "Posts": [
    {
      "AuthorID": "Bernadine_T",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bernadine_T",
      "Content": "Leisha, Trust yourself and what you are feeling. After going to the same doctor for over 20 years, starting my mamogram in my 40's, I was told I only needed them every 2 years. Even though on my mamogram a note of yearly exam needed because of history (Mom had several cysts and her Mom had Breast Cancer), I trusted my doctor. One morning, while getting dressed for work, found a lump. I went to my doctor and was told that I needed a mamogram (even though I had just been for my check-up 6 months earlier. To make a long story short, the radiologist found 2 lumps on the same breast - my doctor said that it was probably just cystic breast. I decided to have the biopsy, came back malignant, had the mastectomy (had another lump, larger of the three that did not show until the breast was taken off). Had I listened to my doctor of over 20 years probably wouldn't be here today. On January , 2005 was my 10th year since my surgery. If there has been one thing that I have learned is that doctors can be wrong. Trust yourself - do what you want! Please get in touch if you need someone who has been there to answer your questions. Bernadine",
      "MessageIndex": 1,
      "PostDate": "03/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1656,0.htm",
      "Title": "Scared and Confused"
    },
    {
      "AuthorID": "Bernadine_T",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bernadine_T",
      "Content": "I was diagnosed State II Breast Canter with Infiltrating Ductal Carcinoma with positive nodes in 1995. I had 6 chemo treatments followed by tamoxifen. I decided with the modified radical mastectomy and 2 years after removed the other breast and had bilateral reconstruction with the tram-flap. It will be 12 years this January with no re-occurence.",
      "MessageIndex": 1,
      "PostDate": "13/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7239,0.htm",
      "Title": "Infiltrating Ductal Carcinoma"
    },
    {
      "AuthorID": "Bernadine_T",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bernadine_T",
      "Content": "I am a stage II Breast Cancer survivor since January 1995. I also have positive nodes involved -I had 6 rounds of chemo followed by taxomifen, which I have been on since then. My oncologist is a consultant for MD Anderson and has no problem with my staying on it. I hope this helps!",
      "MessageIndex": 3,
      "PostDate": "08/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3488,0.htm",
      "Title": "What to Use After Using Tamoxifen"
    }
  ]
}