{
  "AuthorID": "Betty45",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty45",
  "Posts": [
    {
      "AuthorID": "Betty45",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty45",
      "Content": "My sister had triple negative br. cancer in 2002.  She was diagnosed with mets to the bone in Jan 09, although now that I have read about her type of cancer, she was having symptoms of bone mets five years ago, which her Dr. called arthritis or fibromyalgia.  Very frustrating that she was not diagnosed sooner, as her mets are very widespread at this point.",
      "MessageIndex": 1,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36040,0.htm",
      "Title": "triple negative breast cancer"
    },
    {
      "AuthorID": "Betty45",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty45",
      "Content": "Not all breast cancer is estrogen based.  My sister has triple negative breast cancer, which means negative for estrogen, progesterone and HER2.  It is more difficult to treat and the hormone blocking treatments have no effect.  Make sure you get the pathology report to be sure what type breast cancer she has.  When my sister had bc in 2002, I do not remember any talk of her cancer being triple negative or aggressive, but I did not read her pathology report then. ",
      "MessageIndex": 1,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35973,0.htm",
      "Title": "Breast Cancer Red Clover treatment"
    },
    {
      "AuthorID": "Betty45",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty45",
      "Content": "Hi Andi,  My sister (caucasian) was diagnosed with triple negative br cancer in 2002,  stage 1, grade 3.  They did'nt call it triple negative back then, that designation has only come into use in the last few years. When thinking about a cancer diagnosis, the grade is often overlooked.  When my sister had treatment, I don't recall anyone saying her cancer was more agressive or more difficult to treat.  But, she is now having a recurrence in the bones.  Best of luck to you in your treatment path.",
      "MessageIndex": 6,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35114,0.htm",
      "Title": "Triple Negative Tumors"
    }
  ]
}