{
  "AuthorID": "Betty_A",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
  "Posts": [
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "I had breast cancer in 2000, now I have recurrent breast cancer that has come back to the bones and liver. I, too, was HER-2 negative, which means that some forms of chemotherapy (such as Herceptin and others) will not help negative persons. I am also looking for someone in my similar situation for ideas for treatment. I was put on tamoxifin for 2 years, but since my cancer is now recurrent, I have been taken off tamoxifin and put on a new drug called Arimidex. I've only been on it for a couple of months so I haven't had any new blood work yet to see if it has helped. Hope this information was helpful.",
      "MessageIndex": 7,
      "PostDate": "11/03/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,668,0.htm",
      "Title": "Breast Cancer - hormone receptor negative"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "Hi, I was originally diagnosed with BC in 01-00; received chemo followed by radiation. Then in 01-03 in a routine tumor marker blood test, BC mets was found to my bones and liver. I was immediately switched from Tamoxifen to Arimidex and given monthly infusions of Zometa for the bones. I am not going through chemo at this point because the tumors on the liver are not growing and I am not symptomatic at this time. I had retired from my job at age 52 when I got the last diagnosis. I am now working again to keep my mind off things and to keep me active in the community. I hope your mother is doing okay now. Please feel free to ask me anything. I've researched a lot on the subject and there is a lot out there to view. Betty",
      "MessageIndex": 8,
      "PostDate": "16/10/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "I have bc mets to the bones and liver. I am taking Arimidex and a monthly infusion of Zomeda. The Zomeda has really helped with the bone pain I had (I have not even had to take any pain medication since I began it). But, when I receive the infusion of Zomeda, I get sick for two days (flu like symptoms, headaches, vomiting). The first time they pushed Zomeda is 15 minutes; the second time they pushed in 30 minutes (based on a recommendation I'd seen on this website) to see if it made a difference. It didn't. Is anyone else taking Zomeda had this experience? How are you handling the side affects? Betty",
      "MessageIndex": 0,
      "PostDate": "30/03/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,539,0.htm",
      "Title": "Zomeda"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "I have recurrent breast cancer met. to bones and liver. My CA marker was elevated to 154 and I have not started on chemo yet. I am taking Arimidex to see if the markers start going down. I am seeking a second opinion right now, but my insurance won't allow CCTA, so I'm hoping to go to Barnes Hospital in St. Louis (Siteman Cancer Institute). I'm sorry to get to know you based on our illness, but I think we might be able to share information on our treatment. I'll say a prayer for all of us going through cancer treatment.",
      "MessageIndex": 1,
      "PostDate": "11/03/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "Tracy, We are neighbors in Illinois. I live in Charleston (about an hour south of Champaign-Urbana where Univ. of IL is). Your mother's met. breast cancer sounds similar to mine. I am doing fine. I am taking Arimidex as well and a monthly infusion of Zometa because I have bone mets as well. My liver has 6 lesions all under 3 centimeters. I did seek out a second opinion from a specialist to make sure I was getting the appropriate treatment. I was told my course of treatment is normal, except that some doctors would go ahead and give chemo drugs on top of everything else. That's a matter of choice. I have never been symptomatic of the cancer nor has the lesions on the liver changed any in six months; therefore, my doctor and I discussed waiting to start chemo until I become symptomatic. Chemo is very very hard on your body, so my ideal is to have quality of life. It never hurts to seek a second opinion so you have piece of mind but what it boils down to is it is your mom's choice and if she understands this disease there is never a cure now, only living with and accepting it and doing as best as we can with cancer in our daily lives. It's very hard to deal with not doing anything, but Arimidex helps and I am sure they are monitoring her tumor markers to see if they are going down, up, or staying the same. Your doctor should be comfortable in discussing the other options, even if they wouldn't work for her he should be able to tell you why they won't work. I did all the research and pretty much knew why I thought they wouldn't work, but I did seek a second opinion. If your mom doesn't feel comfortable with her oncologist, she should seek out a second opinion or change oncologists. Cancer Treatment Centers of America has a place up by Chicago -- I don't know about what kind of insurance they take but check it out. They were good working with me even though my insurance would not send me there and I am only 53, so I don't qualify for Medicare. Let me know how your mom is doing!",
      "MessageIndex": 5,
      "PostDate": "13/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "Joan: I live in central Illinois in a town called Charleston (about 50 miles south of Champaign). I know where Alton is. I have been there on the boat. I am 53 years old. I had my first cancer at age 49. If it hadn't been for the CA marker being elevated, I did not present with met. cancer. It is in both ribs, both femurs, and in my pelvic as well as 7 lesion in the liver. Arimidex is a drug sort of like Tamoxifen. It's supposed to help new ones from developing. I am also getting a once per month infusion of Zometa, which is supposed to help with the bone cancer. I have had only one infusion so far. I, too, am feeling good. I do get tired, but I've felt that way since my first cancer. Do you have a port for infusions yet? I have terrible veins even for blood testing so I'm supposed to have a port put in on 3/17/03. My next infusion of Zometa is on the 28th. I have requested a second opinion because my oncologist here and the hospital have no experience in any of the liver treatments first-hand. If a doctor does not do these treatments they are relying on what they know and have read about in the textbooks. I want to hear from a doctor who has been performing these types of treatment that they will or will not work for me. Doctors who perform these treatments are on the leading edge and may know more than the recent journals/books on the subject and I'd like to be a part of that treatment for aggressively attacking this cancer. I was pleased with the care I got when this came up, but I just want to make sure nobody missed anything, etc. I do have problems sleeping at night. Do you? I wake up between 3-4 a.m. and can't get back to sleep. I belong to a support group here locally for breast cancer survivors, but no one has been in the situation that I'm in. There is one woman who has met. lung cancer but no one with met. bone and liver or liver only. I must go to a doctor in Springfield, IL first before I can be sent to Siteman. I'm not sure what doctor I will see there, but since you've been to Siteman already, do they treat the whole person (nutrition, emotional, as well as chemo)??? Up here, we have no other treatment except medical.... I don't know if they'll send me to a liver specialist or what? I do know they want to do a liver biopsy to make sure it is met. cancer, not a second primary cancer. Did you have a biopsy done? Let me know how you are doing and what treatment plan they have for you. Do you work? I retired from the university after 30 years in October 2002 at age 52.",
      "MessageIndex": 3,
      "PostDate": "12/03/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "Tracy, My original breast cancer was in Jan. 2000, followed by a mastectomy on Valentine’s Day in 2000 and four rounds of chemotherapy and 32 sessions of radiation. I was just diagnosed in Jan. 2003 with mets to the liver and bones. I had no symptoms; I had a routine blood test in which my oncologist tested for tumor markers and it was greatly elevated. From that I had a CT scan, bone scan, and then later a MRI which showed the six lesions of varying size. Sometimes on a CT scan they can't see them and that was the case for me; he ordered the MRI just to make sure and low and behold there they were. Tumor markers are what an oncologist looks for 'indications' that cancer might be in the body and there are many different tumor markers (one for breast cancer, one for pancreas, etc.). When they are elevated, it alerts them to look on scans for cancer. They monitor after diagnosis to see if the medicines/treatments are working or not. Such as Arimidex...normal tumor markers for me is supposed to be 40 and mine were 169.... they are dropping each month right now. Basically when you have met. breast cancer, it is never going to go away. It cannot be cured. I don't want to be negative, but that is true. It cannot be cured. We have treatments that can help, but your mom, like myself and many others, must live with the cancer daily for the rest of our lives. That is why quality of life is so important. The difference in having chemo or choosing not to is her decision as long as she knows the chances of delaying chemo will bring. I have asked all the questions you are asking. You can have pain in the right quadrant. I do not even have pain there yet. I have a cousin who has an 8 cm. liver breast cancer met. and she is undergoing chemo because of the size of the tumor and she is symptomatic (having pain). Nausea and vomiting is not a symptom either. I can't remember if I've answered all your questions or not, but please feel free to contact me at any time with any questions. I am not having any symptoms at this time, nor have I with my liver mets. I did, however, put a hairline crack in my pelvic a couple of months ago riding on a riding lawnmower and had to undergo radiation to my pelvic, but I'm doing great now. I am getting ready to go on vacation for two weeks now. We are driving over 3,200 miles out west. Hope your mother is doing well. Betty",
      "MessageIndex": 7,
      "PostDate": "13/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    },
    {
      "AuthorID": "Betty_A",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Betty_A",
      "Content": "I also have mets to the bones and liver. I have been taking Arimidex since Jan. 2003 and will be tested today to see if it's working. It's my understanding that they like to try each of these meds to see which one works, if any. If not, it would be my guess they will try some chemo (that's what I've been told). I was on Tamoxifin for two years and that worked for a while, then didn't. Now Arimidex, which is another same-type of drug and there are a couple of others. Best of luck and keep on surviving!",
      "MessageIndex": 1,
      "PostDate": "17/03/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,534,0.htm",
      "Title": "Arimidex vs. Femera"
    }
  ]
}