{
  "AuthorID": "BettyBoob",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
  "Posts": [
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "I am 26 years old. I have a very long history of gynaecological problems. I had my first baby at 21, on my 6 week check up, they cancerous cells and I went for a lets, and thereafter I had my second one at 23. After that they found more cancerous cells and I went for another lets. I had a hysterectomy at 25, we decided that the risk is too high and that was the main reason for it. I also have had abnormal growths removed from my ovaries before the age of 16.  Before the Hysterectomy I was on numerous hormone pills.  About 8 months ago I noticed a brown nipple discharge in my left nipple (it was not spontaneous). I read on the internet that it will go away if I don’t stimulate it, and since I had no pain I just left it. I would check once a month just to make sure and it never went away. I did a self exam and did not feel any strange lumps. But now the discharge is still there and my breast is in extreme pain. There is no apparent hardness, but if I do an exam it feels a bit hardened and warm to the touch. It also itches underneath my breast. There is no rash, or changes in my skin. My nipple has a kind of burning/stinging sensation and there is a spesific point on my breast that is extremely painful, like a sharp pain. My breast use to be a bit larger than the left but now its about a cup size bigger, the discharge changes colour sometimes its brown and other times its clear. sometimes there is a stain in my bra, just a little spot. My GP doctor put me on antibiotics which are not working and he never gave me a chance to tell him that I have been having a discharge for months. I have no history of breast cancer in my family. But being a concerned mother of two and the sort of luck I've had I went to a \"specialist\" yesterday. He examined my breast and told me I have Costochondral junction syndrome and fibrocystic Breasts and the nipple discharge will go away. He also discarded the swollen and sensitive lymph gland in my armpit. He said my hormones should be the cause and its not worth getting tested. But I had hormone tests done 2 weeks ago and everything is normal. What should I do?",
      "MessageIndex": 0,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "  On 3/26/2009 Claudia413 wrote: BettyBoob, For your health's sake, I would google IBC (inflammatory breast cancer). That is what I have. You have several of the signs and symptoms of IBC; and if I were you, I would insist that your doctor rule out IBC by performing a biopsy.  Inflammatory breast cancer is highly aggressive, rare and usually does not show up on a routine mammogram (mine didn't).  Also, no doctor ever told me that you don't have to have a lump to have breast cancer, but it's true.  IBC usually has no lump. Please check out the signs and symptoms of IBC at ibcsupport.org and eraseibc.com.  A misdiagnosis can mean Stage IV rather than the \"normal\" IBC Stage IIIB.  You may not have IBC, but better safe than sorry.  My regular doctor wasn't even aware of IBC and most of the medical personnel I've seen over the last 18 months know very little about it.  Even the oncologist I went to said he would not have suspected IBC just looking at my breast.  I'm so glad that I screamed and hollered until I got the tests I need to either rule out IBC or confirm it as IBC (which it was) and got my treatment started.  With IBC you have chemo, then surgery, radiation and maybe more chemo.  If you have any questions, just ask. Claudia in Florida Hi Claudia, I have asked my dr about it and he said since my skin and my nipple looks normal it's very unlikely and I should just leave my breast it will all go away eventually. ",
      "MessageIndex": 7,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "Hi, Thank you so much for the replies; I have been looking for straight answers for days now. I have an appointment with my GP again tomorrow and will ask him to refer me to a specialist. I have phoned and emailed almost every specialist I could get hold of and one replied only with a link referring me to his breast cancer website. The specialist I saw already prescribed cortisone, but he never mentioned anything about steroids. He also didn’t give me any other pain killers. I will let you guys know how it goes tomorrow. Thank you to all this site is really amazing and good luck to those of you fighting this horrible illness. I will keep you in my prayers. Warmest Regards From South Africa where the alcoholic health minister gets a new liver and to be president you need to have a criminal record J  ",
      "MessageIndex": 3,
      "PostDate": "25/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "Today, I went to my GP. He sent me for a mammo and an ultrasound. The ultrasound was clean and therefore they refused to do the mammo because I am not 35 yet. I then asked for a MRI and they said there is no reason for it and they will not do it and I have to find someone else. The Doctor that did the ultrasound said there is no way it can be cancer since there is no evidence (Lump). The nipple discharge is normal and it will go away over time and so will the pain I just need to manage it with painkillers until then. And therefore to send a sample to the lab will be a waste of time. He also said that even with my history of suspicious cells etc. It will not relate to my current problem. This same doctor also said I should maybe consider scanning my brain, when I asked him why he said because there is nothing wrong with my breast. I then called the GP and he agreed. If the Ultrasound is normal the rest will go away sometime It was confirmed that I don’t have fibrocystic breasts and I don’t have inflammation in my ribs joints or the junction illness. I now really don’t know what to do and feel really hopeless. Am I paranoid? It’s not that I believe I have cancer. I just want to know what is wrong with me and I want to feel better.",
      "MessageIndex": 5,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "  On 3/27/2009 Kittycath wrote: I find all this very interesting because we always hear about doctors over treating and ordering tests that probably aren't necessary--but insurance pays and some docs just want to make money.  So, your experience of being so insistent that tests be performed--well, you would think that some medical people would say. .. Oh, yeah, let's go ahead--thinking that some income would be generated.  I almost hate to suggest this because I like to think only the best of the docs that take care of us, but I wonder if they notice something about your insurance limitations and that might be a reason to not respond to your requests.  Just a thought--one that I certainly hope proves incorrect! It is very likely, unfortunately I live in a verycurrupt country and money might be one of the the reasons. But there are many more. Which I wount go into since I prefer to stay out of politics. I will however wont give up untill someone gives me a decent answer. I will keep you all posted",
      "MessageIndex": 10,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "BettyBoob",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BettyBoob",
      "Content": "  On 3/27/2009 Kittycath wrote: I find all this very interesting because we always hear about doctors over treating and ordering tests that probably aren't necessary--but insurance pays and some docs just want to make money.  So, your experience of being so insistent that tests be performed--well, you would think that some medical people would say. .. Oh, yeah, let's go ahead--thinking that some income would be generated.  I almost hate to suggest this because I like to think only the best of the docs that take care of us, but I wonder if they notice something about your insurance limitations and that might be a reason to not respond to your requests.  Just a thought--one that I certainly hope proves incorrect! It is very likely, unfortunately I live in a verycurrupt country and money might be one of the the reasons. But there are many more. Which I wount go into since I prefer to stay out of politics. I will however wont give up untill someone gives me a decent answer. I will keep you all posted",
      "MessageIndex": 13,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    }
  ]
}