{
  "AuthorID": "Bezzy",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bezzy",
  "Posts": [
    {
      "AuthorID": "Bezzy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bezzy",
      "Content": "What would happen if I quit the Aromasin before the five year period? I've been on Arimidex since 2004 and am getting ready to switch to Aromasin. Is the rise really high? Am I flirting with diaster? This ramifications from taking these medicines are so frustrating; thin hair, belly fat, hot flashes, joint pain, sleepless in Columbia, no sex interest...the list is endless. Bezzie",
      "MessageIndex": 0,
      "PostDate": "19/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7330,0.htm",
      "Title": "What Would Happen If..."
    },
    {
      "AuthorID": "Bezzy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bezzy",
      "Content": "My ONC dr. is switching me to help with the joint pain. From what I've read and heard, it doesn't sound like this will really make a big difference. I think she was just pacifying me. I also heard that all these estrogen blockers only have a 5% blocking insurance. That's a pricy quality of life ticket. I guess it's how lucky you feel. After this experience, I am empty on the lucky load. Bezzie",
      "MessageIndex": 3,
      "PostDate": "20/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7330,0.htm",
      "Title": "What Would Happen If..."
    },
    {
      "AuthorID": "Bezzy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bezzy",
      "Content": "I was not aware of the 5% factor. But then I have not been aware of lots since all this began or unraveled. It sounds like your reaction was extreme. So sorry that you are having such difficulty just getting in and out of bed. I guess that I need to be thankful that my reaction isn't quite so profound. Thanks for sharing. I hope you find the magic bullet for protection and quality of life. The search for the holy grail continues. Best of luck to you. Bezzie",
      "MessageIndex": 4,
      "PostDate": "20/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7330,0.htm",
      "Title": "What Would Happen If..."
    },
    {
      "AuthorID": "Bezzy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bezzy",
      "Content": "I've been dealing with the evil side effects of Arimidex and asked my ONCO to give me some relief. She suggested changing to Aromasin. I'm getting cold feet reading all the side effects of it also. Will I experience any difference? I got off the Zoloft and Mobic because I'm tired of taking so many drugs to counteract the effects of Arimidex. I'm especially anxious about the weight gain and joint pain as I'm short and play tennis as much as I can. Help me Rhonda. I feel like a fool for making a change yet want desperately want to find some basic relieve in the quality of my simple life. Bezzie a.k.a.Becky",
      "MessageIndex": 0,
      "PostDate": "15/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7280,0.htm",
      "Title": "Arimidex Verses Aromasin? Help me Rhonda!"
    }
  ]
}