{
  "AuthorID": "BigRedxox (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [{
    "AuthorID": "BigRedxox (Inactive)",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
    "Content": "Hi, it's my first post on here, and it is a very very imbarrasing topic for me but it is becoming a very big issue in my life. I came across this site and a particular thread to do with diseases and smell when I was googleing what the hell is going on with me... I was hoping maybe you guys might be able to help... I don't have cancer - that I am aware of but I am in pretty bad shape health wise I have an underactive thyroid for which I take thyroxine and a lot of bladder issues since my pregnancy with my now 2 and a half year old - constant infections (or infection type symptoms) for which I take antibiotics daily to control. I also have fibomyalgia and endrometriosis. I have had a total of 10 pregnancys with 5 live births, history of miscarrage, seveer pre-ecclamsia and still birth. I am 99% certain I don't have diabetes. So I'm a pretty run down and battered old bird now lol. Anyway, to cut to the chase - lately, I blinking stink and it is getting me down, I am clean and shower everyday, sometimes twice a day, but this doesn't seem to keep the smells at bay completly. The WORST time is in the mornings, EVERY morning :( and my husband being very tactful loves to walk in and wake me by telling me how bad the room smells whilst flinging open the windows! (We sleep in seperate rooms)  I can't even describe the smell, It's like a mix of onions, fish and urine but it's also quite sweet if that makes sense... it seems to permiate from my every orafis (please excuse the bad spelling - no spell check...) from my armpits, dowwn below and my breath - the smell is so bad I can never completly rid my bedroom of it. This morning I was thinking it's starting to have a hint of a smell like a really old person smell, if you know what I mean... I'm sorry it's vauge, I can't really describe it any better... I am starting to feel, smelling like this, that something somewhere is very, very wrong. It's not like I sweat excessivly through the night, I sleep with my ceiling fan on even through winter and a thin quilt, if I am any warmer than that I get dreadful night sweats where I wake up completly drenched. This sounds silly but they say dogs smell things... I have been completly avoiding dogs for a long time because whenever they greet me they stick there nose right in my down below region (which i assumed is linked to my infection problems) but now because of my smelliness... well I'm worried... Does anyone have a clue what might be going on? I'm sorry if I am posting in completly the wrong place or if i offended anyone... and that its so long but I am starting to worry about Cancer, the only reason I'm not totally freaking out about it is because I can't seem to stop gaining weight - as opposed to loosing it.... thanks in advance xx",
    "MessageIndex": 0,
    "PostDate": "06/01/2016",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88937,0.htm",
    "Title": "Smelly and ashamed"
  }]
}