{
  "AuthorID": "Billusa",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Billusa",
  "Posts": [{
    "AuthorID": "Billusa",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Billusa",
    "Content": "I got that email too a while back -- stupid stuff! As to the post, I would avoid that green tea and make your own. However, do not be worried that you have done something wrong, just do something better going forward and make your own. Stevia is a great sweetener available at Whole Foods and at health food stores. Evryone with cancer will have quality of life issues. Someone's anecdotal writings of what they read and what they did should no more rule your life than the statistics of survival for your cancer-from do. You are you.  That being said, avoiding REFINED sugars is advisable for the cancer-feeding reasons you have read about.  But, you are not going to avoid sugars in a modern diet, even a modified modern diet. Avoid high fructose corn syrup -- it's in lots of foods, inc. granola etc. marketed by General Mills, etc. Read labels. Many markets now make baked goods with honey. I eat frozen custard which has cane sugar, but it also has eggs and calories that are good my my weight maintenance (which is MORE important) as well as a treat! ( I am a stage IV pan. can. liver mets 6 month survivor this week still working and at 98% target weight, NO chemo side effects!). I highly recommend this book:vhttp://www.amazon.com/Cancer-Essential-Things-Revised-Update It speaks to what you ask plus much more.  If you have access to a oncology nutritionist via your clinic, seek them out. Most all have them. Mine was invaluable. A piece of chocolate and some sugar in your cappucino on the weekend and a vanilla milkshake are not going to kill you.  If they did, then you would not bereading what I just wrote. Best of luck to you.  ",
    "MessageIndex": 11,
    "PostDate": "20/11/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30432,0.htm",
    "Title": "Nutrition-green tea, sugar"
  }]
}