{
  "AuthorID": "Blair",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Blair",
  "Posts": [
    {
      "AuthorID": "Blair",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Blair",
      "Content": "Hello Wendy, This is my first time logging onto a message board so I hope this works OK. Hormone balancing may be worth investigating. I am currently arranging the hormone tests to discuss with my oncologist next month. I've had a 11yr history so far with breast cancer, a double mastectomy in 2000 and bone secondaries appeared in 2004. I have only just come across Dr John Lees book called What Your Doctor May Not Tell You About Breast Cancer, How Hormone Balance Can Help Save Your Life. (ISBN 0670040398) website www.johnleemd.com I have never heard of estrogen dominance before reading this book and believe that this is what is causing my breast cancer. Hormone balancing with natural progesterone is not well known here in Australia and not currently used as a treatment but I am keen to discuss this with my oncologist. In the US you can arrange saliva testing for your hormones through salivatest.com (the director of this company co-wrote the above book with Dr Lee). Now that I understand the clear connection between hormone balance and breast cancer I don't understand why hormone levels are not tested automatically for breast cancer patients upon diagnosis. I'm not sure if they are in the states but here it isn't common practice at all. You will no doubt feel as good as I did to read on page 49 Dr Lee says, \"Once a cancer has invaded other parts of the body, stopping its growth becomes much more complicated, but it can be done\". with best wishes, Blair",
      "MessageIndex": 1,
      "PostDate": "22/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4190,0.htm",
      "Title": "Metastatic Breast Cancer to The Bone"
    },
    {
      "AuthorID": "Blair",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Blair",
      "Content": "Dear Amy, I haven't been checked for HER2. Hormone balance is relevant to everyone though. Breast cancer is a hormone driven cancer that they try to control with hormone therapy and yet when I showed this information to my oncologist he didn't even know how to read a hormone report. Hormone balancing is very simple though, just a saliva test and bio-identical hormone creams if imbalances show up. Apparantly most women with breast cancer are estrogen dominant, low progesterone, low DHEA and high cortisol. I only just got my saliva results back on Monday and saw my oncologist with them yesterday. I had exactly that hormone profile and yet he said he couldn't see the relevance. I explained about Dr Lee's book and the relevance of hormonal imbalances causing breast, uterine and prostrate cancer but he didn't want to know. I have been very fortunate though to find a local GP that had breast cancer herself 3 years ago and that is how she became aware of the importance of hormone balance in preventing and treating breast cancer. I have an appointment with her tomorrow and she will be able to prescribe the right balances of everything for me. I currently have bone secondaries and several tumours around my collarbone and scar tissue so I am keen to see what results I can get by hormone balancing. To me this feels like the first time I have been presented with something to help fix the cause and not just treat the symptoms. There are many symptoms of estrogen dominance apart from the more serious such as breast, uterine and prostrate cancer it is also PMS, mood swings, fibrocystic breasts, ovarian cyts, endometriosis, annovulation, irregular periods etc., etc., I had many of these symptoms since the age of 11 which is why when I read Dr Lee's book I had a saliva test done straight away. I would encourage everyone with either of these three cancers to have a saliva test done and interpreted by an experienced doctor. On Dr. David Zava's website www.salivatest.com he says that if you have breast cancer to indicate that on your paperwork when sending in your sample and he will review it for you. I will keep in touch if you like to let you know what kind of results I get with the hormones. I wish your Mum every success and happiness, she is lucky to have a daughter looking out for her as you are. My children are still littlies just 8 and 4. I know with this information I now have that I can protect my daughter from breast cancer once she goes through puberty and her hormones start to kick in, ensuring they are all at optimal levels will offer her alot of protection. my best wishes Amy, Blair",
      "MessageIndex": 3,
      "PostDate": "08/02/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4190,0.htm",
      "Title": "Metastatic Breast Cancer to The Bone"
    }
  ]
}