{
  "AuthorID": "bluefootedbooby",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
  "Posts": [
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "I have recently had a core biopsy and have been diagnosed with DCIS. Now I have to have an MRI guided biopsy because the MRI I had (where they inject dye into you) showed something in a different area in the same breast  and also in my other breast. I will be having one done one 22nd and the other one one the 23rd. Has anyone had  an MRI guided core biopsy? I am not looking forward to them as I was told each on will take about 3 hrs. Will this be worse than a regular biopsy?",
      "MessageIndex": 0,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31267,0.htm",
      "Title": "MRI guided biopsy"
    },
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "  On 12/16/2008 bluefootedbooby wrote: I have recently had a core biopsy and have been diagnosed with DCIS. Now I have to have an MRI guided biopsy because the MRI I had (where they inject dye into you) showed something in a different area in the same breast  and also in my other breast. I will be having one done one 22nd and the other one one the 23rd. Has anyone had  an MRI guided core biopsy? I am not looking forward to them as I was told each on will take about 3 hrs. Will this be worse than a regular biopsy?   never mind. not important. will do this on my own. I'm a strong woman.",
      "MessageIndex": 1,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31267,0.htm",
      "Title": "MRI guided biopsy"
    },
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "I cannot answer with experience on this subject but I will be going through the same thing and my Dr. said to get a sports bra to wear for good support. She also told me that I would probebly be off work for about 2 wks. I too would like to hear what others have to say on this subject.",
      "MessageIndex": 1,
      "PostDate": "10/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32019,0.htm",
      "Title": "Bra suggestions following lumpectomy"
    },
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "Mastectomy or lumpectomy? I 'm a 60 year old with DCIS. I can't decide which to have.  Ihave very fair and sensitive skin prone to sunburn. Would radiation be harder on me than someone with less sensitive skin? Thanks in advance for any input.",
      "MessageIndex": 0,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31962,0.htm",
      "Title": "Which option? Please help"
    },
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "Hi everyone. Well, I had my lumpectomy on Jan. 27. The surgery went well (good drugs) but the wires I had to have inserted before surgey were not fun. But I don't like to dwell on unpleasant things so enough about that. Unfortunately I had to go back this morning, FEB. 5TH,  and have more surgery because the DR. wanted wider margins. Now I occasionally have shooting pains through my nipple but hopefully that will go away. I will be starting radiation next month for about 7 wks. The rad. oncologist said I am not a candidate for the shorter therapy. She also said that they are going to treat the whole breast and not just one area. When I learned of some of the possible side effects I thought about having a mastectomy but she said the way my cancer is she would want me to have the radiation either way.  I know I am lucky that I caught this early and that I do have choices and my gut feeling is that I have made the right choice for me. I thank all of you that have responded to me and my prayers are with you. Bluefootedbooby  aka Nancy",
      "MessageIndex": 9,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31962,0.htm",
      "Title": "Which option? Please help"
    },
    {
      "AuthorID": "bluefootedbooby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bluefootedbooby",
      "Content": "I want to thank you all for your help and input. I have decided to go with the lumpectomy and radiation. Will post with updates as they occur. Thanks again.",
      "MessageIndex": 5,
      "PostDate": "10/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31962,0.htm",
      "Title": "Which option? Please help"
    }
  ]
}