{
  "AuthorID": "Bnwaters79",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bnwaters79",
  "Posts": [
    {
      "AuthorID": "Bnwaters79",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bnwaters79",
      "Content": "I had a lump under my nipple that only I could feel. Also inverted nipple at times and some discharge that was bloody once. Ultrasound came back normal. 6 months later still having same issue went back to OBGYN who sent me for diagnostic mammogram and second ultrasound. Tech found what i was talking about and now I have a core needle biopsy next Wednesday. Saw surgeon who told me he doesn't think I should worry and that it may be Fibroadenoma but I can't find where this causes inversion or discharge. I'm really worried",
      "MessageIndex": 1,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,87228,0.htm",
      "Title": "Mammo and ultrasound normal but have discharge"
    },
    {
      "AuthorID": "Bnwaters79",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bnwaters79",
      "Content": "Bnwaters79 has updated their status I am 35 and noticed my left nipple being inverted when I removed my bra. Also nipple just looks different to me, almost like its open. A few months later I had some discharge and I could feel a pea sized lump under my nipple. Went for ultrasound which came back normal. Still thought something wasn't right. Had diagnostic mammogram Monday and ultrasound. showed a small mass under my nipple. Core biopsy is next Wednesday. Quite nervous as to what they will find.",
      "MessageIndex": 0,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,87986,0.htm",
      "Title": "Almost relieved that I'm not crazy"
    },
    {
      "AuthorID": "Bnwaters79",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bnwaters79",
      "Content": "Funny you mentioned this. I've been reading about this and am calling OBGYN tomorrow to request a biopsy of nipple as well. Thank you for the advice",
      "MessageIndex": 3,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,87986,0.htm",
      "Title": "Almost relieved that I'm not crazy"
    }
  ]
}