{
  "AuthorID": "BnyOh",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BnyOh",
  "Posts": [
    {
      "AuthorID": "BnyOh",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BnyOh",
      "Content": "?Hi, I've been having these spots turn up for the last year and a half or more. They're the size of a bug bite, but definitely aren't bug bites. They're bright pink to red, a little larger than a pencil eraser. They appear not just over my breasts but also appear in my arm pits and the under skin of my upper arms. While they can appear over the same area on both sides of my body, they predominantly show up on my left side. Also, my breasts or arm pitswill itch like mad for no good reason, out of the blue. Sometimes the itching is localized to a larger bright pink/red \"hot spot\"--about 4\" in diameter, usually on the upper part of my breasts, the spots are inflamed, itchy, bright and hot. They're definitely not hives. The only other thing I have going on locally is that I've recently lost 1/4 of my lung capacity in the last year. I've also been increasingly tired during the day. Overall, systemically, I have about 7+ moderate to mostly severe autoimmune conditions. Raynaud's showed up first when I was still a toddler. Next came RA which showed up around age 8. Endometriosis turned up at age 11 and was stage 4 pre-cancerous by 19, had a hysterectomy for that at 22. The RA flared up in a major way in my 30's, barring me from much work. Next came Lichen Planus, severe, erosive and persistent every day to this day. Next came severe photosensitive central nervous system Lupus. No cure for that one either. Now I have to live inside in dark rooms while wearing light protective clothes all the time, indoors and outside. This one officially put me out of work and on disability. Next came Hashimoto's disease, for which I lost my thyroid. Then came Sjogren's. My tear ducts were cauterized for that, still my eyes are to the point where I have corneal damage and Latice-form retinopathy. Sjogren's also took all of my teeth 3 years ago. Severe migraines came on about 3 years ago, so I get shots in my head, face and neck every couple months for those. I'm in my early 40's. I'm wondering whether I might have Inflammatory Breast Cancer and, if so, who might my options be to have someone diagnose it. Thanks so much for replies!",
      "MessageIndex": 0,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,120282,0.htm",
      "Title": "Wondering wether this might be inflammatory breast cancer"
    },
    {
      "AuthorID": "BnyOh",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/BnyOh",
      "Content": "I forgot to mention heredity--both of my grandparents had cancer as well as both my mom and dad. Thanks!",
      "MessageIndex": 1,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,120282,0.htm",
      "Title": "Wondering wether this might be inflammatory breast cancer"
    }
  ]
}