{
  "AuthorID": "Bonnie6264",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
  "Posts": [
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": " Hi Tre   Thanks for your concern.  I appreciate it.  The hospital that did my biopsy usually doesn't have to send the specimens out. I work for the same hospital.  The concern is that 2 path dr's didn't agree on the matter.  IE, if we look at a cloud and I say it looks like a flower but you say it looks like a person the results would be different.  My family does have a high cancer rate on my fathers side. My father died of lung cancer with mets to the brain.  My grandfather died of bladder cancer, my Aunt had breast cancer (she got a masectomy), my cousin who is in his 40's has bladder cancer, so now you can see why I am so not optomistic.  I would just think to get a mastectomy if it comes back positive.  Just get it out.    I will keep you posted as far as my results go.  Thanks again for your concern.      Bonnie :)   On 2/13/2009 trehouse60 wrote: Hi Bonnie, Hard to answer your questions, not knowing more about your situation.   If you had the biopsy done at a very small medical center, they may actually send a lot of biopsy samples to another facility for evaluation.  If you had it done at a larger center that deals with cancer a lot, then I would say probably not so often that they send samples out. However, it is good that they are checking with someone else if they have the least concern as to what this is.  Better to have to wait a little longer for test results that are reliable, than to be given a hasty result that might not be accurate. As to lumpectomy or mastectomy, that will depend a lot on your biopsy result.  If this is a slow growing, high grade cancer, depending upon where it its in your breast, how big it is, and at an early stage, most likely lumpectomy is sufficient.  If it's a faster growing and/or more invasive cancer, or a low grade cancer, they may want you to have a mastectomy regardless. (I know many people are confused about the difference between grade of cancer and stage of cancer - most people think they are the same thing, but they're not.  Grade of cancer means how highly differentiated the cells are - the more differentiated, the easier the cancer is to treat, and the higher it will be graded.  So a grade 4 cancer is much better to have than a grade 0 cancer.  Differentiated means how well-formed the cells are and how specific the cells are in development.   Stage of cancer indicates how advanced it is - whether it is  just in one spot, or has begun to move/spread to other parts of the body.  The lower the stage number, the better the situation - you want to hear stage 1, 1a, or 1b, as opposed to stage 2 or higher.) I personally lean toward breast conservation for women.  I think taking more tissue than you have to begs for trouble in terms of recovery and function thereafter, not to mention self - image. But I also think (to borrow the comments of several other posters to the board!):  it's just boobs.  You can replace the girls, but you can't replace your life.  For women who have a very fast growing, agressive cancer - perhaps best to try to clean it all out with a mastectomy right then and there, rather than waiting to see if they got clear margins around tissue removed with a lumpectomy.  There also is the matter of genetics - women who are diagnosed with oncogene for breast cancer might do well to have the entire breast removed.  (I am assuming that is NOT you, or you would have mentioned it??) Please let us know when you get your results back.  If it's really good news, we will all be glad to do the happy dance with you.  If it's not so good news, there are plenty of really good people who participate on the site and can give you great support as you move on through treatment. Sincerely, Tre  ",
      "MessageIndex": 2,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33168,0.htm",
      "Title": "uncertain diagnosis"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "Hello all   Well the results are in and I got the news that I have DCIS STAGE 1.  I am gertting a simple masectomy with immediate reconstruction.  I am so nervous.  I am going to do the the trams flap procedure.  I have been reading some horror stories on line about this procedure. Has anyone have a positive experience? I go to speak to the plastic surgeon on tues. I would appreciate any feedback.  thanks all  Bonnie  ",
      "MessageIndex": 4,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33168,0.htm",
      "Title": "uncertain diagnosis"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "I had an excisional bx done and the results are uncertain. They have to send my specimen to another hospital for evaluation/dx. Is this common?  I also would like to know lumpectomy or masectomy?  ",
      "MessageIndex": 0,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33168,0.htm",
      "Title": "uncertain diagnosis"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "going crazy is exactly what I am doing.  I am a 44 year old who has been put through the ringer and still don't have an answer, I know it can't be good.  On dec 20th of 07, I had a screening mammogram and it came back with calcs. so then I was told that I needed a diagnostic mamm, that came back inconclusive as well.  I had to have a sterotactic bx and when they did that, they saw 2 areas of concern, and that came back atypical ductual hyperplasia so  the pathologist recommended an exciosional biopsy. They reviewed my slides and were still uncertain, so they sent them to Johns Hopkins for a second opinion.  Johns Hopkins asked my pathologist for my tissue block because they weren't sure by just reviewing the slides. On top of that, this past friday, Feb 20, I wound up having a breast seroma that errupted through my breast and it looked and felt like I was hemmorraging and was rushed to the Er.  I am now on Antiobiotics and the hole in my aerola is draining and the dr wont stitch it because he said that would cause an infection because my breast needs to drain.  He said it will heal on its own.  I am going stir crazy.  I am so strong in front of my friends and family but now here I am, right now, it is 4:30 in the morning, I can't sleep I am scared as hell not knowing what the hell my result is going to be.  They keep telling me to stay positive,but how can I?  I know it isn't going to come back benign, because if it was benign, why would they have gone through all of this? Begnin is benign cut and dry.   I appreciate my pathologist sending my specimens to Johns Hopkins, they are a great hospital, so whatever dx they come back with, I will be satisfied .I know what I am going to do if it comes back maliginant, I am doing a simple mastectomy with the tram flap procedure, but the waiting is killing me. My surgeron says he wont do a lumpectomy because my breasts are small to begin with and the amt he would have to take out would make my breast to small, so the simple mastecomy would be the way to go.  I can't thank my drs enough for the lengths they are going through for me.  Any opinions?   ",
      "MessageIndex": 3,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32739,0.htm",
      "Title": "going crazy"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "  On 2/13/2009 trehouse60 wrote: Hi Bonnie, Hard to answer your questions, not knowing more about your situation.   If you had the biopsy done at a very small medical center, they may actually send a lot of biopsy samples to another facility for evaluation.  If you had it done at a larger center that deals with cancer a lot, then I would say probably not so often that they send samples out. However, it is good that they are checking with someone else if they have the least concern as to what this is.  Better to have to wait a little longer for test results that are reliable, than to be given a hasty result that might not be accurate. As to lumpectomy or mastectomy, that will depend a lot on your biopsy result.  If this is a slow growing, high grade cancer, depending upon where it its in your breast, how big it is, and at an early stage, most likely lumpectomy is sufficient.  If it's a faster growing and/or more invasive cancer, or a low grade cancer, they may want you to have a mastectomy regardless. (I know many people are confused about the difference between grade of cancer and stage of cancer - most people think they are the same thing, but they're not.  Grade of cancer means how highly differentiated the cells are - the more differentiated, the easier the cancer is to treat, and the higher it will be graded.  So a grade 4 cancer is much better to have than a grade 0 cancer.  Differentiated means how well-formed the cells are and how specific the cells are in development.   Stage of cancer indicates how advanced it is - whether it is  just in one spot, or has begun to move/spread to other parts of the body.  The lower the stage number, the better the situation - you want to hear stage 1, 1a, or 1b, as opposed to stage 2 or higher.) I personally lean toward breast conservation for women.  I think taking more tissue than you have to begs for trouble in terms of recovery and function thereafter, not to mention self - image. But I also think (to borrow the comments of several other posters to the board!):  it's just boobs.  You can replace the girls, but you can't replace your life.  For women who have a very fast growing, agressive cancer - perhaps best to try to clean it all out with a mastectomy right then and there, rather than waiting to see if they got clear margins around tissue removed with a lumpectomy.  There also is the matter of genetics - women who are diagnosed with oncogene for breast cancer might do well to have the entire breast removed.  (I am assuming that is NOT you, or you would have mentioned it??) Please let us know when you get your results back.  If it's really good news, we will all be glad to do the happy dance with you.  If it's not so good news, there are plenty of really good people who participate on the site and can give you great support as you move on through treatment. Sincerely, Tre   Hi Tre Thanks for replying.  I still haven't heard anything except that Johns Hopkins wanted my tissue block because they themselves couldn't make a diagnosis based on my slides.   What the heck????   I had my excisional biopsy on feb 11th and am still waiting.  I also wound up with a breast seroma that broke out through my aerola.  So instead of getting better, things seem to be going down hill. My dr and I already discussed the options if this does come back malignant.  He said he would do a simple masectomy and then I could have reconstruction surgery.  He said a lumpectomy wouldn't be for me because the amt of tissue he would take would remove most of my breast anyway.  Hopefully I can let you know soon, what my results will yield.  I am just going stir crazy here waiting for them.  Stayed tuned. Bonnie  ",
      "MessageIndex": 3,
      "PostDate": "22/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33168,0.htm",
      "Title": "uncertain diagnosis"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "HiTammie   Thanks for your post. I did find out that I have Stage 1 ductal carcinoma in situ.  I opted for a simple masectomy with immediate reconstruction with the tramsflap procedure.  I am so nervous I can't think straight. I go to see the plastic surgeon on tues, the oncology dr on thursday and then back to the surgeon on friday.  I imagine when I go back to him he will let me know when the surgery will take place.  I am so sorry to hear about you.  Can I ask why you didn't opt for a mast and how long have you had cancer?  Do you take tamoxifen?  I don't want to take that so I am hoping that I don't have to, but the surgeron said the onc dr might recommend it.  I am also going to push to get the BRCA markers done.  Because if I have the cancer gene then I will have both of the girls taken off.  Good luck to you, my prayers are with you.  Take care and I hope to hear from you soon.    ps....  where are you from?",
      "MessageIndex": 5,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32739,0.htm",
      "Title": "going crazy"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": " Hi Tammie   I am from PA.  Thanks for the post.  I wish you well on your journey.  My prayers are with.  I was given the choice of a lumpectomy in the beginning before I found out the dx, but since everything I had to go through the dr recommended the mast with reconstruction. He also recommeds that I take tamoxifen which I am reluctant to take because of all of the side effects.  I am going to see the onc dr on thursday, I am going to ask him to test me for the brca gene because if I have the breast cancer gene I am going to have both of the girls removed. I am scared out of my wits.  I chose to do the trams flap procdure, I just hope it will be a success.  I hope I will be able to do it, I go to talk to the ps on tues.  So I have a busy week next week.  Please keep in touch.  If you would like to personally email me my email address is --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--   Again, thanks for the reply, take care and god speed.   Bonnie On 2/27/2009 TurtleTAM wrote: Bonnie - I'm also 44 which attracted me to your post. My mammogram in December 2008 indicated abnormal tissue and one phone call started my roller coaster ride. I chose a lumpectomy because that was given to me as an option and if things didn't work out, then I could always do a masectomy later if needed. Plus, BC doesn't run in my family. I found out today that I don't have to do chemo but will be on tamoxifen for 5 years - haven't started it yet, just got the prescription today. I should start radiation next week. My thoughts and prayers are with you as you have to make decisions about your care and the girls. I'm from Missouri; where are you from? Tammie  ",
      "MessageIndex": 7,
      "PostDate": "28/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32739,0.htm",
      "Title": "going crazy"
    },
    {
      "AuthorID": "Bonnie6264",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bonnie6264",
      "Content": "Hi Tammie   I have a very supportive husband of 23 years.  He told me that he would be here for me no matter what.  We are in this together.  Thanks for the kind words, but I am really hesistant about that tamoxifen.  I already feel like I got brain fog.  I don't want to feel like crap just to be on a drug.  I guess I will just wait until I talk to the onc dr on thursday.  I have a busy week this week, so I will keep you posted.  So are you on the tamoxifen or are you taking another drug?  Take care until we speak again.   Bonnie",
      "MessageIndex": 9,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32739,0.htm",
      "Title": "going crazy"
    }
  ]
}