{
  "AuthorID": "breastless1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
  "Posts": [
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "Thanks so much for that information Believe it or not - I thought of earwax - but I don't have enough for all the skin areas! LOL I'll check out the link and try that ointment though and the selenium [[hugs]]everybody needs them~",
      "MessageIndex": 1,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27821,0.htm",
      "Title": "Skin problems caused by breast cancer drugs"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "Hi Garden800 If you have a spiritual side, it will guide you and keep you from feeling so alone. As the other poster so aptly replied - try not to live tomorrow until it gets here.... It may be something that can be brought into remission - And, don't beat yourself up for causing cancer. I have lost several friends who never smoked - Do you have family, friends - loved ones to help you through this difficult time? I sure hope so- because it makes the journey so much easier. If not, you came to the right place~ All these wonderful people here are reaching  out to help each other along the way. I will put you in my nightly prayers for God's protection.        ",
      "MessageIndex": 2,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27968,0.htm",
      "Title": "alone"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "At this point, the dr. should be telling you all you need to know. If not, then ask, ask and ask again. Let the dr. know how scared and lost you feel - As for the next evaluation, yes, most likely a biopsy. It is important that it be done so they will know if it is \"benign\" So let's for now hope for the best. Even if it isn't, there is so much success with treatment now than many years ago. We are all lucky we didn't live in the day of our Grandmothers.  Most of them had mastectomies when really not necessary. Also if you can bring a relative or friend with you to the dr. it will help you remember what the dr. said and not feel so alone  Keep us posted, promis?? [[hugs]] everybody needs them    ",
      "MessageIndex": 3,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27975,0.htm",
      "Title": "Uncertain"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "Wow never heard there was \"metal\" in tissue expanders Where did you learn that?? Got any links with that information? Also, yes, smoking can delay healing. Maybe get the patch to either quit for now or for good? I'm thinking of it too. My friend used Chantrix [not sure of spelling but I'm about to check it out} Good lucke",
      "MessageIndex": 1,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27701,0.htm",
      "Title": "Tissue expander causing problems"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "Wow never heard there was \"metal\" in tissue expanders Where did you learn that?? Got any links with that information? Also, yes, smoking can delay healing. Maybe get the patch to either quit for now or for good? I'm thinking of it too. My friend used Chantrix [not sure of spelling but I'm about to check it out} Good luck! [[[hugs]] everybody needs them",
      "MessageIndex": 2,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27701,0.htm",
      "Title": "Tissue expander causing problems"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "I lost my sister a few years ago - so I really know how you must feel.... We were like twins - and she was ME and I was HER -we could finish each other's sentences and laughed our way thru life Let's thank God that we at least had such dear sisters at all. Some people don't get it how close siblings can be. [[[hugs]]] everybody needs them    ",
      "MessageIndex": 6,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27649,0.htm",
      "Title": "My Dearest Sister Passed away"
    },
    {
      "AuthorID": "breastless1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/breastless1",
      "Content": "Hi! I just found your question on Google and decided to join this board because I may have a suggestion for your pain.  I have been suffering [progressively] now for a few years with pain from mastectomy. I recently discovered that without my knowledge, both my pectoral muscles had been removed [without my consent - and the muscles did not have any cancer!] I'm not saying this is your problem but you need to say what the operation entailed. Were the muscles removed?? If so, it causes alot of pain close to the rib cage.  That most likely is not the cause of your pain but --without going further [about your muscle removal] I will share what a new dr. proposed.   Lidocaine [Lidoderm] patches. I was reluctant to try it because I cannot bear anything against the skin ... but shazaam! I cut one of them in half [the long way] and pasted it on my skin and the pain immediately stopped! You have to apply one for 12 hours on and then 12 hours off- I think it will help you immensely- Ask your doc about trying this - I am thrilled with the results and can now do things I couldn't do before. [but still cannot overdo because there are NO muscles there]  [[hugs]] Everybody needs them          ",
      "MessageIndex": 6,
      "PostDate": "03/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26653,0.htm",
      "Title": "Ribcage pain a year later?"
    }
  ]
}