{
  "AuthorID": "brenda40",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
  "Posts": [
    {
      "AuthorID": "brenda40",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
      "Content": "On Aug 22, 2007 12:00 AM Gdpawel wrote: Although oral tyrosine kinase inhibitors, like Tykerb, offer patients a well-tolerated, conveniently administered alternative to intravenous (IV) therapy, Decisions Resources, one of the world's leading research and advisory firms for pharmaceutical and healthcare issues, found that oncologists are not yet ready to use Tykerb as a replacement for Herceptin. Ninety-one percent of surveyed oncologists stated that intravenous (IV) cancer therapies are more profitable than oral therapies. And fifty-eight percent of oncologists say they would favor IV Herceptin over oral Tykerb because administration of IV drugs remains an important source of income for their practices. Selling Cancer Chemotherapy With Concessions Creates Conflicts Of Interest For Oncologists http://www.healthyskepticism.org/news/2007/Jun.php \"\" target=\"_blank\" rel=\"nofollow\">http://www.healthyskepticism.org/news/2007/Jun.php \" target=\"_blank\" rel=\"nofollow\">http://www.healthyskepticism.org/news/2007/Jun.php     WOW!  I know this is an older article but I found it searching for more info on Tykerb.  It sickens me that it comes down to money & not the patient.  My husband has been on Tykerb for almost a year & is having good results.  We had targeted therapy for a re-current tonsil cancer with mets to the lungs an found he was Her2 Neu +  : Very rare in H&N cancer.  Only about 3 %  are ever this gene.  It was difficult to get the doc to write the script & even tougher to get the insurance to pay. Thank God that it's working to control & lots of prayer & faith we are very encouraged & live each day at a time.   Just felt like sharing. The tumor board at OSU - Dr. Teknos is following the case & even opened an account with the lab in Arizona that did the tumor testing.  The way of the future in a cure for this disease. Have a great weekend & go Green Bay!",
      "MessageIndex": 7,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7235,0.htm",
      "Title": "is Tykerb Better Than Herceptin?"
    },
    {
      "AuthorID": "brenda40",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
      "Content": "Dave, What are your thoughts on this?",
      "MessageIndex": 8,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7235,0.htm",
      "Title": "is Tykerb Better Than Herceptin?"
    },
    {
      "AuthorID": "brenda40",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
      "Content": "brenda40has updated theirstatus Have ot been for a while Lots have happened We were caregivers for our aging mothers who eventually passed. Manjit had a massive stroke during that time but can say has pretty much had a complete recovery and doing well. The stroke was a result of the intense radiation to the neck The reason for my post today is that we have sealed bottles of Tykerb& Xeloda that he no longer needs. Does anyone need?",
      "MessageIndex": 0,
      "PostDate": "14/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81257,0.htm",
      "Title": "Oral Tykerb & Zeloda"
    },
    {
      "AuthorID": "brenda40",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
      "Content": "On Sep 12, 2014 11:41 AM blrydell wrote: I've been diagnosed with stage 4 her2/neu protein positive breast cancer and am scheduled to start Herceptin on Monday.  I read a book on it and seemed like about 40% of the people survived.  Anyone out there with info on this type of cancer and Herceptin?  Let me know if you are doing this treatment if you are doing it with chemo and if so, what type of chemo. Interested to see how you are doing?",
      "MessageIndex": 1,
      "PostDate": "14/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79476,0.htm",
      "Title": "HER2/Neu protein positive breast cancer"
    },
    {
      "AuthorID": "brenda40",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brenda40",
      "Content": "Hi Did you find anyone yet?",
      "MessageIndex": 2,
      "PostDate": "14/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,80057,0.htm",
      "Title": "looking for Intravenous Vit C provider in Northern CA"
    }
  ]
}