{
  "AuthorID": "brigrass",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brigrass",
  "Posts": [
    {
      "AuthorID": "brigrass",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brigrass",
      "Content": "I came across this new information on how biotech companies are trying to treat cancer.  I believe this is a new therapy for cancer and so far it has been successful. To treat the cancer, dentretic cells are sensitized to recognize proteins on the surface of cancer cells as a marker for diseased tissue. In the immunotherapy approach, the sensitized dendritic cells direct certain white blood cells to seek out and attack the cancer. The companies I am aware of that do this are Denderon and Quantum Immunologics. Denderon only treats prostate cancer while Quantum Immunologics can treat breast cancer. If anyone here that is interested in the fight for curing breast cancer, a company called Mentor Capital (MNTR) owns 20% of Quantum. The money which people invest in MNTR goes to Quantum’s FDA trials which costs $100,000 per cancer patient. At this point Mentor Capital is considered to be a pure investment in Quantum Immunologics. I hope this is informative and interesting to those who are intrigued by new therapies for breast cancer. If i didnt explain it enough or am unclear more information can be found at mentorcapital.com or quantumimmunologics.com.",
      "MessageIndex": 0,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39271,0.htm",
      "Title": "New Breast Cancer Treatment"
    },
    {
      "AuthorID": "brigrass",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/brigrass",
      "Content": "If you or someone special to you has been affected by cancer, you might find support from others by leaving a dedication at http://mentorcapital.com/Dedications_To_Loved_Ones.html  who funds Breast Cancer Trials.",
      "MessageIndex": 0,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40142,0.htm",
      "Title": "support and dedication"
    }
  ]
}