{
  "AuthorID": "Broker4c21",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Broker4c21",
  "Posts": [{
    "AuthorID": "Broker4c21",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Broker4c21",
    "Content": "First I want to say I am new this board and please excuse any misspelled words. I am 39 years old and about 3 years ago I found a lump in my left breast which was in the milk ducts very close to the nipple area. Went to my familt Doctor and she sent me for a mamagram once that was done I had a ultra-sound. Doctor there basically told me \"Nothing to worry about its like a pimple under the skin, if it becomes larger or sore have it rechecked. 2 1/2 yrs later it looks larger, different and becoming sore. Go back to family Doctor have the mamagram and ultra-sound done once again and let me add with the same Doctor. This time he orders a bioptcy. Knowing that about 3 years prior I had a lump removed my the same breast but it was begnied, I knew this time I wasn't going to be so lucky. Results breast cancer and the tumor had only grown 2 milimeters over the 2 1/2 yrs but it is an agressive cancer which the harmones feeds the cancer. I go in for surgery and have the left breast removed and decided to keep the right breast since there was no past problems (Ifelt I needed to keep the right breast it was part of me I needed). Durning surgery I had the expander put in and 4 limpth noydes where removed. 3 out the 4 had tumors and my surgeon felt no seeds left but I needed to go in a week later and have the rest removed which where 11 and they all came back negative. But with the 3 out of the 4 put me in a stage 2. I then was told once all testing came back that seeds did leave one tumor and facing radiation. I have finished chemo which where 8 rounds and my blood work has always been excellent and my weight as well. My plastuc surgeon a month before having reconstruction done tells me to give up smoking or he will not do surgery, I did and he even tested me and I passed the test. Then he tells me a week before surgery since I dont understand the whole procedure of the surgery he doesnt feel comfortable giving it to me. I explained I understand the complications of all surgeries I have been through and also the out come of this surgery may not be perfect and I may need more than one surgery by him to make some twinking. Then he tells me it is elective surgery and he can elect to give it give it to me and with me facing radiation he doesnt feel comfortable in performing the surgery. Well I finally gave him my opinion which I explained to him he knew I was facing radiation 6 months ago and he could have told me that. he tells me one month before surgery to quit smoking which he should have told me 6 months ago and now to tell me 1 week before surgery he will not give me this surgery because I am facing radiation this was a bunch a bull. I have been through a lot in 6 months and if he wasnt going to do surgery then why did he set my surgery up not once but twice and then to tell me he is not going to do this and also for 6 months be had been filling my expander with salt water this was unfair to me because I dont understand everything clearing. Well I am going to seek the advice of two other plastic surgeons next week. My ? is has anyone ever had the implant(s) placed before going through radiation if so what was the outcome? The plastic surgeon I was seeing told me from day one he could do the recontruction prior to radiation because of the expander being in placed and expanding the tissue but if I came to him after radiation he would not be able to since the tissue could be damaged from the radation. I am looking at 6-8 weeks Mon-Fri of radation treatments. I am concered about my health but no my chemo doc or radiation doc can guarantee with the chemo and radiation is the cancer will be gone. I feel with reconstuction I will feel whole again as a woman. Please give me your advice or any stories relating to my ? and issues.   Thank you ahead of time. Connie  ",
    "MessageIndex": 0,
    "PostDate": "02/05/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11757,0.htm",
    "Title": "Needing advice or information."
  }]
}