{
  "AuthorID": "Broken",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Broken",
  "Posts": [
    {
      "AuthorID": "Broken",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Broken",
      "Content": "Joeys Mom: Just go to Dr Oz website. In the search engine type Saffron and it will come up.  I've copied & pasted it below for you.  Also, search Gleevac, the Cancer Miracle Pill that he says is working miracles for all cancer patients. Dr Oz: Saffron Kills Cancer Doctor Oz said that saffron comes from the inside of a crocus plant, and it is the “gold standard” for spices.  Saffron helps to fight off cancer.  Dr Oz explained that cancer cells grow through bringing and building their own blood supply in your body.  The saffron can actually enter the cancer cells and send a signal that causes the cancer to “commit suicide.”  Dr Oz even said that saffron may be the cure for cancer in the future.  Saffron is not a cheap spice, it is around $10 per jar, but you only need a small pinch. I know how severe pain can be.  My late husband, the love of my life just passed three months ago from head/neck cancer treated the traditional way of surgery & Chemotherapy.  My heart is with you in your fight for a pain free cure/recovery/remission, etc.  Broken.",
      "MessageIndex": 1,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,52963,0.htm",
      "Title": "saffron<<"
    },
    {
      "AuthorID": "Broken",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Broken",
      "Content": "bonjouriena, I lost my Mother July 2006 from non-cancer illness.  I too was so very devistated in every way.  Since my father died at age 33 when I was 6, when my mom died I had this overwelming sense of being all alone even though I had a older sister and younger brother.  Over the years, that feeling has never left me and I'm 57 years old.  Boy or boy did I ever have that horrible sense of being all alone again in August 2010 when my husband of 43 years passed.  I cried so hard for my husband but I cried even harder for my mom.  I just wished my mom had of been with me to deal with his death.  Mom's just always have this deep connection to their children.  They are the ones that always make everything alright it seems.  Without them, we're lost in a way.  It makes me so sad just writing about it.  But - we always seem to get through it - we're like the energizing bunny, we just keep on going & going & going!!!!!!!  And if you're a mother yourself - some day your children will feel the same about you.  As heartbroken as I get about my mom & husband the one thing that always gets me back in control is they are not suffering anymore.  But I still miss them terribly & always will until my end of time. I've come to know that when I think of their suffering and the journey they had before their death takes me to this deep sorrow and broken heart for their suffering which sometimes is even worse then thinking about their actual death.  I try to avoid going to that place.  Be strong my friend, God will help us through this journey and someday, the pain won't be so strong. I miss my Mom & Husband. Broken",
      "MessageIndex": 2,
      "PostDate": "29/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54273,0.htm",
      "Title": "Lost my Mother"
    }
  ]
}