{
  "AuthorID": "Brumie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Brumie",
  "Posts": [
    {
      "AuthorID": "Brumie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Brumie",
      "Content": "My name is Karen and am 48 yrs old. I was diagnosed with breast cancer stage 1, grade 2 in January 2015. Had a left mastectomy in April 2015 with reconstruction on right Breast I was told I could not have radiation due to my autoimmune disease, Lupus, which I have had for over 25 yrs. so I get inflammation of joints, aches and pains, had to have knees replaced in 2012 Cuz I was bone on bone. Had a work injury in 2009 with my back. 2 compression fractures and 2 herniated discs with degenerative joint disease. With all of my health issues already, they want me to take arimidex. And by what I have read, it sounds like I don't want to take it.. I don't want my already health issues to get even worse by this medicine or anything else for that matter. What do I do? Any suggestions?",
      "MessageIndex": 0,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,84438,0.htm",
      "Title": "To take arimidex or not?"
    },
    {
      "AuthorID": "Brumie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Brumie",
      "Content": "Dear Ann, I am so sorry to hear of your heart problems. I was an ER nurse, and that is why I am so concerned about taking this drug. All those side effects. Well, I told the dr I was not going to take it and he yelled at me! Asked me why I wouldn't want to take it? Because my chances of getting breast cancer back with med is 5%. If I don't take Med, it's only 15%. I said I would take my chances. Because I have a life right now with my 4 granddaughters and I don't want to end up with no quality of life in bed all the time or worse. I will keep you in my prayers! Karen",
      "MessageIndex": 3,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,84438,0.htm",
      "Title": "To take arimidex or not?"
    },
    {
      "AuthorID": "Brumie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Brumie",
      "Content": "Well radiation oncologist told me that this was the first time he had to tell someone to have a mastectomy vs. a lumpectomy, mainly due to my lupus. Also, I was not allowed to have radiation due to my lupus, it would only burn my skin even worse plus make my lupus break out. Medical oncologist , like I told Ann yelled at me cuz I told him I wasn't going to take it due to side effects. I will keep you also in my prayers! Karen",
      "MessageIndex": 4,
      "PostDate": "21/05/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,84438,0.htm",
      "Title": "To take arimidex or not?"
    }
  ]
}