{
  "AuthorID": "Bryan41",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bryan41",
  "Posts": [{
    "AuthorID": "Bryan41",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Bryan41",
    "Content": "My name is Thomas im 41 years old. My mother was a Thyroid Cancer survivor she had back in her late 40's. On September 9th 2007 I had to take her to the hospital. She was placed in the Cardiac Care center they said her heart had went out of sync. Her Heart went back by itself in less then 1 day. She was getting better each day I visited her. I left her Sept 11th  at 8:30pm kissed her and told her I would see her the next morning. She called me that night September 11th 9:56pm and joked with me that she would like to talk to her cat named China. The next morning we called at 8:18am to check on her and someone answered her phone and said we were going to call you to tell you  that Your mother has been put in the ICU that she had a Blood clot on her lung. The ICU nurse told me that she started asking for her kids at 4:30am. But no one called us. The ICU nurse  told us she did not have a blood clot on her lung. The Doctor said she had a Blood infection called sepsis and Ammonia  and theres so much more. He said they where pumping her full of infection medicine and giving her something to try and bring her blood pressure back up but nothing was working. They had her on a ventilator and her oxygen saturation was at 98%.the doctor even said they tried to put a Pacemaker on her. The ICU nurse told me I would not say she was dying but she was in serious condition.  She passed at 11:45am. My world ended that day. At her funeral her nurse came and told my girlfriend and I that at the end of her shift at 7:30am she went into the room and seen alot of people in my moms room and was told that my mom had a panic attack and they decided to sedate her. She had had a panic attack 2 days before this and her nurse told us she talked my mom through it until she felt better. Her Oxygen cord had got tangled on her bed. She has had panic attacks all her life I also have them. I had a autopsy which made things even more not make sense. For the Autopsy the hospital supplied blood samples 2 days before she passed it showed No Blood thinner called Heparin which she had been put on. It said the cause of Death was  Cardiovascular collapse due to acute cardiac arrhythmia due to dilated cardiomyopathy with superimposed hypertensive cardiovascular disease. With so many different story's I feel like I have lost my soul. I feel no emotions and as each day passes I get worse.  I have not stopped crying since her Death. If it was not for my Girlfriend of 17 years I don't think i would make it. I build and fix computers for a living. I have not worked on a computer since her death. My girlfriend is working and doing it all.  I just feel like I don't want to be here anymore. I sit in her Condo all day and cry. Ive tried to get help but with no insurance no doctor wants to help.  I don't know how much more I can take. The stress of her death only having 3 months more in her condo credit card bills not working I just cant function anymore. I have 3 months to figure out what to do with all here stuff thats she has had here for 7 years her cat and find somewhere to live. I need help. The stress is taking a toll on me and my health. I feel so embarrassed but I cant control myself crying. I break down in stores, Christmas is killing me. Im so depressed. Im sorry this message is so long. No matter where you are always call your Mom once a week and tell her you love her. Thomas ",
    "MessageIndex": 7,
    "PostDate": "09/12/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8272,0.htm",
    "Title": "dealing with my mothers death"
  }]
}