{
  "AuthorID": "bunnydette",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bunnydette",
  "Posts": [
    {
      "AuthorID": "bunnydette",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bunnydette",
      "Content": "  On 7/31/2007 kdmackey wrote: Hi   I'm new to this site.  I'm concerned about some lumps I found in my breast.  I am experienceing a lot of pain.  I don't have insurance so I'm tring to find out what I can before I start doing something serious. Someone told me if they hurt its may just be cist not cancer.  If any- one has any information about this I would like to hear it.  Thanks kd    Hi, I'm in a similar situation. I don't have insurance. I found a lump last fall. I went online and found a organization called the Key of Life. They are out of Baltimore, MD. They will give you a grant to go to a doctor to have a mammgram, breast ultrasound and I think they will help you with a some of the surgery cost. Anyhow, it doesn't matter what your income level is. All they really want to know is that you need to be tested and you don't have insurance. Also, after my testing was done. I was told that I had tumors/cyst. I needed to see a surgery, but it cost me $300 alone just for the office visit to the surgery. The surgery told me if I could deal with the pain to go ahead and not have surgery. Well, after that visit I went to a Chinese Medicine school. They have been treating me for the last 9 or 10 months. The tumors have decrease alot, but on my last breast ultrasound the doctor's office informed me that I had a small nodule behind one of the tumors. This nodule wasn't there before. So now I have to have another mammagram. I was told to have the surgery if I need to after the mammogram.  So I do understand. It is very hard when funds are limited and/or you don't have insurance. But there are a few places that will help. ",
      "MessageIndex": 3,
      "PostDate": "31/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14885,0.htm",
      "Title": "cist or cancer"
    },
    {
      "AuthorID": "bunnydette",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/bunnydette",
      "Content": "Hi, The organization is called \"American Breast Cancer Foundation\". The number is (877)Key-2-life. And the address is 1220-B East Joppa Road, Suite 332, Baltimore, MD 21286  ",
      "MessageIndex": 7,
      "PostDate": "01/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14885,0.htm",
      "Title": "cist or cancer"
    }
  ]
}