{
  "AuthorID": "c0deblu2th",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/c0deblu2th",
  "Posts": [
    {
      "AuthorID": "c0deblu2th",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/c0deblu2th",
      "Content": "I stopped my tamoxefen after one year. Suffered constant pain which I could live with but the vertigo I couldn't. My teeth got chipped and dislocated my shoulder as I was falling all the time. My oncologist insisted it wasn't the tamoxefen but every time I stopped vertigo stopped. It was a near fatal experience from a combination of tamoxefen, anti depressants to help flushes and extreme moods and anti inflammatory tabs for shoulder that made me think I have had enough.  I wouldn't advise anyone to stop unless they had good reason. ",
      "MessageIndex": 1,
      "PostDate": "16/10/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93348,0.htm",
      "Title": "RE: Did anyone go off Arimidex early and have long term success?"
    },
    {
      "AuthorID": "c0deblu2th",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/c0deblu2th",
      "Content": "I had four AC chemo and needed 12 taxol after, the easy one I was told. After two something didn't feel right. Got peripheral neuropathy in both feet and could barely walk. Some say its like walking on glass, mine felt I was wearing shoes three sizes too small. Very hard to walk. On third one started to get spasms and couldn't talk.  On my next due date a woman who had started a week before me arrived in  a wheelchair. I got up and left and never went back. It does happen. It went completely in one foot, but in winter the other hurts if it gets a little cold. It like having block of ice stuck to it.  But I can live with this and am able to walk properly again. Hope she feels better soon.",
      "MessageIndex": 1,
      "PostDate": "16/10/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93281,0.htm",
      "Title": "Neuropathy from chemo"
    }
  ]
}