{
  "AuthorID": "Caduceusprn",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Caduceusprn",
  "Posts": [{
    "AuthorID": "Caduceusprn",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Caduceusprn",
    "Content": "  On 1/29/2007 Mary@hotmail wrote: I am new to this board aand pray somebody can help me.My mum had breast cancer last august and was operated on were they found a second cancer in the breast.they also found cancer in four lymph nodes of which they removed.mum had 15 hits of radiotherapy then was started on femera.to try and keep it short mum got severe reactions to femera and was hospitalized for a month.mumcame out of hospital but within three days she was back in with severe back pain.to make matters worse she has a crumbling spine and severe neck problems,she is under a orthopedic hospital for this.the hospital has said mum has a severe infection of which is deep in her body.they have found an abnormality on her bone scan xray around her spine of which i am not suprised due to her severe back problems.now the hospital say she has to have further tests because they do not know if she has cancer or the severe infection that is causing the pain.she is also on high dosages of morphine because of the pain.but i have been reading this message board from people that have cancer of the spine and they do not seem in any pain at all yet my mum is in agony with her back and yet the hospital do not know what is going on.can anybody help me.I am so afraid? I'm so sorry for your mother's diagnosis of breast cancer.  I know you have a concern about her back pain.  The back pain could be secondary from radiation, also.  Secondly, she could have a severe form of arthritis caused by age, meds, etc.  She needs to keep following up with her physician.  I'm in the nursing profession and have seen all different reasons for severe back pain.  I wish her luck!  Debi Ballee'",
    "MessageIndex": 1,
    "PostDate": "01/02/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9181,0.htm",
    "Title": "spine cancer"
  }]
}