{
  "AuthorID": "Cajun",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
  "Posts": [
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "Surgery was done this past Monday to remove a milk duct from my right breast.  Diagnosed this past Thursday with Stage 0 'in-situ\" duct carcinoma.  My symptoms were pain and a dark bloody discharge. Doctor wants to do a lumpectomy and then 5-6 weeks of radiation.  No lymph nodes will be removed and no chemo. will be given.   Since a digital mammogram done in December 2007 showed nothing an MRI was done on both breasts this past Thursday.  I am awaiting the results that may show something in both breasts.  The doctor has said that I can delay treatment because this is a slow growing cancer. I beleive that cancer is a fungus.  I am familiar with Doug Kaufman.  I plan to follw the Phase One for a least 30 days to help kill off as much fungus as possible but I am not sure that it is a good idea to not have the lumpectomy and radiation. Does anyone know if I consult or get a second opinion with the Cancer Treatment Center will I be obligated to receive treatment from them?  The closest location is Oklahoma but that is 1300 miles round trip. Is there a directory available for doctors that beleive that cancer is a fungus and will prescribe anti-fungal drugs? Does anyone know if Dr. David Holland still sees patients? Thanks for your help.    ",
      "MessageIndex": 0,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19919,0.htm",
      "Title": "In-situ duct cells"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "  On 1/21/2008 Tumor wrote:   On 1/20/2008 Cajun wrote: Surgery was done this past Monday to remove a milk duct from my right breast.  Diagnosed this past Thursday with Stage 0 'in-situ\" duct carcinoma.  My symptoms were pain and a dark bloody discharge. Doctor wants to do a lumpectomy and then 5-6 weeks of radiation.  No lymph nodes will be removed and no chemo. will be given.   Since a digital mammogram done in December 2007 showed nothing an MRI was done on both breasts this past Thursday.  I am awaiting the results that may show something in both breasts.  The doctor has said that I can delay treatment because this is a slow growing cancer. I beleive that cancer is a fungus.  I am familiar with Doug Kaufman.  I plan to follw the Phase One for a least 30 days to help kill off as much fungus as possible but I am not sure that it is a good idea to not have the lumpectomy and radiation. Does anyone know if I consult or get a second opinion with the Cancer Treatment Center will I be obligated to receive treatment from them?  The closest location is Oklahoma but that is 1300 miles round trip. Is there a directory available for doctors that beleive that cancer is a fungus and will prescribe anti-fungal drugs? Does anyone know if Dr. David Holland still sees patients? Thanks for your help.     I have never heard of cancer being a fungal disease. But, I can tell you I had BC in the spring of 2006 and my last mammogram was done in 2004 and nothing showed up. I found my tumor on my own and it was in the ductal glands in the breast that never gave me any problems. My Cancer was, (stage 3) with (3 lymph nodes), affected. Had a single mastectomy.  So, you never know about this cancer. I have heard MRI is a good way to be tested. I had also gotten a CT of my liver in 2005 and no trace of cancer showed on those results. I took chemo. Refused radiation. Have seen too many people suffer permanent damage from radiation. The Radiologist told me I would have lung damage, but only the tip. Have also been told it would damage my heart and that can lead to congestive heart failure. I didn't take the chance and don't regret my decision. I won't let any Doctor burn up my organs. I have changed my diet and take cancer supplements and am doing great!!! I will be interested in how things turn out for you. Only you can decide what is best for your treatment.  Take Care, Beverly   I am still weighing my options.  What I don't like about radiation is that once I have it done on my breasts it can not be done again on my breasts.  That gives me less options if I have an occurence.  With radiation there is a 3.9% chance of a return within 8 years, without radition a 13.4% chance. I am 65 years old, I may be willing to take the chances of recurrence without radiation and if it does reoccur I will still be able to have radiation.  I personally believe that an anti-fungal diet will decrease my chance of a recurrence. The Phase 1 anti-fungal diet is very simiiar to a low carb diet.  In addition to low carb you should not have grains, peanuts, corn, sugar of any kind, carbonated beverages or artifical sweetners (you can use Stevia because it is an herb). Natural anti-fungal products include Olive Leaf Extract and Oil of Oregano. You also take vitamins & herb supplements.  Doug Kaufman has written a lot of books and he has a TV program called \"Know the Cause\".  Doctors don't know what causes cancer but most refuse to see the possibiites that it may be a fungus.  Fungus can kill just like cancer if untreated.  My husband had a lung fungus (blastomycosis) 35 years ago but the doctors thought he had cancer and was going to remove part of his lung.  When they cut him open they couldn't believe what they saw.  He had webs growing all through his body connected to lesions on all of his major organs.  Oscher diagnosed the lung fungus from a biopsy.  They didn't know what caused it they only knew how to treat it.  He was given anti-fungal drugs with an IV every day for three months and every other day for three months.  The side effects were as bad a chemo. When we started watching Doug Kaufman it didn't take us long to understand how he got the fungus.  He grew up on a farm, ate lots of corn, cormeal and peanuts.  Before he was diagnosed he was consuming a lot of peanut butter, oatmeal/peanut butter cookies, oatmeal, grits and granola cereal. Doctors use to be taught about fungus in medical school (find this in old medical books and journals) until anti-biotics was discovered.  Doctors treat symptoms not the cause and anti-biotics treated a lot of symptoms.  There doesn't seem to be any concern about the long term use of the recurring use of anti-biotics, instant relief is the goal. Anti-biotics do not kill fungus, fungus feeds on it.  Does make you think doesn't it! Thanks for your reply.",
      "MessageIndex": 2,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19919,0.htm",
      "Title": "In-situ duct cells"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "  On 2/20/2008 didi719 wrote: What you are describing sounds like Candidiasis also known as yeast overgrowth.  Yeast infections can be a side effect of frequent antibiotic use.  I have had three surgeries for BC and before and after each one I was given high powered antibiotics to prevent MRSA (resistant staph).  Then I had an attack of acute diverticulitis-more high dose antbiotics.  I developed the worst yeast infection of my life.  Tongue, throat vaginal, rectal, it was awful.  My dr prescribed Diflucan and Nystatin.  Then I was prescribed probiotics. (beneficial bacteria to build up intestinal flora and immune system) She recommended Flora Q.  At first I had some problems from yeast \"die off\" reaction, but I stuck with it and I feel much better.  I would NEVER suggest anti-fungal treatment alone, but for me, the yeast infection was something that ocurred due to my compromised immune system from my other treatments. Taking extra vitamins and probiotics (as advised by my dr.) to improve my overall health won't hurt me. Consider the possiblites that your cancer was a fungus and the anti-biotics allowed the fungus to spread to other parts of your body.  Anti-biotics do not cause fungus.  Fungus gets in our bodies because of what we are eating (sugars, grains, bread).  Anti-biotics do not kill fungus, instead it kills off the good bacteria along with the bad which allows the fungus to grow rapidly in our bodies.  Everyone should take a pro-biotic every day to  replenish the good bacteria. Your doctor is on the right track but she is only treating the symptoms she doesnt know how to make sure you don't get fungus again. So do yourself a favor, watch \"Know the Cause\" and consider getting on the Phase One diet and order some anti-fungal supplements.  You can give yourself a much better chance of 0% recurrence of any kind of cancer if you consider the possiblities. God Bless!",
      "MessageIndex": 4,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19919,0.htm",
      "Title": "In-situ duct cells"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "  On 6/19/2005 Cathrun04 wrote: I was so glad to read your message before I had radiation, and now that I'm done with it I must tell you that I had no side effects either. A little bit of a sore nipple for a while but used Aquafor and a no-stick gauze pad I picked up at the drugstore and it quickly healed. I feel very sorry for the women who have horrible experiences, what a nightmare on top of a DCIS diagnosis, but for those who may be reading this and are frightened, I'll say it again...it all went very smoothly for me. In fact, I had my last radiation treatment at 7:45 am and flew to Disney World at 10:50 am that same day. Although I will admit to asking for a doctor's note that indicated I couldn't stand in the sun for very long...alleviated some of the wait for the rides. I must tell you I have no guilt about that at all!! What the hell, I had been through 7 weeks of radiation treatment and a lumpectomy, dammit! I deserved a break!! But I had no fatigue (thank God) and in fact I started a rigorous exercise program of walking or biking 10 miles three times a week when I started the treatments. I never really exercised before this. My doctor told me it would help alleviate some of that \"cancerhead\" and just general depression that I had following my diagnosis. And she was right. I have heard that several large breasted and heavy women tend to have horrible experiences with skin reactions but my oncologist told me only 10% of all patients receiving radiation for breast cancer experience side effects. Regardless, if someone does have side effects she told me they can be quite debilitating...but for anyone reading this who may be nervous (and you must be crazy if you aren't nervous!!) just know that many women get through this okay. I am responding to your message that is almost two years old.  I think I have been diagnosed with something either identical or similar to your cancer.  I m 65 years old and my breast are still large (38DD).  I had a milk duct removed from the left breast 4 years ago, no bad cells.  I had a milk duct removed a few days ago from my right breast and was diagnosed with Stage 0 \"in-situ\" milk duct carcinoma.  The doctor has suggested a lumpectomy and 5-6 weeks of radiation.  No lymph nodes will be removed and no chemo will be done.  I was told that the radiation treatment takes about 10 minutes and the worst sympton would be fatigue and a bad sunburn appearance that may peel since I have fair sensitive skin. Are you familiar with anti-fungal treatments and do you beleive that cancer is a fungus?  I do.  I am willing to following an anti-fungal diet the rest of my life but I don't think I should just assume that I can afford to ignore the fact that I may be currently growing a deadly fungus in my milk ducts that may not stay contained until all the fungus is dead with just diet alone. Any opinions?  Thanks for your input. Have you have any recurrence of your problem?  If so what are you doing about it?",
      "MessageIndex": 14,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "  On 1/4/2008 TimJay wrote: My Mother was diagnosed with Stage 4 yesterday afternoon. It has already spread many places, including lungs, pelvic region, and bones. The prognosis offered was grim. What can I do/say to best help her emotionally/spiritually after the initial shock wears off and she is ready to begin discussing/dealing with it? And if she chooses to completely ignore it (which she may well do), am I to respect that as her choice? Or does my duty lay in encouraging her to fight? Needless to say it is understandable that your Mom wants to maintain her quality of life and chemo is not always the way to do it. Go to the \"Know the Cause\" web-site and if you don't beleive that cancer is a fungus then maybe this will help you understand the possiblity that this is true.  There are a lot of anti-fungal drugs available, lipitor is commonly known and used by most doctors.  There is also an anti-fungal chemo drug availalbe.  My husband had blastomycosis 35 years ago when surgery was done it was confirmed that this was growing on all of his major organs.  He was given an IV every day for three months with an anti-fungal drug.  He will be 67 this year and is as healthy as a 45 year old. Even if your Mom just chooses to follow the Phase One diet she will have a shot at stopping new fungus growth and hopefully kill off enough of the current fungus fast enought to give her many more years. Give your Mom information so she can make an informed choice.  Respect her choice.  No one wants to die but no one should fear death. Remember that God is still in the business of miracles. ",
      "MessageIndex": 4,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19379,0.htm",
      "Title": "What can I do?"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "  On 1/26/2008 concernedhusband wrote: my baby and i have had a long a very difficult journey through the process of overcoming the many hurdles we faced in life. she got breast cancer at a very young age and we had to struggle very hard, but with love care and good treatment she recovered. but a year after recovery (still on medication) she had been falling sick alot. and i know quite alot about breast cancer but some happenings have started to scare me. for example she just got the flu and shes been getting a bloody discharge from her nipples. this used to happen in the begining and now that it happened again i am so scared! we might have to go back to london for some tests but i dont want her to go through all that again! someone please tell me its normal! i am so upset, im so worried.. help me! This is not normal.  Any discharge, clear or bloody needs to be checked.  There is probably something wrong with the milk ducts.  Most of the time it is completly contained in the milk ducts.  The doctor may perform a ductal lavage to see if they can wash out some of the milk ducts and send it to the lab.  It may require that the milk ducts be removed and sent to the lab.  This kind of surgery is very minor and does not disfigure the breast, the incision is done on the edge of the nipple, 2-3 inches and you will hardly notice when healed.  The lab will determine if there is a presence of abnormal cells.  In most cases there are no abnormal cells but it is best to have this check immediately. Your doctor will give you some options.  If your daughter already had radiation on a breast she probably will not be able to have this again.  If the diagnosis is DCIS \"in-situ\" Stage 0 that means that the bad cells were contained in the milk duct that has already been removed. Read, educate yourself about the diagnois before you make any decision about treatment. God Bless!",
      "MessageIndex": 2,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20338,0.htm",
      "Title": "please reply someone! urgent!"
    },
    {
      "AuthorID": "Cajun",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cajun",
      "Content": "Don't assume that all cancer in the breast will be detected with self exam or doctor exam or mammogram.  I had all of this done and my most recent mammogram done in December showed nothing.  Since I was having symptoms of a dark bloody discharge the doctor removed the infected milk duct.  I have been diagnosed with Stage 0 'in-sitsu\" duct carcinoma.  Suggested treatment will be a lumpectomy and radiation.  No lymph nodes are affected and no chemo will be used. The doctor said this should have shown up on the mammogram, since it did not I recently had an MRI. If you have large, thick, lumpy breasts that are difficult to compress for an accurate mammogram do noit hesitate to ask your doctor for an MRI for a closer look. Also look into information concerning \"cancer is a fungus\", it may save your life.",
      "MessageIndex": 0,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19923,0.htm",
      "Title": "Mammograms"
    }
  ]
}