{
  "AuthorID": "callie929",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/callie929",
  "Posts": [{
    "AuthorID": "callie929",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/callie929",
    "Content": "hello at this point in my life I am struggling with cancer with my mother as well. She was diagnosed with stage 4 breast cancer in 1995; 9 days before her mother passed with metastatic breast cancer. So as you can see, we have been blessed to have my mother in our lives for so long. She was 49 when she was diagnosed and had a stem cell transplant chemo radiation radical mastectomy. I was 14 yrs old when she was diagnosed. I went into a state of depression/anxiety and drug problem. I tried to avoid the situation, I thought it was all going down just like my grandmother. So she was technically in remission for 11 years. In Oct. 2007, she noticed swelling in her ankles and went to the ER. Her cancer returned in her abdomen. There was never a tumor; when they opened up her abdomen there were \"tumor seeds.\" She was getting 18 lbs. of fluid drained from her belly almost weekly for 6 weeks. She had a partial hysterectomy. They left her uterus. Then when they were trying to give her \"chemo\" shots that would change hormonal levels....well they made her hemorrhage since they left the uterus so then she was getting 2-3 blood transfusions a week for awhile. So she was doing well for the past 2 years. She was taking oral chemo that gave her \"hand and foot syndrome\" which is like 2nd-3rd degree burns on hands and feet. So at Christmas time 2008, her left hip started hurting and she did not walk for a few weeks. We after CAT scans and MRIs that showed nothing, the bone scan showed tumor in the left femur. So valentines day 2009, she went for a total hip replacement plus~ is what the MD called it. She recovered wonderfully from this surgery and was walking again and had her beauty back. Now another set back has occured. On her 63rd birthday march 30th she had her gallbladder removed~ she had a stone the size of a golf ball in there!!! Amazing. So now this surgery has caused her a lot of pain and she said after all the surgeries she has had, this has been the worse. She had major infection and was started on antibiotics. I have been with her this weekend to keep an eye on her and to make sure that the infection is not worse and her becoming septic. She is a wonderful woman and strong fighter.It is soooo very hard to see one that you love go through one thing after another. And I am married and my husband is not being supportive at all. He does not understand why I have been staying the night over here to help my mother. Now that is messed up! I have cried for the past 3-4 days I am a mess. I feel I have no human being to turn to.. It was always my mother. Jesus Christ is my hope and savior that I turn to for my strength and healing and peace. It is a long long road. So, I send all my prayers to you and others who are struggling with this same issue. It is a struggle and battle for all involved. Continue to do your best to keep the faith, it is so hard yes I know. It is so hard to understand. It is soo easy to get angry and mad because of the situation, but remember keeping faith with comfort you. Believe in the things that you can not see. Pray for miracles for they do happen. My mother is a miracle her doctors have called her that. Spend as much time with your mother and have no regrets. My love and prayers to you ",
    "MessageIndex": 2,
    "PostDate": "06/04/2009",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34732,0.htm",
    "Title": "my mother has stage 4 breast cancer"
  }]
}