{
  "AuthorID": "calspatsula",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/calspatsula",
  "Posts": [{
    "AuthorID": "calspatsula",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/calspatsula",
    "Content": "On Jan 23, 2018 5:14 AM CindyOR wrote: Hello Everyone, I was diagnosed with stage 2 breast cancer 2 months ago. I will do my 4th round of chemotherapy this week. I have noticed the lump has shrunk quite a bit and would not be surprised if it goes away by this next round. I am planning to discuss with my doctor if we may decrease the rounds, she wanted to add another drug to my last 4 rounds but I don't think this is necessary. I know they want to get rid of it but I am worried about the long term damage. I also have been reading the posts on here about the side effects of radiation and surgery which is making me worried as well. All my doctors tell me is that there will be fatigue and a sunburn...I am not sure how much I need but they say lumpectomy and 4-6 weeks of radiation every day, it will be aimed directly at the tumor and not the whole breast. Any tips on how to make sure we aren't overdoing it and causing more harm than good? Almost 1 year cancer free from stage 3 tonsil cancer. Only had 2 chemotherapy rounds. 7 weeks radiation 5 days a week.  As for your post. I saw plenty of breast cancer patients. They usually just stated they had mild burning sensation. They did much better than me with radiation. If you get pain most Dr.s will prescribe pain pills. I was little concerned about using several months. Off of them now. My guess is radiation will directed at tumor, but will hit whole breast. Tips on overdoing it or causing more harm than good. No alternative than to do it. It works. gl",
    "MessageIndex": 3,
    "PostDate": "25/01/2018",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134733,0.htm",
    "Title": "Radiation and chemo amounts"
  }]
}