{
  "AuthorID": "cancerkeys",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
  "Posts": [
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Thanks to everyone who has replied. The info is very helpful. I am also battling stopping the arimadex completely. I wish I knew of some people who have done this long term but can't seem to find any info. I changed my diet to veggies, fruit, nuts and will do fresh local fish one day per week. I am stopping all processed foods. It is hard to do! Boy do I crave bread! I am going to try and fight the estrogen naturally. I see there is only a 4% better odds using arimadex. I have been on it one month and haven't been able to get out of bed for a week! My neck hurts so bad and I have a migraine headache from it! I want to do yoga but can't stand up. I am 5'9\" and 145 pounds so I don't have much body fat left to create estrogen. I think I need to check that book out :-)",
      "MessageIndex": 7,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Yes, there is a book but I forget the name? Oh, \"The Clean Gut\". I think that's what it's called? I read it a few months ago and I sort of did the 30 day cleanse thing. I didn't follow it strictly though but I did do the probiotics. I am currently one week out on another cleanse. This one claims that your body can have fungus or mold in it and it irritates your liver and it produces estrogen. I was exposed to mold in 2005 after hurricane Wilma so it's not that far fetched for me. I am not eating or drinking anything processed, no eggs, dairy, chicken, peanuts, pork or beef. There isn't that much left after that! It has been 7 days and I am craving a glass of wine and a quesadilla! (This also requires probiotics)",
      "MessageIndex": 14,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "So how long have you been off the Arimadex now? I have been off it for two days now and am panicking and think I will try it again. I went to a chiropractor and it is helping my neck pain....",
      "MessageIndex": 9,
      "PostDate": "06/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi, I had a hysterectomy and oopherectomy in January. I was on Tamoxifen for almost a year and I think that's what caused a cyst in my uterus, and my right ovary was as big as an orange! So, I cleaned house and got rid of everything. I am now a month and a half in to arimidex. It is post menopausal medication.  I got really bad neck aches and headaches about a month into it and got scared, but went to a chiropracter and it took care of the pains! Now I have to make sure I am taking the right supplements (calcium, magnesium and D3) to combat bone loss. Are they just recommending that you take it now after all of this time? Your body still makes estrogen after the ovaries are gone. it is just a different type. A way to combat estrogen is to make sure you are not over weight. Fat produces estrogen. So, if you can replace any fat with muscle, you will help yourself immensely! I know though. It is hard to work out when in pain. I just eat mostly fruits, nuts and vegetables to keep the weight down.  Make sure you are working with doctors. If you don't like yours, switch. Don't be afraid of second opinions. I am choosing to take the blockers. It's hard, but I have 4 years left........",
      "MessageIndex": 21,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi, I was wondering if there was anyone who thinks they may know how they got an estrogen receptive breast cancer. I've talked to several women, and they all think they know how they got it. I have a feeling too because I have no family history of it. Between the ages of 20 and 30 I went vegetarian and consumed mainly soy products. I thought I was doing good for myself. I ate veggie burgers, meatless chicken, tofu, edamame, soy sausages....etc. I ate them EVERY day! I know they say soy mimics estrogen so am thinking this may be what triggered my cells to go crazy. Some things I read says plant matter can't do that. I just feel in my gut that this is how I got it. After 30 I ate meat again. But as I try and find the source of the meat, most of it is grain fed.....most of that grain being soy! The chickens are fed grains....soy. The eggs from free range chickens are fed grains....soy! My lotions contain soy! Why does every darned thing I try to eat contain soy! I tried to do better and am left confused by food. Other women ER positive tell me they were on hormone replacement therapy and think that caused it. Another believes it was the hormones in her birth control pills. I am just curious if others have that \"feeling\" that they know what caused them to get this? I was 41 (2012) when I had a 3.5 cm tumor in my left breast. I opted for bi lateral mastectomy. My tumor was close to my chest wall but the surgeon got clean margines. I had 9 lymph nodes removed and 3 had cancer. I was stage 2 but borderline 3. I did 4 rounds of chemo and 36 radiation treatments. I was on tamoxifen for almost a year which made me have a hysterectomy and ovaries removed. I also was having problems with my vision. I couldn't focus my eyes. I switched to arimadex a month ago and hate it already. I have had neck pain and pain between my shoulder blades that has floored me and I can't do anything. My right foot also feels like it is broken. I am just wondering what and how others feel about food........",
      "MessageIndex": 0,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "My chiropractor just told me about a great documentary called Forks over Knives! I watched it on Netflix! Very informative! I am doing this!",
      "MessageIndex": 27,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am wondering why they thought it was the soy that was good for us and not the amounts of fish and raw fish that they eat? Or rice? They eat rice like every day. Maybe it soaks up toxins and carries them out of the body? I think it is a combination of things, not just one thing picked out. They also eat far more vegetables for more fiber. How often do we eat water chesnuts? I am not understanding why someone said soy. I ate it daily for almost every meal. I drank soy milk on occasion as well. I know I can't change what I DID do, but I can change what I WILL do! No more soy for me! (That I know of anyway. They hide it in everything!) I even had a hard time finding vitamins the other day with no soy. I think it just went over board and to feed animals we eat with it just worsens it (and eggs too). We have wild chickens on this island I live on. I am contemplating building a coop and leaving feed out so they will roost and leave some eggs without soy feed in them!",
      "MessageIndex": 25,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am glad you got through that day. Make sure you go to all of your appointments. Ask the doctor when it's ok to start lifting your arm. I babied mine and didn't realize I was doing it. I think when you get the drains out is when you start. I was lifting my arms, but not like a jumping jack. Also (after your surgeon says it's ok) I would lay on my back on the floor and clasp my fingers together behind my head and hold it as long as I could. I was yelled at by my surgeon that I was babying it and if I didn't show improvement by my next visit, he would put me on physical therapy. Well, when I heard physical therapy, I heard dollar signs. Dollars is not what I had at that time so I took vicodin and walked my hand up the wall crying and swearing the whole time! But, I did it! The next time when my surgeon walked in to the room, I was standing with my arm over my head leaning against the wall and said \"Hi.\" He laughed so much and couldn't believe I did it! When you go to the oncologist, make sure you have a good feeling about them and that they are attentive to your needs. If they are not, shop around. Get second opinions if you need to. I remember I felt very rushed but you do have time, especially because you have to heal before any chemo if you end up needing chemo. When it comes to decisions, it's up to you and you family to make the choices. I chose to be aggressive because I have an almost 3 year old son and it is my goal to see him grow up. Talk to many people to find out what they did and if they've had relapses. I know two ladies who refused chemo and did \"alternative\" methods. One had a mastecomy with no chemo and one had a lumpectomy, radiation and no chemo. Both had relapses years later. I know a few other women in treatment now but they are at the same stage as me for having chemo, so I don't know of any that had relapses after chemo. Maybe you could open another chat on here asking if anyone had chemo and relapse? I am sorry about your loss. I hope you are not thinking you are next. Try and keep the positive flowing and try to stay in this moment. You have to take it minute by minute, not day by day. The hardest part I found was telling family and friends. They get too far ahead in things and it makes it difficult to think or make decisions. Right when I told my sister I was diagnosed, she was already talking about wigs! I didn't even know if I needed chemo yet! So, I had to tell her to slow down and that I was sorry, but I couldn't be there to help her with her emotions about my sickness right now because I needed ALL of my energy to focus on getting well. People are going to want to help, but most don't know how to go about it. They will want you to read EVERY web page on miracle cancer sures and such and such. It is exhausting. No two canters are the same. No two treatments are the same. You may have to have your brother help you in this. I had my husband take and make all of the calls to update people. I told everyone \"Don't worry, I will be back.\"",
      "MessageIndex": 9,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77137,0.htm",
      "Title": "Mastectomy in two weeks, STUCK in anger??"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Apr 26, 2009 12:00 AM Ilaff wrote:   On 4/23/2009 Lindalou wrote: Hello, I'm visiting from the Thyroid Cancer message board and have a question. Did any of you find a lump that did not show up on mammogram or ultrasound but turned out to be malignant? I found a pea size lump 2 weeks ago and went to my gyno. He also felt it and sent me for a diagnostic mammogram with ultrasound. The tech, AND the radiologist could feel it but could see nothing on the ultrasound. I was relieved at first but now I'm wondering if I should still worry. My thyroid cancer was found as a fluke so I'm a little skeptical. Any advise is appreciated!   I was dignosed with stage 4 cancer one month after a clean mammogram.  The physical check  was cause enough for a breast MRI, an ultrasound and a needle biopsy.  If you have any doubts about anything go see your primary... Your doc knows how hard it is for us to believe we are well.  Your intuition will guide you.  Pay attention to any changes and report them to the docs.  I have survieved for 2 years and it has only been recently that I have let down a  enough to enjoy my life, rather than wonder about things that could be easily answered.  Sometimes, the answer arrives via intuition.  It truely is on a need to know basis.  YOU NEED TO KNOW!  As I look back to pre-cancer, my dog was very interested in that area where the tumor was located.   I found that to be an interesting.  YES, find the answer that satisfies you.  Good luck and Godspeed on those answers. Take care of yourself and be pro-active in your search for health. My dog made me go get a check up too! He began to follow me so closely that I would trip over him and then he kept trying to jump in my lap and jump on the bed with me (both things he has never done before). I remembered a story a co worker had told me that his dog began sleeping on his pillow. He then found out he had a brain tumor. So, that story made me pay attention to my dog and get that lump checked out! I thought it was my baby milk drying up and ignored it! I make sure to tell this story because my co worker telling me his story saved my life! (On a seperate note, my tumor showed up on my mammogram and ultra sound).",
      "MessageIndex": 60,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am so sorry to hear of your struggles. I am coming up on a year post radiation. I chose a bi lateral mastectomy in December of 2012. I was glad I did because the cancer had spread to 3 of my lymph nodes. Does it look good? Nope! Do I feel like a man at times? Yup! I was sad to say good bye to my body parts! I am sure any amputee goes through feelings of loss. It's like that feeling you have right after giving birth. The sadness that your baby is no longer in your body. Because of my radiation, I just found out I am not a good candidate for reconstruction. I will be this way forever. If you really think about it, life is not all about looks. I recently was mad about my boobs giving me cancer. Then I thought real hard about it and decided I should be thanful for them! They took the brunt of my cancer and gave up their lives for me! It is the BEST possible place to get cancer if you are going to get it! They can cut it out! They can't cut it our of your lungs or bones or blood! So look to the sky and say \"Thank you\". Thank the unniverse that you have it in a place where it can be dealt with. You could have been hit by a bus and not had today. But you were given today. So be thankful for all of these extra days you've been given. Stop thinking about what you DON'T have and be thanful for what you DO have. While you are in the middle of all of this, you will think this is how you will feel forever. It is painful but it does go away. And lift your arms when they tell you to! Lift them like you are doing a jumping jack! I pounded the vicodin and broke through scar tissue to get my arm up! Don't do that! Do it before the scar tissue creeps in! Keep your chin up. Be thankful that you have more time (no one has a guaranteed time here) and push your way through it like the boss that you are!",
      "MessageIndex": 7,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77137,0.htm",
      "Title": "Mastectomy in two weeks, STUCK in anger??"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am a mom who had chemo. I can tell you this is hard for your mom. It is difficult to give up the momness and let others take care of you. Number one is to make sure she is eating and not losing weight. I remember crying as I was stuffing food down my gullet because I was not hungry. Food is the way to getting better. Make sure it is food she can have. When under chemo, your immune system is low and you are open to infections. No deli meats and no fresh vegetables unless they have been previously frozen. Also make sure she has water ALL day. Ice cold water with lots of ice. Water tastes like metal when on chemo so it's hard to drink. I also had weird cravings. I ate lentil soup for breakfast lunch and dinner for weeks. I also ate a large tub of sour cream putting it on everything. I don't know what that was all about, but I went with it! I also had to add tons of salt and butter to everything because my taste buds were so bad. it is hard to ask for things when you are sick because you feel so helpless. Doing simple things like paying the bills (chemo brain makes you forget everything) to walking the dog, to doing dishes etc. helps. Emotionally, it is very easy to \"go to the dark side\" when having a life threatening illness. When you are in it, you feel like you will ALWAYS feel that sick and it will never get better. It is the biggest mind game ever played! I found that Lorazepam helped me through it. Takes the edge off depression. If you can get her to go outside as much as possible, that helps too. Even if it is only to take a nap in a lawn chair. cancer hates oxygen. Open the windows! When all of her chemo is done (about 3 weeks after chemo and if she has radiation, wait 3 weeks after radiation is done) you want to make sure she takes probiotics for a whole month to reseed her good bacteria in her intestines. No one ever told me that and I was glad I happened upon it accidentally. It helped me by leaps and bounds. So, here is some info from someone who had treatment who is also a mom. I also made a do's and don't's list. I will post that too. Your mom is going to go through very dark mental moments. It's part of the process. Tell her a cancer lady said she won't always feel that way! Dealing with no boobs and no hair, seeing an 80 year old man looking back at me in the mirror was tough! One year later, and no one can tell I ever had cancer! Are the aches and pains still there? Yes. Part of the process. But, it is WAY better! Good luck! If you have any direct questions, I will be glad to help if I can! Cancer Do’s and Don’ts 1.     Let’s just face it. It sucks. When you find out someone you know has cancer, just let them know that you know and understand that it sucks. Try not to cry when they tell you. When a person first finds out they have it, they are confused and scared. Don’t scare them more. 2.    If you have never been treated for cancer yourself, do not offer them advice on treatment that you heard about from your third cousin twice removed. If they have found out they have cancer, that means they are working with doctors already. 3.    Do not offer them ten million websites to look at or have them talk to someone you know of distantly that has the “Exact same thing!” No two cancers are the same, and no two treatments are the same. Treatment decisions are made by the person being treated and guided by professionals. Cancer is incredibly time consuming. A cancer patient’s life has just changed dramatically and they need time to get used to it. 4.    The best way to help a cancer patient is to throw money at them. Yes, many people have problems in life and go through financial difficulties. This is simply if you want to help. Even with health insurance, a cancer patient is not able to work full time or in some cases at all. With missed income, daily necessities are difficult. Times that by increased gasoline costs, having to get food on the road while being treated, co pays, deductibles and so on, it is a difficult journey to just get by. Gift cards to grocery stores and gas stations are fantastic ideas! 5.    When a cancer patient is going through treatment, they are not really themselves anymore. Give them space to explore and figure out what they are going through. Sometimes it’s hard to talk about it without crying, so email and texting may work out better for the time being. Don’t worry, they will be back when treatment is over. Remember that saying? “True friends can be separated by years but when they get back together, it is like a day was never missed.” 6.    Bald is only beautiful if you choose to be bald. When you don’t choose to be bald, it means it was taken from you. Listen, I know I look like crap. I am supposed to look like crap. It’s cancer treatment for crying out loud! There is no need to point out how one looks while receiving treatment. Just leave that one blank. Or, you can say “I bet you’ll never complain about a bad hair day when you get your hair back!” That is much funnierJ 7.    These are all of the things I wished I knew before I had cancer and my friends went through it. I apologize to them for not knowing.",
      "MessageIndex": 18,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77401,0.htm",
      "Title": "Coping with my moms chemo for breast cancer"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am a mom who had chemo. I can tell you this is hard for your mom. It is difficult to give up the momness and let others take care of you. Number one is to make sure she is eating and not losing weight. I remember crying as I was stuffing food down my gullet because I was not hungry. Food is the way to getting better. Make sure it is food she can have. When under chemo, your immune system is low and you are open to infections. No deli meats and no fresh vegetables unless they have been previously frozen. Also make sure she has water ALL day. Ice cold water with lots of ice. Water tastes like metal when on chemo so it's hard to drink. I also had weird cravings. I ate lentil soup for breakfast lunch and dinner for weeks. I also ate a large tub of sour cream putting it on everything. I don't know what that was all about, but I went with it! I also had to add tons of salt and butter to everything because my taste buds were so bad. it is hard to ask for things when you are sick because you feel so helpless. Doing simple things like paying the bills (chemo brain makes you forget everything) to walking the dog, to doing dishes etc. helps. Emotionally, it is very easy to \"go to the dark side\" when having a life threatening illness. When you are in it, you feel like you will ALWAYS feel that sick and it will never get better. It is the biggest mind game ever played! I found that Lorazepam helped me through it. Takes the edge off depression. If you can get her to go outside as much as possible, that helps too. Even if it is only to take a nap in a lawn chair. cancer hates oxygen. Open the windows! When all of her chemo is done (about 3 weeks after chemo and if she has radiation, wait 3 weeks after radiation is done) you want to make sure she takes probiotics for a whole month to reseed her good bacteria in her intestines. No one ever told me that and I was glad I happened upon it accidentally. It helped me by leaps and bounds. So, here is some info from someone who had treatment who is also a mom. I also made a do's and don't's list. I will post that too. Your mom is going to go through very dark mental moments. It's part of the process. Tell her a cancer lady said she won't always feel that way! Dealing with no boobs and no hair, seeing an 80 year old man looking back at me in the mirror was tough! One year later, and no one can tell I ever had cancer! Are the aches and pains still there? Yes. Part of the process. But, it is WAY better! Good luck! If you have any direct questions, I will be glad to help if I can! Cancer Do’s and Don’ts 1.     Let’s just face it. It sucks. When you find out someone you know has cancer, just let them know that you know and understand that it sucks. Try not to cry when they tell you. When a person first finds out they have it, they are confused and scared. Don’t scare them more. 2.    If you have never been treated for cancer yourself, do not offer them advice on treatment that you heard about from your third cousin twice removed. If they have found out they have cancer, that means they are working with doctors already. 3.    Do not offer them ten million websites to look at or have them talk to someone you know of distantly that has the “Exact same thing!” No two cancers are the same, and no two treatments are the same. Treatment decisions are made by the person being treated and guided by professionals. Cancer is incredibly time consuming. A cancer patient’s life has just changed dramatically and they need time to get used to it. 4.    The best way to help a cancer patient is to throw money at them. Yes, many people have problems in life and go through financial difficulties. This is simply if you want to help. Even with health insurance, a cancer patient is not able to work full time or in some cases at all. With missed income, daily necessities are difficult. Times that by increased gasoline costs, having to get food on the road while being treated, co pays, deductibles and so on, it is a difficult journey to just get by. Gift cards to grocery stores and gas stations are fantastic ideas! 5.    When a cancer patient is going through treatment, they are not really themselves anymore. Give them space to explore and figure out what they are going through. Sometimes it’s hard to talk about it without crying, so email and texting may work out better for the time being. Don’t worry, they will be back when treatment is over. Remember that saying? “True friends can be separated by years but when they get back together, it is like a day was never missed.” 6.    Bald is only beautiful if you choose to be bald. When you don’t choose to be bald, it means it was taken from you. Listen, I know I look like crap. I am supposed to look like crap. It’s cancer treatment for crying out loud! There is no need to point out how one looks while receiving treatment. Just leave that one blank. Or, you can say “I bet you’ll never complain about a bad hair day when you get your hair back!” That is much funnierJ 7.    These are all of the things I wished I knew before I had cancer and my friends went through it. I apologize to them for not knowing.",
      "MessageIndex": 11,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77401,0.htm",
      "Title": "Coping with my moms chemo for breast cancer"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi! I am a mom. Not sure if I qualify as young at 43? I have a young child though! He will be 3 in August. I am sorry to hear you have breast cancer. I am estrogen positive. I went through a bi lateral mastectomy in Dec of 2012. January 2013 started 4 rounds of chemo. Then went right in to radiation (36 rounds) which my 1 year anniversary is on the 10th! My son was 14 mos old when all of this started! Now I have hair, but Tamoxifen made me get a benign polyp in my uterus as well as thickening of the uteran wall and my right ovary was the size of an orange and my left one was the size of a golf ball! Just when I thought treatment was over, I had a complete hysterectomy and ovaries removed in Jan 2014! I feel like I have been recovering ever since! Now because I am officially post menopausal, I switched to Arimadex. Within one month of taking it, I am having severe neck and back pain to the point of not being able to function! I looked at a forum on here and saw that it did a lot of damage to a lot of people and am considering stopping the post cancer meds. I would love to talk to my oncologist about it, but the cancer center did not renew his contract and now there is no oncologist where I live! Anyway, I would love to hear where you are at in all of this. Keep on keeping on!",
      "MessageIndex": 1,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77413,0.htm",
      "Title": "Young Moms with breast cancer"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi. I had radiation a little over a year ago to my left breast (where my breast used to be). I had 36 rounds. Did they mention aquapur and silvadine. Not sure if I spelled them right? Immediately after you get radiation, you should put after sun aloe on it like you buy for sun burns. Do right at the office where you change your shirt. The aquapur can be bought at cvs. I think Eucerin makes it. It's about 18.00 for the large jar. I bought some men's plain white t shirts because they were cheap. I slathered the aquapur on at night and put the loose fitting mens shirt on to sleep in. Do not put anything on it before you go to radiation. Wash the area that gets radiated with plain water as gently and as best you can and pat dry. You do not want anything oily on your skin before radiation as this will intensify the burn. Silvadine has to be prescribed. It gets worse before it gets better. Right when the treatments stop, it starts to heal really fast. Try not to wear bras or anything that will rub on it. Try not to use soap on the area either as that will dry it out. You can also ask for a low dose anti depressant. It helped me to have the \"I don't care\" effect :-)",
      "MessageIndex": 1,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79231,0.htm",
      "Title": "Radiation side effects"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Jan 02, 2015 1:52 PM SpTeach wrote: Good Morning!  My wife was diagnosed with invasive ductal carcinoma in October of 2013, just when we thought things were going well, chemo was done, double mastectomy was done....all we had was reconstructive surgery and then the healing would begin.  At our appointment after surgery we were told she was HER2 positive and would need another year of infusions.  Just recently she has given up smoking, the Tamoxofin has kicked her into menopause and her emotions are raw.  We argued Christmas Day because once again we were doing all the traveling and no one came to our home.  I said it'always us why can't they come out here?  Well now she says her family sucks, she doesn't care and to hell with it crying off and on all day. I also said it would be nice if she appreciated what I try to do for her/us once in a while.  Just a simple Thank You.  Now she says she doesn't know what to do, I said she was fine and to just focus on herself.  I know I was wrong to bring it up, I became frustrated and spoke w/o thinking.  Now it's crying every day, yelling at me, I have prayed to God for an answer and will continue to do so.  Any suggestions will be greatly appreciated.  I never meant to hurt her feelings or to suggest any negativity.  I have failed my wife and see no avenue to change it. Thank You, Doug Bring her flowers. On another day, bring her a card that says nice things. Tell her you don't care what happens and that you just want your wife. With chemo are steroids. She could be roid raging. I did that and had no idea what was going on. I wanted to rip other drivers out of their car for cutting me off! It was horrible and I had no clue. It all felt real to me when it was happening. Your wife is dealing with the fact that she probably is not going to live as long as she thought she was going to. She looks in the mirror and someone else is looking back at her and she can't find herself. Her whole life just changed and was thrown upside down. Sure, your life changed too. But she knows once she passes, you will be able to live on and move on (This is what we think in our heads mind you). Part of her may be pushing you (and family) away so you get used to her not being around. People do nice things just to do nice things and not have to get attention for doing so. Saying you want a thank you once in a while means that you feel like you are going above and beyond what you WANT to be doing so it makes her feel like you don't WANT to be there for her and that her existence is a nuicense to you. Do not make her feel that way because she will not get better. Make her want to fight to be here. Don't make her feel like you are bothered by here presence and that you want her gone so you can move on. Flowers for no reason once in a while helps. Cards too. Ask her what you can do for her. I guarantee she has extreme fatigue and pain. Don't make her feel worse about it like it's her fault she got sick. Did you say for better or for worse when you got married? I have had every female part of me amputated, I can hardly walk or work anymore because of post cancer meds, and my husband makes me feel like a beautiful princess. He makes me feel like I am his world and he wants me here. I fight twice as hard because of it. It may help for you as well to find others in groups who are dealing with cancer spouses and talk with someone. Cancer is stressful for the entire family. My family has no idea what I am dealing with. Personally, I hope they never will know. Best of luck to you and I hope you can wait the emotions out. Don't take them personally. Try not to make suggestions to her either because that will trigger it worse. Just ask \"What can I do to help you? I don't know what to do.\"",
      "MessageIndex": 1,
      "PostDate": "02/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81838,0.htm",
      "Title": "Need Help"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Mar 05, 2015 3:45 PM GLCAC7485 wrote: THANK you for your encouraging message about relatives who were given an expected time to lose the fight against cancer, yet are still here!!  WONDERFUL!!!  I'm thankful for GOD's blessings on them!!!  I will, by GOD's grace, keep a positive attitude and do my best to enjoy every day.  I think one thing others don't realize who haven't had cancer is that they are susceptible to dying as one fighting cancer because on one is promised the next breath.  Enjoying our days is so very important!!  Thanks, again!!!  GOD bless your Aunt!!!   My friend's Mom was told back in 1996 that she only had 6 months to live. She just passed this past December! She was a fighter! Don't give up the positive attitude! Sometimes it's all we've got! It is so true that any of us could have passed by now form any reason. For some reason we got a wake up call. That wake up call has changed my life and each day is precious to me :-) Enjoy the right here and the right now! Live in the moment!",
      "MessageIndex": 13,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83188,0.htm",
      "Title": "Breast Cancer Mets to the Bones"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Did they do an ultrasound? If not, demand that you get one. I had the same thing happen 10 months after taking tamoxifen. It ended up that my uterus lining was thickening and that I had a polyp (luckily benign) and one of my ovaries was the size of a large orange and the other the size of a golf ball. Is your cancer estrogen positive? It can help fight your cancer by removing ovaries but just be warned there are side effects. After I had my operation they then put me on arimidex. After 10 months of that, I decided to take myself off both drugs due to the side effects. I of course am nervous about this and it wasn't an easy decision and I am not happy about the lack of choices I have in the matter. I am also doing a complete lifestyle change about educating myself about outside estrogen sources and eliminating them which is also not easy but i feel like it is my only defense. I stopped eating meat and dairy which was first and foremost and also removed all canned foods, processed foods, soy, flax, and plastics out of my life. I also switched any body soaps or lotions to paraben free as those also mimic estrogen. You need a strong liver and a strong intestines to help your body heal. So learn how to take care of them and that will help you. I have been studying this almost daily for 3 years so it is a process.....Nothing about cancer is easy.",
      "MessageIndex": 1,
      "PostDate": "16/05/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,84450,0.htm",
      "Title": "Taking tamoxifen after breast cancer"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am looking at the date and wondering if you found out your diagnosis yet? I hope the surgery went well. I hope you post when you can on how you are doing?",
      "MessageIndex": 20,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi, I am so sorry for your diagnosis. I like your question and am also interested to see if anyone has been \"cured\" through alternative means. I am stage 2 ER and PR positive. I went the chemo route. I had a bi lateral mastectomy Dec 3rd of 2012, 4 rounds of chemo starting in January ending in March and then had radiation 36 rounds until June 2013. I then was taking Tamoxifen until January of 2014 when it messed up my uterus and ovaries (so I had them all removed) and switched to Arimidex (estrogen blockers for my estrogen positive cancer). I don't regret my treatments. I believe they saved my life. I had involvement in 3 of my lymph nodes so know that cancer cells may have gotten loose in my body. At first I didn't look at food. I just wanted to get better and knew I had to eat food to get better. I ate everything. Chemo makes you want nothing, so I at high fat and high calorie foods just to get me through. Since the road to recovery, I searched high and low trying to figure out why I got cancer to begin with. I have no family history. Between the ages of 20 and 30, I was a self declared vegetarian. I thought soy would give me all of the protein I need. (For some reason people are obsessed with protein) (me included). I ate soy products for breakfast lunch and dinner. Now I know soy mimics estrogen. Sigh. I had too much estrogen and got a 3.5 cm tumor very close to my chest wall.  I can't say that is how I got cancer, but the more I researched food, the more soy I see. I am 43 now. I was diagnosed at 41.  I always tried to be healthy when it comes to food. I always eat salad and raw vegetables. Even my dentist says \"I don't know what you are doing, but keep on doing it. Your teeth have no build up.\" But after 30, I began to eat meat again. I also conitnued to eat soy. Tofu. Edamame. Veggie burgers. etc. The things I didn't know is that soy was in the meats I was eating. Anything grain fed is fed mostly soy beans. Chickens. Free range chickens are grain fed....mostly soy beans. The eggs which are organic were laid by hens that were fed a vegetarian diet.....mostly soy beans. I decided to read labels on everything. Everything from soup to canned tuna fish contains soy! The facial products, soy! Protein powders, soy! Everything has soy! I was eating all of this thinking I was being healthy! So now I am VERY careful about what I eat! No more processed foods! No more meat and no more dairy! I think your decision should be based on 2 things. One, go with your gut. Your gut is never wrong! Two, it all depends on how far along your cancer is. I think once it gets to tumor stage, you may need doctor involvement and western medicine to get you back to \"normal\" and then implement natural remedies to keep the cancer away. You will hear MANY stories how this thing or that \"cured\" cancer. What you don't normally hear with such  stories is what type of cancer cell the person had. What the person's name and age are. If they've had any western medicine at the same time as trying natural medicine or not. That it is the exact same cancer as you had (no two cancers are the same). If the person had a tumor or not. What stage cancer they had. Etc.  Please keep those questions in mind. I have heard everything under the sun cures cancer such as tumeric to pot oil (THC), to dandelion root tea, to a certain bark of a tree etc., etc.  Research everything. Ask questions. If you don't like what the doctors are telling you, go to another doctor. YOU are your best advocate. Take charge! Think things through. You are the only one who can make these decisions. Keep in mind that a doctor can only give you options. They cannot tell you that you SHOULD do this or that. My surgeon offered many suggestions. He then told me the number one breast cancer patient is a returning one. He couldn't tell me which option to take, but his face lit up when I said I should do bi lateral mastectomy. He said it was a very wise decision, but he wasn't allowed to tell me to choose that route. A doctor has seen many cancers and has also seen how they react to treatment. I had no experience with tumors and cancer. Who am I going to trust? Someone with experience, or someone with none? I did also go with my gut. Treatment sucked. I will not lie. But I am here. I am a mom to a 3 year old and I am thankful I can still be his mom! I am still here! Things still suck sometimes but I get better all the time. I work, am a mom and a wife. No matter which way you go, it's going to be difficult. Sometimes it kicks in that it's CANCER. But do not have a pity party! There are hundreds of thousands of us cancer people out there! You are not alone :-)",
      "MessageIndex": 2,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I just did chiropractic care for this! What an amazing difference it made! Also, make sure you are getting your calcium, vitamin D3 and magnesium to help against the bone loss. Also google oil pulling. I know, it sounds weird....",
      "MessageIndex": 3,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,75952,0.htm",
      "Title": "Back pain from anastrozole"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi. I was also looking for someone who was longer out who has done just natural treatments but can't find any. I can tall you the stories of me and a few of my cancer buddies.  I have estrogen positive cancer and was stage 2b. 3 of my lymph nodes had cancer in them. At the time of diagnosis, my son had just turned a year old and I wanted to be around for him. I was aggressive, because I do not want to do this again. I had a bi lateral mastectomy. I then had chemo and then had radiation. I will admit being bald with no breasts is no cake walk. But now I am 2 years out and have all of my hair back. I am also alive. I have been studying natural stuff and keeping estrogen out of my life. What I have learned is that you need 2 things in order for your body to fight for you. Your liver and your intestines. These 2 things are your biggest illness fighters. So, you need to make them healthy. Probiotics help your intestines. There are so many anti biotics in meat and dairy that it is killing our good bacteria. Don't think this can be done with yogurt. That only has one little probiotic and then you are cancelling it out because you are eating dairy which caused this. Get a good probiotic from the refrigerator section of your local health food store. Stop eating meat and dairy. Even organic meat and dairy are fed 85% soy. Soy mimics estrogen in the body. It will feed estrogen positive cancer. Cut out soy if she's eating that. I was a vegetarian and ate soy products for breakfast lunch and dinner from 20-30 and diagnosed with cancer at 40. I am convinced it was soy. Soy is in almost every product on our shelves and 85% of soy is GMO. It also mimics estogen in the body. Soy is in everything from ice cream to canned tuna fish, to cookies and crackers. I am sure one serving of soy is fine but when it is in every food, it is impossible to control.  Canned foods and plastic drink bottles have BPA in them and it mimics estrogen in the body. Cut those out. Parabens in shampoo, make up, lotions and soap mimic estrogen in the body. Buy those in paraben free. The supplements I take are copper, glutathione, D3, calcium, tumeric, magnesium, probiotic and sea kelp. No one has the answer but her. She has to make her own decision. It is a difficult one to make for each of us who have to make it. I feel better that I had chemo and radiation. I feel like I did all I can to make it not come back. One of my friends just did lumpectomy and radiation and had a recurrence 8 years later and she regretted not having chemo. She then opted to do bi lateral mastectomy and chemo. 3 weeks after chemo I ran a 5k race. I was slow but I never stopped. The post cancer dugs tamoxifen and arimidex are a little difficult but the alternative is worse. I do not like these drugs one bit but am trying to get past the 5 year mark with them. I have 2 years down. There are no guarantees in any choice. That's why the choice is so difficult. I have been trying to find a time schedule of how long it takes for these cells to die but was looking at it wrong. The cells are triggering wrong and you are trying to change the trigger (if that makes any sense). The diet takes time to get used to and doesn't happen over night. Research everything even if you hear about it on sites like these. I wish you all luck!",
      "MessageIndex": 1,
      "PostDate": "24/04/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,84076,0.htm",
      "Title": "Treatment: Conventioanl vs. Alternative"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Mar 05, 2015 10:20 AM suzyxz wrote: I'm glad carrot juice makes you feel better.  it may even help, nutrition-wise.  But if it cured cancer all by itself, the planet would be one big carrot field by now. Although I also agree with you, your liver is your number one immunity fighter. Vitamin A helps the liver. There could be a little something with this....",
      "MessageIndex": 7,
      "PostDate": "05/03/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83188,0.htm",
      "Title": "Breast Cancer Mets to the Bones"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "The hard part about hearing the words \"You have cancer\" is that it's different than if you simply dropped dead of a heart attack.  If you dropped dead, you wouldn't have all of this time to think about it. Hearing \"Cancer\" makes you peek around every corner. It's scary. You don't know when your time is up. I try and look at it this way. I was given today. I didn't just drop dead. I am here right now. I breathed today. I saw my son. We played. I told him I loved him. I did all of that because I GOT today! I didn't pass away already. Am I pain free? Nope. Do I feel great? Nope. Am I wondering when my time is up? Probably every second of every day. I am not religious but I am spiritual. When I wake up for another day, I look to the sky and give thanks. I got to have today.  Not everyone gets to have that. Happiness is a choice. I am going to rock out to that catchy tune in my car on my way to work. I am going to hug my son (who is almost 3) about a thousand times and tell him a thousand times that I love him simply because I can. I am going to and have been taking pictures of him with me even when I had no hair and even though I have dark circles under my eyes because I want him to remember who his Momma is. I woke up today and I got to have today. I am SOOOOOOOOOOOOOOOOOOOO thankful!! Cancer stinks but already having died from some other reason a long time ago would have sucked worse. Be thankful if you got to have today.",
      "MessageIndex": 35,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,75844,0.htm",
      "Title": "Best friend has stage 4 cancer - getting worse. I'm lost."
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi. I think using the word alternative \"cure\" isn't the right wording. Maybe alternative keeping cancer at bay? I am interested in which type of breast cancer your wife has? I have been studying our food in the US. I know they do not allow a lot of what we use in Europe. Is your wife's cancer estrogen positive? We have chemicals which mimic estrogen in the body in our plastics used to sell us food in. We also have gone crazy for the soy bean and it is added to everything we consume from cookies to canned tuna fish, to english muffins to ice cream. Soy also mimics estrogen and they tell us soy is safe \"in moderation\" but how can we moderate it if it is in everything we consume? All of our meat animals eat 85% soy beans. So do the cows that make dairy products. Then they also inject them with more estrogen to produce more milk. We go crazy over dairy products over here because protein has been pounded in to our brains as the most important thing our body needs. Advertising keeps giving us bling words like \"natural\", 100% juice\" and using names such as \"Healthy Choice\" which is a frozen dinner. Tell me how a manufactured frozen dinner is healthy? 100% juice does not mean organic and is full of pesticides. They slap the label natural and there are about ten ingredients you can't pronounce on it. It's all marketing. Just because it TASTES good doesn't mean it is good for you. Anyway, since your wife is almost done with treatment, you may want to have her get a 50 billion count probiotic because she pretty much just killed all of her good bacteria in her intestines. You need two things to help fight cancer. One is your liver, and the other is your intestines. So, if you take care of those, you will do much better. Going meat and dairy free and getting rid of processed foods is the best way to go.....",
      "MessageIndex": 1,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83482,0.htm",
      "Title": "Collecting experiences on alternatives"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I do believe that every person who has had cancer is afraid of recurrence. I was on Tamoxifen for almost a year (bi lateral mastectomy also) and had to have my uterus and ovaries removed because of the Tamoxifen. I've been on Arimadex for only 2 months. I do know when my 5 year span is up that I will throw a party and be happy to be off the meds! Just make sure you are eating clean and do not eat soy! If you eat meat, the meat is fed grains which are mostly soy. Chickens eat mostly soy. Even your organic free range hens eat soy and the eggs they lay are soy. Soy mimics estrogen. I also cannot believe how many processed foods also have soy in them. Read the labels. Soy lechithen etc.  I went meatless, dairy free and minimally processed foods a little over a month ago. I finally feel in my heart I am on the right path. Ya, I know. What about protein? That's what EVERYONE asks. There is plenty of protein in plants and nuts and beans. I just have to be creative. So far so good. Go with your gut. If your gut tells you to stay on it, the doctors can't say no. I wish you well. I am 2 years out since diagnosis.",
      "MessageIndex": 2,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77771,0.htm",
      "Title": "Discontinuing Arimidex after 5 years...anyone have fears of recurrence?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am so sorry for what a lot of you are going through. I remember at the time I was being diagnosed that I didn't know if it was all through my body or not. I had an incredible feeling of peace. I just knew that no matter what happened, everything was going to be ok. I watched a documentary today called Forks over Knives. VERY interesting and what I've felt all along considering I got cancer with no history in my family. It talks about our food in the United States. Anyway, there was a woman who had metasteses all through her spine and on other organs. She went to a plant based diet and all of her cancer went away! She is in her 70's doing triathalons! No meat, dairy or peanuts! They didn't mention the peanuts in the documentary but they are covered in a very toxic mold or fungus and should be avoided when your body's defenses are down. If anyone has time to watch this, it's on Netflix. I am going to do this as my cancer was in 3 lymph nodes. I wish you all the best of luck. Keep posting when you need to. It is not an easy disease. ",
      "MessageIndex": 17,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,75844,0.htm",
      "Title": "Best friend has stage 4 cancer - getting worse. I'm lost."
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Yes. Diary means cheese and yogurt too. There is a protein in cow's milk called caesin. The human body has a difficult time trying to digest it. While the body tries to break down this foreign substance, it leaves it open to illness. The reason why it is so dangerous is because it is in so many products and people tend to eat 3-5 servings per day without thinking about it. That leaves \"in moderation\" out the window. If you start the day with butter on toast, there is one serving of dairy. Then, you put creamer in your coffee (or milk in your tea) and that is 2 servings you've already had and breakfast isn't even over yet. Then, you put milk in cereal and that meakes 3 servings already. Then move on to lunch and have a sandwich with cheese in it. That makes 4 servings. Then at dinner, you have pizza. no one eats just one slice so there is about 2 to 3 more servings of dairy. When I tell people they need to cut out dairy, they say \"I don't drink milk anyway.\" But they eat cheese, yogurt, butter, coffee creamer etc. and then consider themselves to be dairy free. Thank you marketing..... The probiotics can be found in a refrigerated section at a health food store. They are capsules and they have different counts of how many live cultures are in them. When I mention probiotics, people usually reply that they get them in yogurt. Yogurt has acidophilis and that is it. Your body has billions of different ones. So, thank you again marketing firm for making people think they are being healthy by eating dairy....sigh. They do have up to a 90 billion count. The higher the count, the higher the price. Here a 30 day supply of 50 billion count is about 35 dollars. So check out your local health food store and see what they offer for intestine and liver support. You are so lucky to have access to a farm! I live on an island so I grow my food in planter boxes. I have deer and iguanas that compete for my food. If you can get hormone free food that wasn't raised on grain, you are ahead of the pack! Also wild caught (NO TO FARM RAISED FISH!) fish is good too. I am glad you are getting research for your wife. It shows how much you want to keep her around :-)",
      "MessageIndex": 3,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83482,0.htm",
      "Title": "Collecting experiences on alternatives"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi, I am so sorry for what you are going through! Have you talked to your doctors about this? I had horrible pain when I did radiation too. We discovered that it was because I had scar tissue and did not get my range of motion before I did radiation, so the act of clasping my hands behind my head for the length of time of the radiation treatments were the cause of my pain. You can try clasping your fingers behind your head while laying on the floor at home and hold it for as long as you can as many times as you can throughout a day. How many more rounds of rads do you have left? I had 36. I also had to be put on a low dose of Lorazepam anti depressant to get me through the rest of the treatments. All of this treatment is mentally disturbing. Panic doesn't help. (I had one moment where I jumped off the radiation table and screamed at them telling them they were trying to kill me). This too shall pass. It always feels like \"forever\" when going through this crap. Yesterday was my one year anniversary of the end of my radiation treatments. It is a sigh of relief. Do I still have pain? A little. Nothing like when I was going through radiation! All of these treatments are counterintuitive. Your body and mind will want to fight them. My tumor was close to the chest wall as well and I had 3 positive nodes. Stick out the last of your treatments because they are the booster ones which will treat your chest wall. You can do this! I know you don't want to do this, but you can do this!",
      "MessageIndex": 1,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77660,0.htm",
      "Title": "unbearable pain"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Oh my gosh! That sounds horrible! The doctors don't tell you what's needed? Maybe chiropractic? Maybe acupunture? Massage?",
      "MessageIndex": 3,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77660,0.htm",
      "Title": "unbearable pain"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I read more on the baking soda and it appears to work on cells under a microscope. Unfortunately, it has to go through your digestive track and gets \"watered\" down on the way. I am not sure if that would be a cure. As of now, there is no cure. Just slowing it down. I have a friend who tried natural ways after a lumpectomy and it came back 8 years later. She then decided double mastectomy and chemo. I myself have done chemo and radiation. I had estrogen positive BC and had lymph node involvement. I chose to be aggressive. I also chose what seems to be working and not just an article that never has names or faces on them that it has actually worked (and also will sell you a miracle product at a healthy cost). Cancer is no joke. Definitely do research and take your time with your decision. Maybe even look in to alternative treatments from doctors that have proof they work. I was always a healthy eater, excercised and did all of the things right and still got cancer. It's a tricky little bugger! I hate it. I hate the treatments. They are rough to go through but they are doable. I am one year out. so far, still kicking.....",
      "MessageIndex": 2,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77772,0.htm",
      "Title": "Wife with breast cancer, desperate to try any \"natural\" drugs"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi, Have you done a round of probiotics? Chemo kills bad cells, but also kills good ones including your good bacteria in your intestines. If you haven't, go the a health food store and get the refrigerated ones with like a 50 billion count. They are around 35.00. Also, while you reseed your gut, it is best to cut out irritants while you do so. Irritants are processed foods (pasta, chips etc) and cut out all meat, eggs and peanuts except for fish (stay away from farmed fish or fish imported from Taiwan or china). Oh, and avoid dairy too. They usually require one month but sometimes that's hard to do. When you do this, your body will be dumping toxins out so you may get cold or flu like symptoms. No medical professional told me this. I had to look it up. I am one year out of chemo. Also, are you on tamoxifen? If so, go see your gynecologist. The pains may also be your uterus or ovaries. They can do an ultrsound and rule that out.",
      "MessageIndex": 1,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77757,0.htm",
      "Title": "Illnesses after chemotherapy?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi. I had chemo, bi lateral mastectomies, and 36 rounds of radiation. The radiation left me no possible way for reconstruction :-(  I had cancer in 3 lymph nodes so am not regretting my choices.  You need to get your liver healthy again. Avoid dairy and animal fats. This will help you if you are estrogen positive as well because most animals are fed 85% soybeans (which mimic estrogen in the body). So if you are eating meat and dairy, you are also taxing your liver. \"Food\" can do just as much damage as drinking when it comes to the liver. Look up all you can on line. Livers can regenterate. It's not easy. I have been meat and dairy free for about 6 months now. I only eat occasional locally caught fish, occasionally eggs and most of my diet is from raw veggies, nuts, fruits and veggie (soy and whey free) protein powder. I actually went through detox when I started! You can cut back gradually do you don't have withdrawel. Eat as many organic things as you can afford.  Remember all of the things that are dairy. Butter, sour cream, coffee creamer, milk, cheese, yogurt....They all cause inflammation in the body. Get your body to protect you not fight against what you are eating. The doctors won't tell you this because they are not dieticians. You need to do research and help yourself. I signed up at the library and learned a whole lot of new things!",
      "MessageIndex": 12,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78054,0.htm",
      "Title": "Liver damage after having radiation for breast cancer"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I totally agree with you. I do have belief in combining things that seem to work. I had chemo and believe that once there is a tumor present, you need to get rid of it before any of these things will work. I have basically done this diet for 2 weeks. Still working on tweaking it. I get all of the organics I can (I live on an island and don't always have choice). It does say no oil. I know it's processed, but I use olive oil and hemp oil. I also eat seeds except for peanuts. Chia and flax. I think I got cancer from eating soy products. I ate it pretty much every day from 20-30. That is most likely GMO and very processed! ",
      "MessageIndex": 11,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77772,0.htm",
      "Title": "Wife with breast cancer, desperate to try any \"natural\" drugs"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I was just told to watch a documentary called Forks over Knives. You should watch it! Very interesting! I saw it on netfilx. Very helpful.",
      "MessageIndex": 9,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77772,0.htm",
      "Title": "Wife with breast cancer, desperate to try any \"natural\" drugs"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Apr 02, 2015 4:07 PM lipenn wrote: My twin sister just completed radiation therapy for breast cancer.  After the radiation was completed the area under her arm turned black (we are African American).  I’ve read the skin should heal 100% in time with no scaring or discoloration. Is this the case for women of color also? Is there anything that can be done to help the healing process? Sesame seed oil helps heal it if her skin is not torn. I had radiation 2 years ago and I can still see a clear line of darker skin where I had the radiation. It is like a section almost like I have a patch of darker skin but I have pale white skin. My skin broke open like big blistering type of burns. Straight aloe vera is helpful and they also sell aloe vera juice you can drink to heal from the inside out. Also eating organic cherries if you can find them or organic cherry juice. Good luck to your sister! ",
      "MessageIndex": 2,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83695,0.htm",
      "Title": "Darken skin after radiation treatment"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I totally agree with you. I do have belief in combining things that seem to work. I had chemo and believe that once there is a tumor present, you need to get rid of it before any of these things will work. I have basically done this diet for 2 weeks. Still working on tweaking it. I get all of the organics I can (I live on an island and don't always have choice). It does say no oil. I know it's processed, but I use olive oil and hemp oil. I also eat seeds except for peanuts. Chia and flax. I think I got cancer from eating soy products. I ate it pretty much every day from 20-30. That is most likely GMO and very processed! ",
      "MessageIndex": 15,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77772,0.htm",
      "Title": "Wife with breast cancer, desperate to try any \"natural\" drugs"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "You should always go with what your gut tells you. Have they done an ultra sound? You may want to try calling an ultra sound diagnostic center and have that done. That gives them more of a clear image. I wish I had listened to my gut. When I was 37 I remember telling my doctor I felt like something was wrong because I was exhausted all of the time. They checked my blood work for things like thyroid and progesterone and that sort of thing. Nothing showed to be abnormal. I remember her saying \"Well, it's probably because you are getting older and you have more stress going on.\" I was trying to have a baby and not getting pregnant. I said ok to what she said, but remember leaving the office like something was wrong. I didn't like her answer. I should have gone somewhere else until I DID find the answer! I had no family history of cancer. At 41, I had a stage two breast cancer and it had spread to my lymph nodes (3). They said judging by the size of my tumor, it probably was there since I was about 36. I should have listened to my gut. I found out later the word I should have used was fatigued and not tired. Fatigued is when you still feel exhausted even after you've rested and slept. I didn't use the right word I guess. I never would have thought to do a mammogram. I never thought I would have cancer. Go with the gut and don't let them bully you!",
      "MessageIndex": 1,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77549,0.htm",
      "Title": "do I wait 6 months for another mammogram"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Hi. I don't have triple negative but am er and pr positive. All I know is that I chose to be aggressive with my treatment. I faced it head on and told the cancer it is not allowed in my life! I had a bi lateral mastectomy with no reconstruction. I then had 4 rounds of chemo and then 36 rounds of radiation. It is not easy to choose and it's not easy to go through. But on that note, it is doable with lots of fight and a good mindset. 3 weeks after my chemo, I ran a 5k race. I never stopped! 3 weeks after my radiation, I ran another 5k race! Almost a year later I had to have a hysterectomy and my ovaries removed (thank you Tamoxifen....not). 10 weeks after that surgery I ran a 7 mile bridge run. Cancer treatment is the biggest mind game you will ever play. It is a choice to be strong and happy, or to be depressed and say \"why me\" all the time.  It's a choice. I chose to be strong. It doesn't mean I didn't hurt or wasn't sick because I was. It just means that I decide I am going to make jokes and laugh and not worry so much about the future that it stops me from living today. I woke up today. I got to have today. So many others didn't get to have today. I did. I am going to love it! I was stage 2. I spoke with a triple negative survivor just 2 days ago. I asked her how she was feeling. She had chemo and radiation ELEVEN years ago and looks fantastic! She was 49. Her advice was to see a breast cancer specialist. If you don't like what your doctor is saying or you are uncomfortable, go to another doctor or center. Go with your gut. You will see on here a lot of fear of chemo and people calling it poison. I on the other hand feel like it saved my life. Yes, my immune system was compromised during treatment. I knew this going in to it. I went in public as little as possible so I didn't get sick. I ate foods which wouldn't cause a bacterial infection such as deli meats, raw fruits and vegetables and under cooked meats. You need to take care of yourself while getting treatment. Your doctors must know any supplements you are taking. Ask as many questions as possible. Go with your gut but also be informed :-)",
      "MessageIndex": 3,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78325,0.htm",
      "Title": "Breast Cancer Treatments"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "It is a personal decision. Did they let you know which kind of cancer? Some are more agressive than others. You may want to look in to laser therapy as well. Less invasive. I had bi lateral mastectomy because my surgeon told me the number one breast cancer patient is a returning one. It all goes so fast though so try to take a breath and think about each option. Because of my chemo and radiation, I am not a candidate for reconstructive surgery, so I will be breastless on both sides for the rest of my life. So take a look in to laser. There are supposed to be clearer margines when using this method, but I have not had this done, so it's better to talk to a professional about it. Get a second opinion if you need to. You actually have more time before treatment than you think. I felt I was rushed.......",
      "MessageIndex": 4,
      "PostDate": "16/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76959,0.htm",
      "Title": "decisions"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I just wanted to mention I had bi lateral mastectomy in 2012, chemo, radiation and Tamoxifen. Almost a year later had to have a hysterectomy and oophorectomy. I am now on Arimadex since I have surgically gone through menopause. I beleive the treatment saved my life. You need to be careful when on chemo as your immune system is low. YOU MUST TAKE CARE OF YOURSELF DURING CHEMO! No one else can do that for you! You need to stay out of public areas prone to colds and flus. You need to be careful of what you eat because deli meats and fresh fruits and vegetables have bacteria on them that can kill you when your immune system is low. I keep reading replies from people saying chemo killed someone they know. We don't know if that someone followed the rules and took care of themselves. My son was 14 months old when I had chemo. We didn't take him anywhere. He did not go to day care. We knew it might kill me! You can also help protect yourself from cancer causing things like the foods you eat. I am now meat and dairy free after I educated myself on what is going on in the food industry. Is it all easy? Heck no! Is it worth it? Heck yes! Cancer can strike anyone at any time. Don't be a victim! Stand up for yourself! Accept what is and deal with it! Do not go to what used to be or what the future will be! You were given the gift or right here and right now! Take advantage of it! Take care of yourself! You can do anything! I am stage 2 estrogen positive and 3 lymph nodes had cancer in them. Mine travelled. I don't care because I am going to starve it! It is not allowed to form another tumor in my body! Go get em ladies! You are not victims! You are Sistah Warriors!!",
      "MessageIndex": 35,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 28, 2014 7:09 PM rpoole1962 wrote: On Dec 28, 2014 6:07 PM davezuro wrote: @ Robin & Sandylee; Both of you need to start taking LunaRich X - the pure bio-active form of Lunasin.  It will help improve your qulity of life tremendously. What exactly is it and where do you get it?? It is soy based. Soy mimics estrogen and you are on estrogen blockers. It doesn't sound like a good idea to add more estrogen to the fire...........",
      "MessageIndex": 52,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 30, 2014 1:51 PM davezuro wrote: Lunasin DOES NOT contain any soy.  That info was mentioned several times by Dr. Galvez.  Here's his response: There have been requests to repost my personal view and the link to an article on the safety of soy ... Several people have asked for my own view on whether soy is safe or not. Here's my response as a scientist: There is a fundamental difference between the training of physicians and scientists. Physicians are trained to be decisive, even in the face of incomplete information. Scientists are trained to be skeptical, even in the face of (apparently) overwhelming data. To drive home this point, let me use as an example the effect of soy consumption on breast cancer. In the early 2000s, Dr. William Helferich, a nutrition scientist at the University of Illinois, published a series of papers on the effect of genistein, a phytoestrogen found in soy, on promoting the growth of human breast cancer cells in mice (whose ovaries where removed to get rid of endogenous estrogen). His research was sensationalized by the media, and to this day, has been used by anti-soy proponents as an example of the \"dangers of soy\" and by physicians to recommend to their patients NOT to consume soy. Dr. Helferich, being a scientist, knows that the relationship between soy and breast cancer is much more complex than what his initial research has suggested. He did more research and in 2010 published with other scientists a review article on this subject: Is soy consumption good or bad to the breast? (you can read the whole article in link). Portion of their abstract states, \"Results suggest that women consuming moderate amounts of soy throughout their life have lower breast cancer risk than women who do not consume soy .... Findings obtained in 2 recent human studies show that a moderate consumption of diet containing this isoflavone (genistein), does not increase the risk of breast cancer recurrence in Western women, and Asian breast cancer survivors exhibit better prognosis\". And in direct correlation with my work on lunasin, they further conclude, \"We propose that the reduction in (breast cancer) risk involves epigenetic changes that result in alterations in the expression of genes that regulate mammary epithelial cell fate, i.e. cell proliferation and differentiation\". http://jn.nutrition.org/content/140/12/2326S.long \"\" target=\"_blank\" rel=\"nofollow\">http://jn.nutrition.org/content/140/12/2326S.long \" target=\"_blank\" rel=\"nofollow\">http://jn.nutrition.org/content/140/12/2326S.long A little bit of soy may be ok, but these days soy is in EVERYTHING. Almost all live stock consumes about 85% soy beans. That means when you eat meat, you are eating soy. Even organic meat. Almost all soy (except organic) is genetically modified. When you eat eggs you are eating soy because the hens are fed soy. Did you know soy is in canned tuna fish? Chips? Cookies? Lotions? Makeup? Milk? Cheese? Yogurt? Butter? I was a vegetarian from the age of 20 to 30. I ate soy daily at almost every meal. I was never on birth control to add any hormones. I have 2 sisters. I am the only one in my family who got estrogen positive breast cancer and I had it at age 40. I am 100% convinced it was my own consumption of soy. I have gone meat and dairy free and only eat local wild caught sea food occasionally. You have to know what you are eating and putting in to your body. I know what you are all going to day. \"What about protein?\" Everyone says that to me. What about magnesium? Most people are magnesium deficient but no one is ever worried about it. They are worried about protein because it is what is advertised as important. A woman my age only need 43 grams of protein per day. It goes down as I get older. I easily obtain that each day with no meat and dairy.....",
      "MessageIndex": 54,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 31, 2014 3:30 PM davezuro wrote: Oncologists make 60% of their income from the drug treatments they prescribe.  (And everyone accepts that!)  My company invested $$millions to develop lunasin,which has been proven to work, but are we suppose to give it away?   You're asking for an alternative, yes you're scared, but reject what is out there - without knowing anything about it.  Because doctors don't know about it doesn't mean it doesn't work.  Again, go to www.pubmed.com \"\" target=\"_blank\" rel=\"nofollow\">http://www.pubmed.com \" target=\"_blank\" rel=\"nofollow\">www.pubmed.com and type in the search bar \"cancer and  lunasin\".  Over 50 studies are posted how this helps.  Doctors can't make $$ from lunasin because we own the rights to it - so they won't endorse it.   Surviving cancer beyond 7 years after initial diagnosis is very rare.  Those that do survive are in the minority and did so by changing their diet, becoming alkaline, avoiding sugar, exercise regularly and make good lifestyle choices.  Drs don't make $$ telling patients to alkaline their bodies and changing their diets, - they do it by prescribing allopathic treatments. Almost all drugs are synthetic - not natural.  If you know any acturial scientists, ask them about what we're talking about.  I know 3 life insurance salesmen,who all work for different companies, and they all said that this is true what the acturials have researched. I want to help people -this may not be the right place to do it, however, if you're looking for more than what you're getting right now , what is it you want?  How can I help you? You can help by stopping with the spam! This is a site for people WITH CANCER to help each other out! We don't need sales people causing us more confusion! Let me make a list of other items people also tried to sell..... Dandelion root tea THC oil Asparagus puree A magic mushroom Curcumin A vegetable pill Etc., etc.......... Also, stop using scare tactics in saying we will all die within 7 years! That is not true and it is NOT rare that we will live longer! I know about 20 women personally, all whom I talk to that are REAL people who are alive and have been for 20 plus years after diagnosis and treatment! Even stage 4! Do not tell me I personally know all of the rare cases and there are no others! You are insulting and you need to leave this page! Take your snake oil elsewhere! None of us have any money anymore to pay for your snake oil anyways!",
      "MessageIndex": 65,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 30, 2014 4:31 PM davezuro wrote: Lunasin is a peptide derived from the soybean.  It's properties are not risky to breast cancer patients.  It is not a drug  - it's natural and we own the \"exclusive rights\" to it. Go to www.pubmed.com \"\" target=\"_blank\" rel=\"nofollow\">http://www.pubmed.com \" target=\"_blank\" rel=\"nofollow\">www.pubmed.com .  (this is the gov't monitored website where medical research is published)  On the search bar type in the words 'cancer and lunasin\".  Over 50 studies are published - including breast cancer. If you don't think this is worth it - think again about the success rate of allopathic treatments.  Surgery (Mastectomies) chemo; radiation; etc...  There is over an 80% failure rate for patients diagnosed 7 yrs or less.  By the year 2020 1 in 2 women will experience a cancer diagnosis sometime in their lifetime.  (Breast cancer being #1).  This info was supplied by actuarial sciences used by insurance companies.   Become educated about this - not opinionated!  I've helped tons of women.  Don't listen to me - listen to them! Epigenetics!  Turn the bad genes off and turn the good genes on!   Most of the soy studies are basing their findings on comparing American women to Japanese women stating that Japanese women consume large amounts of soy and are 24% less likely to become diagnosed with estrogen receptive breast cancer before menopause. I do not believe this is a fair comparison due to the fact that American women have a completely different way of eating. Japanese women consume large amounts of raw fish as well so why are raw fish tablets not being sold as a cancer cure due to the 24% less cancer rule? They are not basing this study on the amount of soy Americans consume unwittingly. There is soy in almost everything we eat because everything packaged needs the least expensive \"filler\" they can find which happens to be soy beans. \"The benefits: Women who consumed fish oil supplements had a 32 percent lower risk of developing breast cancer after six years compared to non-users, according to a study from the journal Cancer Epidemiology, Biomarkers & Prevention. Fatty fish contains omega-3 fatty acids, which may decrease inflammation in the body. Researchers believe chronic inflammation may encourage breast cancer development. Reap the rewards: Although women in the above study took supplements, researchers recommend getting omega-3s directly from fish. Chomp at least two 3.5-ounce servings of fatty fish like salmon, tuna and mackerel each week. \" Just avoid any canned fish as canned fish also has soy in it.........",
      "MessageIndex": 58,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 30, 2014 1:51 PM davezuro wrote: Lunasin DOES NOT contain any soy.  That info was mentioned several times by Dr. Galvez.  Here's his response: There have been requests to repost my personal view and the link to an article on the safety of soy ... Several people have asked for my own view on whether soy is safe or not. Here's my response as a scientist: There is a fundamental difference between the training of physicians and scientists. Physicians are trained to be decisive, even in the face of incomplete information. Scientists are trained to be skeptical, even in the face of (apparently) overwhelming data. To drive home this point, let me use as an example the effect of soy consumption on breast cancer. In the early 2000s, Dr. William Helferich, a nutrition scientist at the University of Illinois, published a series of papers on the effect of genistein, a phytoestrogen found in soy, on promoting the growth of human breast cancer cells in mice (whose ovaries where removed to get rid of endogenous estrogen). His research was sensationalized by the media, and to this day, has been used by anti-soy proponents as an example of the \"dangers of soy\" and by physicians to recommend to their patients NOT to consume soy. Dr. Helferich, being a scientist, knows that the relationship between soy and breast cancer is much more complex than what his initial research has suggested. He did more research and in 2010 published with other scientists a review article on this subject: Is soy consumption good or bad to the breast? (you can read the whole article in link). Portion of their abstract states, \"Results suggest that women consuming moderate amounts of soy throughout their life have lower breast cancer risk than women who do not consume soy .... Findings obtained in 2 recent human studies show that a moderate consumption of diet containing this isoflavone (genistein), does not increase the risk of breast cancer recurrence in Western women, and Asian breast cancer survivors exhibit better prognosis\". And in direct correlation with my work on lunasin, they further conclude, \"We propose that the reduction in (breast cancer) risk involves epigenetic changes that result in alterations in the expression of genes that regulate mammary epithelial cell fate, i.e. cell proliferation and differentiation\". http://jn.nutrition.org/content/140/12/2326S.long \"\" target=\"_blank\" rel=\"nofollow\">http://jn.nutrition.org/content/140/12/2326S.long \" target=\"_blank\" rel=\"nofollow\">http://jn.nutrition.org/content/140/12/2326S.long This is the first thing that Lunasin says about it..... Lunasin is a soy peptide that exhibits health promoting characteristics. Scientific evidence indicates that Lunasin is a key component in soy protein responsible for its cholesterol-lowering properties. Lunasin is a unique, 43 chain amino acid peptide found within soybeans. Recent research and development surrounding this soy peptide focuses on promotion of healthy cholesterol levels. In addition to lunasin exhibiting cholesterol lowering properties, research shows it also has cancer preventive properties. How is there no soy in soy peptide?",
      "MessageIndex": 55,
      "PostDate": "30/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "On Dec 31, 2014 3:30 PM davezuro wrote: Oncologists make 60% of their income from the drug treatments they prescribe.  (And everyone accepts that!)  My company invested $$millions to develop lunasin,which has been proven to work, but are we suppose to give it away?   You're asking for an alternative, yes you're scared, but reject what is out there - without knowing anything about it.  Because doctors don't know about it doesn't mean it doesn't work.  Again, go to www.pubmed.com \"\" target=\"_blank\" rel=\"nofollow\">http://www.pubmed.com \" target=\"_blank\" rel=\"nofollow\">www.pubmed.com and type in the search bar \"cancer and  lunasin\".  Over 50 studies are posted how this helps.  Doctors can't make $$ from lunasin because we own the rights to it - so they won't endorse it.   Surviving cancer beyond 7 years after initial diagnosis is very rare.  Those that do survive are in the minority and did so by changing their diet, becoming alkaline, avoiding sugar, exercise regularly and make good lifestyle choices.  Drs don't make $$ telling patients to alkaline their bodies and changing their diets, - they do it by prescribing allopathic treatments. Almost all drugs are synthetic - not natural.  If you know any acturial scientists, ask them about what we're talking about.  I know 3 life insurance salesmen,who all work for different companies, and they all said that this is true what the acturials have researched. I want to help people -this may not be the right place to do it, however, if you're looking for more than what you're getting right now , what is it you want?  How can I help you? You can help by stopping with the spam! This is a site for people WITH CANCER to help each other out! We don't need sales people causing us more confusion! Let me make a list of other items people also tried to sell..... Dandelion root tea THC oil Asparagus puree A magic mushroom Curcumin A vegetable pill Etc., etc.......... Also, stop using scare tactics in saying we will all die within 7 years! That is not true and it is NOT rare that we will live longer! I know about 20 women personally, all whom I talk to that are REAL people who are alive and have been for 20 plus years after diagnosis and treatment! Even stage 4! Do not tell me I personally know all of the rare cases and there are no others! You are insulting and you need to leave this page! Take your snake oil elsewhere! None of us have any money anymore to pay for your snake oil anyways!",
      "MessageIndex": 74,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79122,0.htm",
      "Title": "SCARED"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am not sure if it will help, but I was 40 when I had mine. I was not BRCA positive and I had no family history. I also have had no reconstruction. Not sure if that helps in your situation, but if any of that does, feel free to ask specific questions.",
      "MessageIndex": 1,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79517,0.htm",
      "Title": "Any 20 something year olds who have had a double mas?"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Did they put you on Arimadex?",
      "MessageIndex": 1,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77367,0.htm",
      "Title": "Radiation survivor"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "I am wondering also if there is someone out there who decided not to take it and what the long term effects are. I had stage 2 with 3 positive lymph nodes with an estrogen receptive cancer. I was 41 at diagnosis. I had bi lateral mastectomies, chemo and radiation. I was then placed on tamoxifen because I was pre menopausal. I did that for almost a year and in January had to have my ovaries and uterus removed. Since it put me in to menopause and I hated the side effects (destroying my ovaries, uterus and I wasn't able to focus my eyes and always having a pain in my groin area) I decided to try arimadex. I have taken it for one month and my neck and head hurt so bad that I've been in bed for a week! On chemo I would go get chemo and go back to work so I am not whimpy! This is aweful! Unfortunately, I don't have an oncologist right now because I live on an island and our only oncologist didn't get his contract renewed (causing me more worry). After reading the discussions, I am taking myself off from it for 3 weeks to make sure it is side effects and not something else. I am also going to go to a new oncologist on the mainland to talk to an oncologist and see if there is any thing else I can do. I feel like I am too young to feel so bad. I also have a toddler to care for. So, I've been reading lots and lots over the past few days. I have read interesting things about mold and fungus being in the body and that can trigger cancer cells. Back in 2005 I went through hurricane Wilma and had to live in a mold infested place for one month. 3 feet of salt water raged through my appartment and mold was everywhere. So, it is possible I have mold in me. One way to kill it is by diet. I started yesterday. No processed foods and no meat and dairy or peanuts. I figure this will have two benefits. One, if I do have mold, it will kill it. Two, getting any body fat I have lowered will lower estrogen levels. Also, they say when the mold or fungus is present, it affects the liver and the liver produces more estrogen (my cancer is estrogen receptive). I don't have any long term advice on it as this is only my second day off arimadex. I am on vicodin trying to get this pain out of my neck. I am able to sit up and do a few things today. But, going off a med is scary. You may want to check out the statistics of how much it really helps you. Find out how agressive your particular cancer cells are. Also, if you are on arimadex, talk to your oncologist about getting a prescription calcium and make sure you are getting enough magnesium and vitamin D every day. They say if you have worse symptoms, it means it is less likely to be a recurrence. You may want to try the sample and see how the side effects are for you. I knew in one month. I am not sure if I am going to stay off it or go back on. I am torn. It stinks either way. There is nothing easy about having cancer.",
      "MessageIndex": 3,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77533,0.htm",
      "Title": "Afraid to begin Arimidex"
    },
    {
      "AuthorID": "cancerkeys",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cancerkeys",
      "Content": "Ask your oncologist before you do anything, but I think I remember them saying you can take Benedryl right before your chemo to help with any reactions that may occur. I am not 100% if I remember this correctly (chemo brain) so make sure you ask a professional before you do anything. I think my friend had this and it was a reaction to the pre meds they gave her (steroids). Don't be afraid to ask. You are paying them.",
      "MessageIndex": 1,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77818,0.htm",
      "Title": "Rash on head"
    }
  ]
}