{
  "AuthorID": "Cancersue",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cancersue",
  "Posts": [{
    "AuthorID": "Cancersue",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cancersue",
    "Content": "On Oct 02, 2016 5:19 AM pjwold wrote: I have been on Anastrozole for about four years. I never wanted to read the list of side effects as I did not want to start creating things that weren't there. However; I cannot deny what is happening with my body. The bone and joint pain, particularly in my lower body, is nearly debilitating. If I have been sitting for a period of time and get up to walk, I hobble for about the first 10 to 15 steps before the pain subsides enough that I may walk normally. And what is there to say about the fatigue? I have always been someone with boundless energy, but not anymore. I am finding it increasingly hard to get through the workday without fighting fatigue and wanting to sleep. This has become enormously disruptive to daily life. These have been the biggest areas of concern. As of late, I have also experienced additional side effects. Dry mouth, dry eyes, lack of vaginal secretions, weight gain and an inability to lose weight, incredible hot flashes and ridiculous perspiring (embarrassingly), hand pain, thumping in my right ear, increased migraines, increased appetite, increased blood pressure, and the list goes on. I recently discussed with my primary care doctor and my oncologist the possibility of switching medications. The oncologist made a good point… I have metastatic breast cancer and every time I have a clear scan, I'm a freak of nature. The good news is, breast cancer has now become a manageable condition. So I live with the side effects and the tremendous changes in the quality of my life, but I am still on this side of the daisies. Therefore; I'm going to suck it up, buttercup, and keep driving on. I wish you all wellness and wholeness and happiness and I wish you success in fighting the good fight. Warmly, PaulaI've been on anastrozole for 4 yrs 10 months and I've decided to stop.. like you, the join pain is horrible, the weight gain is over 30 lbs & I can't loose more than 1-3 lbs trying my best..Tiredness is hard for me as energetic as I was and I sweat like a pig!! So I've decided to stop on my own and see what happens even though the meds and steroids stay in me 3-4 months.. I see my Oncolgist the first week in January and hopefully she's ok with my decision. I just can't handle the pain, tiredness and sweating anymore. We in this together except at 67 years old it makes me feel so old when just 4 1/2 years ago I looked & felt like I was in my 40's... keep in touch with me and let's compare symptoms and improvements!!",
    "MessageIndex": 1,
    "PostDate": "12/10/2016",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93255,0.htm",
    "Title": "Anastrozole AKA Arimidex long-term use"
  }]
}