{
  "AuthorID": "Cancercompass",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cancercompass",
  "Posts": [
    {
      "AuthorID": "Cancercompass",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cancercompass",
      "Content": "Dear Brenda, Nearly all breast cancers arise from glandular tissue (called adenocarcinomas), although other types also occur, including squamous cell carcinomas. It appears you had a less common form of breast cancer. I think what is important now is for you to focus on preventing recurrence, especially since you experienced a recurrence in the left breast a few years ago. There have been many advances regarding nutrition and breast cancer. I suggest that you contact Cancer Resource Center at 800 940-2822. We can provide to you, at no charge, nutritional guidelines for the management of breast cancer. To your good health, Kim Dalzell, PhD, RD, LD",
      "MessageIndex": 1,
      "PostDate": "07/09/2001",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,421,0.htm",
      "Title": "Pure Squamous Carcinoma (Breast Cancer)"
    },
    {
      "AuthorID": "Cancercompass",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cancercompass",
      "Content": "Dear Laura, You are right about adenoid cystic carcinoma of the breast; it is rare (accounts for less than .1% of all breast cancers). There are few chemotherapy trials for adenoid cystic carcinoma because it is so uncommon; however, chemotherapy is usually started if metastatic (spreading) disease is present. The most common site of distant disease in the lung, and this can occur years after removal of the primary tumor. In general, prognosis is favorable as long as there is complete tumor removal with uninvolved margins or lymph involvement. It will be particularly important to support your immune system and protect your body from free radical damage. A guided nutrition program can help you accomplish this. For more information on how dietary changes and vitamin supplements can help you, please call Cancer Resource Center, 800 940-2822. To your good health, Kim Dalzell, PhD, RD, LD Program Director, Holistic Nutrition Services Cancer Resource Center",
      "MessageIndex": 1,
      "PostDate": "13/09/2001",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    }
  ]
}