{
  "AuthorID": "CancerStrike2",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CancerStrike2",
  "Posts": [
    {
      "AuthorID": "CancerStrike2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CancerStrike2",
      "Content": "Try the american cancer society, ask them to search for you.  Good luck. Best wishes, V",
      "MessageIndex": 4,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39276,0.htm",
      "Title": "how to i find financial help"
    },
    {
      "AuthorID": "CancerStrike2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CancerStrike2",
      "Content": "  On 8/5/2009 julyruby wrote:  I just turned 47 & Happy Birthday, I have breast cancer! I had a double mastectomy on 6/17. Then had to go back for 6 days to the hospital due to infection in the incision & had to have another surgery. I have a very large support group of friends. I haven't cried since the day I found out the test results.Everyone says I'm so strong. I'm smiling, joking & thinking & speaking positive.Yesterday I had a melt down. Insurance company was giving me a hard time & I just lost it. My friends think it was just because of the insurance. It was & so much more. I'm in constant discomfort do to the expanders & its getting to me. I just don't feel as strong as I show I am. A close friend has stage 4 rectal cancer & has be going through agressive treatments. I just feel that I have no right to complain. My cancer is gone & he might die from his. Can anyone out there relate? Hello, I think it is ok for you to complain.  Dont bottle it up.  Noone can read your mind and know what you go thru better than you.  Pls let others know so they can share and support as you support your other cancer friend. I miss that my mom keeps the pain inside and not let us know early.  I got a melt down 3 wks earlier as I think my mom life aint able to save anymore.  Again American Cancer Hotline transfered me to another cancer survivor hotline to listen to me for another hour.  It did help me perhaps you talk to a stranger it is better understanding ??? Best wishes, Victoria  ",
      "MessageIndex": 1,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38742,0.htm",
      "Title": "emotional support"
    },
    {
      "AuthorID": "CancerStrike2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CancerStrike2",
      "Content": "  On 5/9/2009 NeeNee wrote: Seven years ago I had a lumpectomy. Not sure of the spelling. The cancer had not spread into my lymph nodes which was good news. The doctor said they got it all and I went thru a series of radiation. Now after a PET scan they said it is back. I had three vertebrae that was affected. My doctor set up a back surgery to repair my vertebrae and did a biopsy at the time. It was confirmed that is was breast cancer. So my cancer doctor put me on aromasin but that didn't work. After another PET scan they found the cancer is now in my left leg, in each of my hips and in my right side in my back. So he changed the medicine now I am taking Megestrol. I was taking 40 mg of aromasin. Now I am taking 160mg of Megestrol. My cholestrol went over 400 and my tricly. was over 380 so I went on a diet eating only fruits and vegetables, whole grain cereal and pasta, fish and chicken. All lean and without fat. Last time my cholestrol was down the 287. I have lost 15 lbs. Which is all good. In a week I have to have another blood test to see it the Megestrol is working. I am 61 years old and I have grandchildren I dearly love. I want to be around to see them graduate. Has anyone else been thru this same thing? What treatments have you had?   Thanks so much. NEENEE Cholesterol is made naturally by our liver to maintain cell functions and to produce hormones. Excess cholesterol added to our system through unhealthy diet leads to plaque build up in the arterial walls leading to fatal heart diseases. Here are some dietary tips to reduce cholesterol.   .Include soy in your diet in the form of soybeans, tofu, soymilk, tempeh and miso. Soy is a one stop shop for rich proteins, essential fatty acids, unsaturated fat, high fiber and carbohydrates. Replace saturated fat with unsaturated fat in your diet to lower cholesterol. Use sunflower, sesame, olive and canola oils for cooking to get the benefit of both polyunsaturated and monounsaturated fat. Increase the intake of omega-3 fatty acids, which is not produced by our body but is essential for our health. It can be found in fish oil, walnuts, salmon, sardine, flaxseed and soybeans. Chop two cloves of fresh garlic and swallow it with a glass of water everyday. The antioxidant property of garlic prevents the bad cholesterol or LDL from oxidizing and accumulating on the arteries. Eat foods rich in complex carbohydrates like wholegrain bread and pasta, brown rice, peas, beans, oats, corn, green and dark leafy vegetables, fruits, onions, scallions, shiitake mushrooms (avail at Asian Supermarket or Trader Joe)...V",
      "MessageIndex": 3,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "CancerStrike2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CancerStrike2",
      "Content": "A very Long brave journey for her and the children. RIP...  Sad...",
      "MessageIndex": 0,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,53683,0.htm",
      "Title": "Elizabeth Edward just passed..."
    }
  ]
}