{
  "AuthorID": "Carlineann",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
  "Posts": [
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "Hi, I apologize for not responding to your email about the vitamin C IV. I decided against taking the IV but have done some other types of alternative treatments. My newest treatment is three enemas a day, the first one distilled water, second is coffee, and the third is wheat sprout and probiotics. I also take a Kylo drink daily, fruit smoothies with wheat grass, and aloe with coral calcium. The aloe and calcium has brought up my ph to 6.2 as of today. It has always been around 5.5. I take a ph daily with a special meter first thing in the morning after 5 a.m.I still eat fresh veggies(parsley and swiss chard or whatever available from my garden) and fruits, eggs, some nuts and seeds, some wild caught fish. I take some supplements still like Paw paw, glutamine and glutathione, beta glucan 500mg, coq10 when no paw paw and I do liver and parasite  cleanses. God Bless you. Carline",
      "MessageIndex": 9,
      "PostDate": "01/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "I had a mastectomy in August with three lymph node positive. I had decided to try other alternatives besides chemo and radiation. I am taking Paw Paw and have had the amalgam in my teeth removed. I take many other supplements as well as eat very healthfully such as eating black grapes continuously all day long. I would like to try the Vitamin C IV but would like to hear more info about it such as the amount to take and how often. Carline",
      "MessageIndex": 0,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "Hi Donna, I just now saw your email. How exciting to find someone else that is using alternative treatments. I have had a hard time finding other people like you. I would love to get a board of us together so that we can share and record and document our findings. I decided against the vitamin C IV but I did take 50 g while I had my teeth and cavatations taken care of and I felt great. No drying of my mouth, etc that you experienced. I hope you can read my other email of the things I am now doing with my treatments as far as nutrition and enemas and cleanses.  I was wondering how you got a doctor to give you an IV? I live near Austin, TX and there is an internal medicine doctor in Austin and a doctor in Wimberly that will give the IVs.( I hope this answers the other message that was before your message) I just did not feel comfortable about having the IV done continuously. Call it intuition I guess.  I have not done anything for markers but I did order the AMAS test which was sent to me from a group out of Houston. Now I need a doctor to give it to me. It is a blood test for cancer. I will try the doctor in Wimberly. The one in Austin wants me to do Chelatan and vitamin C IV first. Please keep in touch and let me know how you are doing and what you are doing.  God Bless. Carline ",
      "MessageIndex": 10,
      "PostDate": "01/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "I am presently not taking chemo or radiation. I was given 50grams of ascorbate vitamin C intravenouly while I was having my 4 1/2 hour amalgams with mercury taken from my old fillings. I had no side effects from the mercury from my teeth being taken out and nor from the C. I am going to start a program for vitamin C 50 grams three times a week for three months. I felt great during and after the first C treatment was given for my teeth procedure. I am looking to buy vitamin C NOT made from corn so that I can take it intravenously myself. Paw paw is a supplement that is made from tree bark and supposedly kills cancer cells. It can make you nauseous if you take too many.",
      "MessageIndex": 4,
      "PostDate": "09/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "I try to take good vitamins, and I have heard of the Greatest Vitamin in the world. I have an organic vegetable garden year round and try to rely on vegetables, fruit, nuts, and seeds for vitamins. Oh, something I've been trying are Chia seeds. They are very remarkable. I have everyone at work trying them.",
      "MessageIndex": 5,
      "PostDate": "09/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Carlineann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carlineann",
      "Content": "Hi Donna, I just now saw your email. How exciting to find someone else that is using alternative treatments. I have had a hard time finding other people like you. I would love to get a board of us together so that we can share and record and document our findings. I decided against the vitamin C IV but I did take 50 g while I had my teeth and cavatations taken care of and I felt great. No drying of my mouth, etc that you experienced. I hope you can read my other email of the things I am now doing with my treatments as far as nutrition and enemas and cleanses.  I was wondering how you got a doctor to give you an IV? I live near Austin, TX and there is an internal medicine doctor in Austin and a doctor in Wimberly that will give the IVs.( I hope this answers the other message that was before your message) I just did not feel comfortable about having the IV done continuously. Call it intuition I guess.  I have not done anything for markers but I did order the AMAS test which was sent to me from a group out of Houston. Now I need a doctor to give it to me. It is a blood test for cancer. I will try the doctor in Wimberly. The one in Austin wants me to do Chelatan and vitamin C IV first. Please keep in touch and let me know how you are doing and what you are doing.  God Bless. Carline ",
      "MessageIndex": 11,
      "PostDate": "01/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    }
  ]
}