{
  "AuthorID": "Carlenne_J (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hi Iris! I am sorry to hear of your diagnosis, but I don't think it's the death sentence it used to be. Many positive things may happen in your life because of this - it sure did to me! I would love to tell you lots more, but I am currently on vacation in Kauai, Hawaii! My husband and I are celebrating our 20th wedding anniversary and my oldest daughter will be celebrating her 13th birthday - it's ALL so good! I was 34 when diagnosed, and had always thought of having three children. My youngest at that point was almost 2yrs old, so I was contemplating my next pregnancy! Ha! Anyway, I refused chemo because my cancer was stage 1, no lymph node involvement, and my body/bone scan did not show ANY cancer type activity anywhere. So, until someone could prove to me that I had cancer running rampant in my system, I refused the chemo. Did you know how incredibly toxic it is? Did you know that the side effects will likely cause you health problems if the cancer doesn't come back? I found it too scary, and was not ready to go thru a chemically induced menopause. Anyway, a good book for me was The Cancer Battle Plan by Anne Frahm and her husband. It's kind of old now, and poor Anne finally died, but her husband runs an awesome program in Colorado. Health Quarters, I believe. Her overall message was great, her total way of taking responsiblity for her treatment is inspiring, etc. I'd highly recommend it. However, I did not do all the things she did - no coffee enimas, and my diet was vegan, but not to her extreme. I did do vitamin supplements and exercise and the vegan diet. Most of all - DO WHAT YOU FEEL IS RIGHT FOR YOU! You are young, do NOT let the doctors bully you into any treatment you don't believe in - it won't be as effective. On the other hand, if you believe chemo is right for you, DO IT. Take charge of your treatment, it's your body and your life. Learn all you can. Ask questions and change docs if you need. (nothing is more fun that firing a cocky doctor!) PLEASE write back to me at the end of August and I'll tell you anything you'd like to know! I'm happy to share! Most importantly... you ATTITUDE! If you believe you can beat any cancer, your chances of being healthy become so much better! Live like you're gonna live, not like you're getting ready to die. At the same time, live like you would like to live, not like you've been living. Do those things you'd like to do, make the changes you'd like to make. I retired at the age of 36! Imagine. It's wonderful. Good luck to you and I'll keep you in my prayers! You were so kind to write! Carlenne ( wow, this was longer than I planned!)",
      "MessageIndex": 10,
      "PostDate": "08/08/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2594,0.htm",
      "Title": "Swallen Gland (?) and Pain in Ribs Under Brest a Year After Lumpectomy"
    },
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Get to your doctor as quickly as possible. Have her do whatever test is necessary to make sure that your cancer hasn't spread, etc. You said you had a lumpectomy, did you have radiation? It's always rare, but possible that did some sort of damage. Just get it checked out as quickly and thoroughly as you can! Here's to your good health!",
      "MessageIndex": 2,
      "PostDate": "02/08/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2594,0.htm",
      "Title": "Swallen Gland (?) and Pain in Ribs Under Brest a Year After Lumpectomy"
    },
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hi Iris! I am sorry to hear of your diagnosis, but I don't think it's the death sentence it used to be. Many positive things may happen in your life because of this - it sure did to me! I would love to tell you lots more, but I am currently on vacation in Kauai, Hawaii! My husband and I are celebrating our 20th wedding anniversary and my oldest daughter will be celebrating her 13th birthday - it's ALL so good! I was 34 when diagnosed, and had always thought of having three children. My youngest at that point was almost 2yrs old, so I was contemplating my next pregnancy! Ha! Anyway, I refused chemo because my cancer was stage 1, no lymph node involvement, and my body/bone scan did not show ANY cancer type activity anywhere. So, until someone could prove to me that I had cancer running rampant in my system, I refused the chemo. Did you know how incredibly toxic it is? Did you know that the side effects will likely cause you health problems if the cancer doesn't come back? I found it too scary, and was not ready to go thru a chemically induced menopause. Anyway, a good book for me was The Cancer Battle Plan by Anne Frahm and her husband. It's kind of old now, and poor Anne finally died, but her husband runs an awesome program in Colorado. Health Quarters, I believe. Her overall message was great, her total way of taking responsiblity for her treatment is inspiring, etc. I'd highly recommend it. However, I did not do all the things she did - no coffee enimas, and my diet was vegan, but not to her extreme. I did do vitamin supplements and exercise and the vegan diet. Most of all - DO WHAT YOU FEEL IS RIGHT FOR YOU! You are young, do NOT let the doctors bully you into any treatment you don't believe in - it won't be as effective. On the other hand, if you believe chemo is right for you, DO IT. Take charge of your treatment, it's your body and your life. Learn all you can. Ask questions and change docs if you need. (nothing is more fun that firing a cocky doctor!) PLEASE write back to me at the end of August and I'll tell you anything you'd like to know! I'm happy to share! Most importantly... you ATTITUDE! If you believe you can beat any cancer, your chances of being healthy become so much better! Live like you're gonna live, not like you're getting ready to die. At the same time, live like you would like to live, not like you've been living. Do those things you'd like to do, make the changes you'd like to make. I retired at the age of 36! Imagine. It's wonderful. Good luck to you and I'll keep you in my prayers! You were so kind to write! Carlenne ( wow, this was longer than I planned!)",
      "MessageIndex": 15,
      "PostDate": "08/08/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2594,0.htm",
      "Title": "Swallen Gland (?) and Pain in Ribs Under Brest a Year After Lumpectomy"
    },
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Carolyn - I had breast cancer 8 yrs ago and am healthy today! I had a 2.5cm lump with no lymph node involvement, and they got clean margins with a lumpectomy. I did not like the thought of harsh chemo, and refused it. I was 34 and also didn't like the thought of early menopause which chemo will cause. Luckily I had an awesome oncologist who supported my decisions. I did radiation and it was ok. Just use organic 100% aloe on the area after EACH treatment - it makes a world of difference! I would suggest getting some good vitamins which will help your overall health and recovery from surgery and radiation. If you can afford it, see a nutritionist to get a good evaluation of your need for vitamins and nutrition. However, even grocery store multi-vitamins are better than nothing! Eat HEALTHY food and get plenty of rest. You'll do great!",
      "MessageIndex": 2,
      "PostDate": "14/07/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1227,0.htm",
      "Title": "Treatment"
    },
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hi Marietta! I also had a lumpectomy and radiation, but refused chemo. I was only 34 years old. This was 9 years ago - JOY! I did know someone who had a more serious case of breast cancer and she also had rib pain. The doc brushed her off saying that she was fine and to just deal with aches and pains. What could have been handled easily became a huge disaster and when the doctor finally responded, it was too late. Stupid doctor. However, the woman should have asked for more tests, gone to a different doctor... something. It was very sad. That's why I urged quick attention! So I wish you much luck in your MRI. I hope it all comes out to be nothing more than scar tissue that's irritated or a little fluid build-up or something that's VERY minor and easily fixed. Keep a positive attitude because it's so important! You're in my thoughts and prayers. Carlenne",
      "MessageIndex": 5,
      "PostDate": "02/08/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2594,0.htm",
      "Title": "Swallen Gland (?) and Pain in Ribs Under Brest a Year After Lumpectomy"
    },
    {
      "AuthorID": "Carlenne_J (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Ok, so I went to the site. It just told me how to invest and what the whole program was. My question is, how do I get this test?",
      "MessageIndex": 1,
      "PostDate": "15/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1688,0.htm",
      "Title": "a Blood Test For Breast Cancer"
    }
  ]
}