{
  "AuthorID": "Carol13",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
  "Posts": [
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Go have an mri done on your neck. Maybe a surgery would help. I have had a neck fusion done in 2009. I was diagnosed breast cancer on 2015 . Highly estroge receptive. Yes i took HRT . Man am I sorry I did now because I blame the cance on the hormone replacment therapy. But most of my pain is in my fingers . The weather effects my neck pain. You sound like you might have a disk issue . I hope not .",
      "MessageIndex": 38,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77504,0.htm",
      "Title": "Are you Estrogen positive Breast cancer and think you know what caused it?"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Hi Bobby, The lumpectomy is the way most of us early stagers are gong with great long term success. Talk it over with your surgeon . The lympnodes would be my determing factor if I were you. But if the masectomy is what you want then do it . You are the one in charge here ,not the doctors. If it will give you peace of mind then so be it. Please know you are not alone. We are here for you. I send you prayers ,positive energy and the biggest hug! You will be ok. Carol13",
      "MessageIndex": 16,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Hi D, I too am estrogen receptive posotive. Yes it is a good thing. More amo agianst the beast. I will bwe starting radiation therapy pretty soon. I will have to go EVERDAY for a MONTH! Wow. I was considering the new braca radiation but Im not too crazy about haveing a tube left inside my breast for two or even one week. It is a faster path to walk but too invasive for me personaly. Also I met my oncologist today. Nice lady. She wqants to start me on a medication called Firma or it may be Arimidex. I guess Im too old for the Tameren (spelling). Im almost done with menapuse ,that is why. I will be reasearching these two drugs . I know not much about them yet. Just that they block estrogen. They also will be looking at my biopsy lumpectomy tisue again to see my rate of duplicity. How fast the cancer cell are dulpicating. If its LOW no chemo for me. If to the high end I guess I may have to think about it, oh crap. I dont want that. Nobody does. So now I have more restless  nights worrying about that. I find out in about three weeks from now. How do you guys get sleep ? Im taking tylenal PM now. Hugs ,Carol",
      "MessageIndex": 5,
      "PostDate": "16/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Hello, I too like you have been reduced to a 0 from a stage one. This was after the surgery . Most all breast cancers are DCIS . Not sure about the LCIS part. I think I have that too.  Im HER negative. A good thing. Thank you for telling am about how well you did on the meds. Helps me allot to know this. Really ! As for the sleep ,I have tried the melatonin , warm milk , teas, and on and on. I wake up in the middle of the night is the problem. and the thoughts start going around and around. Yes I am  BIG prayer. I pray for not just my self. I have a long list. I pray for anyone and everyone who needs it. So you did gain weight on the arimidex hu? Not good. I weigh now at about 120. Before diagnosis I was at 130. But I surely do not want to gain weight. This is one of the good things cancer did give me. The other good thing I recieved from cancer was a heart opening experiance. I have always been a loner. I like to keep to myself. A real hermit. I have recieved such an out pouring of support from within our neighborhood. We actually recieved 7 cooked meals deliverd to our door from 7 diffrent familys. I was just over welmed with tears. These people would only see me when I took our two dogs for a walk. I would wave and keep going. But they all know my husband. He works a full time job and in the summers he likes to seal coat driveways and parking lots.He has a truck and trailer with all the equipment for this.  He knows the neighborhood this way. They all just love him. I told one neighbor of my plight and it went out to all. Thats how it started. Its one of the best things to have done for you when going through this . We have not had to cook hardly at all. And the feeling of love and support is truelly amazing. it will be hard to change who I am but I cant stay a hermit like I was any more. This is what I ment by heart opening . The love I felt was so great. The tears and hugs from folks I hardly knew. My family is not living close by me. One sister her husband is going though renal failer. She has much on her plate now. They are at the top of my prayer list as he has less then a year left. This is getting too long. Sorry. Thank you all for the support. And good advise. Hugs,Carol",
      "MessageIndex": 7,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Hello, I too am newly diagnosed with breast cancr stage one. It was given to me on August 28. I just had a lumpectomy done on september 3rd. I went in with stage two and surgeon said I am now stage 1. I hade a lymp node removed and it was found clear . (thank you GOD!) I see my surgeon tommorow for follow up. Then I next will be meeting an oncologist. I believe I will only need radiation treatment and will be starting that drug Tamoxifin. (spelling) I had my 58th birthday on Sept. 13th. Nice way to spend birthday hu? But sounds like you caught yours early too. You will be ok. My arm hurts more then breast area. But , its managable. I would love to give you any support or answer any questions you may have. Sounds like we may have much in common. I just found this website yesterday and so far I like it allot. Such nice people with this terrible plight we share. I will be here for you. Sending positive energy your way. Carol  ",
      "MessageIndex": 1,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Tuckersmimi, I also wanted to add. I know how you feel . The frozen with shock feeling. Cant think. Cant remeber . Im still  going through it. I did read that it takes about two to three weeks to come to terms with this diagnosis. I have trouble falling asleep . I feel dirty inside. CANCER! ME? Im here for you. And dont worry about your age. You will heal just fine. PLease ,Im here for you. I creid  and creid. I still do. Carol Carol",
      "MessageIndex": 2,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Well thank you for sharring this information with me. I did just have the lumpectomy done as well. waiting to start the radiaton next. Most likley next week. You did make me feel so much more better. Stay well, hug. Carol13",
      "MessageIndex": 14,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Add me in the loop too. I hjad the thre sentilas removed last September. The week of my BD. Lumpectomy too. I did radiation and am now on Letrozole. I think they do some nerve damage when they remove these nodes. SO many of us are still complaining about pain for years later after the removal. I would choose NOT to do a lymp removal EVER again if I was asked . Now I am trying to deal with much joint pain from the Letrozole ( generic Femera) I go to a pain clinic . Have been for years prior to this frikin cancer thing. I have had cervical fusion done in my neck so I have a get oxycodone for pain. This is helping me deal with the joint pain as well . I am trying to decide if I should stop the Letrozole . I cant see 5 years of this . There are days it cant get out of bed it hurts so bad. Not kidding. But ,the under arm pain wil get better over time. Do streaching of under arm. It will help. Give it a few more months. Try not to baby it too much. Sorry you are going through this.",
      "MessageIndex": 3,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91970,0.htm",
      "Title": "Pain underarm from sentinal node removal-How Long???"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I have been on Letrozole since about last December. Joint pian became unbearable. Doc switched me to Anastrozole. Now my memory is quickly fading as is my hair ! Found out about natuiral alternatives. Grape seed extract is a natural estrogen blocker. Also helps with joint pain, hair ,nails , heart health , eye health . Supports immune system. I am rteady to roll the dice and stop my meds and start the grape seed extract. called my onco and he wants me in his office to disscuss this. I knew he would want to. But I wonder if this is so good why has  not a clinical trial been done on it ? I am willing to be the first guiniepig. There just has to be a better way then these drugs tjhey want us to take for 5 or more years . I am only stage one , onco score of 21. I chose no chemo. Had lumpectomy. Havingf first breast MRI done this week. Want to know if anyone else has tried the natural way .Please let me know.",
      "MessageIndex": 0,
      "PostDate": "01/08/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92662,0.htm",
      "Title": "Natural Alternative to Als medications"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "DMI i think its called. Go to amazon . put in estrogene blockers. There are other natural ones.  They are just not part of the big pharma that our onco's love.  Also back off allot on meat cunsumption. Inless you know its horemone free. Same with all dairy. You are now like me a label reader.  Best of luck to you",
      "MessageIndex": 2,
      "PostDate": "27/08/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92662,0.htm",
      "Title": "Natural Alternative to Als medications"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Well, I have oxycodone that helps me deal with pain. I had a cervic fusion done years ago and was given this for pain . And it helped me get through the very tuff time of being diagnosed. Two weeks of constant crying. I am now about 7 months out of diagnosis. Lumpectomy ,radiation. I said NO to chemo . Stage 1. Dealing with joint pain from Letrozole is helped with the opiod  but very addictive oxycodone. Its better then being in pain all the time. Mostly in the evenings I hurt. I do take the Letrozole in the morning. I would rather have the hot flashes durring the night when asleep then durring the day.  Hugs , Carol",
      "MessageIndex": 39,
      "PostDate": "15/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I am just like you . Lumpectomy ,stage one small tumor breast cancer. Now on Letrozole ( generic femera) . No chemo. The joint pain started in my fingers for about three months. Now it is ALL over my body. I have had lumpectomy and nodes removed in last Sept 2015. I take oxycodone for cervical neck fusion . and believe me this oxy helps my jont pain too. Its not for everyone ,and I know its addictive but what the heck else can I do? Thinking about quiting the letrozole . But if the beast ever comes back to me ,I will not let them do a lympnode removal again! I understand they are working on a new way to detect the nodes with out removal. Its a sonar thing. I hope they start using it soon . Lymnod removal was the most painful part . Now my joints . I am 58 . Feel 100 sometimes. Going on a vacation soon and I worry I will be a big downer for everyone.",
      "MessageIndex": 47,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Because I did not stay on it long it Seemed to leave my body in a matter of a few weeks after stopped taking it. You can try drinking detox teas if you like.",
      "MessageIndex": 55,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I am now almost three years out.  Stage two. Highly estrogen positive. I stopped ALL estrogen blockers after trying them all. Why? Because dear sisters in pink I am almost 61 and choose quality of life over length.  Screw that crap. I see no oncologist anymore because I don't need the drama lecture. I eat right. Not over weight.  Just be your own best advocate and live life fullest",
      "MessageIndex": 53,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I am now almost three years out.  Stage two. Highly estrogen positive. I stopped ALL estrogen blockers after trying them all. Why? Because dear sisters in pink I am almost 61 and choose quality of life over length.  Screw that crap. I see no oncologist anymore because I don't need the drama lecture. I eat right. Not over weight.  Just be your own best advocate and live life fullest",
      "MessageIndex": 59,
      "PostDate": "15/07/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Because I did not stay on it long it Seemed to leave my body in a matter of a few weeks after stopped taking it. You can try drinking detox teas if you like.",
      "MessageIndex": 61,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I ended 4 weeks of radiation treatments this last December 2015 for a breast cancer. My radiation doctor wants me to have a mamogram done this comming March! I think she is crazy. I said NO! I want to wait atleast a year post . Opinions please /",
      "MessageIndex": 0,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89846,0.htm",
      "Title": "How soon to have first mamogram done after ending raadiation treatments ?"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "Hi Lisa , My treatment was very lie your. I am currently taking Letrozolw. generic for Femira . Its not bad so far. I had the jont pain in fingers. tried taking the Tumeric capsules . Well my blood pressure went sky high. I knew it was the Tumeric combination with Letrozole. SO easy to guess which one I stopped taking. Tumeric! Back to sore fingers again. Yes radiation is scarry stuff. I too ,like you had 4 grueling weeks of it. As I laid there I wondered what damage was being done to my body . I finnished rads. this last December. So I guess I will find out soon enough if I incured any lung or heart damage . The effected breast was right side. I am adding you to my prayers. Please stay strong. We only do what we think is best for us with the given medice we have today. Now my radiation doctor wants me to have amaogram in March! I think its too soon. I want to wait atleast a year after treatments ended. I woud like your opinion on this please. Wish you the best ,Carol",
      "MessageIndex": 1,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89820,0.htm",
      "Title": "Radiation/Drugs Side Effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "WE are still in the dark ages when it comes to cancer. Soon we will not have to have lymphnodes removed anymore. Ty will bee scanned with an ultrasound after being injected . Hoot Hoot!!! Too late for me though,,,,",
      "MessageIndex": 4,
      "PostDate": "29/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89820,0.htm",
      "Title": "Radiation/Drugs Side Effects"
    },
    {
      "AuthorID": "Carol13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Carol13",
      "Content": "I was diagnosed at the age of 58 september 2015. DCIS. Stage two. Now I am a srage 1 due to lumpectomy. Currently cancer free . Onco score of 20. High end of the lows. I am not a good canditate for chemo. I am currently taking radiation. And on Letrozole. Estrogene blocker for us older gals. I hate it. Makes my axiety go over the top. So Im now off the drug till end of radiation. Yesterday they put me xanex. . Im just bettr being off the Letrozole. It can mess up your head. Emotions all over the place.  I may say no to the Letrozel . Time will tell. I just put my Momin a nursing home,seen those poor people milling about. I dont want to live that long. Only if I can be independant. Sorry,they all look so sad.",
      "MessageIndex": 18,
      "PostDate": "10/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32825,0.htm",
      "Title": "Oncotype dx testing and decisions made"
    }
  ]
}