{
  "AuthorID": "casbah2 (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "casbah2 (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hi, my wife has breast cancer for few years now she had mastectomy, chemotherapy, her ovary out then cancer came back then chemotherapy but that didnt work then they used chemotherapy tablets for a year then another type of chemotherapy then they said now that there is no more options. This week i read in the newspaper the SIRT treatment is something we could try for my wife which might work for her, but it seems that we cant get this treatment on the NHS because it is a very expensif treatment. Can anybody tell me if i can get the treatment on NHS and where please.  Thank you.",
      "MessageIndex": 0,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46471,0.htm",
      "Title": "SIRT"
    },
    {
      "AuthorID": "casbah2 (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On May 09, 2010 9:13 PM narinder wrote: Hi have you had any response to your question as i too am trying to find out the answer.   thanks   hi, i didnt get any answers yet but l hope to get something soon. Thanks",
      "MessageIndex": 3,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46471,0.htm",
      "Title": "SIRT"
    },
    {
      "AuthorID": "casbah2 (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On May 10, 2010 4:45 AM Bryanswife wrote: What is NHS? My Bryans first sirt evaluation is Thursday. We have high hopes to slow the cancer down.   hi, NHS is national health services means that the government pays for it otherwise SIRT coast around £23000. If you find anything about SIRT please tell us where you find the cure.  Thanks.",
      "MessageIndex": 4,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46471,0.htm",
      "Title": "SIRT"
    }
  ]
}