{
  "AuthorID": "Catharine_P",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Catharine_P",
  "Posts": [
    {
      "AuthorID": "Catharine_P",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Catharine_P",
      "Content": "Dear Judy, I went through radiation after lumpectomy and chemo, and did it with implants in. Now my radiated breast has crawled up my chest wall until it is almost even with my collar bone. At this rate I'll be wearing it on my forehead by December. The cosmetic surgeon was wary about doing a breast reconstruction on my radiated side because of the burned skin (now four years gone), and I am having discomfort and limited mobility on that side due to the advanced scarring underneath and on top of the lateral muscles. I hope your surgery goes well, and I would love to hear how your recovery turns out. I wish you much luck! Catharine",
      "MessageIndex": 1,
      "PostDate": "13/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5955,0.htm",
      "Title": "Diep Flap"
    },
    {
      "AuthorID": "Catharine_P",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Catharine_P",
      "Content": "Dear Carpets, I feel better on Aromasin. The bones in my feet still hurt, but that goes away during the day. The gas is still there, though less, and I have modified my diet to exclude flour, sugar and alchol, which has helped quite a bit. Maybe if I had done that before the gas would have gone away! Good luck on your second time around. I've made it through three years and hope that it \"sticks.\" Have a wonderful holiday. Catharine",
      "MessageIndex": 2,
      "PostDate": "11/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1336,0.htm",
      "Title": "Aromasin"
    },
    {
      "AuthorID": "Catharine_P",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Catharine_P",
      "Content": "I was a II-a estrogen receptive breast ca patient, who had surgery, CMF chemo, and then radiation. After all was finished nearly 2 years ago, I began the 5-year course of Arimidex. The bone pain side effects were rough. Now I'm on Aromasin, with a lesser degree of bone pain, but I now have terrible gas problems. Does anyone else taking Aromasin have this embarrassing problem?",
      "MessageIndex": 0,
      "PostDate": "11/10/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1336,0.htm",
      "Title": "Aromasin"
    },
    {
      "AuthorID": "Catharine_P",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Catharine_P",
      "Content": "I've been through I.V. Chemo three times in the last ten years and have lost my hair each time. This last time it came back in much thinner than the other two times, and like you, I was devastated about the bald areas. It's been six months and the thinness is getting better although I am leaving more hair on the shower floor than I think is normal. The bald spots are filling in very slowly. Waiting is difficult, and wearing a wig is no fun. What does your oncologist say?",
      "MessageIndex": 1,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,67729,0.htm",
      "Title": "Bald spot after hair grows back?"
    }
  ]
}