{
  "AuthorID": "Cchristymike",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cchristymike",
  "Posts": [
    {
      "AuthorID": "Cchristymike",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cchristymike",
      "Content": "Loree, i'm sorry for what you've been thru and continue to go thru-- i miscarried 2 months ago and scheduled to start chemo tomorrow--i've already had a left side maestecomy (9/26)-- after chemo which is a total of 8 treatments every 2 weeks then 36 radiation treatments-- we are treating this very aggressively since the cancer i have is very aggressive-- thank you again for your support-i'll be keeping you in prayer! hugs, Christy",
      "MessageIndex": 5,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Cchristymike",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cchristymike",
      "Content": "thanks for the chemo tips-- my first treatment was yesterday-- went fairly well-- until a couple of hrs later with a severe headache and the nauseau kept creeping back up-- they sent me home with avitan, kytril and phenergan for nausea-- i got some ginger ale but it tastes too strong to me so mixing it with the water may be better-- i don't seem to have any aftertaste in mouth yet either-- i feel fairly well this morning- headache is gone just a little tired and nauseas-- i also got my wig yesterday - the clinical trial study nurse gave me a $150 off coupon for one so i went right after treatments to have it fitted-- i've heard about the program you've mentioned before \"ACS Look Good Feel Better\" but i'm not sure where i can locate it-- can you help me out there? i was told about another program \"cancer fund of america\" that helps with supplies such as boost and such but they said they are no longer taking apps until 1st of year-- i'll def. check with american cancer society about that book as well-- your suggestions are greatly appreciated! God Bless and hugs, Christy",
      "MessageIndex": 7,
      "PostDate": "03/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Cchristymike",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cchristymike",
      "Content": "thank you Nancy for your input-- i am very blessed to have prayers said for me-- i need those most of all-- again, thank you for your reply and God Bless!!!!!!",
      "MessageIndex": 2,
      "PostDate": "21/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Cchristymike",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cchristymike",
      "Content": "I'm a 36 yr old stay at hom mom of 2 girls- 9 and 4 and about 5/6 weeks pregnant-- i just received a diagnosis of breast cancer yesterday after having an excisional biopsy done last week-- it is being recommended that i have my entire left breast removed due to the location--it looks to be stage 1- i'm looking for any input from anyone that can give me info on this and support-- i'm terrified of what treatment options my do to my unborn child and i'm also afraid how my girls will handle this stress-- i currently have no insurance and was just approved for medicaid due to this diagnosis-- i'm in complete shock and feel myself sinking in a depression--i am terrified- thank you!",
      "MessageIndex": 0,
      "PostDate": "17/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    }
  ]
}