{
  "AuthorID": "CelerySisters",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CelerySisters",
  "Posts": [
    {
      "AuthorID": "CelerySisters",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CelerySisters",
      "Content": "Hi, I am writing because yesterday my 25 y.o. sister was told by her oncologist to \"prepare for a cancer diagnosis.\" We are many states away from one another and all I want to do is fly out to be with her right now but I have a husband in law school and three children at home, so I have to wait another week before I can get out there. She is so afraid and has so many questions, but she was so overwhelmed by this news that she didn't ask any questions while she was in the office and isn't scheduled to go back until Monday. She had a needle biospy done yesterday. I'm not sure of all the logistics of this (I have zero knowledge of cancer, we have no family members who have been touched by the disease thus far) so forgive my ignorance. In front of her, they put the specimen in some kind of solution and told her that if it floated, it meant that it was \"fatty deposits/cysts.\" Well it sunk.  My question is how likely is it that it can still be a cyst? The oncologist did not give her a good vibe when he said, \"Prepare for a cancer diagnosis.\" Words of knowledge or advice from anyone with experience with this would be greatly appreciated. My sister is just so petrified. She has a 10 month old baby girl. Thank you for listening.",
      "MessageIndex": 0,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22920,0.htm",
      "Title": "25 y.o. sister told to \"prepare for cancer diagnosis.\""
    },
    {
      "AuthorID": "CelerySisters",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/CelerySisters",
      "Content": "Hello and thank you to everyone who replied. I just thought I would update that she is cancer free! That was the happiest news of our lives. They are still unsure what the \"growth\" is. They are calling it that - a growth. It's not a cyst or a benign tumor. She has had two more biopsies. They're uncertain at this point if it will be removed or not.   Thank you again to everyone. ",
      "MessageIndex": 5,
      "PostDate": "26/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22920,0.htm",
      "Title": "25 y.o. sister told to \"prepare for cancer diagnosis.\""
    }
  ]
}