{
  "AuthorID": "Charis",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charis",
  "Posts": [
    {
      "AuthorID": "Charis",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charis",
      "Content": "Dear Fatima, I think i can try to imagine your fear as I have had 2 mastectomies 6 surgeries,chemo, radiation.I am 46 now. My mom may be facing lung cancer but she won't talk to the doctor to get the results. It has concerned me but i finally realize that I cannot tell mom what to do with her body. I also have a strong relationship with Christ Jesus, I read Psalm 139 and Psalm 112. I will pray for you. A good website is World Prayer Team(REAL Time) free to sign up! Praying, Karen",
      "MessageIndex": 1,
      "PostDate": "20/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4147,0.htm",
      "Title": "Scared...how to Have Hope...."
    },
    {
      "AuthorID": "Charis",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charis",
      "Content": "Dear Lou, I too had similar things happen. After a mastectomy I found 2 lumps and my doctor said ,\"That is not cancer, just due to your implant.\" I waited 5 months and went to my plastic surgeon. He disagreed with his colleague and he took them out. Invasive ductal carcinoma. I found out by my new surgeon that it was always on the original MRI!The original doc. could not read my MRI. God is so good. He will lead you to the best docs as you listen and watch Him engineer circumstances in your life! I have great treatment now. After major chemo and radiation 9 months ago ,I have no cancer.More hair than ever too! In Him, Karen Psalm 139",
      "MessageIndex": 9,
      "PostDate": "31/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1780,0.htm",
      "Title": "Diagnosed 2 Weeks Ago"
    },
    {
      "AuthorID": "Charis",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charis",
      "Content": "Dear Gavin, I can understand the fear and concern that you are going through. There is no definitive proof that even if you and your sister matched the BRACA genes of your relatives that you would ever get the disease. Usually doctors start tests like mammograms when people are in their 30's. I am a survivor of breast cancer and it has been 4 years. I am learning to trust God with my health and my doctors. I pray that you will have peace in the midst of these trials. Karen",
      "MessageIndex": 1,
      "PostDate": "12/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5069,0.htm",
      "Title": "Worried 14 Year Old"
    }
  ]
}