{
  "AuthorID": "Charmaine_Marie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charmaine_Marie",
  "Posts": [
    {
      "AuthorID": "Charmaine_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charmaine_Marie",
      "Content": "Dear Laura - I agree with your other respondents that aromatase inhibitors (AI's) generally have bad side effects, I think mainly because these drugs reduce our estrogen levels to almost zero! I was changed from tamoxifen (not an AI) which suited me well, to Aromatase (similar to Arimidex), and two months later I started experiencing joint pains, also swollen fingers and feet, and sore wrists (couldn't open jars or bottles). Eventually my knees and ankles were so painful I couldn't climb stairs.  I persuaded my doctor to change me back to tamoxifen a week ago.  Already I'm feeling like a new person, although my wrists are still weak.  I'm also taking a calcium citrate + vit D supplement to build up my bones. As far as I know, AI's were originally intended for women who did not respond to tamoxifen - now it seems EVERYONE who has reached menopause is prescribed an AI. Discuss this with your doctor - there may be a valid reason for you to be given Arimidex.  Good luck!",
      "MessageIndex": 4,
      "PostDate": "15/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13254,0.htm",
      "Title": "arimedex"
    },
    {
      "AuthorID": "Charmaine_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Charmaine_Marie",
      "Content": "  On 5/20/2007 Kittycath wrote: I was diagnosed in July 2004--very early--not in lymphs--no chemo--only radiation.  I took tamoxifen from July 2004 until July 2006.  My doctor put me on aromasin (the usual protocol, I am told).  I HATED the aromasin--I have NEVER experienced such joint pain, swelling, fatigue.  I told the doctor about and he put me back on tamoxifen.  I got the feeling that it really wasn't all that necessary to be on Aromasin--tamoxifen is adequate.  Then I have read differenct things on the internet that scare me--aromsin and arimadex are important to take after using tamoxifen for a while.  Golly, I hope I am not doing something stupid.  Does anyone out there feel totally comfortable just sticking with tamoxifen???? Yes yes yes!  I was diagnosed in March 2004 - also early (Stage I), not in lymphs, but had a mastectomy and chemo (just in case) followed by Tamoxifen until Jan 2007. No problems except hot flushes (which I was having since chemo anyway - enforced menopause). Same story as you with Aromasin. I started researching the IES trial which promotes Aromasin over Tamoxifen, and decided that especially for low risk cases, there is probably very little advantage.  The results of the trial were presented in a very general way (they did not give individual results for different risk levels and included high as well as low risk cases).  The relative advantage of Aromasin over Tamoxifen is actually less than 5% for the combined risk levels, hence my suspicion than it would be even less for low risk patients like us (of course never say never). I eventually persuaded my doc to change me back (two days ago) and already feel like a new person. Don't let the scare tactics get to you - as long as you keep to regular check-ups and lead a healthy lifestyle - I believe in quality of life.  Kind regards Charmaine",
      "MessageIndex": 5,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12012,0.htm",
      "Title": "Aromasin pain"
    }
  ]
}