{
  "AuthorID": "chatty55",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
  "Posts": [
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "Linda:  It sounds like some hormone situation could be causing your breast to be sore and tender.  But not being a dr. it is a wise thing to get a mammogram.  We know that you don't have to have any symtoms to have breast cancer but anything out of the ordinary is cause for concern.  Especially with your family history.  Let us know how you made out after your mammogram.  Prayers coming your way.....",
      "MessageIndex": 1,
      "PostDate": "03/03/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,56361,0.htm",
      "Title": "what's wrong with me?"
    },
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "its been a little over a year since I lost my dear sister, and you are right the missing is never ending. I wanted her to let go after fighting so hard and seeing her like that but when she was gone I didn't know what to do with the pain.  The sadness in losing her is still inside but knowing she is in a better place and at rest from her suffering and time has lessened my pain to tolerable now.  Maybe that is as good as it will get......",
      "MessageIndex": 4,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38860,0.htm",
      "Title": "the battle lost...now what"
    },
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "I take my Arimidex in the middle of the day with lunch.  It has never really been a problem with sleep except when I get bad hot flashes, which hit often night and day.  I cannot go back to work also.  I have bad joint pains and I also had arthritis before taking it, but I am getting thru with this. For me, it is the fatigue that I am experiencing which drs. tell me thru tests that everything is fine.  I want to be fine, I want me back, I was always extremely active and energetic. Have you also experienced this? Sharing our experiences, ideas and treatments on CC can maybe help us all. Blessings to you.....",
      "MessageIndex": 3,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61211,0.htm",
      "Title": "Arinidex - any difference with side effects if taken in morning or before bed?"
    },
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "I am hoping this gets to you before your surgery.  I too had a wire put thru my tumor and dye shot into my breast before surgery. I have to be one of the biggest weenies about needles.  It was quick, the dye shots, and know that once it is done, the rest you are put to sleep for. I was scared like yourself, but amazed how much and how well we take this and move on.  Blessings that you get this surgery behind you and start your journey to getting well with positive news.....",
      "MessageIndex": 5,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62641,0.htm",
      "Title": "Surgery tomorrow, nervous"
    },
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "I have been taking Arimidex for 7 months, suffering from the normal joint pain and shortness of breath.  The fatigue is the most profound side effect so my doctor has switched me Femora.  I have not read much on this medication, would like to hear from anyone their experience and side effects with this drug.  Blessings to all going thru cancer and the horrible treatments to fight this evil disease.",
      "MessageIndex": 0,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59589,0.htm",
      "Title": "Side Effects on Femora"
    },
    {
      "AuthorID": "chatty55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chatty55",
      "Content": "On Nov 04, 2011 3:27 PM platopotato wrote: Hi Anyone else taking this drug? Have been on it for 1 month aching like hell thinking of stopping so fed up with all these chemicals,any advice welcome! Hello!  In response to you question about Femara and aching joints, I take generic Arimidex, have been for a year now.  The first couple of months I too had aching and pain.  I had some arthritis in my hands before taking it but never had all over joint pain like that.  I never thought I would be able to stick with it either.  I get massages every other week, walk and go to a heated pool a couple of times a week and that has not taken away the pain but made it bearable.  My sister died from breast cancer and I am trying to stick with my meds for any help I can get but I agree all these chemicals to \"help\" us is at a great price.  Try to stick with it for a couple of months if you can.  You might find out like myself you can get it bearable.  Prayers and good wishes to get thru this treatment, alot of us do understand what you are going thru.",
      "MessageIndex": 1,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62756,0.htm",
      "Title": "femera/aching joints and muscles"
    }
  ]
}