{
  "AuthorID": "Chavagirl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chavagirl",
  "Posts": [{
    "AuthorID": "Chavagirl",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chavagirl",
    "Content": "On May 07, 2013 12:22 AM SpringFlowers wrote: So good to hear your daughter getting great results with the alternative - me too.   I was told i'd be \"lights out\" as of Nov. 2011 - here it is May, 2013 and I am in great health, still Stage 4 BC, but all stats, bloodwork perfect and my tumor markers are all UNDER the normal readings!  I feel good, no fatigue, no pain.  I was DX'd w/BC in Jan/2011 after having a mamm only 14 months earlier and told all A-ok, then find I am Stage4, mets to thyroid, basal cell, liver, lungs, ribs, spine and pelvis.  I had completely eradicated ALL tumors in the soft tissue, liver, etc, by Sept 2011 using Alternative.  Now even the bone mets are slowly disappearing.   It can be done.  I had to use some powerful ingredients, lost my voice for awhile, but returned in 6 mo's, a small price to pay for the overall results.   I get lots of grief from lots of people for going alternative, but I was given no hope and here I have saved myself.  I have had NO chemo, NO radiation.  I have read over 50 books on cancer, got stats from NCI, what i've learned turned my stomach.  Cancer is a money maker for the pharm co's and hospitals, and....sadly, there is a cure, but to use it would close the doors of most hospitals.  I personally could care less what people say to or about me, I am alive, in great shape.  Even my doc finally admitted, yes, we can only do what is \"protocol\" - one size fits all, paint everyone with the same brush from the same paint can....it just doesn't work.   I've got the stats, for every cure from chemo, there are 67 bodies that fail from treatment.   Most cures are Stage 1 & 2, go to Stage 3 & 4, the cures are very far and few between.....and, from my viewpoint, you can cure 1 & 2 with alternative quite easily.   So stay diligent, it's worked and still working for me.   I pray enlightment will reign over monetary gain; but, I don't hold my breath, I know human fraility is easily swayed by the powerful.     Ck out U-Fn, DIM and of course Curcumin, add to her regimine, also remember cancer is anaerobic, not bacterial or viral, so get on a good diet, avoid the sugar - yes, avoid the sugar, it feeds cancer and don't let anyone dissuade you.  Avoid milk, soy and glutemates.   Add prayer in abundance, it is quite powerful.  Blessings to you.I hope that you will get this message in time. My older sister Karen was diagnosed with stage 4 breast cancer 8 yrs ago. We thought we had beat the beast! We have went on cancer survival walks together ( 4 sisters). She is a 20 yr RN thy works with critical patients daily. All along not knowing that she was just as critical. She is married to a great man of 14 yrs. and they had children late in life so their children are Ashley 13 and wesley10. Three weeks ago my sister went to her regular doctor complaining of aches and low energy and her blood pressure was over the roof. They ran many extensive test and after her Pet scan they come to her room and tell her that her cancer is all in her body. They said she lit up like a Christmas tree! How devastating to here that kind of news. Her husband was with her but I know that she was totally broken. You see three of us sisters are very close and the other is only close to two of us. Even this tragedy has not swayed her into making a mends with our other sister. So we all live 5 hrs from our sister Karen. She cries every time we leave to go home. She stays there because they built a new home there and they even built homes on their land for her husbands sister and mother. So she has no alternative then to stay there alone more or less without her father or us sisters. Her husband truly believes in the normal medical approach to her disease. He acts as if he is upset but does no research and listens to every word of their hillbilly doctors. We have begged that she go to another cancer center or a top cancer hospital at least but he just says that their insurance won't cover it. I have done a lot of research on alternative methods and I read your post and I felt the need to message you in hopes that you can help us or guide us to someone or something that can before its to late for her! The doctors she has now won't give her any information on her disease. I asked her many questions and she only tells me that they have not told her anything. Unbelievable! How can they just not tell her anything and just tell her what needs to be done and that's it! I've heard that apricot seeds and apple seeds taken daily can heal cancer. I have also heard that there is a liquid that you can drink like tea called eissac. Also that sugar feeds cancer. I know that she needs to go on a specific diet but from morning to night , what should her daily regimen be? Is there a trust worthy facility or doctor that you can recommend to us? If you could give me a specific plan for her day then I assure you I will help her abide by it! Her life is in jeopardy now. So many people I. Our family is just dragging their feet and procrastinating on what needs to be done! Well I want to get started now! My sisters life depends on our swift actions. It upsets me so much that the other members of our family say they are gonna help and talk about alternative medicine and other facilities she needs to go to but those are just words! There is no action in words. I have took it upon myself to research and reach out to anybody or anyone that can help me to help her. I don't want to wait and I can't leave her life in the hands of her uninformed husband who does zero research and only listens to her hillbilly oncologist team for all the answers! I don't want to step on his toes but if I have to to save my sisters life then I will. If I don't I am sure no one else will step up to the plate to save her life. I'm sure I sound like I'm just rambling on and on and not getting to the point and I'm sorry for that. I am just so hurt right now! No one else wants to actually help her. They all say they do and act concerned but where is the freakin action in those words. There is none. If I don't get some help from someone out there or some specific guidance then my sister will die. Just like so many other beautiful human beings have already because no one stuck their neck out to get the right kind of help for their disease. Here is all I know about my sisters diagnoses. She has a tumor in her brain that they are doing a 3 week radiation treatment on her whole brain, not just the tumor. She has it in her neck and down her spine,hip bones, chest walls, liver and lymph nodes thru out her body. She was stage 4 breast cancer to begin with 8 yrs ago. She had a mastectomy and 15 lymph nodes taken out at that time plus a full hysterectomy to be safe I guess. She had her breast reconstructed 3 yrs ago. She was very active and has always ate healthy food. She also had the lap band surgery I would say 6 yrs ago so she has lost a lot of weight( maybe 70- 80 lbs.). I don't know a lot about her breast cancer. I just know it was stage 4 and in one breast and she had 15 lymph nodes taken out as well. She did the regular routine with that. ( surgery, radiation, chemo) I don't know about hormone therapy or other medicines she took but I know she took different cancer meds as well. Now she has just finished a 3 week radiation treatment targeting her whole brain for her brain tumor. She is on prednisone, strong pain meds. I'm not sure what else but I can find out if I need to. All of her hair has fell out already ( which was so hard for her again). She always says she's so weak and tired and in a lot of pain. They said she couldn't take any vitamins anymore so she stopped her vitamins. She is in a very stressful environment. Mainly because her children stay in the house and make messes and screams and yells all thru the house. I have told them while I was there for weekend visits that they have to stop yelling and stressing out their mother but even though they agree to be better nothing changes. Her husband at times ,wrestles and runs thru the house and plays with the kids as well when she's trying to rest and have some peace and quiet. So she is under a lot of stress right now but the children have been helping when she asked. She is drinking water like a fish. She puts washcloths on her head and she gets hot flashes quite often. She also gets very short of breath. So she can't do much. She has been trying to walk around the house because she knows that if she just sits there than her disease will take her completely. We were all raised in a Pentecostal home all of our lives so we believe that our Heavenly Father can heal her completely. But God has also gave us a brain to use so that we are able to make the appropriate decisions. I pray someone or you if you find it in your heart to help me with this journey my sister is taking. She will soon be taking her chemo because she just finished her radiation (3 weeks daily ). She said she was taking a break so I hope I can convince her to take another route for her healing process. If you or any one can get back with me as soon as possible I would greatly be appreciative. You could be saving her life. I'm sorry for dragging on so much but I'm not in my right mind right now. I'm sick with worry and I spend every waking moment writing and researching and praying for my dear sister. Surely this is not Gods plan for her life. She has so much more to share with this world. She has people to care for thru her work, home and even her animals. We all need her. I pray you or someone will help me or guide me to what I need to do or help her with. I am her eyes, hands and brain right now because she can't even get on the Internet or read much because she's so tired. So I have to do this for her. If you love someone or even if you don't we should all do whatever we can do that is humanly possible. I pray to you Lord that this message reaches someone who has the key to my sisters healing! Thank you and may God Bless You all with good health and much faith in the journey you endure. My email is chavagirl2014@yahoo. Com. Please respond by Email because I may not get your reply otherwise and I don't want to miss a thing. Tami Hernandez. Indiana/Kentucky area.",
    "MessageIndex": 25,
    "PostDate": "26/09/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71570,0.htm",
    "Title": "how long does a person survive once cancer has spread into different parts of the body"
  }]
}