{
  "AuthorID": "Chickenlittle",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chickenlittle",
  "Posts": [
    {
      "AuthorID": "Chickenlittle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chickenlittle",
      "Content": "Paulette, Please as hard as it may seem, continue your treatments. I was dx w/breast cancer and went through 8 rounds of chemo. 4 adramyacin/cytoxin and 4 taxotere. The adramyacin did zap my counts and I had to get nupagen injections along with procrit injections to keep up my strenth and get through it. My lymph nodes were also involved. It is like an extra step in making sure that if one of those tiny little cancer cells spread it will get it and destroy it. It is tough no doubt about it, but you can and will get through it.",
      "MessageIndex": 6,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1512,0.htm",
      "Title": "Chemo Treatments"
    },
    {
      "AuthorID": "Chickenlittle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chickenlittle",
      "Content": "I was dx w/breast cancer in June 2004 4 days b-4 my 40th birthday party. I was never one to question why, so I did the chemo, mastectomy, radiation and it is now March of 2005. 9 months of going through all this and what now? Is anyone out there having lingering pains and body aches? I am an avid excerciser and it frustrates me to not be able to do the things I was able to do. My feet were numb from the neuropathy and I had stress fractured my foot and didn't even know it. I thought I would have some revolation or epiphany after this was all over, but I just want to have some sense of normalcy, but what now is considered normal?? Please tell me your thoughts and expierences so I may know that this phase of after bc is going to end and the frustration will fade. chicken little",
      "MessageIndex": 0,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1665,0.htm",
      "Title": "What Now?"
    },
    {
      "AuthorID": "Chickenlittle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chickenlittle",
      "Content": "I have just been through breast cancer. I was stage II with it spreading to my lymph nodes. I went through chemo, mastectomy and radiation my nodes were removed and 2 out of 9 had miniscule reminants of cancer. So here are the answers to your questions. 1. I have never asked why me. Cancer is not picky. it seems to choose anyone for any reason and I would drive myself crazy if I raised that question to myself. 2. After I was finished with my chemo I swore I was going to make miraculous changes. eat better, excercise more, watch my weight, no red meat, but then I said......Oh I do that now. I have become more aware of people's feelings and sympathize more with people who have disabilities. Staring for any reason makes a person uncomfortable. 3. The most important was the compassion for others and life. When people can't choose what happens to them it makes you feel less of a person and more vulnarable to the outside world. 4. The meaning of my illness is that it is true what they say.....beauty is only skin deep. what u look like on the inside is much more important. chicken little",
      "MessageIndex": 4,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1582,0.htm",
      "Title": "A Meaning to Breast Cancer"
    }
  ]
}