{
  "AuthorID": "Chips_mom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chips_mom",
  "Posts": [
    {
      "AuthorID": "Chips_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chips_mom",
      "Content": "I agree with the second poster.  I'm 51 years old and I had a bilateral mastectomy in March 2008.  If my cancer recurs I'm done.  I've made my contribution with tons of biopsies and breast amputation.  I would think the stress on a 95 year old person would very great going through any medical procedure.  At this point in her life I think she would be better off to forgo the trauma.  Can you imagine a person at that age going through chemo and radiation?  That would be the last thing in the world I would want at that age.  Just let her live her life in peace.  Medical intervention does not always lead to good things.",
      "MessageIndex": 2,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38148,0.htm",
      "Title": "Question about my grandmother - she's 96."
    },
    {
      "AuthorID": "Chips_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chips_mom",
      "Content": "I had a bilateral mastectomy in March 2008 with no reconstruction.  My chest is still hurting me alot after nineteen months.  I can't imagine the pain women must go through having expanders put in and stretching the skin for implants.  Is there anyone out there who would not do reconstructive surgery if they had it to do all over again?  I'm not really thrilled about being flat chested, but was afraid to have reconstructive surgery as I thought they'd keep finding things they wanted to slice and dice on with the reconstructed breasts.  I also wondered if the reconstructive surgery is mainly for looks.  I would guess the normal sensations that the breasts previously had would be gone.  I don't think they educate women very well on what to expect following a bilateral mastectomy.  It seems you get to live the nightmare after the surgery is over.  I would think getting a nipple tattoo would be very painful, but really have no idea on that.",
      "MessageIndex": 9,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40589,0.htm",
      "Title": "Nipple reconstruction...to do..or not to do???"
    },
    {
      "AuthorID": "Chips_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Chips_mom",
      "Content": "I was wondering if anyone on the forum has ulcerative colitis and were being treated with the drug Remicade.  It has been recommended to me since oral drugs aren't helping the colitis.  The side effects look serious and I wondered if any breast cancer patients were taking it.  It's given iv infusion every 6 to 8 weeks for life. ",
      "MessageIndex": 0,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41617,0.htm",
      "Title": "Breast cancer with ulcerative colitis"
    }
  ]
}