{
  "AuthorID": "chrisandlorie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrisandlorie",
  "Posts": [{
    "AuthorID": "chrisandlorie",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrisandlorie",
    "Content": "My case is a little bit different. I was the one who was told by the doctors, that my husband had Esophagus Cancer. I had to tell him. Neither of us was expecting this. So, like your husband, I too am living it. I know its in him, but we are as one, just as you and your husband. How I approach it when we discuss it, Is \" They have diagnosed US with Cancer.\" (First of all We never claim it as we have it, just that they have diagnosed us with it) just because GOD Said, what you speak is what you will get, speak good things as well as life over you both, so you may receive. Don't claim any disease or bad thing that someone says you have, as your own. Anyways, back to both of you. When you married, you became one, so what you feel, your husband is also feeling. When your scared, he is scared. You both know each other well enough now that you both react off of each other. You know when something is wrong with him, and he you.  I personally think you both need to talk about it. Some things are hard to talk about, so with men, they tend to not want to show their feelings, but there comes a time they need to or feel that they need to. What Chris and I did, at first was took our thoughts and wrote them on paper, what I call Mad Writing. we wait till the next day and go read each other's writing if permission is given. This does two things, first and foremost, it gets the bulk mess out of your head, as if you are telling someone and trust me you feel better. Another is, if permission is given, it lets the other spouse know, what you are feeling, but no emotions or hurt feelings. It gives the other person time to grasp what the other is feeling. Also, when talking together, one might not really share their true thoughts. Men think they are supposed to be the strong ones, and when they are not they feel like they have failed. The writing really works, even if you don't share with each other, but much more beneficial when you do, Because when you reflect on what they are feeling, you learn automatically what to approach now and to wait on until you fully grasp the right approach. It will make you stronger and more together on this. This is my thoughts, and I hope you and your husband overcome what the doctors are saying. I wish you too another 30 years of wonderful marriage.  Lorie",
    "MessageIndex": 3,
    "PostDate": "07/04/2013",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71214,0.htm",
    "Title": "Husbands"
  }]
}