{
  "AuthorID": "chrystalhill",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
  "Posts": [
    {
      "AuthorID": "chrystalhill",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
      "Content": "On Mar 05, 2013 3:47 AM salina wrote: I will share my experiences and knowledge. I remember being on one of these sites seven years ago couldn't believe how cheery and beyond joyful posting were I now understand that experience can give you a different look at what you are posting for newbies..... its scarey however no question or emotion should be denied, sometimes i still get alittle mad however it passes i am blessed to share so women after me have more tools and questions for their specialist. I was just diagnosed with invasive ductal carcinoma and DCIS in the right breast.  The mass tripled in size after the biopsy.  I have read about Protocel and started using it but am wondering if I should just get a mastectomy.  After reading some postings on this site I realize there is so much about mastectomy and reconstruction I do not know about.  Can you share your knowledge with me?  I'd appreciate it.",
      "MessageIndex": 1,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70755,0.htm",
      "Title": "I will help anyone who wants to talk"
    },
    {
      "AuthorID": "chrystalhill",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
      "Content": "On Apr 25, 2013 3:19 AM Nicole.H wrote: I am a college student, 24 years old, and my Mom was daignosed with breast cancer last Thursday, the 18th of April. This will be her third time having it, but this time is so different.... It's stage 4, incurable, and has spread from a lymph node between her lungs to her right ribs. I wasn't alive for the first bout with it; that would be what caused early menopause, and the reason that I am adopted. The second time, I was 12 and 13, in eighth grade, and my Dad died of Hemochromotosis two months after my Mom finished her Chemo treatments.... I've essentially been taking care of my Mom since I was 13. I don't know what to do right now, though. I feel so alone; we moved to a different state, and we don't have any family --that counts as close family-- here, and all of our family friends and our support system are back in our home state.... My Mom is talking about how she won't see me graduate, or get married, or see any of her grandchildren; tomorrow we're going to meet with an oncologist who is going to tell us what we can expect, including life expectancy.... My Mom is a tough cookie. She was given 5 months last time, and is still going, and that was about a decade ago. But she's in such a depression, and I don't know how to help her. I don't know what I'll do if I lose her.... She's trying to teach me how to run her business so that I can have some sort of income while I'm still in school. Everything has such a final sort of feeling to it, that I don't know how to cope. My head is reeling, and I'm trying to keep up with my classes and manage my Mom's clients and inform our family and friends about the situation and make her doctor's appointments.... I know that there are people who do this every day, and I can't even express the respect I have for them.... I am in awe of their strength. I've been trying to find mine.... I've been trying to keep a happy face on for my Mom, and not cry around her, and not freak out or have a mental breakdown.... I keep bottling up everything that I am feeling, for lack of any coping mechanisms. I need advice. I need help. I need to know what I should be doing, and what I can do to help her.... Please.... Help me? I know the feeling.  I have invasive ductile carcinoma of the right breast.  I am using Protocel as my treatment.  There are lots of people who have used Protocel and beaten the cancer.  Read the book Outsmart Your Cancer and maybe The Breast Stays Put.  God Bless you.",
      "MessageIndex": 19,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    },
    {
      "AuthorID": "chrystalhill",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
      "Content": "On Jun 06, 2011 2:06 PM RachelKickAss wrote: Hi  I have just been diagnosed with Metastatic breast cancer and have started xeloda (capecitabine) so far no side effects.. fingers crossed that continues : ) but I just wondered if there is anyone else out there in the same/simular situation?! I was 23 when I was first diagnosed with Breast cancer which responded well to treatment however I had local recurrance last year later which once again appeared to respond but now its back again...  be good to get any advice, alternative suggestions or generally anything that may have helped you or is helping you Rachel x I have invasive ductal carcinoma of the right breast.  I decided to use Protcel for treatment.  There are lots of success stories about Protocel eliminating cancer.  Try OutSmart Your Cancer book and The Breast Stays Put.  I am also looking for someone who is currently using Protocel to contact me.  God Bless you.",
      "MessageIndex": 5,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59842,0.htm",
      "Title": "26 and have Metastatic Breast Cancer to Lung"
    },
    {
      "AuthorID": "chrystalhill",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
      "Content": "On Jun 10, 2003 12:00 AM Yvonne_P wrote: I am in remission from breast and uterine cancer taking the drug Tamoxifen for three years now. I sincerely try to follow a good nutritional cancer diet and am taking the recommended supplements. Also try to get an adequate amount of walking. Every ache and pain scares me. Is cancer coming back somewhere else in my body? Wish there was a test to tell if there is cancer starting somewhere. I have resumed my life style as before except for the never-ending concern of a new cancer popping up. What more do I need to do to keep this awful dread away? Yvonne I would suggest you read Outsmart Your Cancer.  Especially the chapters on Protocel.  There are often small metateses that do not show up on scans and the Protocel would take care of them.",
      "MessageIndex": 5,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,704,0.htm",
      "Title": "In remission. What more can I do to keep cancer free?"
    },
    {
      "AuthorID": "chrystalhill",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/chrystalhill",
      "Content": "I also have DCIS and Invasive Ductal Carcinoma in the right breast.  Although the doctors scans say i dont have any metastises I have read that many small metasteses arent caught on scans.  I have read Outsmart Your Cancer and have elected to use Protocel for treatment.  I will have a Mastectomy probably but will continue the Protocel to be sure any metasteses are taken care of.  You might want to consider this.  God Bless You",
      "MessageIndex": 2,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71627,0.htm",
      "Title": "Ductual Carcinoma in Situ."
    }
  ]
}