{
  "AuthorID": "cisforcat",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cisforcat",
  "Posts": [
    {
      "AuthorID": "cisforcat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cisforcat",
      "Content": "Hello. I wanted to have this procedure done five years ago, but that's another post. I want this procedure myself.  I want a Prophylactic Mastectomy, meaning both breasts, of course; due to A Typical Hyperplasia in both breasts, dense tissue, and DCIS lumpectomy five years ago. Even though  BS got the clean margins, I wanted this procedure instead due to my risk factors, he refused, he said it was too radical. I should have gone to another surgeon, I know this now. Microcalcifications are back and now I need more biopsies.  Fantastic, I know.  If she can find a doctor to do this skin sparing and sometimes nipple sparing mastectomy, I would tell her to go for it. I've done a lot of searching and reading, studies are showing that it's just as effective as the \"conventional\" tram, and other mastectomies, with no scars, unless you've had multiple biopsies, etc.",
      "MessageIndex": 1,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,56802,0.htm",
      "Title": "Skin saving, one step reconstruction after bilateral mastectomy"
    },
    {
      "AuthorID": "cisforcat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cisforcat",
      "Content": "On Mar 26, 2011 3:03 AM breastcancerh8r wrote: Haven't been on here in a long time... things are going okay here. It's been a little over five months since Mom died, and I think we're finally accepting that this IS how our life will be from now on. I made varsity soccer (as a freshman!) and I'm really excited about that. My little brother and sister start their seasons tomorrow too. My sis made it in the summer community play, and my brother got elected class president awhile ago... but I'm sure you guys don't really want to hear about all that do you?   I was wondering if anybody had more information on the passing of the breast cancer gene. How you test for it, how you can get rid of it, the chances of getting it. I have a 50/50 change of inheriting it from my mom. I can honestly say the thought of getting it doesn't scare me... the thought of passing it on to my kids someday does. It's so strange now, never hearing the words \"chemo\" or \"rads\" or \"clinic\" around the house. I wouldn't call it nice... growing up with cancer, you just kinda get used to it, you know? Mom was diagnosed when I was four, so I never knew any different. Oh well. I'm just praying that if one of us three kids gets the gene, it's me. Hi, I loved hearing that you made Varsity soccer :)  as a Freshman!  I'm excited for you!  You all sound like you're doing so well, your mom, would be so happy.  I can't imagine how strange it must be.  I don't know how you're feeling, but you sound very grown up, way too soon, *big hugs*  Life is so unkind, so unfair.  I have to be tested for my own daughters, too.  So your post caught my eye.  I know it's a blood test.  My cousin's came back negative, of course I hope your's and mine do too.  You and your sister's. I'll be praying none of you have the gene.  Blessings and know that your mom would love that her kids are doing so well in school!  :)    ",
      "MessageIndex": 2,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,57042,0.htm",
      "Title": "Breast Cancer Gene"
    }
  ]
}