{
  "AuthorID": "Cjewell606",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cjewell606",
  "Posts": [
    {
      "AuthorID": "Cjewell606",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cjewell606",
      "Content": "Sorry about the misspellings I'm just crying & very heartbroken",
      "MessageIndex": 1,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68973,0.htm",
      "Title": "Breast cancer stage4"
    },
    {
      "AuthorID": "Cjewell606",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cjewell606",
      "Content": "My aunt whome riser me since she was 13 was diagnosed 3 years ago with stage 4 breast cancer .She had mammograms every year they just happened to miss her tumor which grew out of control and p spread to her liver & possibly bones.They said it was missed due to the fact he has dense breast tissue.She was 42 years old.The first time around she had over 22 rounds of taxol. She tolerated it fairly well and pressed on and her over a open liver I more shrank and disappeared. Now since August she had some tumor marker tests come back not so good & is having t o do more chemo now a new kind she is not tolerating well.(she is estrogen positive btw) now she is on the new chemo having severe chest pains every Thursday (she has chemo on Mondays) Thursday Is a very hard day.I can't think of the chemo I'm thinking its -DOCETAXEL- she has also had monthly Iv's of meds for her bones. She said they want her to take this chemo as long as she can stand it.And that due tote side effects she can't take it anymore.iam at a loss for words I can't fathom the thought of losing her she is like a mother to me and my 1year old daughters grandma.I fully understand she doesn't want to spend the time she has left sick but of course her family loves her & wants her to fight this. Is there anything else that we can try? Another better chemo? Or chemo with less side effects that anyone's had positive results with stage 4 estrogen positive breast cancer??? Or is surgery for her liver a possibility? Or radiation?? I know it's selfish of me to want to keep her with us for as long as possible but I don't thinki can go on without her here.therev just has to be something else we can try.I know se has suffered she has terrible neuropathy swelling, she developed a blood clot and is on blood thinners since taxol.Any success stories or suggestions? Please I can't let her give up te good fight just yet, I just lost my uncle & another family member to cancer.Why is this disease so horrible and unforgiving, she isa good Christian woman the best person ive ever met & it's just not fair.",
      "MessageIndex": 0,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68973,0.htm",
      "Title": "Breast cancer stage4"
    },
    {
      "AuthorID": "Cjewell606",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Cjewell606",
      "Content": "I meant (over a dozen liver rumors shrank & disappeared)",
      "MessageIndex": 2,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68973,0.htm",
      "Title": "Breast cancer stage4"
    }
  ]
}