{
  "AuthorID": "claireship (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "claireship (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I had stage3 ductal carcinoma with lymph gland involvement. I had 6 cycles of chemo followed by surgery and radio therapy. Also have had 8 lots of herceptin (tramuzetab) with 12 more to go and am now taking tamoxifen. I now find that all my cartilage ,knees, hips, hands, shoulder etc is clicky and sore and GP says something may have caused it to dry out. Has anyone else had this side effect and if so do you know which of all the stuff you were given caused it. If it is the herceptin I may consider stopping treatment as I am only marginally suitable for it anyway. Help! Struggling to walk up and down stairs now and was really fit even after chemo!",
      "MessageIndex": 0,
      "PostDate": "08/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,50124,0.htm",
      "Title": "Cartilage drying out/losing elasticity as side effect"
    },
    {
      "AuthorID": "claireship (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Jul 29, 2010 2:31 PM SissyD wrote: I went to the Doc Monday, Told her you know how I 've been complaining about my left breast area bothering me for months now? Well I think I feel something on that breast now (a knot or lump) so she feels, and then says to me, even though nothing showed up on the mammo it did show dense breast I do feel a mass so I want to get you a Biopsy next Tuesday I said o.k. So my question for you more experciensed what is my chances here? I'm really worried. I had similar experience and was diagnosed with breast cancer last November. At this stage all I can suggest is that you take someone with you for the biopsy and when you get the result as if it is bad news you need someone calm to make notes and ask the questions you will forget to ask. Hopefully  you don't have it and will be fine. I have had the whole thing thrown at mine, chemo, surgery and radiotherapy and now herceptin and tamoxifen. If you get bad news I can talk you through the process as I experienced it.  good luck, stay in touch.",
      "MessageIndex": 2,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49853,0.htm",
      "Title": "Going for first Biopsy"
    },
    {
      "AuthorID": "claireship (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Oh don't be so cross with your mum, she is probably terrified. I have just gone through chemo, surgery and radiotherapy for breast cancer and it is a really really long and horrible journey. I am 49 and was really strong and really fit when diagnosed and at various stages I was completely floored by it all. There are loads of nasty side effects to deal with and she will need all the help you can give her. Be nice and always be positive with her about what is happening in your life. Because ,trust me, she really will not be able to fight the disease is she is still doing the mummy thing and worrying about you.  ",
      "MessageIndex": 3,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49589,0.htm",
      "Title": "Looking for Support!"
    }
  ]
}