{
  "AuthorID": "clemsonkittie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/clemsonkittie",
  "Posts": [
    {
      "AuthorID": "clemsonkittie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/clemsonkittie",
      "Content": "As always  there are good days and bad days .  I have no idea if i am coming or going.  On the 12th of Marchof 2008 I was diagnosed with stage 3, triple negative metastic breast cancer. Much to my dismay later on in that year my husband left me for my oncologists nurse. Wow never thought that would or could ever happen.  In the year of 2009 I was also diagnosed with renal cell carcinoma. HELP!!! after much crying worrying and more emotional drama for myself and my precious 12 year old my mother fell in Aug of this year and broke her pelvic bone . That was on Aug.3rd. On Sept. 18th my lovely and most wonderful man of a father passed away and now the metastic process is really taking it's toll because I am loosing my appetite and when I do eat I am not gaining weight. I am here with my mother and am having to transfer my doctors and I just want to be able to think properly but chemo brain is really just not being kind to my situation . But I know that there will be some light at the end for me.  Thanks for letting me vent on this page.",
      "MessageIndex": 0,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51425,0.htm",
      "Title": "metastatic disease"
    },
    {
      "AuthorID": "clemsonkittie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/clemsonkittie",
      "Content": "I know about the pain.  I take tons of meds and I really hate doing it.  My 12 yr old has been so supportive and such a blessing .  I miss being NORMAL??  What is that but I am hopeful once they remove my kidney that all might be ok for awhile until they decide to remove the thyroid after all is said and done with the renal cell carcinoma.  Thankyou so very much for taking the time and intrest to say something on here. I certainly hope that you will have some pain free days soon. I would like to add you to my friends list if I may I will send you a request and maybe we can chat when you feel as if you are able. Take care and thank you once again. Love to you and yours, Clemson Kittie :)",
      "MessageIndex": 5,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51425,0.htm",
      "Title": "metastatic disease"
    },
    {
      "AuthorID": "clemsonkittie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/clemsonkittie",
      "Content": "thank you so very much for replying to my post. I am glad that i do have such a precious little boy. I will deffinately visit the website and see what other means there might be for reducing other symptoms. I wish the best for your father and your family. Thanks again.  ",
      "MessageIndex": 3,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51425,0.htm",
      "Title": "metastatic disease"
    },
    {
      "AuthorID": "clemsonkittie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/clemsonkittie",
      "Content": "thank you so very much for replying to my post. I am glad that i do have such a precious little boy. I will deffinately visit the website and see what other means there might be for reducing other symptoms. I wish the best for your father and your family. Thanks again.  ",
      "MessageIndex": 2,
      "PostDate": "26/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51425,0.htm",
      "Title": "metastatic disease"
    }
  ]
}