{
  "AuthorID": "Colleen_L",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Colleen_L",
  "Posts": [
    {
      "AuthorID": "Colleen_L",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Colleen_L",
      "Content": "I know that infections here are serious and painful. My daughter had been ill with colds etc. and low resitance. I took her to the doctor twice and the ER. and nothing helped her sore mouth. It got worse and worse. Her mouth had sores,when she brushed her teeth they bled etc. She was starting not to eat, and I took her to the after hours clinic. One look in her mouth and the doctor asked what I had been doing for her and who had seen her. I told him about the other doctors and the mouth wash she was told to use. He said, she had a serious case of undiagnosed toncillitis!!!! I could of screamed for all the pain my daughter had been in and the other doctors missed her problem! Colleen",
      "MessageIndex": 2,
      "PostDate": "27/02/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1078,0.htm",
      "Title": "Swollen Mouth"
    },
    {
      "AuthorID": "Colleen_L",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Colleen_L",
      "Content": "What is gemzar treatment? My husband has had mouth problems also. His high dose steriods have caused him trouble. Also his illness affects the gums, tissue, and bone. I read today at the clinic to look for mucositus (hopefully spelled right).It is basically pain and sores in the mouth, gums etc. It suggests using non-alcohol mouth wash, and good dental care with a soft tooth brush. Also curbing intake of acid, or citrus foods, or spicy. In chemo. one's body is sensitive and vulerable to problems like this. Hope this helps. Colleen",
      "MessageIndex": 3,
      "PostDate": "23/02/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1078,0.htm",
      "Title": "Swollen Mouth"
    }
  ]
}