{
  "AuthorID": "Conqueror60",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
  "Posts": [
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "It is important for you to stay positive, and believe in the results that you want to see.  If you want to be healed you have to believe that you will be.  I was also diagnosed with mets to the bones, so I speak from experience.  Also, if they tell you it's gone, and you question them, get a second opinion.  However, I live for the day when I am told that.   Your attitude is going to be a major part of your recovery.  It's not always easy, but to the extend that you can, stay positive.  Also, prayer has been a huge blessing for me.  Prayer of others, and praying for myself.  God is still in the miracle business, and if He has granted you a miracle, graciously accept it.",
      "MessageIndex": 2,
      "PostDate": "19/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13415,0.htm",
      "Title": "Mets to to bones;"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "The American Cancer Society offers free wigs.  Try to google American CAncer Society,  see if you can get their local number from the phone company",
      "MessageIndex": 1,
      "PostDate": "14/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11275,0.htm",
      "Title": "wig for chemo patient"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "Mis-diagnosis is very commom among physicians.  Most are very good, but non know everything.  May I share my story with you. In 1989 I found a lump in my left breast,  My GYN said it was nothing because he was able to asperate it.  I insisted on a mammogram.  The mammogram was negative with a footnote that said 15-20% of the readings could be false.  With that I insisted on a biopsy.  I was a very scared 29 year old new mother, but I had the presence of mind to insist on more, thank God.  The results of the biopsy immediately revealed a malignancy.  I had a lumpectomy radiation and chemo and was told it was a non aggressive cancer so I should be fine. 1998 I found a lump in my right breast.  I was now using a new GYN, a new mammo center, etc.  My physicial referred me to get a mammogram which was negative.  I knew the routine so I insisted on a biopsy.  By now they were doing needle core biopsies which were less invasive and very quick.  It revealed a malignancy and a lumpectomy was done, followed by radiation.  In 2003 after participating in a genetic study and because my mom and sister both also had cancer previously, I opted for prophylactic bilateral mastectomies with reconstruction, and a complete hysterectomy. In 05 I found a mass of pimples on my clevage.  After visiting 4 doctors they said it was dermatitis.  It got progressively worse during the year, and at some point the color changed and it started to resemple skin cancer. I revisited doctors and ultimately was sent for an MRI.  It was negative. (MRI's don't pick up skin issues).  Again, knowing the routine, I insisted on a biopsy.  The biopsy revealed a maliginancy.  Further testing revealed mets to the bone. I am now being treated for what I am told is \"treatable, but can't be eradiated. (ring a bell- Elizabeth Edwards).  I am doing well, coping with Chemo 3 times a month which I am told I will have to be on for the remainder of my life.  That's what the doctors say but of course I no longer hang on their words as the last words. I am at this point believing God for a complete healing and He has been keeping me well!  I feel great. Please be sure to take control of what's going on with you and follow your gut if something seems wrong.",
      "MessageIndex": 0,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11063,0.htm",
      "Title": "Beware of Misdiagnosis and Seek Second Opinions"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "ER positive.  I was initially put on Femara.  It worked for about 8 months.  I am now on Zeloda 2500 mg per day, with taxatere on the 1st and 8th day.  Zometa is also being given for the bones.",
      "MessageIndex": 2,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11063,0.htm",
      "Title": "Beware of Misdiagnosis and Seek Second Opinions"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "Hi:  I am 46, and was diagnosed at 29 with ca, left breast/ 38 diagnosed in right breast, 2003, prophalactic bilateral mastectomies  with tram flap reconstruction, and in early 2006 a diagnoses of br. ca. which resurfaced in the chest wall with mets to skull, spine, pelvis, chest wall, etc.  I have had radiation and was put on femara.  Femara stopped working, and i started on xeloda 1500.  When the radiologist declined additional radiation last summer, oncologist upped dosage of xeloda to 2500mg daily with taxatere on day one and 8.  It's a 21 day cycle, 14 days on and 7 days off.  I've been on this regimen for 5 months.  I usually feel very fatigued about the third day after chemo.  I'm anemic, and take procrit and nupogen to boost counts.  Generally my lifestyle is ok.  I am usually very active, but now after putting in a full day at work, I can only manage to come home and relax.   My doctor says he'll keep me on this regimen as long as it works.  I am a believer, and I know in my heart that I will receive an eartly healing.  So I am not worried.  How long are you expected to be on this regime?   But I am curious about what you might have been told in terms of length of treatment?  How are you feeling otherwise.  Are you able to be active.  I am one who is usually extremely active, but I am exhausted if I walk 15 to 20 minutes, but prior to this regime was able to work out for 60-90 minutes.  Just looking to hear from someone with similar experience.",
      "MessageIndex": 10,
      "PostDate": "14/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "Hi Tinkerbell: I liked your response to Betty.  Spirituality is the most helpful, calming approach to managing the stresses of dealing with your health.  I have found that positive thinking and focusing on God's grace is keeping me at peace.  I was diagnosed with 4th stage breast cancer w/mets to the bones on January 30, 2006.  I am taking Zeloda and Taxatere (since November, 060).  My hands and feet are very dry, but they aren't sore.  Thoughout this process I have truste God with all of my heart and I lean not to my own understanding. I also take Xometa b/c it works systemically to strengthen my bones.  I have enjoyed such peace being able to meditate on healing scriptures and positive thoughts.  I visualize myself 10 years from now, 20 years from now, etc.  I am healed, adn therefore I will be here by there by the grace of God.",
      "MessageIndex": 6,
      "PostDate": "05/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "Thank you so much, I got chills reading your email.  Your song, I know my Redeemer lives,\" is one where I repeat the words almost daily.  We all know that the worker of iniquity comes to steal, kill and destroy but he must Flee because, I know that my Redeemer lives and He came that I may have life and have it more abundantly.  I learned from my Pastor that our words are our truths (I paraphrased it).  Creflo Dollor says the same thing in a different way.  And, Joel Olsteen has also said, speak it as though it is.  Therefore  when I speak of this \"test\" that I am enduring, which will ultimately be my testimony, I refer to it as a diagnosis.  I know the doctors said it's there, but I KNOW THAT MY REDEEMER LIVES, AND BY HIS STRIPES I AM HEALED.  Jeremiah 17:14 says, heal me Lord and I shall be healed.  Save me Lord and I shall be saved, for Thou art my praise.   I don't tell people that I have cancer, I tell them that I was given a diagnosis of cancer from the doctors. To me it's different because it's not accepting that I have....  I also tell them that my, Doctor King Jesus has healed me.  I stand on His promises.  I will keep you lifted up in prayer.  I pray that you will enjoy all of the peace and joy that God has in store for you on this Good Friday.  Happy Easter to you too.  Always remember, never let anything separate you from the love of God.  Agape!",
      "MessageIndex": 8,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Conqueror60",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Conqueror60",
      "Content": "Does anyone have any first hand information on the Cancer Treatment Centers of America.  I am interested in their approach to fighting cancer and would like some feedback.  Thank you.",
      "MessageIndex": 0,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13156,0.htm",
      "Title": "Cancer Treatment Centers of America"
    }
  ]
}