{
  "AuthorID": "Csmrad",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Csmrad",
  "Posts": [
    {
      "AuthorID": "Csmrad",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Csmrad",
      "Content": "Thank you for your response. I do appreciate it. I have been taking antiinflammatories for some time due to DJD. I've come to the conclusion that this is a disease like any other chronic illness. If I am vigilant, take care of myself, that regardless of what transpires, it can be controlled. Again, thank you for the information and good luck with your personal treatment plan.",
      "MessageIndex": 3,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3777,0.htm",
      "Title": "Post Surgery Treatment Options"
    },
    {
      "AuthorID": "Csmrad",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Csmrad",
      "Content": "My mother, father, and sister all died from various forms of cancer - my sister breast cancer. I had a lumpectomy last December followed by 37 radiation treatments. I started on Tamoxifen and, within two weeks, my bones and joints hurt so badly that I could hardly walk. My doctor recommended Tylenol. After three months, he finally accepted the fact that I could not take Tamoxifen and referred me to another doctor. That one put me on Femara. Within 4 days, I was in bed with shortness of breath and severe joint and muscle pains. I flushed the meds. My doctors don't seem to have solutions for people who do not fit into the normal treatment patterns. My cancer was not estrogen receptor type, my hormone levels are only at 4%. I am watching my diet, taking CoQ10 and vitamin supplements. Is anyone aware of any other type of treatment? I recently had a second biopsy which showed calcium deposits and was negative. Howver, I had a very aggressive type of cancer which reproduced at the rate of 38%. My one doctor tells me I have a less than 35% chance of not having a reoccurrence. I want to prove him wrong. Any reasonable suggestions would be appreciated.",
      "MessageIndex": 0,
      "PostDate": "19/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3777,0.htm",
      "Title": "Post Surgery Treatment Options"
    },
    {
      "AuthorID": "Csmrad",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Csmrad",
      "Content": "Thank you for your response. I will be 61 next month. The reason that I was given for taking Tamoxifen was that it would prevent any chance of my getting the ER type cancer. However, since that is not what I had to start with, I felt that taking the medication and enduring the side effects was not worth the slight chance that the medication would prevent a different type of cancer. I am taking antiinflammatories for DJD and some herbal supplements that are supposed to help the bodies own natural defense mechanisms. I do think that this is a controllable disease and fully intend to do so. Thanks again for your response and good luck to you.",
      "MessageIndex": 4,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3777,0.htm",
      "Title": "Post Surgery Treatment Options"
    }
  ]
}