{
  "AuthorID": "cyndy65",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cyndy65",
  "Posts": [
    {
      "AuthorID": "cyndy65",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cyndy65",
      "Content": "i went to my doctor about a lumb the size of a nickle between my left breast and armpit.. when he felt it he immediately told me i was to go in for a mammogram w/dignostic... they called me with the appointment the next day - when i got there we did the mamo first which showed i discovered i have dense breast tissue as the whole view of the breast was white with very little contrasting black, after a few moments they took me back for an ultrasound - the tech picked up the nodes - which she said looked fine, then asked me about the lump, where it was located, what it felt like, etc. So i pointed it out and told her it seemed to be deep inside not just right under the skin and when i raise my arm - it goes further down. She felt it and was startled at the size, so she started trying to capture it - at one point she said got it - but then moved and it was lost - she brought in the radiologist who then felt the lump, looked puzzled and attempted to find it.. no luck - so i was sent home with an ALL CLEAR come back in a year and a pamplet on dense breast tissue. Is there a chance that this was not picked up on the ultrasound because it is hidden under the muscle? or just a phantom lump that can be felt not seen? no one seems to be worried but me. Since finding it, i am now having pains which shoot from the area of the lump into the breast and nipple area, over the last week i have started to feel extremely tired, edgy due to the pain just below my left shoulder blade and wraping around the left rib cage to just under my breast and as of today .. i have this nagging uncomfortable pain between the shoulder blades...my husband has even started asking me if i am ok inside. Am i just being paranoid - i do not wanna go for more tests and made to feel like i am being a hypochondriac. i cannot see a specialist unless my primary refers me - so how do i get him to send me to specialist when he states..  the radiologist says you are clear for another year. please help",
      "MessageIndex": 0,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,67834,0.htm",
      "Title": "Invisible Lump between left breast and armpit"
    },
    {
      "AuthorID": "cyndy65",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cyndy65",
      "Content": "well got a second opinion - and again sent for a mammogram + ultasound, still cannot locate the lump we are feeling.. so am going for an MRI on Tuedsay - hopefully we can figure this out - also found out (which last facility failed to state) i have to small spots on my left breast, which they have dismissed as fibroid cysts.. which the second facility stated they want to double check them as well. I am still just puzzled by the fact that i had to insist and see another doctor about this, even with my family history being loaded with breast cancer surviors and some which were not so lucky. Why is it we women have to insist on our health checks instead of our doctors pushing harder to find out what is going on and not just dismissing it as nothing",
      "MessageIndex": 2,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,67834,0.htm",
      "Title": "Invisible Lump between left breast and armpit"
    },
    {
      "AuthorID": "cyndy65",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cyndy65",
      "Content": "On Sep 09, 2012 7:49 PM mrspastor40 wrote: I found a lump that was more than 5 cm in size in 6/09.  I had a mammogram every year for 12 years prior to this and nothing was found.  At the point of finding the lump I went to my doctor.  They sent me for another mammogram and nothing was found.  They then did an ultrasound and said they could not find anything.  But they could feel it and I could feel it.  I had been told my breasts were dense up til this time.  The radiologist came in and did something different with the machine(changing the color of  image) and then was able to see the lump.  I was told as long as I have dense breasts an MRI will be necessary.  You should definitely insist on an MRI.  Insurance now acknowledges this and it should be covered.  Thank you.. i did seek a second opinion and am now scheduled for an MRI next week.. but what if they say it is nothing.. do i insist on seeing a BS and having a biopsy or removal. A coworker found a lump - had to insist on it being removed - lucky for her it was just a fat pocket. Hers was squishy.. mine is rock hard and connected to something, when i raise my arm it moves deeper... still confused.",
      "MessageIndex": 3,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,67834,0.htm",
      "Title": "Invisible Lump between left breast and armpit"
    },
    {
      "AuthorID": "cyndy65",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/cyndy65",
      "Content": "On Nov 07, 2012 11:17 PM cyndy65 wrote: On Sep 09, 2012 7:49 PM mrspastor40 wrote: I found a lump that was more than 5 cm in size in 6/09.  I had a mammogram every year for 12 years prior to this and nothing was found.  At the point of finding the lump I went to my doctor.  They sent me for another mammogram and nothing was found.  They then did an ultrasound and said they could not find anything.  But they could feel it and I could feel it.  I had been told my breasts were dense up til this time.  The radiologist came in and did something different with the machine(changing the color of  image) and then was able to see the lump.  I was told as long as I have dense breasts an MRI will be necessary.  You should definitely insist on an MRI.  Insurance now acknowledges this and it should be covered.  Thank you.. i did seek a second opinion and am now scheduled for an MRI next week.. but what if they say it is nothing.. do i insist on seeing a BS and having a biopsy or removal. A coworker found a lump - had to insist on it being removed - lucky for her it was just a fat pocket. Hers was squishy.. mine is rock hard and connected to something, when i raise my arm it moves deeper... still confused. Well i did my second mammo and ultrasound, and then followed up with an MRI last Tuesday - still no word on the results - is it normal for it to take a week to get your results. Also, Friday night i had what felt like a pop/burst sensation in my right breast followed by a stinging pain so bad it doubled me over and put me in tears - i do not have implants - was this a cyst bursting - i have never had/felt anything like this before.",
      "MessageIndex": 4,
      "PostDate": "19/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,67834,0.htm",
      "Title": "Invisible Lump between left breast and armpit"
    }
  ]
}