{
  "AuthorID": "dadaneenee1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dadaneenee1",
  "Posts": [{
    "AuthorID": "dadaneenee1",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dadaneenee1",
    "Content": "When I started radiation, I started to get very sharp, shooting pains through my breast when the mastectomy scars were.  Funny enough, the area was numb, yet I could feel very, very painful shooting pains at times.  I started using ice to help until I went to my next doctor visit.  My doctor recommended the CoolMagic gel sheets and gave me a few to try.  WOW!  I found that they did not help until I had them on for a good 10-12 hours straight.  But WOW!  Once I realized I needed to keep them on continuously, all of the shooting pain went away and I had minimal irritation or discoloration (burning) on my skin.  I have been very diligent in keeping these on most of the time and my doctor can not believe how well my skin has done.  I have completed 28 full breast and lymph node treatments and I start my 'boost' treatments today for the next 5 days (the boost treatments are concentrated in the are of the tumor only).  I would absolutely swear by these sheets, but only if they are used all night, and all day continuously for several days and used from the first week or two of treatment.     Unfortunately, my doctor's office does not believe in them as much as I do, I suspect because they are not a quick fix and do not give immediate relief.  They have told me that these sheets can not help anything but moisten the skin.  I say, bull.  They have helped me tremendously on not only skin irritation but also the sever shooting pains.  My doctor told me I was going to have to use advil regularly until the radiation effect is over (for the last couple of weeks of radiation), but I have not had to do that as long as I use these sheets.  My advice is, try it out for yourself.  Start at the beginning of treatment and  don't stop until the end.  If you do this, and have anywhere near the pain that the doctors expect you to have, I will be shocked.  The Radiology Oncologist offices carry these in stock.  Just ask them. ",
    "MessageIndex": 7,
    "PostDate": "07/08/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20371,0.htm",
    "Title": "Treatment Of Radiation Burns"
  }]
}