{
  "AuthorID": "Daisy314",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Daisy314",
  "Posts": [{
    "AuthorID": "Daisy314",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Daisy314",
    "Content": "On May 31, 2014 2:46 AM Alberta66 wrote: Has any one had a skin rash since taking arimidex (anastrozole) 1 mg daily e.g. itchy raise patches on abdomen, groin, chest, eyelids, and areas under eyes?  The itching is intense at night.  I have been checked my MD and dermatologist this is not scabies.   Finally had biopsy of one of the patches.  The resuts showed the histopathologic findings are consistent with the clinical impression of a reaction to a medication.  The pathology (lab report) cannot name the drug.  That will take me getting over the terrible skin erruptions and possible trying the Arimidex again.  Was wondering if any one else has had a similiar reaction.This is fascinating. I've been taking arimidex since July 2011. In summer 2013 I noticed that my eyelids were chapped. That is the best description. There were little white patches on the lids. It got worse and worse. They began to itch badly, my eyes got red and swollen all over, and the rash spread to my ears and my underarms. I also sometimes get it on my neck. I had no idea what it as, but I've been to my general practitioner who sent me to a dermatologist and to an allergist and finally to an opthamologist. I've been put on steroids, antibiotics, all kinds of topical steroids and creams. It can be cleared up, but when I stop taking the medicine it comes back. All of these health professionals know that I am taking arimidex and I've asked if that could be the problem, and no one has suggested that arimidex could have caused it. I will look in Pubmed now to see if I can find anything in the medical literature about this. Thank you. Now I have a possible cause for this problem.",
    "MessageIndex": 16,
    "PostDate": "23/03/2015",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77442,0.htm",
    "Title": "Arimidix (anastrozole) skin side effects?"
  }]
}