{
  "AuthorID": "DanaLee",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DanaLee",
  "Posts": [{
    "AuthorID": "DanaLee",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DanaLee",
    "Content": "Hi Molly, I don't mean to scare you but I am 8 years cancer free and I not only have rib pain but it extends into my arm and hand and fingers, goes up my neck,around into my back and just keeps on giving.  Sometimes it is so severe I am completely disabled.   I had a left side lumpectomy in 2002 and was only given three clean margins.  The tumor was caught very early but was placed on the extreme outside of my ribs and my surgeon was afraid to go further because of nerve and muscle damage.  Oops, it happened anyway.  The cancer returned in basically the same place but this time two tumors one on top of the other.  Lots of digging went on but I came out cancer free.  I did not want reconstructive surgery, enough already! What I have is called Post Mastectomy Pain Syndrome.  It is something you don't hear much about but it affects around 20-40% of mastectomy patients and there doesn't seem to be much they can do about it, at least I haven't received any help much less even getting a doctor to acknowledge it.  Just Google it and you will see the complexity of the thing.  Yikes. But have no fear, I hope.  You probably have neuropathy  from damage to some of the nerves during your surgery.  Talk to your surgeon.  You may get so m relief with lidocaine patches. .  I used to get injections in between my ribs every few months and it would help a bit but the muscle spasms were awful.  I take morphine, Percocet, a nerve and muscle relaxer and I use marijuana.  You are lucky it is just your ribs but do talk to your surgeon and let them know what is going on.  You are not crazy or imaging this, it is real and caused by your breast cancer surgery.  Try to get some help as we do not need to suffer.  Good luck.",
    "MessageIndex": 9,
    "PostDate": "04/08/2018",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26653,0.htm",
    "Title": "Ribcage pain a year later?"
  }]
}