{
  "AuthorID": "Danka",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
  "Posts": [
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "I have very dense breasts. 15 years ago (my first mammogram) I was told that I had a density that should be watched. Last October I started to have problems and have had lots of tests including MRI's, genetic testing, core biopsies, stereostactic biopsies and 2 surgical biopsies. I had a papilloma removed in May, then just recently in September there were changes in that original \"troublesome density\" area and I had a mass removed that was diagnosed as ADH. No cancer yet, but the doctor says that I am at high risk. I am considering an elective mastectomy with reconstruction. May go to John Hopkins to explore a possibility of a DIEP Flap procedure. My doctor wants me to try Tomoxofen first. She says that it is a good preventative medicine. I did some personal research on it, and don't believe it to be as effective, but only the one thing that is out there that may be somewhat effective. I am petrified to take it. The listed side effects scare me. I have the prescription and can't make myself fill it. Has anyone had any experience with it as a preventative drug rather than post chemo medication. I am not menoposal yet. Does this drug just \"slam\" you into menopose? Please tell me your experience. My doctor says that although she believes that I am a candidate for an elective mastectomy, there are a lot of risks and maintenance associated with the surgery. If anyone out there went through that, I would welcome any comments as well. Thank you. Danka",
      "MessageIndex": 0,
      "PostDate": "16/10/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3192,0.htm",
      "Title": "Tomoxofen as Cancer Prevention"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "As I was writing to cC4cure, I saw your last entry. Very alarming that during your surgery doctors discovered cancer in previously undiagnosed left breast. I haven't been actually diagnosed with cancer, but have progressive conditions. \"Hidden\" cancer is precisely what is driving me to a decision to have DIEP. I'm very encouraged by the testimonials of women who had this surgery. Is it possible for you to give me your doctor's name? There are so few who do this procedure. In my case I may have to find someone who believes as strongly as I do that I am not overreacting. I also want to ask (as I did of cC4cure) whether you take tomoxifen? If so, did you or do you have any adverse side effects? Thank you and continued good luck and good health.",
      "MessageIndex": 12,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "Thank you so much for the info. I will go to the website immediately. It is incredible how helpful we women are to each other in obtaining valuable information. It is disappointing how little doctors who don't specifically perform this surgery know on the subject. You're great. Have a fantastic new year. Danka",
      "MessageIndex": 18,
      "PostDate": "01/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "Thank you for your information and for your upbeat attitude. I haven't been diagnosed with bc, but over the last 14 years have had progressive breast disease that started with extremely dense breasts diagnosed from the very first mammo. In the last 18 months I have had 5 biopsies (2 surgical) diagnosing and then removing a papilloma and then ADH. There is a very extensive history of ovarian, cervical and endometrial cancer on my mother's side and breast cancer in my dad's family. My next mammo is scheduled for Feb 2006. If there are any changes, I will immediately start the uphill battle with the insurance company to allow elective bilateral mastectomy with DIEP method. If my condition stays the same, I may still go for it. It is my undersanding that there is appx. a 15% incidence of bc in women who undergo elective mastectomies -- cancer that was not previously seen by any available modern diagnostic equipment. Was your doctor in New Orleans, Dr. Allen? If not, could you please give me the doctor's name. I'm dealing with someone in Miami who was extremely highly recommended. However, I'd like to keep my options open. Do you know of anyone who had this surgery performed for preventative reasons? Also, do you take tomoxifen? If so, do you have any side effects. My doctor is suggesting it for preventative reasons. I am very sceptical and am afraid to try it.",
      "MessageIndex": 11,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "Thank you for your quick response. Since I don't have a cancer diagnosis yet, and am not yet postmenaposal, I am told that the only preventative medication I can take is tomoxifen. I am usually a very \"obedient\" patient, but the idea of tomoxifen scares me. I'm not a purist of have phobias associated with medications, so this is a very unnatural reaction for me. That's why I am asking the question about side effects. I did hear of your doctor through the John Hopkins web site. I didn't know that he moved to Mercy. This is great info. I will contact him. Thanks again.",
      "MessageIndex": 14,
      "PostDate": "30/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "My heart goes out to you. Hang in there. I have very dense breasts, get frequent mammograms. Last year I had several biopsies (2 of them surgical and whatever was there was not cancerous). But I go into a trance every time a get a mammogram. I have been hearing a lot of stories like yours. It's so discouraging to realize that the mammograms just don't do it. How does something like this happen? How did you finally get to the point where you got the surgery that diagnosed your condition? I had to demand an MRI. Got into an argument with my doctor, the insurance company and my employer. They initially denied me, then came up with an astronomical amount for the deductible, but I kept on fighting. The MRI showed a condition that was subsequently taken care of. If the lump hadn't been removed, it could have led to something more serious in the future. I would demand to see a doctor right away. I would shake up everyone around me and demand attention. I learned that unless you are your own advocate, the system may let you down. So go get them. Danka",
      "MessageIndex": 1,
      "PostDate": "27/02/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4474,0.htm",
      "Title": "Undetectable Lump"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "Hi Sweetkristi Got your message. Again, so sorry this is happening to you. I have had fibrocystic breasts diagnosed from the first mammogram. Have been watching the condition for the past 15 years. Early on I had a stereostactic biopsy & there was no cancer. 18 months ago my ObGyn (who's sister is a breast cancer survivor) felt something different in my left breast. I ran to get a mammogram & an ultrasound. No changes. Decided to get a second opinion from a breast surgeon for high risk patients, had mammogram and ultrasound done in a new hospital which showed a suspicious cyst on the left breast. Another core biopsy - no cancer. At that point I'm obsessing. Didn't trust anyone. Several months go by; I'm up every night researching the internet. Find so many women \"screwed\" by bad equipment, some by condescending doctors making them feel like they were over the top. I and after a struggle got an MRI. It's new technology & it can spot cancer in its early stages, but does not calcifications. The MRI showed a suspicious mass. Turns out the facility that did the test is not properly accredited, so the hospital won't go forward with followup. The doctor knew this ahead of time, but refers patients to them all the time. It's all about money. I got very, very angry and ended up with a female surgeon. She is fantastic. Very no nonsense, and has her own set of boobs, so she understands. I had another MRI in a hospital where I have been going for mammograms for 14 years and they spot something too. They do another core biopsy & find a papilloma. This condition has a 20% chance of being cancerous. The lump has a shape of a flower with uneven edges. My surgeon does a surgical biopsy removes the whole thing and all of the hidden tissue in between the uneven edges. No cancer. The doctor said I should have no more problems. I just turned 50, so that whole gravity / vanity / I'm getting older/want to hang on to my youth thing kicked in. I decided to get a breast lift. this is 3 months after the surgery. Did all the pre-op tests. The last one was a new mammogram. I'll never forget this. We were getting ready for one of the hurricanes in Florida; the maintenance workers in the hospital were closing all of the window shutters & the radiologist told me that she saw fibrocystic changes. She suspected cancer. We were all shocked, including surgeon. After the hurricaine, we do another stereostactic biopsy. This time its ADH - another condition that carries a 20 - 30% risk of cancer. Now another surgical biopsy. Still no cancer. I didn't know what to think. No faith in the machines. No faith in my body. My surgeon tells me that I am in a very high risk group. I did a ton more research and started looking into an elective mastectomy of both breasts with an immediate reconstruction. If one more thing happens, I'm ready to go. What I'm trying to do is to prevent having to go through chemotherapy and radiation, but most of all to catch this thing before it becomes cancer. This is an extremely controversial issue for most people, including doctors. Some people were looking at me like I was crazy, others accused me of wanting to just get a \"boob job\". However, there are a few very pro-active, compassionate doctors out there who really believe that this is the way to go. John Hospkins has a fabulous program. I also found a doctor in Mount Sinai in Miami, who specializes in this. Just recently I had another mammogram. This time no changes, everything is o.k. But I'm still hearing a ton of stories like yours about women who had surgery & doctors who say that whatever they find may have been there for years. I'm not crazed about the whole thing now, but I'm definitely not waiting a year for another mammogram. As a matter of fact I am going to demand another MRI in the summer. I can't tell you enough how important it is to be your own advocate. If you're angry, use that to fight the doctors. Don't let them intimidate you. Don't be afraid of being pushy and \" xxxxx y\". It's your life. You want to be there for your kids. If the doctors and hospitals don't like you, screw them. I wish you good luck. Danka",
      "MessageIndex": 3,
      "PostDate": "28/02/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4474,0.htm",
      "Title": "Undetectable Lump"
    },
    {
      "AuthorID": "Danka",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Danka",
      "Content": "I bet you can't wait to go to Mexico - especially since you live in Alasca. Please let me know if you need names of websites or anything else that I discovered while I was looking before. I'll share any information I have with you and even some names of women who have gone through a reconstruction and who talk about their experiences on line. Good luck. Danka",
      "MessageIndex": 5,
      "PostDate": "02/03/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4474,0.htm",
      "Title": "Undetectable Lump"
    }
  ]
}