{
  "AuthorID": "DarMack",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DarMack",
  "Posts": [{
    "AuthorID": "DarMack",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DarMack",
    "Content": "Has anyone had the same experience? I am a devoted husband of 14 years.  We have had a VERY, VERY happy marriage.  My wife battled breast cancer throughout almost all of 2011 and into 2012.  I battled it with her, every step of the way.  I cared for her like she was the only thing in my life.  I went to nearly every single appointment and all 16 chemo rounds and all 5 surgeries.  The last surgery was a touch-up surgery, to inject fat in a few places, to even things out.  Her self-esteem was low, as she had gained weight and hated her carved up body.  AGAIN, I was super-supportive.  She wanted a 'tummy tuck' to go along with the touch up surgery she was already getting - so we ponied up $8000 and got that done.  That was in September.  Once she healed, she has looked better than she has in 5 years....and that is when she started going out all the time.  She goes out clubbing with her friends and leaves me at home with the kids.  She has always been trustworthy, so I encourage her.  A week ago, she started acting very strange and very secretive.  When I did the hard core investigating, I found NO evidence of an affair - and frankly, it would be pretty tough for her to have a sexual affair, without nipples and still having issues with her body.  But, nonetheless, she IS having an emotional affair with SOMETHING.  Maybe a vision of a future life, or a chance to entertain some of the guys who have been flirting with her.  Whatever it is, she is kicking me to the curb now and forsaking the futures of her children for her selfish needs right now.  The guys who leave women during cancer are the lowest forms of life on the planet.  But, let's not lump all cancer divorces on the guys and point fingers.  Satan, or whatever negative influences you believe in, has his was of getting into the most pure of minds and ripping their worlds apart, in order to satisfy some current desire. I pray that my children will be minimally affected by her decision to want to split up with me.  Whenever I bring it up to her, she makes excuses like, \"the kids will be fine.\"  This is the same person who a few months ago was VERY ANTI-DIVORCE and excoriated ANY friend or family member who wanted to get a divorce, when there were kids on the table. THAT is how quickly Cancer can destroy a marriage THE OTHER WAY.  The kids and I get tossed aside, while she is playing the Tim McGraw's Live Like You Were Dying, the at-home-version.",
    "MessageIndex": 0,
    "PostDate": "26/11/2012",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69300,0.htm",
    "Title": "Breast Cancer leading to divorce."
  }]
}