{
  "AuthorID": "dawnb08",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dawnb08",
  "Posts": [
    {
      "AuthorID": "dawnb08",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dawnb08",
      "Content": "Do you know the name of this drug?",
      "MessageIndex": 107,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "dawnb08",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dawnb08",
      "Content": "On Nov 18, 2010 1:20 AM srmac wrote: On Jul 20, 2010 8:26 PM Karenasmith wrote: On Jul 15, 2010 3:25 PM JoyceJJL wrote: HI I have been taking Femara for 2 yrs and my joints and legs, back are killing me,.   I tried the aromasin and arimidex, but had different side effects.  I am seriously considering to be asked to be taken off of this.  I have read so many posts about the side effects of this drug or others its beginning to scare me.  I can barely walk without leg pain.  I just wish I knew more about what would happen if I stopped this.  But its beginning to be more of an option to stop.  As its a continual joint pain 24/7.   Is everyone else having these symptoms?  I wonder if there are people that dont have this problem.,  Mine was a stage 3b ductal breast cancer and had a double mastectomy , chemo & radiation.  Would love to hear feed back from others.  Thanks   Joyce Hi Joyce, I too had stage IIIB ductal and lobular cancer, bilateral mastectomy, etc.  I was on Femara for about 18 mos and couldn't stand the pain in my joints.  It was unbearable.  My oncologist switched me to Aromasin about 9 mos ago, and I am doing better on it.  I still have pain, but not as severe.  However, the hot flashes, weight gain, and lack of energy are the same.  I'm tired of feeling tired all the time, but I'm afraid if I stop the drug the cancer will come back.  Its kind of a no-win situation, but I'm just not willing to take the chance.  I know the symptoms will go away if and when I can stop taking the drug.  I was very intersted to hear of all the incidinces of carpal tunnel on this site because I've just been diagnosed with that.  The brace at night helps.  I don't want to have surgery on that arm as that was the side all the nodes were removed from and they said to not even have blood work or blood pressure done on that arm.  Good luck to you - try to stay positive and be kind to youself.  I found a yoga stretch class very helpful. Hello.  I was on Tamoxifen for over two years and then was switched to Aromasin for over five years.  I did have to have carpal tunnel surgery on both hands, trigger finger surgery on both hands, wrist surgery on one hand.  Too many aches and pains to list and some major weight gain to boot. I was just taken off the meds so hopefully things will start to get back to normal soon.   Good luck to you. I tried every aromatase inhibitor - with the same problems others have been experiencing - debilitating, crippling joint pain.  I could not open a jar (one that was already opened) or grip very well because of the pain.  The skin on my fingers became so tight, it was hard for my fingers to bend.  My internist referred me to a rheumatologist, thinking I had developed an auto-immune disease such as scleroderma or Lupus.  All tests were negative for this, however. As soon as I was taken off the aromatase inhibitors and put back on Tamoxifen, my body started getting well.  My fingers work just fine now, and the skin is almost back to normal.  I suspect the aromatase inhibitors will be removed from the market someday because of their dangerous side effects.  At least such side effects were part of my experience, and I was only on them about 6 months.  Symptoms started within 2 weeks and continued to worsen, until I got off the drugs.  My doctors found it hard to believe that there was any connection between my symptoms and the drugs - because drug companies are telling them the side effects are minor.  By the way - if you read the drug inserts, and look up the drug company research data - the actual (versus relative) increase in survival from using these drugs is less than 2%.  For me, that small percentage of potential benefit was not worth living in constant excrutiating pain and disability.  It's amazing how much better I feel since I got off those drugs.",
      "MessageIndex": 130,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "dawnb08",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dawnb08",
      "Content": "On Mar 11, 2010 10:10 PM Ninah wrote: I have the same problem and am developing neuropathy in my feet. Very sacred... but looks like there is no other choice...If anyone has a suggestion, please count me in Taking B12 and a B complex may help with neuropathy per info I just read from the Leukemia and Lymphoma society.  This may help it heal.  Drug approaches are primarily pain suppression.  You may need both.  I've also read that Vitamin D is deficient for almost all persons with breast cancer.  I asked my doctor to check mine, and was below normal.  I'm taking 5,000 IU daily. I've also read an article recently about taking very high doses of Vitmain D to help reduce pain from the aromatase inhibitors.  It was from the recent San Antonio breast cancer conference.  The research shows a Vitamin D dose of 50,000 IU one day each week, was effective in reducing pain.  I plan to ask my doctor about this.  This is a very high dose and should be taken only under medical supervision. Wishing you well.  ",
      "MessageIndex": 110,
      "PostDate": "07/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "dawnb08",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dawnb08",
      "Content": "It's possible you might be extra sensitive to the chemo drug you are using, since you know someone who got through it with few problems.  Perhaps another type of chemo drug would be better for you.  When I had very high dose chemo, I wore a medicine pack with IV anti-nausea meds going in through my line for several days.  That helped a lot.  Maybe something like that could be an option for you also.  Are you taking ginger as a tea?  That might help - sometimes just taking capsules can upset your stomach, while sipping a warm liquid can be soothing.  Mint tea might help also - it is supposed to be soothing to the stomach.  I had to mostly stick to liquids and very small amounts of bland food during the worst of the chemo. Also pain meds can upset your stomach.  So a change there might help as well.  I'm assuming you are on some. Be sure your doctor understands how extreme your symptoms have been also.  There may be other options to help with your symptoms.",
      "MessageIndex": 2,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46182,0.htm",
      "Title": "Suffering severe nausea & pain from first chemo"
    }
  ]
}