{
  "AuthorID": "Debbie78",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debbie78",
  "Posts": [
    {
      "AuthorID": "Debbie78",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debbie78",
      "Content": "My mother had stage 1 breast cancer with radiation treatment only. Her lymphnodes were not cancererous. She developed a chronic cough in Jan 07. Her radiation ended on Oct 31, 2006. She was diagnosed with pnemonitis early April 2007 Prior to that she was misdiagnosed and treated for pneumonia. After the proper diagnosis for radiation pnemonitis. A lung specialist treated her with 40 mg of predisone for a week 30 for a week 20 for a week 10 for a week and weened her off last week. Well, this week the cough is back. SHe is sooooo frustrated. A recent ct scan showed improvement of the pnemonitis and some scarring. Why is she still coughing. Will she have to go on steriods again. We have a call into the doctor this morning. She was hoping the cough would go away this time. What is the likely hood of this being resolved with another round of steriods. The pnemonitis was confined to the radiated area. THanks.",
      "MessageIndex": 2,
      "PostDate": "01/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    },
    {
      "AuthorID": "Debbie78",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debbie78",
      "Content": "she has had two ct scans and show dramatic improvement after a round of steriods but after tapering predisone cough resumed. currently back on 30 mg predisone 3 days, 20 for 3 days and 10 until may 15. what disease/problems would bronchoscope show that a ct scan would miss. thanks.",
      "MessageIndex": 4,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    },
    {
      "AuthorID": "Debbie78",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debbie78",
      "Content": "could someone tell me about there experience with radiation pneumonitis. Can you completely recover or does it progress to fibrosis? Scared and frustrated.",
      "MessageIndex": 0,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    }
  ]
}