{
  "AuthorID": "Debross",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debross",
  "Posts": [
    {
      "AuthorID": "Debross",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debross",
      "Content": "Hi everyone   I was first just going to post to Liz but it sounds like you all have given her good advice.  At 52, in 2009, I was found to have stage 4 breast cancer.  I have a rare form and had no history of breast cancer so it was a bit of a shock.  Since my cancer could not be seen on a mamogram or x-ray, it had grown to 6\" by the time they removed my breast (opted to have a double, the Traitors!).  As you can all guess, I was terrified but I am stronger and bigger then the cancer and even though I have had some battles in the last, almost 4 years, I feel great!  The advice of drinking, drinking and more drinking is so right.  Eating is essential too to keep up your strength.  I never vomitted through 8 rounds of chemo and did radiation after surgery,  I dismissed my first oncologist because of her nergativity.  I have been told many times my attitude is what has kept me alive and I will stop fighting this disease.  I am not in denial that I will someday die but there is no way I am going down without fighting this disease, just as many women did before me.  They were my saviors because they tried new things, that has saved my life!  Hang in there everyone life is good and worth the battle:)",
      "MessageIndex": 42,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Debross",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debross",
      "Content": "Bottled water worked for me and 7-up.  The metalic taste is in all chemos, as far as I have heard.  I don't believe I have won, since it is always trying to come back but I have found peace with it!   The hair bit is really hard since that is what people visually define us by and mine hung on a long time but then was gone in two days.  You know, I have never had a 'bad hair day' since then, ha!  Hang in there, it is a battle but you can come out on top:)  ",
      "MessageIndex": 45,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Debross",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Debross",
      "Content": "So sorry for your loss Pippa.  That is incredibly sad to loose your love and support system.  I do feel for Liz and the even though hair loss is minor in the big picture.  Having hair come out in clumps is a nightmare since we identify ourselves by our outward appearance.  Mine was gone in 2 short days but I had my husband shave off the last of it to take control.  I went right to the mirror and looked.  It was not sad since I was surprised to see how much I looked like my twin brother who had died just 5 years before (and yes, he was bald:).  Since you like to pull your hair back in a ponytail, I had a friend who made herself a hair with a pony tail sticking out back by taking a hair extensions and binding then together to stick out of the hats back. She then glued pieces of hair along the sides, it was great! You would not have guessed she was without hair!  It didn't work for me since I never had enough hair to do that with but I wore a lot of scarves and two sided tape some bangs in. It made me feel more femine.  There is a bonus too, now I have a great scarf collection to wear with outfits!  Don't beat yourself up for missing your hair, it is just another hurdle which makes us stronger and to teach the world we can endure!",
      "MessageIndex": 54,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    }
  ]
}