{
  "AuthorID": "dec3kids",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dec3kids",
  "Posts": [
    {
      "AuthorID": "dec3kids",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dec3kids",
      "Content": "Thank you both for your replies.  I do believe some of the mass is scarring as you mentioned (Rosies mom).  Question I have for Christine is how long did yours take to soften up?  I feel as though mine is getting bigger and harder which is what is scaring me.  It feels like I am sleeping on a rock when I lie on my stomach and it hurts when people give me a big hug.  As I said, I have my mamo and ultrasound on Monday and an appt with my breast surgeon on Thursday.  Just concerned that he will say it has to be either biopsied and/or removed regardsless of the results.  If it has to be removed, I am concerned how the \"plug\" the vacant spot.  Just want to be prepared and have some counter offers if possible. Thanks again to both of you. ",
      "MessageIndex": 3,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54940,0.htm",
      "Title": "Fat Necrosis of breast"
    },
    {
      "AuthorID": "dec3kids",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/dec3kids",
      "Content": "Hi everyone, I had breast surgery about a year and a half ago.  I have developed a large solid mass on my right breast .  Had my yearly gyn check up in Nov andw my gyn feels maybe breast necrosis from the surgery but should get it check out.  I told him that I had my yearly mamo and bi annual ultrasound the end of January and he said it was fine to wait.  My question is can mamo and ultrasound diagnose fat necrosis, or is biopsy needed?  Also if any of you have had fat necrosis from surgery, did you have to have it removed or can you live with it?  If you live with it, is it hard to see if cancere develops? I am a thyroid cancer patient and have a strong family history of breast cancer (mom, aunt, grandmother, and greatgrandmother) so the big C is already effecting my life.  I was tested for BRCA and do not carry the gene (thank God). Any input, suggestions and/or comments are welcome.  ",
      "MessageIndex": 0,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54940,0.htm",
      "Title": "Fat Necrosis of breast"
    }
  ]
}