{
  "AuthorID": "Dee_in_va",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
  "Posts": [
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "I had some neuropathy from the taxol, it gave me shooting, burning pains in my feet/ankles and caused my toes to be numb.  I finished chemo in August of '05, and only have the shooting pains once in a blue moon now, although my toes are still fairly numb.  I have two good friends who went through chemo at almost the same time as me, and had more severe nueropathy than I did - and they, too, say that it improves over time. Arimidex, femara, and aromasin are all what is called aromatase inhibitors. The most common side effect is joint and/or bone pain, which I have.  I take pain medication if it gets too bad - mostly it just bothers me at night, during the day I am too busy to notice it for the most part!  As long as I can get a good night's sleep, I can tolerate it.  And not everyone gets this side effect, or the other side effects, we are all different.  You will probably do just fine, and if not, you can stop whichever one you're on and try a different one.  Best of luck to you.    ",
      "MessageIndex": 3,
      "PostDate": "11/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9288,0.htm",
      "Title": "arimidex verse famara"
    },
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "The first time I was diagnosed, I took tamoxifen for five long years of what was essentially a permanent hot flash.  After my recurrence, I have been on AI drugs for 18 months now (I've tried all three drugs), and have not noticed any menopausal-type symptoms at all.  I do have bone and joint pain, but am dealing with it.  My oncologist told me that after the mastectomies, chemo, radiation, and AI, I actually have LESS chance of having breast cancer again than a woman in the general population.  I'm an RN, and I do a lot of research on and off the job, and I believe that these drugs are very effective.  I intend to hang on, hoping that I'll be here when they find the cure!",
      "MessageIndex": 15,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8257,0.htm",
      "Title": "arimidex~side effects"
    },
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "The first time I was diagnosed, I took tamoxifen for five long years of what was essentially a permanent hot flash.  After my recurrence, I have been on AI drugs for 18 months now (I've tried all three drugs), and have not noticed any menopausal-type symptoms at all.  I do have bone and joint pain, but am dealing with it.  My oncologist told me that after the mastectomies, chemo, radiation, and AI, I actually have LESS chance of having breast cancer again than a woman in the general population.  I'm an RN, and I do a lot of research on and off the job, and I believe that these drugs are very effective.  I intend to hang on, hoping that I'll be here when they find the cure!",
      "MessageIndex": 23,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8257,0.htm",
      "Title": "arimidex~side effects"
    },
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "I have never heard of using a woman's experience of morning sickness as a predictor for nausea during chemotherapy.  They give you so many drugs for the nausea now, and the newer chemo drugs are better tolerated, so the horrible nausea is a thing of the past, for most women.  I DID have some nausea from the chemo, mostly just feeling a little queasy and (very seldom) some vomitting.  The chemo made me more tired, than anything, and I had some joint pain from the taxol.  One other thing to consider is a central line for the chemo, so you don't have to get an IV started each time. The first time I had chemo, my Dr. thought my veins were fine, so an IV had to be started each time.  The chemo is very irritating to the veins, so I had phlebitis a couple of times and it became harder and harder to get the IV in.  This time, I had a PICC port put in, in the upper part of my left arm.  This is a central line (meaning, the IV line goes into the largest blood vessel in the body, the superior vena cava, where it mixes instantly with a large volume of blood - less chance of irritation this way), it is inserted through a small incision in the arm.  The \"port\" is a small, metal capsule that has a membrane, it is implanted just under the skin.  A special needle is used to run the chemo, plus they can also draw lab work using the port.  The PICC port is small, about the size of an almond.  It's totally under your skin, so much less chance of infection than the type that has tubing that extends out of the arm.  I LOVED mine!  One stick and the blood was drawn and chemo started.  I kept mine in for a year, all through reconstruction, never had a minute's problem with it.  When you aren't having chemo or labs drawn at least every month, you have to get the port flushed, but I usually had lab ordered or an appt with one of the docs, so getting it flushed was no problem.  It is my understanding that this implantable PICC port is relatively new, so you may have to ask about it.",
      "MessageIndex": 8,
      "PostDate": "11/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9286,0.htm",
      "Title": "bilateral mastectomy"
    },
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "Two years ago I had recurrence of breast cancer, eight years and 1 day after the first diagnosis.  The first time, I had lumpectomy/node disection/chemo/radiation.  The recurrence felt like the rug was pulled out from under me.  I NEVER wanted to go through this again, so I opted for a double mastectomy, which was done in May, 2005.  Followed by three chemo treatments (was supposed to be four, but I blacked out a few days after # 3, and broke my leg - which didn't heal for 4 months because of the chemo).  I had immediate reconstruction with tissue expanders, and eventually saline implants, followed by nipple reconstruction, and tommorow I get the nipples/areolas tattooed.  What I was NOT told at the time I was making my reconstruction decision was that there is a procedure that reconstructs a very natural looking and feeling breast from your own abdominal skin and fat, without taking abdominal muscle.  The procedure is lengthy (8 hrs) but the results are very natural.  I'm not sure if I would have chosen this at the time, but I sure would have liked to have had the info, so I could have considered it.  I had a bad experience with my first plastic surgeon, who didn't even tell me that (at the time) silicone implants were still considered experimental.  I only found out the day before I was scheduled for the surgery, and then it was a phone call from an office scheduler telling me that my surgery was cancelled because \"they (the hospital where it was scheduled) don't participate in the study\". (Of course, I asked \"WHAT study???\", and it went downhill from there - I really had no trust in that doctor after this occured.)  Anyway, I have saline implants, and no, I don't \"like\" them.  they don't feel natural, and they aren't perfect (the side that I had the radiation on when originally diagnosed has a \"flat spot\", where the skin didn't stretch much.)  The CDC puts out a very detailed packet of info on breast reconstruction, you can get it on-line (search for \"CDC\", then breast reconstruction.)  It tells you what my frist plastic surgeon never mentioned to me:  implants have to be replaced at some point- you should expect mutliple surgeries for the initial reconstruction, and then at some future point in time.  Would I do it again?  Maybe.  I wanted reconsturction so I wouldn't have that visual reminder every time I got dressed/undressed, but to tell you the truth, there is more scarring than I expected and more surgeries under general anesthesia than I anticipated (the initial mastectomies and expanders, the \"exchange\" of the expanders for the implants, and a second surgery to revise the first (first plastic surgeon hadn't put them in right), plus the multiple visits for expansion, and now the tattoos.  I was initially told that I would be \"DONE\" with reconstruction before Christmas of 2005.  Here it is, closer to two years after the mastectomies, and I am finally finishing up!  Get as much info as you can, and then decide.  Also, remember that you don't have to have reconstruction right away, it can wait.    ",
      "MessageIndex": 1,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9286,0.htm",
      "Title": "bilateral mastectomy"
    },
    {
      "AuthorID": "Dee_in_va",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dee_in_va",
      "Content": "I have fairly severe lower back and hip pain due to arimidex, and for me the pain is worse at night.  I started sleeping with a body pillow two weeks ago, and it has helped a lot - some nights are even pain-free!  If I'm on my back, the pillow is under my knees; if I'm on either side, my top leg and arm are on the pillow.  I started taking aromatase inhibitors in August 2005, after chemo and a double mastectomy.  By December that year, I was in a lot of pain, so my oncologist gave me a \"drug vacation\" for a month, then switched me from arimidex to femara.  After several months, the pain was worse, so I had another \"vacation\", then started on aromasin.  After a couple more months, I was waking myself and my husband up at night, crying and moaning from the pain.  You guessed it - another \"vacation\", and now I'm back on the arimidex again, but like I said, it's better since I got the pillow.  I also take tylenol or ibuprofen at bedtime if I'm really hurting.  If I can get a good night's sleep, I can pretty much put up with it during the day - when I'm busy.  I have several friends who have much less severe bone/joint pain, and two who don't have any side effects at all.  Switching to on of the other drugs may be the answer for you, it's worth a try!  (By the way, I enjoyed my \"drug vacations\" - I told everyone that I was on vacation, and I WAS - they were the only vacations I got during that time, I used up all my vacation and sick leave for surgery and chemo!  :)   )",
      "MessageIndex": 3,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8375,0.htm",
      "Title": "Arimidex and back pain"
    }
  ]
}