{
  "AuthorID": "denia",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/denia",
  "Posts": [
    {
      "AuthorID": "denia",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/denia",
      "Content": "Hi Jeanie, I just joined this forum and saw your post regarding severe radiation burns and the 3 products you recommended. My dr has given me Aqua4 with lidocain and suggested using a combination of water, salt and baking soda to use on my open sores - however, this doesn't seem to be working very well - and I can't stand to touch the area to put on the lidocain compound. I also have very large breasts - had a mastectomy on the right side in June of 07 and have one more week of radiation to go to complete the 34 sessions. They have moved the radiation site in closer to the actual scar tissue, but the open sores are located under neath the flap of skin left for reconstruction. My questions are: 1. where did you get the products? 2. Is there one you feel works better than the others? (I'm leaning toward the spray since I wouldn't have to rub anything on the area), 3. How long did it take your sores to heal? Mine are open sores with white skin around it and gooey in appearance - also has an odor - I'm thinking because they are beneath the skin fold, it will take longer to heal...? I also have a really red burn on my neck where they were targeting lymph nodes which has a sore area - although not the same in appearance as the ones on my breast - which is incredibly burned. I appreciate your willingness to share and any advice will be greatly appreciated! Denia/Texas",
      "MessageIndex": 3,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20371,0.htm",
      "Title": "Treatment Of Radiation Burns"
    },
    {
      "AuthorID": "denia",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/denia",
      "Content": "Hi Rose, I hope you got better information from the chemo nurses than your doctor - the steroids they give us prior to chemo are considered very large doses of steroids and a known side affect of them is a headache - as well as the nervous and jittery or hyper feeling you may get from the steroids - I also had to take 3 days of steroids after each chemo cycle - so my headache tended to last several days - some worse than others - Hope you got some help - Denia",
      "MessageIndex": 4,
      "PostDate": "10/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21224,0.htm",
      "Title": "would you get headachs from cemo?"
    }
  ]
}