{
  "AuthorID": "DenverGuy",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DenverGuy",
  "Posts": [
    {
      "AuthorID": "DenverGuy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DenverGuy",
      "Content": "My girlfriend has stage 4 HER2 negative breast cancer.  She is eating all the right stuff, she's on Afinator, etc., and is taking supplements, including 1 gram of curcumin per day.  Her tumors markers are up, discouragingly. Any thoughts about curcumin or aronia? We see a Chinese doctor next month. Thanks.",
      "MessageIndex": 0,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81695,0.htm",
      "Title": "Curcumin and Aronia (black chokeberry), and Chinese medicine"
    },
    {
      "AuthorID": "DenverGuy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DenverGuy",
      "Content": "Thanks.  I have also heard that you shouldn't place too much faith in the markers.  They are not always a true indicator ofcancer status.  For example, according to a recent PET scan my girlfriend's turmors are a little smaller while the markers are up...",
      "MessageIndex": 2,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81695,0.htm",
      "Title": "Curcumin and Aronia (black chokeberry), and Chinese medicine"
    },
    {
      "AuthorID": "DenverGuy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/DenverGuy",
      "Content": "My girlfriend now has stage 4 breast cancer.  It's gone to her neck and abdomen (2 small tumors there). She's now on Lbrance, has no energy and a big problem with feeling full and having a bloated stomach even though she's barely eating. Her naturopath recommended AveUltra, and she's in her 7th week of using it now.  The neck tumor is slightly bigger or the same size, and her abdomen tumors are much smaller, but both markers are up.  Confusing. I have read that it can take 12 weeks or so of using Avemar before seeing results, and there is no downside.  I have read a lot of good stuff about this product. Of course her oncologist has never heard of it. Any thoughts? Thanks.",
      "MessageIndex": 0,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90091,0.htm",
      "Title": "Avemar/AveUltra"
    }
  ]
}