{
  "AuthorID": "Diana1945",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Diana1945",
  "Posts": [{
    "AuthorID": "Diana1945",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Diana1945",
    "Content": "On Feb 09, 2006 12:00 AM Deevee wrote: I killed my stage IIa breast cancer tumor by using supplements found in the research online. I was a breast cancer patient, pre surgery, and post surgery, the pathology report indicated the tumor \"appeared to have undergone chemotherapy,\" although I took no chemotherapy or radiation. I took high doses of: Vitamin C Lysine Proline Arginine L-Glutamine Reishi Mushroom capsules Shitakii Mushrooms in edible form each day Green tea extract Shark Cartilage Removal of all sugars and refined carbohydrates from my diet, as cancer cells require 5 times more glucose than normal cells. Each one of these substances can be found searching online and matching it with \"cancer.\" The studies I reviewed were all peer-reviewed, university laboratory studies from legitamate sources. Shark Cartilage, especially small molecule, clinical grade supplements do the same as Avastin. It is anti-angionetic. Look up these sources for your self. Diana Wilson PhD UPDATE-8 Years later....I am still cancer free after 8 years, using only surgery and supplements that I named in a post (DeeVee Feb 8, 2006). Also note, that my mother and both aunts also died of the same kind of cancer, and I have now lived 20 years longer than my mother and aunts. Why? Because I took control of my own treatment, did the research, and saved my own life. I no longer take Shark Cartilage every day, but do take it about 1 one out of 3 for insurance. I am also taking other very important supplements, such as PPQ, Co-Enzyme Q10, L Carnotine, Carnosine, Astraxanthin, etc. At 68 1/2 years of age, I do not look my age and feel great. The body is a chemistry factory, if it gets what it needs, then it stays in good working condition. It is interesting that the research I found on my own, is the same information used by Suzanne Summers, and Life Extension Institute in their recommendations for how to deal with cancer. It is now obvious that the same peer-reviewed, legitamate, university and laboratory research IS available on line for all...including doctors and physicians who should be reading these studies and using them to cure cancer. Instead, cancer hospitals for the most part are still destroying people's lives, damaging immune systems, and killing them using massive doses of chemotherapy and radiation. It is notable that out of my 5 girlfriends who ALL underwent chemotherapy and radiation, they are all DEAD. I am the only one alive out of 6 people...and I did not use chemo or radiation. Anything that damages cells, and especially damages the immune system is wrong, wrong, wrong...and will kill you. T he body is born with abnormal and cancer cells from birth, but it is the body's own immune system that identifies them and kills them. MD Anderson Hospital in Houston, Tx now states they are on a \"moon mission\" to cure cancer in 5 years. When I worked there in the 1980s, they refused to let their own doctors know if their cancer/chemotherapy/radiation treatments worked or not. This is criminal. So, their current statements about cancer cures being in reach (using what kind of treatments?) is to be looked at suspiciously. We shall see. If you have cancer, do your research. If you cannot do research about supplements or your cancer treatments, find someone who can. But know this: Cancer cure rates have NOT improved more than 1-2% since tracking of cancer patients began in the 1950s, so the conclusion is that chemotherapy and radiation does not work. What research has improved, is using and enhancing one's own immune system to cure cancer. Hello? That is exactly what the supplements that I used did....improved MY OWN immune system, which allowed my bod to cure its self from cancer. What has also improved is early diagnosis...that is important, as the earlier one is diagnosed the better chances one has to live. I CANNOT EMPHASIZE ENOUGH THAT ANY CANCER CHEMOTHERAPY OR RADIATION TREATMENT THAT ALSO DAMAGES YOUR IMMUNE SYSTEM, WILL KILL YOU. I miss my five girlfriends, they were wonderful people, but everyone of them would not listen to me and insisted on listening to their own doctors who put them through 1,2,3, and even 4 chemotherapy treatments, in which each time they got sicker and then died. This is criminal. Please take care of yourself...you will lose nothing but your life, if you don't do your research in what the medical and pharmaceutical establishment wants to do to you, i.e. spend lots of money with bad results. I wish you the best, DeeVee Wilson",
    "MessageIndex": 9,
    "PostDate": "22/09/2012",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4432,0.htm",
    "Title": "i Killed my Tumor With Supplements"
  }]
}