{
  "AuthorID": "didi719",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
  "Posts": [
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I had a bi-lateral mastectomy 7/07.  Since I did not have lymph node involvement I did not have to have radiation or chemo. I have been taking Arimidex since my cancers were ER+. I have absolutely NO libido whatsoever. Has anyone else experienced this and is there any treatment?",
      "MessageIndex": 0,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20911,0.htm",
      "Title": "Loss of libido after bi-lateral mastectomy and Arimidex"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "  On 2/14/2008 Kbcns7 wrote: My message to you was cut off.  Your doctors won't tell you that you will become a man with Arimidex or any other estrogen-suppression cancer therapy because THEY aren't enduring trans-sexualizing cancer therapy.  Do you know that European female body builders use Arimidex to develop bigger muscles and to become less feminine?  No you don't.  When one gets Arimedex, one agrees to have their femaleness destroyed.  That's all I can say, as a former user of  it.   After three and a half years on Arimedex, I myself decided to stop the therapy, without my oncologists's input or consent.  And when I told him that I thought it was too damaging to me as a woman, he suggested yet another estrogen suppressing drug.  At that point, I said to myself, my life is my hands and I have to stop the pharmaceutical abuse. What would he know, anyway.  They go by what the pharmeceutical companies tell them, make no mistake. Estrogen suppression therapy is only appropriate for men with prostate disease.  Good luck to ladies who can't say, wait a minute, I want to get some  more information, I want a week or two to do research, I want two more opinions,  I only wish I knew in 1996 what I know  now. .  .  According to my son-in-law who used to be a body builder, athletes who take steriods to 'bulk-up\" sometimes take Amimidex to block any female hormones the body naturally produces and to enhance the effects of the testosterone.",
      "MessageIndex": 11,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20911,0.htm",
      "Title": "Loss of libido after bi-lateral mastectomy and Arimidex"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "  On 2/18/2008 Logicat wrote:   On 2/13/2008 didi719 wrote: I had a bi-lateral mastectomy 7/07.  Since I did not have lymph node involvement I did not have to have radiation or chemo. I have been taking Arimidex since my cancers were ER+. I have absolutely NO libido whatsoever. Has anyone else experienced this and is there any treatment? I only had a left mastectomy, chemotherapy and radiation and have been on Arimidex for two years.  It took almost a year and a half before I decided that I was not only still a woman, (Oh, I forgot to mention, a hysterectomy in 1990 for cervical cancer), but that I was still capable of being attractive and sexual. Once I got feeling well enough and got my head back together, I made the conscious decision to look better, which in turn made me feel better!  I colored my hair, started using makeup again, dug out some clothes that I liked, being careful to make sure they would not show my prosthesis.  I still have problems wearing high heels because of the neuropathy from chemo treatments, but I'm doing better with lower heels.  Once I felt that I looked better and more attractive, it was easier to allow myself to relax and enjoy sex with my husband.  No, the libido is not the same as it was but it's a vast improvement over what it was two years ago. Yes, we do need Astroglide but that's a wonderful product and there are many others, easily available, that do not contain estrogen.  I don't know how much help this gives you but I don't think it's the Arimidex alone that causes so much problem with sexuality.  It's not a pleasant thing to be on but I look at the increased chance of survival and consider it worth the side effects. Thanks for the Info.  I agree the mental part is huge.  It isn't that I feel unatractive really.  For me my breasts were just the source of most sexual sensation and now with both breasts gone and then add to that the Arimidex with its side effects, I just feel totally unsexed.  ",
      "MessageIndex": 9,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20911,0.htm",
      "Title": "Loss of libido after bi-lateral mastectomy and Arimidex"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "  On 2/14/2008 Kbcns7 wrote: My message to you was cut off.  Your doctors won't tell you that you will become a man with Arimidex or any other estrogen-suppression cancer therapy because THEY aren't enduring trans-sexualizing cancer therapy.  Do you know that European female body builders use Arimidex to develop bigger muscles and to become less feminine?  No you don't.  When one gets Arimedex, one agrees to have their femaleness destroyed.  That's all I can say, as a former user of  it.   After three and a half years on Arimedex, I myself decided to stop the therapy, without my oncologists's input or consent.  And when I told him that I thought it was too damaging to me as a woman, he suggested yet another estrogen suppressing drug.  At that point, I said to myself, my life is my hands and I have to stop the pharmaceutical abuse. What would he know, anyway.  They go by what the pharmeceutical companies tell them, make no mistake. Estrogen suppression therapy is only appropriate for men with prostate disease.  Good luck to ladies who can't say, wait a minute, I want to get some  more information, I want a week or two to do research, I want two more opinions,  I only wish I knew in 1996 what I know  now. .  .  According to my son-in-law who used to be a body builder, athletes who take steriods to 'bulk-up\" sometimes take Amimidex to block any female hormones the body naturally produces and to enhance the effects of the testosterone.",
      "MessageIndex": 15,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20911,0.htm",
      "Title": "Loss of libido after bi-lateral mastectomy and Arimidex"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "What you are describing sounds like Candidiasis also known as yeast overgrowth.  Yeast infections can be a side effect of frequent antibiotic use.  I have had three surgeries for BC and before and after each one I was given high powered antibiotics to prevent MRSA (resistant staph).  Then I had an attack of acute diverticulitis-more high dose antbiotics.  I developed the worst yeast infection of my life.  Tongue, throat vaginal, rectal, it was awful.  My dr prescribed Diflucan and Nystatin.  Then I was prescribed probiotics. (beneficial bacteria to build up intestinal flora and immune system) She recommended Flora Q.  At first I had some problems from yeast \"die off\" reaction, but I stuck with it and I feel much better.  I would NEVER suggest anti-fungal treatment alone, but for me, the yeast infection was something that ocurred due to my compromised immune system from my other treatments. Taking extra vitamins and probiotics (as advised by my dr.) to improve my overall health won't hurt me.",
      "MessageIndex": 3,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19919,0.htm",
      "Title": "In-situ duct cells"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "My story is a little different, but I think it still proves the same point.  At my yearly mammo there was a \"tiny shadow\" and US was indicated. The US tech couldn't even find what they were referring to, but the Radiologist did find it.  She said that even though she was \"99.9% sure it was nothing\", their protocol was to biopsy it.  It turned out to be a stage 0 ductal insitu cancer.  My surgeon sent me to have bi-lateral MRI's as standard pre-surgery procedure.  They found a stage 1 invasive ductal tumor on the other side. I had lumpectomies, but even though the left side was stage 0, they found several tiny (like flecks of pepper) cancers in the duct.  4 of the 6 margins on that side were not clear. In the end I went back and had bi-lateral mastectomies.  I often wonder what my prognosis would have been if the Radiologist had decided to skip the biopsy since she was so sure it was benign.  The right side that didn't show up on the mammo had already invaded to the surrounding tissue. At this point there was no lymph node involvement so I didn't have to have chemo or radiation. (I would have required radiation if I had stopped at lumectomies).   ",
      "MessageIndex": 2,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20598,0.htm",
      "Title": "Be your own advocate"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I am so glad to read of others who decided on bilateral mastectomy and are at peace with the decision.  I had small ER+ tumors occur simultaneously in both breasts.  I had lumpectomies and planned to have radiation.  No lymph node involvement, but the path report showed small (pepper sized) cancers on 4 of the 6 margins on the left side. At first I said \"NO WAY am I having a mastectomy\".  My doctor was very kind and explained all of my options.  He recommended I reconsider mastectomy.  And then he said that if I did it bilaterally I would be essentially cured and would not have to do radiation. My family was so upset and begged me to consider mastectomies.  My husband was very supportive and said it was my decision, but really wanted me to go the bilateral mastectomy route. I did and had reconstruction with implants.  I was comfortable with my decision, but then when I read these studies I start to second guess my decision. \"Was it really necessary.  Should I have taken more time to decide?\"  In the end, I know I just didn't have the strength to deal with the unknown \"what ifs\".  Yes it may seem extreme to some, but I didn't want to have to deal with the uncertaintly.  Especially since simultaneous occurance in both breasts in very rare and no one could really tell me what my odds were with the different treatments.",
      "MessageIndex": 7,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17396,0.htm",
      "Title": "Bi-lateral Masectomy"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I had bilateral breast cancer w lumpectomies, but due to an inability to get clear margins on the left, I opted for bilateral  mastectomies.  Prior to BC, I was on HRT for insomnia which started at menopause.  I began taking Arimidex and immediately the insomnia returned with a vengence, but no other noticeable side effects.  I was tired all the time, but was totally sleep deprived.  My oncologist prescribed Ambien CR which really helped, but then I had to fight with my insurance company.  After 7 months on Arimidex I began to have severe aching and joint pain that kept me awake at night. My lower back was just in agony and I assumed it was from the Arimidex. My oncologist prescribed something for the joint aches and I was taking Aleve constantly.  Before I could get the prescription filled I started to run a high fever and had excruciating pain in my left side. CAT scan showed acute diverticulitis which is a serious infection in the colon.  Fortunately mega antibiotics healed it. After the antibiotics my joint pain went away. Afterward I realized that I had probably been running a low grade fever for weeks and the cause of my pain wasn't the Arimidex at all, but an infection that could have been fatal. My point is that if you are experiencing severe symptoms, it might be a good idea to get checked out before you just assume it's a side effect.",
      "MessageIndex": 15,
      "PostDate": "11/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I too have been on Arimidex since 7/07 and for me the worst was the return of the 3am wake-up and not able to return to sleep that I had experinced at menopause.  After a couple of months of total sleep deprivation, my dr prescribed Ambien CR and I found I could deal with the other symptoms if I was able to get a good night's rest.  Then my insurance refused to pay for the CR and insisted I use the generic which was great for getting to sleep, but I would still wake up and not be able to return to sleep.  I tried self-hypnosis CD and that did help some, but then I discovered that if I take half of the generic at bedtime and then take the other half if I wake up and can't return to sleep, it works essentially like the CR, plus some nights I don't need the second dose. As for the muscle aches, my dr says that is a common side effect.  However I would caution anyone who has a severe form of these symptoms to not just dismiss them as a side effect without getting checked out.  I began to have severe aching and back pain so bad I just couldn't get comfortable and at times it was nearly unbearable.  Then after several weeks, I woke up in the middle of the night in excruciating pain plus fever. Turns out I had acute diverticulitis (severe infection of the colon).  Luckily for me it was diagnosed before my colon perforated. After taking mega-antibiotics the infection cleared and my joint pain was gone also. My assumption that it was the Arimidex delayed me getting treatment.  I would take Aleve before bed for the joint pain and then when I would wake up drenched in sweat, I just assumed it was \"night sweats\", but it was the fever breaking.",
      "MessageIndex": 4,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19683,0.htm",
      "Title": "Arimides"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I had a severe pain in my breast for an entire weekend that I disregarded as probably a cyst since I had been told (incorrectly)  that BC isn't painful. Lucky for me it was time for my regular yearly checkup.  I did in fact have cancer.  I had had several \"false alarms\" over the years and didn't take it seriously.",
      "MessageIndex": 2,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20678,0.htm",
      "Title": "Questions"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "Never let fear keep you from seeking a dignosis.  I have had bilateral BC adn know how scary it can be, but the sooner a cancer is diagnosed, the better the chances for full recovery.  Good Luck!",
      "MessageIndex": 4,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20338,0.htm",
      "Title": "please reply someone! urgent!"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "MRI's are more accurate than mamo or sonogram.   I was diagnosed with DCIS in my left breast in May.  Dr sent me to get MRIs of both sides pre-surgery.  MRI showed small invasive tumor in the RIGHT breast. Without the MRI the right side might have gone undetected for another year. And it was more advanced than the left side.  I had fibrous breast tissue which can be hard to visualize. The MRI was very easy. Since I was so stressed out, the dr did give me Xanax which helped.  It wasn't painful at all, I was just so stressed from everything else.",
      "MessageIndex": 3,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20796,0.htm",
      "Title": "LCIS"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "You are absolutely correct, MRI's show much greater detail and can detect small tumors that might not be found with a mammo for years.  After a small tumor was found on my left side the surgeon ordered MRI's for both sides. (Of course he had to justify to insurance by saying I had family history which was a bit of an exaggeration) The MRI showed invasive BC on my RIGHT side as well.  My oncologist told me that the stage 0 on my left side may have saved me from metastatic BC since it would have been another year before my next mammo and the undetected cancer on my right had already invaded the surrounding tissue. BTW, I did not have large breasts, but very dense fibrous ones that I'm told are often difficult image. Bottom line, when there is any doubt you should have an MRI.",
      "MessageIndex": 1,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19923,0.htm",
      "Title": "Mammograms"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I agree, go with the larger expansion.  I had bilateral matectomies 7/07 with expanders for reconstruction.  I didn't want to have enourmous breasts, but on the other hand mine were always a little small so I decided to go for a full C.  When I reached the desired size, I asked my PS if I should go a little larger for the reasons you stated and he said, \"No, if this is the size you want then we should stop expanding and schedule the surgery for the permanent implants.\"  I had quite a bit of encapsulation around the temps and he said when he broke up the scar tissue it would allow for more space. After the surgery I am a B cup.  I was so upset and he made all kinds of excuses. He said he put in the exact amount of saline as the temporary implants and that I had said that was the size I wanted.  I said \"All I know is that I was nearly overflowing a C cup bra before and now that same bra caves in.  I had to go buy B cup bras.\"  He said when I have the nipple reconstruction done he can replace the implants with larger ones, but I don't want to have ANOTHER surgery. I have already had 3.  Bilateral lumpectomies with lymph node resection first, then complete mastectomies followed by reconstruction.  I am so discouraged, I did not keep my next appointment with the PS and haven't been back.",
      "MessageIndex": 2,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19448,0.htm",
      "Title": "Breast Reconstruction after Bilateral"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I had a bilateral mastectomy with reconstruction in July 2007. I find hospitals to be freezing cold and a large loose fitting robe was the one thing I was glad to have. I found the hospital stay to be the easy part.  Be prepared that since both arms will be incapacitated, you will be unable to do much when you get home.  I had lumpectomies in June, but didn't achieve clean margins, so I opted to go ahead with the full mastectomies.  In June all my friends and family sent flowers and while I appreciated it, my practical side hated the fact that everyone spent so much money on flowers and it reached the point where I had problems finding a place to put them all.  In July when I went back I confided in a friend (also a BC survivor) that while I loved the flowers what I had really yearned for was real food instead of take-out from the neighborhood burger place. She orchestrated a sign-up with my co-workers and they brought home-cooked meals for a month.  Don't be afraid to speak up when someone asks what you need.  Before this happened to me I always sent flowers, now I either take a meal, or send a fruit bouquet.",
      "MessageIndex": 2,
      "PostDate": "13/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19649,0.htm",
      "Title": "Bilateral Mastectomy - hospital question"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "My mother-in-law had breast cancer and I was told by a plastic surgeon that since it was on my husband's side of the family it did not increase my daughters chances.  Then after I was diagnosed last year, I mentioned that to my surgeon and was told that she couldn't believe a doctor had told me that because BC absolutely CAN be inherited fromt the father's side of the family. The important thing to realize is that 85% of new cancers are in women with NO FAMILY HISTORY, so everyone should be vigilant.",
      "MessageIndex": 8,
      "PostDate": "04/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21168,0.htm",
      "Title": "question about breast cancer"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I realize this is too late to help you but maybe someone else will benefit.  The one item that I couldn't have done without was a foam bed wedge once I got home.  I have never been able to sleep on my back comfortably and am prone to severe reflux. A friend had one she used to help the reflux. When I got home I could get comfortable only in the recliner.  My husband found one of these pillows at a medical supply store.  It was about $40, but worth every penny.  I could lay in bed on the wedge with my arms supported by pillows.",
      "MessageIndex": 3,
      "PostDate": "16/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19649,0.htm",
      "Title": "Bilateral Mastectomy - hospital question"
    },
    {
      "AuthorID": "didi719",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/didi719",
      "Content": "I had bi-lateral BC. The first needle core biopsy was very simple and no pain.  I drove myself. After an MRI showed a spot on my other side, I required an MRI biopsy which is much more involved. I was so worn out from tests and biopsies and I just felt panic at the thought of another biopsy.  I asked my doctor if he could prescribe something for the anxiety and he gave me Xanax to take before the procedure, and later before the surgeries. It made everything so much easier.  Don't be afraid to ask for anxiety meds if you feel like you need them.  It is a very stressful situation.",
      "MessageIndex": 2,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20757,0.htm",
      "Title": "May Have Breast Cancer"
    }
  ]
}