{
  "AuthorID": "Donna_B_the_mom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
  "Posts": [
    {
      "AuthorID": "Donna_B_the_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
      "Content": "I also have triple neg. br. cancer, if you want to there is a site you can go to called TNBC.com.  There is nothing but people and there families who have this particular type of cancer there.  I pray for the  best for you and your family.  let me know how you're doing, I've finished treatments and so far still in remission after 6 months.  This type of cancer is easy to treat even when its caught late like mine was. I was stage 3 2b with node positive.  So keep pushing for answers from your dr.  If you don't get what you like find another Dr.                                          A friend                                           Donna      ",
      "MessageIndex": 5,
      "PostDate": "17/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17658,0.htm",
      "Title": "negative hormone receptors"
    },
    {
      "AuthorID": "Donna_B_the_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
      "Content": "  On 12/15/2007 lookingforward wrote: Hi everyone! I had a single mastectomy about two weeks ago. They thought it was stage 1 but I had two tumors, one was about 1 cm and the other was 3.5 cm. MUCH larger than expected. ER/PR +, Her2 -, and unfortunately two lymph nodes positive, K67 tests were 3 and 8???. PET scan and MRI negative for lymph and other areas, but I am really depressed. Doctors were telling me that chemo was a big maybe and now I am stage 2B and they are talking chemo, radiation and not so encouraging about my chances for survival. I am freaking out. I don't mind the treatment (had a port put in yesterday) but I want some hope to hang my hat on! Everything keeps changing for the worst and I don't trust anything anymore. Please give me some advice. I am meeting with my oncologist on Tuesday and can't stop crying.  Best wishes to all.   Hi, I know you are scared, I was too when I found out last year about mine. I was told mine was stage 3 grade 2.  But let me tell you this, they can't tell you your outlook isn't good, cause they don't themselves theres so many new meds out there too beat this.  You said you're er-pr +, theres alot of good meds for that, and it will put it in remission quickly. I'm  a triple negative,er-pr neg. and her2 neg.  Theres not much for me to take so they gave me adriamyacin-cytoxin, 4 rounds and then taxotere 4 rounds, plus nuelasta and procrit for blood counts to stay up while recieving it. And I've been in remission now for 9 months.Short story told my doctor at first said I would probably not go into remission right away if at all.But its up too you and your outlook. Pray if your religous.Don't look back only forward when you can.  And try too say this too your self .               ( I MAY have CANCER, but it doesn't have ME)                                        Love from a sister with br. cancer,                                                     Donna  ",
      "MessageIndex": 9,
      "PostDate": "21/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18890,0.htm",
      "Title": "SO Scared!"
    },
    {
      "AuthorID": "Donna_B_the_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
      "Content": "  On 1/16/2008 Sharpies1978 wrote: Hello,  I'm wondering if anyone can offer me some ideas on a gift for my mom. She will be having surgery (radical mastectomy) on Friday. I'd like to get her an extra special get-well gift. I was thinking of something that will help her through this time but I don't want it to be strictly about the cancer...I'm sure she thinks of it enough. Any ideas?  Steph   Hi Steph, I know its a hard time for your mom, I was diagnosed with metastatic breast cancer in 8/2006. I was stage 3, with node involvement.  A friend of mine gave me a little pig with wings on it, and the message with it read If pigs can fly then so can I, I will not let this cancer beat me.I know it is sort of about cancer but it really is  a morale booster. I was severly depressed, but for a reason unknown at the time it has helped greatly.  I was told I didn't have great odds, but I went into remission, and so for for 9 months have stayed there. She needs something she can focus on to give her strength.  Even if its just a little pig with wings. It will work.  And if you are your mom need anyone to talk to you can email me and I be here.  My email is --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--   Please let me know how your mom is doing .                                          A sister in Kentucky,                                           Donna    ",
      "MessageIndex": 9,
      "PostDate": "19/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19779,0.htm",
      "Title": "Gift for my mom"
    },
    {
      "AuthorID": "Donna_B_the_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
      "Content": "Hi just wondering how many out there have been diagnosed this year so for with my type of br. cancer?  I've been told we are few.  But thats not so true its just we have no really good treatments,  Except for ACT, and possibly a few others.  That may put it in remission, I'm 47, white and was told usually you only see this type in younger women, under the age of 40.  I've been in remission since 6/25/07.   At least I pray I'm still in remission  Hope to hear from others soon.                                             Donna    ",
      "MessageIndex": 0,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16579,0.htm",
      "Title": "triple negative br. cancer"
    },
    {
      "AuthorID": "Donna_B_the_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Donna_B_the_mom",
      "Content": "  On 9/25/2007 Kimarie wrote: Has anyone given any thought, that all the treatment we have been thru for breast cancer, chemo, radiation, and tamoxifin in my case.  Has caused an imbalance in our thryroid which may be the reason for our weight gain and foggy brains.  I recently called a wellness center that could not treat me for my menapause because of the estrogen positive cancer, which I knew.  But they mentioned how I should have my thyroid checked.  Tell me what you think. Kimarie Hi Kimarie,   I have triple neg. br. cancer stage 3 2b, after I finished my chemo 3/12/07 , my thyroid started becoming hypo pretty bad, and I started on synthroid for it. You need to definitly get it checked as my dr. said its also possible to develop thyroid cancer from the chemo unfortuantly.  Please let me know how you are doing.                                Donna                 ",
      "MessageIndex": 4,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16480,0.htm",
      "Title": "Tamoxifin/Thyroid"
    }
  ]
}