{
  "AuthorID": "Doris_W_1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Doris_W_1",
  "Posts": [
    {
      "AuthorID": "Doris_W_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Doris_W_1",
      "Content": "Hi Debbie, Was glad to read your message about breast cancer. I am also in stage four and take Zometa every month, feeling fair most days but get tired quickly. I take tamoxifen also, some good days and some bad. Have metastasized cancer in backbone and have a lot of back pain, take pain pills to relieve this. Was glad to hear someone else was on Zometa, for I had never heard of it before until I started on it 5 months ago. Email me if you like would like to chat. Take care and God Bless!!! Doris",
      "MessageIndex": 12,
      "PostDate": "03/02/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,444,0.htm",
      "Title": "Stage 4 breast cancer, need help"
    },
    {
      "AuthorID": "Doris_W_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Doris_W_1",
      "Content": "Hi, I had breast cancer and then it went to bone, have taken radiation and chemo, after 2 years it has returned, to other parts of body. I am on femara once a month and an injection of faslomax. Still having pain and cancer count is growing, does anyone out there familiar with this type of cancer and drugs. Thank you for your help. Darcie",
      "MessageIndex": 0,
      "PostDate": "30/04/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,560,0.htm",
      "Title": "Metastatic Cancer in Bone"
    },
    {
      "AuthorID": "Doris_W_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Doris_W_1",
      "Content": "Hi Faye, Saw your note on the MyCancerCompass message board. I was on chemo for 6 months to begin, and then went to the drugs I mentioned. I have a great cancer doctor that is up on all new drugs, I have just now started on \"Femara\" which is suppose to be helping the bones and the pain, also an injection every month to help me. I do have a treatment every month of Zometa, which helps the bones. Your doctor should be aware of these new drugs, mention them to him. I will be praying for you, for I know how depressing one can get. I am in the IV stage and I know that is not good. My blood count went down also and they gave me injections for this, hope your doctor is doing the same. Stay in touch. Write me and God Bless!! Darcie",
      "MessageIndex": 3,
      "PostDate": "17/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,560,0.htm",
      "Title": "Metastatic Cancer in Bone"
    }
  ]
}