{
  "AuthorID": "Dovie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
  "Posts": [
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "I have been living with breast cancer for 13 years. During this time I have not had 5 years cancer free. Therefore, I have been through a lot of surgeries and treatments which have lead to my most recent dilemma. I started my journey with a lumpectomy, radiation, and chemo therapy (A/C) and started on Tamoxifen. Three years later the cancer came back in the same breast. At this time I had a bilateral mastectomy, chemo (Taxotere), reconstructive surgery, and changed to Femara for the hormone therapy. Approximately one year after my last chemo treatment we found the cancer had metastasized to my bones. My hormone treatment was changed to Aromasin, I had my ovaries removed and I started on monthly I.V. treatments of Aridia for my bones. I enjoyed a little over 4 years of remission with this treatment alone. Unfortunately, in Jan '08 we discovered that the cancer had spread throughout my spine, hips, skull, pelvis, etc and several spots were seen on my liver. This was devastating news but, the doctor was very hopeful that a pill form of chemo (Xeloda) would do the trick. They warned me of the possible side effects of the burning hands and feet. Well, these side effects were more than I could handle. They were so severe that I could not walk or function normally. The treatment was reduced several times to get to a level where I could tolerate it. After about 4 months we repeated the scans only to discover that not only did this treatment not work in reducing the cancer that was there, the cancer spread like mad. My liver now has extensive disease and the disease in my bones has spread as well. In June I started on Abraxane and Avastin with three weekly treatments of Abraxane, two weekly treatments of Avastin and one week off. After one completed round (three weeks) and one additional week of treatment my tumor markers have doubled. It appears as though the treatment is not working. While I know some people experience false negatives and positive from tumor marker tests mine have been a pretty good indicator over the last 13 years. So, I know it is a long shot but I am wondering if there is anyone out there that has had a similar experience and have gone on to find something else that has worked. I have read a few things about Cancer Treatment Centers of America on this message board and for the most part it sounds rather promising. Many well intentioned friends and family tell me to get another opinion or to go to MD Anderson or the many other cancer centers. It is so hard to start all over with doctors, tests, and scans! But, I know it is probably the best thing since to this point I have only had very traditional treatment. If anyone has information that might help me I would greatly appreciate you sharing it with me. I remain hopeful!",
      "MessageIndex": 0,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25832,0.htm",
      "Title": "Chemo not working, anyone experience this?"
    },
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "Diana, Thank you so much for your input on CTCA. I am traveling to Tulsa, OK tomorrow for evaluation over the following 3-5 days. I am looking forward to seeing what it is all about. I did confirm that my suspicion that the chemo I was on was not working so I am currently in no treatment. I am scared and feel a little lost. There is so much to think about and the pressure of making the right decision is really tough. But, I have faith that something will turn up. Thanks again for sharing your experience with CTCA!",
      "MessageIndex": 4,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25832,0.htm",
      "Title": "Chemo not working, anyone experience this?"
    },
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "On 7/9/2008 Bunnyswanson wrote: Breastcancer.org is a great site for info and I hope the moderator is not offended but the women there are a fountain of knowledge and long term survivors some of them.  Best advice also from John Hopkins asktheexpert.com as she is a two time BC survivor.  I know they will include \"get a 2nd and 3rd opinion\" in their responses, preferably at a center that is renowned for their work with BC patients.    www.breastcancer.org   Thank you very much for this info. I am taking that advice and getting several different opinions.",
      "MessageIndex": 5,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25832,0.htm",
      "Title": "Chemo not working, anyone experience this?"
    },
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "On 7/10/2008 Leemg wrote: How are you feeling physically at this point??  I contacted the Cancer Treatment Center also at one point and my insurance which is an HMO would not cover services.  But you should call them about a consult, however, they may require their own testing so if your ins. does not cover prepared to pay for their services.  They were able to give me a ball park figure over the phone.  Have you considered any BC trials??  I would definitely look to see if any are being conducted with your stage cancer.  I have read in CURE magazine where some people have responded well in trials.  Research is working on finding tests that determine who will benefit and from what chemo agent so people are not put on a drug with side effects that will not benefit their cancer.  They are doing this to try to find the right \"cocktail\" so to speak to address an individuals tumor.  Unfortunately, all this takes time that is why I would suggest a trial.  May God bless you.  Enjoy each day as life is precious.  Hope you are feeling well so you can engage. You are so right about enjoying each day. I am a firm believer in that. I would say that the hardest part is dealing with pain. I have now been taken off of the previous chemo because the cancer continued to grow with it as I had suspected. I found out that my insurance will cover treatment at CTCA so I will be going there on Wed. I will see another doctor next Tue who is involved in a lot of research and will most likely find a trial that fits me. I have been looking at the ACS website for clinical trials and it is tough. There really weren't that many that would fit me. But, I have faith and I know that with that faith I will be guided to the right place. Thank you for your reply.",
      "MessageIndex": 6,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25832,0.htm",
      "Title": "Chemo not working, anyone experience this?"
    },
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "On 7/12/2008 smitten wrote: Hi, y'all. I'd love to say it's nice being here, but...... 53 years old, married, two children, one still at home.  I'm a RN and found a lump in my left upper chest wall at work one day in late February.  Asked one of the docs to check it out and he sent me to a surgeon who specializes in breast cancer.  Biopsied the spot, and low and behold it was invasive ductal breast cancer.  Then began my journey to the land of oncologists, radiologists, plastic docs, etc.  We elected to do bilateral mastectomies and the first surgery date was March 18th.  All ready to go to surgery when a critical lab was reported:  blood glucose was 517 :( Surgery was rescheduled for March 28th..spent one night in Observation, discovered a hematoma and had to have surgery again the 31st.  So far I still have the tissue expanders (I call them my hockey pucks) in place.  Implant surgery is scheduled July 30th.  Had the Oncotype DX testing and scored a 43...sigh. I got my Bard PowerPort yesterday.  I see the oncologist next week to discuss type of chemo, schedules, etc.  I also see a gyno doc for the lovely and exciting transvaginal ultrasound as I'm having a complete hysterectomy (prophalactic) and my doc doesn't want to go in blindly.  Honestly, I think the thought of losing my hair is my biggest worry.  I've decided to shave it and get a spray on tan..hehe And I'm seriously considering foregoing the nipple tattooing and get a hummingbird on one breast and a flower on the other.  I've never had tattoos and love the thought of being a secret rebel ;) I've had great family/friend support, but it's great to have a place like this with people that KNOW what I'm going thru.  Thanks, y'all :-) Oh girl! Aren't those expanders the worst! Who knew having Barbie boobs would be such a process. I opted to not get the nipples done because that would require me to wear a bra at times. And I NEVER wear a bra anymore! I will tell you that with the expectation of losing my hair with my most recent chemo (4th time) I decided that I wanted to shave my head and get a tattoo on my head! This way, I figured, people would REALLY have something to stare out when I went out with my new buzz cut. So, I have a lovely dove carrying a pink ribbon in its mouth on the back of my head. It is my first and only tat and one of those \"I'll NEVER do that\" things that I did. What the heck, seize the day. Oh, one more thing, I recently hung a hummingbird feeder and oh what a joy. I love the idea of a bird and flower. You go for it!! Best of luck to you! Keep up the great attitude and don't give up the fight. Karen",
      "MessageIndex": 5,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25965,0.htm",
      "Title": "Newbie here....."
    },
    {
      "AuthorID": "Dovie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dovie",
      "Content": "It is very important to understand if the cancer in the bone is related to the breast cancer (metastatic) or a secondary bone cancer (unrelated to the breast) As far as radiation goes, It is very unlikely that they would radiate the same breast. However, if it is in the bone and is causing pain, radiation is used to control the pain. It is important to understand how many lesions there are on her bones. This will also determine the type of treatment. More than likely she will need to be on chemo and if she experiences a lot of pain, they can use radiation to treat those areas that are painful. However, radiation is usually not the answer for treatment in breast cancer that has metastasized to the bone and is in multiple places. I have stage IV breast cancer that has metastasized to my bones and liver. I have had both chemo therapy and radiation for the disease in my bones. I also had radiation treatment to my breast when I was first diagnosed with breast cancer. When it returned in the same breast my only option was a mastectomy. If your sister's cancer has also returned in the same breast she would most likely have a mastectomy as well. Blessings to you and your sis. It is great that she has you looking into things. When you are in the midst of a cancer diagnosis it is a huge blessing to have someone else as your advocate. And waiting three weeks can be devastating news when you have the cancer. Any chance she could go to a different doc? Karen",
      "MessageIndex": 3,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26470,0.htm",
      "Title": "Information please."
    }
  ]
}