{
  "AuthorID": "Dozer",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dozer",
  "Posts": [
    {
      "AuthorID": "Dozer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dozer",
      "Content": "  On 6/1/2007 Carlineann wrote: Hi, I apologize for not responding to your email about the vitamin C IV. I decided against taking the IV but have done some other types of alternative treatments. My newest treatment is three enemas a day, the first one distilled water, second is coffee, and the third is wheat sprout and probiotics. I also take a Kylo drink daily, fruit smoothies with wheat grass, and aloe with coral calcium. The aloe and calcium has brought up my ph to 6.2 as of today. It has always been around 5.5. I take a ph daily with a special meter first thing in the morning after 5 a.m.I still eat fresh veggies(parsley and swiss chard or whatever available from my garden) and fruits, eggs, some nuts and seeds, some wild caught fish. I take some supplements still like Paw paw, glutamine and glutathione, beta glucan 500mg, coq10 when no paw paw and I do liver and parasite  cleanses. God Bless you. Carline Hi Carline,        It's Donna again I just found your posting on what you are doing, I will go back and read it again more thoroughly, thanks for responding to my post. Take care-Donna  ",
      "MessageIndex": 14,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Dozer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dozer",
      "Content": "  On 11/6/2006 Carlineann wrote: I had a mastectomy in August with three lymph node positive. I had decided to try other alternatives besides chemo and radiation. I am taking Paw Paw and have had the amalgam in my teeth removed. I take many other supplements as well as eat very healthfully such as eating black grapes continuously all day long. I would like to try the Vitamin C IV but would like to hear more info about it such as the amount to take and how often. Carline I had a right mastectomy 3 weeks ago and chose not to do chemo or radiation, along with that I have changed my diet drastically to a more alkaline diet, colonics 3x per week, IV vit c 4x per week, poly mva with coq10. During the iv I have increased urination and thirst due to the diuretic effect of the vitamin c sometimes i feel a bit shakey and nauseas, my doctor feels it may be effecting my blood sugar during treatment, this feeling usually resolves within 1 hour and does not typically happen to most patients, at least according to my doctor. I am curious to know how you are doing with your alternative treatment, are they following your tumor markers or anything else to check your cancer status? It is nice to find other people who are treating alternatively and to find what is working for them. I wish you great success in your journey. Please feel free to email me any time. Donna",
      "MessageIndex": 7,
      "PostDate": "03/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Dozer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dozer",
      "Content": "  On 6/1/2007 Carlineann wrote: Hi, I apologize for not responding to your email about the vitamin C IV. I decided against taking the IV but have done some other types of alternative treatments. My newest treatment is three enemas a day, the first one distilled water, second is coffee, and the third is wheat sprout and probiotics. I also take a Kylo drink daily, fruit smoothies with wheat grass, and aloe with coral calcium. The aloe and calcium has brought up my ph to 6.2 as of today. It has always been around 5.5. I take a ph daily with a special meter first thing in the morning after 5 a.m.I still eat fresh veggies(parsley and swiss chard or whatever available from my garden) and fruits, eggs, some nuts and seeds, some wild caught fish. I take some supplements still like Paw paw, glutamine and glutathione, beta glucan 500mg, coq10 when no paw paw and I do liver and parasite  cleanses. God Bless you. Carline Hi Carline,        It's Donna again I just found your posting on what you are doing, I will go back and read it again more thoroughly, thanks for responding to my post. Take care-Donna  ",
      "MessageIndex": 13,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Dozer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dozer",
      "Content": "  On 6/1/2007 Carlineann wrote: Hi Donna, I just now saw your email. How exciting to find someone else that is using alternative treatments. I have had a hard time finding other people like you. I would love to get a board of us together so that we can share and record and document our findings. I decided against the vitamin C IV but I did take 50 g while I had my teeth and cavatations taken care of and I felt great. No drying of my mouth, etc that you experienced. I hope you can read my other email of the things I am now doing with my treatments as far as nutrition and enemas and cleanses.  I was wondering how you got a doctor to give you an IV? I live near Austin, TX and there is an internal medicine doctor in Austin and a doctor in Wimberly that will give the IVs.( I hope this answers the other message that was before your message) I just did not feel comfortable about having the IV done continuously. Call it intuition I guess.  I have not done anything for markers but I did order the AMAS test which was sent to me from a group out of Houston. Now I need a doctor to give it to me. It is a blood test for cancer. I will try the doctor in Wimberly. The one in Austin wants me to do Chelatan and vitamin C IV first. Please keep in touch and let me know how you are doing and what you are doing.  God Bless. Carline  Hi Carline,   I did not get to see which treatments you are doing, I found this message board by accident (not very computer savvy!) so I have only been receiving responses to my initial post. I am starting to wean off the Vit C, it still makes me feel ill, my tumor markers have come down but there is no specific test for breast cancer. I have heard of the AMAS but for some reason my doctor does not want to do it. He works with a naturopath who does recommend it though.I am finding  there is alot of people into natural therapies, the more I network the more people I meet. I met a woman who is a professor, she has some friends into research who have recommended something called Zeolite, (I think that's the name) I will send you the website. If you would like I will give you my email address and we can share info. please let me know what and how you are doing. What type of cancer do you have?      Take Care, talk to you soon-Donna",
      "MessageIndex": 12,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    }
  ]
}