{
  "AuthorID": "Dulcey",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dulcey",
  "Posts": [
    {
      "AuthorID": "Dulcey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dulcey",
      "Content": "Hello, my name is Dulcey and i am a survivor of breast cancer. It will be six years in June since i had my mastectomy and reconstruction. I found the month previously that i had three tumors, ranging from small to large,which were all in the milk ducts of my right breast. This was news i never thought i would hear since i was 32 at the time. My doctors had been checking me for ovarian cancer ( my mother had died of this when she was 45) but they had never thought to give me a mammogram. My doctors told me i would not have survived six more months,since all three tumors were cancerous and the cancer had gone through all my lymphnodes. I chose to have a trans flap reconstruction which involved taking stomach muscle and having it used to remake the breast instead of an implant. I was given several months to recooperate and than was started on a every 21 day regimen of chemo for six months. I did pretty well with this treatment and the only drawback was losing my hair ( which i made sure i grew back twice as long! )   And here i am almost six years later feeling great! I get checked every six month by my cancer doctors and have regular mammograms and a once a year mri . I have four great kids and i am getting married to my soulmate Todd , who loves me and my scars on June 20th. Life is good",
      "MessageIndex": 0,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34568,0.htm",
      "Title": "sixth year of remission"
    },
    {
      "AuthorID": "Dulcey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dulcey",
      "Content": "  On 3/24/2009 Neveah wrote: Hi Dulcey,   I was just reading your story about you being a 6 year breast cancer survivor and it made me feel so happy . I will be 28 years old this year and unfornately, i was diagnosed with triple negative breast cancer in December of 2007 when i was 26.  Triple negative is a very aggressive form of breast cancer.  This breast cancer does not respond well to hormonal drugs.  The only thing that will treat triple negative breast cancer is chemotherapy and radiation treatment.  I get so terrified of relapsing and having a recurrence and losing my life that i don't know what to do.  Reading your story about how you are still alive after 5 years has given me some hope.  Thank you for sharing your story and may God bless you.           I'am sorry that you had to go through breast cancer at such a young age. Its hard no matter what age you are , but it can make you feel like that much less of a women in your own eyes and make you feel that others see you in the same light. My cancer was also a negative receptor. My cancer was not run by my hormons, so i will always live with the chance that i will either have cancer in my remaining breast, or i will develope ovarian cancer like my mother died of. My doctors are currently trying to get me sponsorship for the braca 2 test, which cost over 3,000 dollars. But i stay positive, i have four kids to live for and a wonderful husband to be and i think your health is related to how good you mental state is. If you continue to picture a healthy ,cancer free future for yourself i believe you can make it happen( with consistant followups to you doctors of course) Good luck to you! Thank you for writing to me.              Dulcey",
      "MessageIndex": 5,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34568,0.htm",
      "Title": "sixth year of remission"
    },
    {
      "AuthorID": "Dulcey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dulcey",
      "Content": "  On 3/24/2009 trehouse60 wrote: Congratulations on your upcoming marriage!!  We will do the happy dance for you that day!! Thank you for sharing your success with us. I haven't heard from many women who had the trans flap done.  How was that in terms of recovery? Sincerely, Tre         Not to bad, the breast did not hurt at all,since the nerve ending were all taken when the breast was \" gutted out\" as i like to call it . I describe it to people as if you was scopping out a pumpkin. Cut off the lid and clean out the insides! The stomach incision was a little uncomfortable since it was from hip to hip,and i came home with two wonderful \"grenades\" draining fluid out.I had those for a week before the docs would remove them. But i was up walking around the day after the surgery and back to work in eight weeks. I did develope a herna under the area where they put in a mesh support on my left side of my incision,but i think it was more from me trying to lift heavy objects to soon than anything else. I will be looking forwards to your \" happy dance\". If the ground shakes i will know where it came from!  Dulcey",
      "MessageIndex": 6,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34568,0.htm",
      "Title": "sixth year of remission"
    },
    {
      "AuthorID": "Dulcey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Dulcey",
      "Content": "Thank you very much! I hope for a cure every day, for breast cancer and all other types of cancers. I want to be around for many years to come.",
      "MessageIndex": 2,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34568,0.htm",
      "Title": "sixth year of remission"
    }
  ]
}