{
  "AuthorID": "Ed_S",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ed_S",
  "Posts": [{
    "AuthorID": "Ed_S",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ed_S",
    "Content": "Tammy... My name is Ed (age 45), married w/4 children. I was diagnosed with Stage IV Non-Hodgkins Lymphoma in March of 2003. I had all lymph nodes involved, bone marrow, and 4 tumors which manifested on top of my scalp. The doctors said my disease is incurable. I was extremely devastated. I felt so helpless. I have gone through 6 months of Chemo, and monoclonal antibody therapy and have been declared in remission only for the doctors to tell me its only a matter of time and it will return. I have survived by maintaining strong faith and trust that I had much more to offer to others by doing everything I could to get better. I am in the medical field and I wanted to get back to taking care of patients instead of being one. I wanted to find out everything I could to live my life without a dark cloud looming over my head. I did alot of internet research and came across several key books and web-sites that were extremely beneficial. With me being in the medical field I particularly searched for things that I could validate by many sources and research. I came across two books that in my opinion are absolutely essential. The first is a book called \"Hope - Beating cancer in mind sized bites\" by Vickie Girard. This book is about Vickie's struggle with breast cancer not once but twice. She was not given much hope until she described how she found out how much the power of nutrition brought her back to a place where she is now cancer free. It is a very powerful and riveting story and very easy to read. She did a consultation by the author of another book called \"Beating Cancer with Nutrition\" by Patrick Quillan - www.patrickquillan.com I also after reading vickie's book did a consultation with Dr. Quillan who has his doctorate degree, is a nutrition specialist and has worked with hundreds of cancer patients with amazing success. I have followed the books info and I am amazing my doctors with my progress. No more tumors, no active disease and I feel great with a much more improved outlook. I trust that this helps you and gives you hope as others have said please do not give up but pray for faith to endure. You will amaze yourself and continue to touch others with your life. Tammy, my wife and I will pray for you. Ed",
    "MessageIndex": 5,
    "PostDate": "27/09/2004",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1298,0.htm",
    "Title": "Hopelessness/hopefullness"
  }]
}