{
  "AuthorID": "El_Tigre",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/El_Tigre",
  "Posts": [
    {
      "AuthorID": "El_Tigre",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/El_Tigre",
      "Content": "Hi all, I am the husband of a beautiful 36yo woman who has breast cancer. She is my best friend. We have been together since we were teenagers. I have posted on other forums, and have received very good advice on how to help her. She had a double mastectomy last Friday and is recovering well. We are still waiting for the doctors to call in regards to the pathology, but we know it's been released and there are multiple positive nodes. If anyone has gone through this experience, please let us know what treatments were like and how successful they were. We draw courage from other fighters. I will also link my wife's blog detailing her fight for those that are interested in learning the background of where we are now. It's been the longest, crappiest summer of our lives. https://eltigrefightsbreastcancer.wordpress.com/ Thank you. ",
      "MessageIndex": 0,
      "PostDate": "28/08/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86352,0.htm",
      "Title": "My awesome wife has breast cancer."
    },
    {
      "AuthorID": "El_Tigre",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/El_Tigre",
      "Content": "Hi, Thanks for the reply. I am sorry you are in the club as well. We have an appointment Monday with a physical therapist. The only real \"excerise\" she has done since the surgery is coloring in a coloring book made for adults. She has spent hours on that. We have been cautious because of the increased risk of lymphedema. We asked that they not remove too many nodes prior to surgery, but then they decided to do a complete dissection on one side anyway. We are still awaiting word from the dostors on the final pathology even though we know they got it back Wednesday. It has been mailed to us, and is probably in our mailbox as I write this, but I'm afraid to look at it without someone to explain everything to us. Multiple messages with the doctors have gone answered. So frustrated. Which excerises do you recommend? ",
      "MessageIndex": 2,
      "PostDate": "30/08/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86352,0.htm",
      "Title": "My awesome wife has breast cancer."
    }
  ]
}