{
  "AuthorID": "Elisabeth_R",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Elisabeth_R",
  "Posts": [
    {
      "AuthorID": "Elisabeth_R",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Elisabeth_R",
      "Content": "Hi-- I am one year out--just finished six months of chemo and seven weeks of radiation. I've suffered from lymphedema since surgery last Sept. My breast ballooned and then gradually settled down over a period of 4-5 months. At first the docs said it was an infection, but antibiotics didn't touch it. The breast was both swollen and tender--and inflamed. The second doc said it was an \"over-exuberant inflammatory response\" to the surgery and would resolve. It did somewhat, but not completely. During radiation it flared up again of course. My husband and I went to a physical therapist that specializes in lymphedema massage. She taught him how to do it and I must say that nightly massages seemed to have helped. I, too, experience greater discomfort after vigorous exercise, AND I am in constant fear that the swelling and soreness indicates that the cancer has returned. I read on MyCancerCompass that inflammation can create a friendly ground for cancer cells to develop, so I'm taking ibuprofen and have been since halfway through radiation. It helps quite a bit. My current doc is one of the foremost breast cancer docs in the country--Dr. Robert Livingston of Seattle Cancer Care Alliance. He's great and I trust him. Stay tuned. I agree with the others. Don't sit and wait. At least get some massage. Good luck. Libby",
      "MessageIndex": 7,
      "PostDate": "28/07/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,840,0.htm",
      "Title": "Lymphedema, in glands under the breast"
    },
    {
      "AuthorID": "Elisabeth_R",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Elisabeth_R",
      "Content": "Hello- I'm three and a half years out from a diagnosis of breast cancer and treatment with CMF and radiation. I want to know how your friend's doctors discovered that her cancer has returned. The reason I ask is that I have discomfort and occasional spasms under my shoulder blade in back of the breast where the cancer was. I have thought that since the pain occurs only when I make certain movements or am in a certain position that the source of discomfort is most likely to be attachments that have formed around the surgical area and that have adhered to my rib cage. Now I'm wondering if I should be worried that my cancer has returned! Can you help? My oncologist is a nationally known breast cancer specialist. If your friend wants the best care, I suggest she contact him at Seattle Cancer Care Alliance. His name is Dr. Robert Livingston. Thanks! Libby",
      "MessageIndex": 1,
      "PostDate": "14/05/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5313,0.htm",
      "Title": "Return Cancer"
    }
  ]
}