{
  "AuthorID": "ellijaygal",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
  "Posts": [
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jan 26, 2016 2:20 AM Pattit wrote: Hi ladies, I'm in the middle of radiation with another 3 weeks to go. I was diagnosed with triple + in June & I was done with chemo on Dec. 1st. I'll be kept on Herceptin until next August. My oncologist suggests I take taxmoifen for 5 years. After reading all the horror stories about these drugs, there's nothing else on the market with limited side effects? This really is outrageous, and all the problems you ladies are experiencing is crazy. This is the 21st century & we're limited to these drugs. I'm 58 years old & don't want to feel like I'm 85. What to do is the big question & it's very concerning. Thanks & good luck to all of you.???????? I don't know if it is the medicine that does it, or the suppression of estrogen that causes the pain. We are basically taking our bodies and turning them into 80 year old bodies with no estrogen. Unfortunately doing that we get the pain of an 80 year old along with it. I don't think it is possible to suppress estrogen with any kind of medication real or dreamed about that would not cause this pain.",
      "MessageIndex": 34,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Oct 14, 2015 12:38 PM Kathy744 wrote: I was on Letrozole/Femara for only 8 weeks and my oncologist took me off because the joint pain was so severe, it got to the point that I couldn't open doors, and the pain in my knees, ankles, and feet was unbearable.  At the 5 week mark I see the oncologist again and she couldn't believe that my joints were still so bad, the day I saw her my hand was swollen and I couldn't bend my thumb, index and middle fingers.  She referred me to a rheumatologist to rule out rheumatoid arthritis, before the medicine I had never had any of these pains/symptoms.  The rheumatologist said that I do not have RA but that I do have Osteoarthritis.  The rheumatologist says that she is seeing lots of women due to these meds and that in her experience it can take 6 months to get out of your system.  I have now been off for 11 weeks and I'm still having joint pain, mostly in the mornings, it has lessened and the top of my feet and knees aren't as bad. But I still wake up every morning with right hand swollen and stiff and it takes an hour or so before I can bend the fingers. Lately the joints in my fingers just ache quite a bit. I see the oncologist tomorrow and I know she is going to start me on one of the other AI's since I don't have RA.  I'm so torn, obviously if it keeps cancer from coming back I want to be on it, but if the joint pain gets worse again I don't think I can tolerate it.  I'm 52 and my joints feel like they're 92! Your story pretty much explains everything that I am going through also. My right thumb is totally useless. I have horrid pains in every joint day and night. She had me start taking the medicine at night to see if that would help. It does decrease the pain a little at night but increases it during the day. I'm so frustrated. I had the oncotype test and it says with the estrogen suppressor there is a 17% chance that my cancer will come back. How do I find out what the percent is if I do NOT take the medication? I don't think enough people are reporting these side effects to the FDA. I don't think the doctors report it, the company will not speak to you about it, and no one thinks to report it. http://www.fda.gov/Safety/MedWatch/",
      "MessageIndex": 35,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On May 20, 2016 10:17 PM BabsNC wrote: Get off all those drugs.  They are killing you.  You had a very low chance of recurrance and your life has been made miserable because of the FEAR FACTOR.  They want us to keep taking these drugs because the pharmaceutical companies make MILLIONS off them.  Many of us women in our 60's would not have gotten breast cancer had they not prescribed those synthetic hormones made from pregnant horse urine.  I am in a group of thousands of women who got breast cancer after being prescribed those. Doctors only do what they are urged to do...Write prescriptions. But they don't walk in our shoes or know the pain we are suffering.  Start eating real well and take a good Multi-Vitamin, Calcium Supplement and 6,000 to 8,000 units of Vit D-3.  I hope you improve and can enjoy life.What type/Stage and 1,2,3 on the aggressive scale was yours? It is the fear that keeps me taking it. I have a new grandchild that I want to live long enough so that she and I can make some lasting good memories. :( Another issue is they told me after biopsy it was ductal cancer so I opted for a lumpectomy. After surgery it came back as invasive lobular. One in three with this kind have it in both breasts and oncologist and breast surgeons generally recommend double mastectomy. So if there is a 33% chance it is already in the other breast, yes I am TERRIFIED of stopping it. I have since switched from femara to aromasin. It didn't hurt me as quickly. It took about three weeks for the side effects to start, but now I am right back where I was. I only have one more to try before I have to start whacking off and out body parts, and I was told lobular does not respond well to chemo, but my oncologist bright that up if I am unable to take any of the estrogen suppressors. I am so tired. I was already tired from fighting Arachnoiditis and the spinal cord damage. Now I am beyond tired of fighting. :(",
      "MessageIndex": 45,
      "PostDate": "31/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Apr 09, 2016 1:29 AM annieay wrote: Hello, was just reading this site as I've been on Femara for 8 years, following 5 years on Tamoxifin. My GP asked me the other day when I would stop Femara and I am waiting to speak with Oncologist. I have to say I'm shocked at how many women are reporting such severe side effects. I have literally had none, in terms of body aches and pains. Don't think I'd be here if it weren't for these drugs. In 2003, at age 39, I was diagnosed with a really nasty breast cancer that had infiltrated my lymph nodes (there were 24 nodes extensively involved, yes 24). So far so good, touch wood. In 2003 my boys were 3 and 4 and I really thought I wouldn't see them grow up. Not sure if I'd have stayed on meds if I was unable to function, as some of you have described. Both of my boys are on autism spectrum, younger with adhd as well, so I probably would not have coped. Just wanted to say not everyone has these debilitating side effects. So I hope my little story gives another perspective. We're all different and I wish nothing but the best for all of you, no matter what your decision xI had issues prior to Femara. So I can't blame it all on the femara. I have spinal cord damage, tethered cord, herniated disk (inoperable), Chiari, syrinx, blah, blah. Most of that pain is nerve. This makes the only things that didn't hurt, hurt and the ones that were already hurting hurt worse. :( I guess it is just another thing I am going to have to deal with.",
      "MessageIndex": 38,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "But using cortizone and steroid dose packs are horrible for your bones. They basically melt your bones after awhile. So....",
      "MessageIndex": 32,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jan 26, 2016 6:23 PM mayveronia wrote: I think dilaudid will work just fine to take away the pain ,I am having a great relief with them I order them some days ago from medicshealthsupplies What kind of person gets on a CANCER FORUM for God's sake and try to cheat people out of money?????????????? http://scam.directory/fake-websites/medics-health-supplies",
      "MessageIndex": 33,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "As I stated before my mom mentioned it to me, and it wasn't pleasant. Almost like a manly sweat smell, but musty. She was diagnosed with lung cancer six months later. I smelled it myself, but not as strong after I was diagnosed with breast cancer. My cancer wasn't as advanced as her cancer. Both hers and mine were the underarm on the side of the tumor. I wonder if it something going on with the lymph nodes trying to fight it. Who knows. But I have read it in several places on cancer forums. So we aren't alone.",
      "MessageIndex": 71,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "I totally disagree. I did smell it. It wasn't a perception when we didn't know my mom had cancer.",
      "MessageIndex": 77,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "I totally disagree. I could smell the change in my mother's perspiration and in my own. https://clinicaltrials.gov/ct2/show/NCT02195076",
      "MessageIndex": 76,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "http://health.infoniac.com/bad_armpit_odor_predicts_breast_c",
      "MessageIndex": 80,
      "PostDate": "29/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jul 04, 2017 6:05 PM janelmchugh wrote: Hi, I am a breast cancer patient with tumors on the outside of my breast. Right now my nurse and I are the only ones who can smell it. I am so self conscious about it. Does anyone know anything that may block the smell at all, at least temporarily? Thank youIt may not be as bad as you think it is. I couldn't smell my mother's until she asked me to I had that smell with my breast cancer, but no one could smell it but me.",
      "MessageIndex": 102,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "Are you on synthroid? That should reduce the size of the nodules. It shrank mine and the goiter. I still have to have it adjusted from time to time, but my scans each year come back fine. What kind of pain? If you aren't happy with your doctor. Find another one that listens to you. I know quite a few people who take cymbalta and it helps their pain that has no cause that doctors can find.",
      "MessageIndex": 79,
      "PostDate": "29/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "SPAM",
      "MessageIndex": 84,
      "PostDate": "12/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Aug 14, 2010 8:08 AM Ro789 wrote: I just found this site, while searching for info. on cancer odor. I know this thread is old, but was hoping others had more to add on this topic. Particularly, I'm curious about how long people noticed the odor before the diagnosis. I have a friend who began emiting a horrible underarm smell shortly after the birth of her daughter.  It was evident that she was clean, but the odor was unbearable. About 3 years later, she was diagnosed with breast cancer. Once she underwent her mastectomy, the odor disappeared. It seems that, had she heeded that warning and altered her diet and lifestyle, she may have been able to avoid the cancer. Two years ago, I began having the same odor. It got so bad that I was carrying spare t-shirts around and ducking into public restrooms to wash throughout the day. After being rebuffed by my PCP, who offered to write me a prescription for an anti-perspirant with high levels of aluminum, I went to a doctor of Chinese medicine. She diagnosed me with Spleen and told me to eat plenty of orange and black foods, avoid sugar, dairy and fried foods. It took me a year and a half before the odor became manageable, but it's still there and comes out if I get stressed or eat outside of my perimeters. My question is, should I be concerned after two years? I've been to doctors, but they don't accept my concern. The Chinese \"spleen\" diagnosis also includes the pancreas. I'm considering getting a CT scan, but am worried about the contrast dye and wonder if I should wait a little longer. Any thought or stories of your experiences would be very helpful.My mother complained of foul underarm odor a year prior to her lung cancer diagnosis. I am postop and post radiation for breast cancer and I still have that horrid musty, indescribable smell, at times. I disagree that it smells like rotting fish/flesh or whatever some of the other posts say. The main thing that strikes me is the musty/metallic with a strange stink on top of it. I don't think underarm odor, or body odor in general should have someone thinking they have cancer, but any substantial change in your body needs to be reported to your doctor. Please don't ever say things like if she had sought treatment earlier maybe she could have avoided the cancer. People already beat themselves up enough thinking they may have brought cancer on themselves. So they don't need help from people who haven't been diagnosed. One of the first things my oncologist and my surgeon told me was \"this is not your fault. You did not cause this.\" When first diagnosed it's hard to believe that, or was for me, but had I went to the doctor complaining about anything they would have thought up a million things it could be and cancer would not be at the top of the list. So no, your friend could NOT have changed the fact that she had cancer based on having stronger body odor.",
      "MessageIndex": 69,
      "PostDate": "23/03/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Aug 12, 2016 9:59 PM Jenn1020 wrote: Hi everyone, I found this site accidentally when googling change in body odor and cancer. I had a ct scan done and they found my right ovary is 3 x's bigger than it should be and I have nodules on it ranging in different sizes. I'm scheduled for a pelvic ultrasound at the end of this month. But the reason I'm writing this is that I have had a change in my body odor. I noticed it a couple of weeks ago. I haven't changed anything that I use in terms of laundry detergent, soap or deodorant. I'm nervous about being diagnosed with ovarian cancer and checked to see if there is a connection between cancer and body odor or change in urination because that's also changed. Reading what everyone has said about this change in the body makes me feel like there may be a possible cancer diagnosis in my future. It makes me feel better, like I'm not crazy, that there are other people experiencing the same thing as me. I wish you all the best in your recovery from this ugly menace called cancer..Hi Jenn. You never posted again and I wanted to check on you. I hope everything turned out well.",
      "MessageIndex": 99,
      "PostDate": "03/03/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "Why did you have a car test? The type of odor I have smelled with cancer is not noticeable to others. Unless it is brought to their attention.",
      "MessageIndex": 105,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "Why did you have a car test? The type of odor I have smelled with cancer is not noticeable to others. Unless it is brought to their attention.",
      "MessageIndex": 115,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jul 04, 2017 6:05 PM janelmchugh wrote: Hi, I am a breast cancer patient with tumors on the outside of my breast. Right now my nurse and I are the only ones who can smell it. I am so self conscious about it. Does anyone know anything that may block the smell at all, at least temporarily? Thank youIt may not be as bad as you think it is. I couldn't smell my mother's until she asked me to I had that smell with my breast cancer, but no one could smell it but me.",
      "MessageIndex": 112,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jul 01, 2017 8:31 PM carinevloemans wrote: Hi, girl, please read how i brought my pains down for 95 %, it is my former message, just before yours !What kind of cancer did you have?",
      "MessageIndex": 37,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2947,0.htm",
      "Title": "Has Anyone Been on Aromasin and Are They Getting Side Effects?"
    },
    {
      "AuthorID": "ellijaygal",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ellijaygal",
      "Content": "On Jul 01, 2017 8:31 PM carinevloemans wrote: Hi, girl, please read how i brought my pains down for 95 %, it is my former message, just before yours !What kind of cancer did you have?",
      "MessageIndex": 33,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2947,0.htm",
      "Title": "Has Anyone Been on Aromasin and Are They Getting Side Effects?"
    }
  ]
}