{
  "AuthorID": "emiliagv20",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/emiliagv20",
  "Posts": [
    {
      "AuthorID": "emiliagv20",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/emiliagv20",
      "Content": "In 2007 my mom was diagnosed with stage 4 breast cancer the breast was immediately removed and she went through chemo and radiation and it was extremely hard on everyone around us and her wound kept opening up and it wouldn't heal now it's on it's way to heal. But a few weeks ago she started feeling extreme back pain (which was pretty normal for her but not this much) and bone pain and she was afraid the cancer might have spread to her bones... she was tested and the doctors found tumor forming somewhere in her body I'm not sure where exactly it has formed but mom is gonna find out. and she told me yesterday that she i tired of fighting cancer and she's about to give up... I'm afraid she could die... soon",
      "MessageIndex": 0,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49553,0.htm",
      "Title": "My mom had breast cancer and it was gone but now it's spreading"
    },
    {
      "AuthorID": "emiliagv20",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/emiliagv20",
      "Content": "thank you so much for answering:P it was really nice to hear about someone that is going or has gone through what i am going through though we just got it confirmed that mom has bone cancer and the doctors can't do a lot except lessen the pain and give her chemo but i heard that bone cancer patients have on average a five year span so at least I'll get to keep her for hopefully five years (although my uncle has cancer in the bone in his jaw and he got that last year and he doesn't have long left) but if I'm lucky then I'll get to keep mom for 5 years",
      "MessageIndex": 2,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49553,0.htm",
      "Title": "My mom had breast cancer and it was gone but now it's spreading"
    },
    {
      "AuthorID": "emiliagv20",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/emiliagv20",
      "Content": "My mom was diagnosed with bone cancer last year and we found out that she has had bone cancer since at least 2007 and her doctor knew but didn't tell us. Lately or for the past month or so my mom has increased her pain meds she takes morphine every day plus ibuprofin and it still isn't enough and i was wondering if that is a sign of the cancer getting worse... since she is taking pain medication that her doctor gives to her and she's even gonna ask for more if the pain is increasing and pain meds aren't working anymore does that mean she is close to dying? the doctors told my sister that she has a couple of months to live",
      "MessageIndex": 0,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61472,0.htm",
      "Title": "Bad sign?"
    }
  ]
}