{
  "AuthorID": "evilynnigirlie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/evilynnigirlie",
  "Posts": [
    {
      "AuthorID": "evilynnigirlie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/evilynnigirlie",
      "Content": "In the ultrasound a doctor can see if the questionable mass looks suspicious or not - nothing more. If it looks suspicious the doctor will always have a biopsy done to confirm if it is cancer or not. For further answers (like metastatic spread etc) you would need to have additional pictures, such as a body scan. The staging is done as far I know by the size of the tumor and if there is any spread.",
      "MessageIndex": 1,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,82412,0.htm",
      "Title": "Anyone know if Ultrasound shows size, time of growth and stage in Breast Cancer?"
    },
    {
      "AuthorID": "evilynnigirlie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/evilynnigirlie",
      "Content": "Markers in the blood do not tell the whole story always. That's why we have in our check ups additionally picturing done, if bloodmarkers were super reliable we could skip the whole picturing - don't you think? :-) If the doctor who made the ultrasound (he or she is a specialist, remember? :-) ) thinks the nodule looks suspicious you should in my opinion absolutely go for a biopsy. There is still a chance it might be  benign and you saved yourself a lumpectomy which is also not to be taken lightly... No one likes needles in their breast... Even being on treatment is sadly never a guarantee for cancer to not come back. I know it's not what you would like to hear, and I'm sorry. I wish you best of luck!",
      "MessageIndex": 1,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,82421,0.htm",
      "Title": "\"It May Be back, or May Not"
    }
  ]
}