{
  "AuthorID": "Fatima",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Fatima",
  "Posts": [
    {
      "AuthorID": "Fatima",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Fatima",
      "Content": "Thanks Karen, for the prayer. I find hope in hearign all the strong survival stories of the people in the message board. It gives me strength to hear all the people who have the strength, and I feel that their hope gives me hope. I appreciate your kind words, and again thanks for the prayer, I could use alot of them, and I am sure that so can my mom. I will pray for your continual strength and good health. I am always impressed by the 'fighter' stories i hear, and you have a great one. May God grant you the ability to keep fighting, with hope, strength, and lots of love. Amen. thanks again Fatima",
      "MessageIndex": 2,
      "PostDate": "23/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4147,0.htm",
      "Title": "Scared...how to Have Hope...."
    },
    {
      "AuthorID": "Fatima",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Fatima",
      "Content": "Hi All, My mom has been in remission for 12 years this xmas, and now we went to an appt b/c of a small (pea size) lump found at the base of her neck (right side beside her collar bone)...pathologist tested, and the cells came back positive for cancer. I am scared of losing her, and worse of her suffering. She is STRONG, and keeps telling me : I am not dead yet...stop it. I am worried i guess b/c of the unknown. She has been having acid reflux problems, and i am now worried that it came back long ago and we didn't know....how do i do this again? Should i be thinking ...she fought it once she can do it again, ....but how when i am so scared? Can anyone lend me some advice on positive outlooks. thanks Fatima",
      "MessageIndex": 0,
      "PostDate": "20/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4147,0.htm",
      "Title": "Scared...how to Have Hope...."
    }
  ]
}