{
  "AuthorID": "Feeling_Blue",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Feeling_Blue",
  "Posts": [
    {
      "AuthorID": "Feeling_Blue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Feeling_Blue",
      "Content": "Thanks for the responce. I have been on HRT for 6 years because of a hysterectomy. I was diagnosed with endometriosis. I have tried to stop the pills but get really bad hot flashes. I spoke to my doctor about it and he says I am too young to stop them right now. I believe him because of the hot flashes that I can not stand.",
      "MessageIndex": 7,
      "PostDate": "01/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3614,0.htm",
      "Title": "Unknown"
    },
    {
      "AuthorID": "Feeling_Blue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Feeling_Blue",
      "Content": "Thanks for the responce. I try not to worry about it telling myself that it will be nothing. The thing is that is easier said than done. I try to keep a good outlook. I wasnt as worried until I went back to the doctor and he felt the lump and added the sonogram to the mammogram. The first time I went to him he was not able to feel it because of all the swelling that I had. I just keep thinking that if he wasnt able to feel it the first time maybe the mammogram didnt pick up the whole thing. Sorry to lay all of this out there but like my husband tells me I worry too much on a lot of things. I guess I will just have to wait till I get the next test and see how things come out. I was looking for someone that had the same issues that could say that it was nothing.",
      "MessageIndex": 2,
      "PostDate": "30/11/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3614,0.htm",
      "Title": "Unknown"
    },
    {
      "AuthorID": "Feeling_Blue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Feeling_Blue",
      "Content": "I wanted to talk to someone about this but not my husband. He just lost his mother in March to liver cancer so I dont think he could take it right now. I am kinda scared, I had a mammogram in June my yearly screening and a lump was found. Not very big but there was something there. I am getting ready to have the follow up. the thing is when I went to my doctor to discuss it he found that I had fibrosystic breast. I followed his advise and went back in October and the swelling was gone but he felt the lump. He then wanted me to get a diagnostic mammogram with sonogram. Should I be worried or could this be nothing at all. Dont know what to think. I know that cancer runs in my family(not breast)I am a smoker and have been on HRT for almost 6 years now.",
      "MessageIndex": 0,
      "PostDate": "29/11/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3614,0.htm",
      "Title": "Unknown"
    },
    {
      "AuthorID": "Feeling_Blue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Feeling_Blue",
      "Content": "I really appreciate the responces to my message. Everyone has been a great help. My husband does know about the lump he just has no idea how worried I have been. I am trying to keep the worry from him until all the facts are in. I do have a good idea of the family history. I have talked to doctors about it and I have a couple more years before they recommend the colonoscopy.I know that quitting smoking will help me out and that is one thing that I am setting myself up to do. This has made me think long and hard about a lot of things. I go tomorrow for the next tests and hopefully everything will turn out fine but I am trying to prepare myself for whatever happens.",
      "MessageIndex": 6,
      "PostDate": "01/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3614,0.htm",
      "Title": "Unknown"
    }
  ]
}