{
  "AuthorID": "feminabella",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/feminabella",
  "Posts": [
    {
      "AuthorID": "feminabella",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/feminabella",
      "Content": "I am 3 years post op stage 3 breast cancer..am taking Aromasin 25 mg.  I have many problems that I did not have prior to cancer.such as very painful feet, some toe numbness, ankle swelling, fluid retention, muscle aches,and a lot of hair loss.. I walk like an old lady!! I did have radiation therapy as well as chemo therapy..Am wondering if these side effects have any thing to do with the Aromasin. I have accepted the \"hot flashes\" (numerous)but the painful walking has me puzzled... Does Arimidex have less side effects? Does anyone know? I do not find doctors to be honest or helpful..only interested in giving another pill or the standard answer \"exercise\" !!  Help me please... Thank you",
      "MessageIndex": 0,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27352,0.htm",
      "Title": "Adjunct therapy"
    },
    {
      "AuthorID": "feminabella",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/feminabella",
      "Content": "  On 11/12/2008 Bazaaka wrote: I had breast cancer in 2003; small lump.  Received only radiation treatments followed with Arimidex for the next five years.  The ONLY side effect I had from the Arimidex is loose bowels.  I must add that even though I'm 71, I'm very active and continued to be active throughout the cancer treatments.  I do aerobics three times a week, walk 7/5 miles twice a week and lift weights twice a week.  I exercise six out of seven days of the week.  I walked seven miles three days after the surgery.  In five years on Arimidex, I have experienced no joint problems other than my toes hurting--and I've had arthritis since my 20s; so, I've never been sure if they hurt from the arthritis or the Arimidex.  But now, I've been off the Arimidex for over a month, and am still having bowel problems.  In reading some of the other letters, I'm wondering if some permanent colon damage has occurred.  Or, if it's going to take a while before my body gets back to normal.   Dear Bazaaka: Thanks for your message about Arimedex treatment. You have encouraged me. I am on Aromasin but can hardly afford the expense and since Arimedex is less expensive I am going to ask Dr. to switch. I have many, many, toe/foot cramps. No one can really tell me what causes them. Did not have them prior to cancer. I am 3 years post surgery for stage 4 breast ca. with chemo and radiation.  Feet are so bad that walking is difficult and so exercising is at a minimum. Must do something about that. Very unsteady and have a loss of balance. But, I'm alive and that counts for something!!  You are fantastic with your long walks and I guess I did walk about the same distance when I was in my seventies. (I'm 80 now)..It's all so frustrating to slow down...Let me know your progress and if you have any leads about toe problems. Maybe together we can solve our delemma...Feminabella",
      "MessageIndex": 1,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30209,0.htm",
      "Title": "Arimidex Treatment"
    }
  ]
}