{
  "AuthorID": "finger1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/finger1",
  "Posts": [
    {
      "AuthorID": "finger1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/finger1",
      "Content": "I had a lumpectomy in Feb then Mastecomy and lymph node removal in March.  It is now five weeks since my surgery and i read so many stories about people who were in so much pain like me that I decided I couldn't live like this because also have migaines almost constantly.  I can't take most pain killers because of the rebound affect on my headaches. I had burning pain runnung from my armpit to my elbow and the armpit was totally numb my upper chest hurt terriblly.  At first before the drain was out I would just press the area to allevieate the pain and do the exercises and I used MSM on the arm to kill some of the pain.  After the drain came out I got more agressive I started massageing the whole area the arm, the arm pit especially check for string like thing in the arm pit and press them they are part of the problem I have found and I did my exercises that they give you in that little booklet \"AFTER BREAST SURGERY'' every day and I streached as much as I could when i did them untill it kind of hurt a little bit but not to much.  Don't tear the surgery. Now after five weeks I have gon from not being able to stand any clothes on that arm to  being able to lay on that side for short periods of time. Also Massage your shoulder and chest. You can get MSM rub at the health food store I hope this helps you and some others. I feal so much better and I din't think I would have without doing what I did.",
      "MessageIndex": 1,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46134,0.htm",
      "Title": "Does the numbness under the arm, etc., go away????"
    },
    {
      "AuthorID": "finger1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/finger1",
      "Content": "I am a 52 year old female woman who still works hard alongside her husband farmingand has for many years and I am not overweight yet I have been diagnosed with HER2 positive with overexpression so your theory doesen't always hold true. I have enough muscle that when I go swimming I cannot float I sink in the pool. I think pain may be a cause because all though I have had to keep on working the system really cares little about chronic conditions I have Migraine almost daily so I believe mine was caused by inflamation. I had to live and work almost every day in pain. I have had migraines since I was eighteen and they got really bad when I turned forty. I think diet can be one of the factors but not the only one for cancer. ",
      "MessageIndex": 0,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45439,0.htm",
      "Title": "Diet link to breast cancer: research"
    },
    {
      "AuthorID": "finger1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/finger1",
      "Content": "It is now five weeks and I have had no real pain killers to speek of a few ibuprofen and tylenol wich didn,t work at all so I gave up on them.  As I said earlier iused MSM to cut the pain somewhat.  What I ahve been doing is streching as much as I could and massaging the whole are in and out of the bath. especially under the arm .  You should pay special attention to the under arm area and if you feel strings press them to try and get them to let go or lengthen. they are what is giving you the pain.  My pain is way less now than when I first came out of the hospital. I couldn.t even put clothes on that arm it hurt so much. ",
      "MessageIndex": 0,
      "PostDate": "28/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46227,0.htm",
      "Title": "mastectomy pain"
    }
  ]
}