{
  "AuthorID": "Galine",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Galine",
  "Posts": [
    {
      "AuthorID": "Galine",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Galine",
      "Content": "I have had surgery to remove a quarter size tumor in my right breast. I have had 4AC and 1T(taxol) so far. I have 3 more scheduled. With the first 4 treatments I had neuropathy of hands and feet--horrible pain. That let up a little and I had the 5th chemo---taxol. It is highly toxic my Doctor explained so they give a bag of benadryl before the chemo. I am a diabetic -type II. THe chemo attacked my hands and feet but also the bones in my legs and the muscles and different parts of my body. I could not work on the 3rd day and was laid up all weekend. My toes are numb and the pain in my body--I still take vicadin for pain---but as I am diabetic and there is so much pain---I put a call into my Doctor office today and am waiting for her to get back with me. I am a highly allergic person plus the diabetes--I am very afraid of the chemo and do not want to take it anymore. I cannot see being crippled and in pain the rest of my life--just to take chemo. Has anyone else had this problem and opted not to do any more chemo? I feel they got all the cancer. It had spread to one lymph gland and was starting in another. I would appreciate hearing what others have done. I have a friend who went through the same chemo, radiation--did just fine 5 years ago but we are not the same. She never had the problems I do.",
      "MessageIndex": 0,
      "PostDate": "11/10/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1335,0.htm",
      "Title": "Chemo"
    },
    {
      "AuthorID": "Galine",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Galine",
      "Content": "I just wanted to thank you for you reply. It really does help to talk to someone. I was so sure I did not have cancer and then shocked and then sure they got it all and wonder why I am going throught all this. I finished my last chemo today. I have a mamogram appt, surgeon appt, oncology appt, radiologist appt. All short appts thank goodness so I can keep working so far. I have too The doctor told me today the radiation I go for every day will make me extremely tired. Now--I have kept up my energy with this shot the day after chemo--stimulate my white blood cells and it did work--I did not get extremely tired. Now I worry about doing radiation--trying to do it overy my lunch hour---but I cannot be so tired I cannot go to work. What did you experience with it? I pray for you. I cannot imagine what you are going through --for it to comeback to you. You were doing so good. That is what my doctor says--that it is so devious--can spread some else and be a different cancer. I am so sorry. I went to a health seminar--it was about what we are putting into our bodies. I want to build my body back up and quit doing all these things. SO much is in our foods, our water supplies--all the vitamins and minerals have been depleted out of most everything. I am going with a group out of Colorad---called Natures Sunshine. They make a drink--that is the strongest --filled with antioxidants--it is a flower from Taiwan mixed with blueberries, rasberries,grapes. Concentrated and an ounce is mixed to make a drink each day. Well--any way I am going to try to take good vitamins, change my water supply, exercise, and try to eat right and get my diabetis back under control. Lot of meditation and prayer. My best wishes to you---God Bless you. Galine",
      "MessageIndex": 3,
      "PostDate": "16/11/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1335,0.htm",
      "Title": "Chemo"
    },
    {
      "AuthorID": "Galine",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Galine",
      "Content": "Hi--just wanted to thank you for your message--it meant a lot to me. It certainly does help to people who are taking or have taken the same medicines. I am so sorry it it back and worse. I will pray for you also --I think he is our only real strength but my family has been so good to help. I am 61 years of age. I work every day and my company has been so good about the time off. I lost my Mother last year and I think that has been the hardest thing of my life. I lost my younger brother in a car accident - he was 39 yrs old in 1990 and my Dad got bone cancer the died two years after my brother. Then at my job I see people losing their jobs, wondering how they are going to survive and pay their bills and their family problems---Oh--it is so heart breaking---then I know someone out there always has it worse. And the people on both sides being killed all over the world. Mary said to pray every day for peace in the world---I think we had better for there seems to be no answer but GOD to save the world. Well--I rambled on. I finished chemo today. I have a lot of appts--mammo,surgeon,etc--set up radiation that the doctor said will make me very tried. I have to go to work every day--I was going to try to do it over my lunch(radiation). One thing--I went to a health seminar last month--the chemicals in our foods, the vitamins and minerals being taken out, the fluride and other run offs being in the field being in our food and water. I am going to start the vitamin and other products from a company out of Colorado called Natures Sunshine. One on the products is a drink make out of a flower from Taiwan with blueberries,rasberries,grapes,etc. Mix an ounce with water every day. It has the most antidoxants?? In the world. I am taking their vitamins, exercise, and try to eat right. Detoxifying these chemicals, meditation ,yoga, prayer. I want to live a better life and turn to God and be healthy and strong and give to others and live as God would want me to live - not as I want to live--right up to the end--and go in my sleep. And I hope GOD GIVES YOU MANY,MANY GOOD YEARS. GOD BLESS AND KEEP YOU.",
      "MessageIndex": 4,
      "PostDate": "16/11/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1335,0.htm",
      "Title": "Chemo"
    }
  ]
}