{
  "AuthorID": "Gasp1974 (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "Gasp1974 (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hello this is my first time on the site.  As per the title of this post my mother was diagnosed in Sept 2012 and has advanced breast cancer.  She is a tuff woman and treats this desease as a if it were just a cold.  But it is slowly affecting her.  She went through 6 rounds of chemo and some radiation as well.  All of which thank God with no real sideffects except hair loss.  My mother does not like to talk about her condition or what the future holds.  My poor father and I are at a loss.  My mother is slowly getting weaker.  i have been told that the cancer has spread throughout her bones and she takes some pain killers to help with the pain.  I am at a loss as to what to expect.  This is all new to my father and I.  We are praying for the best but fear that we are watching her slowly die everyday.  She puts on a good front but the Doctors have made it clear that we have a very hard road ahead of us.  I am sorry to go on and on.  I guess just need to vent and I don't know where to turn. PS  thank you to everyone on this site for all the information I have been able to gain by reading other peoples posts.",
      "MessageIndex": 0,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70787,0.htm",
      "Title": "Mom has stage 4 and spread to bones"
    },
    {
      "AuthorID": "Gasp1974 (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I am sorry to hear about your situation but it sound similar to my mothers.  I will pass on the advice.  Thank you. She seems to find that the memory foam matteress topper seems to help at night.  God bless you   Gasp1974 ",
      "MessageIndex": 3,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70787,0.htm",
      "Title": "Mom has stage 4 and spread to bones"
    }
  ]
}