{
  "AuthorID": "Gayle58",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Gayle58",
  "Posts": [
    {
      "AuthorID": "Gayle58",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Gayle58",
      "Content": "  On 12/12/2007 gayleann65 wrote: Hi Gayle58  Since I wrote my last message I flew from Ohio to Seattle and went to the Seattle Cancer clinic and met with my naturopath there. He said after 6 years I am in remission and should be able to get off of the aromasin but to check with my oncologist which I will be doing Dec 13th and hopefully she will give me the pros and cons of getting off of the medication that is making me feel like I am 100 years old.  I was seriously contemplating hip replacement along with a knee replacement but if the severe pain is due to the aromasin I do not want to go through those surgeries.  I will let you know what she says.  It would be such a blessing to be pain free and know that my chances of cancer returning would not be because I stopped the aromasin. 12-14-07 Hi gayleann65, I have been on the Aromasin since the end of August. I had to go off of it for 3 weeks the end of October. I was having headaches, neckpain and nausea. I am back on it and doing much better. Still have awful hot flashes. The medication I was on for those was pulled from the market. I am going through a fatigue phase right now and with the holidays coming up that is not good. I went back to work October 18. I am doing fine with that. I work in a prison and am working in the visiting room. So I do a lot of walking.  So far I am sticking with the program. I had a clean check-up in November. Still have numbness and a little fluid build up in my left arm.  But guess I am getting used to what has happened to me.  My mother was diagnosed with breast cancer in July this year. She also was HER2 positive and is taking Herceptin treatments. She was getting a treatment every week, but since she is doing so well they upped the strength and only has to go once every 3 weeks. She also had a breast removed. She is amazing for 79. My brother and his wife are able to be with her thru this. She will have these treatments for a year. She helped me when I was going through my treatments. Its strange how much alike we are. It sure has been a tough year. My husband was just diagnosed Bi-polar. Something else to learn about. He had quite a crisis but is doing much better. Say did your naturopath doctor give you anything for hotflashes?? Maybe you should get the inflammation out of your body and see if your knee still bothers you. My doctor put me on Decadron for 6 days. I took 1 tablet twice a day for 3 days then 1 a day for 3 days. I tell you I had no pain in my body. I know it was the arimidex.  I do have pain, but not as severe. It is hard to get up once I have sat for an hour or so. But am hoping that will be gone when I am off the medicine. If the inflammation builds up real bad again my doctor will put me on the steroids for another 6 days. The relief was wonderful and I had energy. It has been easier to stay on the Aromasin. It is not near as bad as the Arimidex. I have been told 5 years on the medication. I am on a countdown. 3 years and 10 months left. Even thru all this I feel blessed. I lost a friend to breast cancer 6 weeks ago and another friend from work, his wife is real bad and they have been going to the cancer institutes of america. Thye have helped them a lot. At least now they have some hope. Our cancer center is not as advanced as other areas of the country.  congratulations on your remission. I must go for now. Have a Merry Christmas and a Healthy and Happy New Year. Gayle58",
      "MessageIndex": 38,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "Gayle58",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Gayle58",
      "Content": "  On 8/27/2007 gayleann65 wrote: In 2001 I was diagnosed with breast cancer, choose not to have chemo but did have a lumpectomy and radiation.  I was on tamoxifen for a couple of years but like everyone else had extreme joint pain so was switched to aromasin in 2004.  I have now been on it for 3 years and have had several bone scan and PET scans because of joint pain and have even had a knee arthroscopic surgery and am contemplating knee replacement.  My left hip kills me certain days.  After reading some of the comments I am wondering if it is not just the aromasin and wonder if I should still be taking it after 3 years.  It is quite an expensive drug but would I be sorry if I was to stop it.  Has anyone taken it for over 3 years or has been taken off it and have still been in remission?  I am sort of afraid to change anything since I have done good but what is it doing to my joints.  Is it worth being cancer free and living with the joint pain......but as I am sure anyone that has had breast cancer lives with the fear of any little ache or pain could be \"IT\".  I try to be positive and have come a long way.  My husband died while on a European vacation in 2000 and 8 months later I was diagnosed with breast cancer but continued building our dream home on a mountain lake in Washington while doing the radiation bout.  After 5 years I needed a change in my life so up and sold my home and moved to Ohio where I did not know anyone.  Love it here and will probably make another move in 5 years to who know where.  Cancer makes you realize life is short and if you want to do something ....just DO IT.  I am 65 and and have many years ahead of me. I just found this site and would love to hear from anyone going through the aches and pains of the cancer drugs.   Hi, I was on Arimidex from Oct 06 to June 07.  I was having such awful pain in my joints and muscles that I was always complaining.  My husband called my oncologist and he said to stop taking it.  My symptons started to go away.  Not all as I have had hip pain for a long time and was taking Artrotec 50.  My radiologist put me on steroids for 6 days to get rid of the inflammation in my body.  I'll tell you what.. all the pain went away.  I was also very active.  Had lots of energy.  Then reality came back.  On Aug 6, I was put on Aromasin.  It is now Sept. 5 and the pains are back.  Not as severe yet, but enough to complain.  I saw my Oncologist today and I will try this for 6 months.  Injections is the next thing to try but from the things I have read, they are not any better.  I have pain pills I can take when it gets to bad.  And I have real bad insomnia. Doc said it is caused from my hot flashes.  I will be glad when the five years is up. If I can stand it for that long.  I had Estrogen receptor postive breast cancer.  I had a lumpectomy and radiation.  So far I think these pills are almost worse than the actual sugeries. I pray that when this is over and I don't have to take this medication anymore that the pain will go away.  I do not want to feel like this the rest of my life. Just have to be positive. I work in a prison and was told by my employer not to come back to work until I can do the mandatory overtime.  I was doing my regular 8 hours okay.  It has been 2 months and I am not doing any better, but will have to return to work as my husbands income will not pay all the bills. State of oregon will only give you 90 days and then your out till your able to do what is reqired. Oh well, maybe this is a sign. Gayle58    ",
      "MessageIndex": 26,
      "PostDate": "05/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    }
  ]
}