{
  "AuthorID": "Georgie430",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Georgie430",
  "Posts": [
    {
      "AuthorID": "Georgie430",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Georgie430",
      "Content": "  On 9/16/2009 heythere wrote: One minute of radiation in the operating room (OR) could save the lives of thousands of women being treated for breast cancer in the US today. According to a growing body of research, a 60-second course of radiation therapy delivered during surgery dramatically improves results. But, until recently, logistical and administrative difficulties prevented most patients from receiving this crucial treatment until weeks after their procedures. Now, a portable, self-contained radiation therapy system, the Mobetron from IntraOp Medical Corporation (OTCBB: IOPM; Sunnyvale, Calif.), is changing all that. St. Joseph Hospital (Orange, Calif.), one of only 16 prestigious designated National Cancer Institute Community Cancer Centers, this month introduced the first ongoing intraoperative electron radiation therapy (IOERT) program for breast cancer. During lumpectomy surgery, St. Joseph's patients receive a high dose of therapy focused specifically on the tumor site, known as a \"boost.\" Given the benefits, other facilities are expected to follow suit. Felix Sedlmayer, MD, one of the world's leading IOERT researchers and the principal investigator of IOERT boost trials conducted by six European medical centers over the past decade, concluded that IOERT cut breast cancer five year recurrence rates dramatically, from an average of 5% to less than 1%. Wow, right now I'm going thru finding out more abt my abnormal mammo have to f/u with sonogram. Then perhaps biop.  Do you know the other 15 designaed hosp??  Or any on the east coast, any in NYC                            wishful thinking,                                Denise",
      "MessageIndex": 1,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39894,0.htm",
      "Title": "Groundbreaking Breast Cancer Radiation Technique Delivers Proven Long-Term Benefits and Saves Lives"
    },
    {
      "AuthorID": "Georgie430",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Georgie430",
      "Content": "  On 9/20/2009 Salamander wrote: Hi , I have a very important question ! i was wondering if the Poly MVA also has the ability to remove toxins from the body after removal of the implants that have leaked in to the body , which is SLICONE POISONING .. Please reply .. No one seems to have any answers ... There are so many of us so very ill . Thank you in advance .... How did you know your implant was leaking??  I assume you did not feel well but did you feel or hear a trickle.  i ask cause I have implants??/",
      "MessageIndex": 1,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40006,0.htm",
      "Title": "Brest Implants"
    },
    {
      "AuthorID": "Georgie430",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Georgie430",
      "Content": "  On 9/14/2009 skonk ananse wrote: i had a breast biopsy a year ago and  the result from the pathologist diagnosed the lump as non malignancy and that fibrioadenoma.i had a mamogram in april and went back to the doc for a scan cos i was having pain in the breast and the scan result was also normal.even though i dnt feel pain on regular basis but only during my menses i'm concern about the way my nipple sometimes changes,sometimes both nipples becomes erect and later change.i had the excision in m right breast  Hi Skonk Like your name, I have just had a suspicious mammo, I'n 47, and I hope it is a fibroadenoma.  My rt breast hurts on the outside between outside of breast and underarm. Both sides usually hurt 4-7 days before period but rt side is more. So cyclic pain is soo noral.  Do you remember how big your fibroaden was? My lump is .8mm                        with best intent,                             Denise ps how old are you?",
      "MessageIndex": 1,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39850,0.htm",
      "Title": "breast excision"
    },
    {
      "AuthorID": "Georgie430",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Georgie430",
      "Content": "  On 9/1/2009 duviamedia wrote: Recently my mother was told she had breast cancer. She had been doing here momogram each year, in march she was given a clean momogram, but in May was said to she had Breast Cancer II now it said she has breast cancer IV it has spread to her liver, they had to drain fluid from her liver is there hope ? If the tumor is getting bigger. We are looking into sending here to cancer centers of american in IL can anyone offer support and advice. Sorry nobody has responded. I just got a suspicious mammo so have to get further testing.  I have joined 2 very good support groups. google BC message boards and you'll see Nationsl BC foundation and BC community.org  both are very good all stages. Did anybody say anything about March's mammo slides??? I would request copies of those and have another facility look at them, maybe someone dropped the ball??  Is his possible??               please keep in touch                   Denise (georgie) in NY",
      "MessageIndex": 1,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39521,0.htm",
      "Title": "breast IV"
    }
  ]
}