{
  "AuthorID": "Ginagce",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
  "Posts": [
    {
      "AuthorID": "Ginagce",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
      "Content": "I have been taking Arimidex for 1 year now and the bone and joint pain has progressively gotten worse. My Onc & I are talking about switching to either Femara on the other AI to see if they're any better. However I am also on Herceptin and I think that may be creating some of the pain. Sorry to hear you're having such a hard time.",
      "MessageIndex": 1,
      "PostDate": "10/02/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4435,0.htm",
      "Title": "Aromasin & Femera Cancer Pills"
    },
    {
      "AuthorID": "Ginagce",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
      "Content": "I had had radiation in my left breast 7 years prior to having DIEP reconstruction on both breasts after bilateral mastectomies. I too traveled to Baltimore (from Philadelphia) to a good surgeon there who told me that the radiated breast would be more of a challenge but that he thought it would work. It did work and I'm glad I went for the DIEP. Best of luck to you in your decision and your surgery! Gina",
      "MessageIndex": 8,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Ginagce",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
      "Content": "I understand your fear. I too was afraid to take tamoxifen so was very very happy when my chemotherapy put me into menopause so I could take the Arimidex instead. As for side effects, hard to say because I'm also on Herceptin. Bone pain is biggest for me. Hot flashes, mood swings and fatigue are secondary. But I'm not convinced their all from the arimidex. I believe that the herceptin is causing some, if not all, of the bone pain. Best to you. Gina",
      "MessageIndex": 15,
      "PostDate": "30/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Ginagce",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
      "Content": "Wow. Lots of questions. I will try and answer them the best I can but please feel free to email me at --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html --- if you'd like to talk more. I did not have axillary resection. I did have a sentinel node biopsy on the right side during which the surgeon wound up taking 7 nodes all clear. I was in the hospital for 5 days. I was held over an extra couple days as I was running a fever. I left directly from the hospital to go home to Philadelphia. I stayed at the Tremont for 1 night, the night before surgery so I could be there first thing in the morning without making the long drive the day of surgery. The Tremont is right across the street from Mercy Medical. That's where I had my surgery done. I too checked into JH but found that the surgeon who had done all the DIEP's there had moved to Mercy. Good question to ask your surgeon. How many DIEP's has he done? How many on women previously radiated? Success rate? I had my brother and mother with me. No, I could not have made the drive home alone. I drove myself to chemo alone every time so I'm not one to need rides but no, there's no way you can drive yourself. Your surgeon/breast center should have a patient coordinator that can help you with all the detail of being an out of town patient. May I ask, where are you coming from? Will you be driving home or flying? My DIEP surgery was in Sep 04. It went very well. Unfortunately, the prophylatic(?) mastectomy on my left side which was my decision, biopsied positive as did the sentinel node biopsy the surgeon did the day of the DIEP. (I had mast/recon same day). Therefore much to everyone's surprise, I wound up on chemo after surgery which slowed down my healing. Other than that, all successful. No necrosis. Gina",
      "MessageIndex": 10,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    },
    {
      "AuthorID": "Ginagce",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ginagce",
      "Content": "I hope I'm responding to the correct message. I'm new to message boards and not quite sure how they work. But to answer your question, of course I'm happy to provide the name of my Doctor. The plastic surgeon I used, specializes in DIEP, name is Dr. Bernard Chang. The Surgical Oncologist name is Dr. Neil Friedman. Both can be contacted at Mercy Medical in Baltimore. And yes, my Docs at HUP thought I was over reacting in my request to have bilateral mastectomies. But my instincts just told me to do it. Glad I did, would not have found out about 2nd cancer, and would not have gone through chemo if I hadn't. And yes, I take Arimidex as my cancer was ER+. I also am on Herceptin for 1 year (give or take my onc says) as I am her2/neu+++. I think I answered your questions but if not, please let me know and I'll try again. Best Wishes on your journey. Gina",
      "MessageIndex": 13,
      "PostDate": "29/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3802,0.htm",
      "Title": "Eligibility & Prerequisites For Diep"
    }
  ]
}