{
  "AuthorID": "gjam4957",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/gjam4957",
  "Posts": [
    {
      "AuthorID": "gjam4957",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/gjam4957",
      "Content": "On May 01, 2010 1:34 AM sherlaud wrote:  I just had a chemo port placed under the skin up close to my collarbone.  It is very painful, red, bruised and bumps out quite a ways from the skin - you can definitely \"see\" it!!  I realize this is just the 2nd day, but has anyone ever had a port like this, or any strange reaction??  All I can think of is this has to stay in for 4 months - it sure better get \"better\" then it is now!!  Does it hurt when the IV line for the chemo is put into the port???  Sure could use some input on these \"ports\"!!  Thanks......... Hi. I had a port inserted about 6 weeks ago, and due to complications with my diagnosis I only started chemo for breast cancer 12 days ago. All ports protrude under the skin. This is normal. My scar was red and bumpy for about a month but is settling now. The site itself was quite painful for about 7 - 10 days but is also good now and only a bit sensitive when bumped or rubbed (bra straps are a bit of a problem!). Accessing the port for treatment is just a quick prick, nothing to be concerned about, and much much much better than having an IV in your arm or hand. All the best.. Gail",
      "MessageIndex": 3,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46307,0.htm",
      "Title": "Chemo Port"
    },
    {
      "AuthorID": "gjam4957",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/gjam4957",
      "Content": "Hello. I'm on day 6 of my first breast cancer chemo cycle - AC (Doxorubicin & Cyclophosphamide). Despite taking all the anti nausea drugs - Emend, Dexamethazone, Kytril, Zofram and 4 hrly maxalon, I have endured 5 days of excrutiating stomach pain and relentless nausea. Have also taken regular ginger, frequent small snacks and supplements. Does anyone have any suggestions? I'm not sure I can endure this a second time let alone another 15 times and I'm terrified of the consequences of ceasing treatment but don't feel my body can deal with the chemicals. My neighbour has just finished an identical course of treatment and wasn't sick at all. Any help at all would be so gratefully received.",
      "MessageIndex": 0,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46182,0.htm",
      "Title": "Suffering severe nausea & pain from first chemo"
    },
    {
      "AuthorID": "gjam4957",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/gjam4957",
      "Content": "Hi. I am on day 12 of my first cycle of breast cancer chemo. The last 3 days the tingling I was warned might happen in toes and fingers has turned into intense burning pain under the balls of my feet. Does anyone have any experience with this, suggestions or knowledge of whether this will pass etc. I'm very scared as I can barely sleep or walk due to the pain and it comes only a few days after my extreme nausea finally subsided.  Thank you.. Gail",
      "MessageIndex": 0,
      "PostDate": "02/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46346,0.htm",
      "Title": "Sore feet after chemo - any experiences?"
    },
    {
      "AuthorID": "gjam4957",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/gjam4957",
      "Content": "Hi Betteanne. Everyone I know who has been treated with Taxol for breast cancer has suffered some degree of neuropathy in hands and feet - most temporary but occasionally longer term. My next door neighbour said hers slowly improved over a couple of months after stopping treatment however I'm aware that in some cases it can linger on. You may need a referral to a neurologist if it continues to be a problem for you.",
      "MessageIndex": 26,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    }
  ]
}