{
  "AuthorID": "Goodattitude",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
  "Posts": [
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "Last time I wrote, I was doing really well on the Arimidex.  Boy how things have changed now.  My cholesterol went sky high - into a danger zone, they had to place me on a cholesterol medicine, which then made my cholesterol drop almost 100 points in 5 weeks!  I've had a vaginal discharge all along.  I could deal with that if that's all it was, but now my shoulder joints are actually throbbing.  They seem to bother me more at night.  Pain killers don't even work - I take 1,000 mg of Execedrin twice a day which does give me relief.  Now for the past week, I feel extremely emotional and could cry at the drop of a hat.  I'm beginning to get a little discouraged.  Any suggestions, anyone?  ",
      "MessageIndex": 0,
      "PostDate": "11/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "Well, I went to the doctors again.  My oncologist switched me to Tamoxifen.  The depressed feelings have not gone away yet, but to boot I woke up this morning at 330A, with the dry heaves for a few hours.  I'm really discouraged about these ill feelings.  All I seem to want to do is lay on the couch.  I've made the decision to stop the Tamoxifen and the Zocor because what I've read about the side effects, both of these can cause depression and nauseau.  I've been through Chemo and radiation.  It's time for me to feel good for a change and I want to take charge of my own body and not be chemically altered all the time. Thanks for the support and the advice.       ",
      "MessageIndex": 3,
      "PostDate": "22/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "Monica: Thank you for your kind message.  Yes, it was quite a shock for me because I had been doing so well, frequently getting mammos - the whole deal and wham.  It's those nasty little bugger hormones for me.  I'm okay with everything so far.  I don't really have any other choice but to just deal with it.  But, thank goodness for this website.  I've learned a lot and have developed a beautiful friendship with a woman who I consider a sister. Thanks again so much. Laura  ",
      "MessageIndex": 18,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "Thank you for answering me.  I went back to my oncologist and told her that I was feeling depressed, which is very unusual for me.  I also told her about my shoulder pain.  She changed my meds to Tamoxifen.  I do know that this also has some possible serious side effects.  I'll give it a try like I did the Arimidex, but if I start having additional side effects, I'm off of them and taking my chances.  Like you, I was never sick a day in my life and was not one for medicines.  I feel that they are determining my life now and it doesn't make me happy.  My bloodwork is normal, got a clean mammo.  I changed my diet drastically before I started Chemo and I've stuck with the veggies, no red meat plan for the past 16 months. Thank you so much for taking the time to answer me.    ",
      "MessageIndex": 2,
      "PostDate": "15/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "My goodness!  this is exactly what I mean.  People do have the right to take charge of their own bodies and made decisions for themselves, even if they may be wrong but for an MD to not even discuss it is ridiculous. At first I gave my oncologist a bit of a difficult time because I had heard all the horror stories about chemo etc but after weighing eveything in my mind I did decide to have chemo. I felt that this gave me the choice to fight the cancer.  I had a partial masectomy, chemo for 4-1/2 months, radiation for 4 mos.  I think that this is enough.  It's time for me to feel myself once again.  Depleting all the estrogen in my body left me listless and depressed.  I didn't want that for myself. Best wishes to everyone.  Keeping writing to each other.    ",
      "MessageIndex": 6,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "I, too, had severe side effects from Arimidex.  I took it for six months then was switched to Tamoxiphin and got worse.  I gained 35 lbs, but I believe it was from the Chemo.  I developed high blood pressure, high cholesterol and was depressed, tired and listless.  I decided to choose quality of life instead, knowing that this perhaps may be the wrong decision and for me it was.  It's been three years and I was just diagnosed with breast cancer again in the other breast.  First time I had a partial masectomy.  This time I have no choice but to have a complete masectomy.  I know many women that have and have not had side effects.  You've dealt with this for 3 years, why not hang in there for 2 more?  The weight will come off eventually.  It took me one year to lose the weight.  This time my doc. says we'll try Femara.  My eldester sister who also had the same type of breast cancer took Femara without any side effects and she was 90lbs. Think smartly and good luck.   On 4/22/2009 dove111 wrote: I was on arimidex for 3 years and after having all kinds of side affects decided quality of life was more important than being sick all the time.  I have gained 45 lbs., and haven't lost anything after three weeks of weight watchers, in fact I gained 3 lbs.  Has anyone else had this issue and has anyone stopped treatment early due to side affects?   cindy    ",
      "MessageIndex": 5,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "Cindy\" I understand completely.  It's not easy.  I'll be thinking of you and wish you happiness.  ",
      "MessageIndex": 9,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "  On 11/30/2008 dixielee wrote: Hello, just wandering if anyone might have some wigs to donate. I've just started losing my hair but can't afford to buy a wig yet. Scarfs, turbans or anything would be appreciated.                                                                           Thanks very much and                                                                           God Bless us all. I have two wigs that I've never worn.  I'd be happy to give them to you. I must add that I, too, found them to be a little itchy and wound up buyinig a bunch of cool hats.  But, I'd give you the wigs in a heartbeat.",
      "MessageIndex": 5,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30791,0.htm",
      "Title": "wigs"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "At 60 and on routine mammogram, they caught two suspicious looking areas.  Somewhere inside me I knew it wasn't good.  After biopsy, I was given Stage I cancer.  I had a partial masectomy and lymph node biopsy. Fortunately the lymph nodes were okay. Two months later I began Chemotherapy.  They took a very aggressive approach. I had Chemo every three weeks for 5 months.  In the beginning I felt just fine.  I contribute a lot to having the time to prepare my body for this poison.  I started taking flaxseed to boost my immune system, started eating several small meals every day and I rested, keeping myself as stress free as possible. Pathology has found one additional lump after surgery, which upgraded me to Stage II.  Chemo began to get a little difficult after the 4th treatment.  I knew the effects would go away, if I was patient and kept as positive of an attitude as possible.  And, they did.  I forced myself to eat even if it was just a little and I rested.  All in all, the chemo experience wasn't as bad as I anticipated. I started Radiation therapy one month after my final chemo.  Thank goodness I had a wonderful team.  I went every day for 8 weeks.  All was well up until the 6th week when I got large blisters underneath my breast.  But I thought to myself, this too will pass.  Dig deep, hang in there, its almost over.  It was painful, but not any more than other things that had happened in my life. I'm in remission now.  It's been 14 months.  I drink only one cup of coffee a day, eat no red meat, lots of fresh green vegetables, fruits, yogurts. Occasonal chicken, a lot of fish.  I drink a lot of water and  I take a daily vitamin, with an extra C and an extra Calcium.  I eat only when I'm hungry and never a large meal.  I feel really great, stronger than ever before.  I read one of the messages that said have Patience and keep as stress free as possible.  I totally agree.  Keep a positive attitude, no matter what.        ",
      "MessageIndex": 0,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14105,0.htm",
      "Title": "This is My Story"
    },
    {
      "AuthorID": "Goodattitude",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodattitude",
      "Content": "  On 7/30/2007 Leemg wrote: Oh!  I just wanted to add one thing about radiation to the breast, it causes the breast to undergo some shrinkage.  Soon after being diagnosed I decided because of the tissue loss from a two biopsies, lumpectomy and from infection that I would have reconstruction ASAP.  After undergoing my lumpectomy the surgeon said that they didn't rcommend reconstruction on a radiated breast and that the remaining breast would continue to shrink.  Well that was unacceptable to me and I almost went after his juggler for not informing me before my surgery.  I had to wait a year and supplement with a prosthesis but had my reconstruction, implants.  It took some tweaking over a period of months but I am very satisfied with the result.  Something to keep in mind. I was on Adriamycin which left a large red area on my breast. After radiation therapy this area turned dark brown and almost leather like. It's still this way after 4 months post radiation.  My breast also shrunk a little. I will also say that I formed large blisters from the radiation and it was uncomfortable.  My doctor advised me to use Aquafor several times a day.  But, compare this to the alternative of a 20-40% recurrence.  ",
      "MessageIndex": 7,
      "PostDate": "31/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14794,0.htm",
      "Title": "Radiation therapy"
    }
  ]
}