{
  "AuthorID": "Goodgrief",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodgrief",
  "Posts": [
    {
      "AuthorID": "Goodgrief",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodgrief",
      "Content": "Thanks to everyone who replied in public & private. I talked to my OB GYN who called the Breas Clinic & had the head of radiology talk to me and repeat my ultrasound. He agreed that a biopsy would be unnecessarily invasive, repeated the ultrasound & said I could come back in 3-6 months of another mammo. I'm going back in May, but in the meantime he says all indications are benign. I a, SO glad not to be forced into an unnecessary and invasive procedure like stereotactic biopsy!",
      "MessageIndex": 2,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,82465,0.htm",
      "Title": "Do I really NEED this?"
    },
    {
      "AuthorID": "Goodgrief",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Goodgrief",
      "Content": "I have dense breasts. On my last mammo, they saw a small \"mass with benign features\" on the mammo, confirmed by a repeat mammo. They said it's located \"deep\" but couldn't tell me more. The ultrasound showed nothing do the radiologist ordered a stereotactic biopsy. They assure me it's painless, but it sounds horrible. Right now, I'm more afraid of the procedure than the result. They are already preparing me for a surgical biopsy in case they can't get a sample because it's so small. The doctor says it's probably micro calcification, but insists that I need this test. Do I need it, or is there a non-invasive option? To already be discussing a surgical biopsy seems crazy to me, if it's that small & doesn't show in an ultrasound or breast exam, do I really need to go that far?",
      "MessageIndex": 0,
      "PostDate": "26/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,82465,0.htm",
      "Title": "Do I really NEED this?"
    }
  ]
}