{
  "AuthorID": "grannygoose",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/grannygoose",
  "Posts": [
    {
      "AuthorID": "grannygoose",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/grannygoose",
      "Content": "My oncology doctor and I have a hard time communicating. I HAD stage 1 breast cancer. It was not in the lobes and my breast was removed. It was my choice if I wanted to have have chemo or radation. This was not neccesary but \"just to be sure\" there was no other cells. I declined. I am a healthy 68 year old woman. I actively care for my 18 month grandson and 3 year old granddaughter. I take tamoxifen and refused arimidex because of the bone loss issues. When the surgeon removed my breast he \"said congratulations you are cancer free\" . I take no other drugs. The oncology doctor refers to me as HAVING cancer. I think that my cancer dissapered into the pathologist lab. I feel bullied by my oncologyist. I want to know to know the treatment plan for the future and do not consider that to be an unusal request. It seems that before deciding on how to proceed that a test for the amount of estrogen in the blood stream and the blood test to know if there are \"markers\" to indicate a presence of cancer would give a sense of the cancer returning. (cancer can only return if it's gone?) I know he wants me to do as I am told. It took two months before he gave up on the arimidex. I realize he does not see or hear me , he only sees cancer. What should I expect for treatment to watch for a recurrence? Maybe I should leave the university hospital and go to an oncologist in private practice??? Any opinion will be welcome. BJ  ",
      "MessageIndex": 0,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21495,0.htm",
      "Title": "recurrence"
    },
    {
      "AuthorID": "grannygoose",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/grannygoose",
      "Content": "Thank you for being supportive. It takes a lot out of us to insist on being included in the decisions that are made about our own bodies. It really wears me down but I believe I can find some one to work with. Did you have a treatment plan after surgery? I am on a month to month check up . I would like to know where all this leads. On 2/29/2008 Round 2 wrote: You have EVERY RIGHT to find an oncologist that you can relate to. I have had breast cancer twice: once in 1996 when I opted for a lumpectomy with chemo and radiation and then again in late 2006-2007 when the cancer returned to the same spot and I had a mascetomy and chemo. During both occasions, I \"interviewed\" the surgeon and oncologist. I insist that I have a doctor that relates well to me and understands my wishes. I don't like to be treated like a number instead of a person. This past February, I was given an oncologist that was very hard headed and not very personal. After the first visit, I called in to make the next appointment and asked for a female oncologist. During the appointment with the next oncologist, she made me feel welcome, but I was concerned that she was too young. I stayed with her for 2-3 visits, but she didn't know enough about alternatives and wanted to stick with \"standard protocol\". I worked with her until my chemo was finished and then asked to be changed again. The third time worked like a charm. My current oncologist is my age (50) and the head of the department. She understands my needs much better than the other two doctors, and is willing to work with me to learn about vitamins and herbs. I feel that they help me and I don't want a third occurrence, so we are marching through this together. It's your body and you have to feel good about the people that are treating you. You don't need nagging thoughts and negative impressions. Are their other oncologists at your medical facility?  ",
      "MessageIndex": 3,
      "PostDate": "01/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21495,0.htm",
      "Title": "recurrence"
    },
    {
      "AuthorID": "grannygoose",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/grannygoose",
      "Content": "I am ER  with one ovary and would be happy to give up the other. Do we always have to think of ourselves as having breast cancer? I love living in the land of denial weather is great such a lovely place. On 2/29/2008 Ruth601 wrote: From my understanding, chemo is not the normal course of treatment with stage 1 breast cancer.  If you were ER+ or PR+, or HER2+, and are taking Tamoxifen or Herceptin, then I don't believe you would need to do chemo also.  With stage 1, they often just do a lumpectomy rather than removing the whole breast, so I already think you've done more than you absolutely have to.  Don't be afraid to seek a second opinion.  It's your body and the decision on treatment is yours, nobody elses.  ",
      "MessageIndex": 5,
      "PostDate": "01/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21495,0.htm",
      "Title": "recurrence"
    }
  ]
}