{
  "AuthorID": "HairSprayMom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
  "Posts": [
    {
      "AuthorID": "HairSprayMom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
      "Content": "You may also want to check into www.breastcancer.org they have a male BC discussion board. Good luck to your hubby!  ",
      "MessageIndex": 2,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42898,0.htm",
      "Title": "Men Breast Cancer"
    },
    {
      "AuthorID": "HairSprayMom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
      "Content": "Hi Tommy, I don't post to this site much, but saw yours and had to jump in for a sec. On breastcancer.org there is a Male Breast Cancer Board. I am not sure how many men frequent it, but I am sure there is some kind of support and help there. Plus you can always talk to US. If anyone can get it all the surgeries, treatments, and the crazy uncertainty it can create it is us. You jumped into the BC Family, you just happen to be a brother. I hate to hear that you wife was so vain as to leave you for the reason she did, she better watch out Karma is a mean BIT#H. All of us have a scarred chest, but I did have delayed recon done. Not a real option for you I know LOL, but did you ever go and have your nipples tattooed back on? It is amazing how much it pulls they eye from the scars, to the 3d tattooed nipples, plus insurance should pay for it. Just wanted you to know we are here for you our BC Brother! XO, Regina",
      "MessageIndex": 3,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44845,0.htm",
      "Title": "Male Breast Cancer. 2 years since surgery. Do not have support"
    },
    {
      "AuthorID": "HairSprayMom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
      "Content": "Hi Tommy, I don't post to this site much, but saw yours and had to jump in for a sec. On breastcancer.org there is a Male Breast Cancer Board. I am not sure how many men frequent it, but I am sure there is some kind of support and help there. Plus you can always talk to US. If anyone can get it all the surgeries, treatments, and the crazy uncertainty it can create it is us. You jumped into the BC Family, you just happen to be a brother. I hate to hear that you wife was so vain as to leave you for the reason she did, she better watch out Karma is a mean BIT#H. All of us have a scarred chest, but I did have delayed recon done. Not a real option for you I know LOL, but did you ever go and have your nipples tattooed back on? It is amazing how much it pulls they eye from the scars, to the 3d tattooed nipples, plus insurance should pay for it. Just wanted you to know we are here for you our BC Brother! XO, Regina",
      "MessageIndex": 2,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44845,0.htm",
      "Title": "Male Breast Cancer. 2 years since surgery. Do not have support"
    },
    {
      "AuthorID": "HairSprayMom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
      "Content": "Hi! This is Regina (HairSprayMom). Well I finally got a sewing machine and taught myself how to use it, kinda, LOL so I wanted to post this for anyone in need. I make mast/recon aprons for holding drain bulbs after surgery. I also include a length of ribbon to tie bulbs around your neck for showering. The aprons are simple two pocket aprons made out of colorful material with silk ribbons for ties. I would be happy to make and send them to anyone in need. Just PM me or E-Mail --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--  and I will get you one made and out ASAP. I have been making these for free, but the volume of aprons has exceeded my ability to keep this up (definately not a money bags)LOL. From now on there will be a $10.00 charge for aprons. For every apron ordered I will donate $2.00 from each one to the site it was ordered from. I have had this on Young Survival, Triple Negative BC Foundation and BreastCancer.org and to date I have shipped out 37 all over the country. I will alsi be attending a conference at the end of this month in Atlanta and will be passing out my aprons there as well. If you have any questions or would like to see an apron just let me know and I will send you a pic. Peace and Love to all my BC Sisters! Regina",
      "MessageIndex": 0,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44214,0.htm",
      "Title": "Do you need a surgery apron? For holding drain bulbs after surgery."
    },
    {
      "AuthorID": "HairSprayMom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HairSprayMom",
      "Content": "Ryalma, Hi! I have no idea what you are going through, however I would reccomend BreastCancer.org to connect with other Stage IV ladies. They have an entire board dedicated to our sisters who are fighting the good fight...still. I am sure that someone there has been, or is in your shoes! XO, Regina",
      "MessageIndex": 1,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44978,0.htm",
      "Title": "BC progression into liver and bones"
    }
  ]
}