{
  "AuthorID": "hanagirl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanagirl",
  "Posts": [
    {
      "AuthorID": "hanagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanagirl",
      "Content": "Thank you so very much for your message!  This was the first time I had ever used this type of site to share my problem.  I do not have lymphedema, just a rock hard right breast with extreme sensitivity.  It is also very tight to stretch my arm but have always worked with stretching and I use it in my job so its a bother but not like the 'cement' like breast.  After reading more of the message board I see a few other women have experienced this but not alot.  Seems not much can be done.  I appreciate your time in getting back to me.  Many thanks and good health.",
      "MessageIndex": 2,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    },
    {
      "AuthorID": "hanagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanagirl",
      "Content": "I had DCIS with surgery followed by radiation almost 5 years ago.  My breast has formed into a very painful and hard mass and my doctors have found no more cancer but say very little about how it happened or what can be done.  It cannot be pressed on at all and basically hurts most of the time.  Has anyone else had this happen to them and what if anything was done for you?  Apparently it is not a common occurrence.  Would appreciate hearing from you... kelley",
      "MessageIndex": 0,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    },
    {
      "AuthorID": "hanagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanagirl",
      "Content": "  On 4/14/2008 Sewwonderfulwoman wrote:   On 4/13/2008 hanagirl wrote: Thank you so very much for your message!  This was the first time I had ever used this type of site to share my problem.  I do not have lymphedema, just a rock hard right breast with extreme sensitivity.  It is also very tight to stretch my arm but have always worked with stretching and I use it in my job so its a bother but not like the 'cement' like breast.  After reading more of the message board I see a few other women have experienced this but not alot.  Seems not much can be done.  I appreciate your time in getting back to me.  Many thanks and good health. Hi Hanagirl, I wasn't clear enough in my message about the laser treatment.  You do not have to have lymphedema for the laser to help with the condition you're experiencing from radiation treatment.  To find a therapist with the laser you will need to be looking for a lymphedema therapist.  It could help, as could myofascial release.  For that kind of massage therapy try to find a body worker who's worked with cancer patients--that's what I did.  My range of motion has improved a lot and I no longer have the pain in the chest area that I did (I can hug easier and wear a seatbelt much more comfortably.)  Hope I've been a bit clearer for you.     Again I thank you for your concern to my problem and will get in touch with the specialists you recommended...I can sorely appreciate your comments about being able to hug and wear a seatbelt more comfortably; how true the discomfort in both situations!  Many thanks again.  hanagirl",
      "MessageIndex": 4,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    },
    {
      "AuthorID": "hanagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanagirl",
      "Content": "Your message to me sounds like I could've written it!  The right breast is higher, cement hard and CANNOT be touched with any kind of pressure.  I too wonder about the use of radiation on my cancer and feel I should not have gone that far...but who knows!  The doctors and books I read never said anything like this was a possibility and now have nothing much to say either.  This message board has really been a blessing to me cuz I didn't know anyone in my life that was experiencing this problem.  Just know you are not alone and can chat whenever.  I haven't given up on getting some help to change my condition and know you won't either.  I will keep in touch. Stay strong and healthy, Kelley  ",
      "MessageIndex": 6,
      "PostDate": "28/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    }
  ]
}