{
  "AuthorID": "handproblems",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/handproblems",
  "Posts": [
    {
      "AuthorID": "handproblems",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/handproblems",
      "Content": "  On 9/23/2007 JackieL wrote:   On 9/20/2007 handproblems wrote: Hi, I suspected the drugs I was on have caused me to have hand problems. I also work with my hands as a librarian.Lots of carrying moving,sorting ,packaging, shelving books full time. I was on Arimidex for one year before it was so severe I changed to Femora,same effects, went off everything for a few months and my hands felt a bit better and my oncologist suggested Aromasin. I've had numerous cortizone shots and a trigger finger release surgery. I am scheduled for a carpal tunnel release in two weeks and I need a fusion to the thumb of ssmy right hand. Has anyone had similar problems and have the problems gone  away if you stop taking the drugs? I don't think my right thumb has any chance of coming back from the severe arthritis. Has anyone had relief from carpal tunnel by going off the medications?  How long does it take for your hands to improve or has the damage been done? Any answers would be appriciated. Mary Hi, I have the same problems with my hands and i am going to a rheumatolist. Both of my thumbs and ring finger on right hand had injections which helped with the trigger finger, but now it has gone to my wrist and all my fingers except pinkys. My oncoligist thinks its arthritis. i have the same questions. I will ask my doctor. JackieHas the Rheumatolist been any help except to say it is arthritis? I see my oncologost this week and I will report any new information.  ",
      "MessageIndex": 2,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16343,0.htm",
      "Title": "Hand surgeries due to Arimidex,aromasin and femora"
    },
    {
      "AuthorID": "handproblems",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/handproblems",
      "Content": "Hi, I suspected the drugs I was on have caused me to have hand problems. I also work with my hands as a librarian.Lots of carrying moving,sorting ,packaging, shelving books full time. I was on Arimidex for one year before it was so severe I changed to Femora,same effects, went off everything for a few months and my hands felt a bit better and my oncologist suggested Aromasin. I've had numerous cortizone shots and a trigger finger release surgery. I am scheduled for a carpal tunnel release in two weeks and I need a fusion to the thumb of my right hand. Has anyone had similar problems and have the problems gone  away if you stop taking the drugs? I don't think my right thumb has any chance of coming back from the severe arthritis. Has anyone had relief from carpal tunnel by going off the medications?  How long does it take for your hands to improve or has the damage been done? Any answers would be appriciated. Mary",
      "MessageIndex": 0,
      "PostDate": "20/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16343,0.htm",
      "Title": "Hand surgeries due to Arimidex,aromasin and femora"
    }
  ]
}