{
  "AuthorID": "hanhsi",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanhsi",
  "Posts": [{
    "AuthorID": "hanhsi",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hanhsi",
    "Content": "On Jan 17, 2014 3:46 AM TraJac wrote: My Mom was recently diganosed with Stage III IDC. SHe underwent a mastectomy and is now doing chemo before starting radiation. Her biggest complaint is extreme diarrhea and extreme leg weakness. So much so that there have been times she can't make it to the bathroom quick enough. And walking from one end of the house to the other is difficult because her legs get so wobbly. ANY suggestions from anyone who has experienced this would be so wonderful. It makes me so sad that she is going through this but then to have these side effects that are so debilitating makes me even more sad :( Please help us!  My sister has breast cancer stage 4 also, and it spread to her liver, bone, spine and the doctors said she will be expired within 6 months. We found the medicine developed by Dr. Jerry McLaughin who was professor in Purdue University.  He reseached for more than 10 years to find the cancer medicine, the goverment granted him 5 millions to research.  He developed the PAW PAW CELL-REG for 10 years, but my family did not know.  Until my sister was not curable by the hospital.  We went on line and search and want to try.  My sister could not sit up from bed, and we had to push her on wheel chair from bed to bathroom.  She lost appertise completely, and lost more than 30 lbs within 2 months, and her stomach was filled with fluid that she had to be drained every 3 or 4 days, 3 liters each time.  We all prepared to loose her, but now, after taking Dr. McLaughin medicine for 5 weeks, she started to rise from bed herself, then she walked using the walker herself and began to eat more.  After 2 months, she can go upstair to take shower all by herself, and 2 days ago, she went to grocery with her husband after 4 months.  We do not see miracle before, but I do believe now.  I am writing this to you because we went thru this with my sister, she is only 57 years old. Please try, you can find the medicice from NATURE SUNSHINE for only $40 per a bottle (180 pills).  Here is the link you can learn more if you wish http://www.donnaroth.com/search/label/Breast% , 20Cancerhttp://www.donnaroth.com/search/label/cancer,andwww. Good Luck, Kathy  ",
    "MessageIndex": 8,
    "PostDate": "03/03/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,75299,0.htm",
    "Title": "Please help deal with extreme weakness"
  }]
}