{
  "AuthorID": "Hannah",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hannah",
  "Posts": [
    {
      "AuthorID": "Hannah",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hannah",
      "Content": "To those who have completed their treatments, are in remission and are wondering what next, I say.... we've been given a second chance. I too am afraid of reoccurrance [terrified actually as I just completed 1.5 yrs of chemo (A/C & Taxol) & adjunct therapies (Herceptin, Radiation & Fareston) to treat Stage III breast cancer] but just think, we're alive! Hell, if your chemo was as fun as mine was.... then each and every one of us has already walked through the valley of the shadow of death and lived to tell about it. So, my question to you is... What do YOU really want to get from this life? You now have a chance to start over... isn't there something you have always wanted to do but were too busy or too afraid to do? Grab the GIFT of life you've been given with both hands - and, well - SHAKE HARD! just to see what falls out. You know, live each day.... Now, I realize finances are rough for all of us but there are a lot of things out there we can do to enjoy this gift we've been given. An actual chance to start over. Personally, I've been working on changing as many of the self destructive and self abusive behaviors I can; such as - my diet, exersize (started yoga & Tai Chi), I'm getting a divorce, and am looking forward to spending a lot of time giving back for all the support I've received along the way. Once I'm strong enough I'd like to volunteer my Reiki skills @ the cancer center where I received my care, maybe also work at a farm near where I live that uses horses (pet tharapy) to reach troubled teens and for the long term, I am planning on opening a Wellness Center for sick children & their families. I expect the center will take 5-10 yrs to have up and running but who cares? I don't have children of my own, will be single in 3 months, and I want to do SOMETHING WORTHWHILE w/ my life. Just think about it.... then go out and do something about it..... What do we have to lose that we haven't already???? My best to you & yours, luv Hannah.",
      "MessageIndex": 19,
      "PostDate": "11/10/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,549,0.htm",
      "Title": "Does Anyone Else Wonder What To Do Now That The Treatments Are Over?"
    },
    {
      "AuthorID": "Hannah",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hannah",
      "Content": "See if you can find a Reiki practitioner in your area. Reiki is a very wonderful complementary therapy which can help provide you w/ the energy needed to continue the fight. Here is an excellent site to learn more. [http://www.reiki.nu/reiki/reiki.html] I received reiki treatments regularly during the initial A/C&T treatments {Stage III breast cancer - 1.5 yrs of chemo (A/C & Taxol) & adjunct therapies (Herceptin, Radiation & Fareston)} and it allowed me to continue working full time. In fact the days that I wasn't able to receive the reiki, my side effects were much, much worse. Shortly after I completed the A/C&T, I received the Level 1 Reiki Attunement so I could give myself daily reiki treatments. The connection to the Universal Life Energy, established during the attunement process, has given me the strength to continue my fight. I no longer feel that I am fighting alone. If you cannot find anyone in your area, go to the [www.reikisecrets.com] website where you can receive a free attunement and then let me know so I can explain the how to's, etc... You may even be able to branch out and become a practitioner yourself (instead of the massage) as Reiki requires no energy input from you, and you would actually receive reiki as you give it to others, allowing you to help others without harm to yourself and to find a purpose to continue the fight. My best to you & yours, ......luv Hannah.",
      "MessageIndex": 18,
      "PostDate": "11/10/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,549,0.htm",
      "Title": "Does Anyone Else Wonder What To Do Now That The Treatments Are Over?"
    }
  ]
}