{
  "AuthorID": "Healthy_Times",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Healthy_Times",
  "Posts": [{
    "AuthorID": "Healthy_Times",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Healthy_Times",
    "Content": "  On 3/29/2007 Spiritsquad wrote: If I have dcis and I remove my breast won't I be removing all the dcis hence lessening the chances. See what I have been struggling with is I just have been notified that I need a re excision due to poor margins I have necrosis cells I have solid pattern with high grade on my first biopsy and intermediate grade on the lymphectomy biopsy. I have no great attachment to my breast and my spouse wants me to have it removed to lesson worry of reoocurrance. with reconstructive surgery as an option I guess the thought of removing my breast w/reconstruction and not having to go through more reexcisions (Possibly) and also not having to go through Radiation as well I am not a gambler and from what I have researched so far a masectomy seems the savest route to take. I have yet to read or hear that lumpectomy with radiation and tamoxifen has a better cure rate than masectomy. I have heard that its about the same I guess I am just a littel confused.  Thanks for your answers they are greatly appreciated.  God Bless,  Spiritsquad   I had DCIS.  I had the lumpectomy and then Radiation Therapy.  I will be taking Tamoxifan for 5 years.   According to my Oncologist the treatment that I have had makes my reoccurrence 2%.  It sounds like very good odds to me!    The Tamoxifan has had no side effects for me. I worked for the American Cancer Society for years so I know that everyone is different.  It really is an individual decision.  In addition, I had a close margin and they thought they would have to redo the operation but they did an MRI of both breasts instead.  It turned out negative so all I had was the radiation.  I have to go to the Oncologist every four months for five years.  I have always felt fine and never lost my energy.  This was found with a routine mammogram, no lump. I have kind of breezed through the whole thing.          ",
    "MessageIndex": 9,
    "PostDate": "30/03/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10822,0.htm",
    "Title": "Tamoxifin and dysplasia"
  }]
}