{
  "AuthorID": "Heidi_g",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Heidi_g",
  "Posts": [{
    "AuthorID": "Heidi_g",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Heidi_g",
    "Content": "I wanted to respond by saying that no one deserves cancer. God is a loving God and He did not create sickness and death. Satan uses it as a means to draw us away from a relationship with God by blaming him for our illness or situation. Satan's only goal is to bring us down to a level where we will not turn to Jesus and be freed from the sins we all have. Satan is real, he hates us and wants us dead! I just watched my mother in law, Dian, leave to be with Jesus in Heaven on Thursday July 14, 2005. Her body succumbed to Inflammatory Breast Cancer or IBC. Her entire family was able to send her into the arms of Jesus with a final prayer of release. We watched her spirit leave her body ~ saw her life force drain out and her eyes grow dim, while her body continued to try and live for almost an entire minute after! God took her with Him to Heaven before Satan's curse of death could be bound to her. God robbed death from it's grip on her by taking her before she died. The Bible says that Jesus holds the keys to death and the grave. This does not mean that He gives us the disease, but sometimes He allows us to deal with tough things like cancer. It makes us stronger. I read a billboard once that said, \"You don't get to be an excellent fisherman by sailing on calm seas.\" We go through experiences like this to make us stop and thank God for the gift that life is, to appreciate our friends and family, and to look deep within ourselves to realize that we need a relationship with Him. Why did God allow our Dian to die? We do not really know, but we do know that we will see her again one day in Heaven. What hope and peace!!! Perhaps she left because we all relied too heavily on her for our relationship with God and now we have to turn to Him for it. She was always speaking to us about Him and encouraging us in our Christian walk. Maybe it is time for us to grow up and walk on our own. I don't know the answer but I trust that He does and that He only wants what is best for us because He loves us. Yes, it hurts...deeply to not have her physically around. I grieve over what my children are missing out on. I do not look forward to the holidays without her. I am not joyed that she is gone, but I trust that she is in a better place. My friends' husband recently died from throat cancer. She said that she learned she did not honor her husband like she should and that his death has caused her to grow in her relationship with God more than she ever would have with her husband alive. She was too dependant on him for her spirituality. She had to be able to form her own realtionship. One last thing. I am not preaching to make anyone feel uncomfortable. This is just what is on my heart and what has given our entire family sooo much comfort in this difficult time. We are all grieving, as we should. But one thing Dian told us all was that if this whole cancer thing and her death caused one, even one person to turn to the Lord then she would gladly do it again. Now that is love. The greatest fruit of the Spirit that God gave to us.",
    "MessageIndex": 9,
    "PostDate": "20/07/2005",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2431,0.htm",
    "Title": "What Did i Do, to Get Cancer"
  }]
}