{
  "AuthorID": "HerbalOutpost",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
  "Posts": [
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Although there are alternatives to chemo, there are also holistic ways to reduce the side effects caused by chemo so that it doesn't make you feel so horrible. It's a given that chemo is hard, however it doesn't have to be quite as hard. Your onco is a TRAINED professional, and he/she is better informed in what is best for your situation. However, what is best is NOT necessarily what is comfortable. And know that, even though oncologists are well educated in cancer, they are not taught holistic methods and this is why they often times don't prescribe such methods. Absolutely use holistic methods, but be sure you know that the methods actually work WITH your onco's treatment, not \"instead of\".",
      "MessageIndex": 4,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92983,0.htm",
      "Title": "Stopping Chemotherapy"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Ibrance is also known as Palbociclib. Here is an information page that gives all the details regarding usage, precautions, side effects, etc.: https://www.nlm.nih.gov/medlineplus/druginfo/meds/a615013.ht Hope this helps!",
      "MessageIndex": 1,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92242,0.htm",
      "Title": "Ibrance oral chemo"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "I'm glad you insisted on further investigation! I've noticed that most times a patient is their own best advocate, but only if the patients actually speaks up. Rude? Never! It's your body, and only YOU know what's questionable and should be looked at.",
      "MessageIndex": 3,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92139,0.htm",
      "Title": "question"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Did you ever get a biopsy on the lump you found? How did things turn out?",
      "MessageIndex": 2,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90562,0.htm",
      "Title": "Found a lump in my breast - scared"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "According to the American Cancer Society, women who've survived thyroid cancer do have an increased risk of developing breast cancer later. This is known as a \"second cancer\" (not the same as a secondary cancer). Times between the cancers are different for each patient. If you are concerned about possibly having developed breast cancer I strongly advise you to go get checked out as soon as you can, if you haven't already done so.",
      "MessageIndex": 2,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90187,0.htm",
      "Title": "Breast Cancer After Thyroid Cancer?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "FNA is commonly used for biopsying breast cysts. Although it is uncommon for a normal cyst to turn cancerous some cancers may seem like a cyst, therefore you need to know if what you have is an actual cyst or is really a tumor in the making. Fibrocystic breasts do not increase your chances of developing cancer. However, if you are still concerned about the lumps you feel then I strongly suggest you have further discussions with your doctor.",
      "MessageIndex": 1,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90631,0.htm",
      "Title": "according to my ultra sound report is FNA urgent for me"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Sorry I didn't see this post sooner, I hope all is well with your wife! There are innumerable breast cancer survivors living with \"mets\" for 10+ years. Do a google search for \"living with mets breast cancer\" and you will see lots of webpages, blogs, and messaging forums that deal exactly with this. Patients tell what kinds of treatments they've been having success with, how to get around setbacks, and more. I think you should check it out.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89910,0.htm",
      "Title": "Breast Cancer with Brain Mets ONLY!"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Kinda of a dumb question, but did you ask your doctor why you can't just use the contraceptive pill?",
      "MessageIndex": 1,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91882,0.htm",
      "Title": "why danazol vs birthcontroll pill for Fibro-cystic change in right breast parenchyma"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "With all those lymph nodes involved I'm curious. If you don't want to answer this I understand, but I'm wondering which stage you were diagnosed with and which type of breast cancer.",
      "MessageIndex": 2,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92074,0.htm",
      "Title": "Newly diagnosed with breast cancer."
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Yes, 3D mammography is better at imaging dense breasts.",
      "MessageIndex": 1,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89572,0.htm",
      "Title": "4 axillary lymph nodes"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Lung AND breast cancer? I'm wondering, because oftentime breast cancer will spread to the lungs; however I do recognize that many patients can have two different cancers at the same time. So I supposed the first question is whether it is two cancers, or is it a metastasized breast cancer?",
      "MessageIndex": 1,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93122,0.htm",
      "Title": "How long can someone live with breast cancer untreated?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "I am no doctor, but since it \"ebbs and flows\" with your monthly cycle, I would think this is hormone related. Maybe it's just a breast cyst. Breast cancer hurts? Only rarely -- and usually with inflammatory breast cancer (which doesn't usually present with a lump). HOWEVER.... if you are concerned, you must absolutely go get checked for breast cancer! Some women do get it young, and it is not ridiculous to be cautious. Instead of living in fear, get the facts, and if you DO happen to have cancer, be glad you caught it sooner than later.",
      "MessageIndex": 1,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91869,0.htm",
      "Title": "Lump under breast where braline would be! very worried."
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Whatever you do, absolutely make sure your oncologist is FuLLY aware that you've had the heart attack because some chemotherapy medications can temporarily weaken a patient's heart. Chemo meds that are known for this include anthracyclines (such as doxorubicin, daunorubicin) trastuzumab (Herceptin) and pertuzumab (Perjeta). According to the Mayo Clinic: The chances of heart damage caused by anthracyclines coincides with the total amount of exposure to the drug during your lifetime. So if this is a brand new drug to you, your chances are better. As for trastuzumab, it is not lifetime exposure, but any exposure you need to be aware of. Taxanes may have the side effect of causing an abnormal heart rhythm. Fluorouracil and capecitabine (Xeloda) may cause spasms of the arteries in the heart, a heart attack. The Mayo Clinic strongly recommends that you undergo heart function tests before receiving any chemotherapy drug known to affect the heart.  It is also advised that a combination of chemo with radiation can increase the risk of heart effects. I am not trying to scare you into or out of anything, but you do need to know exactly what you are getting into what you need to discuss with your onco.",
      "MessageIndex": 2,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90693,0.htm",
      "Title": "I suffered a massive heart attack 10 mos ago, yesterday I was diagnosed with cancer."
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Sometimes kidney issues can cause body odor.",
      "MessageIndex": 3,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88937,0.htm",
      "Title": "Smelly and ashamed"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "There are so many reasons a person can have a vinegary smell. Sometimes certain bacteria living in sweat glands can break down amino acids, causing a vinegar-ish odor. If this is a new \"issue\" for you, sometimes medications can change the bacterial populations on your skin, causing that vinegar odor. Changing medication may or may not eliminate the bacteria, IF that is what's even causing your problem. Alternatively, your diet may cause a vinegar type odor as well -- have you changed your dietary routine in the past year? Other health problems that can cause a vinegar-like body odor include the development of diabetes, hormonal imbalances, and menopause. The only way to know the root of the problem is to be tested for those things. Since ovarian cancers and some breast cancers are hormonally related it wouldn't be a bad idea to check for that as well, if you haven't already. Whatever is causing it, do advocate for investigation, but don't get overly paranoid. It may be something much simpler than cancer. Let us know how the investigation goes!",
      "MessageIndex": 1,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92056,0.htm",
      "Title": "body and urine odor"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "You should speak with your doctor about using the following: AGARICUS SYLVATICUS: A.k.a. Scaly wood mushroom, a.k.a. Sun mushroom. A study involving 46 breast cancer patients using chemotherapy found that those who were given 2.1 grams of A. sylvaticus extract divided into two doses daily, for six months experienced an 80% decrease in nausea and vomiting symptoms GINGER Zingiber officinale: is a spice related to turmeric. Ginger, a well-known remedy for nausea and vomiting has been noted as effective for adult cancer patients.1 Precautions: Ginger is a known blood thinner. Use in moderation. If pregnant be sure to seek a qualified practitioner's guidance before use as overuse may stimulate uterine contractions. Ginger can prolong the sedative effect of barbituates. Use caution if you are suffering from gallstones, Inflammatory Bowel Disease, Irritable Bowel Syndrome, or ulcers. Dosages: Ginger comes in several forms. A single dose of ginger is: 1 cup of ginger tea one medium piece of crystallized ginger 2 droppers of ginger extract 2 teaspoons of ginger syrup 1 tablespoon freshly grated root ½ teaspoon of ground ginger. Take a single dose up to three times daily. 1 Supportive Care in Cancer – Official Journal of the Multinational Association of Supportive Car in Cancer, July 2012, Vol. 20, No.7, pp. 1479-1489, “Ginger (Zingiber officinale) reduces acute chemotherapy-induced nausea: a URCC CCOP study of 576 patients” J. L. Ryan, et al HOT PEPPERS: Hot peppers contain a substance known as capsaicin, which gives the peppers their spicy hot flavor; the hotter the pepper, the more capsaicin it contains. It is well known in scientific circles that capsaicin reduces a neurotransmitter known as Substance P,1 a compound which transmits pain signals and induces nausea.2 Precautions: Do not use capsaicin cream or cayenne pepper on surgical sites, radiation sites, broken skin, mucous membranes, or get it in your eyes. Do not use internally in therapeutic doses during pregnancy due to a possible risk of childhood brain tumors. Taking cayenne internally for long periods can reduce your liver's ability to process certain prescription medications. Excessive use of capsaicin internally may increase the risk of developing liver and stomach cancers. Capsaicin may thin the blood. Excessive internal use may irritate the intestinal tract. Wash hands thoroughly after using the fresh peppers or the topical remedies. Women with lobular breast cancer should moderate their intake due to an increased risk of metastasis to the stomach. Peppers are in the nightshade family; avoid use if you are allergic to other members of nightshades such as potatoes, tomatoes, eggplants, tomatillos, ground cherries, and goji berries. Dosage: Normal dietary intake is safe. Because scientific studies have shown conflicting results as to whether capsaicin may be carcinogenic in high doses I do not recommend using capsaicin supplements without the oversight of an experienced practitioner. 1Naunyn-Schmiedeberg's Archives of Pharmacology, June 1981, Vol. 317, No.2, pp.140-148 “Differential effects of capsaicin on the content of somatostatin, substance P, and neurotensin in the nervous system of the rat” Rainer Gamse, et al 2Drugs, 2000, Vol.60, No.3, p.535, “Potential of Substance P Antagonists as Antiemetics” Pierre Diemunsch et al",
      "MessageIndex": 1,
      "PostDate": "04/07/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92292,0.htm",
      "Title": "TCHP 4 rounds vs 6 rounds"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Whole body scans are usually done by way of Computerized Axial Tomagraphy (\"CT\" or \"CAT\" scan), which uses X-rays, a type of radiation. A whole body scan tends to give a relatively high exposure to radiation and is known to increase the risk of developing a cancer later on; therefore it is not a recommended procedure for people who don't have clear symptoms. In other words, your doctor is not being dismissive, he is being cautious, as he should be. You may want to ask about having an MRI scan done instead (Magnetic Resonance Imaging). It does not use radiation and is generally safer so long as your mother does not have any implants inside her (pacemakers, rods, pins, etc.). Some doctors combine MRI's with PET scans (Positron Emission Tomography). PET scans do have a lower dose of radiation exposure than CT scans, so I would discuss this with your oncologist.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90139,0.htm",
      "Title": "After surgery"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "A friend of mine had a double mastectomy and the surgeons used her own body fat taken from her abdominal area to construct new breasts. Yes, it is a recovery process, but in the end her breasts look great (even the nipple tattoo artist did a convincing job!). ",
      "MessageIndex": 0,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91815,0.htm",
      "Title": "breast implants for breast cancer patients"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "I don't see the point in giving them a \"maybe\". If all turns out well, then you've worried them for nothing. However, if you need to tell someone that you're scared about this I suggest going to a breast cancer survivor group (whether in your community or online) and let your feelings out with them. It is scary to not really know, and those women will be able to help you navigate that time period since they'd been through it themselves.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89965,0.htm",
      "Title": "New breast lump"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Although I am not a breast cancer survivor I have been touched by the innumerable breast cancer patients whom I have taken care of over the past 15 years as a Certified Nursing Assistant. I have recently become a formally educated holistic practitioner, and my main focus is helping breast cancer patients (male and female). I wanted to sign on to this site, not to solicit or sell anything, but to connect with survivors and exchange ideas and information. In my opinion education is an important part of healing as it puts people in control of the disease (and not the other way around). We can all learn from each other while we're supporting each other, so I'm looking forward to the interaction on this forum!",
      "MessageIndex": 0,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92155,0.htm",
      "Title": "Introducing myself!"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "First of all: Congrats on beating stage 4 BC, it's positive proof that it can be done! (so many patients become discouraged at that stage ). Second: Have you spoken to your oncologist about your symptoms? If not, then I strongly urge you to do so; there may be other options for you. If you have already mentioned these symptoms, what did your oncologist say?",
      "MessageIndex": 1,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93120,0.htm",
      "Title": "Letrozole"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "How did the biopsy turn out?",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90259,0.htm",
      "Title": "Stage one spread???"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Praise God! Yeah, the problem with cancer treatments is that they sometimes cause other issues. Ugh. Thankfully all is well with her now!",
      "MessageIndex": 3,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90259,0.htm",
      "Title": "Stage one spread???"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "There are two cannabis-based medications approved by the FDA: Dronabinol (a.k.a.Marinol)  and Nabilone (a.k.a. Cesamet). Dronabinol should be refrigerated, and it does contain sesame oil so be aware of any allergies. Both Dronabinol and Nabilone are shown to be useful for counteracting nausea and vomiting brought on by chemo treatments. I do not recommend using whole-herb cannabis for three reasons: 1 -- Smoking it exposes the user to other cancer causing agents. 2 -- If you choose to eat it, you don't know which pesticides were used on it. These can also increase your risk of worsening breast cancer. 3 -- Whole cannabis isn't legal in most states. Stay out of trouble; instead try to obtain a prescription of Dronabinol or Nabilone. A friend of mine who was battling HIV was prescribed Dronabinol for his nausea. He said it helped him out quite a bit. I think these medications are worth speaking to your oncologist.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90113,0.htm",
      "Title": "Chemotherapy and marijuana *new user"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "A tumor marker is a substance that is either (1) produced by the tumor itself, or (2) a substance created by your body in response to the tumor. Some markers are specific to certain cancers, and some markers are seen in several different kinds of cancers.",
      "MessageIndex": 1,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89738,0.htm",
      "Title": "Tumor markers"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Have you looked into the Family and Medical Leave Act? I'm not sure of the rules, but investigate to see if you are eligible to use it to take some important time off.  IF you are not eligible, is there any way your job would allow you to telecommute while you stayed with your mother? (I have no idea what your job is).",
      "MessageIndex": 3,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91834,0.htm",
      "Title": "25 year old in need of advice"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Chemo is KNOWN to be a harsh treatment, and cancer is also known as a harsh disease. Think of it this way: When your army is up against a dangerous enemy, your army must use harsh measures in order to beat the enemy. This is not comfortable for ANY soldier, and YOU are the soldier in your fight against cancer. This doesn't mean you must resign to a life of misery. Just as soldiers receive \"updated\" weapons to fight, you can also receive \"updated\" methods to fight your cancer. Sometimes this means using holistic methods to help your fight, just realize that doctors aren't trained in those particular methods. When you choose a holistic practitioner, be sure you use one who works WITH your doctor's treatments, not one who works \"instead of\".",
      "MessageIndex": 1,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92966,0.htm",
      "Title": "Capecitibine"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Two questions: 1 -- Do the sensations feel as though they are happening in the reconconstructed part of your breast, or do they happen in the intact parts that were not surgically removed? 2 -- When you had reconstruction done, did they use your own body fat to do it or did they use artificial implants instead?",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90231,0.htm",
      "Title": "Pain, burning sensation, brussed, cold sentation Years After Breast Reconstruction"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "How do any of us know that your product(s) are scientifically valid against breast cancer? There's an awful lot of quacks out there.",
      "MessageIndex": 1,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92700,0.htm",
      "Title": "sure works for you too"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Estrogen positive cancer patients should also avoid licorice root.",
      "MessageIndex": 49,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Estrogen positive breast cancer patients should also avoid licorice.",
      "MessageIndex": 48,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Is she diluting the oil? A person should never put undiluted essential oils on their skin (known as being applied \"neat\") because it can cause permanent skin sensitivity.A common dilution is 12 drops of oil per tablespoon of vegetable oil or mineral oil. Also, she needs to know that the boswellic acid in frankincense that has the anti-cancer properties does not exist in frankincense OIL, but in frankincense EXTRACT. The boswellic acid molecules are too heavy to transfer into the oil when being produced, therefore she should actually be using the extract instead. Also, it is important to know whether she is receiving any radiation treatments, thermal treatments, or other treatments directly on the skin of the tumor site. If she is, she needs to check with her doctor to be sure that the frankincense extract is not interfereing with the prescribed treatment.",
      "MessageIndex": 1,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92606,0.htm",
      "Title": "frankincense oil"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "If you don't have a local holistic place or herbal practitioner who sells it, you can find it online. Many companies will call it boswellia extract and some companies will combine it with other herbals such as Devil's Claw, so be sure you aren't allergic to any of the ingredients, or that the other ingredients will not work against other medications. Do not take boswellia/Frankincense orally if you are on blood thinners at it is also a blood thinner; you don't want to have bleeding problems.",
      "MessageIndex": 3,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92606,0.htm",
      "Title": "frankincense oil"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "I have a couple of things to say: 1 -- A doctor who is upset about YOU getting a second opinion when it's YOUR life on the line, is a doctor who isn't tuned in with you. 2 -- Taxotere has recently been revealed to give the side effect of PERMANENT hair loss. Although this may be seen as a vanity issue, if another medication can work as well but without that side effect, I say go for it. 3 -- Sometimes YOU have to be your own advocate, which can be a royal pain. Do your homework, make sure you are armed with evidence-based information backed by legitimate scientific studies, doctors tend to pay more attention with that.",
      "MessageIndex": 2,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89314,0.htm",
      "Title": "How to make my doctor consider other options ?!"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Sorry, I didn't see this post until now! Did you get to a doctor and have this solved?",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92175,0.htm",
      "Title": "Drain came off 5 days after masectomy"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Although breast cancer in someone as young as you is rare, it isn't impossible -- an 8 year old girl named Chrissy Turner is the youngest known breast cancer survivor.  I'm curious: does breast cancer run in your family?  I strongly suggest you speak to your mother or other trusted female adult relative and schedule an appointment to be tested. Let us know how things go!",
      "MessageIndex": 1,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92163,0.htm",
      "Title": "Very worried"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "ADH is usually viewed as benign but with an increased risk of developing cancer later. You definitely want to keep a close eye on any breast changes, for sure. According to Johns Hopkins University: \"There is no way to determine the presence of ADH by reviewing a mammogram or other breast imaging study. It also cannot be felt on a clinical breast exam. If ADH cells are found on a core biopsy, an excisional open breast biopsy is necessary so more tissue can be examined. Approximately 25 percent of the time when ADH cells are found on a core biopsy, the cancer is determined to be early stage.\" They also state that women with ADH who have not developed cancer sometimes opt to be on tamoxifen as a preventative measure. However, since you are so young, you may also want to consider the possibility of developing a triple negative breast cancer (which tends to show up in younger women). You definitely need to have a conversation with your oncologist about these things.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90221,0.htm",
      "Title": "2nd mass found within months of first surgery"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "The more radiation you have to your chest area the higher the risk of developing lung cancer down the road (this is known as a second cancer -- a cancer caused by the treatment of another cancer).  I would discuss alternative options such as MRI, which uses magnetic energy, or a breast ultrasound which uses sound waves. Also, be sure to learn how to do a self breast exam. Although breast self exams aren't being promoted so much these days I think they're a valuable tool for detection. Currently, science is also investigating optical imaging (using light, and breasts aren't required to be squeezed) as another way to perform breast imaging. Remember, YOU are your own advocate. Educate yourself on the risks of different procedures and discuss them with your doctor.",
      "MessageIndex": 2,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89846,0.htm",
      "Title": "How soon to have first mamogram done after ending raadiation treatments ?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Great, that's wonderful to hear! Because you're so young it's probably nothing, but a lump is a lump, and you can NEVER be too careful!",
      "MessageIndex": 4,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92163,0.htm",
      "Title": "Very worried"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "I would stay with the same facility. They already have some of your medical records, and you may not even need to go any further than the biopsy. To keep things simply I would advise you to stay with the same facility unless something comes up that your current hospital does not have the equipment to handle.",
      "MessageIndex": 1,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90233,0.htm",
      "Title": "Diagnostic Mammogram showed clusters of calcification"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "By \"AML\" are you referring to acute myeloid leukemia? I'm just trying to be sure because you posted her in the breast cancer section instead. Generally speaking, chemo for leukemia is a different set of drugs than chemo for breast cancer. Ergo side effects and symptoms may not always relate. You might get a more specific answer in the leukemia section. And, I am so sorry that you have been diagnosed with AML. All cancers are ugly surprises, and my heart goes out to you. I pray that all goes well as you go through this.",
      "MessageIndex": 1,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92413,0.htm",
      "Title": "aml"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "You weren't given a biopsy of the lump?",
      "MessageIndex": 2,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,90686,0.htm",
      "Title": "Results from u/s and diagnostic mammogram are negative but still feel lump. What next?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Surgery: Is she considering a total mastectomy? Due to the higher recurrence rate of triple negative breast cancers many women choose a total mastectomy instead of a lumpectomy. Actress Christina Applegate underwent a double mastectomy after being diagnosed with tumor and a BRCA gene mutations (many of which are triple negative cancers). Since your wife's body is now fighting TWO cancers, the two of you may want to do some research on double mastectomies and reconstruction. Since breast chemo is not an option, I would consider this as a possible option.",
      "MessageIndex": 2,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92168,0.htm",
      "Title": "Triple neg lump, but can't have chemo. What to expect?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Surgery: Is she considering a total mastectomy? Due to the higher recurrence rate of triple negative breast cancers many women choose a total mastectomy instead of a lumpectomy. Actress Christina Applegate underwent a double mastectomy after being diagnosed with tumor and a BRCA gene mutations (many of which are triple negative cancers). Since your wife's body is now fighting TWO cancers, the two of you may want to do some research on double mastectomies and reconstruction. Since breast chemo is not an option, I would consider this as a possible option.",
      "MessageIndex": 3,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92168,0.htm",
      "Title": "Triple neg lump, but can't have chemo. What to expect?"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Some people get so scared that they MIGHT have cancer that they avoid getting checked (\"if I'm not diagnosed, then I don't officially have it\" type of thought). I agree with the other person who responded: Speak to a trusted adult relative. This shouldn't be yours alone to bear.",
      "MessageIndex": 3,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88065,0.htm",
      "Title": "BREAST LUMP FOR FOUR YEARS AND ITS NOW BIGGER"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Stage 1 breast cancer has a phenomenal survival rate between 98% - 100%, depending on which source you go by. This is great odds, I'm so glad you found it this early! You probably already know that the anastazole is an aromatase inhibitor, which means it blocks the synthesis of estrogen in your body, reducing your estrogen levels. This is different than how tamoxifen works (which simply blocks already-produced estrogen from attaching to your estrogen receptors). Although anastazole tends to work better than tamoxifen, rashes are a known side effect of the medication. I hesitate to advise alternative chemo drugs since I don't know you whole health history but I do strongly advise you to trust your oncologist to give you a different medication to try. Because you have an estrogen positive cancer you should also be sure that you aren't taking any herbals or supplements containing plant-based estrogens. This includes soy, red clover, licorice, black cohosh, or anything that is meant to help ease menopause symptoms without your oncologist's advice. Also realize that no chemotherapy medication will be \"comfortable\", they all have unlovable side effects, but these effects are only temporary (and WORTH IT to kill the disease!) Once you've beaten the cancer you will have plenty of time to enjoy your children! Yes, breast cancer is a serious diagnosis, and can be very scary. But don't let it scare you witless; stage 1 is very treatable and very survivable. Let us know how things go with your doctor visit!",
      "MessageIndex": 1,
      "PostDate": "22/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92178,0.htm",
      "Title": "scaring me crazy!!!"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Soybeans/edamame and most things made from them (soy milk, tempeh, tofu, etc,) have plant estrogens. Since your chemo is trying to prevent estrogen (because that is what is fueling your cancer), I'm thinking soy beans should be avoided for now. If you are vegetarian or vegan, be aware that soy isolate in many veg products should also be avoided. Some people can resume modest soy consumption after a cancer has been beaten (no more than 3 servings per day), but I would advise asking the oncologist about that.",
      "MessageIndex": 3,
      "PostDate": "24/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,92178,0.htm",
      "Title": "scaring me crazy!!!"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "You shouldn't take the above listed medications concurrently with hormone replacement therapy as they work against each other; who knows what kinds of hormonal upheavals this can cause in your system! If you want to reduces the symptoms of menopause, but do not want to increase your risk of breast cancer, it's better to speak to your doctor about using foods which contain phytoestrogens (plant-based estrogens). Plant estrogens can help reduce menopause symptoms however they are much weaker than synthetic estrogens, thereby reducing the risk. Do not use estrogen-heavy supplements (such as soy isoflavones) because these are more concentrated and increases the risk of cancer. Plant estrogen foods: Soy (tofu, edamame, tempeh, miso, soy milk, etc.) Flax seeds (use ground or powder, not whole) Nuts (sesame, pistachio, sunflower seeds, walnuts) Mung beans Lentils Candy made with real licorice Alfalfa Sprouts Green beans Use normal dietary amounts, up to 6 servings per day unless advised otherwise by your physician.",
      "MessageIndex": 1,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89086,0.htm",
      "Title": "How to reduce the risk of breast cancer from hormone therapy"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "This is not the most active forum on the net, I must admit. I noticed this very quickly when I first signed up a couple of weeks ago. It sounds like you're describing a condition known as intraductal papillomas, am I correct? This is a non-cancerous condition and don't usually raise the risk of becoming cancerous if a biopsy shows tissue samples to be otherwise normal. The most common treatment is to surgicaly remove the papillomas. Local anesthesia can be used on this type of procedure, so i would ask your doctor why the surgeon is unwilling to go that route.",
      "MessageIndex": 3,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89646,0.htm",
      "Title": "Papilloma Purge Pressure"
    },
    {
      "AuthorID": "HerbalOutpost",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/HerbalOutpost",
      "Content": "Some cancer treatments have the nasty little side effect of reducing your body's production of blood cells. This is a necessary evil when waging war on cancer. When the blood supply becomes too depleted the patient will require a transfusion; it's not unusual. Some patients take iron supplements for this very reason, but I strongly advise doing so only under a physician's care. Too much iron can actually become toxic and kill a person, therefore a doctor's advice is necessary.",
      "MessageIndex": 1,
      "PostDate": "23/06/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89821,0.htm",
      "Title": "Blood Transfusions"
    }
  ]
}