{
  "AuthorID": "Hhh123",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hhh123",
  "Posts": [
    {
      "AuthorID": "Hhh123",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hhh123",
      "Content": "Jillian, Thank you so much for your response! It helps to know there are other people with similiar experiences. This is a huge decision for me and your story has helped me to realize I am not overreacting! Again thank you for sharing your incredible story and I will keep you posted.",
      "MessageIndex": 3,
      "PostDate": "30/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3296,0.htm",
      "Title": "Prophylatic Bilateral Mastectomy"
    },
    {
      "AuthorID": "Hhh123",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hhh123",
      "Content": "I am seriously considering having a prophylatic bilateral mastectomy because of strong family history. I lost my mother and my maternal aunt to breast cancer. My maternal grandmother died of ovarian cancer and my maternal first cousin was diagnosed with breast cancer 4 years ago. (She is doing great after a bilateral mastecomy and ovary removal and chemo.) My dilema is both my cousin and I tested negative for BRCA 1 & 2. I have a variant for BRCA 1 which they are not sure what that means. It was explained that we probably carry a mutation that has not been discovered as of yet. I am 45 years old and have a very supportive husband. I am very concerned for my three children (1 boy and 2 girls). Any thoughts would be appreciated.",
      "MessageIndex": 0,
      "PostDate": "30/10/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3296,0.htm",
      "Title": "Prophylatic Bilateral Mastectomy"
    },
    {
      "AuthorID": "Hhh123",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hhh123",
      "Content": "Hi Christina, I am seriously considering having a prophylatic bilateral mastectomy because of strong family history. I lost my mother and my maternal aunt to breast cancer. My maternal grandmother died of ovarian cancer and my maternal first cousin was diagnosed with breast cancer 4 years ago. (She is doing great after a bilateral mastecomy and ovary removal and chemo.) My dilema is both my cousin and I tested negative for BRCA 1 & 2. I have a variant for BRCA 1 which they are not sure what that means. It was explained that we probably carry a mutation that has not been discovered as of yet. I am 45 years old and have a very supportive husband. I ,too, am very concerned for my three children (1 boy and 2 girls). It sounds as if you are doing great and have no regrets. Thanks for sharing your story.",
      "MessageIndex": 4,
      "PostDate": "30/10/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1725,0.htm",
      "Title": "First Breast Cancer and Now Ovarian Cancer - Survivors?"
    }
  ]
}