{
  "AuthorID": "hocema171",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
  "Posts": [
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I was diagnosed with a very rare form of breast cancer,, invasive adnoid cycstic carcenoma. Any information would be helpful since the doctors around here have no experience of this type. I am going for a masectomy soon and I am very scared",
      "MessageIndex": 0,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25547,0.htm",
      "Title": "very scared about rare breast cancer"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "  On 7/13/2008 friskycatmom wrote:   On 6/30/2008 hocema171 wrote: I was diagnosed with a very rare form of breast cancer,, invasive adnoid cycstic carcenoma. Any information would be helpful since the doctors around here have no experience of this type. I am going for a masectomy soon and I am very scared Hi, I was diagnosed with Adenoid Breast Cancer of the breast on July 05 and I had mastectomy and reconstructive surgery on sep. 05. I was diagnozed also on April 06 with MGUS blood disorder precurser to Multiple Myeloma I was the first for my Oncologist and surgen and nobody heard of ACC before so i started researching and I joined a group just for ACC and the more I knew the better I felt.  all I did is just mastectomy with reconstructive surgery no chemo and no radiation. this rare cancer comes with pain so I had pain for 3 years before they found out I have cancer... and it usually happens in the head and neck in the glands. and we have much better prognoses that it is in the breast because we can have clean margins and it does not come in the lymph nodes but you still you can have the surgon check it out.  it does have a recurrence but also you need to know that it is slow and what type of ACC it is. solid cribriform. make sure you have a copy of your pathology report and your tests.  I had every 3 months blood tests and chest scans or x-rays and lots of other tests which you can after your surgery tell me what your doctor recommended and I can tell  you more..my next app is on September 15th. my 6 months this time. in other words dont worry . relax which is hard and go for your surgery and take it from there ACC is slow growing ...try to read as much as you can about it and there is about 200-250 cases I believe for ACC in the breast..it is more rare in the breast...but you have to be wathed after on regular basis and have chest x-rays ..etc I live in California in the bay area.. write me back if you have any questions.   I am going through one more breast surgery on July 31 08I still have pain and my implant is deformed.. you will be very ok..dont worry and  all is ok. trust me I worried and nothing came out of it..:) if you type in the Yahoo search ACC or Adenoid Cystic Carcinoma you will have more info and better understanding than me trying to expalin to you...but I am talking from my experience..and what I hear and will tell you more when you tell me more about your story and surgery..and pathology report results. Pauline ACC/B 05 MGUS 06 IgA lambda 1300   Hello, I forgot alll about this site. Thanks so much for the help. It is so comforting to finally find someone who has this type of cancer. I did have a lumoectomy but my margins were not clear (the lymph nodes were clear though) I went for a bilaterial masectomy on the 22nd of july. I am still recovering at the moment. Can were talk via email?? my email address is hocema171@aol.com. I live in MIchigan but look forward to talking to you. They told me I need no chemo or readitation and that scared me. I havenot met with an oncologist and that was a questioion I have for my doc. Do I need to find one and see him? I do have my reports but I cannot make heads or tails out of it. I do see it says...right breast demonstrate an invasive carcinoma arranged in broad nests and sheets with a distincly cribform growth pattern. not sure what it means? you have been so helpful and I will be praying for you during your surgury. God is in control and I love the Lord. I hope you have a relationship with him, it sure does help. Godspeed to you my friend. could you tell me what group you found for this cancer? Now with having my breasts removed are you saying it still can come back? I thought with having my breast removed it  cannot come back? all this pain and I still may get it? I do not like that. thanks again for all your information. And good luck on July 31st. Godspeed.... stephanie  ",
      "MessageIndex": 3,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25547,0.htm",
      "Title": "very scared about rare breast cancer"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I had my surgery. I had a bilaterial masectomy. I decieded to remove both breast even though one had cancer the other was clean. I had the exercizers put in. The cancer side looks different. It seems that it is not pumping up like the other one, The doctor reassures me that all is well. I feel like it is getting lower and lower. The pump up is below where they cut. I am thinking because my cancer was at 11:00 they need to pump the saline in and it goes below instead of up top? any help or anyone experience the same?",
      "MessageIndex": 0,
      "PostDate": "11/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27022,0.htm",
      "Title": "invasive adeniod cycstic cancer"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "thanks so much for th help. Nine months does not sound to bad considering I have read some women have the pain fo years. I did research online and found that lyrica was found to help. I tryed it and YES it does take the pain away. I will try the hot compresses also. thanks and God Bless",
      "MessageIndex": 5,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29932,0.htm",
      "Title": "help for pain after a masectomy"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I had a bilaterial masectomy in July., I am still having this burning, stinging pain in my chest. It is very uncomfortable. My doctor said it is form the nerves being cut and that it will go away in a few months. It has been almost 4 months since my surgery and it feels no better. I have tryed darvact and vicidon, motrin but they only take the pain away for about an hour and then it is back. Has anyone had experience with this? What are you taking for pain? any tips would be greatly appreciated. I have young sons and I cannot seem to function without all the pain.",
      "MessageIndex": 0,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29932,0.htm",
      "Title": "help for pain after a masectomy"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Aug 14, 2009 12:00 AM NeedtoKnowFreak wrote: Just yesterday I too was diagnosed with this type of breast cancer.  This Monday I go in for an additional lumpectomy to see if there is any cancer within my lymph nodes. I will continue to watch this site for additional comments.  My doctor mentioned yesterday chemotherapy, but this time did not mention radiation.  We'll know more next week, and then likely decision making. From all I have researched on www.rare-cancer.org chemo HAS NOT been proved to work with this rare type of cancer. I did no chemo or radiation. Bilaterial with reconstruction.",
      "MessageIndex": 17,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Aug 14, 2009 12:00 AM NeedtoKnowFreak wrote: Just yesterday I too was diagnosed with this type of breast cancer.  This Monday I go in for an additional lumpectomy to see if there is any cancer within my lymph nodes. I will continue to watch this site for additional comments.  My doctor mentioned yesterday chemotherapy, but this time did not mention radiation.  We'll know more next week, and then likely decision making. From all I have researched on www.rare-cancer.org chemo HAS NOT been proved to work with this rare type of cancer. I did no chemo or radiation. Bilaterial with reconstruction.",
      "MessageIndex": 18,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Sep 08, 2001 12:00 AM Laura_S_2 wrote: A surgeon just removed a tumor in my breast that was diagnosed as Adenoid Cystic Carcinoma, which is apparently rare when located in the breast. I am just beginning to research this, and would appreciate any information (including from doctors who know about this). Thank you. Laura I was diagnosed with this rare cancer 6/5/08. I found www.rarecancer.org very helpful. There was very useful info on this very rare cancer. I met some nice women going through the same thing I have. hope that helps and God Bless. As far as a Doc...I have found none",
      "MessageIndex": 26,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "  On 7/29/2007 Gatlin wrote:  Hi! Last May28, 2006 , I was diagnosed with breast cancer. It was attached to my nipple so saving the breast was not an option.  I had both breat removed and reconstruction. I could not have the nipple reconstruction because of thin skin.  I do not regret either decision.  IF you have only one breast removed, you will have to deal with the worry of it coming back in the other side and your breast will not both look the same. The silcone gel implants are the way to go. DO not choose saline.  Yes, it is painful. Take a pain pill before you go for fill-ups. It will hurt for about 36 hours and then it will feel better. It is worth it. You can wear normal clothes and feel more like you. Read as much as you can! I am so sorry for your pain. It is something you will not forget, but you will move on and survive. It will make you a very strong woman. My grandmother and great-grandmother both died of breast cancer. It took me a long time to realize that having cancer is not always a death sentence. I am sorry for the loss of your father. My uncle is terminally ill now with throat cancer .  I cried a lot and I prayed a lot.             On 7/29/2007 Juanaboo wrote: I was just told I have BC and I am reeling because I just lost my dad if February to Esophageal Cancer which was his third type of cance. (colon and Hodgkins disease previousley all seperate times). My dad was 56. I am 36 and still morning him and just reallly can't believe that I, (1) have breast cancer. (2) they want to take my breast and (3) want me to consider having my ovaries removed. I have researched so much online that I am overflowing with info so now I need some survivors to tell me its not so bad losing your breast. That the reconstruction immediatly is going to help. So how bad is the pain of the R.S. and how bad is Chemo.    ",
      "MessageIndex": 8,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14823,0.htm",
      "Title": "36 with bc dx"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Sep 08, 2001 12:00 AM Laura_S_2 wrote: A surgeon just removed a tumor in my breast that was diagnosed as Adenoid Cystic Carcinoma, which is apparently rare when located in the breast. I am just beginning to research this, and would appreciate any information (including from doctors who know about this). Thank you. Laura I was diagnosed with this rare cancer 6/5/08. I found www.rarecancer.org very helpful. There was very useful info on this very rare cancer. I met some nice women going through the same thing I have. hope that helps and God Bless. As far as a Doc...I have found none",
      "MessageIndex": 16,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Aug 14, 2009 12:00 AM NeedtoKnowFreak wrote: Just yesterday I too was diagnosed with this type of breast cancer.  This Monday I go in for an additional lumpectomy to see if there is any cancer within my lymph nodes. I will continue to watch this site for additional comments.  My doctor mentioned yesterday chemotherapy, but this time did not mention radiation.  We'll know more next week, and then likely decision making. From all I have researched on www.rare-cancer.org chemo HAS NOT been proved to work with this rare type of cancer. I did no chemo or radiation. Bilaterial with reconstruction.",
      "MessageIndex": 27,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "you had mentioned not getting saline implants. Can you give me more information? I am leaning towards silicone but always thought saline was safer. I had a double masectomy a month ago with tissue expander in place at that time. I am still very very sore. When will the pain go away? I still have the scabs. how long before they fall off. My incisions look kinda white and I am concerned about that. The doctor says all is fine. I also have like bulging on my sides like where my bra would go around. Again doc says all is well . Any help?",
      "MessageIndex": 9,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14823,0.htm",
      "Title": "36 with bc dx"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I chose a bilaterial masectomy, my surgery was july 22 2008. Just keep praying. It does help. I went through some sad times. but all in all i am handling it as well as expected. The pain comes and goes. I take lortab for the pain,. I cut them in half, they work right away.",
      "MessageIndex": 10,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14823,0.htm",
      "Title": "36 with bc dx"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "On Aug 14, 2009 12:00 AM NeedtoKnowFreak wrote: Just yesterday I too was diagnosed with this type of breast cancer.  This Monday I go in for an additional lumpectomy to see if there is any cancer within my lymph nodes. I will continue to watch this site for additional comments.  My doctor mentioned yesterday chemotherapy, but this time did not mention radiation.  We'll know more next week, and then likely decision making. From all I have researched on www.rare-cancer.org chemo HAS NOT been proved to work with this rare type of cancer. I did no chemo or radiation. Bilaterial with reconstruction.",
      "MessageIndex": 28,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,422,0.htm",
      "Title": "Adenoid Cystic Carcinoma in the Breast"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I chose a bilaterial masectomy, my surgery was july 22 2008. Just keep praying. It does help. I went through some sad times. but all in all i am handling it as well as expected. The pain comes and goes. I take lortab for the pain,. I cut them in half, they work right away.",
      "MessageIndex": 11,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14823,0.htm",
      "Title": "36 with bc dx"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "May I ask. How much cc are you getting put on before you get the implants?",
      "MessageIndex": 7,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25965,0.htm",
      "Title": "Newbie here....."
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I am going to be getting implants in soon. I am very confused on which to use saline or silicone. My doctor uses silicone but i am not sure if that is the safer one of the two. Please give me some help",
      "MessageIndex": 0,
      "PostDate": "20/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27346,0.htm",
      "Title": "Very Scared And Confused"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "Hello, I had read on the card that my doctor gave me when my tissue expanders were put it. It says the expanders contain a metallic component. I asked my plastic surgeron about it, he said that would not be causing my problems. I had to go to outpatient surgery tuesday and he cut out all the dead tissue on both sides (pretty much my whole incision scars) and redid them both. He also removed the expanders. We are going to wait six weeks and start again. Put the expanders in, and start my pump ups over. And I was just getting breasts again and now I am flat as a board again! But It will be well worth it. I do have drain tubes in again and that is a pain. They seem to hurt more this time than last. I also AM A NON SMOKER, as of Aug 29th. I know that had alot to do with my healing. I said lots of prayers and did get the chantix. It really helps.I hardly ever think about smoking. When I do I just imagine my boob and the hole I saw in it. My mom died from breast cancer and she smoked. The same thing happened to her. She had a hole in her neck where the incision split. I will never smoke again!!!!!!  good luck to you!.",
      "MessageIndex": 3,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27701,0.htm",
      "Title": "Tissue expander causing problems"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "Right after my bilaterial masectomy I had tissue expanders placed in. I have  gotten them pumped up a few times. Now I am having problems with my incisions not healing up. I have always been unable to wear earrings, I would break out because of the medal, and last year, way before my diagnosis, I was breaking out by my belly button when I wore this certain pain of jeans. and even in my back by my bra area at times would just break out and be itchy., I think I am allergic to certian kinds of metals. I just realized that these tissue expanders have a medal in them. Could this be the problem as to why i am not healing properly? Has anyone else experienced this problem? I am tryin hard to quit smoking. that may be the cause of the healing issues but, I just had that thought about the medal in the expander",
      "MessageIndex": 0,
      "PostDate": "29/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27701,0.htm",
      "Title": "Tissue expander causing problems"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I recently had a bilaterial masactomy. I have tissue expanders in both sides. My reconstruction doctor had told me that one side has \"shifted.\" He assures that all will be fine once they put my implants in, as one side is lower than the other. I was wondering if anyone has experienced the same problem. It is a scary feeling.I I also had my drain tubes removed. I have a small area that is not healing properly. I have dead skin. My doctor is going to cut the dead skin out and restitch me. I have had people mention \"staff infection.\" That has scared me also, anyone expreienced that happening after surgury? I just need some reassurance all is fine.",
      "MessageIndex": 0,
      "PostDate": "15/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27193,0.htm",
      "Title": "question about tissue expanders, and healing problems"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "Thanks for the help. and good luck to you",
      "MessageIndex": 2,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27346,0.htm",
      "Title": "Very Scared And Confused"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I am taking a poll. Ladys, which do you have and why??  thanks. I read so much not sure which is best",
      "MessageIndex": 0,
      "PostDate": "22/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27429,0.htm",
      "Title": "saline or silicone implants after a masectomy"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "Thanks for the information. I will check into that. Good luck to you in taking care of your wife. I wish her well.",
      "MessageIndex": 2,
      "PostDate": "27/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27429,0.htm",
      "Title": "saline or silicone implants after a masectomy"
    },
    {
      "AuthorID": "hocema171",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/hocema171",
      "Content": "I am starting my pump-ups now after having my tissue expanders put in. I am just curious as to how much women normallly get put in before getting the implants. I am a small framed women. I have no but or hips. I weight about 135. My friend has implants and has a total of 300cc. When I got the expanders in my doc put 250cc in one breast and 200cc in the other. I am thinking maybe another few pumpups and I will be ready for my implants. I do not want to go to big. but my friends 300cc look very big to me. She is bigger framed than me. Any advice would be appreciated. I want to look normal and not too big. I have been dealing with breast cancer since June and I am ready to just move on with my life. ",
      "MessageIndex": 0,
      "PostDate": "03/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29934,0.htm",
      "Title": "tissue expanders"
    }
  ]
}