{
  "AuthorID": "Hope4allnow",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hope4allnow",
  "Posts": [{
    "AuthorID": "Hope4allnow",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hope4allnow",
    "Content": "I have a relative who used Avemar prior to breast cancer surgery and she did not have any metastasis. The tumor was big phase II and turning to III, after seeking many opinions for over 3 months, and after learning that the cancer developed for a year due to doctor negligence to follow up a diagnosis of a benign small cyst in her breast. No biopsy was done to determine that the cyst was benign.  Most doctors suggested invasive treatments prior to surgery but patient was in her 80s and very sensitive to meds, latex which was very odd that they suggested such treatments prior to surgery. After collecting information and seeking many medical opinions, patient decided to use Avemar and good nutrition and she got rid of her big tumor without metastasis.  She chose a surgeon who specialized only in breast cancer and he performed an excellent surgery .although she was trick into accept internal radiation treatment , not needed and for which she ended in the hospital as a result of an ifection caused after 10 radiation treatments. Doctors pesuaded patient into these unecessary and risky treatments and did not explained patient or relatives prior to treatment. It is importatn for people to know that patients need support with information to prevent unecessary procedures as patients when they feel so fatigue and overwhelmed could surrender to doctors suggestions without knowing the consequences . The reality is that cancer treatment can be viewed as a business by some people without a moral consciense.  For those who chose Avemar , they should know that avemar cant be use during radiation of Quimiotherapy treatment as it could  intensify effects . My relative could not use Avemar even after radiation , she needed to wait at least 10 months after to use Avemar without getting her skin red and a burning sensation. Avemar in my opinion should be use prior to any invasive treatment as a nutrient and to strenghten the immune system along with good nutrition and vitamin supplements to make the patient stronger to tolerate surgery. My relative even in her 80s was able to recuperate well , there was no need for any further treatments due to the way she prepared prior to surgery and radiation treatment. In my search for information for her , I discovered tha Mayo clinics used that approach with patients who need surgery or are very ill. I also discover that the internal radiation she was submitted to was experimental and not a good thing to have, but it was too late sicne no one know what they were doing to her and since she was not given any writen info priot to this therapy. Doctor's persuaded a fatigue and overwhelmed elderly woman in need for hope to submit to an unknown treatment. It is not uncommon to see elederly people used as experimental subjects in different parts of the country . I have seen it happened many times to friends of my elderly parents and  relatives... ",
    "MessageIndex": 0,
    "PostDate": "26/09/2010",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51433,0.htm",
    "Title": "Tips on Avemar and breast cancer surgery..."
  }]
}