{
  "AuthorID": "Hopeful30",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
  "Posts": [
    {
      "AuthorID": "Hopeful30",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
      "Content": "I have not had this surgery -- I had a unilateral mastectomy with immediate DIEP reconstruction, but if you want info about reconstruction I would recommend www.breastcancer.org -- they have a really active discussion board with lots of women with all types of recon experience -- you will get a better response there. Good luck.",
      "MessageIndex": 1,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38653,0.htm",
      "Title": "Reconsatrction surgery"
    },
    {
      "AuthorID": "Hopeful30",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
      "Content": "Get a biopsy -- it's the only way to know for sure.....yeah, I was told the 80% benign story and mine wasn't -- someone has to fall in the other 20% -- hopefully it won't be you, but get it tested.   There is really no down side to a biopsy -- Good luck.",
      "MessageIndex": 4,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39160,0.htm",
      "Title": "Micro-calcifications"
    },
    {
      "AuthorID": "Hopeful30",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
      "Content": "I am another satisfied DIEP customer -- had unilateral immediate DIEP.   It is a long, tough surgery and the recovery takes a good 6-8 weeks, but it is worth it.   Once it is done, it's done -- and the results are good. Do your research though and make sure you get a really experienced plastic surgeon -- one who has done hundreds of these operations -- if a doctor tells you it's not a good option, they probably are not experienced enough to do it -- so keep looking.",
      "MessageIndex": 5,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37814,0.htm",
      "Title": "Breast Reconstruction Options"
    },
    {
      "AuthorID": "Hopeful30",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
      "Content": "What did you decide?   I am in a somewhat similar position.   Diagnosed initially with DCIS and had lumpectomy -- final pathology found a small 3mm tubular cancer -- I have been advised to have mastectomy of right breast.    But, here's the catch -- had an MRI done - actually two since I went for a second opinion at another hospital -- first MRI said all was OK on other breast -- second MRI saw something that needed to be followed up in 6 months -- now I cannot decide if I should have a unilateral or bilateral mastectomy -- don't know if I can go through all the surgery etc. and then have to worry about the other side -- I am considering asking them to biopsy it now rather than wait another 6 months, but don't know what they will say ---it's bad enough being diagnosed with breast cancer at 47, but it is even worse when you have these tough decisions to make  --  I am still undecided, but will have to make a decision soon......",
      "MessageIndex": 3,
      "PostDate": "07/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11356,0.htm",
      "Title": "Breast MRI results"
    },
    {
      "AuthorID": "Hopeful30",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Hopeful30",
      "Content": "Hi there, I had a unilateral mastecomy with immediate DIEP flap reconstruction.    It is a difficult surgery with a long recovery (4-6) weeks, but I am very happy with my results -- although it took some time --   I would do it again.  Personally, I did not wannt a foreign object (implant) in me -- would make me worry. I suggest you go to www.breastcancer.org -- the discussion board there is very active and there are lots of women with experience of both implants and flaps.   Post under the Reconstruction Thread and you will get lots of feedback.",
      "MessageIndex": 1,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41566,0.htm",
      "Title": "implants or flap reconstruction"
    }
  ]
}