{
  "AuthorID": "husbandofbc",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
  "Posts": [
    {
      "AuthorID": "husbandofbc",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
      "Content": "Caregiver:  I feel strongly for your experience. Assuming you have not had any affairs, this is unfair to you.  People usually fall into categories,  usually the ones with affairs would not be the kind to take others' children as their own.  I can feel your pain of going thu these sacrifices without getting a minum appreciation or recognition like a short and soft thank-you, a appreciative smile.  You feel even lonely when community is not siding with you. Because of her unfortune conditions, they would assume that is what you are supposed to do.  The most unbearable part is the disrespect and blame of \"how come you did not do for me while I am cancer striken?\" or \"now you really wish I could die sooner!\" Those words can be heart breaking and humilating!! And few people in the supporting commnunity would imagine that. They assume that is the normal emotional reactions from a breast cancer patient.  I observed from my own experience, from when I grew up to now, that many women who ended up with what they and their family labelled as \"the Hunch of Notre Dame\" often disrespect their husbands.  These women feel that life is unfair to them and their husbands naturally becomes a daily reminder of their not being able to marrying a more successful man in life. These husbands, then, become wifes' psychological disharge toilets.  And loving and sacrifing would not reverse that.  To make things worse, a woman's family could either instill or support this psychology.  Most parents love their children.  After their children's marriage,  these love could easily turn into bias.  It is just human nature.  Some parents, family always feel what their children have done and sacrificed but only knows or sees( instead of feel) what their spouses have gone thru.  It is just too easy to make conventional conclusion on thier spouses like \"uncaring jerk!\".  Nobody would put that on their own children.  Have you seen any? I just found myselfing overwriting before even touching the my relevance to this site.  My wife, too, was diagnosed with breast cancer.  It was in Jan 2009.  I had the unappreciation, blame and dispectst, too, like you underwent.  I am too the only bread maker in the family but my wife supported my tuition during my master's degreee.  Our relationship is not a sunshing one for the 15 years of our marriage. I was thinking about divorce before the diagnosis. But now sudden came the diagnosis.  I decide to stay married rather than being an \"uncaring jerk\" since she is dependent on me for medical insuarnce.   I, too, got the blame that I picked the wrong insurance and I was criticized as not caring that much.  At work I am going thru the pressure to finish a project and I have to use work time to make appoints, change physicians, call for test results and accompany her to tests.  And when I talked back when she labelled me too stupid to find a good parking spot in front of Target, she threatened not to let me go with her for the next appointment.  She sighed constantly in front of me that she had been so unlucky all thru her life and never had been happy putting blame of unsuccessful marriage, of course, all on me.  When we in quarells, her mother questioned me why I shed tears on the night of diagnosis. She must have though I was being pretending.  Pretending for what? Blame from community/society, I admit, can be the last straw on the back. I feel that you and me are esssentially  different from those who walked from their wives shortly upon diagnois.  But hey, in the society, who cares about the difference between \"uncaring jerks\"?",
      "MessageIndex": 9,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    },
    {
      "AuthorID": "husbandofbc",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
      "Content": "I am still living(cohabiting would be more precise) with my wife. Three reasons: 1. She is still an excellent caretaker for my 2 children although at the same time abusive to them verbally frequently 2. She depends on me for employer insurance.  She couldn't even drive for more than an hour, she told me.  I have to mention that she supported me during my education.  That leads to almost daily mentioning that \"Without me, you would be nothing\".  I provided for her during all 15 years took her mother with the family touring many countries but is not considered by either of them as anything close to \"payback\" at all; 3.The house we bought right before housing crisis stuck almost all our equity   My thoughts at the moment: An evil from your heart will ultimately trap yourself; concience from your heart, too, will stumble you from stepping forward. Let me ask you, everyone, what kind of heart would you like to have if you get to pick and choose?",
      "MessageIndex": 16,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    },
    {
      "AuthorID": "husbandofbc",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
      "Content": "Becky,  thank you for sharing your thoughts.  Thanks for the free therapy.  Every word of it.  Not a therapy for marriage counselling but a bystander's view on my soul.",
      "MessageIndex": 25,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    },
    {
      "AuthorID": "husbandofbc",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
      "Content": "I am from another culture.  I posted it to see how other people look at it.  Thank you for providing feedbacks!  Now I see that how I look crazy from your eyes.  Walking out of this marriage, I would be an \"a**hole\" abandoning a cancer riden wife, who historically has contributed siginificantly to the family, but at the same time has a very abusive personality.  Staying in the marriage equals to daily pains.  Anybody else having different views from last 2 posts commenting on mine 12/14 post?",
      "MessageIndex": 19,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    },
    {
      "AuthorID": "husbandofbc",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/husbandofbc",
      "Content": "Becky,  thank you for sharing your thoughts.  Thanks for the free therapy.  Every word of it.  Not a therapy for marriage counselling but a bystander's view on my soul.",
      "MessageIndex": 21,
      "PostDate": "18/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    }
  ]
}