{
  "AuthorID": "I_am_OK",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/I_am_OK",
  "Posts": [
    {
      "AuthorID": "I_am_OK",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/I_am_OK",
      "Content": "Be skeptical!  It might save your life!!  I am 47 and found a lump during self exam and called my ob/gyn.  She immediately sent me to The Breast Center for a digital mammogram (always faithful to get annual exams) and nothing showed up.  I was insistent there was a lump so the tech did a sonogram to see.  Nothing.  I took her hand and made her feel the lump.  She did and called the Radiologist in.  The Radiologist did another sonogram in high resolution.  Nothing.  She told me \"if it was me, I would keep an eye on it and come back in 6 months\".  I took her hand and made her feel the lump.  She said \"I can do a needle biopsy if you want but I am sure it is nothing\".  I felt like an idiot and went away with a nagging feeling.  After two weeks, I went to see my Ob/gyn again and made her feel the lump.  She called a surgeon who specializes in breast cancers.  I saw him and he assured me, after looking at the films and reports, it was nothing.  He said, \"if you cannot believe 3 MD's, 2 mammograms, and 2 sonograms, I will do a biopsy if you want\".  One week after the biopsy, I got a call from him.  I had ductal cancer and would need to come in that afternoon.  It's now 7 months later.  I opted for a bilateral radial mastectomy and have never regretted my decision.  I felt if they could not detect the first tumor, how would they ever detect any future tumors?  Because I opted for the bilateral radical mastectomy, I did not have radiation or chemotherapy.  I also chose not to have reconstruction.  I talked to too many women who had reconstruction and then were forced to have as many as five additional surgeries (in the same year) to \"tweek or fix\" them.  I am happy, cancer free, wear two breast prosthesis', and encourage you to follow your instincts.  On my first meeting with my Oncologist after surgery, she walked into the exam room and said \"Mrs. ____, you saved your life\".  I also ran into the Radiologist at a Cancer Awareness Dinner who came up to me and apologized.  I don't blame her - the tumor did not show up on any film but I know she will be careful when telling future patients \"come back in 6 months\". ",
      "MessageIndex": 23,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    },
    {
      "AuthorID": "I_am_OK",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/I_am_OK",
      "Content": "  On 5/15/2009 Bonniee wrote: Stacey, Thank you for for your kind reply. I already have lymphedema, which is another complication of radiation. I will probabyt chose mastectomies and radiation to the axillia and above the clavicle, as was recommended. One radiologist reccommended chest wall also, but I will pass on that because it could damage the lungs and possibly heart. A lot of their recommendations depend on type of cancer, markers, etc. How are you doing with the Zometa? Bonnie Hi Bonnie - I was diagnosed with Stage II breast cancer, node negative, estro positive, ductal 60% in situ, 40% ragged edges.  I found the lump myself after self exams and insisted on an immediate mammo.  I have always been faithful about self exams and annual mammos.  The mammography showed nothing but I was persistent.  The radiologist herself came in and did a follow-up sonogram and again, found nothing.  I took her hand and made her feel what I was feeling.  She did and said it was nothing - come back in 6 months.   I waited 2 weeks and made an appt. with a surgeon who specializes in breast cancers.  He examined me, looked at the previous films, and said \"if you can trust 3 MD's (ob/gyn/radiologist/surgeon), 2 mammograms, and a sonogram  then I will do a biopsy.  One week later he called me at home to tell me I had breast cancer in my right breast.  My breast are very dense.   After talking to others in the medical field and doing lots of research on line, I opted for a bilateral radical mastectomy.  My thoughts were if they could not find the first cancer, they would not find the second if it occurred.  Most MD's assumed I would get immediate reconstruction but I opted for none.  Because I opted for the bilateral radical mastectomy, I avoided radiation.  There was no need for chemo.   It's been 7 months and I am doing FANTASTIC!  I wear prosthesis breasts (my originial size was a 38D and I chose to be a new 38B), my husband still loves me, and I feel better than ever.  Really.  I am taking Tamoxifen and guess I will for 4.5 more years.  You will be fine, life goes on, and you will be happy again.  Best wishes to you!",
      "MessageIndex": 3,
      "PostDate": "24/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35995,0.htm",
      "Title": "Help Sisterhood! Radiation or Mastectomy?"
    }
  ]
}