{
  "AuthorID": "Ilaff",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
  "Posts": [
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 4/20/2009 l1624 wrote: Hi, I was just diagnosed with DCIS in both left and right breasts.  However, DCIS is in 2 different quartdrants of one breast.  I'm trying to decide which approach is best for the long term.  Lumpectomry/radiation + tamoxifen or simple mastectomy.  I'm afraid of the side effects of radition such as damages to lungs, hearts and ribs.  For those of you who have a similar case like me, would you please share your experience with me?  BTW, my HER-2 is negative. Thanks in advance NL     I had a bilateral mastechtomy in 2006.  I was glad to be rid of the too large breasts that had been my enemies practically all my life.  I don't advocate for lumpectomy or mastectomy, it is strictly a personal choice.  It also depends on the type of cancer.  I made my decision based on lowering my percentage by as much as possible.  Each treatment lowered the percentage until it was down to around %7.  Good enough for me...I am 57 years old (not too old...not too young)  I think age has something to do with a decision like this .  I have never seen this up for discussion before: when you lose your breasts, you lose your nipples and it can be bothersome in the sex department-depending ...I found it to be something I had not thought of and no one told me...just a thought.  Your health is the main thing so My ultimate decision was with recurrance in mind.  I did have some cancer in the nodes (I waited too long) and so they told me the cancer \"got loose\" in my body.  I refuse to believe that cancer could live through chemo x8  and radiation x33.  Ask your docs to map out all your options and have someone with you who can write this all down for discussion later.  I wish  you the best and hope to hear you are doing great!",
      "MessageIndex": 3,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35450,0.htm",
      "Title": "lumpectomy vs mastectomy"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 3/29/2009 cdp212 wrote: My mom was diagnoised with breast cancer easter of 2008, She has gone through alot of treatments and none of them have been completely sucessful. She has breast cancer, liver cancer, lesions in her lungs and two spots on her rib bone. This whole thing has been a huge train running through my families lives and especially my moms. My mom is (57)years old and is one of the strongest people i know and it was deffiently a hard thing to watch her grow more and more dependant on my father sister and I. I really have lost alot of faith in pretty much anything and everything and i feel myself everyday getting more and more mad about this situation. My sister (33) on the other hand has become more faithful to certain things and knows there is something beyond this. Not to long ago my mom asked to stop the chemo and wanted hospice to come in and take over. That is not easy to hear. But as a family we had to respect moms wishes and at least meet with some people and get a plan together. Now we have been with hospice for almost three weeks and i will say that we have had our ups and downs. She once got over medicated and was completely zoned out so we had to stop that certain medicine, but on the other hand my mom can get the built up stomach fluid (due to her liver not functioning correctly) drained in the comforts of home. I know a lot of people my age,19, that have lost a parent to cancer, and honestly ontil now i cant imagine how they did it. I dont really have advice nor do i have something witty or eye opening to say, but just that everynight you dont sleep and every sick pain in your stomach dont hide it and dont hide what you feel make sure you live each day doesnt have to be to the fullest but make sure you live. I'm so sorry for you.  I lost a parent when I was 21 and it sucks.  You are too young for this.  If I had it to do over I would've asked a lot of questions stuff  you need to know.  Maybe you can write some stuff down..with her for her and about her.  Make recordings that are silly and encouraging because with all the high tech ways we have to memorialize someone ,,,it can be there for you as needed.  Perhaps you could initiate a letter (if she is able to write back) and see how you are alike and find that she is so deeply ingrained in you..you will never really be without her.  I want to hug you from here.  I am also 57 and a mom.  I'm sending these ideas as encouragement to you.  I hope it helps.",
      "MessageIndex": 3,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34732,0.htm",
      "Title": "my mother has stage 4 breast cancer"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 4/23/2009 Lindalou wrote: Hello, I'm visiting from the Thyroid Cancer message board and have a question. Did any of you find a lump that did not show up on mammogram or ultrasound but turned out to be malignant? I found a pea size lump 2 weeks ago and went to my gyno. He also felt it and sent me for a diagnostic mammogram with ultrasound. The tech, AND the radiologist could feel it but could see nothing on the ultrasound. I was relieved at first but now I'm wondering if I should still worry. My thyroid cancer was found as a fluke so I'm a little skeptical. Any advise is appreciated!   I was dignosed with stage 4 cancer one month after a clean mammogram.  The physical check  was cause enough for a breast MRI, an ultrasound and a needle biopsy.  If you have any doubts about anything go see your primary... Your doc knows how hard it is for us to believe we are well.  Your intuition will guide you.  Pay attention to any changes and report them to the docs.  I have survieved for 2 years and it has only been recently that I have let down a  enough to enjoy my life, rather than wonder about things that could be easily answered.  Sometimes, the answer arrives via intuition.  It truely is on a need to know basis.  YOU NEED TO KNOW!  As I look back to pre-cancer, my dog was very interested in that area where the tumor was located.   I found that to be an interesting.  YES, find the answer that satisfies you.  Good luck and Godspeed on those answers. Take care of yourself and be pro-active in your search for health.",
      "MessageIndex": 10,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 4/6/2009 debbydo wrote: I had tumor removed, then chemo then masectomy then radiation then 2nd masectomy.  I had herceptin for year.  My breathing is bad and has been since the last surgery in Nov 08.  I have had a severe cough every since then.  Drs. now think it is psychiatrist is needed that my cough is psychosomatic.   Has anyone else had coughing and breathing problems since cancer treatement? My circumstance was very similiar and I had a horrifically sensitive gag reflex, after treatment.  It lasted for about a year.  I had heartburn and reflux esophagitis (sp) lots of things gagged me and swallowing was an issue.  Have everything checked out to be sure. Like the swallowing...mine was just lazy muscles from the effect of radiation in that area.  Now it has been two years and things are better.  Warm regards",
      "MessageIndex": 4,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35003,0.htm",
      "Title": "recovery problems"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 5/3/2009 Ilaff wrote:   On 4/24/2009 Lt2797 wrote: I was diagnosed with breast cancer in 2002, underwent a mastectomy and chemo (A/C) followed by 2 years of Lupron injections.  I’ve been cancer free since.   A few months ago I started having night sweats, which I haven’t had since before the original cancer diagnosis.  To be clear these are not your typical warm room, too many blankets kind of night sweats.  I sweat enough to soak through my pajamas but my skin is cool to the touch.  In the past month I’ve started experiencing a mild to sharp pain on my right side, on the back under my rib cage.  In the last few days the pain has migrated to my side, again under the bottom of the rib cage.  I don’t believe I’ve injured myself in any way, haven’t fallen or bumped into anything and I’m not sure if the night sweats and pain is related.   Has anyone else experienced this sort of thing and if so what was the outcome?  My next oncology appointment isn’t until August and I’m wondering if I should go in sooner.   Thanks, Lisa Please go in sooner than later.  I had a mooshy lump on top of my rib cage and just under the scar of the mastectomy.  I had a bi-leteral in '06.  I struggled for about a year before one of the docs (oncologist) decided it was NOT just the way I am built and  sent me to physical therapy.  It turned out to be LYMPHEDEMA in that area.  I also had tender ribs (due to the radiation) and I am on FEMERA (which weakens bone structure).  Learning the technique to remove the fluid was key in my recovery.  I, now, know how to get rid of the fluid.  I was not told to expect Lymphedema in that area and it surprised me that it took a year of complaining to get results.  You know your body better than anyone so perhaps this info is helpful.  Insisting docs help in after care is in your ball park..be persistant and let them know that this is stressful and needs attention...and that you are willing to work at it too. warm regards, ILAFF I forgot to address your night sweats.  I don't think I know your age, but CHEMO throws you into full-on MENOPAUSE!  even if you were done with that.  i am 57 years old, the (gabapentin) pill really works with none side effects.  this condition is quite miserable so ask for something to relieve your symptoms. again best wishes,ILAFF    ",
      "MessageIndex": 4,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35560,0.htm",
      "Title": "need some advise"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 4/24/2009 Lt2797 wrote: I was diagnosed with breast cancer in 2002, underwent a mastectomy and chemo (A/C) followed by 2 years of Lupron injections.  I’ve been cancer free since.   A few months ago I started having night sweats, which I haven’t had since before the original cancer diagnosis.  To be clear these are not your typical warm room, too many blankets kind of night sweats.  I sweat enough to soak through my pajamas but my skin is cool to the touch.  In the past month I’ve started experiencing a mild to sharp pain on my right side, on the back under my rib cage.  In the last few days the pain has migrated to my side, again under the bottom of the rib cage.  I don’t believe I’ve injured myself in any way, haven’t fallen or bumped into anything and I’m not sure if the night sweats and pain is related.   Has anyone else experienced this sort of thing and if so what was the outcome?  My next oncology appointment isn’t until August and I’m wondering if I should go in sooner.   Thanks, Lisa Please go in sooner than later.  I had a mooshy lump on top of my rib cage and just under the scar of the mastectomy.  I had a bi-leteral in '06.  I struggled for about a year before one of the docs (oncologist) decided it was NOT just the way I am built and  sent me to physical therapy.  It turned out to be LYMPHEDEMA in that area.  I also had tender ribs (due to the radiation) and I am on FEMERA (which weakens bone structure).  Learning the technique to remove the fluid was key in my recovery.  I, now, know how to get rid of the fluid.  I was not told to expect Lymphedema in that area and it surprised me that it took a year of complaining to get results.  You know your body better than anyone so perhaps this info is helpful.  Insisting docs help in after care is in your ball park..be persistant and let them know that this is stressful and needs attention...and that you are willing to work at it too. warm regards, ILAFF",
      "MessageIndex": 3,
      "PostDate": "03/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35560,0.htm",
      "Title": "need some advise"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 4/4/2009 cdp212 wrote: my mom has almost had cancer for almost a year now and i have  been noticing that she isnt really saying much and seems very sad, which i understand. I ask her if she would like to go for a ride or anything and just says no. I really would love to take her out to get a chocolate ice cream soda (her favorite) but she just isnt into it... does anyone have any advice...i want to keep her happy, i  miss her smile. How sweet.  Ask her what she needs right now.  Observe her interests and bring little things of cheer: flowers, word search. even a handheld game (deal or no deal ) keep trying..but it sounds like depression, which is perfectly normal.  It is just as hard to come back form this as be sick from it.  It takes a while for the brain to realize the body is no longer ill.  show her you love her with no expectation.  Have some food delivered to eat together.   Just some thoughts.  I don't know how old you are, dear..so do what you can and keep smiling and loving her ...unconditionally.  best wishes",
      "MessageIndex": 2,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34955,0.htm",
      "Title": "lifting spirits?"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "You sound like you know this is troublesome and will act on it.  Have you anyone who could go with you to a Dr. appmt?   Please Please Please don't wait years to find yourself with full blown aggressive cancer.  With all the history in your family, combined with the early detection, it probably will be treatable.  I went through cancer last summer, had a double mastectomy.  When the doc found it (tumor) during an exam...I wondered how I missed it..you are fortunate enough to have a body that is trying to tell you something...so listen.  I hope I not stepping on your toes or trying to \"preach\" the wisdom you already posess.  I hope good things for you and I'm pretty sure your mom would want better for you than for herself.  Keep strong, think good thoughts and tell someone you know and trust.  sending peace and courage to you!",
      "MessageIndex": 5,
      "PostDate": "27/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14756,0.htm",
      "Title": "Is a small nodule really that worrisome?"
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "  On 5/8/2009 Leeanne wrote: I am a 46 year old who was misdiagnosed in 2006 with invasive BC Stage 2 node negative, I had pain and a lump of 3cm which was not seen on mammo was picked up on ultrasound but only as dense tissue, not cancer..Lump was removed due to the size but doctors showed no concern until after biopsy....Didnt clear margins so needed follow up surgery and node removal...Chemo and Radiation followed...My last few mammo's have shown distortion on Mammo and it always says MORE THAN LIKELY due to surgery changes, my recent mammo has shown calcification in an area that causes me pain and where lump was removed, the results were again POSSIBLY due to surgery....it's always more than likely or possibly never a definate answer.....Would appreciate a few more opinions on what you would do in my situation..... Thanks Leeanne   hI, I had a clean mammogram in April, 2006.  In May of 2006, I was diagnosed with stage IV breast cancer.  My thought was that all the previous mammograms had missed this for years.  Since you have already had issues (surgery) you must be considered high risk.  I would ask for a breast MRI.  Insist that you are still having pain and need to know.  Insurance has to pay if ordered by your doc.  Get your doc to see it this way so you can have peace of mind.  When I survived, I knew this was to be my message: DO NOT TRUST YOUR MAMMOGRAM warmest wishes.",
      "MessageIndex": 2,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35954,0.htm",
      "Title": "Mammo and ultrasound showed up normal....."
    },
    {
      "AuthorID": "Ilaff",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ilaff",
      "Content": "http://www.paulayoung.com Online.  You can get a nice wig for less than 100.  The natural hair wigs are very nice and you can return them. You should be able to get your money back with having provided you with the wrong color.  Was there a color#  to compare what you ordered with what you got?  I might suggest they \"demonstrate\" the process they communicated.  I hope it's local and in-person...otherwise there is always the Better Business Bureau (sp) This kind of thing makes me crankey..have they no heart for the flight of the bald bumblebee?   I know... I was hairless too.  I found hats and scarves to be easier and cooler.  If you do radiation..you will already be quite warm...from within. I finally said \"too bad\"!   Who said it wasn't alright for women to be bald?  Best wishes",
      "MessageIndex": 3,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35442,0.htm",
      "Title": "wig-ged out!"
    }
  ]
}