{
  "AuthorID": "imissmyhair",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/imissmyhair",
  "Posts": [{
    "AuthorID": "imissmyhair",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/imissmyhair",
    "Content": "On Apr 26, 2008 12:00 AM reyze wrote: I was diagnosed with breast cancer in February 2006, I began chemo (doxorubican, 5FU and taxotere) in March 2006 and had my last treatment in July 2006.  I only have a few sparse hairs on my head and my hair has not regrown.  I don't understand this since I had very very thick curly hair.  I have used Nioxin and am now using Rogaine in an attempt to get hair.  My body hair, eyebrows and eyelashes only have sparse hair also.  Do you have any suggestions or help? I miss my hair. Please help. Hi Reyze,  Well I am one of the few where my hair did not grow back from chemo.  I was diagnosed in 10/2006, had 6 rounds of chemo, last chemo was 4/2006 then had 6 weeks of radiation. I do not and never did take post chemo meds.  I only have a little fuzz on my head.  You can see staight thru it and you can see my scalp.  I have been to several Docs and none can explain why my hair did not grow back.  They say it is male pattern baldness and the baldness probably would have happened in time.  I am not a doctor but i totally disagree.  I believe that is just a generic answer that they always tell people when they do not have an answer.  My brothers are balding but my sisters are not bald.  If that is the case, why hasn't the hair on the rest of my body not grown..arms, eye brow and legs...I have hair there but it is barely there. (I got my eye brows tattooed)  I used to be rather hairy.  In search of my own remedy I have tried several different things that did not work.  I tried the Nioxin, that didn't work, I went extreme and tried a tattoo on my head so that it would not look shiny...well the tattoo did not take so i decided not to go that route.  I am not sure if you have heard about the laser treatments but I have tried that and the jury is still out on that.  I did see some improvement but not much.  I am thinking of doing the laser treatment again...originally i did it for about 6 months.  it is kinda pricey.  It cost $200 a month for 2 to 3 times a week 30 min sessions.  Its like 25 dollars a session.  There is absolutely no pain associated with it - you just sit there like sitting under a hair dryer but instead of air there are these red rays shooting out of the hood.  I never tried Rogaine because if you stop using it your hair will fall out. For those people whose hair grew back in any fashion...I mean any fashion, grey, curly, straight, not as long as it once was, be thankful...you could be like me without any. I am hoping Reyze and I can get some dialogue from people similar to our situation...suggestions, comments, solutions... Reyze, it's been a while since you have posted anything.  Have you found anything that works yet?    ",
    "MessageIndex": 8,
    "PostDate": "29/12/2011",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
    "Title": "2 years after chemo, my hair has not grown back"
  }]
}