{
  "AuthorID": "imwinning",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/imwinning",
  "Posts": [{
    "AuthorID": "imwinning",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/imwinning",
    "Content": "On Sep 01, 2005 12:00 AM Daughterandmom wrote: Hi Roses8753 and others, If you are having intolerable side effects from Arimidex, remember that you have other options. There is a lot of financial incentive to act as if Arimidex is god's gift to women (especially now that tamoxifen is off patent-- we're talking $9 a day vs. a buck a day), but the fact is, they still haven't shown a clear survival difference for Arimidex vs. tamoxifen. Yes, they have shown SLIGHTLY fewer recurrences, but it is expected that the increased bone fractures will negate some of that benefit. You have to use what works for you, and you are not a \"bad patient\" if you decide to use an older drug. I wrote up some information about this for my mom that you might be interested in: it's at www.breastcancerdecisions.org (a nonprofit site-- not selling anything and no corporate funding, just info I wrote up for my mom). Look under the endocrine section (and the introductory sections, about interpreting statistics, may be interesting too). Good luck. Hi, Even though this was written long ago, I felt the need to comment on it for those of you that are seeing it now for the first time as I did today!  Unless I am mistaken, Roses8753 is suggesting that it's okay to take Tomoxifen or Arimidex. The latter may be more expensive and the survival difference may be the same, however, if a patient no longer has her ovaries and her tumors are hormone fed tumors there is a HUGE DIFFERENCE BETWEEN THE 2 DRUGS! My oncologist was going to put me on the Tomoxifen until I had to have my oopherectomy, when the drug of choice then became Arimidex, due to the nature of my tumors. With the utmost respect, I have to say that hearing things like this really scare me because this advice could turn out to be a disaster! As always, talk to your doctor but even more importantly, do your own research and be very proactive in taking care of yourself or a loved one. I lost my husband 19 months ago due to human error and I, myself was misdiagnosed for 6 months even after a second opinion. You know your own body better than anyone does and when you know that   something's different or wrong keep going to doctors as long as it takes to find the answer. Also, do not be afraid to insist on a second lab opinion if you feel that something's wrong. I wish that I was given that advice to follow before my husband of 35 years lost his life. Take care-",
    "MessageIndex": 186,
    "PostDate": "01/03/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
    "Title": "Side Effects of Arimidex After Almost 2 Years"
  }]
}