{
  "AuthorID": "Intelligentwmn",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Intelligentwmn",
  "Posts": [
    {
      "AuthorID": "Intelligentwmn",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Intelligentwmn",
      "Content": "On Jul 17, 2014 11:03 PM SpringFlowers wrote: Dx 2010/BC already Stg4 -due to misread mammogram. I have NEVER had chemo, no radiaition.  I opted for Laser Surgery, kept my breast, removed the tumor.  No pain, no long recuperation, no need for reconstruction and all the misery. Got off op table, went to dinner that evening, returned home in two days.  My tumor was 9cm, had soft tissue tumors everywhere, lungs, liver, Did the Asparagus cure, laughed at myself, but in 90 days, they were gone, but I think the Laser rid most of the invasion.  Google MinaBissel/TEDconference, explains how the body works to rid cancer cells, I try to stay on a ph neg diet, cancer cannot live in an oxygenated enviornment, cells cannot reproduce.  My tumor markers are now normal, I am no fan of chemo, the bodyis already compromised, chemo only rapidly diminishes healthy cells.  Get your immune system in top order, yes, Reishi/Mitake/Shitake do help, also Fucoidan or Ufn, Curcumin, Inositol 6, Indole 3/Carbinol, Beta Glucan.  Do your homework, you can beat the beast, i'm nearing end of 5 years, onco's said i'd never live to see 2012, but i'm still here.  He's miffied, who cares?   Laser can light up areas of invasion of cancer and eradicate.  Docs/Onco's hate laser due to it being so easy, not to mention cheap.  Cancer can bring in anywhere from 1 -2 million, cancer is the gift that keeps on giving, why do you think they build all these cancer centers??  None are better than the ones already here, they all follow the exact protocol.  Surgery, Radiaion, Chemo, Reconstuction, More chemo, it's a merry go round.  Thankful I refused the ride before I ever got on.  Best to you, I know it's not easy.  ck:LaserBreastCancerSurgery.com.   You deserve to be more than a bank deposit slip. Wow thank you! I had the same issue. Undiagnosed stage 4 after routine Mammos and Ultrasounds,,, even a biopsy that was benign. ( That had to be a MISTAKE) 12 months later I was having a DMX. Have had recon. It's been hell, now becoming a journey. But still moments of total discomfort and the fear of recurrence. The estrogen inhibitors were hell,too. I stopped them. Going on Mushrrom therapy. Never knew about Asparagus until I read this! Can you specify Asparagus cure? Good Luck. ",
      "MessageIndex": 9,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "Intelligentwmn",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Intelligentwmn",
      "Content": "Thank you for information about mushrooms. I learned of this years ago from a lecture on curative mushrooms at the Mushroom Festival in Telluride Colorado. I work with chronically ill clients and when cancer is the dx I have suggested the tea you use and mushroom extract ( available in Sprouts - Maitake D ) . I am now Post mastectomy Dec 2 and recon. I have now tried estrogen inhibitors with many many nasty side effects for me ( some people have none). I am now reminded to take my own good advice and make up some mushroom tea and take my extract daily. Thanks again... Oh by the way years ago when I heard this for the first time it was being given here and there in Japan by  IV to inhibit tumor growth, with huge success. GOOD LUCK !",
      "MessageIndex": 8,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    }
  ]
}