{
  "AuthorID": "Itbeginswiths",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Itbeginswiths",
  "Posts": [{
    "AuthorID": "Itbeginswiths",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Itbeginswiths",
    "Content": "Hi.im really new to all this forum stuff,but I didn't know who to ask without feeling like a hypochondriac. Basically part of my left breast is redish/purple colour and has been for approx 8 months. I noticed it first after a shower,I though at first it was just the hot water but the other breast wasn't affected, I did mention it to a female doctor who said without even looking that breast cancer isn't like a rash. Anyway as the months went on the rash/discolouration was still there and had spead a little. In the last few months I noticed a small indentation under my breast,I went to a student doctor who did see the discolouration immediately but couldn't see the indentation,but he did refer me to the symptomatic breast clinic for tests, as it happens he forgot to sent the letter so 2 months on I hadn't heard from the clinic so I went back to doctor, he gave me the letter to post ,by the following day I had a call from the clinic calling me for tests, I went last Friday, the doctor seen the redness and said she seen the indentation and sent me straight for mammogram and ultra sound, the mammo was clear and the ultasound showed the redness ,the doctors pointed out the redness on the ultrasound and said it was more likely a skin problem rather than a breast problem.he explained that it was foggy where the rash was. He said there were no lumps but he didn't actually go over the area where the indentation was, I only noticed that when I looked in the mirror to see where the doc had circled with her pen . I went back to the main doctor filling the test and she told me there was nothing on the mammo or the ultrasound that worried them but they would bring me back in 4 weeks to recheck in case they missed something. I left feeling relieved but not thinking about it I'm worried, if the redness appears on the ultrasound would that not be a cause for concern? But I also keep telling myself that it can't be anything because it's been there so long and ibs spreads really fast . I'm confused ,worried and keep doubting myself,any help would be appreciated. Thank you. Ps I'm 43,no cancer history, I have hyperthyroidism and graves. Mother of 6 , youngest 8.",
    "MessageIndex": 0,
    "PostDate": "28/08/2017",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,126700,0.htm",
    "Title": "Inflamatory breast cancer or not"
  }]
}