{
  "AuthorID": "j11good",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/j11good",
  "Posts": [
    {
      "AuthorID": "j11good",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/j11good",
      "Content": "Hello First I would like to say that our God is Awesome and He gives me strength not just day by day but second by second.  I was diagnosed with the Breast \"C\" word about 4 years ago (actually it was this time of year), I underwent agressive chemo (ACT) and then radiation everyday for what seemed like an eternity. I was down to where I would just have to see my oncologist twice and year and started having some leg pain, well after some scans it was determined that the \"C\" had metastized to my bones. So I had a few more rounds of radiation on various parts of my body. Through all of this God gave me His continued strength to keep working. However, now I am taking Xeloda and have developed hand & foot syndrome. Has anyone expierenced this and if so do you have any suggestions to help it. It sure is painful................ Thank you and God Bless to All J  ",
      "MessageIndex": 0,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30618,0.htm",
      "Title": "Hand & Foot Syndrome"
    },
    {
      "AuthorID": "j11good",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/j11good",
      "Content": "My world was rocked about 4 years ago when I too was diagnosed with the dreaded \"Breast C\" word. I had a lumpectomy, followed by chemo and radiation. All I can say is that our GOD is so awesome!!!!! He gave me strength not day by day but second by second to endure what layed ahead of me. He provided me with excellent doctors and a great support team of friends and family, but most of all HIS love and grace. Tell your wife that I for sure will keep her in my prayers and will ask God to give her that second by second strength. One thing that helped me get through the chemo was that I drank lots and lots of water, while I was getting my treatments and after. Praise God, I was not very sick at all during treatments. I actually continued working just about every day. My prayers will be with you both!! J",
      "MessageIndex": 1,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30417,0.htm",
      "Title": "Prayers and advice"
    },
    {
      "AuthorID": "j11good",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/j11good",
      "Content": "Drink lots and lots of water. I drank water during my treatments and after. Praise God I was able to continue working, I missed a few days but worked more than I was off. I too, had a lumpectomy, followed by chemo (A,C,T) and radiation. I started loosing my hair after the second treatment, and had my husband just go ahead and shave it. A great feeling and when it starts coming back it's just like a baby's (SOFT). I kept telling everyone to feel. God was my strength in all of this, I am now taking the chemo pill (xeloda) and am doing pretty well with it, but this is 4 years after original diagnosis. Just try and keep a positive attitude and lots and lots of prayers. GOD will help you through.",
      "MessageIndex": 3,
      "PostDate": "20/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30290,0.htm",
      "Title": "On my second treatment and want to know if it gets worse"
    }
  ]
}