{
  "AuthorID": "Jackiaussie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jackiaussie",
  "Posts": [{
    "AuthorID": "Jackiaussie",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jackiaussie",
    "Content": "Hi, my sister was diagnosed with breast cancer 9 years ago at 36 years of age, she had a radical mastectomy of her left breast and six lymph nodes were involved we were told the cancer was invasive lobular carsenoma, she underwent 12 months of chemo and 30 radiation treatments and until Feb of 2007 she was desease free,  then she was diagnosed with ovarian cancer which proved to be metastatic breast cancer tumors were also visible on the CT scan in several areas throughout the abominal cavity, In late Feb 2007 she underwent extensive surgery, The surgeons were confident that they had removed as much of the cancer as possible. She was then put on Taxol for 4 months administered weekly. Since August of 2007 she has been taking Famira, but last week after a CT and bone scan we were told the cancer is now in her Shoulder blade possibly in the ribs and/or spine an MRI has been organised to confrim the bone scan rersults for uptake in ribs/spine. also early nodules were picked up in the lungs. We are obviously terrified for her as she is still only a young woman at 45 years of age with kids that very much need their mum. We spoke with the oncologist and they giving Radium then talking about oral Chemo and a trial drug they are having good results with I was a bit numb at the time and did not record the name of the chemo or trial drug, can anyone give us any information on anything that could help she is not currently on any alternative supplements there are so many things and it becomes confusing but at this stage would like to try anything that could help also treatments given by oncologists that may have helped. We have not asked the question of the treating Doctors regarding life expectancy at this stage?? Thank you and God bless anyone who is going through this you are the bravest people. Jacki  ",
    "MessageIndex": 0,
    "PostDate": "08/05/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23839,0.htm",
    "Title": "Information regarding metastatic desease"
  }]
}