{
  "AuthorID": "JackieL",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JackieL",
  "Posts": [
    {
      "AuthorID": "JackieL",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JackieL",
      "Content": "Hi, i haven't been to the rhuematist yet, they sent me 5 pages of questions to answer and i had to send them back before they would give me an appointment. I thought that was strange but i guess he just wants to get a good history. I'm hoping thats a good thing. I will keep you updated. i mailed it back today so maybe i will hear from them this week.good luck on your doctor visit      Jackie",
      "MessageIndex": 3,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16343,0.htm",
      "Title": "Hand surgeries due to Arimidex,aromasin and femora"
    },
    {
      "AuthorID": "JackieL",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JackieL",
      "Content": "  On 9/20/2007 handproblems wrote: Hi, I suspected the drugs I was on have caused me to have hand problems. I also work with my hands as a librarian.Lots of carrying moving,sorting ,packaging, shelving books full time. I was on Arimidex for one year before it was so severe I changed to Femora,same effects, went off everything for a few months and my hands felt a bit better and my oncologist suggested Aromasin. I've had numerous cortizone shots and a trigger finger release surgery. I am scheduled for a carpal tunnel release in two weeks and I need a fusion to the thumb of ssmy right hand. Has anyone had similar problems and have the problems gone  away if you stop taking the drugs? I don't think my right thumb has any chance of coming back from the severe arthritis. Has anyone had relief from carpal tunnel by going off the medications?  How long does it take for your hands to improve or has the damage been done? Any answers would be appriciated. Mary Hi, I have the same problems with my hands and i am going to a rheumatolist. Both of my thumbs and ring finger on right hand had injections which helped with the trigger finger, but now it has gone to my wrist and all my fingers except pinkys. My oncoligist thinks its arthritis. i have the same questions. I will ask my doctor. Jackie",
      "MessageIndex": 1,
      "PostDate": "23/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16343,0.htm",
      "Title": "Hand surgeries due to Arimidex,aromasin and femora"
    },
    {
      "AuthorID": "JackieL",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JackieL",
      "Content": "Hi everyone, Well here goes. I went to the rhuematis today about my wrist pain. He did agree that it was the arimidex causing the pain. That was the good news. Here is what he said. First he ask me if i could change jobs. Then he said to ask my oncologist about stopping the medicine, you know the one thats supose to keep me from having cancer (arimidex). He said if it is just 10% that some women decide to stop taking it. As far as the pain going away if i stop he wasn't sure. He said if i had never had to take this medicine that 10 years from now i would probably have the same problem with my wrist, the arimidex just causes this sooner. He told me to go back to my orthopaedic doctor and get both wrist injected with cortisone. So at this point i'm not sure of anything except i'm still in pain. God bless all of you!   jackie",
      "MessageIndex": 0,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16929,0.htm",
      "Title": "wrist and hand pain"
    },
    {
      "AuthorID": "JackieL",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JackieL",
      "Content": "Hi everyone, Just giving everyone the latest. I saw my orthopaedic doc. today. Got the injection and my wrist feels alot better. Have to go back in two weeks for the other wrist. So if anyone is having this problem i do recomend the injection. I work with my hands and this injection will hopefully keep me going and it beat having another surgery. Good luck to all of you, stay strong we are going to beat BC God Bless      Jackie",
      "MessageIndex": 3,
      "PostDate": "17/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16929,0.htm",
      "Title": "wrist and hand pain"
    }
  ]
}