{
  "AuthorID": "Jacquied2",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jacquied2",
  "Posts": [
    {
      "AuthorID": "Jacquied2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jacquied2",
      "Content": "On 4/9/2007 Maryjo wrote: I have had to do a lot of research looking at different treatment options for my Mother. Here is what I found out about RFA and thought I would share it with you. (RFA) Radiofrequency ablation begins with the passing of alternating electrical current (radiofrequency energy) through the tumor tissue (lesion). Heat is generated at the site of the lesion by this alternating current. This heat produces coagulation and cellular destruction (necrosis or death), resulting in ablation (destruction) of the tumor tissue.With the newer RFA devices the thermal energy (heat) is evenly distributed to the lesion in a consistent manner, causing consistent and complete tumor cell destruction. How does it work? Using intraoperative imaging of the tumor with ultrasound, an electrode is positioned strategically within the lesion. Then, the electrode is connected to a unique radiofrequency generator and electrical current is delivered into the tissue. As the cells are heated, they are destroyed. The mechanism of RFA is similar to that of a microwave oven, heating from the inside out. The body eliminates the destroyed tumor cells over a period of time. How is the procedure performed? RFA may be performed through an open surgical incision or via laparoscopy. Laparoscopy (also referred to as minimally invasive surgery) is performed through multiple, small skin incisions. Hope that helps you with an understanding. The term \"resection\" simply means removing them surgically - cutting them out and that is a big operation but also many mets are not resectable because of their position or because the patient is not a good candidate. It is a tricky acenue making these decisions. I wish us all the best. MaryJo. I was scheduled to have RFA (Radio Frequency Ablation) on my liver tumor and the night before the procedure my insurance company declined coverage! I have had breast surgery, my only cancer left is in my liver. My oncologist put me on Avastin and Taxol after the procedure was denied. I had a CT scan today and am nervous about the outcome. I have had 2 other oncologists recommend either RFA or another procedure called SIRT. ( SIRT is Selective Internal Radiation Therapy. Tumors are eradicated by sirispheres through the hepatic artery. The little beads deliver high doses of radiation to the tumors). Has anyone with breast cancer mets to the liver had either procedure approved by their insurance company? I know Medicare covers it but Anthem Blue Cross does not. (at least for me) Jacquie",
      "MessageIndex": 48,
      "PostDate": "13/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1311,0.htm",
      "Title": "Breast Cancer Metastasi to The Liver"
    },
    {
      "AuthorID": "Jacquied2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jacquied2",
      "Content": "Lisa, I am going to see a radiologist about Siri spheres this week. Will your insurance cover it for breast cancer mets to the liver? It sounds like the answer to my prayers but I worry about the cost. My insurance company will only cover ablations for colon cancer! How are you doing? Jacquie",
      "MessageIndex": 2,
      "PostDate": "18/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13391,0.htm",
      "Title": "sirtex treatment for mets to liver"
    }
  ]
}