{
  "AuthorID": "jacru1950",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
  "Posts": [
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "On May 18, 2017 3:06 PM jacru1950 wrote: Hello William, Keep track of all your symptoms and compare them withhttp://www.breastcancer.org/treatment/hormonal/comp_char t orhttp://www.mayoclinic.org/drugs-supplements/anastrozole-oral .\"\" target=\"_blank\" rel=\"nofollow\">withhttp://www.breastcancer.org/treatment/hormonal/comp_char target=\"_blank\" rel=\"nofollow\">withhttp://www.breastcancer.org/treatment/hormonal/comp_char These are reputable sites that a good oncologist shouldn't dismiss. Onlyyouknow how much you're willing to tolerate. I will say that now I've been off anastrozole for nearly 5 months after being on it 4 1/2 years quality of life is returning: strength is returning, joint and muscle pain is nearly gone, regularity has returned, eyes can tear, hair is starting to grow back thicker, sleeping betterANDall that has helped my mental well being. Good luck and God bless. Original message didn;t pick up these 2 usefull sites: http://www.mayoclinic.org/drugs-supplements/anastrozole-oral http://www.breastcancer.org/treatment/hormonal/comp_chart",
      "MessageIndex": 281,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "Dear Cleodog, Thank you for sharing. I don't want the cancer center to think I'm being overly militant on this subject but one has to look at the big picture.  I was on Arimidex for nearly 5 years and didn't start getting my side effects until the last year and a half.  I'm NOT interested in another 5 years of Arimidex! One has to weigh quality of life along with treatment. I'm hopeful to have a few pain free years left on this earth.",
      "MessageIndex": 274,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "Hello William, Keep track of all your symptoms and compare them withhttp://www.breastcancer.org/treatment/hormonal/comp_char These are reputable sites that a good oncologist shouldn't dismiss. Onlyyouknow how much you're willing to tolerate. I will say that now I've been off anastrozole for nearly 5 months after being on it 4 1/2 years quality of life is returning: strength is returning, joint and muscle pain is nearly gone, regularity has returned, eyes can tear, hair is starting to grow back thicker, sleeping betterANDall that has helped my mental well being. Good luck and God bless.",
      "MessageIndex": 280,
      "PostDate": "18/05/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "I am a 66 year old 5 year breast cancer survivor and Arimidex user. Today I go for my 6 month check up. Last 6 month visit my doctor informed me that studies show benefits of staying on Arimidex another 5 years. I've thought long and hard about this and after reading all the posts, printing off the Mayo Clinic side effects of the drug and checking off close to half the side effects I suffer from, I choose not to take Arimdex any longer. My side effects slowly and subtly started showing up more the last year and a half ago.  Muscle and joint pain have left me weak and sometimes helplessly depressed.I choose not to have a sedate life style and this pain is the deal breaker.At Christmas time I decided not to take Arimidex any longer as we have a number of spring projects to do and I need to feel well enough to proceed. I'm STILL plagued by the muscle and joint pain. Does anyone want to share how long it took them for the their pain to go away.",
      "MessageIndex": 270,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "Glad to hear about your markers! Good luck jessot.",
      "MessageIndex": 276,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "jacru1950",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jacru1950",
      "Content": "Hi JanatheRanch, Thanks for the reply. It enforces my aurgument to stop taking Arimdex.  I too have dogs and horses--along with a dear husband who because of his job needs me to be able to do much of the indoor and outdoor work around the house. (outdoor work which I like doing.) Looking at the big picture--what good is cancer free if you hurt and can't move well? Makes me wonder-- does big business cancer ever look at the dosages they are prescribing for us? Thanks again.",
      "MessageIndex": 275,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    }
  ]
}