{
  "AuthorID": "Jacy37",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jacy37",
  "Posts": [{
    "AuthorID": "Jacy37",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jacy37",
    "Content": "Hello, I am new to this forum. About 5 weeks ago I was diagnosed with \"Stage 4 Triple Negative Breast & lymph node cancer\" (3 Negative means 'no hormonal receptors' to pinpoint the right chemo or medicine to combat this Yosimite Sam type of cancer /=0).Has anyone on this site/forum, have TNBC/Stage 4 and tried Keytruda or one of the newer 'clinical trial drugs' with any success? My background/story: I'm wife, mom, and just recently new \"grand mommy\" to our daughter's first baby (girl). I have battled lupus, CTD, sjogren's disease, Raynaud's, and a form of lyme for 14 to 16 years. But the worst blow was all the damage that prednisone has caused (that an internist put me on while in hospital for 'flare up,' over 12 years ago). I experienced every possible 'side effect' including; osteoporosis with 24 \"spontaneous fractures\" over 12 years, cataracts (in my early 40s and was previously wellness and health professional and former athlete in good physical condition), heart problems, edema and weight gain (in spite of healthy, moderate eating), deteriorating wrists and permanently dislocated thumbs, etc, It has taken me from being fairly active and working part time health; nutrition, fitness, and wellness Specialist (ironic this!) to gradually being unable to work except on small projects a few times per year. We lost our family home, savings, and sold most of our belongings over 5 years while trying to find diagnosis for several of above conditions. This was because (at time) we could not get health insurance for me since both I, and my husband were 'self-employed' and health ins. companies would not insure me so every cost came out of our pockets and savings. My beloved husband has been working 6 1/2 days per week without a vacation for the past 12 years to keep up with basic medical expenses for me. Then, last year had fall and broke wrist in several places (but also have had \"24 spontaneous fractures\" from osteoporosis caused by the prednisone), then, had esophageal problems which led to Endoscopy and gall bladder removal by October 2015. Surgeon found an attached lymph node that was malignant. In recent months a PET scan, brain MRI, numerous deep core needle biopsies (big OUCH), ultrasounds, many blood panels, and ultrasounds, etc. let to diagnosis of \"Stage 4 - Triple Negative Breast Cancer (also in lymph nodes under arm and in low back - yes, pretty bizarre). Many problems for us as my general Oncologist just does 'regular Chemo' (some that would be very bad for my bones and heart problems from prednisone fall out).AND, these types of Chemo are not very effective against TNBC because they go after hormonal receptors and TN means \"no hormonal receptors.\" We are running short on time. This is a very aggressive cancer and can 'jump' to vital organs quickly. We are praying that something like Keytruda or other 'newer' cancer drugs might save or extend my life...my family/friends and I are not ready to say final goodbyes just yet. Thank you for sharing.",
    "MessageIndex": 0,
    "PostDate": "12/01/2016",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89097,0.htm",
    "Title": "Anyone with \"Stage 4 Triple Negative BC\" tried Keytruda or effective 'trial' med"
  }]
}