{
  "AuthorID": "JaniceLouise",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JaniceLouise",
  "Posts": [{
    "AuthorID": "JaniceLouise",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JaniceLouise",
    "Content": "I wish I had found this site years ago!! I finished my chemo, and started arimadex Aug 06. Was fine for the first month or two, cept for annoying hot flashes. Then the pains began. Hands, feet ankles legs back arms neck. Could not get out of bed by myself. They would ease a bit as I moved about, but I had no energy left from fighting all the pain. The fatigue was as bad or worse than with chemo!! My Doc tried me on femara.......even worse!!! could not function at all!! Have been on aromisin for a little more than a year now. It is not any better, but not any worse than the arimidex. MSM/Glucosomine/Chondroitin helps, but gives me severe diariah (or however you spell it!!) After over a year on AIs, my bone density went down, making intervention, and it's side effects, neccessary. Also, my choloesterol went from normal (I am a vegetarian) to over 300, and I was put on statins. They caused more bone and joint pain, and neuropathy in my hands and feet, and chemical like burns of my skin. When they sent me to a Rheumatologist who wanted to put me on steroids for all the pain and fatigue, I said HOLD IT!! I went off ALL my meds and supplements...Aromisin, MSM/Glucosomine/ condroiten, calcium, vit D, Omaprazole,(to battle the nausea) statins, probiotics (to try to fight the bowel problems) and on and on.... I have not felt better since I was first diagnosed in 12/05!!! It has been wonderful!! much less pain, more energy, able to do the things I love........However, my last round of tests showed raised tumor markers, and several spots on my liver. I too, want to live, and so, am back on the statins and the aromisin. I cried when I first began them again... I'm going to try accupuncture. Does anyone have any experience with this and AI's side effects??",
    "MessageIndex": 60,
    "PostDate": "26/09/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
    "Title": "Side Effects From Aromasin"
  }]
}