{
  "AuthorID": "Janices_Journey",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
  "Posts": [
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "Hi, Waiting for the results of tests is one of the worst things we go thru.  What I do, the day after the test I call the office, tell them that I took a certain test yesterday, my cell phone is on and I would appreciate a call back with the results, even if the nurse calls back.  I explain to the doctor how highly stressful waiting can be and thay always call me back that day. Last week waiting for results from bone scan thay actually called me 9 o'clock on a Friday night so I didn't have to wait the weekend.  I e-mailed them to tell them how grateful I was for their consideration. I am very lucky to have found a very kind, thoughtful, caring doctor and staff who never seem to forget that I am a person. Janice  ",
      "MessageIndex": 2,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39829,0.htm",
      "Title": "Wait time for test results"
    },
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "Hi Ann, So good to hear you GREAT news!!! Go out and enjoy this great day! Sister survivor, Janice",
      "MessageIndex": 2,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38279,0.htm",
      "Title": "good news"
    },
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "I have been on aromasin since the end of 2007 and I had tried the others before that but all three medications have the same side effects.  The pain in my knees, legs and now my hips is unbearable.  My body has aged 20 years in the last three years and it feels like I am 90 years old.  I have recently tried B-12 shots for the tiredness and it has helped.  The only way I can live with this pain, is that I know in two years I hopefully will go off this medication.",
      "MessageIndex": 132,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "Hi, I can tell you one thing, that the breast cancer community is full of support and prayers for each other.  There are so many ways to find help and to help others that makes it possible to keep yourself going. I have been doing fundraisers for the cause and find it keeps me busy as well as I feel I am helping and I know that if we stand together, the girls coming up behind us will benefit greatly. I was diagnosed in 2/2007 and follow my care very closely.  Always make sure you are educated in these subjects so that you can help in your medical care decisions and find s doctor you trust. I will keep you in my prayers and if you need support, just reach out someone will always be there to grab your hand. A breast cancer survivor never has to do this alone and every survivor understands and is happy to help or just listen. From a fellow breast cancer survivor, Janice  ",
      "MessageIndex": 1,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40131,0.htm",
      "Title": "Need support"
    },
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "Hi, I am so sorry to hear your news, I will keep you in my prayers.  Please let us know what happens.  As a sister cancer survivor,  we want to celebrate good news together and be there for each other in the times that are hard to handle. Janice",
      "MessageIndex": 4,
      "PostDate": "04/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35798,0.htm",
      "Title": "another lump"
    },
    {
      "AuthorID": "Janices_Journey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Janices_Journey",
      "Content": "Hi! I have been on aramosin for two years now.  The hot flashes seems to be calming down a little but the joint pain is horrible.  Ther pain and fatigue are a daily struggle and I hope I can continue daily living with these side effects.  My knees, legs,neck and ankles are in horrible pain and more so when I try to sleep.  I have just started accupuncture two weeks ago to try to help with the pain.  If anyone has anyy help hints, please let me know. I did not know about steriods or any problems to be aware of from them.  Please any information will be appreciated. Janice  ",
      "MessageIndex": 0,
      "PostDate": "09/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34022,0.htm",
      "Title": "aramosin"
    }
  ]
}