{
  "AuthorID": "jenn88",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
  "Posts": [
    {
      "AuthorID": "jenn88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
      "Content": "Wow! I am so sorry to hear about your cancer as well. I will tell you what though you women are some serious fighters and I admire you tremendously! I truly hope that you win your battle as much as I hope my mom wins hers! All we keep saying to each other is to never lose hope & if you have the will to fight with all you have. I love the fight like a girl shirts they are inspiring. I would greatly appreciate to have your doctors name we have been grasping at straws and just want a chance. Mom wants to go home cause the doctor says theres no hope so why would she want to fight if she doesnt have a chance. We just want someone to say ok we will try this it may not work but we will try that small amount of support and a chance is all she would need to say bring it on. She's such a tough woman and she needs a doc to be as tough. Thank you so so much for responding it really means a lot! Best of luck to you and you will be in my thoughts and prayers. You are an inspiration!",
      "MessageIndex": 2,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40577,0.htm",
      "Title": "How much chemo is enough for results"
    },
    {
      "AuthorID": "jenn88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
      "Content": "My mom has stage 4 metastases breast cancer which has spread to her bones liver and brain....Is 4 weeks of chemo enough to see results? My mom had 4 once a week chemo sessions of a low does of chemo w? 2 Herceptin treatments as well. We took her to the hospital where she is now and the docs there have said that she didnt respond to those 4 sessions and she is too weak for more treatments.  They have suggested hospice. I dont understand why they cant try a stronger dose if they think she will pass away anyway why wouldnt they try a higher chemo we dont want to give up fighting and she just found out about a month and a half ago. They say her liver will be what will kill her so why not try one time? Any suggestions as to how much chemo it takes for results and trying one more time? Also the hosp has her doing daily radiation but that doesnt target the liver...  ",
      "MessageIndex": 0,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40577,0.htm",
      "Title": "How much chemo is enough for results"
    },
    {
      "AuthorID": "jenn88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
      "Content": "My mom-in-law has stage 4 mestatis breast cancer through her body and fri had her 3rd chemo & 2nd herceptin. I know chemo beats you down & makes you tired n sick but she won't eat or drink and is unable to even get up alone. We are trying to decide if she needs 2 go to the ER or is this normal? Shes taking anti nausea n pain med with no relief. SHe's in so much pain and so sick. WHAT DO WE DO??",
      "MessageIndex": 0,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40360,0.htm",
      "Title": "Mom wont eat or drink very fatigued..HELP!"
    },
    {
      "AuthorID": "jenn88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
      "Content": "Thanks so much! I agree & we are in the process of trying 2 convince her to go. We are only 30mins from Johns Hopkins which is where i feel she needs to be the local oncologist isn't being attentive enough. She is 2 strong of a woman to be so beat down I just want her to atleast be able to sit up and talk to her kids they need her.",
      "MessageIndex": 2,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40360,0.htm",
      "Title": "Mom wont eat or drink very fatigued..HELP!"
    },
    {
      "AuthorID": "jenn88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jenn88",
      "Content": "Thanks so much! I hope we can convince her to go we are trying now. She ate about 5 bites of jello but thats not enough especially since we are 2days of no nutrition she says food n drink taste bad so she cant bring herself 2 eat and drink i think she needs an iv of some sort for fluids  ",
      "MessageIndex": 3,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40360,0.htm",
      "Title": "Mom wont eat or drink very fatigued..HELP!"
    }
  ]
}