{
  "AuthorID": "Jentee",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jentee",
  "Posts": [
    {
      "AuthorID": "Jentee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jentee",
      "Content": "sounds very similar to me - as I understand it, the her2 protein makes the tumor grow more aggressively. I have had 2 AC treatments, and am looking at taxol and herceptin as well. If you want to chat more, please respond.",
      "MessageIndex": 4,
      "PostDate": "24/09/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2985,0.htm",
      "Title": "Her2-neu Positive/node Negative"
    },
    {
      "AuthorID": "Jentee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jentee",
      "Content": "Thank you for your reply. I hope you don't mind a few questions. I assume you had a recurrence from your original bc? Do they think that your original bc was her2+, and that is why you are her2+ now? How does the herceptin make you feel? I am a little concerned about the side effects, but I know that the benefits far outweigh the negatives. Did you have positive lymph nodes on your original diagnosis? Thanks again, and my thoughts are with you. Jenny",
      "MessageIndex": 7,
      "PostDate": "18/11/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2985,0.htm",
      "Title": "Her2-neu Positive/node Negative"
    },
    {
      "AuthorID": "Jentee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jentee",
      "Content": "I was diagnosed in May 05 with stage 1 breast cancer. I was 36 at the time; my tumor was 4 mm, node-negative, her2positive, estrogen and prog. negative. I had lumpectomy immediately, but then sought a second opinion on treatment, as recommended by my local oncologist. We've also done genetic testing since my Mom is a breast cancer survivor (9 years) and the results came back \"inconclusive\". Have had 1 AC treatment, and will be followed by 3 more (every 3 weeks), then they are recommending taxol once a week for 12 weeks and radiation. Probably will do Herceptin for a year. Just wanting to chat with someone with similar circumstances. I am a teacher and wanted to work, but am not sure about how physically taxing this would be. Please respond if any of this fits your case!",
      "MessageIndex": 0,
      "PostDate": "18/09/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2985,0.htm",
      "Title": "Her2-neu Positive/node Negative"
    }
  ]
}