{
  "AuthorID": "jessicacat",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
  "Posts": [
    {
      "AuthorID": "jessicacat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
      "Content": "You've had so many responses, but I'll share with you what worked best for me.  You may have to try a couple of things before you find what \"fits best\" for you.  I had a lumpectomy and left the hospital with a bra supplied by them.  I wore it a couple of days until I could get one of my own that fastened in the front.  I eventually changed to a pull over sports bra, but I didn't do that until it was more comfortable to raise my arm to put it on.  I did find that sleeping in a bra was more comfortable for several months.  I also would prop my breast on a pillow when I layed on my side so it would be supported.  The sports bras that worked best for me were very inexpensive and were \"racing straps\" in the back, which meant they had small straps on my shoulders.  I'm a 3D so I'm picky about straps.  I think they were Hanes (can't remember) and were 3 for $10.  they had gathers in the front so they didn't come up and smush me down because they were like a regular bra in the front.  Of course, no underwires since the lumpectomy, even a year later.  When doing radiation a bra worked all right, until my skin got very sensitive.  The radiation oncologist gave me cream for my skin and pads to put between my bra and skin.  That helped alot.  I would recommend you tell the radiation techs, nurses, and doctor if you have any questions at all.  There's nothing they haven't heard and they are wonderful about helping.  As for how long before you're ready for work, it's an individual thing.  You may feel ready to go in a week or two, but remember that you've just had surgery.   Anesthia takes awhile to get over (at least I think so).  If you're sleepy or tired, take a nap.  It's time to treat yourself well and pamper yourself.  I saw that someone talked about getting the house ready beforehand, and that's a good idea.  I \"redid\" my bedroom so I'd come home to a new room to begin my healing.  All it took was a new quilt and lap throw, but it felt great! Good luck!!    ",
      "MessageIndex": 12,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32019,0.htm",
      "Title": "Bra suggestions following lumpectomy"
    },
    {
      "AuthorID": "jessicacat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
      "Content": "I wish I  could remember what the radiation oncologist recommended for me.  It was an cream that I had to get it at  a pharmacy that could make it for me, and it was used for patients with 3rd degree burns.  I'm sure you doctor would know what to prescribe.  I used it and covered the area with a gauze the hospital supplied that didn't stick to skin.  I had to use it under my breast for about 2 weeks while my skin was healing.  I have large breasts too and I don't know if that made a difference as to how bad I burned, but I am also very fair skinned.  It  took several weeks before that area of my breast burned that badly, and it was raw and took a couple of weeks to heal.  It was very sensitive for a cojple of months afterwards.  But when they started the treatment for the last week of extra radiation for the area of the cancer it only took a couple of days for it to burn.  I was longer before that healed.  I used vit e on both of these areas after they were healed to help with the scarring and it helped.  I just used one of my vit e that I take and pricked it with a needle and put the oil directly on the areas.  Hope this helps!!  ",
      "MessageIndex": 9,
      "PostDate": "01/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20371,0.htm",
      "Title": "Treatment Of Radiation Burns"
    },
    {
      "AuthorID": "jessicacat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
      "Content": "Oops . . . I goofed up when telling about heat and ice.  You start with HEAT and then to ICE and end with HEAT.  I swear, my brain doesn't work right some of the time anymore:)",
      "MessageIndex": 10,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    },
    {
      "AuthorID": "jessicacat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
      "Content": "Oops . . . I goofed up when telling about heat and ice.  You start with HEAT and then to ICE and end with HEAT.  I swear, my brain doesn't work right some of the time anymore:)",
      "MessageIndex": 20,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    },
    {
      "AuthorID": "jessicacat",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jessicacat",
      "Content": "I also had DCIS and radiation and had trouble with lots of burning and ultimately skin changes   As for hardening, it's where the lumpectomy was done and radiates up towards my pecs.  I treat it like I do my fibromyalgia, which is with with followed by ice and ending with heat.  It helps me to get the area more able to manipulate.  Then I do the awful trigger point releases on it.  If you look up fibromyalgia it talks about how you do that.  I will tell you it is so painful it makes me want to cry.  If you're looking for a physical or massage therapist, ask if they can do deep tissue work.  I've had them work on my pecs to loosen it up and although it is torture, I've gotten back my range of motion.  I know how I felt after all of this and it's like \"I thought this was the cure . . . not more pain\".  I get tired of my family and friends telling me they don't understand why my moods are still all over the place.  Nobody can uncerstand until they've walked in our shoes. Best of luck!!!   ",
      "MessageIndex": 9,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22933,0.htm",
      "Title": "Hard breast following radiation"
    }
  ]
}