{
  "AuthorID": "Jewelsinalabama",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jewelsinalabama",
  "Posts": [
    {
      "AuthorID": "Jewelsinalabama",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jewelsinalabama",
      "Content": "Help, has anyone out there with breast cancer had the DIEP procedure performed in Alabama??  I've been trying to get my insurance to pay for me to go see Dr. Sullivan & Dellocroce in New Orleans but they keep turning me down, saying I have to have it performed in Alabama.  Help!!! Thanks!!!  ",
      "MessageIndex": 0,
      "PostDate": "23/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9855,0.htm",
      "Title": "post op reconstruction"
    },
    {
      "AuthorID": "Jewelsinalabama",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jewelsinalabama",
      "Content": "I forgot to add I was 41 at dx and am now a healthy 43 yr old  :)",
      "MessageIndex": 4,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11976,0.htm",
      "Title": "HER2-NU"
    },
    {
      "AuthorID": "Jewelsinalabama",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jewelsinalabama",
      "Content": " First off, I am sorry to hear of your sister's diagnosis.. It is very scary for the whole family when someone is dx with breast cancer.  I was dx with bc in July '05 with ductal in-situ carcenoma of the right breast and choose to have a bilateral mastectomy.  I had to wait 4 weeks from the time of dx to the time of surgery, I was told there was no rush and I wanted reconstruction at the same time as my mastectomy.  One week before surgery, I felt a lump about the size of a dime close to my chest wall in the upper quadrant of my breast.  I mentioned it to my surgeon who said it was probably a swollen lymph node due to the biopsy I had taken just 3weeks earlier.  At the time of surgery the \"lump\" I had felt turned out to be HER2+ cancer. ( Prior to surgery I had had a negative mamogram & negative MRI).  So this mass had gotten that big in under 3 weeks.  HER2+ is very aggressive, hence it's rapid growth...but thank goodness for HERCEPTIN.  It specifically targets that type of cancer.  I had 6 months of chemo, 35 doses of radiation therapy to the right chest wall (left breast was fine :)  ) and 52 weeks of herceptin.  I now have a head full of thick, curly hair and am doing great.  I even had at the time of surgery pos lymph nodes....so try not to despair...Herceptin truely does a great job.  I feel great, work full time, I have no limitations...only those I place on my self.  It is not an easy road your sister has to travel, but at the end of the journey she will be well.  Take care & I will keep you & your family in my prayers.   P,S, I have a 16yr old daughter and I also worried about a genetic thing...but not to worry it is not always  geneticly linked.   I have been the only one in my family to have ever had breast cancer or for that fact any kind of cancer.",
      "MessageIndex": 3,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11976,0.htm",
      "Title": "HER2-NU"
    },
    {
      "AuthorID": "Jewelsinalabama",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jewelsinalabama",
      "Content": "Still wondering if anyone in Alabama has had the DIEP procedure?",
      "MessageIndex": 0,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11074,0.htm",
      "Title": "reconstruction"
    }
  ]
}