{
  "AuthorID": "JewelsOhio",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JewelsOhio",
  "Posts": [
    {
      "AuthorID": "JewelsOhio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JewelsOhio",
      "Content": "By no means am I ungrateful for the outcome I've been given.  I'm sorry to hear that your prognosis isn't better.  I understand your point of view, but no one should have to compromise the standard of care they receive.  There shouldn't be a trade off for anyone.  What is it doing to the patients that have a less than favorable prognosis? ",
      "MessageIndex": 2,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    },
    {
      "AuthorID": "JewelsOhio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JewelsOhio",
      "Content": "First off, thank you for your service! Sorry to hear what you're going through.  You sound positive despite it all.  I hope it turns out alright. We're retired USAF.  I know the limitations of Tri-Care.  We live in a rual community so my choice of treatment centers are few and far between.   ",
      "MessageIndex": 6,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    },
    {
      "AuthorID": "JewelsOhio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JewelsOhio",
      "Content": "Takes a lot of courage to go through all of that.  I think it's disgraceful you were treated that way.  You shouldn't have to fight to be heard.  Who knows your body better than yourself?  Are you still in treatment? ",
      "MessageIndex": 5,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    },
    {
      "AuthorID": "JewelsOhio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JewelsOhio",
      "Content": "I was diagnosed with breast cancer back in September, 2011.  I went through a core needle biopsy, lumpectomy and sentinel lymph node biopsy. I opted for the Oncotype DX Test. The results were steller.  My chances for reoccurace are next to nill. I started Tamoxifen and radiation therapy in December.  And here lies the problem.  I hate the cancer center where I receive my treatments.  I have no other choice but to go there.  I'm stressed to the max.  I cry before radiation, during radiation and on the way home from radiation. The first day it took them over two hours to set up the simulation.  Family members (both male) of a technician came into the room during my set up.  Here I am naked from the waste up and strangers are allowed to come and go as they please.  I was mortified. I told the doctor and that was as far as it went.   My second visit I found out that two of the meds I'm on shouldn't be taken with Tamoxifen.  I printed the information off of the internet and asked the doctor about it.  She told me that I have to take it up with the doctor that perscribed it to me.  She told me that I need to stay off of the internet then walked away. I've been wheelchair bound for a year now.  One time after the treatment I was scheduled to see the doctor for my weekly visit.  The technician got me into the wheelchair, threw my clothes on my lap and proceeded to take me into the exam room with no gown on. I yelled at her and she said, sorry I forgot; chuckling. What do I do to survive this?",
      "MessageIndex": 0,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    }
  ]
}