{
  "AuthorID": "Jilliann",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilliann",
  "Posts": [
    {
      "AuthorID": "Jilliann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilliann",
      "Content": "On Feb 13, 2018 10:13 PM Kristenbuck45 wrote: Hi I am new to this but I am goin to share my story with you .i believe I need ppl to talk to I feel all alone, I’ve been fightin this since 2003 it’s been long road I just need some support from other men or women goin through same thing .its metstastic bc stage 4 found under my arm in lymph nodes and to my spine .i feel depressed everyday I’m alone my husband left me when I got sick , I got more bad news so I had mri , I will find out what is goin on tomm as far as treatment options I suppose . Hi. I also feel sad that you are going through so much. Your husband didn't realize what a strong quality wife he had. You deserve someone with compassion & strength. I also have metastatic breast cancer. Triple negative which spread to lymph nodes under my arm , lungs, bones (mostly spine) and now, my liver. I have some great news about a new treatment that I recently qualify for and am hoping you may be able to try this too if it works. So far, I have heard all positive news about it. It is spot treatments. I wil find out more about it and get back to you if you are interested. The doctor uses chemo and microwave. First they go into the cancer with chemo, then block off the blood vessels around the cancer so the cancer can't be fed from the vessels. The day after, they treat it with microwave.  You will be in my prayers and just remember, you have people all around you who are fighting cancer and we care about you and understand. Hope to hear from you! Jilliann",
      "MessageIndex": 3,
      "PostDate": "01/07/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134928,0.htm",
      "Title": "I’ve got stage 4 breast cancer"
    },
    {
      "AuthorID": "Jilliann",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilliann",
      "Content": "Thank You So Much for your encourageing reply! I have been fighting this since October 2016 and am now waiting for new trials. Did your Aunt Nona have stage 4?",
      "MessageIndex": 5,
      "PostDate": "23/10/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134928,0.htm",
      "Title": "I’ve got stage 4 breast cancer"
    }
  ]
}