{
  "AuthorID": "Jilli",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilli",
  "Posts": [
    {
      "AuthorID": "Jilli",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilli",
      "Content": "I have stage 4..mets to spine, lungs, liver.  Was on Taxol every week and avastin every other treatment for almost 2 years.  Am on a break from the Taxol right now.  Doing well but have a question....what is Doxil?  Never heard of it.",
      "MessageIndex": 3,
      "PostDate": "12/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13512,0.htm",
      "Title": "Avastin & Doxil"
    },
    {
      "AuthorID": "Jilli",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jilli",
      "Content": "  On 7/19/2007 Lilly2003 wrote:   On 7/18/2007 LindaW wrote: I'm looking for those who are taking Taxol and Avastin. I have breast cancer mets to bone and liver.  I'd like to hear from those taking the above meds.  Let me know how these are working for you.  Side effects?  How long you've been on chemo.  Have you experienced bad skin burns while taking these medications or while taking Taxotere?     Linda (muzk2myear@sbcglobal.net)  Linda, My bc reoccurred or was rediagnosed in Sept. 2005 It had m. to lungs, spine and liver.  I was on Avastin and Taxol until June 2007.  My blood counts went from 12000 to 100.  I am now on avastin every three weeks--my ct scn last month was the same(a few small spots in liver)  and counts had gone down to 70!!  My blood pressure is elevated because of avastin but no other side effects.  I am having problems with joints and thanks to this website..realize that is probably due to aromisen. I do believe in nutrition, etc and prayer for treatment also!! So my stage 4 metatisize has been actually very \"do-able\" I have been on a cruise(hairless), two motorcycle vacations and many great family/friend events. So, be encouraged.  I have been on a clinical trial with Avastin, Taxol and Gemzar. I started in the trial August 2006. My one year anniversary is coming up. I was originally diagnosed in 2/2203 with breast cancer, triple negative. I was feeling great when I got some fluid in my lungs last year. My cancer met. to the lungs only. My side effects have been pretty manageable after they worked out the kinks. I haven't had skin burns??????Mostly tired and weak. With the feel of flu like symptoms. I'm down for about 2/12 days a week. Migraines are the worst for me. They can last three days. We are working on managing the pain. I have been on this clinical trial longer thatn anyone in Pittsburgh. I'm being treated at the Hillman Cancer Center. Are you going on these drugs? I will tell you I have had some fantastic results. No advancement in my cancer in almost 12months. Also the fluid in my lungs dried up afer two months of treatment. All things considered I'm doing great. I have a friend who is on the Avastin and Taxol alone. In this study you either get picked for the two drugs or the three drug treatment. She is on the two, I'm on the three. She had it in her bone, neck, chest and liver. She has also had some great results. She has only been on it for almost six months now. With very little side effects. If you would like to email me that would be okay. I'm not sure how this works. I found you by getting google updates. You just showed up. I hope this helps you, I would recommend this combination to anyone. I believe it has saved my life!!!! Wishing you the Best, Dawn--Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--  ",
      "MessageIndex": 2,
      "PostDate": "12/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14468,0.htm",
      "Title": "Taxol and Avastin ?"
    }
  ]
}