{
  "AuthorID": "jj91016",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jj91016",
  "Posts": [{
    "AuthorID": "jj91016",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jj91016",
    "Content": "My stepmother, Linda, has had metastatic breast cancer for some time now. Not too long ago, we started going to a gym together and we did that because she was accepted to a program the gym held called 'Living Well With Cancer'.  Just to let you know, I don't think Linda had ever engaged in any sort of formal exercise her entire life up until that point.  Needless to say, those two days a week absolutely transformed her in so many good ways!  The program has long since been over and the gym is kind of far away so we don't go as much, but I've been trying to get her interested in Pilates since we started this whole exercise thing together and she finally seems to want to do it.  The only thing is, she's worried one of her bones might just snap, and let me tell you why.  Her breast cancer has done quite a bit of site seeing throughout her body.  It now completely encapsulates her lungs, is in both hips and has settled itself in every every section of her spine.  Her bone mets are currently at 80% with no detectable holes in the bone as well as no detectable active bone degeneration, but no one knows for sure whether or not the cancer is presently causing any damage to her bones and will not know unless something happens to indicate that the bones have been attacked.  So!  Now, finally, to my question!!  Given Linda's history with cancer, are there any certified Pilates trainers out there who know specifically, from the following list, which of these Pilates mat exercises are not safe for her to do so she won't have to stress over breaking bones?  Also, she will be doing modified versions of all exercises, to start anyway. ~ The 100 ~ Roll up ~ Roll over ~ Climb the Tree ~ Leg Circles(on your back) ~ Roll Like a Ball ~ The 5's(single leg stretch; double leg stretch; scissors; double straight leg lowers; criss-cross) ~ Open Leg Rocker ~ Corkscrew ~ Saw ~ Swan-Dive ~ Neck Pull ~ Shoulder Bridge ~ Spine Twist ~ Jack Knife ~ Leg Work(side kick front; side kick back; gluteus medius lift; side leg lifts) ~ Teaser ~ Can-Can ~ Swim ~ Beats on the Belly ~ Plank ~ Seal ~ Pilates Pushups Any suggestions for more are certainly welcome as well!!  I look forward to your feedback on this topic.  And thank you for taking time out of your day to read my post. Peace and happiness to you all! Joanna",
    "MessageIndex": 0,
    "PostDate": "13/02/2012",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64509,0.htm",
    "Title": "Need advice about which Pilates mat exercises are safe for stepmom living with cancer"
  }]
}