{
  "AuthorID": "Jjolene76",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
  "Posts": [
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Mildred, Please visit http://www.metaplasticbreastcancer.com/blog/ and you will find links to contact our group. I look forward to hearing from you!! ~Jamie H",
      "MessageIndex": 5,
      "PostDate": "15/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6098,0.htm",
      "Title": "Metaplastic Carcinoma and Heredity"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Hi Laura, My name is Jamie. I am replying to your message because my mom had metaplastic breast cancer in 2003, was in remission until Nov 2005 and has since passed away...in fact it was just 22 days ago I lost one of the most important people in my life. If you are interested we have a group of gals from around the US and beyond that email each other or if you just to talk with me about your experiences etc, please email me. --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html ----. Hope to hear from you! Jamie",
      "MessageIndex": 1,
      "PostDate": "22/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6098,0.htm",
      "Title": "Metaplastic Carcinoma and Heredity"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Lois,My mom's cancer was first detected by herself (breast examination). She went in and had a biopsy done (2003) and confirmed this rare cancer (5cm tumor left breast, triple neg nodes also). The first bout was considered Stage II. My mom had a lumpectomy, then a total mastectomy, followed by tram flap reconstruction. Then onto chemo of Adriamycin, Cytoxin, Taxol and 35 radiation treatments. She started at Luther Hospital Mayo System in Eau Claire, WI (I cannot recall this moment the name of the doctor). In Nov 2005 the week of Thanksgiving, she thought she had the flu. She started having weird chest pains, trouble breathing. The cancer had met. to her left lung (same side as breast). She was then treated by Dr. Dean Delmastro at the Regional Cancer Center of Sacred Heart Hospital in Eau Claire, WI. She started chemo of Ifosfamide w/Mesna & Tarceva. 2/28/06 met. to her RIGHT shoulder blade. She had it removed and confirmed same cancer. Obviously treatment not working. The Ifosfamide was VERY HARD on her too. She was down in weight terribly in the first place. Started new chemo of Taxol, Avastin & Gemzar. Then tumor came back in the right shoulder blade...very painful this time. They decided not to remove as it would work as a good marker for treatment working/not. 6/1/06 Added Carboplatin to Taxol, Avastin, & Gemzar (due to finding additional spots on her left lung and a new kidney tumor). 6/14/06 found another tumor on her brain 9 mm. Started radiation of her brain. She was having a very rough time with her calcium level being high. Basically they tried to get her calcium down and weren't able to do it (cancer starts taking on different characteristics of your body, therefore; they figure the tumors were making excess calcium). High calcium made her act as if she had Alzheimer's. It was so hard to see her like that. We got her home on 6/29/06 and she passed away on 7/1/06 at 6pm. She was 52 years old. Very sad! I just want to help other people if I can. My sister and I started a website long before she got as bad as she did http://www.metaplasticbreastcancer.com/blog/ and we have a group of 16 women from all over the country that we all converse through email. We have all become pretty good friends!! Reply if you would like, I want to get you my personal email but this website won't allow it to be viewed even if I enter it in the message for privacy reasons;) Hope to hear from you!! ~Jamie",
      "MessageIndex": 3,
      "PostDate": "02/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6098,0.htm",
      "Title": "Metaplastic Carcinoma and Heredity"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Hi Mildred, If you go on the website http://www.metaplasticbreastcancer.com/ and then click on BLOG (not the blog on the top of the screen, the one about 1/4 of the way down), then on the right hand side of the screen where it says SITE LINKS click on the link that says \"Updates on mom\" If you scroll all the way down to the bottom you will get the information you need. I look forward to hearing from you. ~Jamie",
      "MessageIndex": 7,
      "PostDate": "28/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6098,0.htm",
      "Title": "Metaplastic Carcinoma and Heredity"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "If I were you I would go and demand a biopsy. You are right, why have it be a year out?! I lost my mom on July 1st from a rare form a breast cancer called Metaplastic Breast Cancer. We (my sister and I) are focusing all of our energy on helping other people. We had been with my mom to all of her appointments, by her side for 3 1/2 weeks in the hospital and at home in the end 24/7. She was diagnosed the 1st time in June of 2003. She went through chemo/radiation, it was a breeze for her. She was in remission until Nov 2005, went into the doctor with chest pain. The cancer had metasized to her lung. I won't get into the entire diagnosis because I want to make my point that in 2003, they knew about her lump for months to a year prior to biopsying. You have to be pushy and demand things from your health care providers these days. They are cutting down on costs to insurance and though I hope obviously it is NOT breast cancer, you need to take care of it if it is. My mom had many fibrios (sp?) tumors prior to her breast cancer and had some removed and some just biopsied, so I will keep my fingers crossed that that is what yours is also. Jamie",
      "MessageIndex": 1,
      "PostDate": "22/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6118,0.htm",
      "Title": "3rd Opinion?"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Hi Leslie, My name is Jamie (female) and I am 30 years old. I am married without children. My mom was first diagnosed with Metaplastic Breast Cancer in June of 2003. She went through chemo/radiation and was in remission until Nov 2005. The MBC had metasized to her lung (then to her kidney, then to her brain). Sort of ironic that I am reading this now because I having my first \"hard night\" since losing my mom. I lost her the day you wrote your original message on July 1st, 2006. Tonight is the first night I am home alone without 100 things to do. I decided to pull out the DVD my dad made for my mom's funeral service and watch it. I have seen it several times, but never in my own home. I cried just as I was grabbing it to put it in the DVD player. I cried my eyes out..have been all night..I am known as the \"strong\" one. I heard that throughout my mom's funeral services. I guess aside from my dad, sister, and I being at her bedside (we got my mom home where she wanted to be) for her last breath(s) I haven't really \"cried\". That Saturday night was the hardest night of my life. I will never forget it. It's funny though how you get the strength when someone you love so much is sick, to stay up 24/7, to be there for them. This may sound funny to you, but I take comfort in talking to my mom. It's only been a short while since she has passed but I talk to her all the time. I think I am just starting the grieving process and will probably seek a support group. Time will tell how I will ever be able to go on without my mom. I know that my dad and sister need me. I want you to know that if you would like to talk outside of this group, I am here.",
      "MessageIndex": 7,
      "PostDate": "22/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5862,0.htm",
      "Title": "Losing my Mother"
    },
    {
      "AuthorID": "Jjolene76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jjolene76",
      "Content": "Hi Marcia, My mom had breast cancer in 2003 (Metaplastic Breast Cancer, very rare). She had chemo and radiation and was in remission until Nov 2005. She went to the doctor with chest pain. She also had fluid on her lung. It was the same side as her breast cancer almost 3 years prior. She had fluid removed several times, liters at a time. It was a dark cola like fluid. Just wondering how things are going with you? Jamie",
      "MessageIndex": 5,
      "PostDate": "22/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5475,0.htm",
      "Title": "Possible Mets to Lung"
    }
  ]
}