{
  "AuthorID": "jmurphy914",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jmurphy914",
  "Posts": [{
    "AuthorID": "jmurphy914",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jmurphy914",
    "Content": " My 73 year old mom had an insitu tumor 13 years ago, one sided mastectomy, nd took tamoxifen briefly but stopped taking it because of side effects (i think hot flashes and other things). Then about 2 years ago she had a invasive tumor in the other breast. It did not spread and she had a total mastectomy. I do not think they took the armpit lymph nodes. She has been on Arimidex ever since. Within 6 months her spine and shoulder have completely degenerated. Her neck was xrayed right before she started arimidex for something else, but I remember saying how great her disk spaces were and what great shape her neck was in. She never had any problems. Her neck is now so egenerated that it is scarry. her joints in her neck are also very bad now. Her shoulder is very degenerated. When I asked her oncologist he got mad at me and attaked me verbally. He does not want to hear it. My Mother does not want to hear it either. She is scared the cancr will return (she says she can get uturan cancer?).  Mentally I have watched her decline severely since taking it. Her memory is now aweful. Her concentration terible. Her moods are aweful. She is on Zoloft for depression, but has been for a decade (thats one aweful drug too).  A month ago she was diagnosed purely by coincidence of having a HUGE asending aortic anyerism, which was ready to rupture.. I believe the arimidex cutting off estrogen is responsible for this. There is absolutly NO family history of any heart or circulatory disorders at all in her family. She just had this repaired 3 weeks ago. Open heart surgery, complete with aortic graft (they removed her asending aorta and replaced it with a polyester one). Her recovery has been aweful. Congestive heart failure started after a week. I wonder if taking arimidex is working against her heart healing? Estrogen keeps heart, arteries and veins healthy, so cutting off estrogen after open heart surgery cannot be good..    What do you all think about this? I firmly believe that Arimidex is to blame for the sudden decline of a healthy 70 year old woman. It is not osteo porisis that I am speaking about, although she has mild case of it now, but complete degeneration of joints, bones, discs, arteries, etc.. This drug is new and I feel my mother is just a test pilot. The chances of her cancer coming back after a full mastectomy are slim, right? Is all this worth it? Am I nuts? Thanks",
    "MessageIndex": 20,
    "PostDate": "21/12/2010",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
    "Title": "Side Effects of Arimidex After Almost 2 Years"
  }]
}