{
  "AuthorID": "jnssilver",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jnssilver",
  "Posts": [{
    "AuthorID": "jnssilver",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jnssilver",
    "Content": "Hi Loui-e, Your post was in April, so how are things today - December? I'd like to know really - your status as well as your husband's.  I'll share where I am. I have always been healthy, so my diagnosis, DCIS, was a first-time experience for both of us, married 40 years. He was overwhelmed, being an alcoholic working on sobriety. He succumbed. He was scared, angry, depressed, and extremely clingy. I tried, really tried to reassure him, but he would have none of it. He'd had four hospital stays that were terrible for him, so suffered some kind of post traumatic event. He insisted on going to all my appointments with me, which should have been fine and supportive, but because of his \"condition,\" were anything but. I spent all my energies, holding his hands and running interference between him and the hospital staff. While I was in the actual surgery and he had to wait in the lobby, security was called. It was an awful day, but I called another ride home for us, and we made it through.  Until my surgeon called to report that they didn't quite get enough margins, there was a micro invasion in the duct wall, and we'd repeat the surgery and take a lymph node while we were at it. You'd think I'd be dreading the repeat, but all I could think was how could I get my husband through it. Well, the stress finally did get to me and I became very resentful. How to explain that his \"support\" was extremely stressful, and could he please let me get through the 4 hour pre-op first before coming to see me through surgery. No way. I considered going without him completely, but could not do that to him in the end. I know this is happening to him as well as me. But, after actually being his advocate through all his health issues, I thought it was my turn, for a little while, to be off the hook. I paid a friend his daily work wage to come sit with him for eight hours while he fretted, cried, slept, and paced. At least I was not a witness to the drama.  We continue to fight over this. He does not see his behavior as difficult or impacting on me and thinks I am hateful and selfish for trying to set boundaries. He announced to me last night that he wanted to go with me to all my radiation treatments. ALL OF THEM. He would ride with me and wait in the lobby. I would \"just have to get used to it.\" He was \"going to support\" me. I had been fine with the idea that he go a few times at first to understand what was going on, but I lost it when faced with six weeks of dealing with erratic behavior during MY treatment. I feel crazy saying it, but it is my disease, isn't it? I knowweare having to deal with it, but shouldn't my wishes account for something - even if they seem stupid to anybody else? I'd feel so much better if I could just go without making a production out of it.  Sooo, how is your husband handling the crisis of almost maybe losing you? Did he ever let up? Has your relationship suffered irreparable harm? Are you doing okay, or do you still feel depressed and exhausted? Did you find support? I so hope so. Id like to hear from you or anyone else who'd like to respond.",
    "MessageIndex": 5,
    "PostDate": "20/12/2013",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71214,0.htm",
    "Title": "Husbands"
  }]
}