{
  "AuthorID": "Joan_S_2",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joan_S_2",
  "Posts": [
    {
      "AuthorID": "Joan_S_2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joan_S_2",
      "Content": "Dear Amy, I can not offer any advise on treatment. I have not had experience with this type of cancer. Mine was Ovarian, Stage 3, last Sept. 03. I am sending you and your mom all my prayers that she will have a positive response to treatment. She is only 2 years older than I am...and I honestly know how difficult this time in hers and your life must be. I have heard lots of people connecting with MD Anderson and the NIH (national institute for health, I think). Is your mom's doctor a specialist in this area? You did not say whether she has had surgery for any of these tumors. And most importantly, how is your mom handling all these issues and treatments? A couple of other good resources online are the acor.org and thewellnesscommunity.org - give them a try for referrals. Please keep us posted on where you go from here. I'll give you any new information I can find along the way, and pray for your family and your mom. JoanMarie",
      "MessageIndex": 1,
      "PostDate": "07/12/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1418,0.htm",
      "Title": "Metastatic Breast Cancer-brain, Liver, Lungs"
    },
    {
      "AuthorID": "Joan_S_2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joan_S_2",
      "Content": "Thanks Amy for your reply. I am so glad she has an appointment coming up soon, and especially glad she has you to be with her. That makes all the difference...Take care, big hugs. Joan Marie",
      "MessageIndex": 3,
      "PostDate": "08/12/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1418,0.htm",
      "Title": "Metastatic Breast Cancer-brain, Liver, Lungs"
    },
    {
      "AuthorID": "Joan_S_2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joan_S_2",
      "Content": "I wanted to respond to your question although I don't know if my answer will help you too much...I was diagnosed with stage 3 ovarian cancer, a rare and aggressive type, end of September last year, now in remission CA-125 less than 1. My sister had breast cancer 5 years ago and is also in remission, and my aunt (76) had breast cancer 10 years ago (since died of other complications). It probably will depend on the treatment you received for the breast cancer. If it was surgery and localized radiation, then, Yes, you could possibly be diagnoised with ovarian too. Were you? My oncologist said that I didn't need a mammogram while I was getting chemo because nothing would be growing during that time. I have scheduled a mamogram for next month since my chemo treatments ended mid February. JoanMarie ~sending you a hug and prayers.",
      "MessageIndex": 1,
      "PostDate": "16/06/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1162,0.htm",
      "Title": "Link Between Breast Cancer and Ovarian Cancer"
    }
  ]
}