{
  "AuthorID": "joanne45",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joanne45",
  "Posts": [{
    "AuthorID": "joanne45",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joanne45",
    "Content": "  On 3/28/2008 phoenix23002 wrote: Hi Charlotte Marie... I admire your bravery w/tamoxifen.  I was diagnosed with stage 2 breast cancer 12/05.. went to a breast surgeon instead of an oncologist, had a lumpectomy, then a mastectomy (they didnt get it all with the first surgery & I have small breasts sooooo.. just took it all out).  My lymph nodes were clear (I 'bout fell out when they told me that.. couldn't believe it).  By the time I got to an oncologist (May,'07), I had no symptoms & no need for radiation or chemo (I was dreading that).  Point being, I so agree with Shemay's suggestion. I have been on Avemar & AHCC since Jan.06. I was a sick, sick puppy in Dec.,dramatic weight loss,  nite sweats, dark circles under my eyes, soreness under my arms (lymph nodes), exhaustion, coated tongue, felt awful.. you name it.  It was March when I felt things turning around.  Oncologist wanted to put me on tamoxifen but I demurred and continue with the Avemar & AHCC (and noni and folic acid, vitamins, etc). If you decide to take the Avemar, please be careful of where you buy it.  It is relatively expensive and requires careful handling and NO refunds.  It must be fresh &  kept below 80 - 84 degrees.  I buy from Better Health International in Florida.. ask for Pat or it can be purchased online.  I like to call my order in & talk to somebody to make sure it is packaged properly & shipped post haste !!!...lol..I have no interest in Better Health, don't work for them.. etc. I have tried other places & got royally ripped off by a few of these other companies;out of date product, improperly packaged (warm, warm, warm when I got it) etc. If the product is not fresh & kept cooled, you are left with some very expensive wheat powder..lol.  Do.. do your research, keeping in mind that cancer is basically & fundementally (sp) a failure of the immune system and anything that you can do to lessen the toxic load on the body & boost the immune system is a plus.  Your body is always fighting to be well & healthy and you need to help it all you can.  I still go to the oncologist for checkups (just went to six months my last ckup) and do continue with your oncologist.  Good luck to you and if you need additional info on Avemar, there is lots of info on line or I will be glad to share my experience with you.  :)  Tyra Hi, Have just started Tamoxifen but read your message with interest. I ahve always to know more about alternative and complemetary medicines and I too came across the name Avemar a few months back and talked to my surgeon who had never heard of it. I talked to my 2 oncologists about what vitamin and minerals to take but they just say eat a healthy diet. Any suggestions on how I can boost my immune system would be helpful, thanks. Also the address of wher I can bury Avemar please. Could I take that with tamoxifen? My cancer was stage 3, HR++, had not spread to sentinel node and was 1.3cm. I had a lumpectomy and am just about to start radiotherapy in August.  Joanne",
    "MessageIndex": 3,
    "PostDate": "09/07/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22289,0.htm",
    "Title": "tamoxifin"
  }]
}