{
  "AuthorID": "JoAnn_M_3",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JoAnn_M_3",
  "Posts": [
    {
      "AuthorID": "JoAnn_M_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JoAnn_M_3",
      "Content": "Hi, Catherine, I was diagnosed in 1996 with breast cancer that had spread to my bones. First my doctor had me take Tamoxifen for 5 years. That tricked the hormones for a while. After Tamoxifen he put me on Arimidex. It's been about a year and now that is starting to fail. But, he said \"not to worry...there are many drugs in the pipeline to deal with my type of cancer.\" AND THERE ARE NEW BREAK-THROUGHS IN CANCER RESEARCH ALMOST EVERY WEEK NOW! THE CURE IS IN SIGHT! Good luck and God bless you.",
      "MessageIndex": 1,
      "PostDate": "27/08/2002",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,433,0.htm",
      "Title": "Hormone Therapy for Metastatic Breast Cancer??"
    },
    {
      "AuthorID": "JoAnn_M_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/JoAnn_M_3",
      "Content": "Hi, Leanne, I was diagnosed with breast cancer in 1996. It, too, has metastasized to my bones. First, my doctor had me on Tamoxifen for 5 years. Then, when that drug stopped working, he put me on Arimidex. So far, that's it. He said there are many more drugs we can use after Arimidex stops working. Tests show I have small spots of cancer on a few ribs and lower spine. I don't feel any pain. I see my doctor once a month, they take a blood sample to make sure the drug is working. I pray a lot. I'm hoping that \"magic bullet\" for our type of cancer comes along soon! I'll keep watching this spot for more answers to your questions so I can also learn more answers. -- Jo Ann",
      "MessageIndex": 1,
      "PostDate": "19/08/2002",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,591,0.htm",
      "Title": "Secondary bone cancer"
    }
  ]
}