{
  "AuthorID": "joanhenry",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joanhenry",
  "Posts": [
    {
      "AuthorID": "joanhenry",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joanhenry",
      "Content": "I was diagnosed in March of 2006, had a lumpectomy in April and radiation treatments in the summer of 2006. My cancer was stage one, so I have always felt \"like a weenie\" when I read the letters from 37 year old women with metastatic cancers. I have been taking arimidex faithfully for 18 months now. I have always been healthy and exercised religiously - I really didn't notice too many side effects ( no hot flashes so far )at the start of hormonal treatment, but the achy muscles and joints are beginning to really slow me down. I am 62 and was previously able to do pretty strenuous exercises and work around the house extensively, but in the last 3-4 months, my quality of life has decreased dramatically. A good nights sleep is to be treasured and usually only comes after taking a nice hydrocodone tablet which I received after a little shoulder surgery this past summer (which may have not been necessary had I been aware of the side effects of arimidex). I miss jogging and step aerobics - yoga classes are even difficult to complete. I manage to jog very slowly for about 2 miles several times a week - lifting weights has become hard for me and I just don't feel like much activity at all. After taking a trip, I am exhausted - eating out and not drinking enough green tea (my newest dietary addition) ?? I don't know. I also have recently read that vitamin D3 is supposed to help mitigate the joint and muscle pain of women on aromatase inhibitors. I live in South Texas and perhaps one problem in the winter time is that I don't get the sun exposure that I get in the summer. Well, I, too, am going to see my oncologist next week and will certainly make my discomforts known. I tend to be the compliant, non-complaining patient, but not this time!!",
      "MessageIndex": 2,
      "PostDate": "01/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16021,0.htm",
      "Title": "Aromatase inhibitors"
    },
    {
      "AuthorID": "joanhenry",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joanhenry",
      "Content": "This is a great forum!! Here's my story: I was diagnosed in March of 2006, had a lumpectomy in April and radiation treatments in the summer of 2006. My cancer was stage one, so I have always felt \"like a weenie\" when I read the letters from 37 year old women with metastatic cancers. I have been taking arimidex faithfully for 18 months now. I have always been healthy and exercised religiously - I really didn't notice too many side effects ( no hot flashes so far )at the start of hormonal treatment, but the achy muscles and joints are beginning to really slow me down. Early on with the arimidex, my bp also went up, so my doc put me on a stronger medicine. (my oncologist told me that was not a side effect of the medicine) - I am 62 and was previously able to do pretty strenuous exercises and work around the house extensively, but in the last 3-4 months, my quality of life has decreased dramatically. A good nights sleep is to be treasured and usually only comes after taking a nice hydrocodone tablet which I received after a little shoulder surgery this past summer (which may have not been necessary had I been aware of the side effects of arimidex). I miss jogging and step aerobics - yoga classes are even difficult to complete. I manage to jog very slowly for about 2 miles several times a week - lifting weights has become hard for me and I just don't feel like much activity at all. After taking a trip, I am exhausted - eating out and not drinking enough green tea (my newest dietary addition) ?? I don't know. I also have recently read that vitamin D3 is supposed to help mitigate the joint and muscle pain of women on aromatase inhibitors. I live in South Texas and perhaps one problem in the winter time is that I don't get the sun exposure that I get in the summer. Well, I, too, am going to see my oncologist next week and will certainly make my discomforts known. I tend to be the compliant, non-complaining patient, but not this time!!",
      "MessageIndex": 8,
      "PostDate": "01/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18785,0.htm",
      "Title": "Side Effects - Arimidex"
    }
  ]
}