{
  "AuthorID": "Jodie (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hello,  yes I had the same experience when I had my port in..I had treatments in 2001, as soon as I was finished with my last chemo treatment I asked to have it removed because it was so uncomfortable and I didnt want that constant reminder of what I had just experienced from the chemo..brutal stuff!  Anyway, it did pinch, and I could not sleep on that usually preferred side, I had to take coumadin blood thinner which also made me nauseated...it was a trip to remember for sure.. but I have been in remission for 6 years until just recently, on a routine chest xray which led to a ct scan, which led to a Pet/ct scan...I have been re-diagnosed with br. ca. mets in right lung, sternum and clavical lymph nodes, and a spot on my spine..havent gone to oncologist yet to get on with what I know is ahead of me treatment wise.. I dread it if they have to reinsert one of those ports in me...I had a bad experience with the other one in 01, the catheter line into the chest vein decided to migrate north and to the left, and it got kinked and I had to have an emergency procedure similar to an angiogram for them to go up inside my groin and blood vein to retrieve this line  back down straight into the vein the way it was suppose to be..the doctor said this was the first time he had ever seen that happen to anyone..so needless to say, I am reluctant to have another one put in for anymore treatments..what a mess!!!  So, I just wanted to answer your question with a big YES...they do cause discomfort..but I guess it is the only way to administer some of that toxic medicine safely into our system..so it can go kill cancer... good luck, hope you do well in your fight otherwise..  ",
      "MessageIndex": 1,
      "PostDate": "21/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14354,0.htm",
      "Title": "BardPort Implanted Port w/open ended catheter"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 7/9/2008 tomslady wrote: I have recently been dx with invasive ductal carcinoma of the left breast. Had the lumpectomy and setinal lobe disection last week and now have to wait until next week and meet with the oncologist to find out what the next step is going to be. My husband has been very supportive through all this but i feel guilty putting him through this. We have been married just over a year and now all this. I don't know that I want to go any farther with treament. I have been cut open 4 times in the last 6 weeks and I am feeling very sick when i look at my scares, I know they are new and they will fade but right now I cannot even look at myself in the mirror without wanting to scream.  Intamacy has become a thing if the oast since all this has started and I think that is the hardest part of all this, I need to feel close to my husband, i need hito touch me and love me the way he used to before I got sick. How so I relay this to him without pushing him. It is going to happen sooner then later that I will not physically be able to love him and feel close to him but now while I can he is scared. Does anyone have any advice for me or encouraging words of wisdom. I need something to hold on to right now.  Thanks for listening. Tomslady: I am sorry to hear that we have another breast cancer fighter among us now.  Everytime I see a new post on here of a new patient being diagnosed with breast cancer, I kringe!  I know how you feel.. no one knows how you feel like another woman going through exactly the same struggles and feelings.. but unfortunately we arent you because you are unique and all we can do is offer words of knowledge, comfort and support for what we know you are going to go through and have endured already.  What the other posters on here have said I totally agree with.. it will take time for you and your spouse to get to a somewhat normalcy in your lives again.. But if you both truly care and love each other no matter what..you will get to what will be normal for you now..  Your lives have changed..you can no longer go back completely to the way it was before..but it will be differant but it will be ok...!! I always think of that song, that Randy Travis sings, about time playing tricks on us memory wise and body wise and hair wise..and I love his answer in the song about I aint in love with all of that, I'm in love with you..Your spirit that makes you who you are..I'd love you anyway he sings..forever and ever amen!!!  So please!!!  give your selves the time to regroup and feel better when things on your body heals, and you will know then what you need to do to go forward with trying to save your life and except the new you as you are now.... if you dont try to control the cancer now, it can gain control of you and your life in a way that is not a good thing..  this is just a time out..and although it feels like it will last an eternity when you are going through the treatments it will have an ending to the tunnel and you will be better for it if you are able to gain some remission and quality down time away from your disease.. it CAN progress to the badest boy in the whole dang town if you dont try to control it now if its in an early stage..now is crucial if it hasnt metastasized..now is when it can be put under control.  Believe me..that is your objective and goal with this disease as soon as you have given yourselves some time to heal and think about all of this that has been thrown at you... .. this is a great place to come to if you have questions or concerns that you cant find an answer for..most of us on here arent professional medical people but we do have our own cancer fighting experiences and wisdom is wonderful when you are up against a disease that scares the beegeebers out of you.. I have been fighting it since 01..I was in an early stage 1 then..I had lumpectomy/axillary disection/chemo/radiation..I was able to gain a 6 year remission time before it has now come back as stage 1V..I have fought it again..lost my hair again..it has grown back again..and now I have been given good news that the cancer is in remission for now.. so there is good along with what is bad inspite of this breast cancer fight....   I'm sure your husband will love you anyway no matter what changes your body has endured through out this ordeal.  You are still breathing, talking, and walking and I'm sure his best friend in this whole world...so please, God's blessings to you now, and I hope you can see it on to the next round of doing what ever you need to, to fight this monster..cause it aint gonna give up trying to make you sicker than you are now...most of us do have  to fight to gain any control over its ability to reek havoc with us.. Put on your boxing gloves and get ready for this round what ever it consists of.. you can do it!  The only other choice is to give up and let the cancer get worse in your body and spread to places that can make things worse..  alot worse than you have seen it so far..  you know that saying..if you think things cant get any worse they usually do and can..so I hope for you, that you will choose to fight.. take control...get a good team of dr.s..ones that will listen and allow you to play a part in your treatment options.. read/read/read...become informed on everything that involves your situation..  keep records, copies of xrays, reports, everything that will help you become an informed patient..and a SURVIVOR!!!! My best to you and your family..let us know how you are doing! God's blessings..always Jodie",
      "MessageIndex": 4,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25872,0.htm",
      "Title": "not sure if I can fight this battle"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Thankyou for the response..now I am wondering about having this other biopsy, it is pretty invasive in nature..and if this is a benign thing, seems like alot to go through for that..I am having a bone scan this monday, so if the hot spot that lit up on my spine comes back as something other than degenerative in nature then i guess i should proceed, but if it says it is just arthritis then maybe these lymph nodes can just be watched..if it is infection instead of br.mets then it will eventually go away on its own or with antibiotic help..I have been reading about this mediastinoscopy procedure and it sounds brutal..but I am so confused about the findings on the pet/ct...one day its 99%accurate on finding malignancies and then the next its not?  So anyway, thank you for letting me know about your experience..sometimes talking to another who has had similar experiences is all we have as far as deciding the best course of action where this cancer fight is concerned..we want to stay ahead of it if we can, I am 6 years out from my original br. ca. fight and so far it has been smooth sailing..no hormonal drugs or anything, I just figured the original treatments did the job pretty good, I told my onc. that maybe I was one of his good statistics...he smiled and said..\"maybe\"..  and when all of this has come up now, it has made me question that remark I made.. thankyou for responding.. jodie",
      "MessageIndex": 3,
      "PostDate": "28/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14770,0.htm",
      "Title": "seen the dr. today, now I'm confused?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 5/14/2008 creeocean wrote: Hello,  I'm new to this site. May 9th was my one year anniversary.   On May 9th I was informed that I had stage 1 BC.  Three short weeks later, on May 28th I was informed that the BC had metastatised to both my lungs after a routine CAT scan was conducted.    I was treated with 4 FEC-100, then 3 taxotere.  both treatments reduced the nodules on breast and lungs.  I then went on herceptin [once a week] for 8 weeks.  Unfortunately the herceptin didn't work.   I am now on my 4th FEC-100  with 2 more rounds to go.   Again the some of the nodules on lungs are reduced.   After the FEC, my doctor recommends a break from chemo.  But I am scared.  If herceptin doesn't work, what other protein options are there.    Any body out there in a similar circumstance.   dear creeocean: your situation sounds almost identical to mine..I am also her2 positive with neg lymph nodes and have also found myself with mets to lungs.. mine was originally diagnosed in 01 though, and I have had a recurrence which has come back as mets to lung area.. this was a shock to say the least!  I have taken three months worth of herceptin in hopes that it has helped me, wont know until after my pet scan next week?  Your situation makes me a little uneasy now hearing that it didnt work for you..I know though that we are all differant and our cancers respond differant to the meds.. I have never heard of the other kind that you mentioned..the Fec-100.. I did take several months of the taxotere with avastin, which proved to be somewhat successful in shrinking and disolving the tumor they found on xray in my lung.. I also had bc mets to most of the lymph node chain in my lung area..and so far it has gotten better too.. there was still some activity in one of my bronchial tubes and I will know next week if the pet scan shows if it has improved or not.. sorry I really cant help you with more knowledge or any other meds for you to try if your dr. suggests something else..  my circumstance is very similar to yours though with the mets to the lung..  how many nodules did they find?  Wishing you much success and good wishes your way in your br. cancer fight.. Jodie",
      "MessageIndex": 1,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24033,0.htm",
      "Title": "her2positive estrogen neg"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 5/17/2008 Jodie wrote:   On 5/14/2008 creeocean wrote: Hello,  I'm new to this site. May 9th was my one year anniversary.   On May 9th I was informed that I had stage 1 BC.  Three short weeks later, on May 28th I was informed that the BC had metastatised to both my lungs after a routine CAT scan was conducted.    I was treated with 4 FEC-100, then 3 taxotere.  both treatments reduced the nodules on breast and lungs.  I then went on herceptin [once a week] for 8 weeks.  Unfortunately the herceptin didn't work.   I am now on my 4th FEC-100  with 2 more rounds to go.   Again the some of the nodules on lungs are reduced.   After the FEC, my doctor recommends a break from chemo.  But I am scared.  If herceptin doesn't work, what other protein options are there.    Any body out there in a similar circumstance.   dear creeocean: your situation sounds almost identical to mine..I am also her2 positive with neg lymph nodes and have also found myself with mets to lungs.. mine was originally diagnosed in 01 though, and I have had a recurrence which has come back as mets to lung area.. this was a shock to say the least!  I have taken three months worth of herceptin in hopes that it has helped me, wont know until after my pet scan next week?  Your situation makes me a little uneasy now hearing that it didnt work for you..I know though that we are all differant and our cancers respond differant to the meds.. I have never heard of the other kind that you mentioned..the Fec-100.. I did take several months of the taxotere with avastin, which proved to be somewhat successful in shrinking and disolving the tumor they found on xray in my lung.. I also had bc mets to most of the lymph node chain in my lung area..and so far it has gotten better too.. there was still some activity in one of my bronchial tubes and I will know next week if the pet scan shows if it has improved or not.. sorry I really cant help you with more knowledge or any other meds for you to try if your dr. suggests something else..  my circumstance is very similar to yours though with the mets to the lung..  how many nodules did they find?  Wishing you much success and good wishes your way in your br. cancer fight.. Jodie P.S.  I meant to say that I was also negative for the hormone status of my br. cancer.. sorry Jodie  ",
      "MessageIndex": 2,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24033,0.htm",
      "Title": "her2positive estrogen neg"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 5/29/2008 creeocean wrote: Hi Jodie. Thank you for replying to my message.  I hope your pet scan shows improvement on the lungs.   The chemo treatment I have been on is F=flourouracil, E= Epirubicin, C= Cycloophosphamide. I have been told that I have multiple tumors on both lungs, In my mind I imagine it would look like measles.  I never asked to look at the scans, coward that I am.  I don't think I could handle that. I really hope that the herceptin works for you.  I will keep you in my prayers.  Once again thanks for the info.  Donna  Creeocean: I went to dr. yesterday after having the petscan the 21st and miraculously I have been put into REMISSION...yeah!!!  That was the first time the dr. said the word to me..  my petscan was normal..  I still have to continue with the herceptin for a year..he offered me the tykerb but since I am having good results for now with the herceptin I didnt see a since in switching to the pill right now.  I was so elated when I came out of the dr. yesterday..  I felt like I was walking on cloud all the way home..  havent had that since of peace of mind since last spring before I found out about the mets and recurrence..  I have reached the silver lining for now..just hope the herceptin continues to work and my heart doesnt give me fits to stop taking it..  the tykerb is not suppose to be as toxic to the heart as the herceptin so I do have that option to fall back on if the herceptin becomes not an option for me.. they didnt have to surgically remove the lung nodule, it was disolved by the taxotere treatments last fall..  in Jan. I still had some residual tumors in my bronchial tube and neck lymph nodes and the taxotere has even resolved those issues.. so for now, i am good to GO!  and I will!!! thankyou for your response to my message, it was very informative..I like chatting with other ladies on here who are having the same issues..dont like hearing that so many are but at least we have somewhere to go to talk to others who are going through the same cancer aggravation and stress.. take care..God's Blessings to you all.. Jodie",
      "MessageIndex": 6,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24033,0.htm",
      "Title": "her2positive estrogen neg"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I was told today that I had my last chemo treatment..yeah!!!  but I am cautious as I have been told this before only to have to go back for more after my pet scan revealed more active br. ca. in lung area and neck ly.nodes.. I go the 5th for a petscan and then have to wait till the 13th for results from dr.  This part is grueling!!  I wish the scanning techs could give me a thumbs up or down if they see anything disturbing or if things are looking good!  But, I know they cant..it sure would alieviate alot of stress on us cancer victims..  I would like to know, now that I have mets. br. cancer..should I continue my mammograms?  I mean the br.ca. is now in my lungs and didnt even come back in the breast as a local recurrence. The cat is out of the bag so to speak, and whats the since in looking there for cancer when it is already in a place where it can end my life and is a harder battle to fight..prevention or screening for more in the breast now just seems like it would be unnecessary..even yearly pap smears now seem fruitless!  I already have a disease that can take my life in a couple years if it cant be controlled..just wanted to throw that question out there and see what others may think..am I being foolish to think this way about my health now..  I have written on here before about my br. cancer story..but it is still a shock to me that I now am fighting mets disease with it..I was so vigilant about my mammograms, dr. check ups, and was one in a million in the paranoia camp when ever something came up with my health that could be pointed towards a recurrence..and out of the blue last spring a cancer nodule was found in my right lung solely by accident when I had elbow surgery and a routine chest xray revealed a rather large nodule in my lung..a follow up pet was done along with a biopsy and br.ca mets to lung was found in August of last summer..I had a tiny 1.6ctmtr. tumor in 01, and was completely treated for it then..I had neg lym nodes, neg for hormones, pos. for her 2 expression..(was not offered any herceptin?) So now for the past several months I have been waging the battle again to get my cancer under control..I was given avastin/taxotere cocktails..I have stopped the coughing which was the only symptom that I had that anything was wrong with me..I had that cough for over 2 years, went to dr. and was misdiagnosed time and again with(gerd,sinusitis,pneumonia,sarcoidosis, etc.) I have been told that the lung nodule had to have been there for quite a while for it to finally get large enough to be seen on a routine xray..so maybe I have had this mets going on for that long..but it was supposedly aggressive br. can. in 01 just like it is now, so I dont know why it could have taken it that long to be seen?  Anyway, looking forward to my petscan and hoping for good news for a change..  hopeing to hear from others who may be going through this same walk, who have good outcome from the chemo regimen that I have spoke about.. love to hear from you.. Jodie",
      "MessageIndex": 0,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19804,0.htm",
      "Title": "finished with chemo for now...now what?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/20/2009 STILLATIT2009 wrote: I was originally diagnosed with Breast Cancer January 1998.   Had Chemotherapy - Mastectomy and Radiation Treatments  Was rediagnosed September 2003 - Metastatic Breast Cancer - Stage 4.  I have been basically on Chemotherapy since 2004 now. On an average day I am fine emotionally.  I work full time as I always have.  I have been off work at times for various reasons, i.e. surgery on my back in 2008, but I did find that after 3 months at home I was going nuts.  I originally joined a message board back in 1999, but stopped as I went into remission.  I thought about joining another message board, but it seems that everyone in the groups are either beginning treatment or are just finishing up.  In other words the train is moving with others, but I am standing still. Dear Still:  Sorry to hear you are having to deal with the mets now too!  Sounds like you have been dealing with it longer than I have.  I have been coming to this message board for 2 years now since my mets was found and treated.  I have had some good results, answers, and discussions with others on here who also are fighting cancers.  I was diagnosed in 01 with just a small breast cancer..it was treated with surgery, chemo & radiation.  In spring of 07 it was found in my right lung and I was diagnosed with mets to lung and mediastinal nodal area.  I was again treated for 6 months and then put on herceptin in the spring of 08.. I have had treatments with herceptin ever since.  I was in remission last fall, and so I went for a few months without the herceptin and from Aug to Jan my cancer decided to grow again..so again I went back on herceptin and I guess will remain on it for as long as my heart and body allow it or for as long as it continues to work on my cancer.  I am her2 positive, hormone negative.  It was a real shock for me to find that my cancer went from stage 1 in 01 to lV in 07 and it never even came back in the original breast or axillary lymph nodes.  The doc was even stunned at this although he says it does happen.  Sounds like you are dealing with alot of other things though beside the cancer.  Sorry to hear that.  But welcome aboard the message forums here at cancercompass.  Write back if you wish, I will talk and reply as well.  Gods Blessings Jodie",
      "MessageIndex": 1,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40867,0.htm",
      "Title": "Metastatic Breast Cancer - Spread to Liver"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "finally i seen the dr. today who ordered my pet/ct scan..she was on vacation and so I had to wait to get actual reports from her..she said that a pet/ct will light up other diseases in the lungs and body..the one I had done at the end of June, the report came back saying that alot of mediastinal lymph nodes, a pulmonary nodule, and a place on my spine lit up..and it was suspecting metastatic br. ca...well now I have been told that its still possible that the positive pet/ct could be something other than cancer mets...I am glad for that news,but am very confused now about the accuracy of the pet/ct findings.. they are going to now do a thoracic biopsy of the lymph nodes to find out for sure if there is a malignancy.  They did a needle ct biopsy of the lung nodule which came back negative..that nodule lit up on the pet/ct scan too.. could anyone having great knowledge of these scans answer my questions about this..are the pet/ct scans conclusive in picking up metabolic active cancer cells, and is this usually the only thing that will light up? thankyou..",
      "MessageIndex": 0,
      "PostDate": "27/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14770,0.htm",
      "Title": "seen the dr. today, now I'm confused?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 8/14/2007 Linda Lou wrote: Dear Victoria, My heart goes out to you for what you are facing.  We all live with the fear that the cancer will return.  I am sorry that you have to face this again.  You sound so strong.  I am sure you do not feel that way at times, but you still are.  I wish you the very best on your fight for your life.  I hope you get the very best of care and have family and friends to support you. Best Regards Linda L. Thank you LindaL. for your kind words of encouragement.. Yes I know we arent suppose to worry ourselves about recurrences, they put us in the paranoia camp when we do that, but I have always felt that someday it would return, and for some unknown reason I knew it would come back as mets instead of a local in the original breast it showed up, it is unreal...there was no ax. lymph node involvement in 01, no sign at all that it had already spread into my system before it was treated..I only had a lumpectomy in 01...no since in worrying about a mastectomy happening now...this cancer has already gone beyond that point of no cure with a mastectomy....it has gone beyond the word of cure completely now..it is learning and trying to live with it and keeping it from destroying the rest of my body...staying on top of it with cancer killing stuff... dont know what the next step will be as far as treatment goes..my original ca. was not hormone driven, so I was not on tamoxefan for the 5 years..hormone neg. br. ca. is usually hard to control because of that fact..so not sure if I will just have radiation or what?  Guess I will know tomorrow when I go for my first onc. appt..   I try to appear strong until the day gets here that I gotta face the music, then I sometimes fall apart...!!!! I have a great spouse who is very supportive, and have learned recently who my real friends are now....there has been an outpoor of people who want to help me get to treatments if needed...that really makes me feel Great and makes life worth fighting for.... Thankyou again for your reply...it is nice to hear from others on here who are probably facing the same stuff...life deals us lemons and all we can do is make lemon ade!!!   Right? Sincerely...Victoria  ",
      "MessageIndex": 2,
      "PostDate": "15/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15185,0.htm",
      "Title": "had biopsy 8/7/07...it is cancer again!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I had a mediastinoscopy on Tuesday of this week..had a solitary lung nodule with alot of mediastinal lymph node enlargement..and also hot spots that showed up on pet/ct back in July..so on 8/7/07 I had a biopsy procedure...the surgeon sent it off to pathology while I was still under anesthesia and when I woke up I was given the news that it was oppositive for cancer...not sure yet if it is breast ca. mets as i do have a history of br. ca. in 01..have been in remission since then, or they say it may very well be a new primary lung..wont know till this next week when I get the final results..have an appt. to see an onc. on Thursday the 16th..will know then how they are going to proceed with treatments and what kind I will recieve..this has been floating around in my body since January of this year so its no telling where it has gone to hide??  I almost didnt want to proceed with the mediastinoscopy because I figured it would be a benign finding and this procedure is alot to go through for a benign thing even though I would have been happy to have been given a diagnosis like that instead..but I had to know what this was raging in my lung and chest lymph nodes..I dont feel that sick now...it is unreal how cancer can sneak up on us like it does..all I have had is this chronic cough that was just brushed off as sinus drainage for so long that I had just accepted that this was just me...sorry,  had to put some of my thoughts into words here..so now its on to the next step and on to what I will ultimately be facing for the rest of my life..   I have to have another chemo port put in, as I had the one in 01 removed after treatments ended then..I was not wrong in making that decision..that one was flawed as to how it was put in, and it caused me trouble..so this next time going in I will make sure they are aware of my past experience with the old port so they will hopefully get it in better this time...  well, all is well that ends well I guess..  here I go again...in the fight for my life for real! Victoria",
      "MessageIndex": 0,
      "PostDate": "11/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15185,0.htm",
      "Title": "had biopsy 8/7/07...it is cancer again!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/19/2008 donnalynn wrote: I was originally diagnosed with stage 2B, ER+, Her2Nue + breast cancer less than 2 yrs. ago. I had chemo(Adriamycin and Cytoxin and then Taxol, following by Herceptin for a year. I also had radiation for 6 weeks. I am on Arimidex at this time. I had a CT scan done last week for reasons not pertaining to my cancer (it was actually a coronary artery calcium screening) due to my now having high cholesterol. Anyway, during the CT scan some non-calcified nodules showed up on my lung, along with a small lesion on the liver.  These are small and my internist suggested to me to wait 4 mos and have another CT scan. The lesions were less than 4mm. Just wondering if anyone else has had anything like this show up. I can't help but worry that this is a metastasis and don't know if I should push the issue of further test at this time or if it is safe to wait and see if they are growing?   Hi: Sorry for your great concerns..I know how frustrating these things can be. I would be like you and not want to wait 4 whole months to see what happens.. Sounds like your cancer has the same her2 gene that mine has..and this makes it an aggressive variety unfortunately.. dont want to scare you though.. my mets showed up from a routine chest xray last May because of orthopedic surgery I was being prepared for.  I pressed my primary dr. to do a ct. scan and the nodule in my lung showed up again..I should have mentioned that it showed up on my routine xray..and for a nodule to show up on an xray it has to have been there for a little while.. it was only 11mm..  the dr.s of course wanted to do this wait and see stuff too.. but thankgoodness my primary dr. could see how uptight I was about it and he sent me for the ct scan..then when it showed up again he sent me on to a pulmonary dr. which then did a pet/scan.. and the nodule lit up..meaning that it was showing cancerous activity in several places...I was then sent to a surgeon for a biopsy of the lung nodule he instead sampled the medistinal lymph nodes that were lighting up and the diagnosis came back as br. ca. mets to lung & surrounding lymph nodes and in my neck area..  I have been on chemo since last Sept. and so far the meds i am given has resolved most of the cancerous activity..but because I also have the overexpression of the her2 gene I now have to have herceptin treatments to keep this monster from getting out of control.  I have found out that once the cancer has become this her2 gene overexpressed that it will continue to be such through out the fight of my cancer..  So if I were you and if you can, I would press on and find another dr. who will take this more serious..especially when there is a nodule on the liver too.  So far mine has been contained in the lung area..and that is where my dr. is trying to keep it..  So please for your own sake..go forward with this investigation and try not to wait the 4 months they are saying..  her2 gene overexpression is nothing to ponder about..I have learned that now..  an education is a wonderful thing and as we experience this stuff the more education we get on the subject.. good luck to you..let me know what you find out.. blessings your way.. Jodie",
      "MessageIndex": 1,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21114,0.htm",
      "Title": "Lung nodules on CT scan"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Patti46 Yes it does sound like we have been hit with the same sneaky monster..my original b.c. was hormone neg. and node neg.  So far only in lungs..the oncologist has set me up for cycles of Avastin and Taxotere..weekly..UGH!  sounds grewsome!  I have to have another port put in Tuesday coming up.  The old one I had removed the same month I ended my last treatment in 01..it caused to much trouble to leave it in.. Sorry to hear that yours is so extensive and has popped up in so many places at once..yes it doesnt seem to make since...all these scans and tests, nothing shows up for years and then bam!  The cancer says \"hello I'm back\"..  I hope you can get yours in control again..  the oncologist told me that he thinks he can with me since it is only in lungs for now..but it has been since first of May when the original lung nodule showed up and they havent done anymore xrays since then or since the pet scan that lit up everything..so there is no telling where it has been able to glide off to by now..?  I am starting to have alot of nausea, intestinal upsets, coughing is much worse..so I know my body is just now finding out there is something trying to invade it..up till now the only things has been a cough and just a run down feeling..I have changed oncologist, the new guys seems a little more attentive to my complaints and concerns..hopefully that will continue..I had seen my other onc. in April, had a mammogram, and nothing!  I did try to tell the other guy though that this cough seems to want to hang on, but he didnt take notice or sound concerned..my primary dr. has been really good about sending me for xrays at differant times..but nothing showed up then..  This was all discovered by accident when I had surgery on my left elbow for tendonitis..they did prescreen xray 1st of May and that nodule was there..from there my primary sent me for a ct, then that showed something so he then sent me to a pulmonary who then investigated further with a pet/ct which lit those areas up really good..then I had a biopsy in the chest and lo and behold, the cancer was there, and it is the breast ca. now come back in my lungs..  I always had a feeling that when it came back it would be this way..funny how we have a sixth sence about things like that..so anyway, I am rambling, so it was good of you to respond and I thank you...it is nice to talk with someone who is going through a similar situation.  My prayers to you too..and I hope that God is watching over you and your family.. Jodie",
      "MessageIndex": 3,
      "PostDate": "01/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15573,0.htm",
      "Title": "It is breast ca. mets..now what?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I have had 9 herceptin treatments since March of this year and last week I had another pet/ct scan done.  The results are not good at all!  Instead of keeping the tumor I had from growing back or having a recurrence..I now have the initial tumor along with a new one that is in my left lung now.  It is 2.4 centimeters.  In May I had a pet/ct and it came back good or supposedly good with no active disease..so all these months I have had a false since of security since I have been taking the herceptin which was suppose to be controlling my disease progression..apparently it hasnt and now I find myself in a state of shock!  I figured it would be at least a year before I would be facing anymore active cancer bouts.  I am stage lV and learned of this last year in May of 07..  I had several cycles of the avastin and taxotere..apparently that really didnt do much either for this disease to grow a new tumor in just 7 months, actually this 2.4 tumor has grown this size since May..  I see the dr tomorrow and I guess he will have another avenue of treatment for me to try..UGH!!!!  I sure wasnt wanting to go down this road again this soon.  Just got my hair back in good..not worried about it, I know it will grow back but I just wasnt wanting to loose it again this soon.  I guess this is going to be a forever up hill climb from now on..guess I just shouldnt let myself get that comfy in thinking the cancer is going to stay away and be that easily controlled.  I am feeling very frustrated right now..  I thought surely the herceptin was going to do the job in keeping the cancer in control..  oh well..guess I was wrong?  The herceptin gave me a false since of security..I know it works on others,  because I read your success stories all the time..guess my disease just wants to be stubborn..    Oh well, on with the next step I guess? So much for the clowning idea?  It will have to be put on another burner for now. Jodie",
      "MessageIndex": 0,
      "PostDate": "16/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28322,0.htm",
      "Title": "herceptin isnt working!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I went for follow up today to the surgeon who diagnosed this br. ca. mets to lung..at first they werent sure if it was a new lung ca, or the old br. ca. that has metastasized...well now I know..not sure now which way the oncologist will go with my treatments..I have 2 lung mets, and a lymph node in the upper right lung that is also involved with cancer mets..Isnt it strange that I never had any axillary lymph involvement from 01 to now, have not had any recurrence in the local tumor site, and the original tumor was only 1.6cm.  Isnt is so strange that it is now mets to the lung...?  It may also be in my spine, not sure about that yet, had an MRI today so we will see I guess..  hopefully it is just confined to the lung, and they can treat it there..has anyone else ever heard of mets from such an inconspicuous occurence?  I have been vigilant about following up with a cancer dr. every year since my initial diagnosis..   Isnt cancer sneaky? Well just had to reach out to others with similar experiences..back in April I made a comment to the dr. during my yearly follow up that since it had been 6 years since my original cancer, that maybe I was one of his success stories..so much for that!   Right? Can anyone tell me what my future treatments might intail?  My original ca, was neg. for hormones, so hormonal is out of the question,  and not sure if it is in bones yet so not sure about the bone chemical treatments, so what is left?  Radiation, chemo, surgery or all of these three?  I will know next week for sure, just wondering now about it..???  Jodie",
      "MessageIndex": 0,
      "PostDate": "23/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15573,0.htm",
      "Title": "It is breast ca. mets..now what?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 9/19/2008 Palmcoast wrote: Know how you feel. I had stage 3 breast cancer. Had adriamycin, cytoxan and then taxol. Surgery. Then was told I was all better. Had a rash during treatment and asked if it could be cancer and was told no. After 6 months of different creams (it was only the size of a pea) went and had it tested and now stage 4 and incurable but treatable. Have tried xeloda, avastin, herceptin, navelbine and now gemzar. Herceptin was also along with some of the other meds and it is not working. Will be two years next month. If we find something that is working I will let you know.  The only way to get through the day is to enjoy it and laugh. I find it harder to get another day under my belt if I focus on why me. Hope something kicks in. God Bless Sue God Bless you Sue: Thankyou for your post..  I went to see the dr on Wed of this week and he walks in to the room with a smile which of course is always nicer than a frown..but he sits down and proceeds to tell me that the scan looked good??????  I sat there with a puzzled look on my face cause I knew what the pet scan said and it was very specific in saying that the 2.4 new nodule in lower left lung must be considered malignant unless proven otherwise.. so I knew the dr was feeding me a line of crap!  Plus the areas that were of concern before I was given chemo last fall were still suspicious and persistant and recurrent according to this scan report.. I had an extensive biopsy surgery last year and so I know and they know they found cancer in my lung..and so now with this new nodule the dr is wanting to glance over it with a smile and say oh..everything looks good!  I had to tell him that I didnt agree with that analogy and that I felt the herceptin had failed to work and he denied that idea but of course told me that I had to then go back on harsher chemo taxol with avastin..ugh!!  I'm not ready for more of that stuff.  He suggested a ct guided biopsy..I have been there and done that too and that was the most torturous thing I have ever had while being awake while they did it.  It felt like they were sticking an ice pick in my back and lung..so I quickly said no to that idea..  I dont understand why there is a need for a biopsy when they found cancer in there last year that is a mets from the breast cancer.. am I going to have to have a biopsy everytime they find a new nodule in my lung or when is it going to be safe to assume (which I dont like assuming anything) that these nodules are new cancer progression..  I of course want to stay on the herceptin..it is the easiest form of chemo that a person can or will have to endure.  But if it isnt working..they need to acknowledge this too..right?  The dr wouldnt?  Anyway, I am now trying to decide on weather to go forward with more of the ugly chemo or just take my chances that this new nodule is a cyst(?) and have them check it again in a few months to see if it went away.. I never have been a good gambler.  So thankyou Sue for writing..I know exactly how you are feeling.. sounds like you have already had the taxol..that is what the dr wants to put me on now.. was it mean to you?  He also mentioned the xeloda or tykerb but said I would have to put ointment on my hands and feet because of the burns caused by the xeloda..dont think I want that at all!  Anyway, thankyou..and keep in touch if you want to.. sincerely...and God's blessings your way as well. Jodie",
      "MessageIndex": 3,
      "PostDate": "19/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28322,0.htm",
      "Title": "herceptin isnt working!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 1/15/2008 jay horses wrote: wellll i may have a recurrence in lung/chest area. will get more scans in few weeks,it probably happened from 18 pos lymph nodes. i know this serious anyone have any input? thx jay Dear Jhorses: sorry to hear about your possible mets. recurrence..I know the waiting is the hard part right now..your mets could have been from the pos.lym.nodes..but I have found because of my own br.ca. that it doesnt always follow a rule of thumb in order to rear its ugliness again in our bodies.. I have mets to lung and medistinal lymp.nodes(they surround the lungs) and also up in my neck area..it was found solely by accident when I had surgery last summer on my elbow..a routine chest xray discovered a nodule which led to a biopsy and which led to the mets findings..my orig. br. ca. fight began in 01, with just a tiny 1.6 cent. tumor..surgically removed then and followed up with chemo&radiation..I was axillary node neg. hormone neg. but overexpressed on her 2..a local recurrence is what I watched for..well it snuck up on me like a sneaky monster..never had an inkling that I had anything going on in my body except for a cough that just wouldnt go away.. My onco dr. just didnt believe that it was my br. cancer that had come back, he said it shouldnt have taken it 6 years to do so since it was an aggressive kind of stuff..but it did..it didnt follow any of the normal protocal for recurring without notice..it was not a textbook case at all..so cancer is differant in everyone..we are as unique as the cancer that invades our bodies.. I had my last of a 4cycle of chemo today..hopefully..I will have a petscan on the 5th of Feb. and then see the dr. on the 13th for results..if cancer is gone, no more chemo for now..if it is still actively getting around in my body and causing trouble then more chemo..(yuk!)  My heart goes out to you.  Yes if it is mets then yes it is more serious, but if they get mine under control then they should be able to for you as well.  I was a sceptic at first..didnt think the treatments would be able to help me..but something has caused my coughing to cease, and the tumor in my lung has disappeared..so now i can say good things about the avastin and taxotere that my dr. put me on..and it was a low doseage, and I havent been all that sickly..just bouts of things here and there that were very manageable..  SO, cheer up, and I pray for good news when you get your scans...but if the news isnt good, then know that there is medicine that will calm your feers..mets carries a high mortality rate, but hopefully if it responds to treatment it can be controlled for a while before things get really bad..our bodies can take alot before they finally say enough..I am a firm believer in that now.. take care..God's Blessings your way..with lots of prayers too! Jodie",
      "MessageIndex": 1,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19761,0.htm",
      "Title": "mets to lungs"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 3/22/2008 gardengirl wrote: I will be starting  XELODA treatments for my breast cancer soon and would like some feed-back from anyone taking this medication.  Did you do well on the drug, how long were you on it etc.?  gardengirl Isnt this the chemo pill?  Just curious too because I have read that this chemo is in a pill form and it is in the same family with the avastin and herceptin as far as medicines and does the same to the cancer trying to grow and spread..  I am presenting having herceptin treatments..actually I had my first one last Wednesday.. I was expecting the worst side effects but so far not to bad..  If the xeloda is the same type of antibody that the herceptin is then hopefully the side effects are also mild..  I hope so, as I have been told that if this herceptin works to keep my cancer at bay then the dr. is going to try me on the pill form of it, and with what I have read this xeloda is the pill form..  so let us know how you are doing on this medicine..  I have the overexpression of the her2gene and it sounds like you may have also?  Best wishes.. Jodie",
      "MessageIndex": 1,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22249,0.htm",
      "Title": "Xeloda chemo treatments"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/17/2007 annalittlebit wrote: I was diagnosed with breast cancer in 2003--I underwent surgery for one breast, chemo and radiation. I have been taking arimidex since. Although I try not to dwell on the possibility of recurrance I find that sometimes I worry a great deal about the cancer coming back.  I also think at times that I want to stop arimidex due to the side affects which I live with daily. Does anyone have input to , or share my concerns??  Please respond. I just stumbled upon this website this morning and am hoping it is a good place to be.  Friends who have not shared my experience cannot relate to my feelings on these matters. Dear Anna: It is a tough thing to go through life now with what will be a continuous concern about recurrence..I use to be the same way, and unfortunately when I did let my guard down this past spring and decided not to dwell on that recurrence possibility anymore...BOOOM!  A small lung nodule that was suspicious turned out to be br.ca. mets to my lung..and it has been 6years since my original br.ca. diag.and treatment..  I had a surgical procedure done on my left elbow, and the dr. did a prescreen xray of my chest, and the lung nodule showed up..the dr's kept saying oh, its just an infection or scar tissue from another pulmonary disorder they kept saying that I had..well my primary dr. did a ct scan, which also showed the nodule..that led me to a pulmonary dr. who then sent me for a pet/ct scan..well the lung nodule and several mediastinal lymph nodes lit up alot!then I had a surgical biopsy in August and low and behold it was now a fact that my original 1.6centimeter br. tumor which was a stage one with no nodes oppositive had indeed recurred and is now stage lV and is in my lungs and mediastinal lymph chain..I am now once again in the middle of chemo treatments for my disease..  all these years I have been very vigilant about my follow up appts. with my other oncologist, always mentioned concerns that went unheard, and always when I had a cough or respiratory infection i sought help.  But, to no avail this stuff came back and went undiscovered since January of this past year till May when the pulmonary nodule showed up on an xray..normally a nodule has to have some size to it already before a chest xray will show up anything..it was just a blessing that it did..  so far I only have the lung involvement and the lymph chain down my sternum..new oncologist thinks it can be put into remission, but there is no longer a cure..it is now living with it that I have to come to grips with..  My cancer was sneaky in that it didnt show itself in the auxilary lymph chain at all..a place where most dr's say that if you dont have any cancer then you are free of the disease..not SO!  apparently my original cancer was able to spread undetected before it was treated in 01..which is another story..I went in 00 for my usualy mammogram in January, a suspicious mass showed up, I was sent to a surgeon who then said he didnt feel it was anything but a cyst, did not want to do a surgical biopsy, and then it was put off for a year until April of 01 when I again had a yearly mammogram..well by then the tumor had really became suspicious and I was went to another surgeon who biopsied and found the invasive small tumor..so it went a whole year in there before it was removed..a whole year that it had to feed my blood stream with its cancer seeds..  My point to all of this is that it is warranted in alot of ways to be concerned about your own body and to be a little paranoid about a recurrence because it does so many times happen..  my cancer was hormone negative, but overexpressed on the her2, I was not offered the herceptin, dont know why?  So anyway,, dont feel bad about being concerned and trying to stay vigilant with this disease..its when we dont stay concerned that things seem to pop up..its learning how to keep alot of the concern hidden so people dont think we are that paranoid..and trying to get our dr.s to go that one step farther when we know in our gutt that something is wrong here.. well, take care..Jodie",
      "MessageIndex": 6,
      "PostDate": "18/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17158,0.htm",
      "Title": "Recurrance"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 8/7/2009 lilchris wrote: i was diagnosed stage 4 her2 w/ mets to the liver   this was 11/2 years ago chemo surgery radiation    i just figure i am now on a maintenance program  i am so very grateful the drs keep coming up w/ new stuff 2 try i've been on taxotere herceptin then zeloda and tykerb now gemzar  there are still about 4 more out there so far 4 me 2 try  it seems they work 4 a spell then not so good  my liver tumors were 7 cm  well one was i have them in all quadrants  so i just figure as the chemos have not been that rough on me i'll just keep switching w/ the furvent hope that they come out w/something that just keeps working to shrink or make them go the heck away  wow  what a concept. i am 50 and way to young to let this hinder my life overmuch i been through so much crud in my life that the hits just keep on coming i just keep telling myself this 2 shall pass  go live   be happy the sky is blue and the grass is green i figure that is relativally safe  prayers are w/ us all and that there is a strong dose in it self  lilchris Hi Lil:  I read your post to this forum and wanted to ask you some questions about the herceptin.  I am stage 1V as well..so far just mets to lung that have been kept under control by the herceptin.  Did this drug stop working for you?  Do you have tumors in your lungs or are they wide spread in several organs?  I have been on this herceptin for over a year now, and I know if I go off of it, the tumors are aggressive and they will return and continue to grow in my lungs.  They have already demonstrated the ability to do that when I had a 4 month break from the herceptin last fall.  Sounds like you have been on many differant maintenance drugs and I just wanted to know how long into your treatment  with herceptin did it stop working?  My mets was discovered in the sping of 07 and I was treated then with avastin and taxotere..then in March of last year I started the herceptin.  So far so good with it though, and as I said the cancer has responded to this drug.. I just as I said wanted to know about when it stopped working for you?  Thank you for any input.. Best wishes your way..and yes enjoying each and every day is very important when a person has the disease we have to fight..I too am her 2 pos.  I have been fighting this stuff since it was first discovered as a tiny cente. tumor in my left breast in 01.  I went 6 years in remission after chemo and radiation in 01.  Then in 07 I had elbow surgery and a prescreen xray found a nodule in my right lung..and after a biopsy of my mediastinal nodes the cancer was confirmed to be back..and this time instead of coming back in the original breast ( I didnt have a mastectomy) it had already spread to my lungs.  So far I am fortunate that it has not shown up in my liver yet..  do you have alot of symptoms with the liver mets?  We are all differant in how we manage this disease and how it effects us, but I was just wondering and of course want to know what to look for if I have symptoms.  I have pet scans every few months and they are usually pretty good about showing up areas of cancer activity...and so far none anywhere but the lungs.   Well, I will get off here, hope to hear back from you.. thankyou.  blessings your way! Jodie",
      "MessageIndex": 4,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38786,0.htm",
      "Title": "Met. Breast Cancer unresponsive to many chemos!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/15/2008 Linda Lou wrote: You may or may not lose your eyebrows.  I asked the doc if I would lose my thick long eyelashes and my eyebrows....he said, \"I don't think so.\"  Every single hair fell out.  I used eyeliner to make up for not having one eyelash left, and I used a sharpened eyebrow pencil using short quick strokes to fill in the eyebrow.  Use your eyebrow pencil (brown, not black!) and hold it straight up from the inside corner of your eye and this will tell you where to start your eyebrow.  It takes a little practice, but it looked pretty darn good.  By the way, all of my eyelashes grew back and the ends of my eyebrows seem shorter so I lengthen them a little....but I understand this could just be my age too of 55. Best of luck to you.  Keep your chin up. Linda Lou Hi Linda Lou: I was just visiting this site and seen your verbal demo on how to draw in eyebrows, this is of interest to me now as I have none from my recent bought with chemo.. the worst of it ended Jan. 16th..but I have more to come in March which is herceptin, I dont think there is suppose to be the hair loss with this medicine, so I should start seeing my own eyebrows grow back in..but in the meantime, I am drawing them on, and kind of like the look as oppose to my own which were thin anyway..  I might just go this way from now on instead of letting my own grow back.. I have always been wanting to try the no brow but was affraid to wax them off for fear I wouldnt know what to do afterwards.. thankyou for your tip, it will be helpful to me as well.  I do still have my eyelashes, but they are thin, I can just add mascara to what I have till they fill back in..  I am just now beginning to use a wig, my hair on my head didnt completely go, it just got very spiratic and very thin showing baldness..so until my regular hair does grow back in I am going to dawn a wig...it does make me look alot younger..as I am 55 as well.  Now if I could just do something about my saggy chin..haha!!  But I wont be that vain about it..I am just glad that the chemo does seem to be working for me as I am in early stage of stage 1V.  Hopefully I will be one of the 16% who survive past 2 years..right? thankyou and I just had to say Hi... Jodie",
      "MessageIndex": 2,
      "PostDate": "18/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20971,0.htm",
      "Title": "Eyebrow \"replacement\"?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/20/2009 Kittycath wrote: I am writing in response to a discussion I read concerning topical treatments for fragile, dry vaginal tissue.  I am post breast cancer and post menopause (age 59).  My oncologist and my GP doc both have told me that using PREMARIN cream is okay and safe for me to use.  I find I need it almost daily on my outer area of the vaginal opening.  Sometimes it hurts just to use toilet paper.  I must say, however, that it just worries me to use a cream with chemical estrogen since my tumor was estrogen positive.  Do any of you out there have an opinion?  (I go see my doc, who feels that I am safe, in a couple of weeks and want some info to carry in).  I will try the flax seed oil recommended by Tre.  However, I do question adding in vaseline.  When I have used Vaseline to get some relief, I have ended up with a bladder infection.  I know a lot of women have this problem--and it is SO frustrating.  Yes, it can be painful to sit and walk, and it has been at times excrutiating to have intimacy w. my husband.  I don't want to give up the \"intimate\" side of my life. Kitty: I am glad that this subject is finally being addressed here, and among other women who are having similar concerns and problems.  Not glad to hear though that we are all having the same breast cancer fight with this problem.  This is something that we as menopausal women dont seem to hear enough about and it can alter our lives so much.  I have thought about asking my gyn about this cream or the ester-ring thing, but was affraid that I would hear the deal about the estrogen content and that they suggest cancer victims  not take this type of hormone therapy.  I am not hormone positive with my br. cancer I am her2post. and I have always wondered if that should make a differance in being offered this type of medical and much needed relief.  Besides the fact that I am stage lV and so whats the point in worrying about extra hormones now?  I should try to just achieve quality of life now, right?  I too, have tried the over the counter inserts and lotions, but they are such a drag on a persons love life..  and I also experience some sensitivity and irritation while using these differant things.  So I am giving it serious consideration to visit my gyn and see what might be available.  I am tired of suffering in silence.. like I said this seems to be a problem all of us women have who have gone through menopause..although missing the monthly periods has not been an issue for me, it is the best time in my life as far as that goes..I dont miss them at all!!  But I wasnt prepared nor did I even know about the vaginal dryness that comes when the periods go!  I guess our generation is finding better ways to deal with this problem, but hopefully they can do even better for future generations of women..  thankyou for courageously addressing this topic here..and I hope other women can add their experience in what they have found to be helpful for them.  I have always thought that vasaline was always a NONO for that area of the body..?  I dont think it would be a good idea for me to try that one..I have a sensitivity to almost everything..  Take care ladies..and Thanks again for opening up this topic that so often stays unmentioned even by gyn dr's and healthcare professionals.  I dont think they like to even discuss it.. Victoria",
      "MessageIndex": 3,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33374,0.htm",
      "Title": "Topical Estrogen"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hello I have just learned that I too have stage lV mets to lung, and spin..so far no liver.. my original tumor in 01, was ductal, no nodes oppositive..basically a stage 1no..but it was negative for hormone properties, and was over expressed on the her2 report..I have been in remission for 6 years, thought it would be gone for quite a while longer..this was a total suprise to me to have been given this news just a week ago about the mets..it bypassed my breasts..I had just a lumpectomy on original bc. finding..it went straight to other places in my body..for months I have complained about a cough that kept coming back, respiratory problems every year inspite of flu shots, pain in spine that I was told was just degenerative arthritis, which has now been proven to be mets in my upper lumbar spine..I didnt want mets but finally my complaints of pain has been validated with this new diagnosis..I just dont understand how the statistics are adament about the auxillary lymph nodes being the only predictor that cancer has spread in the body..via..blood..and so forth..I was basically ignored by my onc. when I complained of back pain getting worse, or this cough that at times produced some bloody phlem..  I had finally just decided to keep quiet about my complaints because I wasnt taken serious,  Now, fianally it has taken actual stage lV disease to present itself on a clinical finding Pet/ct scan for my pains to be recognized as something to worry about..now I am facing more treatments..  I guess my question is, since my original cancer was not hormone driven and I was not offered the hormone preventative for 5 years, will this new development of mets also be of the same pathology?  Sorry, lots to mention..I am so glad I found this site at a time when I needed to share some of my feelings..this is a great web site..thankyou for creating it..  ",
      "MessageIndex": 4,
      "PostDate": "21/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13776,0.htm",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/3/2008 BonaireClaire wrote:   On 4/2/2008 antia wrote: I have lumps on my breast, and when I touch them it's very painful. I'm scared because of that!!! Is that mean that I have a Breast Cancer?  My mother died from breast cancer 5 years ago, btw...   I searched some links where I found some informations, but is not much to me...  http://en.wikipedia.org/wiki/Breast_cancer  http://www.diseasesarchive.com/Breast+Cancer   Hello I read your post with personal alarm - I was diagnosed with BC in 2001 and had a painful lump too. The funny thing is that before the biopsy the nurses aid brused off my worry saying that canerous tumors usually do not hurt. That is not true in all cases!  Additionally, I would run not walk to get a mamogram and ultrasound - from my experience. My painful lump grew really fast and went from a .5 cm to 2 cm in about a month. That means from early dection to stage 3 with lymph node involvement and surgery/chemo/radiation. Good luck! Stay on the message board so we can get your update! Anita:   I too was diagnosed with bc in 01 and I do remember that I had pain..and I didnt know there was a lump there until my yearly mammogram showed a suspicious area that turned out to be invasive bc..so that old story that it doesnt hurt, I dont know who keeps saying that..  If there is pain anywhere in the body for a considerable length of time it is always best to get it checked out because pain I understand is the body's way of telling us there is something going on that isnt right.. I would have ignored the pain too if I hadnt already been going to have a yearly exam and mammogram..thank goodness things do happen for a reason sometimes.  I went through chemo and radiation in 01 and was able to stay cancer free for 6 years.. this past year it came back and was again discovered from another ailment that I had going on at the time that they did a chest xray for and found a nodule in my lung..that was all biopsied and I am now fighting stage lV disease that has gone into my lung area..  so far so good though and the treatments I am having now are successful in slowing the beast down in my body..it was caught early enough that thank goodness it hadnt spread to any other vital organ yet.. but, I just wanted to let you know that the dr.s brush off things that they should pay attention to and try to over test and treat things that arent..it seems that way to me anyway..  thank goodness my primary listened to me about this lung xray as being suspicious to me cause he is the one who sent me on for a ct scan and then on to a pulmonary dr. who did a pet scan and discovered all the cancerous areas in my sternum and lung area..  we have to be proactive sometimes..even when we are made to feel like we are being paranoid..sometimes it pays off to be vigil and paranoid..  I wish you well, and I hope things turn out for the best for you..and you can come here to just keep us breast cancer fighters company and not as a patient..God's blessings. Jodie",
      "MessageIndex": 4,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22606,0.htm",
      "Title": "Is that symptom?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/28/2008 chillywillie wrote: I started Tykerb in December 07 and will take it for a year. At first had severe bowel probs but my body got used to the med quickly. You do not want to eat food within an hour of taking this med! I also have a rash that started about two months into taking drug. Other than that, it is the easiest of all of my treatment so far. Good luck to you. Keep looking up! Dear ChillyWillie Thankyou for the reply...may I ask, what happens when eating within the hour of taking tykerb?  the bowel upset you were discribing?  I have had that some what with the herceptin and I am hoping it will get better.. I have trouble taking oral medication..even tylenol sometimes so I am concerned about how my system will handle this stuff..  the herceptin has also been pretty easy on me except for what I mentioned above.. But, thankyou again for your message and I will keep all of this in mind as I embark on my treatments with tykerb.. I was also wondering??  How often do you take this medicine?  I have read that they were trying to get it dosed to where it didnt have to be taken 4 time a day..is this the way you are taking it?  Is it everyday or once every three weeks like the herceptin?  After you have taken it for the year..do they tell you what then?  Lots of questions but I am wondering now about all of this.. Jodie",
      "MessageIndex": 2,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23098,0.htm",
      "Title": "suppose to begin with tykerb in a month or so.."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I am her2 positive with mets. to lung area (so far it is staying there)..anyway..after 6 mos. of avastin/taxotere..which showed good results..I am presently taking herceptin treatments.. one, every three weeks for a three month period then after this next pet scan in May the dr. is talking about putting me on tykerb which is the pill form of herceptin.. has anyone out there in this forum been on this medicine, and how have you faired with it?  Are the side effects tolerable..they have been so far with the herceptin except for a little diarhea and tiredness..  how is the tykerb administered?  Do you go to the pharmacy to get a prescription refilled or what?  Lots of questions..??  It is always informative to hear from others here, who have already been where I find myself heading..  thankyou for any input..it is much appreciated, and usually very helpful.. Jodie",
      "MessageIndex": 0,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23098,0.htm",
      "Title": "suppose to begin with tykerb in a month or so.."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/9/2008 Leemg wrote: Wow!  I thought the PET was the best screening technique out there but maybe not.  I do know regarding those other areas that are still lighting on the PET is a good indicator that treatment is working.  I know how you must feel getting the bad news overturned, believe me, but since your health is on the line here maybe a 3rd opinion of all the CD's of your films at another reliable facility would either fall with one or the other.  I think I would feel better with two similar opinions than two that are at odds.  Yes, it is amazing the different takes you can get.  If they are just looking at the takes done with films it may be missing important info so it is best to allow them to see the entire CD.  That is what I've learned.  Also, just after being diagnosed with bc 5 years ago I was sent for a bone scan and the facility that performed the scan aware I had bc diagnosed an area around my spine as mets, 6 weeks later after having other doctors go over my test results, indicated that it was a degenerative process and I guess they were right as it has been 5 years.  I've also have had two doctors look at an enhancement within my inner ear that indicate it is a benign growth and other that say that can't be confirmed with the testing I had and need more safisticated testing.  And, we are talking about the best in their field.  I wish you the best of luck and hope and pray that the better report holds.  God Bless! Leemg: thankyou and the other poster for your info..it is great to get immeadiate feedback when a person is comtiplating what she should do or not do.  I agree with both of you.. I do feel that a third opinion would also be a good idea, dont want to anger my new onc. though in doing so over his head, but I would feel better knowing that there were at least two reports that were similar leaving the other as an odd one out to be excluded.  They cant go digging and probing into my lungs everytime there is a new nodule showing up, I know that.  I would have lungs that looked like swiss cheese if they did that..plus alot of scar tissue.  So I would just feel better knowing for certain that this is good news rather than something that is being overlooked and left to spread to the point of no return.  I know lung mets can reek havoc on lung tissue all at once or a little at a time till it does its damage and its then to late.  My objective now is to catch it one at a time before it does that damage.  I have read about cases where lung mets is the only cause of death in alot of br. cancer cases.  I guess I shouldnt be so fearful, I dont fear death its just another aspect of life,  but I guess I just want to fight it off like its expected of me to do as I am able to do.  I am otherwise a healthy person, and this cancer is just a nuisance to me and my quality of life.  Just trying to stay on top of it the best I can with hopefully the specialists in charge of me who will also take this serious and try to understand my concerns in staying as healthy as i can for now.  Chemo is no picknic, no one wants it given to them if it isnt needed.  But letting cancer grow into an uncontrollable monster is not a good thing either and I thought that was always the goal in cancer therapy?  Thank you Lee for you responce, you have given me the insight to go forward with getting a third opinion.  I am seeing my regular pc tomorrow, maybe he will sign me up for a redo on the ct for a month from now, that will at least give me some time to see if this nodule on the left has had time to go away on its own.  I think he will agree with me as well, he has been good about listening to my concerns so far..it was his quick judgement a year ago when he sent me on for a ct when this original tumor showed up in my lung last year that ended up being a malignancy when everyone kept saying it was just scar tissue or inflammation.  The pet scan I had after that ct is what showed up all of this cancer in very strong intense uptake values..so I know what these things are suppose to look like by now.  We learn alot along the way dont we?  Well, take care.  Thankyou again JOdie",
      "MessageIndex": 4,
      "PostDate": "09/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29110,0.htm",
      "Title": "conflicting petct and new ct scan reports?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 1/28/2009 paulla wrote: i have lump in my breast ,concerned about it going for mammogram and ultra sound and do have pain and throbing.  does anyone out there who had same symtoms as myself and whats your prognosis . good or bad want to know the results from anyone. hope to hear from someone out there    thank you Paula: I have stage lV breastc. in lung and mediastinum area..and I am in remission for now..thank God!  But I wanted to respond to your post because I remember having pain initially in 01 before the cancer was discovered by a mammogram.  They say there is usually no pain where there is cancer growing, but I know that I had pain.  I couldnt detect a lump although the dr said she could. I had a sharp stabbing pain in the area of my initial cancer in left breast so I know that it was the cancer causing it.  I was in a fender bender car accident a few months before the cancer was found in my breast and I always wonder if the accident caused it to spread in my breast.  It was only a stage 1..and just 2.6 centemeters in size..  I had lumpectomy and chemo and radiation in 01..then went 6 years before it was found in my right lung and sternum lymph chain.  I had several months of chemo in 07/08  and so far I am in remission again.  Only this time I know it will be a chronic illness to treat and probably shorter remission time between active cancer.  But for now..I try to be in good spirits about it and not let it get me down.  With the treatments they have now to keep us healthy longer breast cancer is a manageable disease for quite a long time.  So I hope yours turns out to be just a cyst and you dont find yourself among the rest of us on the cancer compas who have learned to live with this fight.  Best of luck to you.. let us know how you are doing.. good people on here to help you with many aspects of this disease if you find yourself to be one of us, and I hope you do not!  Gods Blessings Jodie",
      "MessageIndex": 5,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32617,0.htm",
      "Title": "breast cancer"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "hello out there:  has anyone been told withing a month apart by two pretty reliable doctors and diagnostic scans two differant written report readings? I thought today that I was going to new doc to start another round of chemo, due to a petct scan that said that I had a new 2.4 cent. nodule in my left lung and that it was to be considered malignant until proven otherwise..this is a direct quote.  It also mentioned persistant and residual activity in the other areas that had been previously treated with chemo last fall.  The new doctor that I am seeing now, ordered a new ct scan to be sure about the other scan report, and it came back clear of any metastatic activity in my lungs.  I am very pleased about this new finding but am very confused about it as well.  I know there can be false positives and false negatives to any of these diagnostic tests but they seem to be very differant in their reporting of these findings.  The two scans were done in differant hospitals and differant radiologists reading them.  I am elated at the new news of no need for chemo at this point when I thought today I would be starting more of the stuff.. but like I said, I am so confused and not sure how to feel about which one of these reports were wrong?  I looked at the cd rom of the petct, the new nodule was very apparent and very easy to see.. it looked like a quarter laying in there.  I have not been sick bronchial for there to have been any infection going on in there, and could it have been disolved within just a month by my system?  Should I get yet another radiologist to look at both scans and make another determination?  Sorry, I am just needing to know if others have experienced this miracle or confusion?  At this point I am seeing it as both!  I want to believe that this new report is correct, but if so, then why did the petct which is suppose to be pretty acurate show up this new nodule, and now its not there?  I am thinking out loud here.  None the less, I am glad that I am not having to go forward with more treatments.  I dont want to use this chemo medicine unecessarily causing the cancer to become resistant to the only drugs that may keep it under control.  I was taking herceptin treatments, and the new dr. now feels this is not necessary to continue either since I have already been on it 6 months.  I am her2 pos. Had recurrence in lungs which was biopsied in Aug. of 07 and proven to be breast cancer spread to lungs.  The new dr feels that yes there may very well be new cancer growing in lungs but until it reaches a higher SUV value more than 4 then it isnt considered to be abnormal enough to warrant more chemo at this point.  The object I thought was to keep it from growing in there at all or being able to spread elsewhere in my body..any loose cells can do that, I guess its just a ticking time bomb that waits for its moment to go off and start growing again.  Anyway, thank you for anyone who has some medical knowledge of any of this to send me some answers if you can.  I dont want to seek yet another dr..I am satisfied with the new one, but I just want to feel confident that these scans are being read and reported accurately. Thankyou so much. Jodie So what do others think? ",
      "MessageIndex": 0,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29110,0.htm",
      "Title": "conflicting petct and new ct scan reports?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "To all of you who responded to my whining session, please let me start by saying thankyou so much..I got some very good ideas from alot of you.  Some of the ideas I am going to follow up on..like the clowning venue or just beginning with being a volunteer at a local hospital nearby.  Then I will see where it goes with the clowning idea.  I have researched it and have found it is a very do-able thing for me if there is a program like this in the hospital that I plan on volunteering in.  If there isnt then I will take steps in the future to maybe create one if they are inclined to want this program in operation.  It does sound like it could do alot of good for everyone... the cancer patients (young and old), nursing home residents, me!  etc...  It will definately give me something else to think about besides my own woes.  I have been wanting something like this to come along but just not sure of what.. I like my comfort zone and do not have a lot of courage to venture out of it.  perhaps God will give me that courage as I feel he is leading me into this for some unknown reason.  I was a candy striper when I was a teenager and I enjoyed it then, so I am sure this will be just as rewarding.  My adult life will end possibly where my young adult life began...does this sound goofy?  Anyway I just wanted to thank you all..  I cant change my situation with my family and grandson all I can do is continue to love them anyway and try to understand that they do have their reasons for doing what ever it is they are doing to protect their baby. Even if I dont really know what that reason is.  It is their call to make..I just hope that I will be around a while longer so my grandson will remember his damma and dampa.. I spoil him, but he does have boundaries, rules and limits..and I dont over do the toys as it may have sounded like in my first post..I keep toys here that he will play with since I not able to get him out away from home..if you dont keep the little guy busy he will find his own entertainment..as alot of you probably know?  My son just turned 29, and so running around after a baby again is a new adventure in itself.  So much fun though!  I wouldnt trade a minute of it... take care all..God's blessings.. Jodie",
      "MessageIndex": 13,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27080,0.htm",
      "Title": "grandson is my best chemo medicine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I too am interested in knowing what side effects have been experienced by those of you who have been on Xeloda?  I am presently on herceptin as a maintenance dose monthly to keep my stage lV br. ca from recurring.  The only draw back with the herceptin(otherwise it is well tolerated), is the expense and also it will not cross the blood brain barrier thus will not protect me from brain mets, of which I am highly at risk of occuring.  My mets was found in my medistnal nodes, and also in my neck nodes, so it is possible it has already set up shop in my brain.  So I would like to know about others and their side effects from the xeloda.  I was told by the dr. that it causes severe diahrea..not good! thanks..and blessings to you all sufferning and surviving this disease. jodie",
      "MessageIndex": 2,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41494,0.htm",
      "Title": "Anybody on Xeloda? Any advice?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I just wanted to see if there was anyone else who has experienced neuropathy pain and numbness from avastin/taxotere?  I had my last treatment in Jan. and I am just now having this stuff..  pain in my right leg with a feeling that its buzzing...and also the numbness in my hands and legs..  I dont know weather to mention this to my dr or not..not sure if there is anything they will actually do for it?  I have a herceptin treatment this Wed. and I will mention it then to the nurses, but just wanted to see if others have had similar problems this far out from your last chemo dose?  And if so, was there anything that the dr. gave you to help ease it?  My leg has such a strange sensation when I am walking on it..almost spungy like.  I am kind of concerned about this...not sure if it is the neuropothy or something going on in my spine..  I have stage lV br. ca.  but it hasnt spread to my bones or spine or liver as yet..  the 4 cycles of chemo was able to put me into clinical remission..YEAH!!!  Hope so much that I stay that way for a while.  I'm not suppose to see dr. again until Aug. and I am wondering if this new concern should be evaluated sooner...  any one else out there had similar things going on after your chemo treatments this far out.?  I guess I should mention that I had a normal pet/ct scan the end of May.. Thank you for any response. Jodie",
      "MessageIndex": 0,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25316,0.htm",
      "Title": "nerve pain from chemo 5 months ago?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 8/13/2008 trehouse60 wrote: Hi Jodie, You know how it is when you're trying to think of something and can't bring it to mind - if you just let go of it and think of something else, the thing that was eluding you will just all of a sudden pop into your head? I've been trying to sleep for quite a while - just too much stuff spinning around in my head - keeping me awake.  Not cancer compass stuff - just other stuff.  All of a sudden, it pops into my head:  be a clown. I have a friend  - I'll call him Ed - who volunteers as a clown. He used to work the rodeos, as a professional clown to protect the bull riders, until he was injured and could no longer do it. Took the joy out of his life.  Then his mom passed away - that really took the joy out of his life.  Knowing that Ed was having a hard time, a friend of his that often volunteered with a group of clown for kids in the hospital asked Ed to fill in for him for just one day while the friend was out of town.  There actually were other people who could have done this, but the friend knew Ed needed the joy and laughter of children to replace the grief in his heart.   Ed wasn't real enthusiatic about filling in, but he owed the guy a favor and agreed to do it. Turns out Ed's friend was a pretty smart man.  Ed went to the hospital, worked with the kids, made them laugh, and lo and behold, they made HIM laugh. Showed him that there was still room in his heart for love and joy and victory, instead of grief and sadness and defeat. When Ed next saw his friend, he asked to join their volunteer clown group. He's been with them for a number of years now - he says he never gets tired of doing it.  And he doesn't just visit the kids - he goes to see church members that are in the hospital, shut ins in their homes - all kinds of people, and he does it for free. He sure gave me a big boost the day I was walking down the hall of the hospital just hours after I'd had my gallbladder removed,  trying to get myself mobile so I could go home.  This big clown came lumbering up the hall, grabbed me gently, shook my hand with his clown buzzer, and made me laugh!  Made my belly hurt a little bit, but sure took my mind off the discomfort of walking!  I didn't even know who he was until he took his mask off.  Said he was on his way to see the kids, so I was thankful to have also gotten the benefit of his visit. If you feel up to it, maybe you could check out if there is a volunteer clown group in your neighborhood. I'm sure they'd be glad to have some help, as you feel able and comfortable. You don't have to be able to do anything special tricks, or wear a really fancy clown get up.  A painted smile and a funny nose, a floppy hat, and some baggy drawers - that gets good laughs, and sick kids sure do love getting a balloon, or a box of crayons and a coloring book.  And they sure get happy when the clown sits down and colors a picture with them, or reads a story to them. ( A lot of the adults seem to like the clowns, too.)  And you know how kids are - they can be quick to give back the love and kindness they receive.  Just like Ed:  therapy for them, therapy for you. Wishing you the best, Tre Tre: thankyou so much for your responce and very good advice.  I totally love the clown idea!  I dont know if there is such a thing here in my area but I will look into it.  The idea of dressing up and looking goofy and having the kids chuckle and have fun is such a great idea.  I will talk to officials here around town and see if they have people who do this already.  I know I need to get out and find my own things that will help take my mind off of my problems..I know that is my problem..I use to work retail years ago and havent worked for several years...I should go back to work..but then I wouldnt be ready available to take care of the little guy when I was needed..I guess I make myself to available to be hurt in a way.  I never thought I could be a person who could love to take care of little kids either..my grandson has changed that state of mind for me.  Not all kids are like him though..he is so easy to take care of..it makes it a joy and not a burden or a hair raising experience.  He is busy as all 3 year olds are, but he minds well, and I just have so much fun taking care of him.  He will probably be my only grandchild..my son and his wife arent having anymore..so this makes this little guy even more special..and unfortunately it makes them very protective of him to the point they are affraid to let him venture to far away from them.  I can totally understand their feelings, but they need to realize that I may not be here to watch this little guy grow up and get to a point he will remember the little things that I do for him now..I cant recall very much when I was 3..  I am not at deaths door by no means, but I know that stage lV brings a very grim outcome usually.  I am realistic about that..I do have a good attitude and most of the time I dont think about my illness or let it control me or paralize me.. I get out and do what ever I can to keep myself busy..but I just need to do more.  My grandson will be starting preschool soon which will make my time with him become even more few and far between.  I have offered to help with baking and craft making and such for classroom parties but this offer has fell on death ears.. no input from me is wanted or seemingly needed so all I can do is just back off and allow her to decide when she wants or needs the help.  Like you said, I need to find another avenue for my help.  I decorate cakes, and have always loved crafting, painting, sewing etc.  I loved it when my kids were in school and at the age I could do these things..they grow up way to fast!!  Well enough...but thankyou again for the helpful ideas..I love the clown one and will see about how I can use this idea around here...heck, I could sew and make the costume...that would be fun!!!  Sorry for the pitty party whiney stuff..I will be fine...just pull myself up by the bootstraps and get on with it..  I am a strong person usually, I just get down about this one aspect of my life and how things turn out so often with it.. I wanted to take my grandson this weekend out for lunch..I was so excited about it and I even asked my daughter in law to join us so she wouldnt be left out..but it fell on death ears..so that is why I am feeling so down about it right now..I just dont want to even ask anymore..rejection is hurtful..but I will be fine...just had to vent here..and thank you all so much for responding..it helps alot!! God's blessings...and hope your days are filled with good things! Jodie",
      "MessageIndex": 4,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27080,0.htm",
      "Title": "grandson is my best chemo medicine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Diana: Thankyou... yes it may very well be God's way of getting me fired up about something good..  I have always been kind of shy, never really wanting to attract attention to myself and really never have stuck myself out there to utilize the talents that God did give me.  I have been searching for something like this and maybe this is what will come to be for me.  A costume is a way for most shy/introverted people to feel comfortable..I just never thought of that before.  I started to sign up to volunteer at our local hospital before my recent cancer treatments came around..I wish now that I had gone ahead with it and then I would already have myself involved in the community and be where I could take this step out of the norm and do something neat!  I will now take that step, and it is probably what I do need.  Thank you all for the pep talk!  The boost that I needed to get moving! take care.. Jodie",
      "MessageIndex": 6,
      "PostDate": "13/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27080,0.htm",
      "Title": "grandson is my best chemo medicine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "To all of you who responded to my whining session, please let me start by saying thankyou so much..I got some very good ideas from alot of you.  Some of the ideas I am going to follow up on..like the clowning venue or just beginning with being a volunteer at a local hospital nearby.  Then I will see where it goes with the clowning idea.  I have researched it and have found it is a very do-able thing for me if there is a program like this in the hospital that I plan on volunteering in.  If there isnt then I will take steps in the future to maybe create one if they are inclined to want this program in operation.  It does sound like it could do alot of good for everyone... the cancer patients (young and old), nursing home residents, me!  etc...  It will definately give me something else to think about besides my own woes.  I have been wanting something like this to come along but just not sure of what.. I like my comfort zone and do not have a lot of courage to venture out of it.  perhaps God will give me that courage as I feel he is leading me into this for some unknown reason.  I was a candy striper when I was a teenager and I enjoyed it then, so I am sure this will be just as rewarding.  My adult life will end possibly where my young adult life began...does this sound goofy?  Anyway I just wanted to thank you all..  I cant change my situation with my family and grandson all I can do is continue to love them anyway and try to understand that they do have their reasons for doing what ever it is they are doing to protect their baby. Even if I dont really know what that reason is.  It is their call to make..I just hope that I will be around a while longer so my grandson will remember his damma and dampa.. I spoil him, but he does have boundaries, rules and limits..and I dont over do the toys as it may have sounded like in my first post..I keep toys here that he will play with since I not able to get him out away from home..if you dont keep the little guy busy he will find his own entertainment..as alot of you probably know?  My son just turned 29, and so running around after a baby again is a new adventure in itself.  So much fun though!  I wouldnt trade a minute of it... take care all..God's blessings.. Jodie",
      "MessageIndex": 19,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27080,0.htm",
      "Title": "grandson is my best chemo medicine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hello to all who come here to rant, rave, ramble, vent, or look for the best breast cancer advice a person could ask for.  I have been on here before complaining, talking about my experience with the breast cancer struggle I am in right now and will continue to be in until God decides its time for me to call it quits and I have had enough..so far though I really cant complain, as it has not been so unbearable with pain like some who have come here to seek comfort and solace.  My reason for writing today is to talk about the one thing in my life right now that gives me a reason to want to fight..and that is my little 3 year old grandson.  He is such a sweetheart!  I'm sure that all of you grandma's out there can attest to what I am saying..  When I am able to babysit and take care of him it just brightens my world up to no end.  I look forward to the days when I can take care of him and it gives me such joy and amusement to see him discover the world and all its greatness to behold.  My delima is that my daughter in law is very strict as to when I can have this time with him and it is so frustrating at times that it makes me at times not want to fight my cancer...as he is my one reason for wanting to live right now.  He is 3 years old, and I nor my husband have been able to enjoy him enough to take him on outings..like to the zoo, to get an ice cream cone, to the park etc.  It kills me to not be able to do these things with him.  My son of course also has to abide by his wife's wishes and has to go along with how things are handled with the managing of the relationship between us and our grandson.  I love my family, I will go out of my way to do things for them, I would go to the ends of the earth to give them or do for them what ever they would ask of me.  All I have wanted now is to be able to spend some extra curricular time with my grandbaby before my cancer gets ugly and I am no longer able to enjoy him the way I am able to now.  I dont want to use the illness though as my last will and testament so to speak.  I dont know what to do?  No amount of asking, or begging will give any results, so I have to sit back and wait till its my daughter in laws idea or wait till she has something she needs to do that allows me the time to babysit, which is the only real time I do get to spend with my pride and joy.  I feel like I am only good for babysitting, nothing else..  it is very hurtful at times, and so much so, I often think why go through the routine of trying to prolong my life from the cancer keeping it from taking its toll on me..I am in stage lV which is for now being managed with herceptin treatments.  Thank goodness these things are not rough to go through, and I am able to take care of my grandson when and if I am given the opportunity.  I just dont always feel like there is any use in trying so hard to keep the cancer at bay when my only reason for living is being held at arms length from me.  I am a good grandma, I love this little guy..and I spoil him everytime he is with me...via food, toys, what ever!  He is 3, and  I want him so much to remember me for being a grandma who did love him.....I know his parents have the right to dictate when and where they deem it ok for us to take care of the baby, and I totally accept that idea..its just that walking on egg shells is the routine if  we want to see our grandson.  My husband gets frustrated too about our delima, but he doesnt let it bother him like I do.  It sickens me and just makes me so depressed at times.. Having cancer is depressing enough without the added stress of not feeling like you are wanted in your grandchilds life.  Well anyway, I just needed to vent today and get some of this depressing stuff out of my mind....not that anyone can actually help me with advice, but I just needed to share my hurt with someone else who may understand.  When things are going good, and I am getting to see my grandson I am the happiest person alive, but when there are days I dont see him and would love to be able to take him out to lunch or to the park and cant, well my joy quickly turns to dispair and I dont want to feel this hurt anymore. Sometimes I would just like to stop trying so hard to stay alive..for what, I ask myself all the time?  I'm just a babysitter..I am being used!  There is no regard for my or my husbands feelings as grandparents.  I was able to take him one day to the local discount store by myself and you know what, that was the best day I have spent in that store in a long time..we took our time and walked around the store, and we looked at the toys and we just had the best time..I would like to have more good times like that..but oh well, I guess I will have to be happy with what a good time I did have with him.  This little grandson of mine is the best cancer medicine I could ever be given..so much better than chemo!  I appologize if I sound like a whiner!  I know I have alot to be thankful for compared to someone else..like I said I just needed to vent..and figured this was as good a place as any... God's blessings to you all for listening..... Jodie",
      "MessageIndex": 0,
      "PostDate": "12/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27080,0.htm",
      "Title": "grandson is my best chemo medicine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/24/2008 creeocean wrote: Hello.  I am looking for ladies to have a discussion with that have mets to the lungs.  I have been on chemo since being diagnosed in May 07 except for a brief period when I tried Herceptin, which unfortunately didn't work for me. According to the pathology report the cancer is HER2+ estrogen/progestron negative.  Six weeks ago, I caught a cold, which I haven't been able to shake.  It starts to go away then comes back on at least three occasions.  what is worrying me, is that a few months ago, the oncologist asked if I had a cough. At that time I didn't but now I do.  I am worried that it may be more than just a persistent cold.  I am going through staging now,  I had a CT scan, and will meet with the oncologist this upcoming Monday to discuss the results, and the next steps.  My question is has anyone dealt with a persistent cough/cold?  Any words of advice.  Hoping to hear from someone out there.  Thanks.     Dear Cree: Your situation sounds exactly like mine.  I was diagnosed in June of 07 with mets to lungs, and was on chemo Sept 07 thru Jan. 08.  I think they have been able to get mine into remission though.  I wasnt really sure of that last month though?  I had a persistant cough last year when my mets was discovered,  but it has now ceased.  I had a pet/ct scan done in Sept. (last month) and when it came back, it said there was a new 2.4 ct. nodule in my left lung.  The first nodule was smaller, under a cent. in size and for now it is stable.  But this new nodule really through me for a loop.  I was having some coughing, but it has stopped.  I had  been on herceptin since March.  I changed onc. dr.s and when I did the new one ordered another ct scan..low and behold..it came back with the nodule not there?  I was stunned, as I was preparing to go through chemo again, and the dr told me that I didnt need it for now.  I am happy and relieved to say the least, but puzzled at the same time.  I dont know how such a large nodule can just go away unless it was just inflammation or an infection?  So for now, I am not on anything..no chemo, no herceptin.  I told the other onc.dr that I didnt think the herceptin was working since this last pet showed this nodule, and when I changed to another onc.dr, he decided not to keep me going on the herceptin.  Not sure if that is a good idea, but this is what he believes to be the best way to go for now.  In some ways I feel like I have been hung out to dry, and left hanging and wondering what this nodule was?  I am also her2 pos. and er/pr neg.  My original bout with br.cancer was in 01..  it didnt return in the normal way under the arm or local recurrence in the breast I first had the cancer in..instead it came back as mets to lung without being detected on blood tests.  How extensive is your lung involvement?  I know it is scarey how ever extensive it is.  I wish you the best..sounds like we are in the same boat!  Write back if you'd like.  Love hearing from you.. Jodie",
      "MessageIndex": 1,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29624,0.htm",
      "Title": "stage IV mets to lungs"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I had initial br. ca. diagnosis in 2001..ductal with no nodes oppositive..high grade with neg. for hormone receptor and over expressed on her2..treated with 4 rounds of A/C and 37 rad. treatments.  With negative auxillary lymp. nodes you would think if it came back it would be locally..well NOT!!!  In May I had chest xray for pretesting for a surgery for another reason....lo and behold there was a solitary pulmonary nodule that showed up. a ct scan was then ordered, which showed the nodule still there...then i had a Pet/ct..and am being told now that it is conclusive that I now have mets in my right lung, sternum lymph system, and clavical, and also a spot  lit up on my lower spine in a vertebrae..doctor says it is unusual for it to show up as mets instead of a recurrence locally...but it has happened..I know there are treatments for most women using hormonal therapies,  but since my original b.ca. was neg. for hormone receptors,, will they still want to use hormonal drugs for this new site of mets..?    Or am I looking at more A/C since that is what they used before..?  Can the same chemo drug be used again??  I was told no because of the toxicity to the heart with the Adryiamicin..so if anyone can answer this I would be ever so greatful..not looking forward to the next few months, cause I know what lies ahead....thank you for any response.. new to this forum, and so glad there is a web site like this one....Jodie",
      "MessageIndex": 0,
      "PostDate": "21/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14591,0.htm",
      "Title": "br. ca. returned and is now mets.."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Hi, this is jodie, I have an update since I posted this first message on this track..I have seen the pulmonary dr. yesterday..she is the one who did the pet ct and that is what had me concerned..now since talking to her I have learned that the pet ct might not be as accurate as i thought it to be..and I may still have something other than br. mets going on here..good news, but still on edge about why all the enlarged lymph nodes in my chest lit up, plus the pulmonary nodule..it had a very intense increase in the uptake of the FDG..I will be relieved that it isnt malignant but still concerned till i do know for sure..I try not to get hysterical about any of this until I have to..   I was negative for the hormone receptors in my original br.ca., and according to the fish test they do to find out about the aggressiveness of the tumor and the overexpression of the her2 gene it was overexpressed, but I have never been told or offered the herceptin, I asked the dr. about it once and he said that it wouldnt benefit me for what ever reason..yeah when or if I have to fight this mess again, I plan to find another physician and check out some other options from a differant perspective..  Good to hear though that you have found a med. that is being of benefit to your fighting this disease..hope things continue on for you in this way.. jodie",
      "MessageIndex": 4,
      "PostDate": "28/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14591,0.htm",
      "Title": "br. ca. returned and is now mets.."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 11/30/2008 dixielee wrote: Hello, just wandering if anyone might have some wigs to donate. I've just started losing my hair but can't afford to buy a wig yet. Scarfs, turbans or anything would be appreciated.                                                                           Thanks very much and                                                                           God Bless us all. Dixielee: I agree with Treehouse,  usually the cancer society in your area will have a place where they give out a free wig..usually its just one, but that along with ball caps and scarfs may get you through the tough times.  The cancer center I went to for treatment also offered a free wig/scarfs/knitted hats etc. to cancer patients..they had a room designated with those things there in the clinic I went to..I imagine alot of hospitals may have similar things going on as cancer unfortunately is hitting alot of us these days..young and old.  The wigs that the cancer society collects are donated ones, and unfortunately they dont have the resources or the time or help to keep them nice and combed.. when I went in for one, I had go through boxes of them that were just thrown into the box laying free..but I was able to find a nice one, and they arent hard to wash and clean up..I used just regular hair shampoo and hair conditioner..although they do sell special shampoos for wigs..  I had good results with the regular products for human hair.  So talk to your cancer clinic I imagine they can lead you to the right place to help you.    good luck, and sorry you are finding yourself needing a wig in the first place.  Cancer is mean and nasty and we have to go through the mean and nasty stuff to try and control it...best wishes for a long remission period and hope for a cure as well.  God's blessings Jodie",
      "MessageIndex": 3,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30791,0.htm",
      "Title": "wigs"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/11/2008 cacann wrote: I was diagnosised with Breast Cancer late November 2007.  I had two back to back surgeries with the placement of the port during the last surgery as we knew I was going to have chemo treatments.  I did not start the chemo until the middle of January, but was already having problems with the port.  The area felt sore and bruised, and when I would turn a certain way, it felt like a pin was sticking into my skin.  I mentioned to my Occologist doctor the port does not feel right.  He looked at it, and stated it is just a vial in a vial.   I did not ask any more questions as the removal of the port would be worse as the veins in my arms are impossible to get.  Some of the cancer nurses have had problems connecting the IV's to the port.  One nurse said the port was wobbly.    Is this pain normal?  The pain is tolerable and does not hurt all the time.  I notice it mostly at night. I know the sticking pain you are talking about.  When I had this new one placed in Sept. of 07 it took several weeks, even a couple months for that pain to subside.. I told the dr. and the nurses and all they said was, well there is good blood return..and they couldnt explain the sticking pain I kept telling them I was having, they said it would subside after the port got settled in and that area got use to it being there.. I wore a bra to bed to keep the pain at bay and it does help, it has been 7 months or so already and I still find myself wearing a lounging soft bra at night so I can sleep without the worry of that pain hitting me and keeping me from sleeping.  So you might just have to bear with it for a little longer and hope it goes away in time.  I couldnt have chemo in my veins either, my veins arent always reliable to find.. so the port is the easiest way to get the chemo.. I have found that some nurses are better at accessing it and there is no pain when they know what they are doing or arent in a hurry, I had mine flushed last week, and the nurse that did it was very good, I didnt feel anything..  That lidocaine sounds like a good idea..  where does a person get some of that stuff?  They rub betadine on my port before they access it but I dont know if there is lidocaine in it.. Good luck to you.. Jodie",
      "MessageIndex": 9,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20823,0.htm",
      "Title": "port installed hurts"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Kats: Thankyou for your reply.  I had a biopsy of the lung nodule last week, i was told there wasnt enough of a tissue sample, they didnt get the core of the nodule. So they are basing the diagnosis on the pet/ct findings that lit up in these areas on my lung, sternum, spine, etc.  I asked the oncologist that treated me in 01 about the herceptin, he said it wasnt for hormone negative cancers??  dont know??  I am seeking another doc. this time around, and so I have to basically start fresh with getting to know another doctor who will see me through this next go around..  guess I really cant complain that doc. got me 6years in remission, so thats a good thing.. he is just not very sympathetic when I do complain about something that hurts me,  I dont like to complain anyway so when I do it is because something really does hurt..I seen the oncologist I had for first go around in April, he gave me a clean bill of health, my mammogram was clean, but I tried to tell him about this cough I have had for at least 3 years, each year I would tell him about it still hanging around, I would complain about my lower back hurting, but was told it was probably degenerative in nature and not to worry..  if it hadnt been for this prescreening xray for surgery on my left arm, I would still be walking around with this cancer raging inside me and not know it...frustrating to say the least..!!   When I told my PC doc about the cough he would say it was just drainage from my sinuses..  it is a constant tickle, and when i eat or drink it became alot worse..  finally I feel validated although I hate it that now I have to face what I am..  anyway, thank you for your post/ I am so glad i found this web site..I can now talk to others who are going through the same thing.. Jodie",
      "MessageIndex": 2,
      "PostDate": "23/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14591,0.htm",
      "Title": "br. ca. returned and is now mets.."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/9/2009 Neveah wrote: I don't understand how did you go from having stage 0 breast cancer and then having it to return and come back later in your liver?  I thought that once you survive stage 0 cancer that you are cured. Neveah:  I had stage 1 in 01, I was treated aggressively then I went 6 years no recurrence.  Then in May of 07 it was found in my right lung and mediastinal lymph nodes and the right side of my neck.  So unfortunately if cancer is found at an early stage there is no guarantee that it hasnt already spread through out the body to become stage lV when it recurs.  I had a tiny less than 2 cent. tumor in 01.  I had a good prognosis after treatments.  There was no under arm lymph involvement at all.. mine was able to spread through the lymph nodes in the center of my chest and avoided being detected until 07.  Believe me, it was a real blow and shock to find out that it went from stage 1 to lV.  But it can and does happen alot!  I am stage lV now, have had treatments and my cancer is currently being controlled by herceptin since I am her2 positive.  So far so good too! Thank God for the herceptin.  My cancer has proven that it will come back if I am not taking this life saving medicine.   Best wishes to you all. Jodie",
      "MessageIndex": 3,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40470,0.htm",
      "Title": "breast cancer state 4 in the liver"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 11/30/2008 dixielee wrote: Hello, just wandering if anyone might have some wigs to donate. I've just started losing my hair but can't afford to buy a wig yet. Scarfs, turbans or anything would be appreciated.                                                                           Thanks very much and                                                                           God Bless us all. I meant to add: If you get a wig.  Try to go short and close to your face.  I have found that they look more natural than a long or curly style..but of course it is according to your own likes and tastes.  I went from Jan. of 08 to June of 08 before I finally had enough to comb.  I went with a wig only for special occasions, other than that, heck, this time around I just opted to go with a hat..it worked out just fine.  People dont really notice this stuff anymore..there are so many who are suffering hair loss because of the same things and people (the public) are use to seeing hairless women around town.  My heart goes out to them when I see them, cause I know we probably share a similar cancer story, and I know how they are feeling.  My prayer goes out to them, not my concern about them being hairless,  but the concern about what I know they are going through that no one else but me understands, except another cancer patient.. So wear your baldness proudly and love life!  The baldness is temporary...and hopefully your cancer will be desentegrated into nothing from the treatments..and this will just become a story in your life's journey.. God bless. Jodie",
      "MessageIndex": 4,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30791,0.htm",
      "Title": "wigs"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Tomorrow I go for what is hopefully my next to last chemo treatment for stage lV br. cancer..  I am having Avastin & Taxotere..  I thought I had my last one on the 24th of Oct. but recent pet/ct showed 3-4 active areas of cancer that had not responded to first 5 treatments.. I am not looking forward to these two..I know though, that now I am fighting a meaner stage of this disease, and this could and most probably is just the beginning of a long road to go for me..  The br. ca. mets was discovered in my lung..solely by accident because of an orthopedic surgery on my left arm..a pre-screen chest xray revealed the lung nodule, and then a pet/ct in June showed how active the cancer was in my medistinal lymph nodes and neck area.. the 5 treatments were able to disolve the lung tumor,  but the ones in my sternum lymph system are still being contrary.. It is weird, because I dont feel like there is anything going on at all..cancer is definately a silent disease..it takes alot of cancer in our bodies I guess to make us feel the effects of it..  my oncologist is hopeful that a remission can be achieved..all I can do is be hopefull at this point..  I have had a four week break between these treatments and it has been great!  I was able to get back to normal as to how I feel..  I am loosing my hair though, and with these next two treatments it will finish off what hair is trying to hang on to the top of my head..  This is my second go around with br. ca.. it was initially diag. in 01..it was very tiny..only 1.6cent.  no nodes positive. This mets has come out of no where!  It layed dormant I guess..for over 6 years.. very strange they say?  Like most cancer fighters, I had my moments of paranoia and wonder about when or if this disease would come back.. but in April of this past spring I had finally made a concious decision to block this stuff out of my mind and just live my life without that fear..well BAM!!!  It took me by suprise again.. like it did in 01 when they told me I had it..  I have gone through the usual ups and downs now with it..worry of the survival aspect, and wondering about my future...but I have just decided to try and get through these treatments..and just have a frame of mind that I have cancer, it doesnt have me!  Weather I live or die early or later in my life is soley up to God..  he knows the outcome..right? I find that if I block it out and concentrate on other things going on in my life that it does help.. None of us knows what tomorrow will bring, or what our future will bring.. there is a hymn and it says, I dont know about tomorrow,  but I know who holds my hand in the end no matter what..that gives me a sense of calmness..and I hope it will others who are facing this same disease..  God bless all who are going through these dreaded treatments..God bless all who struggle to find their quality of life through all of this mess..  I have decided that if it comes to a point that my cancer is becoming to aggressive and nothing is slowing it down, that I be given the courage to say enough, and just have quality of life for the remainder of life I have...  Sorry, to anyone who reads this..I just had to get this out.. I like this web site it has proven a very valuable tool for me to come here and read stories from others who are facing these awful diseases that life throws at us..  I hope now, that these 2 treatments I have coming up in these two weeks..will prove somewhat successful, and I will have a long break before i need anymore..  One can only hope and pray..right? God's Blessings to you all.. Jodie",
      "MessageIndex": 0,
      "PostDate": "04/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18629,0.htm",
      "Title": "medistinal lymph nodes still show active br. ca."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 12/5/2007 Leemg wrote: My thoughts are with you Jodie.  That Avemar sounds pretty hopeful!  I have also read several pieces of info on the benefits of  Vit. C intravenous therapy and alternative treatments used to cleanse the body of toxins.  A woman my husband works for sent me an issue of someone with stage 4 who found these supplements and diet 5 years ago and has since had about 300+ woman working with her.  Unfortunately, I cannot find the article for any more specifics but maybe you can look into this in your area.  I do know a woman I work with has a sister who is over 14 years with stage 4 BC.  When she was diagnosed she went to a clinic up in NY and went cold turkey and began a specific diet, meditation etc.  I don't think she is as strict as she once was in following this regimen but is still living a normal life.  I received a Healing Prayer Book in the mail and this is what is says:  The practice of medicine remains, at best, an inexact science.  There are cases where drs. were wrong or where sheer determination conquered an illness.  There are \"miracles\". (excerpts) Because of these things, we can and must always keep alive the hope that health problems can improve.  Our bodies are wonderful creations with untold powers for healing and regenerating.  Even if a condition is irreversible, often it is through our health problems that we can find the pathway to developing our talents in new and different ways.  God gave us the gift of life and has tremendous power to guide, direct and assist this healing process.  Through prayer, we bring our health needs to the Lord, asking for His help and healing and accepting His answer as His will for us.  May God give you his guidance to live out His will.  I will pray for you as well. Thank you for your reply.. I appreciate any information at this point.. I found out today after talking with the dr. following my treatment today that I am in no way close to being done with these things.. I have one next week, and get a break around Christmas, and then I go again the 9th of January..I guess I shouldn't be suprised, but I was sure disappointed and am a little depressed today..  I do rely on guidance from God..more than he knows..and he knows everything..!  I am still in hopes that there will be an ending or a long break in these treatment regamins..they are grueling..I dont get that sick from them, they are just not what I want to be spending my time doing...  I hope that God can direct me into something positive and beneficial to others after I have gone through this stuff..I would love for my life to count for something wonderful and to be able to give  back for all of the blessings I have been given in my lifetime.. thank you again..and i will give your recomendations some thought.. Jodie",
      "MessageIndex": 4,
      "PostDate": "05/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18629,0.htm",
      "Title": "medistinal lymph nodes still show active br. ca."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 7/21/2008 Leemg wrote: Have they checked your ferritin levels (iron).  I had a low red blood count which lead to iron deficient anemia.  To confirm this they specifiically have to check the ferritin.  Many of the symptoms you mentioned I experienced.  I never realized it until my medical oncologist called me.  I had to go on and actually I'm currently on iron therapy.  Leemg: No I wasnt aware of the ferritin levels? I will ask them about it next time though.  This certainly sounds logical and could be the culprit.  I know it would help me if I could take a daily vitamin supplement that included iron but I have frustrating GI upset when I take some medications.  So this stirs me away from taking anything other than what I need to for pain or what have you.  Thankyou though for your message.  I will check into the ferritin more. Hope all is well with you today, and your cancer struggles are being managed and under control.  That is always a good feeling! take care. Jodie",
      "MessageIndex": 4,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26233,0.htm",
      "Title": "CBC readings...red blood cells a little low?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 7/8/2008 my Life wrote: Hello i'm 36 year old and i have breast cancer. I'm not sure what to do. (scared) i have went to alot of doctors and i'm numb. Can't believe this is happening to me. I have a brain tumor that i found out about when i  was 28. I have been dealing with that just don't know what to do with this now. I don't understand why i know that i need to be positive about this but  i'm just scared i've nerver had to deal with cancer. My father passed away of gbm-4 brain tumor. Is there question i need to ask. I want a mastectomy. I have 15 to 20 masses in my left breast they did a biopsy on 6 and 4 came back positive for cancer. Any suggestions would help. My life. Hope          Dear Mylife: I am very sorry and sad to hear about your new cancer diagnosis..and at such a young age.  I agree with the other poster on here.. and I hope you can get this monster under control..  Find a Good team of specialists who will listen to your concerns and listen to how you feel and how to advise  you on proceeding with your treatment options.  I think you need to be totally involved in the decisions concerning your cancer fight..  Keep records of your own..xray reports, films, etc.  Read/read/read and learn all you can about your disease and the treatments offered...when I was first diagnosed in 01,  I would spend hours reading..and I am glad that I did..  when the cancer teams talk about something pertaining to your cancer it will help you understand it all alot more if you have already gained some knowledge on this stuff.. it can be mind boggling..but SO necessary to know about.. This web site is a wonderful place to get alot of information..and most of it is first hand knowledge from cancer fighters/caregivers/etc.  Knowledge is power!  Be strong, be a fighter, be a Survivor!! Best of wishes to you.. God's blessings.. Jodie  ",
      "MessageIndex": 2,
      "PostDate": "10/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25831,0.htm",
      "Title": "First Stage"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 7/11/2008 tomslady wrote: Thanks to all of you for your encouraging words.  I have had a very deep discussion with my husband since my posting and he has made himself very clear that he is here for the long hull. He loves me and we will get through this together. If all of this is for just one day longer it is worth it. He is wonderful husband and my very best friend. I have spoken with my surgeon today and we are going to have this new test done to find out if chemotherapy will even help me in the future other wise they will simply just do radiation. This is the first time my surgeon is doing this test she is very excited and thinks I am the perfect canidate for this study. It is something they do with the tumor they removed that helps to determine reaccurance risks. If there is not a great risk of reaccurance they will decide on whether it would be worth going through chemo or not. It is an expensive test but she is trying to figure out a way to get insurance to pay for it since it would be less expensive then chemo if it shows that that is not neccesary.  The only thing very frustrating right now is I can't get in to see the cbc until 8/1 and the radiology team on the 5th. The waiting is the hardest part right now. I am going back to work on Monday until we find out the next step we need to take. Not looking forward to all the questions and how are you's but the alternative sucks too. Well I will close for now and thank all you for your kind and encouaging words. I will kepp you posted on the progress made and let me know how all of you are doing as well.   Thanks and God Bless, K Tomslady: I am also cheering for you, and very happy to hear that you will have a great support system in place while going through what may be a rough time for you and your family.  It sounds like you are coming to grips with what you have ahead of you now.. there will be ups and downs..and at times it will feel like the downs are more than the up days..but you will get through it..  I have a tshirt that says...I  will fight, I will win, I will be a survivor..and I have to reread those words on that shirt every now and then to encougage myself to keep on going with the treatments I am having now.  I initially had just a lumpectomy..and so far that is all that I have had to have done surgically as far as body part removal...my cancer spread anyway before it was even treated the first time around..so it really made no differance with my situation if  I had gone on with a mastectomy..my outcome now is stage lV and so the mastectomy wouldnt have caught it or kept it from spreading..thankgoodness I havent had to endure the mastectomy..I know for me, that would be an awful ordeal to experience..I know I would have gotten through it but I just feel very fortunate that I havent become one of the many women who have lost a breast from breast cancer..so I really can not relate to what that would be like.  But I have had the other traditional treatments both in 01 and now..   I was not aware of the test that you are discribing...sounds like the test they do for the Her2 gene?  Nonetheless, it sounds like a good idea to keep from putting women through unnescessary treatments.. I had been having the cancer blood testing yearly since 01 for the markers that are normally looked at to detect a recurrence of the disease..it wasnt helpful for me... My cancer came back and was very sneaky about doing so,  it didnt even follow the usual rule of thumb about where it showed up first before it became stage lV, 6 years later..  and still after the cancer was detected in my right lung my cancer markers did not go up in the least.   Anyway, so glad to hear about your decision to push forward and do what you can to gain control over it at this time.  I wish you the very best... Jodie",
      "MessageIndex": 3,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25942,0.htm",
      "Title": "thank you"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Just wondering if anyone else having herceptin treatments are experiencing a low reading on thier CBC's.  I am having herceptin treatments every three weeks as is usually scheduled for this treatment and of course I always have my CBC before the treatment..  my red blood cell reading is almost constantly a 3.85 or something and the normal readings are suppose to be within 4.5 and 10.0K/mm3..  I do experience being tired and run down feeling, cold..even now with it being hot summer time I am sitting with a blanket throw on me in the house.    Is anyone else on this breast cancer treatment regimen having similar experiences.  My feet are cold alot..and I am having the awfullest pain in my legs..calves, upper thigh in the back..  I have mentioned the pain in the legs to the nurses and the dr. did give medication for that but it isnt helping me..   When the nurses go over my CBC counts with me prior to my treatment they always say that they look good..my hematocrit was 36.1 and the norm is suppose to fall within 37.0- 47.0.  I have repeatedly asked the nurses if the low red blood cell count would account for my tiredness and of course they say yes but never offer much else as to whether it really should be this low..  and if I should be doing anything to bring it back up more to norm before my next treatment..  with the pain in my legs and this coldness to my extremities.. I am always wondering about whether the herceptin is causing my heart to not pump normally.  I have had a muga scan last month and as far as I know it came back ok..  so I am just curious if anyone else on this herceptin is experiencing similar pain and low red blood cell counts?  My best to all of you.. Jodie",
      "MessageIndex": 0,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26233,0.htm",
      "Title": "CBC readings...red blood cells a little low?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 5/30/2008 Graces Daughter wrote: My mother just died last Thursday of metastatic breast cancer, she went every year for her mammogram because her mother died of breast cancer.  The doctors told us mammograms sometime don't pick up everything so I go for mri's plus mammo's.  The past couple of times I've gone for mri's they say they are watching something in my right breast, and I've been going every six months.  I tell my gyno that my right breast is sore all the time, but he assures me he feels nothing and not to worry.  I have had calcifications removed two years ago but they were not cancer.  Should I sit and wait? Dear Grace'sdaughter: Sorry to hear about your Mom...I can relate as I am now battling mets breast cancer although for now I am in clinical remission...  I had no family history of breast cancer, I had been recieving mammograms since I was 40 every year..  I had a biopsy in 95 which was benign so when the same situation came up in 00 I opted not to worry about a suspicious place that did show up on the mammogram..well in 01 my yearly mammogram was delayed a few months and then when I was finally able to have it done the place in my left breast where I had been feeling some discomfort was actually an invasive br. cancer.. they say there is no pain, but for me there was, but as I have understood that there is suppose to be no pain with cancerous lumps I would have just ignored the pain if I hadnt by chance been due for that mammogram in 01..  I went through the whole bit that year.. chemo, radiation..and had gone 6 years without a recurrence in that breast or axilary lymph chain.. last spring of 07 I had to have surgery on left arm..I had a prescreen xray of lungs which showed up the lung nodule which turned out to be breast cancer mets to several lymph nodes in sternum and in lungs..  I have been treated and for now I am out of the woods..and in remission..  point to my story I guess is, I think that at times cancerous lumps can be a little painful...at least it was that way for me...so it is worth getting this stuff biopsied to make sure of what is really there....  I had an oncologist that told me that the only real way of knowing if its cancer for sure is to biopsy...  if they I hadnt had the biopsy last fall its not sure if they would know even now that I actually had breast cancer mets because it didnt follow all of the usual patterns to return as mets without showing up in the other obvvious places first.. this stuff went straight to my lungs..it was SNEAKY...to say the least!  So if you are concerned about an area, keep letting your dr.s know how concerned you are no matter what they say and do your best to make sure instead of wondering...  My best to you, and again, very sorry to hear about your Mom...every time I hear someone loose their fight to breast cancer now, it hits home for me really hard... because I know that I too will face that eventually since I am already in the 1Vth stage of the disease inspite of being in remission.. I know it may be short lived..although I know I must try not to think that way.. Jodie",
      "MessageIndex": 3,
      "PostDate": "31/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24540,0.htm",
      "Title": "breast mri"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "hello, I have posted other messages here before, and have always been informed from others going through similar treatments.. last week I had my 1st herceptin drip treatment.. so far not to bad.. I expected worse, and have been given better!  The only thing I have noticed and the dr. doesnt seem concerned about is chest pain which could or may not be related to the heart at all but it has just started since taking the herceptin last week.. I know this medicine is toxic to the heart, and they did an efraction injection the day before I started this treatment.. but didnt get the results back as to what the heart scan showed..  should I be concerned about these pains or just figure its part of the side effects.. the one thing I did have was the night of the treatment I had terrible chills, fever, and body aches.. much worse than I was told they would be.. they went away the next day.. I just wanted to ask others who may have taken this medicine what their experience has been?  I am Her2 positive and was in 01 when my first breast cancer diagnosis was made and treated.. the onco I had then didnt suggest I be given any herceptin to ward off any recurrence and so it is now metastatic in my lung area.. new onco dr. wants to keep it from spreading into other areas of my body so he has put me on the herceptin drip ever 3 weeks and hopes to put me on the pill form of this medicine if it proves beneficial after my next pet/scan in June..  I really dont want to have to take this stuff for the rest of my life... I am hoping for a break in treatment for a few months if things look good in June.. has anyone else had this and been able to take periodic breaks in treatment to give the body a chance to regroup? love to hear from you.. JODIE",
      "MessageIndex": 0,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22299,0.htm",
      "Title": "1st herceptin treatment"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 3/28/2008 starfire774 wrote:   On 3/24/2008 Jodie wrote: hello, I have posted other messages here before, and have always been informed from others going through similar treatments.. last week I had my 1st herceptin drip treatment.. so far not to bad.. I expected worse, and have been given better!  The only thing I have noticed and the dr. doesnt seem concerned about is chest pain which could or may not be related to the heart at all but it has just started since taking the herceptin last week.. I know this medicine is toxic to the heart, and they did an efraction injection the day before I started this treatment.. but didnt get the results back as to what the heart scan showed..  should I be concerned about these pains or just figure its part of the side effects.. the one thing I did have was the night of the treatment I had terrible chills, fever, and body aches.. much worse than I was told they would be.. they went away the next day.. I just wanted to ask others who may have taken this medicine what their experience has been?  I am Her2 positive and was in 01 when my first breast cancer diagnosis was made and treated.. the onco I had then didnt suggest I be given any herceptin to ward off any recurrence and so it is now metastatic in my lung area.. new onco dr. wants to keep it from spreading into other areas of my body so he has put me on the herceptin drip ever 3 weeks and hopes to put me on the pill form of this medicine if it proves beneficial after my next pet/scan in June..  I really dont want to have to take this stuff for the rest of my life... I am hoping for a break in treatment for a few months if things look good in June.. has anyone else had this and been able to take periodic breaks in treatment to give the body a chance to regroup? love to hear from you.. JODIE Hi Jodie,   I have been on Herceptin treatments every other week since Feb 07  I have to say I haven't had any side effects from it except for feeling more tired on the days I have the treatment.  I did have to take a break while they did a cardiac work up on me for shortness of breath.luckily every thing is alright.  Yes I would be very concerned about the chest pain and have it checked out even if it turns out to be nothing. it will ease your mind and you have enough to worry about.  I have a MUGA scan or a Echocardiogram  every 3-4 months to monitor for the toxic effects.  I am also HER2 positive and ER positive the herceptin is much easier to take than the Aromatase Inhibitors I have to take for the next 7 years.   Do they give you any premeds with the Herceptin they started out giving me Benadry IV before the 1st few treatments in cause I had any side effects. Good Luck, Carol    Carol: Yes they give me benedryl and tylenol..that seems to be all i really nead with this..as there is no nausea..when I had the avastin/taxotere yes they loaded me up with pre-meds..too much infact..I was sleepy from the benedryl  and nausea meds then they woke me up when they gave me the decadron..this herceptin thank goodness isnt like that.. I have noticed though that my hair doesnt seem to be coming back in like it should and as one of the people wrote here she found the herceptin treatments did slow down the new hair growth..  I am going to do three months of this herceptin or i should say until the end of May or June when they do another petscan and I also have a wedding cake to do the 10th of May and dont want to be on any meds for safety & wellness feelings sake and so i am opting to not have any treatments until after the 10th of May after this one the middle of April.. the herceptin does make me feel a little run down..and I dont want to feel that way trying to accomplish a huge project like that.. I was having some chest pains and still do some, but I guess they arent to be concerned with unless I keel over from a heart attack!  The dr. did check my heart for blood flow function and I guess the test came back ok because they went ahead and gave me the herceptin anyway.. That is strange to be er positive and her2 positive as well..my cancer was negative for the hormones so I have not taken any hormone inhibitors..I am already post menopausal..thank goodness!  I dont like the idea of having to think about taking any long term medicine for this cancer for the rest of my life..but I guess I just have to see my self as a diabetic who is trying to control my disease..that is the only way I can cope with having to continue on a medicine that isnt good for the rest of me health wise...it controls the cancer and otherwise my body doesnt want the stuff in there..I'm just not a medicine taker, never have been to much..I am taking a vitamin now though for my eyes..I was told a week ago that i now have the dry macular degeneration in one of my eyes..I'm thinking great!   If the cancer dont get me I will end up blind!!!!  Its always something anymore it seems..?  Seems like after i turned 50 everything with my health started going down hill.  Thats why they tell us when we are younger to take care of ourselves I guess?  Dont know what they mean till we get to this point and we are falling apart.. thankyou for your reply..it was most helpful..and thankyou to the others who also posted on this topic..I enjoy reading about others who have similar experiences that I can relate to..not enjoy to the point of glad they are in this with me..that is a dreaded thing..wouldnt wish this on anyone..but it is nice to know there are others to talk to who understand how I am feeling and how scarey this stuff can be for us.. Gods Blessings.. Jodie  ",
      "MessageIndex": 4,
      "PostDate": "31/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22299,0.htm",
      "Title": "1st herceptin treatment"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 7/18/2008 trehouse60 wrote: I'm not real familiar with Herceptin and haven't had time to research it, so I'm not going to comment on the blood counts and leg pain.  I do, however, have a thought about the cold extremities.  Do you have a port, and if so, are you getting blood thinners (either IV heparin or coumadin by mouth, or one of the other blood thinners)  to keep it open?  If so, that could well be what's making you feel cold. Unfortunately, if that's the case, there's not much I know of you can do about it, other than bundling up.  Increasing you iodine intake just a little (kelp tablets, maybe)  and eating more thyroid healthy foods might help, but you really need to ask your doctor if that is ok, first.  Also, ask the nurses if they know of any tricks to keep yourself warm.  Sometimes support staff will know stuff the doctors don't. Sincerely, Tre Thankyou Tre, for responding.  I never thought about the heparin till you have mentioned it..that is probably what causes me to be so chilled.  I do have a port and recieve heparin to keep blood clots at bay.  That does explain alot about that complaint..  no I'm sure there isnt anything to be done about that.  I was told that the leg pain is probably neuropathy from the taxotere treatments I had last fall..my last ending in January.  I hope that isnt the case as I have been told that, that means that my nerve endings are dieing off..that isnt a good thought either?  I was kind of wondering about it being possibly bone pain from mets from my br. cancer to my legs..I had a good pet scan in May which showed no problems any where for now..but this pain has been recent in occuring and it seems to be worse when I have been on my feet alot or up and down the stairs or just carrying my grandson around..  can anyone tell me what if any pain is associated with mets to bone..so far my mets has been localized to the lung area..but I know it is always possible now for it to show up in these other vulnerable places.  Are you a cancer fighter/survivor?  I have stage lV br. cancer..my fight began in 01 with just a tiny cancer removed from my left breast.  Had 6 year remission time..then last May it showed up in my lung..I had 6 months of chemo..taxotere and avastin...and I am now having the herceptin treatments for a her 2 positive situation.  I was seeing the dr. once a month but now it is every three months since I was put into remission in May.  I dont like running to the dr with minor issues, especially if they are just minor complaints they cant do anything about.  I dont always want a pill for the problem either, I just like knowing what is causing it?  Anyway, thank you for your response..the heparin is definately the deal that could be causing both the low red blood cell count and the fact that I am cold all the time.  My best to you as well. Jodie ",
      "MessageIndex": 2,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26233,0.htm",
      "Title": "CBC readings...red blood cells a little low?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Well yesterday I had my first chemo treatment after a 6year remission time,  it was scarey and I almost wanted to cry when I sat down in the recliner and the nurse proceeded to access my port for the iv's.  The reality hit me, that now I had to endure this,  it has been a 4 month wait for the final diagnosis and now the treatment to help my body fight this stage lV breast cancer..   Well, today is a miracle in my book, I am having no side effects so far..except for a little rash, and tenderness inside my mouth..last night I had muscle pain and the hand and feet tingling, but today it is gone..I feel so good!  I was expecting the worst to happen..I'm a little tired, but other than that not to bad!  I was given Avastin and Taxotere..  the new nausea meds. are wonderful!  I cant believe it that I havent even had that yet..unless it is still to come after what they gave me wore off..  and I was worried about diarhea, my usual complaint when I take any kind of medicine...but not yet?  So if this stuff, controls my cancer this easily, it will be a walk in the park for now..I just had to write, and let others know my experience with these two meds.. of course everyone is differant, and experience differant side effects..but for me, this time my prayer was answered and God is sparing me at least the pain of the dreaded side effects of the meds..he knows the outcome anyway, right?  My breast cancer was sneaky, it didnt come back locally or lymph node, it came back in the mediastinal lymph system in the sternum and now is in my lungs..so far no where else that I know of..so hopefully I have been given some good news out of this whole nightmare of a disease..things may be looking up now for a while..? well, thankyou for allowing me the privilege of posting on this web site it has been very informative and helpful for me through this ordeal.. JODIE",
      "MessageIndex": 0,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16130,0.htm",
      "Title": "avastin/taxotere..1st treatment update"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 9/13/2007 Carolina wrote: Hi there, I haven't visited this website in quite sometime but I saw your e-mail about your 1st chemo treatment after a 6 year period.  I, too, wondered how you discovered the cancer?  Also, I was wondering along with others if you had been on Tamoxifen or Aremidix?  My prayers are with you, sister!!! Carolina:  I responded to you in private but I guess I should have done so also on here..I thankyou for your concerns as well,  yes we are br. cancer sisters arent we?  I wont write all that stuff out again as i just did publically with the other responder above,  but this br. cancer coming back as stage lV when it was initially on stage 1 with no nodes possitive has been a shocker..but for some unknown reason, in the back of my mind I always knew it would come back stage lV..no good explanation for that, just insight or gutt feeling about it..I guess partly because I didnt think my first ca. dr. would take me serious when I made a complaint I felt was important...and he didnt..if it werent for my arm getting surgery in May of this year, i would have gone till next spring again before i seen the other onc. dr.  I have a new one now, and he is very thorough..if I complain about something that is substantial he acts on it..instead of saying oh its probably nothing..but anyway, like I said..I guess God knows the outcome of all this anyway, all I can do is go now and try to do my part in taking these treatments and hope that I am suppose to get another 6 years in remission out of it..I have been on this paranoia trip so many times..and I finally quit telling dr.s stuff out of fear i would come acrossed as a hypocondriac..so finally my fears have been validated and have come to life and i find myself again fighting this disease...but at least this time, so far, I feel pretty good after this first treatment..I hope this continues with the next 5 that I have to have, but I know that with each one they may get a little harder.. thank you..God's Blessings your way...I hope you go a long time before you have to fight this junk again.. Jodie",
      "MessageIndex": 4,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16130,0.htm",
      "Title": "avastin/taxotere..1st treatment update"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/23/2008 K. C. wrote:    Good Morning Everyone; I usually post under the Multiple Myeloma site but during some research I stumbled upon this article and thought I would share it for your review: FDA Grants Accelerated Approval of Avastin in Combination With Paclitaxel Chemotherapy for First-Line Treatment of Advanced HER2-Negative Breast CancerFebruary 22, 2008 4:04 PM ET advertisement Article tools E-mail this article Print-friendly version Discuss this articleStocks mentioned in this articleGenentech Inc (DNA) Stock Quote, Chart, News, Add to Watchlist Related news Market Report -- In Play (DNA) ImClone shares rise on Erbitux outlook Business Highlights FDA clears Avastin for breast cancer Stocks turn positive after Ambac report All BusinessWire news Genentech, Inc. DNA today announced that the U.S. Food and Drug Administration (FDA) granted accelerated approval for Avastin(R) (bevacizumab), in combination with paclitaxel chemotherapy, for the treatment of patients who have not received chemotherapy for their metastatic HER2-negative breast cancer. The approval is based on a Phase III study (E2100) that showed that Avastin in combination with paclitaxel chemotherapy resulted in a 52 percent reduction in the risk of disease progression or death compared to those treated with paclitaxel alone and a doubling in progression-free survival (PFS) (based on a hazard ratio of 0.48; p less than 0.0001). The safety profile of Avastin was consistent with our previous experience and no new safety signals were observed. Avastin was approved in advanced breast cancer under the FDA's accelerated approval program, which allows the FDA to approve products for cancer or other life-threatening diseases based on initial positive clinical data. Genentech has shared with the FDA a summary of the results from a second positive Phase III trial (AVADO), and is expecting results from a third Phase III trial (RIBBON I) in first-line metastatic breast cancer in late 2008. A full review of both the AVADO and RIBBON I data by the FDA will be required for the accelerated approval to be converted into a full approval. As a part of our commitment to fully evaluate Avastin in breast cancer, Genentech will also submit data to the FDA from three additional randomized trials that are either ongoing or planned. \"There is no cure for metastatic breast cancer so it is important to control the disease as early and for as long as possible,\" said Kathy Miller, M.D., Associate Professor of Medical Oncology, Indiana University School of Medicine and lead investigator on the E2100 trial. \"Now with Avastin plus paclitaxel, we can increase the time a woman's cancer is kept under control, and offer a biologic option to women who previously were limited to chemotherapies alone.\" \"As an oncologist who has treated women with metastatic breast cancer, I know how important the first course of therapy can be,\" said Susan Desmond-Hellmann, M.D., M.P.H., president, Product Development, Genentech. \"New treatments are needed, and this approval provides women who have not yet received chemotherapy for their metastatic breast cancer a new option to consider with their physician and families.\" Breast cancer is the second most common form of cancer and the second leading cancer killer among American women. According to the American Cancer Society, an estimated 178,000 women were diagnosed with breast cancer and approximately 40,000 died from the disease in the U.S. in 2007. Genentech estimates that 75 percent of women with newly diagnosed metastatic breast cancer are HER2-negative. About E2100 E2100 was a multicenter, randomized and controlled clinical trial that enrolled 722 patients with previously untreated, locally recurrent or metastatic breast cancer. Patients were randomized to receive weekly treatment with paclitaxel every three out of four weeks, with or without Avastin. Based on an independent, blinded review of patient scans, patients treated with Avastin plus paclitaxel experienced median PFS was 11.3 months versus 5.8 months in the paclitaxel alone arm. The independent review showed a similar magnitude of benefit relative to the initial results presented by the Eastern Cooperative Oncology Group (ECOG) at the American Society of Clinical Oncology annual meeting in 2005. A secondary endpoint of overall survival was 1.7 months longer in the Avastin-containing arm (with a hazard ratio of 0.87), supporting the primary endpoint of PFS. This improvement did not reach statistical significance (p=0.14). Grade 3/4 adverse events that occurred more often in the Avastin arm included neuropathy (due to longer time on paclitaxel treatment), hypertension, arterial thromboembolic events and proteinuria. These safety findings were generally consistent with previous trials of Avastin plus chemotherapy and no new safety signals related to Avastin were observed. The E2100 trial was sponsored by the National Cancer Institute under a Cooperative Research and Development Agreement and was conducted by a network of researchers led by ECOG. Genentech's Commitment to Patient Access With today's FDA approval, women receiving Avastin for metastatic breast cancer are eligible for the Avastin Patient Assistance program that provides free Avastin for the remainder of a 12-month period to patients who receive 10,000 mg (approximately $55,000 based on wholesale acquisition cost), regardless of insurance coverage. Genentech is committed to patients having access to our therapies. Through its Genentech Access Solutions program, the company provides patients and healthcare providers with coverage and reimbursement support, patient assistance and informational resources. Patient assistance support is for those eligible patients in the United States who do not have insurance coverage or who cannot afford their out-of-pocket co-pay costs. Since 1985, when its first product was approved, Genentech has donated approximately $1 billion in free medicine to uninsured patients through the Genentech(R) Access to Care Foundation (GATCF) and other product donation programs. Since 2005, Genentech has also donated more than $140 million to various independent, non-profit organizations that provide financial assistance to eligible patients who cannot access needed medical treatment due to co-pay costs. About Avastin Avastin is a therapeutic antibody designed to specifically inhibit the vascular endothelial growth factor (VEGF) protein, a potent source of angiogenesis. Angiogenesis is a process that connects tumors to the blood supply. By inhibiting VEGF, Avastin is designed to interfere with the blood supply to a tumor, which is thought to be critical to a tumor's ability to grow and spread in the body (metastasize). Avastin was the first anti-angiogenesis therapy approved by the FDA and with today's approval, is now approved for the treatment of the three leading causes of cancer death in the U.S.: metastatic colorectal cancer, advanced non-squamous, non-small cell lung cancer and metastatic HER2-negative breast cancer. In addition to metastatic breast cancer, Avastin is also indicated for the first- and second-line treatment of metastatic colorectal cancer (mCRC) in combination with intravenous 5-FU-based chemotherapy, and for the first-line treatment of unresectable, locally advanced, recurrent or metastatic non-squamous, non-small cell lung cancer (NSCLC) in combination with carboplatin and paclitaxel. Avastin is being studied worldwide in more than 300 clinical trials and in more than 20 different tumor types. For more information on angiogenesis, visit http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. For full Prescribing Information and Boxed warnings on Avastin, visit http://www.avastin.com. Avastin Safety Avastin has a well-characterized safety profile in its approved indications. The most serious adverse events associated with Avastin across all trials were gastrointestinal perforation, wound healing complications, hemorrhage, non-GI fistula formation, arterial thromboembolic events, hypertensive crisis, reversible posterior leukoencephalopathy syndrome (RPLS), neutropenia and infection, nephrotic syndrome and congestive heart failure. The most common severe adverse reactions (NCI-CTC Grade 3-5) across clinical trials in mCRC, NSCLC, and mBC that occurred at a higher incidence (greater than or equal to 2 percent higher rate v. controls) were hypertension, proteinuria, and headache. About Genentech Founded more than 30 years ago, Genentech is a leading biotechnology company that discovers, develops, manufactures and commercializes biotherapeutics for significant unmet medical needs. A considerable number of the currently approved biotechnology products originated from or are based on Genentech science. Genentech manufactures and commercializes multiple biotechnology products and licenses several additional products to other companies. The company has headquarters in South San Francisco, California and is listed on the New York Stock Exchange under the symbol DNA. For additional information about the company, please visit http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. \" target=\"_blank\" rel=\"nofollow\">http://www.gene.com. This press release contains forward-looking statements regarding clinical study results and data, the ability of Avastin to increase the time a woman's cancer is kept under control and Avastin as a treatment option for metastatic breast cancer. Such statements are forward looking and involve risks and uncertainties such that actual results may differ materially. Actual results may be affected by a number of factors including, but not limited to, safety, efficacy or manufacturing issues, the need for additional data, data analysis, or clinical studies, difficulty in enrolling patients in clinical trials, failure to obtain full approval or otherwise maintain FDA approval, pricing, reimbursement, product withdrawals, and intellectual property or contract rights. Please also refer to the risk factors described in Genentech's periodic reports filed with the Securities and Exchange Commission. Genentech disclaims, and does not undertake, any obligation to update or revise any forward-looking statement in this press release. Contact Information: Genentech, Inc. Ed Lang, 650-467-8606 (Media Contact) Kathee Littrell, 650-225-1034 (Investor Contact) Kristin Reed, 650-467-9831 (Advocacy Contact) Copyright 2008 BusinessWire Back to Recent News Take care; Kevin Kevin: I have been one of the lucky patients to recieve Taxotere and Avastin and it has shown consideral improvement in my cancer activity..as I am a metastatic br. cancer fighter at the moment.. from Sept. 07 to Jan. 08 I have had both the taxotere and the avastin alternating with the avastin.. in Sept. I had a small tumor in my lung which was br. cancer mets to lung and other mets to medistinal lymph nodes.. the lung tumor disappeared after one dose of both med. combinations and at the end of October, a marked improvement in my pet scan showed most of the lymph nodes had resolved..and in Jan. another pet was done and almost all of the active cells had diminished.. now I am to go forward with herceptin treatments in March.. herceptin is in the same family with avastin.. as I also have an overexpression of the her2 protein gene..  it makes my cancer hard to control, but hopefully with these meds it wont be impossible.. one can only hope.. so I guess you could say I am so far a success story with these meds and what oppositive things it can do for us who fight this disease..  thankyou for your post....it was very interesting to read.. blessings.. Jodie",
      "MessageIndex": 1,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21243,0.htm",
      "Title": "ACCELERATED APPROVAL AVASTIN(R)"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 5/28/2008 butterfly14 wrote: Hi--  I had a lumpectomy two months ago with one node positive.  I just had a PET scan last week to determine our course of action and am still waiting to hear back.  What will these results tell me? Is it possible to not have to go through chemo and only radiation if my PET comes back clear? My lump had clear margins with only one node +.  Waiting for the dr call is driving me nuts.  Thanks Hello I agree with Leemg.. there are alot of things for the dr in charge to consider before offering your course of treatment.. I have had several of those pet scans since May of 07.. the pet scan is very accurate when it comes to showing if there is any cancer activity anywhere else in the body.. they are very reliable.. so if your results from the pet comes back pretty good in other words showing no active mets disease then it may be possible that they will still do some chemo and also radiation.. I had both the first go around in 01..  I had a small tumor that was biopsied and had no axillary lymph node involvement..I was negative for hormones but positive for the her2 protein which made my cancer aggressive..so I had to have chemo and radiation.. I went 6 years without a recurrence and then it came back as mets to my lung area.. never did show up again in that same breast or in the axillary lymph nodes..  which is the usual channel of travel for most breast cancers.. mine spread through the blood stream early in the diagnosis of my disease before it was treated..  it has been sneaky..to say the least!  My heart goes out to you, as I know what questions and concerns you must have now.  This diagnosis is a monster and dealing with it is horendous..but hopefully they found yours early enough that what ever treatment you have will be enough to give you a long remission...  Good luck to you.. and best wishes always.. Jodie",
      "MessageIndex": 2,
      "PostDate": "03/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24448,0.htm",
      "Title": "Lumpectomy and PET...Now what??"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 6/5/2009 debbydo wrote: Well I made it thru chemo and then radiation and two masectomys.  My biggest complaint after about after chemo was my breathing was getting bad.  I was panting with any exersion.  One year later and a new family doctor, it appears that the chemo antibody herceptin can damage the heart.  I have pulmary hytpertension now and have to take 4 high blood pressure pills to aid my weakened pulmonary artery.  washing my hair in the shower makes me pant.  this is just a warning.  Now all people will have this but i just felt like telling about it   Debbydo:  Thank you for the insight and offering your experience with herceptin here so others of us who are presently on this can be vigilant and guard our heart health.  I am stage lV br.can. patient and have been on this herceptin on and off since a year ago.  I was taken off of it in Aug. of 08 but my cancer reappeared and had to be put back on it this March.  My dr is keeping a guarded watch on my heart with periodic heart echo tests..so far, so good.  Were you on this medicine for a year?  I have been concerned about this very thing since the beginning of my therapy with taking this herceptin.  Right now though it seems its the only thing that will keep my cancer from progressing.  But without a healthy heart a person can not continue the herceptin.  Thank you again for putting your message out here for the rest of us, it is very important to guard our health in any way we can..  As I understand it the herceptin can be very damaging to the heart.. what other chemo regimens have you had?  Were you on other chemo drugs while taking this herceptin?  Just wondering if there is a connection or if this happened from taking the drug by itself..  my dr keeps telling me the only way herceptin can fail is by causing this heart problem..which will cause a discontinuing of the herceptin in most cases.  best of wishes to you.. Jodie",
      "MessageIndex": 1,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36846,0.htm",
      "Title": "PULMONARY HYPERTENSION FOLLOWING CHEMO"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 9/13/2007 Linda Louise wrote:   On 9/13/2007 Jodie wrote: Well yesterday I had my first chemo treatment after a 6year remission time,  it was scarey and I almost wanted to cry when I sat down in the recliner and the nurse proceeded to access my port for the iv's.  The reality hit me, that now I had to endure this,  it has been a 4 month wait for the final diagnosis and now the treatment to help my body fight this stage lV breast cancer..   Well, today is a miracle in my book, I am having no side effects so far..except for a little rash, and tenderness inside my mouth..last night I had muscle pain and the hand and feet tingling, but today it is gone..I feel so good!  I was expecting the worst to happen..I'm a little tired, but other than that not to bad!  I was given Avastin and Taxotere..  the new nausea meds. are wonderful!  I cant believe it that I havent even had that yet..unless it is still to come after what they gave me wore off..  and I was worried about diarhea, my usual complaint when I take any kind of medicine...but not yet?  So if this stuff, controls my cancer this easily, it will be a walk in the park for now..I just had to write, and let others know my experience with these two meds.. of course everyone is differant, and experience differant side effects..but for me, this time my prayer was answered and God is sparing me at least the pain of the dreaded side effects of the meds..he knows the outcome anyway, right?  My breast cancer was sneaky, it didnt come back locally or lymph node, it came back in the mediastinal lymph system in the sternum and now is in my lungs..so far no where else that I know of..so hopefully I have been given some good news out of this whole nightmare of a disease..things may be looking up now for a while..? well, thankyou for allowing me the privilege of posting on this web site it has been very informative and helpful for me through this ordeal.. JODIE Jodie, My thoughts and prayers are with you. Breast cancer is sneaky.  Hardly a day goes by that I don't wonder if mine will return.  How did you find out that your cancer had returned?  Were you on Tamoxifen or one of the aromatase inhibitors? Linda  Hi Linda: I just wanted to let you know that i responded to your inquiry privately, I guess i should have done so here so others could have read it, basically I just wanted to thankyou for your concerns and try to answer your questions..I learned about the recurrence by accident, I had surgery on my left arm for tendonitis, the dr. did a prescreen xray on my chest that showed a solitary pulmonary nodule, then my primary dr. sent me for a ct. which also showed the nodule, then I was sent to a lung dr. she then set me up for a pet/ct. and the cancer lit up..then i had a biopsy of the lymph nodes in my mediastinal area, and it was breast ca. mets to the lung and the lymph chain in the sternum..  my original ca. was only stage 1, with no ax. lymph involvement..it was neg. for hormones, so no tamoxifen was taken.. the only explanation for it coming back as stage lV is that it had to have spread via lymph in the internal mammary lymph chain before my treatments in 01 started..I had A/C x4..radiation x37 in 01..so it was treated aggressively..it just survived somehow..the ca. dr. i have now was so suprised that it took 6years to come back since it was an aggresive high grade of b.ca. but it has..and now I am fighting for my life for sure!  I just had to share my experience with this chemo they are giving me..I hope the side effects for the next 5 treatments are similar, but I know with each one they may be differant..I feel good today,  have been doing my usual chores around the house, eating normal, and it is such a differance from what I experienced with A/C in 01..the nausea meds are better or something?  Well enough..thank you for your post..and I just wanted to answer you privately as well as here to let you know I appreciate your concerns..I hope everything is gonna go well for you too! Jodie  ",
      "MessageIndex": 3,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16130,0.htm",
      "Title": "avastin/taxotere..1st treatment update"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/4/2008 pmvjsw wrote: Jodie: Also, your doctor might not know about it as the first reports on the trials were only just published in a medical journal in February/08. If you Google Brooke Army Medical Center and look around the web site you'll find out more about it. If you call them they can tell you the hospital closest to you where trials are being done. I'm also her2/neu positive -- just got my path report from the surgeon 2 days ago. He told me nothing about it, just focussed on how I had only 3 nodes positive, which he seemed to think was good. I came home and started researching, and now I'm really scared. Do you know anything about higher recurrence rates for her2+? Pauline P.S. I just wonder if this is the avastin medicine that is now the vaccine for the herceptin..herceptin is the same kind of medicine as Avastin which was approved recently to be used intraveniously for breast cancer patients..I have already had 6 months of this kind of treatment..infact the herceptin and Avastin is made by the same drug company.. Does anyone else know?  Is this hercepting vaccine the same as the avastin? just wondered.. Jodie",
      "MessageIndex": 5,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22681,0.htm",
      "Title": "HER2/neu vaccine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I would like to know how long others  have been on herceptin maintenance doses for her 2 post. br. ca.?  I have stage lV breastca. to lung, it is now in remission, (thanks to herceptin)..but I am wondering, now that I have been on it for a year, what now?  Will I remain on it, or will the dr. want to take me off until there is a definate progression of my disease?  Just curious??  Thanks everyone! Jodie",
      "MessageIndex": 0,
      "PostDate": "04/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44719,0.htm",
      "Title": "maintenance on herceptin"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/4/2008 pmvjsw wrote: Jodie: Also, your doctor might not know about it as the first reports on the trials were only just published in a medical journal in February/08. If you Google Brooke Army Medical Center and look around the web site you'll find out more about it. If you call them they can tell you the hospital closest to you where trials are being done. I'm also her2/neu positive -- just got my path report from the surgeon 2 days ago. He told me nothing about it, just focussed on how I had only 3 nodes positive, which he seemed to think was good. I came home and started researching, and now I'm really scared. Do you know anything about higher recurrence rates for her2+? Pauline Dear pmvjsw My dr. hasnt mentioned this vaccine but I am to see him next week and will ask him about it?  I know that her2 is a more serious agressive nature of br. cancer..but as I read here from others who have been taking the herceptin for a while that it does seem to offer that glimmer of hope and survival time to all of us who have found ourselves with this aggressive beast.. I am also stage lV, it was found in my lung after 6 years in remission..I was axillary node neg, and er..pr. negative..which also is suppose to make it more of a monster to fight..but all i can do is hope that the herceptin shows some progress in slowing it down and keeping it in remission for a while.. my fear is a brain mets showing up, as I have read that her2 pos. and er..pr. neg..breast cancer is bad for metzing to the brain and then is when it gets tricky to treat because of the brain barrier to keep the chemo from helping it there.. I had lymph node involvment this time around in my upper neck area as well, so that tells me that this stuff is trying to travel upwards into my brain.. it would appear that way to me anyway.. but cant walk in fear..just gotta take what lies in front of me now..none of us are promised tomorrow..only each day we wake up and see the sun shining..so we have to be happy about each day and try to just live as normal as we can without the paranoia..even though it is so hard to do..!!  It sounds like maybe they caught yours early and it has not metastasized to other areas yet..  that in itself is good news.. if you are on the herceptin already then that is good too.. I wasnt offered that to prevent recurrence for those 6 years I was in remission..I dont know why?  It may have made the differance in my mets not being here now..but who knows? I'm just glad I have an onco dr. that is ready to fight this beast with everything he can throw at it as it becomes available and approved for use.. i will ask him about the vaccine though.. that sounds very promising!!  thank you for sharing that and the extra info you have mentioned here.. God's Blessings Jodie",
      "MessageIndex": 4,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22681,0.htm",
      "Title": "HER2/neu vaccine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/3/2008 pmvjsw wrote: I've just been diagnoses with her2/neu pos, hr pos BC. I read of a study at Brooke Army hosp in texas where they have devloped a vaccine for her2/neu pos BC to be used after treatment, and now, in phase 2 of trials they are finding it reduced recurrence by 50%. Has anyine else been in this trial or know anything about it? ALso, what is the recurrence rate for HER2/neu HR pos BC? I think it might be quite high and I'm feeling very scared. It seems survival rates are low in the stats I'm seeing. I start chemo in a month. Hello pmvjsw this is very interesting to me as I am now going through herceptin treatments for Her2 positive br.ca.. I had my second treatment yesterday and have been told its probably going to be for a year..a vaccine sounds encouraging if they could give me that instead..is this a one time vaccine?  you said its still in clinical trials?  My dr. hasnt mentioned this to me at all, just the pill form of the herceptin.. I am leary of clinical trials..dont know why, I just am!  The idea of taking these chemo drugs that have been approved bother me enough without taking a drug that they arent sure of the side effects..  I guess that is how they do learn though..it just isnt something I would want to try out for myself..  thankyou for posting here and letting me know about this vaccine..hope we all hear more about this in the future.. sincerely Jodie",
      "MessageIndex": 1,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22681,0.htm",
      "Title": "HER2/neu vaccine"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 10/4/2008 JimNation wrote: My beautiful 48 year old wife just had a bilateral mastectomy. On the oncologist's recomendation she is going to undergo Cytoxan and Taxotere therapy (4 treatments at 3 week intervals). Among other things, she is concerned with hair loss... if she is going to lose it she  wants to act proactively -  cut it off first- donate her hair -  shave her head- have it henna \"tattooed\" and wear it proudly....   This is clearly about her keeping control of her life, her appearance and her femininity. her first choice, of course, is to keep her hair. She asked me to come on line and find out what she should expect as far as hair loss goes... does anyone know what percentage of women on this therapy regime experience hair loss?  Bless you all, a loving husband Dear Jim: Sorry to hear that your wife is another cancer fighter in the midst of her personal journey with this dreaded disease.  I had taxotere/avastin last year until January.  The taxotere will cause hair loss.  The doctor had initially told me no, that he didnt think I would experience hair loss, but he was wrong and I did!  After my last dose in January it took several months for it to come back, infact in May I still had to wear a wig to a wedding event..but in June, July it really started to come back and now it is full.  The bad news is, I have to start chemo again tomorrow with taxol which is similar to the taxotere and I know now that I will again experience hair loss.  I wore a pink ball cap and sometimes a wig..it just depended on how I felt that day.  Some days I was proud to wear my shining example of my struggles and cancer fight and then other days I was a little more insecure and felt I needed the hair.. but, I am not that concerned about that aspect of fighting the disease anymore..I am only concerned with hopefully being here to tell about it all in two years.  My br.ca. came back in my lung last year..I fought it and thought I would be cancer free for a while..well last month my new petct revealed another tumor in my lung.  So inspite of being on herceptin which was suppose to keep it from coming back, I am again facing another battle to try and destroy this new nodule in my lung.  The bad thing about cancer...it has to many friends in our body and they like to have a party in there without us even knowing.  Anyway, just wishing your family the best and wanted to let you know that the taxotere will cause the dreaded hair loss..it is good to prepare for it ahead of time with a wig or hat or however your wife chooses to deal with it.  best wishes Jodie",
      "MessageIndex": 3,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28972,0.htm",
      "Title": "Hair Loss with Cytoxan and Taxotere Therapy"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 9/4/2009 vee345 wrote: My friend was just diagnosed with stage I breast cancer. She's very lucky to have caught it so early, but she's running into some problems with her insurance company. Does insurance have to cover the complete cost of reconstruction surgery/surgeries? She would prefer to have reconstruction done, but finances are extremely limited at the moment and she cannot afford what the insurance company says it will not cover. Thank you for reading and bless you all on this fight. Dear Vee:  I dont know if this will help, but I found a memo from one of our past heath insurance providers that says that Jan. of 1999, there was a federal mandate that requires all insurance providers to cover reconstructive surgery for all mastectomy patients.  Of course there still may be the usual copayment, or deductible that is required or appropriate for such service.  But, I hope this is helpful to your friend.  This was through the BJC health systems in the midwest or st.louis area.  best of wishes to you and your friend and so sorry to hear your friend has joined (unwillingly of course) the breast cancer fight.. i wish her well..and hope she has a long remission time.  Jodie I am a stage lV breast cancer survivor of 2 years.  My mets was found in 07..so far so good as long as I remain on the herceptin that keeps it under control.  I had a small tumor orginally in 01..no nodes affected or any other problems.. I was in remission for 6 years, then in spring of 07 a nodule was found in my right lung..after a biopsy, it was found to be breast cancer mets.  I had not had any other symptoms that my cancer had already spread away from the original site.  Of course this was a total shock..so all I can say is I hope your friend stays vigil and becomes aware of is not right within her own system.  I had a cough that was nonproductive for several years that I complained about numerous times to the dr..but nothing revealed this breast cancer mets that was growing in my lung.. I was told I had everything from a sinus infection, sinusitis, acid reflux, even an autimune disease called sarcoidosis..which now I know was not that at all.  Oh well, now I know and now it can be treated with the herceptin for as long as the cancer responds to it.  good luck, and God's blessings..  ",
      "MessageIndex": 1,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39590,0.htm",
      "Title": "Reconstruction and Insurance"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 1/24/2009 barb777 wrote: Hi there, I was wondering if anyone else had advanced BC and is now in remission or was in remission? My breast cancer went to my lungs and mediastinal glands Oct 07. I had radiation to the lungs and hormonal treatment.I am oest+ and prog + but hercepton -.Originally I had invasive ductal carcenoma grade 3 to my left btrteast. My CT scans have been clear all 2008. I am wondering how long the hormonal treatment is effective for? Was on Zolodex before I had an oopherectomy and now only on Arimidex. Would love to hear from someone with similar situation. Dear Barb7: I havent been on here in a while.. I have been hibernating like a bear for the winter..  havent had alot to talk about actually.  I seen your post about stage lV breast cancer and wanted to respond.  I am stage lV with the her2 overexpression. No hormone or prog. concerns.  I had mets come back into the lung and medistium area as well.  I was totally blown away that it came back in that stage after a 6 year remission time from stage 1 in 01.  I went through avastin/taxotere in 07 and Jan. of 08.. my goodness.. here it is 09 already and I can safely say that I am in remission.. last year went fast!!  I am now monitored and have a scan every few months to make sure of no active disease.  I was to say the least..very frightened when I first learned about the stage lV diagnosis as I seen it as a death sentence too.  But, the longer I go with out a recurrence(and I hope that is a while), the more I believe that I will be around for quite a few more years.  I had herceptin treatments for 6 months.  The last being in Aug of 08.  So far so good!!  I do see the dr tomorrow though to find out the results of a scan I had done on the 14th.. I dont really expect any problems.  I too had the dry hacking cough for a long time.. for at least 2 or more years I fought with that complaint and was given acid reflux meds, sinus medicine, asthma meds, antibiotics, you name it.. regular xrays were done..but a nodule that was growing in my lung didnt show up until May of 07..  it was found by accident when I was going to have surgery on my left elbow.  A prescreen xray found the nodule.. and then a pet scan confirmed that it was suggestive of mets to lungs..then I had a biopsy and they found the mets..  I was totally blown away by this..  I thought I was never going to have anymore problems with my cancer.  Boy..did it fool me!! I am sorry that you have also been given such a diagnosis..but as I said..the longer I go between active cancer the more I know that I am destined to be here on this earth a great deal longer..  I do think about it all the time.. but try to keep busy through out my day to not let it consume me and my way of life..  I do treat my self more now than I use to with doing things that I like or with things that I like..  I am making the most out of my remission time since I never know when I will find myself sitting in a drip room again for treatments.  You feel like you have a ball and chain on your leg when you are going through those things.  I am glad however that I have the option to be able to have cancer fighting treatments, and apparently they have given me this remission time.. for that I am very grateful.  I wish you the best.  God's blessings.. Jodie",
      "MessageIndex": 6,
      "PostDate": "27/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32456,0.htm",
      "Title": "Anyone else at Stage 4 in remission?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 11/13/2008 Scrunch wrote: I have metasticized breast cancer to the peritoneum.  I was first put on Arimidex in hopes that it might shrink the cancer.  That didn't work, so I am now on chemotherapy with Taxol.  My veins are terrible, so now they are going to have to put in a port.  The warning I have gotten about that is that it commonly gets infected.  The cancer is crowding my internal organs, so I had to have stents put in both kidneys to avoid kidney failure.  Had breast cancer in 2001 with lumpectomy and 33 radiation treatments and went seven years cancer-free.  Now I was hit with this last July, and it has turned my world upside down.  Has anyone else had experience with this kind of cancer and how has your treatment gone?  Thank you for any input. Dear Scrunch: Sorry to hear that your cancermonster reared its ugliness again.  Mine did the same 6 years after initial diagnosis in 01.  I was really getting comfortable not worrying about it coming back and WAM!!  Sounds like yours hit you the second time around the same time mine did.  I had chemo last fall from Sept. to Jan. of 08.  So far I am in remission although there have been some scarey moments getting to this point.  I was given taxotere/avastin.  I didnt have the irritation to the hands and feet that I hear about with the taxol.  I only had some nose bleeds with the avastin and have had some neuropathy to my legs and feet but that seems to be going away.  My br.ca. has metastisized to my lungs for now.  No where else thank goodness!  I had a lumpectomy and radiation treatments as well in 01.  I found out about my mets in the spring of 07 because of an orthopedic surgery on my left elbow.  The ortho dr. did a chest xray prior to the surgery and the lung nodule showed up.  Then I had a chest biopsy a mediastinoscopy they call it where they sampled lymph nodes in my chest area which came back br.ca. mets to lung area.  I was put on herceptin in March and was on it until I changed dr.'s in October.  Now I am not sure I made the right decision in switching since the new dr. doesnt like doing the pet/ct scans..he prefers just the ct scan..and I am hoping nothing gets passed them with this scan.  In Sept. the other dr. did a pet/ct scan which showed a new 2.4ct. nodule in my left lung and the report said to view it as malignant until proven otherwise..so I was set to begin another go around with chemo in Oct. and when I changed dr's the first of Oct., he did a ct scan on me and the new nodule didnt show up and the new ct report didnt mention anything about residual cancer activity in my lungs where the pet/ct did.  I was so confused and happy at the same time with this.  But now I am hoping that the ct scan didnt miss the nodule or something.  So anyway, I totally understand your delima.   I wish you well, and I hope you have good success with the chemo.  Best wishes to you... Jodie",
      "MessageIndex": 5,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30234,0.htm",
      "Title": "Taxol"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 4/20/2009 noahgail wrote: I am going to buy a wig online.  I would like some pros and cons if you would.  I purchased a wig from a specialty shop and paid $300.  We chose the one I tried on for 'style. My hair is brown ( with golden and auburn highlights).  I've no gray. The 'sample' wig was silky, thick and straight and BLOND. The wig I got was greyish brown, course, and CURLY.   I am so very disappointed. I was sent home and instructed to 'tame' the curl with velcro curlers. Did not work. They had me sign a no return policy and stupid me did so. So , back to square one.  I want to get as much info as I can to insure I get what I want.  At this particular shop, natural hair wigs ran 6-$700. There is a particular \"part\" that I don't remember name of but looked verynatural.  I like that however, I don't know if \"monofilament-part is the same thing?  The wig I am considering is only $100.  Any thoughts?   Dear Noahgail:  Sorry to hear about your frustrations with your first wig purchase.  I know what you mean.  There is a shop close to where I live that has a NO return or exchange on wigs purchased and once you walk out the door with it, they will not work with you at all.  That is a shame cause it will turn customers away, and its sad that they have NO heart when they see its frustrating enough to have to wear one of the things in the first place..we would much rather have our own hair...right? I just wanted to add that I had good luck with paulayoung.com  they are very good about allowing you to return a wig if it isnt what you wanted as long as the tags are still on them and they are of course not worn..  I went through ordering several with them before I finally got a couple that I really liked.. they are synthetic, and they also have human hair ones, but the synthetic are more reasonably priced.  It is hard to get a good color match online without seeing them, but I tend to go a little lighter than what I think my hair really is and had better luck with that.  They do have long and short styles.. I stayed away from any that were curly because I thought they looked really fakey.. and I like getting a short style that would have bangs and was close to my face on the sides..they always look good..but if you have long hair..they have some of those too.. As someone else mentioned, the Am.Cancer society will give or sell you your first wig very cheap..  I got my first one from them for free.  The cancer center where I get treatments have a free wig program there for people I think the A.cancer society is ahead of that some how.  So I hope this helps..  It takes a while for the hair to grow back once you finish your treatments.. it did for me.. infact, I finished up treatments in Jan. and it was July before I actually combable hair..  so having a wig to dress up with to make you feel better is nice.  Its the one time you can treat yourself and not feel guilty about it.  I did choose to go with just a ball cap this last time around..I finally got use to it and decided that bald wasnt so bad..and there are alot of women in the same boat...UNFORTUNATELY! This cancer is not very forgiving.   Best of wishes to you..hope you are doing well in your fight.  Jodie",
      "MessageIndex": 4,
      "PostDate": "29/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35442,0.htm",
      "Title": "wig-ged out!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I remember too feeling the burning sensation that you discribe.  I did not find my lump it was palpable too by the doctor, but she didn't say anything she just sent me for an immediate mammogram and within a couple days I got the news that changed my life forever.  But, I do remember the pain in my breast and the concern I had about it, but not wanting to jump to conclusions or seem paranoid I ignored it,  they say there is no pain when there is cancer, but I disagree with that now.  Especially hearing that you had similar pain and yours too was cancer.  There has to be something to this and perhaps it is a fact!  I was diag. in 01 with inv.breast cancer, have been treated, and so far 5 years later I am in remission.  I never believe the cancer free statement.  I know that those cells can still be inside me somewhere lurking, and waiting to emerge again.  Once you have been diagnosed with cancer, it is always a possibility for it to come back either locally or distantly.  It is good to hear that perhaps someone else did experience the shooting pains that I also felt before I even knew about my cancer being there.  It is possibly a warning sign to us that it is there??? We should listen to our bodies when there is pain instead of brushing it off as nothing so much.  Especially if it keeps happening in the same area.      Hope everything is going good for you now. ",
      "MessageIndex": 1,
      "PostDate": "19/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8928,0.htm",
      "Title": "questions about Symptoms"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I had a recent petscan to restage my mets br. ca. and unfortunately it didnt come back as good as I had hoped for.  I have had 4 cycles of Avastin/Taxotere..and the scan showed alot of improvement but still areas of activity in lung lymph nodes and lower bronchial tube area..  now the dr. wants to give herceptin every three weeks for three months..  I would like comments and follow up messages from others out there who have been on this chemo drug..   I am fearful of its known cardiac toxicity.. I was with Avastin and Taxotere, but now this herceptin can also be bad, so with so much of this being slammed at my heart, how much can it take without  bad complications..  I know I have to proceed and try it, but would like to know if other breast ca. survivors have been on this..  I have her2 overexpression and so I know this is the chemo drug of choice for me..  I am sure discouraged about having to have more treatments, I was in so hopes that I would be done for 6 months..but I guess knowing that I have metastatic disease now, I was hoping for to much!  My mets was caught in an early phase and if it cooperates I should be able to have a lengthy remission..  cooperation is the key word here though..  I would love to hear from others.. God's Blessings to all who fight this br. cancer fight.. Jodie",
      "MessageIndex": 0,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/21/2008 Ruth1231 wrote: Hi, Jodie, I too am HER2 positve and have been receiving Herceptin treatments since the beginning of my breast cancer treatments. I finished the toxic part of the chemo in June 2008 and am still receiving the Herceptin every 3 weeks until April this year, 2008.  Herceptin was originally given weekly but further testing told the doctors they can give 3 treatments in one session without further complications. Be advised, it is your choice to go weekly or every 3 weeks. Every 3 weeks saves me $120 a month as I do not have to pay the co-pay every week, which is great if your income is limited. I receive a MUGA scan every 3 months and so far have had no problems arise from the Herceptin and I used to be a heavy smoker. In fact, your doctor may recommend a MUGA before starting the Herceptin so that they have a starting point with the condition of your heart. Keep in mind that this is all precautionary. Herceptin may cause congestive heart failure, but the numbers are extremely low. Other than adding to your tiredness, I have had no other side effects. Be sure to tell your doctor is there is a family history of heart problems - mom, dad, siblings, etc. They will be extra cautious and on notice to watch more closely. This is the complication of being HER2 positive, your body creates a protein that allows cancer cells to grow and the cancer can appear anywhere, not just your breast. The Herceptin is supposed to block that protein in order to prevent the cancer cells from growing. I am also on Arimidex that is supposed to kill of any cells that may be left in my body after all the previous treatments. This is all layman terms, as I have been told and read about. Talk to your doctor and ask as many questions as you need to. Talk to the nurses that administer the infusions, they are very helpful and can sometimes give you a more down to earth explanation of the pros and cons. After a year of receiving Herceptin, I am fine. The alternative I'm told would be to risk other cancers and I definitely don't want to go through this again. Good Luck and God Bless, Ruth Ruth: Thankyou for the information.  It is very informative and it helps me alot! Especially the explanation of the her2 overexpression..the dr. tried to explain that the day he was telling me about the herceptin but some of it went right over my head,  and my husbands as he was with me that day.It does help for another person to be in there talking to the dr too..he helped remember things that i didnt.. but I didnt remember about the reason for the herceptin.. an overexpression of a protein gene?   It can sprout cancer anywhere?  I do remember him saying that now..  I am glad you have fared pretty good with taking it.. I am suppose to have it every 3 weeks, for how long I dont know..  I think he said for 3 months and then he would re scan me to see if it is controlling the cancer that is still wanting to live in there.. I guess I have to quit being such a skeptic if the medicine does show that good of promise for controlling the cancer beast!  thankyou so much, this has very helpful..  this is a good site for anyone to read as we do get honest answers from others who are in the same situation.. Hope you are doing well.. blessings!! Jodie",
      "MessageIndex": 10,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I was 48(2001) when diag. with stage 1 br.cancer.  The specs are similar to yours, mine was 3 centimeters, neg.nodes, high grade 3, neg for horm. and pos. for the her2gene.  I had 4 rounds of the AC/with 37 rad. treatments that followed the chemo.  I remember feeling very tired, was nauseated, for about 7 days after chemo treatment. The worst was the first and second, after that it tapered off to where I could function pretty normally,  so just give yourself the first day or so following treatment to get back to some what normal.  I have not been given any follow up meds. the tamoxofen or whatever, as I was neg for the hormone. But, for 5 years I have been in remission with no sign thus far of recurrence.  My heart goes out to you now as you embarc on this experience.  But, give your self at least the two days following chemo treatment to yourself.  You deserve to treat yourself to this time away to regroup.    ",
      "MessageIndex": 9,
      "PostDate": "19/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2985,0.htm",
      "Title": "Her2-neu Positive/node Negative"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "I dont know if others are aware of this, but the government has pulled Avastin from the drug selection market..this drug has helped many I'm sure by killing growing breast cancer tumors.  I'm very upset by this..which one is going to be next????  I know this drug works, because I am living proof that it does!  I am 3 years out from being diagnosed with br cancer mets to the lung and mediastinal nodes.  The avastin/taxotere regimen was used on me and it showed definate results..  Why are they doing this..because of the cost or because it does work and it is costly?  Frustrating and its just one of many that they may pull...ugh!!!",
      "MessageIndex": 0,
      "PostDate": "20/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49641,0.htm",
      "Title": "AVASTIN is being pulled from the market!!!!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Jul 21, 2010 12:58 PM Oncrx wrote: Just to be clear, this drug is NOT being pulled from the market.  Avastin got FDA approval for breast cancer in 2008.  In the followup studies that were a condition of approval the same benefit was not demonstrated.  As a result the FDA is considering removing the indication for breast cancer.  Even if the FDA withdraws the drug's approval for breast cancer, doctors will still have the option to prescribe the drug \"off-label.\"  If they are removing it for the indication for breast cancer, doesnt this mean they will no longer be using the drug for this disease?  That is how I read it!  If a dr. can still use it and prescribe it off label as you stated, that means insurance can choose not to pay for its use.  Correct?",
      "MessageIndex": 2,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49641,0.htm",
      "Title": "AVASTIN is being pulled from the market!!!!"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/14/2008 Giovanna wrote:   On 2/14/2008 Jodie wrote: I had a recent petscan to restage my mets br. ca. and unfortunately it didnt come back as good as I had hoped for.  I have had 4 cycles of Avastin/Taxotere..and the scan showed alot of improvement but still areas of activity in lung lymph nodes and lower bronchial tube area..  now the dr. wants to give herceptin every three weeks for three months..  I would like comments and follow up messages from others out there who have been on this chemo drug..   I am fearful of its known cardiac toxicity.. I was with Avastin and Taxotere, but now this herceptin can also be bad, so with so much of this being slammed at my heart, how much can it take without  bad complications..  I know I have to proceed and try it, but would like to know if other breast ca. survivors have been on this..  I have her2 overexpression and so I know this is the chemo drug of choice for me..  I am sure discouraged about having to have more treatments, I was in so hopes that I would be done for 6 months..but I guess knowing that I have metastatic disease now, I was hoping for to much!  My mets was caught in an early phase and if it cooperates I should be able to have a lengthy remission..  cooperation is the key word here though..  I would love to hear from others.. God's Blessings to all who fight this br. cancer fight.. Jodie   Dear Jodie,              I had breast cancer and we did remove the lump first then a lumpectomy and then a mastectomy and i was on herceptin for a year every 3 weeks and now I am fine.  Do not be afraid., you will be O.K.   And I am a 3 years survivor, May God bless you.  Norma   Norma: Thankyou for your reply, it does make a differance when a breast cancer fighter is able to speak with others in the same situation..   I am fearful of these chemo meds even though they are supposedly safe for the most part, there is always a small percentage of people who will experience the mentioned side effects, and unfortunately I worry about being in that percentage..  I dont want to have cancer and then compound that illness with heart disease too.. I only have one heart and would like to keep it healthy to help me fight this dreaded cancer disease..  I will check out this other website mentioned above.  I am in hopes that my dr. will put me through the necessary heart pretesting to make sure I am up to the challenge.  My heart has already been through alot of toxic chemicals in the past 6 months..  anyway, thankyou for responding so soon, it has helped me alot to feel more at ease.. I'm still not looking forward to more treatments when I was in hopes that there would be a 6 month interval in between them.  My original cancer in 01 was just stage 1, only a 1.6 ctmetr. tumor, with the usual A/C chemo and radiation.. it took 6 years for it to come back.  When it did it bypassed the axillary lymph nodes and went mets into the medistinum lymph chain.. dr. says it had to have spread before it was treated in 01..  and it having this her2 gene overexpression made it more aggressive in nature. but for some reason it stayed low for 6 years before a chest xray last May showed a lung nodule, and then one thing led to another and I found myself fighting a more serious form of this disease..  it is being stubborn too this time around.. I have had 4 cycles of the avastin/taxotere and still it has survived to start again.  Hopeing the herceptin will keep it in check.. thank you.. Jodie    ",
      "MessageIndex": 3,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/19/2008 donnalynn wrote: Hi! I had Herceptin for a year because my cancer was Her2+. I did really well in the Herceptin until right at the end. They did not give me my last treatment because I was having some issues with my heart, but they said that it was reversible heart damage and i am fine now. It has been quite a few months since I stopped the Herceptin. I do think that the good that this medicine can do outweighs the bad. One other question, How did the find your lung nodules. I had a CT scan of my heart the other day and they just happened to pick up 4 small nodules on my lungs. They are telling me to wait 4 months and then have another CT scan. I am not sure that I really want to wait. Hi Donnalynn: Thankyou for the reply.  Hearing that someone else has been on this medicine really helps calm my fears.  Sounds like though you have suffered some damage to your heart from the herceptin, which is exactly why I was asking others to let me know their exprience..  for some reason this fears me more than the cancer itself.  But, the consequences of not trying it is not really an option at this point, as the dr. said if we sit back and do nothing I will lose what ground I have made since being on the avastin/taxotere regimen.. I wouldnt want to repeat that..or anything like it right now.. so I guess all I can do is tredge ahead and hope that they will watch me close for signs of it doing damage to my heart.. my father had a bad heart from the age of 36, and I know there is significant history in that side of my family for people to not live past a certain age because of heart disease.  My Dad died in 03 of bladder cancer.. we always thought it would be his heart that would take his life..although it was because of his bad heart that he couldnt fight the cancer as agressively as he might of could if he didnt have a bad heart.. so i guess this is what is in the back of my mind.  They found the lung nodule after an orthopedic dr. ordered pre surgical xray, the lung nodule showed up on the xray.. then it led to one thing and another till they discovered the cancer going wild in my medistinum and lung, and up in the right side of my throat.. it was by accident.. I dont blame you for not wanting to wait 4 months...that is a long time to wait and see.. I pressed my primary to continue on with a regular ct scan of my lung, which still showed the nodule, then he sent me to a pulmonary dr. which then led me to a surgeon to biopsy the lymph nodes in the lung area to discover the active cancer.. I hope you can get them to reconsider and do more studies on your lung nodules.. it does sound suspicious.  How long were you on herceptin?  I was not offered that stuff when the cancer was just a stage 1 in 01..  dont know why?  Anyway, I hope things work out for the better for you.. thanks for your reply.. Best wishes.. Jodie",
      "MessageIndex": 8,
      "PostDate": "19/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/22/2008 karen30 wrote: Thanks girls! I had a daughter about 18 months ago and still have milk or whatever coming out. They tell me that's not normal and that's why they want me to get a mammogram! at first they just wanted an ultra sound cause the doc found what she thought was densed tissue. I go in for all this on the 3rd of march which is going to seem like forever. Hello: I had a great aunt on my Mom's side that had breast cancer..my Mom's only sister passed away a year ago with bladder cancer, her daughter died of luekemia..and my Dad from bladder cancer in 03... so I dont know what genetic link there may have been for me to end up with breast cancer.. my Mother is so far doing great as far as the cancer thing goes.. years ago after she had gone through menopause she had pre-cancerous polpys removed from her uterus or actually she had hysterectomy from that threat, but so far has not had any other concerns of that nature.. so where my breast cancer came from is still a mystery.. it just appears that there is cancer prevalent in my family on both sides and possible this made me more at risk..but who knows..  all we can do is hope we arent the one burdened with the disease and if we are then all we can do is fight it the best way we can..!  I think this stuff just pops up for no unknown reason sometimes..  I had a small tumor in 01 that was completely treated..it took 6 years for it to come back and is now stage lV..with an overexpression of the her2 gene.. which makes it an aggressive beast to fight.. dr. is still puzzled as to why it took it 6 years to come back..just one of those unknowns again..  life is weird and unfortunately we dont always have the answers to the puzzle we would like to have..  Good luck to you.. hope everything goes well for you in this journey.. God's blessings! Jodie",
      "MessageIndex": 7,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21168,0.htm",
      "Title": "question about breast cancer"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "Well for 5 months I thought I was finally in good remission.  I had a pet/ct done in Feb. and have been told that the cancer is now active again in 6 mediastinal lymph nodes.  I have to go back to herceptin  this Wed. to try for another remission outcome.  I have to have the herceptin once a week for 4 weeks, then once every three weeks like I had it last summer.  I have never had it once a week.  Has anyone else?  Are the side effects harsher if it is recieved/given that often.  The doctor said he wanted to load me up since the cancer has become active again.  I was in such high hopes that maybe the cancer might have decided to behave itself and stay gone for a while longer.  I have stage lV br. cancer to the lungs and mediastinal area. I guess I should be glad that, that is the only area it has metastisized to, and can be treated with good outcome.  I havent posted on here in a while, I have not had any troubles and thought my troubles were behind me for a while again.  I went from 01 to 07 before in remission.   Oh well, I  guess here I go again..and I guess, its a good thing I can still keep going again..right?  I was in hopes that I could forgo not having to live on the herceptin in order to keep the cancer from returning, but since it only took a few months to do so,  I guess that hope has gone by the way side.  Take care all...I am glad you are all out there to converse with during these rough times.  It makes the insanity merry go round stop..even if its just for the moment..  Blessings.. Jodie",
      "MessageIndex": 0,
      "PostDate": "08/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34004,0.htm",
      "Title": "I'm back."
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 8/24/2007 hrtbrkn23 wrote: So it has been 2 months since my mother lost her battle with breast cancer. She had been suffering so bad the last 3 months that at first it was a relief that she wasnt hurting anymore. Now I have come to the realization that she is gone. Some days are good but most are bad. She was 59 and had a pretty tough life. She was a beautiful woman both in and out and didnt deserve the hand that she was dealt.  It pains me to think about the fact that she knew she was dying. I could never muster the courage to ask her how she felt about it. Even though we knew and we think she knew she was dying we never spoke about it because we always held out hope. now I wish we had asked her. She was just starting to enjoy her life again having beaten cancer twice when it returned. My sister and I both have young children that my mother adored. Every waking moment she thought about them and it was like the cancer took a backseat. I cant believe my daughter, who is 18 months, will never know her Nana. Everytime I think about that i break down. She loved her grandkids so much and all she wanted to do was see them grow and prosper. Im sure Im not the only person who is dealing with these issues. I would love to hear from others who have gone through this or are going through this to see how you are coping.  For now I try to smile and keep reminding myself she is in a better place. I just hope she can see my daughter and enjoy her now. Hearbrkn:  Your Mom was lucky to have a family who loved and adored her, and will miss her..  I have just learned that my b.ca. is now mets..I am just now going to be starting my second round of fighting this disease..I know from research that the odds are probably not in my favor and I will ultimately be facing the end of the road too sooner than I had hoped in my life..  I too will be leaving a precious little grandson who is now 2, who will probably not remember me..that does hurt!  He is my little pride and joy and we are pretty good buddies when I am taking care of him..he is so sweet, he gets his favorite books, and climbs up into my lap and I read them to him...when I read to him the parts he likes he has this sweetest little smile and giggle...I wish someone could capture these moments we have together on a video or something, so he will hopefully be reminded when he sees the video how much his grandma loved him..  I was able to grow up with my grandparents, and seen them all pass away, and I recall alot of good memories from when I was growing up and being with them..so those moments are precious..  I am sorry for your loss.  I hope as the days go by things will get easier for your family..  My spouse lost his Mom last year to lung ca. and he still has hard moments to hurdle over..but I admired the way his family loved their Mom...I only hope that my two sons will remember me with the same love...  My recurrence that is now mets, has come as a big shock and suprise to me..I knew it was always possible, but always thought I would have it come back in the original ca. location before it became mets..it snuck up on me...it was found by accident in my lung because of a prescreen chest xray that I had done for a surgery on my arm..it has taken three months for them to finally diagnose it as breast ca. mets..no telling where it has had time to spread now?  I will be starting treatments soon..  I know now there is no cure, just ways of stalling it off, trying to keep it at bay..a way to live with it instead of dieing with it..  My heart goes out to you.. Blessings your way.. Jodie",
      "MessageIndex": 1,
      "PostDate": "24/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15583,0.htm",
      "Title": "2 months since the loss of my mother"
    },
    {
      "AuthorID": "Jodie (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "  On 2/21/2008 Ruth1231 wrote: Hi, Jodie, I too am HER2 positve and have been receiving Herceptin treatments since the beginning of my breast cancer treatments. I finished the toxic part of the chemo in June 2008 and am still receiving the Herceptin every 3 weeks until April this year, 2008.  Herceptin was originally given weekly but further testing told the doctors they can give 3 treatments in one session without further complications. Be advised, it is your choice to go weekly or every 3 weeks. Every 3 weeks saves me $120 a month as I do not have to pay the co-pay every week, which is great if your income is limited. I receive a MUGA scan every 3 months and so far have had no problems arise from the Herceptin and I used to be a heavy smoker. In fact, your doctor may recommend a MUGA before starting the Herceptin so that they have a starting point with the condition of your heart. Keep in mind that this is all precautionary. Herceptin may cause congestive heart failure, but the numbers are extremely low. Other than adding to your tiredness, I have had no other side effects. Be sure to tell your doctor is there is a family history of heart problems - mom, dad, siblings, etc. They will be extra cautious and on notice to watch more closely. This is the complication of being HER2 positive, your body creates a protein that allows cancer cells to grow and the cancer can appear anywhere, not just your breast. The Herceptin is supposed to block that protein in order to prevent the cancer cells from growing. I am also on Arimidex that is supposed to kill of any cells that may be left in my body after all the previous treatments. This is all layman terms, as I have been told and read about. Talk to your doctor and ask as many questions as you need to. Talk to the nurses that administer the infusions, they are very helpful and can sometimes give you a more down to earth explanation of the pros and cons. After a year of receiving Herceptin, I am fine. The alternative I'm told would be to risk other cancers and I definitely don't want to go through this again. Good Luck and God Bless, Ruth Ruth: Thankyou for the information.  It is very informative and it helps me alot! Especially the explanation of the her2 overexpression..the dr. tried to explain that the day he was telling me about the herceptin but some of it went right over my head,  and my husbands as he was with me that day.It does help for another person to be in there talking to the dr too..he helped remember things that i didnt.. but I didnt remember about the reason for the herceptin.. an overexpression of a protein gene?   It can sprout cancer anywhere?  I do remember him saying that now..  I am glad you have fared pretty good with taking it.. I am suppose to have it every 3 weeks, for how long I dont know..  I think he said for 3 months and then he would re scan me to see if it is controlling the cancer that is still wanting to live in there.. I guess I have to quit being such a skeptic if the medicine does show that good of promise for controlling the cancer beast!  thankyou so much, this has very helpful..  this is a good site for anyone to read as we do get honest answers from others who are in the same situation.. Hope you are doing well.. blessings!! Jodie",
      "MessageIndex": 13,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    }
  ]
}