{
  "AuthorID": "Jomar",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
  "Posts": [
    {
      "AuthorID": "Jomar",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
      "Content": "Thank you so much for sharing your story. I am so sorry about what you're going through. I will remember you in my prayers. Somewhere, somehow there's got to be a reason for all this.",
      "MessageIndex": 3,
      "PostDate": "28/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7476,0.htm",
      "Title": "Confusion & Chaos Everywhere i Turn"
    },
    {
      "AuthorID": "Jomar",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
      "Content": "Dear Katwoman, Thanks for sharing your story. You say you went to four doctors before deciding. What did they recommend you do considering your history? Is breast reconstruction a long and drawn out thing? It sounded like you're not finished with the cosmetic part of it, are you? Do you have numbness in the reconstructed breasts? Are you taking any hormones, did you go for any radiation or chemo? You are very brave.",
      "MessageIndex": 4,
      "PostDate": "28/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7476,0.htm",
      "Title": "Confusion & Chaos Everywhere i Turn"
    },
    {
      "AuthorID": "Jomar",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
      "Content": "I said in an earlier message that I was diagnosed with BC on 10/06. The first doc I saw told me I had stage I invasive ductal cell carcinoma. He said it was very small, recommended lumpectomy, sentinel node biopsy, followed by radiation. Didn't say anything about hormones after that. He said if he didn't get a clean margin I may have to undergo a second surgery. If I did not want radiation, then he said mastectomy. While he had a pleasant manner about him, he left out a lot. Plus I was in shock so I didn't have the presence of mind to ask questions. He is connected with a very respected university hospital in the NY metropolitan area and does strictly breast surgery. He took me by the hands and said to look at this whole experience as just a \"blip in your life\" and that the survival rate for what I have is in the 90% range. He said I would do very well. He said he can tell a lot about people by their eyes and that he could tell I was a strong woman --- yeah, so?? End of consultation. I can't say now if I like him or not. I would like to believe what he said. The second doc I saw (yesterday) said it is impossible to stage a cancer until the time of surgery. You can grade it but there are many different types of grades. So that doesn't mean too much. He said because he can't feel the tumor, it is probably small, but he can't tell right now. He said it is close to the nipple so he doesn't know what else is involved. As a result after surgery if I do the lumpectomy I may have one nipple higher that the other --- cute. He advised lumpectomy with radiation and may or may not be followed by hormones, but he can't tell right now. He said I would have to see a medical and radiation oncologist. I said all I wanted was for my life to be normal again. He said my life will never be the same. He was very honest, but I feel terrible, very sad, very angry and very confused about everything. I am going to see a complimentary doctor to see if and what alternatives or additions there may be to treating this problem, but that's not until next week. P.S. My husband just lost his job and is not able to support me emotionally having to deal with his own grief and upset. I am not feeling sorry for myself, at least not yet, but I do feel very alone and overwhelmed. Our dog had had bladder cancer for one year. The canine bladder cancer support group is connected to the cancer compass site and that helped when our dog was first diagnosed, so here I am again. I need help through the maze of confusion.",
      "MessageIndex": 0,
      "PostDate": "27/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7476,0.htm",
      "Title": "Confusion & Chaos Everywhere i Turn"
    },
    {
      "AuthorID": "Jomar",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
      "Content": "I was just diagnosed with BC stage I invasive ductal carcinoma. The surgeon is saying I must have a lumpectomy followed by several weeks of radiation 5 days a week. If I don't do the radiation, he says I must have a mastectomy. I am afraid of radiation because of the damage it can do to other parts of my body, like the heart and lungs. If anyone has opted for a mastectomy instead of the lumpectomy and radiation would you please share your experience. Also those that have had the lumpectomy and radiation, would you do it that way if you had to choose again? I have just read a few messages on this site and am stunned by the horrible experiences with the estrogen blockers. Does everyone whose estrogen positive have to have these drugs? My doctor didn't even mention them to me. I am a mess over this and the treatment hasn't even begun. Thanks to all. JFN",
      "MessageIndex": 0,
      "PostDate": "23/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7415,0.htm",
      "Title": "Lumpectomy Vs. Mastectomy"
    },
    {
      "AuthorID": "Jomar",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Jomar",
      "Content": "Hi Lisa, Would you explain what reconstruction you had? Are you satisfied with the results? Is there any feeling in that breast? Can you move your arm like before the surgery? How long did they tell you to stay on the drugs? I am trying to get as much info as I can before I make a choice. A lumpectomy is certainly the least radical, but I think I would stress every time I had to have a mammogram to see if the cancer spread. Maybe that's just how I feel right now because all this is so overwhelming. My husband lost his job last week, so I'm really stressed. Thanks for your good wishes.",
      "MessageIndex": 2,
      "PostDate": "24/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7415,0.htm",
      "Title": "Lumpectomy Vs. Mastectomy"
    }
  ]
}