{
  "AuthorID": "Joozy",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joozy",
  "Posts": [{
    "AuthorID": "Joozy",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Joozy",
    "Content": "  On 9/5/2009 JanieK wrote: I too, like so many of you, after taking Aromasin for 2 years, find that the side effects are intolerable and have stopped taking it.  The depressed mood, the restlessness and feelings of rage were getting to be too much for me and it was beginning to effect my relationship with family members.  I knew it was happening, but had little success with trying to control it on my own.  I thought that it was just from the trauma of the whole cancer experience and perhaps long term effects of chemotherapy.  I was Dx'd with Stage III, estrogen positive breast cancer and did the usual chemo, radiation, bi-lateral mastectomy.  For reconstruction I chose a TRAM flap on the tumor side and implantation on the non-cancer side.  This decision has worked very well for me and I'm extremenely pleased.  It's just the dang Aromasin.  I can't stand the pain anymore...I  am 61 and feel 101 !  The depression became unbearable and about 2 weeks ago I decided to chuck the pills.  The depression cleared up within 2 days and it's so awesome to feel more like myself again.  The joint pain, that has just about crippled my hands has not improved at all, but the foot and ankle pain has mostly vanished !  I'm really afraid to tell my oncologist that I've taken myself off of Aromasin, because he's pretty much in denial of my symptoms and wants to blame it on age.  I'm very athletic and one of my passions is hiking, and I mean, hard hikes.  I'm no whimp and can't believe that this joint pain and constant sweating is caused by aging alone.  My husband and I have been searching everywhere to uncover reliable evidence, based on research, what the chances are of the CA recurring if I don't finish out the 5 years (3 more to go) of Aromasin therapy.  Is there anyone out there that can point us to reliable, research based information ?      So sorry to hear of all of the side affects you are having.  I do not have the depression but do have the joint pain in feet, hands and knees.  I could hardly get up and down without leaning on something.  I had read on this blog some members recommended taking over the counter joint therapy medications.  I am taking Glucosamine plus MSM 1500 mg by Schiff and it has helped alot.  The tingling in my feet and legs is not as bad and the foot and knee pain so much better. Still hard to wear my rings but my hands do not ache. You might want to try this before you give up the Aromasin altogether. If it helps enough that you can tolerate it the physician can treat the depression. Just a thought. Sending prayers your way.",
    "MessageIndex": 3,
    "PostDate": "11/09/2009",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39621,0.htm",
    "Title": "Aromasin Treatment"
  }]
}