{
  "AuthorID": "joycestuart",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joycestuart",
  "Posts": [
    {
      "AuthorID": "joycestuart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joycestuart",
      "Content": "  On 11/3/2008 hocema171 wrote: I had a bilaterial masectomy in July., I am still having this burning, stinging pain in my chest. It is very uncomfortable. My doctor said it is form the nerves being cut and that it will go away in a few months. It has been almost 4 months since my surgery and it feels no better. I have tryed darvact and vicidon, motrin but they only take the pain away for about an hour and then it is back. Has anyone had experience with this? What are you taking for pain? any tips would be greatly appreciated. I have young sons and I cannot seem to function without all the pain.  I had a bi-lateral masectomy a year and a half ago. Last summer my implants were put in and proceeded to fall out..I had to under go another 2 surgeries. Three months later I began getting horrible stabbing pains under one arm. My doctor said there was nothing he could do. I went to a pain doctor who put me on Elavil and it has practically taken all the pain away. I take 50mg. every night. Hope this helps.",
      "MessageIndex": 6,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29932,0.htm",
      "Title": "help for pain after a masectomy"
    },
    {
      "AuthorID": "joycestuart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joycestuart",
      "Content": "  On 7/5/2009 Terriet wrote: Just had first treatment of taxol.  Having severe abdominal pain and discomfort when urinating.  I have had about 2 qts of water today.  I am urinating so that is at least good.  So here we are the 4th of July and I don't know whether to call the 24 hour number to my oncologist.  I had to call yesterday because I was having facial flushing and swelling but the benadryl helped take care of that.  Anyone experienced this with taxol?  Also experiencing pain in the instestine with a lot of gas and loose stools.  The pain is sharp pain and achy pain and has been pretty constant now for 24 hours.  I'm exhausted. Ihad taoxol for 12 weeks straight and never had any side effects. I would check with my doctor immediately.",
      "MessageIndex": 2,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37766,0.htm",
      "Title": "taxol and abdominal pain"
    },
    {
      "AuthorID": "joycestuart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joycestuart",
      "Content": "I had implants done after radiation. One week after they were inserted, one fell out! The surgeon proceeded to \"fix\" the problem by inseting smaller implants. I asked about having the Tram instead of having implants and he told me that surgery was completely unnecessary. Three months after the implants were inserted, I developed stabbing pain that was unbeable, going from the inside of my rib cage to the back of my ribs. The surgeon said there was nothing he could do. THe said this pain was generated by nerves regenerating. I went to a pain doctor who put me on Elavil and Dilaudin. This stopped the pain Then I went on a search for a doctor who could help solve the problem. I had ten consults. I found a doctor was was recommended by everyone I spoke with and who was known as \"The Fixer\". He told me that the reason I was having the pain, was because the tissue had been radiated and was not plyable enough to hold the implants in place. He said implants should never have been done in the first place due to the condition of my skin. He recommended the DIEP/SIEA Tram. This procedue scared me to death. It required between 13 to 15 hours to complete. I learned that he does wll over a hundred a year and spoke with many of his patients who all raved about him. They told me not to think twice and to have the procedure. My doctor is so skilled..it took me almost six months to get a date for the surgery. The operation went well. I was home in three days. It is now almost 4 months after the operation. I have beautiful breasts that look like they are real.....and most importantly....no more pain!!! I urge you to get second, thrid, forth and fifth opinions. You can be helped!   ",
      "MessageIndex": 1,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38762,0.htm",
      "Title": "newly diagnoses"
    },
    {
      "AuthorID": "joycestuart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/joycestuart",
      "Content": "  On 7/7/2009 TRAUMER wrote: Hello, I am under a prostate cancer watch and utilize these boards.  My Wife was diagniosed with aggresive breast cancer two months ago.  She is depressed and not proactive towards researching the web.  Our insurance company will pay for reconstruction .  She wants the reconstruction and i am interested in learning her options and what others here have received with the least amount of complications and good cosmetic results..  Any recommendations and information would be greatly appreciated.. thanks in advance, philip   Find out all your options before chossing the one best for you. I knew nothing and followed my surgeon's reconstruction partner and had expanders put in prior to implants which were to be exchanged 6 months after radiation was over. What my surgeon did not tell me was that there was another option and in fact, for patients who have had radiation is a better alternative. It is the SIEA Tram or DIEP Tram. This procedure builds breasts from the patients own skin. The results are incredible and they look real! If your wife is having radiation, what can happen is that the skin becomes brittle and cannot support the implants. As a result, the implants lay on the rib cage wall and cause Post Mascetomy Pain Sydrome. I developed this and had to go on massive pain meds just to function each day. After many consults with Plastic Surgeons, I made the decision to have the implants (which look like rocks and do not resemble real breasts at all) replaced and have the Tram. There are only a handful of surgeons trained in this procedure. Do your research. My doctor has the reputaiton of being \"The Fixer\"...he fixes the \"mess\" other doctors did. I found him through recommendation. His name kept coming up as the one to go to. I wish you and your wife a safe and smooth journey. I am so happy and pain free. The reason my origial doctor did not recommend this alternative was that he was not trained to do the procedure and did not want to loose the patient.",
      "MessageIndex": 2,
      "PostDate": "13/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37814,0.htm",
      "Title": "Breast Reconstruction Options"
    }
  ]
}