{
  "AuthorID": "jpah123",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jpah123",
  "Posts": [
    {
      "AuthorID": "jpah123",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jpah123",
      "Content": "hI, I just found out that I have Infiltrating Doctal carcinoma, stage IV, grade two and estrogen positive.  I am 44 years old in pretty good health until I fractured two back bones five month ago that give me a lot of pain and limit my mobility.  I will be starting chemo soon.  I would appreciate any advise for those with this disease and what treatments have helped you.  I am terrified that I won't be around for my 11 year old daughter and need to fight this thing the best way possible.  Thanks for your advice.   Jan",
      "MessageIndex": 0,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44489,0.htm",
      "Title": "INFILTRATING DOCTAL CARCINOMA"
    },
    {
      "AuthorID": "jpah123",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/jpah123",
      "Content": "Hi, I am awaiting my results form a breast biopsy but was told I probable have stage iv breast cancer that has gone to my bones. I currently have a lower back fravture which brought along other tests to see why this happened. My mamagram came out ok but my CAT scan showed suspicion in my breast along with 6-8 places in my spine, ribs, pelvic, etc. I have been reading a lot I want to start on treatment. I have been suffering with my broken bone in my back for 5 months and feel a lot of pain in the places the CAT scan showed disease. Should I start taking Immunopower, Ultramet, Polymvul or is there soething better. I think the doctors will give me a gloomy outlook but I want to start fighting back right now. Any suggestions would be greatly appreciated.",
      "MessageIndex": 0,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44414,0.htm",
      "Title": "diagnoised with stage iv breast cancer metastasized to bones in spine and pelvic"
    }
  ]
}