{
  "AuthorID": "judykrasho",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/judykrasho",
  "Posts": [{
    "AuthorID": "judykrasho",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/judykrasho",
    "Content": "On Feb 26, 2013 11:06 PM AyJayBeeGee wrote: Has anyone else on Arimidex had recurring trigger thumb? I noticed on the information from the pharmacy that it is a rare side effect. I have just completed my first year of daily anastrozole (arimidex) and am having a lot of problem with trigger thumb. To answer your question about Arimidex causing trigger thumb...I had two trigger thumbs, along with severe overall body and joint aches, swollen finger joints and carpal tunnel pain, hair loss and every other side effect that is listed.  I ended up at the Rhematologist who ran a myriad of tests, all of which came back negative.  Based on my pain, he determined that I was having inflammatory episodes from some type of autoimmune disorder and prescribed hydroxycloriquine, methotrexate, Arav, cortisone injections (not all at the same time).  Nothing seemed to help.  I even went to a Chiropractor because I was having severe hip pain and could barely get up from sitting.  I was a mess.  I would have never attributed my problems to Arrimidex until I read a post with someone else having similar symptoms.  I had started taking Krill Oil twice a day, magnesium and several other supplements, but nothing really worked until I started the Krill Oil.  It has been a miracle for me.  I take one in the morning and one at night and I am almost totally pain free! I just don't understand why someone hasn't figured this out yet, it would have saved me two years' of pain and thinking I was a total nutcase.  I'm sorry to ramble on, but give the Krill a try before you get any worse, it is the best stuff ever!",
    "MessageIndex": 1,
    "PostDate": "26/02/2013",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70657,0.htm",
    "Title": "Trigger Thumb from Arimidex?"
  }]
}