{
  "AuthorID": "Judy2007",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Judy2007",
  "Posts": [
    {
      "AuthorID": "Judy2007",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Judy2007",
      "Content": "Thanks for your suggestions. It's good you are getting some relief with Lidocaine patches.  Since I pasted the question, I have gone on Pregabalin \"Lryica\" which is a centrally acting anticonvulsant that modifies the signals the brain is receiving from the cut nerve endinds. This is really helping, I take one twice a day.  This is a new drug, used for neuropathic pain. It is related to Gabapentin, in case you are Googling on Neuropathic pain. I\"m also taking Digesic to take the edge off the pain . The last 2 days have been so much better and it is really making a difference to how I feel. IT is NO FUN having that intense burning every time you move your arm. I'm hoping I will be one of the group of people for whom this is just a temporary problem. Some people have it for a long time.  Hope others are finding some solutions .Different things work for different people with post-surgery neuropathic pain.  ",
      "MessageIndex": 5,
      "PostDate": "06/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16674,0.htm",
      "Title": "Post-lumpectomy neuropathic pain treatment suggestions"
    },
    {
      "AuthorID": "Judy2007",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Judy2007",
      "Content": "3 weeks post lumpectomy and SNB. Tumour 8mm. I now have lots of painful burning and hypersensititivity on upper arm and around excision. Nobody warned me about this. Does it go away in a few months? What have you found that helps? GP suggesting low dose of Tricyclic antidepressant. Does that work? Panadeine etc doesn't. Thanks for your ideas and thoughts - love to hear from people who have overcome this problem!!",
      "MessageIndex": 0,
      "PostDate": "01/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16674,0.htm",
      "Title": "Post-lumpectomy neuropathic pain treatment suggestions"
    },
    {
      "AuthorID": "Judy2007",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Judy2007",
      "Content": "Thanks for your reply and prayers. Good to hear that the burning settled down over a few months. I'm praying it will!  However, it seems for some people it doesn't go away. I am finding that wearing a bra is better than not, but cold wind makes it worse. At those times, just pressing on the area helps too. Moving the upper arm makes a lot of burning feelings. Has anyone found any medications that worked? There are a lot suggested, but - what works?",
      "MessageIndex": 3,
      "PostDate": "02/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16674,0.htm",
      "Title": "Post-lumpectomy neuropathic pain treatment suggestions"
    }
  ]
}