{
  "AuthorID": "Julie55",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Julie55",
  "Posts": [
    {
      "AuthorID": "Julie55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Julie55",
      "Content": "Thank you for the suggestion! I'll give it a go - most grateful.   Julie",
      "MessageIndex": 4,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51372,0.htm",
      "Title": "Stage IV lobular cancer - tumour in peritoneum"
    },
    {
      "AuthorID": "Julie55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Julie55",
      "Content": "Dear All - I am new to the Breast Cancer boards, though when my husband had kidney cancer I found the kidney cancer boards here incredibly helpful and supportive, so hope the same is true here! I am posting because a friend of mine was treated five years ago for breast cancer (ductal with lobular characteristics), and has just been re-diagnosed with stage IV BC, with a single mass in her peritoneum (plus kidney problems) Although I'm very ignorant in general about the details of breast cancer overall (apart from having my own mammograms!), I have since researched on the Internet and found that ILC (invasive lobular carcinoma) is characterised by metastasizing to the peritoneum/abdomen. I'm now trying to find out more for my friend, who is very shaken by her diagnosis, and very frightened (she assumes she will soon be dead and won't see her next birthday), about what her treatment options are. She is keen to understand if she could have surgery to remove the mass, but it's hard for me to find that out and I would love to know if anyone else here has had such surgery? Also, what are the standard drug treatments for stage IV ILC, if anyone here is on them. She has been offered chemo and, I think, another drug (possibly Tamoxifen) but right now is indecisive. SHe is currently awaiting an MRI scan result, and then to see her oncologist again (not a surgeon himself! - he's only talked about chemo and drugs) Finally, I am already reassured by some posts here mentioning ILC, and the patients still being vigourously alive! Right now I need to tell my friend all the good news I can find! Very many thanks for any help and information, and all the very best to you all who are afflicted by this damn, damn disease! Take care, Julie.  ",
      "MessageIndex": 0,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51372,0.htm",
      "Title": "Stage IV lobular cancer - tumour in peritoneum"
    },
    {
      "AuthorID": "Julie55",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Julie55",
      "Content": "Thank you so much, and for your encouraging post. It does still seem odd to me not to simply cut out an obvious secondary tumour, as the less cancer in one's body the better! But if drug treatment is also effective, then great - I am glad to hear it's giving you good results, and long may that last. As you say, with new drugs coming on stream, it's very much a question of using them as 'stepping stone's into the future. Thank you for answering - best, Julie.",
      "MessageIndex": 2,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51372,0.htm",
      "Title": "Stage IV lobular cancer - tumour in peritoneum"
    }
  ]
}