{
  "AuthorID": "julyruby",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/julyruby",
  "Posts": [
    {
      "AuthorID": "julyruby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/julyruby",
      "Content": " I just turned 47 & Happy Birthday, I have breast cancer! I had a double mastectomy on 6/17. Then had to go back for 6 days to the hospital due to infection in the incision & had to have another surgery. I have a very large support group of friends. I haven't cried since the day I found out the test results.Everyone says I'm so strong. I'm smiling, joking & thinking & speaking positive.Yesterday I had a melt down. Insurance company was giving me a hard time & I just lost it. My friends think it was just because of the insurance. It was & so much more. I'm in constant discomfort do to the expanders & its getting to me. I just don't feel as strong as I show I am. A close friend has stage 4 rectal cancer & has be going through agressive treatments. I just feel that I have no right to complain. My cancer is gone & he might die from his. Can anyone out there relate?",
      "MessageIndex": 0,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38742,0.htm",
      "Title": "emotional support"
    },
    {
      "AuthorID": "julyruby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/julyruby",
      "Content": "  On 8/7/2009 phoenix23002 wrote:   On 8/5/2009 julyruby wrote:  I just turned 47 & Happy Birthday, I have breast cancer! I had a double mastectomy on 6/17. Then had to go back for 6 days to the hospital due to infection in the incision & had to have another surgery. I have a very large support group of friends. I haven't cried since the day I found out the test results.Everyone says I'm so strong. I'm smiling, joking & thinking & speaking positive.Yesterday I had a melt down. Insurance company was giving me a hard time & I just lost it. My friends think it was just because of the insurance. It was & so much more. I'm in constant discomfort do to the expanders & its getting to me. I just don't feel as strong as I show I am. A close friend has stage 4 rectal cancer & has be going through agressive treatments. I just feel that I have no right to complain. My cancer is gone & he might die from his. Can anyone out there relate? Yes...lol. I can relate.  I went to a surgeon to look at a lump in my right breast, Jan.'06; he did a biopsy that same day & it was cancer.  Dr. wanted me to have a breast MRI before he would operate, my breasts were too dense due to natural progesterone cream and I had to wait six weeks to schedule an MRI.  The delay was the best thing that ever happened to me.  Started some natural/alternative therapies, ate right, took vitamins.  Finally had lumpectomy Mar, 06,  didn't get it all, had some inflammation, on antibiotics for 2 mons, went back in and did a mastectomy with expander (done by a plastic surgeon), Aug '06.  I was miserable.  If I ever have another drainage tube in me, somebody just shoot me!!!   They hurt worse than the surgery.  After they came out, I was so scared to walk or shop or be in a car, scared somebody would walk into me or I would be in a wreck & the expander would just explode...LOL !!!  Dr. thot I was a little nuts, but he just has no idea (and will never know) how unsettling it is to have this foreign 'thing' in you.  To make a long story short, had another surgery for the implant, then had to have another one because the Dr. decided the 'belt' support for the implant was too high and it wasn't connected to anything.  So the implant kept slipping further & further down the chest wall.. well... duh !!...  So had to have the implant replaced and he attached the support this time.  So I was a whole year with surgeries.  Happy I did it & so happy it is behind me.   You aren't as strong as you were before.  Surgery, anesthesia, recovery takes a lot out of you.  I was told not to raise my arms above my head for 4 - 6 wks and not to lift over 5 lbs.  I couldn't open a carton of milk after a year of that advice..lol...  It has been 3 yrs now and I still don't feel as strong as I once was but I am doing great !!  Don't you feel guilty.  No cancer is easy.  It changes your life forever!!  And having been there, you can be so helpful to your friend & vice-versa.   Just eat right, take it easy on yourself.  You 'ain't' going nowhere..lol.  So, stop & smell the roses.  Reach out to others, pray, meditate;God bless & be a blessing to others.  This too shall pass as the old saying goes.  It is kind of you to be sympathetic to your friend.  Be strong for your friend & yourself.  Nothing wrong with an upbeat, positive attitude.  That may be wonderfully helpful to your friend.  If you read the posts in here a lot, they say over & over, attitude can make all the difference.  I wish you patience & tolerance with yourself & others around you.  I wish you strength and joy.  Oh, by the way, it is ok to cry sometimes.  Somebody gave us tear ducts for a reason, right?  I always feel better after a good cry..lol  You take care & God Bless.         ps... just a hint to anybody going thru this.. I sew so I had some packs of seam tape, the white, lacy, polyester type.  It doesn't ravel so it was perfect.  I tied a length of tape around my waist & pinned all the drainage & pain bulbs to the tape at my waist instead of pinning them to my bra. It was great in the shower.  I would just take off the wet tape off after my shower & use a fresh, dry length & repin the bulbs.  Worked wonderfully. Who ever you are....I thank you SO MUCH, for one making me chuckle about the drains. I still have one in. What a pain in the ass. Second for letting me cry. I know everybody is trying to be supportive. But they really don't know. I was in public for the first time yesterday. I felt like everyone was looking at me. I couldn't wait to get home.  I have 2 parties to go next week end. I just don't know how I'm going to do it. One is all of my boyfriends group & next is his family ( grown children & exwife). Just wish me luck. Anyway, I thank you for responding. Much health & happiness to you!  ",
      "MessageIndex": 5,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38742,0.htm",
      "Title": "emotional support"
    },
    {
      "AuthorID": "julyruby",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/julyruby",
      "Content": "  On 8/7/2009 heartsurvivor wrote: Hello, My name is Kimberly C. and I am going to have a breast biospy on monday and I scared to  death that I may have breast cancer ! My sister was dignosed  with breast cancer two years ago and so you can see that this runs highly in my family. When I first read this message I though that this is  me, to back up that sataement when the dr first found  that I had a lump on my breast ; i di not say anyhtining to my family  until I went to have a mamagram and a ultersound, boy was that hard to do !!!    My family know that there was somnething not right  with me  and then finally I just broke down  crying  and final said I  may have breast cancer! well to summerize all of that ,   i  am trying to be stong but really in side I feel like I am going to explode!! Never keep it inside always know that someone is ready to listen to you!!! Kimberly C.   I will keep you in my prayers as you go through the biospy tomorrow. Imagine you hand is being held. It will be me every other survivor of breast cancer. I thank you for responding. You did make me feel alittle better. I'm crying now. Thats good! I truly wish you well!! Sharon",
      "MessageIndex": 6,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38742,0.htm",
      "Title": "emotional support"
    }
  ]
}