{
  "AuthorID": "Kaddy",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
  "Posts": [
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "Wow! I just found this web site and already have learned so much! Let me tell you about my taxotere! June 2002 I had stage 2 with 3 pos nodes. I had masectomy and tram flap reconstuction then started 6 treatments of A/C and was to have 4 treatments of taxotere. After two treatments of taxotere I cold NOT walk or even lift by butt off a toilet seat. I was wheel chair bound hospitalized and they kept trying to find reason other than the taxotere for my paralization. After a nuerolgist comfirmed he could not find anything and he releashed me from the hospital and confered it must be a side effect from the taxotere. With that I went to get my third dose of T and my oncologist recommended to stop treatment as at that time they did not know if this was going to be permanaent or not. Having cancer was hard enough but being paralized was frightning and unthinkable. They did not do any futher treatment of any kind, I have not had any drugs of any kind. It took two months of physical therepy and I regained all movement and by spring of 2003 I was on the golf course daily. I'm to date doing great too. Who knows what good that poison really does for us! Good luck and keep in touch as there is life after cancer. With in two months I was back to work full time and resumed all activity as before! Life is GOOD!",
      "MessageIndex": 4,
      "PostDate": "04/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4684,0.htm",
      "Title": "Side Effects of Taxotere"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "As a cancer survivor for four years and someone with 7 sisters I can tell what NOT to do. I was 48 at the time my oldest sister being 54 and she constantly kept telling me things like you'll be one of the lucky ones and your hair won't fall out, or you will breeze though this because you have always been such a strong person. To this day both those phares hurt like hell! 1. If the chemo is working your hair will fall out!!! 2. Doesn't matter how strong you are the poison called chemo is running throuh your body and it makes most people very ill.Opposite of strong is weak so how do you think feel I felt when I couldn't even walk. I live 350 miles away from my sisters however some never even called as they didn't know what to do I guess. I know I had some very close friends who did the same too. The thing that I wish people would had done is call or visit and just ask how I was. I felt so much pressure on always trying to protect everyones feelings and was afraid to show my own feelings. Cancer is deadly! I think it would have been so nice just having someone sit in my living room playing cards or talking with them. Things I appreciated were meals my husband didn't have to make as he had a big role just taking care of me! A new book to read, Going to an appointment with me. I hope this helps you feel better.",
      "MessageIndex": 7,
      "PostDate": "03/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2495,0.htm",
      "Title": "Breast Cancer Mets to Bone Treatments"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "Thanks so much for your input. I did not have a implant but my feeling sounds exactly like yours. I have explained this numerous times to my oncologist and he has never ordered a test or thinks nothing of it. He says it's just scar tissue. He does not believe in any additional testing either. I have begged for a PEt scan or MRI and he just says they give to many false posivtives and have no real value. I guess I've just accepted that and I am a 4 year survivor now and feel great so I just rejoice!!! God is GOOD!!!!! Hope you to stay well and thanks so much for sharing!!!! Kaddy",
      "MessageIndex": 2,
      "PostDate": "25/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4992,0.htm",
      "Title": "Pain Under a Reconstuction"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "My best friend just told me that she has been having a very itchy breast for the past week. Says it wakes her out of a dead sleep and is driving her crazy! I did of course suggest she get it checked but she's so stubborn. As a  breast cancer survivor I'm scared for her. Just wondering if this could be something.Her mom had breast cancer 30 years ago and my friend is 40. Thanks Kaddy",
      "MessageIndex": 0,
      "PostDate": "20/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8363,0.htm",
      "Title": "has anyone ever had this symptom"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "I had a masectomy and tram flap reconsturction in 2002. The past year I have have a weird sensation feels really tight. Never had this before, also sometimes it tingles like a limb that falls asleep. Does anyone else ever experience this. My oncologist doesn't seem to concerned yet he has done no scans of any kind since before my surgery. Just mamograms and breast exams. Should I be getting more? Kaddy",
      "MessageIndex": 0,
      "PostDate": "03/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4992,0.htm",
      "Title": "Pain Under a Reconstuction"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "I have a very good friend who has been a breast cancer survivor for 16 years. She is only 43 and today was told it has returned. She had a masectomy 16 years ago and the cancer returned the same spot however no lump just extreme pain in her calvical and petral muscles. I am so worried about her and don't know about this. Does anyone have any information? I would appreciate it! I too am a cancer survivor so I do understand! Thank You!",
      "MessageIndex": 0,
      "PostDate": "10/05/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5313,0.htm",
      "Title": "Return Cancer"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "My friend was having pain near the surgery site. She had been having shoulder pain that and even after physical therapy the pain never went away. She finally went to a surgeon and he did a CT scan and needle biopsy. Cancer was confirmed. You may just need to get it checked out for piece of mind! Good luck!!!!",
      "MessageIndex": 2,
      "PostDate": "14/05/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5313,0.htm",
      "Title": "Return Cancer"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "First thanks to both of you for giving your suggestions. I have begged for tests and have asked so many questions that I think they are sick of me asking. They just keep telling me there is no test to validate my questions and they have no eveidence that MRI etc. do anything other than give false positives and make the patient worry for nothing. I've also asked several MD's for their advice and they just say thay are comfortable with whatever my oncologists is doing as that's his specialty. Thank you and stay well! Kaddy",
      "MessageIndex": 3,
      "PostDate": "06/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4997,0.htm",
      "Title": "Follow up Care After Last Treatment"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "I just read your posting and my heart goes out to you. Almost four years ago I was right where you are today. Being in that state of not knowing is incredibly crazy! For me after I had my diagnois and started treatment it all felt better. I think just not the knowing foresure is crazy!!!! My doctors acted very quickly and I do thank them for that as sometimes to much time can make you nuts. God willing you will be okay and yes the treatments will make you ill your hair will fall out however you can have a life after cancer. I pray yours will be negative and you won't have to endure treatment. For me it helped so much to have others who had gone before me with treatment to talk to. I asked my surgeon to give me a name of someone he had done surgery on and after talking to her I felt eased. Nobody can undestand what it's like unless you have lived it. I would be happy to talk to you on the phone if you like just e-mail me back and maybe we can touch base. I don't know where you live, but I'm in SD. I did have a large 4.7 cmm. tumor mastectomy and I had a tram flap reconstruction, I also had 3 of 11 nodes that were positive. Treatment ended Dec. 2002 and by Feb. 03 my life was back to normal!!! Life has been good and I think after you go thru someting like this you do appreciate the little things~ Take good care and God willing you will be okay too! Kaddy",
      "MessageIndex": 1,
      "PostDate": "18/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5116,0.htm",
      "Title": "What is Normal?"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "I am a cancer survivor since June of 2002. I had a masectomy and tram flap reconstruction I also had three cancerous lymph nodes. I also had 6 treatments of adrimiacen and cytoxen and two treatments of taxetere. December 2002 they stopped treatment because I had lost all mobility from my waist to my knees. At that time I was told to go and live a happy life. I was to return every three months to oncology for follow up after two years it went to six months. All my oncologist has ever done since my last treatment is to do breast exams and recommend yearly mammograms.I have no medications, they have not done any lab work or scans of any kind or ultasounds. This last week I went to my last visit and was told by my oncologist my medical doctor will do the follow up as at this point they no longer feel it's beneficial or necessary to continue with cancer care doctors. I am blown away! First I keep asking about some sort of scan or something to show me I am cancer free. How will I ever know if I get cancer under my reconstructed breast? Does any one have any answers. DO the rest of you get better follow up? Are you getting scans.How do you get your doctors to order them? I am so confused and would appreciate any assistance I could get. Thank You Kaddy",
      "MessageIndex": 0,
      "PostDate": "04/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4997,0.htm",
      "Title": "Follow up Care After Last Treatment"
    },
    {
      "AuthorID": "Kaddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kaddy",
      "Content": "What is a tumor marker and how do get one?",
      "MessageIndex": 2,
      "PostDate": "04/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4881,0.htm",
      "Title": "Reoccurence"
    }
  ]
}