{
  "AuthorID": "kah49",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
  "Posts": [
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "hello, was just wondering if someone could answer a question for me. in 2007, i was diagnosed with stage 2, e/p and her2 positive breast cancer, and in 2011, diagnosed with stage 1 ae thyroid cancer.   doing really good so far, last pet scan in january of this year was clear!   my question is, about two years ago, i found a lump on the under side of my upper arm. my chemo dr called it something but i can't remember what, but he said it was fairly common and it is something to do with the lymph system. i think he called it lympitis or lymphoids, something like that. but, like i said, the pet scan was clear, (i have had two scans since i found it and they were both clear of disease). now i have found another one on my other arm in the same position. does anyone know what this is? i have tried looking on the net, but since i can't remember what it's called, i can't find anything. any answers well be really welcomed.    thank you, kathy",
      "MessageIndex": 0,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66339,0.htm",
      "Title": "lumps under arms"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "hi,  was just wondering if someone could give me answers about spinal lesions.   this dec. will be 5 yrs since breast cancer and a little over 2 yrs of thyroid cancer. about a year and a half ago, i had an mri for lower back pain and it showed a lesion. i also have a bulging disc right beside the lesion.  i was sent to a spine dr and he called it \"discitis\". i have also had 2 pet scans since the mri and every thing was clear. my question is, if this lesion is cancer, would it not be getting worse by now?  i have had a few \"flair ups\" where the pain is really bad, but i go to family doc and he gives me cortisone shots and it gets better. its been 5-6 months since last flair up. i have looked on the net at spinal lesions and can get no real answers. there is a constant mild pain, just a kind of nagging pain most of the time. so any answers would be really appreciated. thank you kathy",
      "MessageIndex": 0,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69047,0.htm",
      "Title": "spinal lesion after breast cancer"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "Hi, To all of you ladies who replied to my questions about Herceptin, just thought I would let you know that my CT scans and bone scan came back normal!!!! I want to thank everyone of you for your replies and your prayers, and I still have you in mine. I know that all this can change, especially since I am her2 +, but for right now, (thank God) I'm on the road to recovery. I still have 6 more months of Herceptin, but hey, I can handle that. Again, thank you all so much, and I wish the very best for all of you!  Kathy",
      "MessageIndex": 0,
      "PostDate": "30/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28851,0.htm",
      "Title": "test results"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "I have had stage 2 breast cancer, (small tumor but it had spread to lymph nodes), also her2 positive. i have finished chemo and radiation and am now 5 months into the herceptin treatments. I also had double mastectomy. I would like to hear from someone who has been diagnosed as being her2 positive, and has had the herceptin treatments. I guess i would just like to know that there is hope at the end of this journey. My dr says that my cure rate is at about 70 to 80 percent, but I read that sometimes the herceptin does not always work. Even though my cure rate is pretty high, I still get nervous, after reading some of the info on breast cancer. Maybe I should just quit reading so much, huh? ha ha Thank you for any info k",
      "MessageIndex": 0,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27787,0.htm",
      "Title": "herceptin"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "  On 1/15/2009 tcmijw wrote: dear k, hope that this note finds you in great health.  my story is similar to yours, I had node positive, stage lll breast cancer in may of 2007.  I am still trying to find answers to so many issues that I think about even 1 1/2  years later.  I do know that herceptin has a very high approval rate and I can only hope it will do what it is supposed to do for the many women who have taken it or still taking it.  the other e-mail was right, 10 years ago our situations would have been vastly different!  the side effects of herceptin creep up on you over the course of the year... i gained a lot of weight, this could have been from the chemo, not sure? my bones really started to hurt and oddly enough my feet! sometimes it was so hard to walk... anyway I am 5 months free of no drugs and I am really starting to feel great!  I know this may sound crazy but each day that goes by, I think about cancer less and less...it has happened to us for some reason.  when I see or meet someone going through any type of cancer, my heart just melts, knowing that their story is similar to mine and I hope that they are fighting it the beating it the best they can! best of luck! JW Hi JW,  thank you for answering my post. It's great to hear from someone who has been thru this and is doing well. Like you, i gained a lot of weight too, (about 25 lbs, yuck!), but that's the least of our worries, right? And like you, my feet hurt too. When i first get up in the mornings, i feel like a duck because i waddle so much. But once i've been up for a while, i guess i walk the soreness and stiffness out. All of my joints ache and get stiff, but i'm hoping once i finish the herceptin, that will go away. I'm supposed to finish the herceptin in march. Finally!! I also go next month to have some more ct scans and my onco said that would determine my stopping point. Got my fingers crossed. I was wondering, did you have the lumpectomy or mastectomy? I went to my radiation dr last week, and he said i should be able to have my reconstruction soon. I'm sure i'll have to at least wait until i finish the herceptin, but that's ok because i would like to try to lose a little of the weight first. It's just such a big decision about which option i'll take, you know, either the implants or the trans flap. The trans flap is such a major surgery, (4 to 5 hrs.) but the implants are scarry too. I've been reading up about them, and it doesn't sound to good either way. Any way, thanks again for replying and i sincerely hope everything continues to go very well for you!! k  ",
      "MessageIndex": 15,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27787,0.htm",
      "Title": "herceptin"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "Hi, I was diagnosed with e/p positive breast cancer, (also her2+) 2 years ago. Went thru all the treatments and last scans in Nov showed everything is fine. My problem now is I was told today by my GP that I have multiple nodules in my thyroid but that they seem benign. He is referring me to an endoctronolgist. I have been reading on the net about thyroid nodules and some of what I am reading is a little scary. I have read that thyroid cancer is rare but if there is a histrory of breast cancer the risk is higher. I also read that some nodules can be cancerous and the only way to be sure is thru a biopsy. I did have radiation treatments for the breast cancer and I had some lymph nodes removed because the cancer had spread to them. I guess  my question is has anyone else had this problem and if so what was your outcome.",
      "MessageIndex": 0,
      "PostDate": "18/01/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,43207,0.htm",
      "Title": "thyroid nodules"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "  On 1/15/2009 tcmijw wrote: dear k, hope that this note finds you in great health.  my story is similar to yours, I had node positive, stage lll breast cancer in may of 2007.  I am still trying to find answers to so many issues that I think about even 1 1/2  years later.  I do know that herceptin has a very high approval rate and I can only hope it will do what it is supposed to do for the many women who have taken it or still taking it.  the other e-mail was right, 10 years ago our situations would have been vastly different!  the side effects of herceptin creep up on you over the course of the year... i gained a lot of weight, this could have been from the chemo, not sure? my bones really started to hurt and oddly enough my feet! sometimes it was so hard to walk... anyway I am 5 months free of no drugs and I am really starting to feel great!  I know this may sound crazy but each day that goes by, I think about cancer less and less...it has happened to us for some reason.  when I see or meet someone going through any type of cancer, my heart just melts, knowing that their story is similar to mine and I hope that they are fighting it the beating it the best they can! best of luck! JW Hi JW,  thank you for answering my post. It's great to hear from someone who has been thru this and is doing well. Like you, i gained a lot of weight too, (about 25 lbs, yuck!), but that's the least of our worries, right? And like you, my feet hurt too. When i first get up in the mornings, i feel like a duck because i waddle so much. But once i've been up for a while, i guess i walk the soreness and stiffness out. All of my joints ache and get stiff, but i'm hoping once i finish the herceptin, that will go away. I'm supposed to finish the herceptin in march. Finally!! I also go next month to have some more ct scans and my onco said that would determine my stopping point. Got my fingers crossed. I was wondering, did you have the lumpectomy or mastectomy? I went to my radiation dr last week, and he said i should be able to have my reconstruction soon. I'm sure i'll have to at least wait until i finish the herceptin, but that's ok because i would like to try to lose a little of the weight first. It's just such a big decision about which option i'll take, you know, either the implants or the trans flap. The trans flap is such a major surgery, (4 to 5 hrs.) but the implants are scarry too. I've been reading up about them, and it doesn't sound to good either way. Any way, thanks again for replying and i sincerely hope everything continues to go very well for you!! k  ",
      "MessageIndex": 10,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27787,0.htm",
      "Title": "herceptin"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "hello pat, my name is kathy. i just read your post about alternative treatments and  have a question about the protocel.   i have had breast cancer (e/p and her2+) and also thyroid cancer. i did have the chemo and radiation, but my question is can the protocel work as a preventative medicine too, or is it only a curative?     thank you for any info,",
      "MessageIndex": 9,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60781,0.htm",
      "Title": "New Diagnosis"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "hi, i've recently finished treatment for stage ll breast cancer, and so far everything is going good. in november i had ct scans and bone scan, every thing came back normal. currently, i am on zometa, an iv treatment that i get every six months for my bones. I just got my second treatment november 10. I was wondering if anyone of you is taking this treatment and have you had any problems with it. for about two weeks now, i have had some pretty bad lower back pain that radiates into the front of my lower abdomin. it feels like it is coming from the back pain, but i've always thought low back pain radiated down the leg. my chemo dr has me on the zometa because i have osteopenia and he said it is supposed to help keep the cancer from coming back into my bones. I just can't understand why the back pain is causing the front abdomen pain. if there are any of you having this problem, or are on the zometa, i would appreciate any thing that you could tell me.",
      "MessageIndex": 0,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42118,0.htm",
      "Title": "low back pain"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "well, here i am again, lol.  i have had stage two breast cancer (4 yrs ago), thyroid cancer, (early stage, one yr ago), now i have what appears to be a small lesion on my lumbar spine along with a herniated disc. (mri showed this)  i am scheduled for a pet scan tomorrow, if our insurance company approves. i was sent to a back dr who said the lesion was discitis and i was also told \"it is not cancer\". went to my radiation dr last week for a routine visit and he said they could not be sure if was cancer or not, but that the lesion was too small for a biopsy. (he's the one who ordered the pet scan)  i have searched the net and have found out there are several reasons for spinal lesions and dr said that my symptoms really do not match up with cancer. i guess my question is, has anyone else had this problem, and if so, what was your diagnosis.   i'm really having a hard time with this and would appreciate any info someone could give me. thank you, kathy",
      "MessageIndex": 0,
      "PostDate": "19/09/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61977,0.htm",
      "Title": "spinal lesion"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "Hi, was wondering if anyone has had this problem. I have had stage ll breast cancer, small tumor, but had moved into lymph nodes. had 3 nodes removed, cancer was in 2 of them. I had chemo, (finished in may 08), radiation, (finished in august 08), and herceptin, (finished in march 09) my problem now is I have this \"thing\" under my right armpit, on same side as cancer was, and it doesn't feel like a lump, the best way I can describe it is like a small rope under the skin starting at my armpit and moving a few inches down the inside of my arm. My GP said maybe phlebitis or maybe infection in lymph nodes. ???? It is only a little tender to the touch and has been here for about 2 weeks. I started working out with weights and this is about the time it came up. so I was wondering if anyone could tell me anything about this. I'm scheduled for some ct scans next month.",
      "MessageIndex": 0,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40814,0.htm",
      "Title": "armpit problem"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "I was diagnosed with stage ll breast cancer in 2007, HER 2+. I had a mastectomy and followed through with chemo, radiation, and Herceptin. I finished the Herceptin in March of this year and now I am ready to begin the reconstruction phase. My problem is I can't decide which type of surgery  I want. I had rather have the implants because it is a much easier surgery. (I've had enough surgery's to last a lifetime!) The first plastic surgeon I went to said that because I had had radiation, the implants were not an option. I went to a second surgeon to get a second opion and he said that I could try the implants and if it did not work out then I could go with the tram flap procedure. There is just so much involved with the tram flap procedure that I just really dread the idea of having that done, so the implants seem like the way I want to go, but if there is the chance that it is not going to work, it seems unnecessary to have it done. My question is, is there anyone here who has had the implants after having had radiation, and if so, how was your outcome?  ",
      "MessageIndex": 0,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37271,0.htm",
      "Title": "breast reconstruction"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "Hi, I am new to this, but I was wondering if I could find answers here. I was diagnosed with invasive lobular breast cancer in Nov, 07, and it had spread to my lymph nodes. I had a mastectomy, had full body PET scan and was told that everything was normal. I have just completed chemo and about to start radiation. I was also diagnosed as HER2+ and have started the Herceptin. My question is, I got copies of some of my test results, and the report on my PET scan says that it is abnormal. There are 3 \"metabolically active nodes\" in and around the area of my mastectomy. My dr has not mentioned them and I was wondering if this means cancer or can it be something else? It will be 2 more weeks before I see the dr again and it's got me a little worried. Any info would be greatly appreciated.  Thank you.",
      "MessageIndex": 0,
      "PostDate": "01/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24596,0.htm",
      "Title": "pet scam abnormal"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "Hi, Can anyone explain to me what hypermetabolic nodes mean?  I have gotten a copy of my PET report and it says that I have 2 nodes, in chest area where my breast cancer was located, that are hypermetabolic with an SUV of 5-8, also a right ovarian cyst with physiologic uptake. This PET scan was done prior to chemo and radiation. I saw an onco gyno today about having my ovaries removed and he said the growth on my cyst was still there but he does not think it is cancer. Of course I'm still concerned because I don't understand all the termonology. Any answers would be appreciated, Kathy",
      "MessageIndex": 0,
      "PostDate": "02/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28932,0.htm",
      "Title": "hypermetabolic nodes?"
    },
    {
      "AuthorID": "kah49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/kah49",
      "Content": "hi Tre, I'm so glad you were able to explain this to me without all the dr jargon, it's easier to understand. I finished chemo in May and radiation in the first of August. I just had a CT scan 2 weeks ago and my onco said everything looked normal, but, when I had the PET scan before I started the treatments, he also said everything was normal. I just happened to get a copy of the scan report and that's how I found out about the nodes. So now I'm having some doubts about my onco. I go back to see him in 3 weeks and I am going to get some real answers out of him this time. I had rather know for sure what is going on than to sit and wonder, you know? But I'm glad you could explain all this to me, thanks alot. Kathy",
      "MessageIndex": 2,
      "PostDate": "04/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28932,0.htm",
      "Title": "hypermetabolic nodes?"
    }
  ]
}