{
  "AuthorID": "Karenasmith",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Karenasmith",
  "Posts": [{
    "AuthorID": "Karenasmith",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Karenasmith",
    "Content": "On Jul 15, 2010 3:25 PM JoyceJJL wrote: HI I have been taking Femara for 2 yrs and my joints and legs, back are killing me,.   I tried the aromasin and arimidex, but had different side effects.  I am seriously considering to be asked to be taken off of this.  I have read so many posts about the side effects of this drug or others its beginning to scare me.  I can barely walk without leg pain.  I just wish I knew more about what would happen if I stopped this.  But its beginning to be more of an option to stop.  As its a continual joint pain 24/7.   Is everyone else having these symptoms?  I wonder if there are people that dont have this problem.,  Mine was a stage 3b ductal breast cancer and had a double mastectomy , chemo & radiation.  Would love to hear feed back from others.  Thanks   Joyce Hi Joyce, I too had stage IIIB ductal and lobular cancer, bilateral mastectomy, etc.  I was on Femara for about 18 mos and couldn't stand the pain in my joints.  It was unbearable.  My oncologist switched me to Aromasin about 9 mos ago, and I am doing better on it.  I still have pain, but not as severe.  However, the hot flashes, weight gain, and lack of energy are the same.  I'm tired of feeling tired all the time, but I'm afraid if I stop the drug the cancer will come back.  Its kind of a no-win situation, but I'm just not willing to take the chance.  I know the symptoms will go away if and when I can stop taking the drug.  I was very intersted to hear of all the incidinces of carpal tunnel on this site because I've just been diagnosed with that.  The brace at night helps.  I don't want to have surgery on that arm as that was the side all the nodes were removed from and they said to not even have blood work or blood pressure done on that arm.  Good luck to you - try to stay positive and be kind to youself.  I found a yoga stretch class very helpful.",
    "MessageIndex": 117,
    "PostDate": "20/07/2010",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
    "Title": "Side Effects From Aromasin"
  }]
}