{
  "AuthorID": "Karin_188",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Karin_188",
  "Posts": [
    {
      "AuthorID": "Karin_188",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Karin_188",
      "Content": "Hello ! My Name is Karin and I life in Germany. I´m 51 years old and I had in Feb. 2004 my first breast-cancer, no lymphnodes with cancer, so I had operation and only 33 radiations. Now on Friday the 13. of Oct. the shock ! A new breast cancer in the other breast and already 1 liver metastasis. On the MRT it showed a second one ! I had my cancer operation on the 24. of October and on last Friday the 3.rd Nov. I had my first chemo EC. I would like to stay in contact with people that have liver metastasis from breast cancer. My sister passed away with 45 years on breastcancer with liver metastasis. I hope that they find something against liver metastasis soon, because Herceptin would not work for me (HER 2 negativ). Wish you all the best ! Karin",
      "MessageIndex": 38,
      "PostDate": "07/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1311,0.htm",
      "Title": "Breast Cancer Metastasi to The Liver"
    },
    {
      "AuthorID": "Karin_188",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Karin_188",
      "Content": "Hi Carol ! My name is Karin, 51 years old and I`m from Germany. We have a lot together ! I had in Febr. 2004 a lumpectomy, 33 radiations and Tamoxifen - no Chemo, because my lymphnodes where free and clean. Now in Oct. 2006 a new cancer in the other breast, lumpectomy on the 24. Oct., taken out 22 lymphnodes all free and clean, but 2 metastasis in the liver ! Started on the 3. Nov. my first Chemo EC, have already half of it and have to go for 2 more ! Herceptin will not work for me ! I never heart about this new drug lapilabib !? Xeloda should be very good, but you have to watch if you get the hand/food-syndrom you should get Vitamin B 12 ! Dear Carol, we will fight this cancer and we will win !!! Where are you from in USA and how old are you ? We have a condo in Naples Florida, where we would now be if I would not have this sh.. cancer now ! Don´t let get you down, you can fight ! I will pray for you too and send my positiv energie to you ! Wish you a nice Christmastime ! Karin",
      "MessageIndex": 1,
      "PostDate": "05/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8079,0.htm",
      "Title": "Stage 4 Mestastic"
    }
  ]
}