{
  "AuthorID": "katandgary",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/katandgary",
  "Posts": [
    {
      "AuthorID": "katandgary",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/katandgary",
      "Content": "On Sep 16, 2005 12:00 AM Roz57 wrote: Hi Christine Sorry to hear you are having pains with Aromasin. I have posted a message on 14/9 which you might be interested in as I had quite a few replies from it. I think all 3 aromatase inhibitors - Arimidex, Femara and Aromasin - all seem to have side effects with most people. I start taking Aromasin as from October as I just cannot take the pains in the joints any more with Arimidex, I started off alright and only started getting pains after about 6 months of being on the drug but 20 months later I have been in excrutiating pain and could hardly get out of bed. I can't bear the thought of having the same pains with Aromasin. I will, nevertheless, take it for a while to see how I get on. I will write a message in a few months time letting everyone know how I am getting on. I think all these oncologists/physicians etc., do not realise how painful the side effects are on this medication - perhaps the trials have not been for long enough. Go well and good luck. Ros. After being Tamoxafen for a couple of years my oncologist switched me to Arimidex as Tomoxafen was leaving me in a \"fog\" most of the time with increasing memory problems.    After 7 months of Arimidex, I started to notice pain in my arm.  I thought it was from weight training and made an appt. with a sports doctor.  He prescribed antinflamatories which I took for a couple weeks with no results.  The pain started to go to my fingers and it's become increasingly difficult to open doors and even write with a pen.  My shoulders started cracking and I eventually gave up the weights.  Another side effect(?) was legs jerking at night. My knees hurt and it's especially painful to walk down stairs.  My oncologist told me to take a holiday from the Arimidex (3 months).  It's been two weeks since stopping the drug but I'm still having these side effects.  Does anyone know when and if this goes away?  Quality of life is important and to hear so many people say they will continue with their aromatase drug even though they're experiencing worsening pain scares me.  I don't want to end up in a wheel chair and want to know if anyone has removed themselves from estrogen inhibitors and with what results.  Thanks!  ...kat",
      "MessageIndex": 154,
      "PostDate": "05/02/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "katandgary",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/katandgary",
      "Content": "On Apr 20, 2012 5:40 PM janemettee wrote: On Mar 11, 2011 5:42 AM ojan123 wrote: Just a little note before you run out and start taking flax seed etc.  Please be aware if your cancer is estrogen driven, flax seed is a phytoestrogen.  Please read up before starting yourself on any regiments.  In case you are not familar with what I mean in regards to estrogen driven I am referring to you pathology of your tumor whether the receptors were positive for estrogen.  Phytoestrogens or plant estrogens act on your body the same way as your natural hormones. My MD said to use fish oil for joints not flax seed since my tumor was estrogen sensitive.  Fish oil is also good for brain function also since the aromasin (lack of estrogen) has made my memory pretty bad. I was told by the nutritionists at Cancer Care not to eat flax seeds because my tumor was estrogen feeding.  However, they said flax oil did not have the same effect.  I've been using flax oil in my smoothies regularly and I'm 3 years out from my surgery.  If someone knows something I do not, please share....Kathy",
      "MessageIndex": 180,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    }
  ]
}