{
  "AuthorID": "Kateb",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kateb",
  "Posts": [{
    "AuthorID": "Kateb",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kateb",
    "Content": "Hello.  I am new to the board and just looking for some information.  Four years ago my mother was diagnosed with inflammatory breast cancer.  She underwent what seems to be the typical treatment.  She had IV chemo, mastectomy, radiation and more IV chemo.  After a year of that treatment, she began taking xeloda. She had some side effects from the chemo, but dealt with them as best she could with anti-nausea medications and darvocet.  Her burns were also so bad that she had would care every day on them. About one year of xeloda, she had some symptoms in her arm that were first diagnosed as lyphodema.  She found a therapist who gave her a great deal of relief from the lymphodema, but not all of her pain was gone.  The therapist was convinced that there was something other than lymphodema in her arm, and after several different scans they found cancer in the arm.  She was treated with radiation and a higher dose of xeloda.  She was in a great deal of pain with this treatment, but handled it as she knew it was necessary.  Now she has again been diagnosed with metastic cancer on the same side.  This time it is brachioplexus cancer (sp?)  The radiologist did not feel that he could use radiation in the same area again, so the current treatment is Avastin IV chemo with 3000 mg of xeloda a day.   She has now been to the hospital twice in a month.  Both times were shortly after her avastin treatment.  The pain is so bad that she is even crying out in her sleep.  She loves her oncologist and feels that she is lucky to have lived this long.  However, after tonight, I am angry.  He said that on paper she is just fine and that this pain is psychological rather than physiological. He claims that the treatment could not be causing the pain.   I can't believe that he would say that after she has dealt with rather harsh side effects for years with little complaint.   Has anyone else heard of this combination of drugs causing severe body and specifically head pain?  She knows that the pain is not in her head, but right now she is devestated because the person she trusted to take care of her seems to have written her off.   Sorry for the ramble.  I am a bit undone right now.",
    "MessageIndex": 0,
    "PostDate": "01/05/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11752,0.htm",
    "Title": "side effects of xeloda and avastin as treatment for IBC"
  }]
}