{
  "AuthorID": "KateR",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KateR",
  "Posts": [{
    "AuthorID": "KateR",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KateR",
    "Content": "  On 9/21/2007 terrib wrote: I'm 45-years-old with five young kids and was diagnosed with Metaplastic Breast Carcinoma in April, 2005. I had a mastectomy at that time.  Three-weeks-ago I found a lemon size mass in my bottom.  The doctor sent me back to M.D. Anderson where they found a spot on my neck and on my lung.  They are now doing chemotherapy (FAC).  Has ANYONE had a positive result with any type of chemo, radiation, etc.  Can these sites be surgically removed?  I need help (as we all do).  Someone, somewhere, has to know something about treating this terrible disease.  Please let me know. Territ Hi Terri!  I just turned 50 and I have metaplastic bc too--mastectomy August 2006 and a month later they discovered multiple small tumors in my lungs.  Since then I've been trying various chemotherapy drugs to see if we can find anything it reponds to.  I've had steady, but not rapid (maybe something worked, a little?)  growth of the lung tumors, but no tumors anywhere else yet.  I understand there are different kinds of metaplastic -- I have squamous cell (square shaped cells, like skin).  Do you know if you have the same kind?  I'm not sure what the F in FAC you are on stands for? You have probably heard the same thing I have, that there's not enough data to show anything \"works\" for metaplastic bc.  I don't know if what you have is the same as my cancer, but in case it helps, my Dana Farber (Boston) and Mass. General oncologists have so far tried: AC (tumors grew); Taxol/Avastin (they might have slowed down; not sure-- may try it again);Cetuximab/Carboplatin (clinical trial) (tumors grew); Zactima/Methotrexate/Cytoxan (clinical trial) (mixedresult/stable?) I've taken the Zactima combination for just over two months. It is a new advanced breast cancer clinical trial that combines the trial drug Zactima (an anti-angiogenesis drug like Avastin) with low doses of Methotrexate and Cytoxan.  I don't want to raise false hopes, because I just had the scans, and we all get to know that something that seems to \"work\" may only work for a short time, but I was amazed to hear that although some of my tumors grew a bit, a couple shrank (a first for me on any drug) and some stayed the same.  They are calling it a \"mixed\" result but stable disease and having me take the trial drugs for two more months before scanning again. I don't have a good answer to the radiation question either.  I asked if they could radiate my largest tumors, but the response seems to be that I have so many it wouldn't make a difference so they prefer chemo.  I keep asking about all the options.  I've heard MD Anderson is one of the very best centers.  If you want to ask your doctors about whether Zactima (or Sutent, or one of the other clinical trial drugs being tested now) is a possibility for you, (I sound like a drug ad) I'm sure they'd know about it. Best of luck!!  Kathryn",
    "MessageIndex": 1,
    "PostDate": "23/09/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16387,0.htm",
    "Title": "Metaplastic Breast Carcinoma"
  }]
}