{
  "AuthorID": "KathyAd",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
  "Posts": [
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Linda and Sunset5, thank you so much. I burst out crying as I read your responses. You are so kind. I will check out support groups. I thought I was nuts and that I was the only one who could possibly \"miss\" chemo. Thank you, thank you, thank you. Xoxo",
      "MessageIndex": 3,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71472,0.htm",
      "Title": "miss hospital staff and chemo staff"
    },
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Can I ask the strangest question -- did anyone out there miss going to the hospital and seeing the staff once chemo was over? And how did you deal with it? I feel like it is such a community. I have 4 chemo treatments left, and I am kind of sad I will not see the chemo nurses after that. I have been going to the hospital for weekly Paclitaxol treatments, and feel like it is a community. The Taxol agrees with me much more than the AC I was on at first, so I do not come home and feel really icky like I did on AC. I think some of this relates to me being home alot, plus I am on the social side and like to be around people. I have not been to work in several months, so I do not see the people at work. I have young children and gave up my hobbies when I had them. I am exercising on our home treadmill about 10 minutes a day, and am almost thinking of joining a gym so I can start being part of that \"community.\" I think there are also support groups I can join at my hospital, but I would not see the nurses and other hospital staff there. A friend of mine with cancer said she hopes she never sees the hospital staff again. I know for some patients, the hospital reminds them of cancer. But for me, it reminds me of people who have been extremely kind to me the last few months. :-( Am I nuts? :-(",
      "MessageIndex": 0,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71472,0.htm",
      "Title": "miss hospital staff and chemo staff"
    },
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Hello! I am new to this site, and am hoping someone can give me some input and/or links to articles about a double mastecomy vs. radiation. I was diagnosed with Stage 2 breast cancer in Novmeber 2012. I had a lumpectomy in December on the right breast. I am currently in chemo, and am supposed to do radiation after that. I am Triple Negative, and my lymph nodes came back negative (a sentinel node biopsy was done during the lumpetcomy.) I am 43 years old, with no BRCA mutation. I am also rather busty - a size G on the healthy side, and a size DD on the side that had lumpetcomy. :-( Before the lumpetcomy, the breast surgeon told me she thought a double mastectomy would not really decrease my chances of more cancer. I was also under the impression that, once all my treatment was done, I could get surgery on both breast to even them out and make them perkier and such. It is now my understanding that the breast getting radiation cannot have surgery after that. I am toying with the idea of a double mastectomy instead of radiation since: (a) I am quite busty (like I said G on one side, and now a DD on other side), and don't necessarily feel like it's critical to \"save\" my breasts. They are quite large and I kind of wanted a reduction anyway (to maybe a C or D). Plus, they are obviously pretty saggy at that big size and age 43. I figured reconstructed breasts would be more perky... (b) A double mastecomty and reconstruction does not sound fun, but neither does radiation. It sounds like radiation is for someone who is really determined to save the breasts they have. (c) Exposing my body to radiation doesn't sound like it's the safest/smartest option. I am wondering: (1) Can anyone send me links to good article about a double mastectomy vs. radiation? (2) Do many people in my case choose double mastectomy instead of radiation? (ex. it is not genetic, the lumpectomy had clean margins, etc.). It seems like radiation is \"standard.\" (3) Do you know if insurance would cover a double mastectomy and reconstruction, even though I've already had a lumpectomy with clean margins? (4) In trying to reduce the chance of more cancer or cancer returning, would a double mastectomy and reconstruction do that better than radiation? At the end of the day, if radiation is the better bet, I could live with it. I would keep the breast that had cancer (size DD) and have my healthy breast (size G) reduced in size. But my breasts would still be pretty big, and pretty saggy. Sorry if this sounds like I am worrying about things that aren't important. I am happy to be alive and happy the cancer was caught at stage 2 and not stage 4. Thanks!    ",
      "MessageIndex": 0,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71191,0.htm",
      "Title": "stg 2 /double mastectomy vs. radiation"
    },
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Thank you, Alli.",
      "MessageIndex": 5,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71191,0.htm",
      "Title": "stg 2 /double mastectomy vs. radiation"
    },
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Does anyone have any input about my questions above? I would really love some help with this! I do not know where to begin or what choice to make :-(",
      "MessageIndex": 1,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71191,0.htm",
      "Title": "stg 2 /double mastectomy vs. radiation"
    },
    {
      "AuthorID": "KathyAd",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyAd",
      "Content": "Thank you, lredder. :-) If you know of any particularly good sites or articles, please do let me know. There seems to be a sea of web sites and articles... Thank you again for your kind words :-)",
      "MessageIndex": 3,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71191,0.htm",
      "Title": "stg 2 /double mastectomy vs. radiation"
    }
  ]
}