{
  "AuthorID": "Kathy_d_5",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
  "Posts": [
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Hi!  We've all gone through this and I agree that the doctors and nurses don't tell you the full extent of the truth of what you are going to experience.  If they did, no one would agree to the procedures.  But, you know what?  We all survived these tests.  Take control and tell your doctor that you want medication to ease the pain of the oncoming procedure.  Don't ask, tell him or her.  Fortunately, the most painful procedure is over.  The dye injection is uncomfortable, stings, but is not so bad.  The fear of the pain is worse.  Talk to everyone, anyone that might help relieve you of your worries and fears.  I know when I went through this, my reaction was silence and shock.  Then I opened up and talked.  The nurse that prepared me for the dye injection was a 8 year breast cancer survivor, she really helped calm me down. Starting chemo was really difficult for me, seeing all the cancer patients and wondering if I was going to be a survivor.  I started talking to everyone within hearing distance and everyone was happy to tell me their experiences and somehow hearing them made me feel a whole lot better and more able to face my future. I am now 2 years and 3 months clear and determined to be a survivor.  Good luck and remember, this too shall pass. ",
      "MessageIndex": 8,
      "PostDate": "22/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10444,0.htm",
      "Title": "Coping with fear and anxiety"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Hi, sorry to hear your wife has joined our reluctant group.  I wish her all the best and as someone has already mentioned, having a caring, sympathetic partner means everything for someone going through this experience.  Although the doctors will tell you some women don't lose their hair, most do.  The Taxotere or Taxol will do it's thing on her body.  I have always had long hair.  After the third chemo, I noticed hair coming out in clumps.  I managed to keep a normal appearance for another three weeks before having it all come off, except for a few sprigs.  I always tied my hair back when I went to bed.  One day I woke up with my hair, still in the elastic, laying on my pillow next to my head.  Maybe I was being ridiculous, but up until that point, I somehow felt like I could still pass as a healthy person.  When I lost my hair, I went into full scale depression.  I then officially became \"the cancer patient\".  It took a couple of weeks of mourning for my hair before I could care less.  I had a wig but often just wore a scarf.  After a while, it was somehow kind of nice, as summer came, along with the heat.  My head was unencumbered by hair and therefore nice and cool!  Your wife will be going through all sorts of emotions.  Her homones will spike and plummet..   My advise is to always remember, sometimes her illnes is talking through her.  If she gets really frustrated and has trouble coping, she needs you to listen, ignore any outbursts and give lots of hugs!  There were times I went completely off the deep end.  Thank goodness my family did not take it personally!   But who knows?  Maybe she will be one of the lucky ones.  Some patients hardly experience anything and even work through their treatments..  Let's hope she will sail through this! All the best! Kathy",
      "MessageIndex": 4,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28972,0.htm",
      "Title": "Hair Loss with Cytoxan and Taxotere Therapy"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Years ago, a friend's mother had cancer, not sure what kind, but she too said there was an odour. A smell she will never forget.  When my mother's friend got cancer, Mom said the smell was unbearable!  When I got breast cancer, I don't remember any change in my scent, although, after chemo, I didn't get any underarm odour for 2 and a half years!  Small blessings!  I am very curious to know what it smells like.  Can you describe?  The thought of recurrence is always in the back of my mind, this just might be a weapon against this horrible disease.",
      "MessageIndex": 10,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Hi!  Find a recommended alternative therapist.  He or she will have a better idea on what to administer.  I've come across info that Vitamin C in large doses, ie. injections are helpful.  Vitamin E, vitamin D.  Elimination of all milk products and sugar, except fruit.  Blueberries are supposed to be extremely good.  Increased intake of vegetables and grains.  Guess what?  Studies have shown that cancer patients that have a positive attitude have a higher survival rate! Best of luck and don't give up! ",
      "MessageIndex": 3,
      "PostDate": "13/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11624,0.htm",
      "Title": "Altenative therapies"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Had the same experience.  Breast became red, inflamed then got rock solid.  Spread to my underarm and reached to my back.  The tissue became very pale and felt like there wasn't any circulation.  No symptoms until 6 months after radiation.  I was told I had radiation overdose, only two other patients in 30 years experienced this.  Nothing to do, just time and patience.  2 and a half years later, the tissue started to soften, first in my back, then my underarm, now have 1/2 my breast soft.  I'm hoping by summer I'll have my whole breast back to normal.  Granted, you may have something else, you must have it seen to.  I too had financial difficulties while getting treatments and was inhibited about the costs.  When I spoke up, everything was taken care of.  Good luck!  Just a note, they never seem to want to tell you anything until they are certain, even then, no mention of side effects, until it actually happens.  Then they usually down play, guess they don't want to add extra stress to an already terrifying experience.",
      "MessageIndex": 7,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20851,0.htm",
      "Title": "question about radiation side effects 11 mo. later"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Sorry I didn't answer, I am a computer idiot!!!  I only now discovered how to find messages I had replyed to.  It's so frustrating when the medical bills are unexpected and not explained appropriately.  I am from Canada and our medical system is different from yours.  Apart from surgery, chemo and radiation,  I needed to have daily injections for 7 days in a month for 6 months to keep up my red blood cell count.  The cost of 7 days worth of injections was over $2000.  I told the doctor I could not afford it.  My brother got so angry he phoned the company that made the drug and complained about the cost.  Would you believe, they told him they would supply it for free!!!  I got all 6 months worth!  They were so nice and always got the meds to me on time! My breast remains partially hard.  I still have a painful, large, red, hard rectangular area where I was given radiation.  The oncologist keeps telling me that in time the pain and the hardness will go away.  I have numbness and pain in my arm from the removal of the lymph nodes, but the affected area is getting smaller.  I was lucky, though, I had complete mobility in my arm after the surgery.  I understand many have trouble with shrinking cords and such.  It's been almost 4 years and I still suffer from extreme fatigue, although I am much better than I was the first three years.  It was never explained why I had been given too much radiation.  I don't think they really knew what happened.  People react differently.  I even had bad reactions to the chemo drugs.  My feet were numb for over a year and my toenails fell off.  I looked like a duck when I walked!  I explain it away as a quirk in my makeup.  I am allergic to strange things, do not react to many others.  Morphine, Demerol and other painkillers have no effect on me whatsoever.  When I go the the dentist, I have to get 3 times the usual amount to freeze my mouth.  Yet, other times, I only need 1/4 of a drug.  I don't think the radiologist could predict my reaction.  I was given the usual amount for my situaution.  Fortunately, my oncologist did not argue the fact, he immediately acknowledged too much radiaition.  I think I would have thought I was going crazy if he had said it had nothing to do with it. I hope you are better.  It may just be what I am experiencing.  When I first had my prognosis of over-exposure to radiation, my oncologist said the only other two patients he had with the same problem were at ten years.  It took me awhile to comprehend his meaning.  They are alive and well!!!  All the best! Kathy",
      "MessageIndex": 9,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20851,0.htm",
      "Title": "question about radiation side effects 11 mo. later"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": "Hi!  Diagnosed Nov 2004, surgery Dec 2004, chemo 7 months, then daily radiation for total of 42.  Lumpectomy , 11 lymph nodes removed.  On Arimidex since.  Did not have bad side effects from radiation right away apart from the fatigue which I attributed to chemo.  5 months later, while my mother lay on her death bed, my breast became inflamed and swollen.  As my oncologists clinic was 1 floor below the unit my Mom was in, I snuck down and requested a quick look.  I was told I was having a reaction to the radiation and it would have to be monitored.  My Mom passed away and I was devastated.  She was my best friend. My Mom was my greatest comfort.  I still cry thinking about her. As time went by, about two weeks, my breast became as hard as cement and extremely painful.  Every step was like having a knife stuck into my chest.  In about another two weeks, the whole area from my breast to under my arm reaching towards my back had become rock solid and painful.  My oncologist said that unfortunately there was nothing to be done.  I had radiation overdose and no known therapy.  He said over time it would get better and I needed to be patient.  Every check up I am told the same, patience.  Around June 2007, I began noticing a slight softening of the tissue around the edge of of my back.  Since then, the softening has progressed to the breast and at this moment, I have about half the breast tissue still hard. My oncologist told me that in his whole career { about 30 years } he's only had 2 other patients like me.  He also told me they are both past the ten year mark indicating that they are still alive.   My life since diagnosis has been a real learning experience.  I envy those that go through it and are \" back at work \" 1 month after surgery and have  a normal life.  I was told some people work while having chemo and radiation.  Only side effects maybe slight fatigue, nothing going to bed an hour early doesn't fix. I slept for two and a half years.  My fatigue was such that all I could do was make it to the toilet before I wet myself.  Going for check ups was a huge ordeal.  Having a shower wiped me out so bad, I had to rest before I could get dressed and into the car.  Very slowly, my energy level increased.  It comes in cycles.  Never can count on how long the next one will take.  I feel bearable, then day by day, I feel worse until I feel like I can only lay down and die.  The day after, I feel a teeny bit better, and so on until I have a day when I feel almost half normal.  During this time, I make a mad rush to clean up the place, laundry, vacuum.  Then it starts getting bad again. My body aches, my bones hurt, have arthritic type pain, walking is painful from joint pain as well as breast pain.  It goes on and on.  I have a friend that harps on me that she knows people that have had breast cancer and they're fine after a couple of months.  Even my GP was short with me last week when I told her I was still not sleeping.  From the moment I had surgery, I have experienced terrible hot flashes every 30 minutes, give or take a few seconds.  As such, I wake up every 30 minutes and sometimes I cannot fall back asleep for an hour or two.  I have not missed one hot flash since Dec 2004.  Truth be told, my flashes started coming every 40 minutes last summer, letting me sleep that extra 10 minutes.  My doctor has tried Gabapentin, and numerous other treatments, none of which have had any effect.  Early on in my treatment, I was given Medroxy Progesterone ?  I slept like a baby for two weeks until I was abruptly taken off as I was told I was estrogen and progesterone positive and this medicine was extremely dangerous for me. My regular doctors last visit was an eye opener.  She basically suggested the reason I am tired is because maybe I need mental therapy!  Maybe I do, but to dismiss the fact that the medication I am on is causing this problem { and others } and nothing she's tried so far has worked is not my fault!  I suggested to her to look up Arimidex and it's side effects more than a year ago, and she still hasn't.  It seems she prefers to put it down to depression or the like.  My oncologist is far more understanding.  He told me that the Arimidex is the best medicine for me and if I was his mother or daughter this would be the only choice.  He acknowledged the side effects and suggests that in time I will feel better, patience.  He always makes me feel better, helps put things in perspective, helps me brush off stupid remarks by so called friends.  Even so, every once in a while, I get to feeling so bad, I really feel like I am on my last legs. I begin to question if I am crazy.  I've always been a positive, hardworking person, enjoying life.  At the moment, things that used to bring me pleasure are out of reach due to my condition.  Even my eyesight has let me down.  I used to love to read and paint, but my eyesight still hasn't recovered and when I try to paint anyway, I get sick to my stomach because my eyes keep going in and out of focus. I really feel alone at times.   ",
      "MessageIndex": 2,
      "PostDate": "15/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21257,0.htm",
      "Title": "radiation tissue damage"
    },
    {
      "AuthorID": "Kathy_d_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kathy_d_5",
      "Content": " Barb from Texas Hi!  I have not been back since March.  Just not too energetic.  I am amazed that someone else has experienced what I am going through.  I searched until I couldn't anymore, and just finally gave up.  I'm glad to be able to talk to you. My last check up was good.  My oncologist said everything is pristine.  I always worry.  He told me, again, the radiation overexposure is causing a lot of my problems.  Arimidex, the rest.  He says patience, in time, I will get better. I've always had a few allergies, but now, it seems I'm allergic to almost everything.  Meds either don't work at all, or work too much.  This has always been the case and probably the reason the radiation had this effect.  Can't really blame the doctors.  How were they to know?  I had a normal course of treatments.  Morphine sits in my drawer from surgery.  No effect whatsoever.  My surgery went well, although they had to give me so much to put me out that they couldn't wake me afterwards.   The doctor sat by my bed for 7 hours before resorting to some kind of drug to get me to wake up.. Then I went into convulsions and threw up for 20 minutes. After my first surgery, I became so infected, I had to go to the hospital every morning and evening for 3 weeks for intravenous antibiotics.  This did not work.  Had to go in for another operation to clean it out.  My sleep has been the biggest issue for me at the moment.  My body has fallen into a pattern of not getting sufficient sleep.  For the last few weeks, I have been surviving on about 1 to 2 hours sleep in a 24 hour period.  In the past, the doctor tried different antidepressants to help me sleep, didn't work.  Went off them after trying for the last couple of years.  Have tried Melatonin, maybe not taking enough, but found myself having terrible nightmares within the usual 10 to 25 minutes of sleep.  Didn't help me to sleep.  In fact, I took 2 sleeping pills 4 hours ago and am wide awake.  I am getting desperate!  Someone on this site said she felt like she was getting hit in the head with a 2 x 4 every time she has a hot flash.  Describes it well.  It's been 3 1/2 years since I have had a decent nights sleep.  I used to sleep like a baby.  I would fall asleep within 10 minutes and sleep 7 to 8 hours without waking up.  How I long for just a few nights of deep sleep. Calcium and vitamin D gave me a terrible rash all over my body, some spots are still evident, even after 5 months. I do take 1000 mg vitamin c, 400 viit E, selenium, zinc and one multi vitamin without problems.  I stopped all meds [except the Arimidex] and vitamins, then introduced them one by one.  I try to eat a huge salad with at least 9 different raw veg every day, don't eat any meat [not since 1976] still eat a lot of fish, particularly salmon.  Root veg, squash, turnip and eat as much fruit as I can.  Have a glass of blueberry, pomegranate juice every day, sometimes orange or carrot.  Diet is quite good, so I know this has not been an issue. Every day, no matter how I feel, I push myself.  As you say, this doesn't seem to work very well.  Usually ends with me unable to barely move for 2 or 3 days. I completely understand what you are going through.  Sometimes I think the doctors and so called well meaning friends should experience this, just so they could find better ways to cope for all of us, then I feel awful, as I don't wish this on anyone.  Still, it never really seems to register.   Apart from the terrible pain and fatigue, the frustration of not being able to do things is severe.  As you say, energy is unpredictable, sometimes there isn't any, sometimes just enough to do the bare minimum for a few hours.  The body just doesn't want to co-operate.  I don't know how much of it is the Arimidex. Getting too tired to write anymore.  I hope you are feeling and getting better!!!  Would love to hear from you. Kathy from Canada   ",
      "MessageIndex": 4,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21257,0.htm",
      "Title": "radiation tissue damage"
    }
  ]
}