{
  "AuthorID": "KathyKreicas",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
  "Posts": [
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "Hi - I would suggest an MRI with Contrast.  I went through a similar problem.  I had a mammorgram and was told I was okay.  The doctor called back and said they think I have a calcification.  Two months later, I receive a letter from the Doctor Group.I did not even open it right away because it was not certified and they usually send certitied.  The letter stated I needed a biopsy - another good idea for you.  I went to different doctors that suggested the MRI and biopsy.  The surgeon and lab techician at the new place did not think I had cancer.  They were wrong. All my life I worried about breast cancer.  Emotionally I did not handle it well with the news.  When I was 22 my mom was diagnosed with breast and bone cancer.  I was devastated.  They gave her 6 months to live and we took her to Germany and she lived for 21 years.  Please let me know how everything is.  I will pray for you that it is all okay. ",
      "MessageIndex": 2,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78825,0.htm",
      "Title": "breast mass seen as suspicious on ultrasound but normal on mammogram ever happen to anyone?"
    },
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "Hi, I am no expert, but, I do not personally believe in chemo. I had two lumpectomies and radiation. I regret the radiation. Mynpathologis misdiagnosed my mammogram. Also after the first lumpectomy I should have had a mastectomy. I actually decided on a double mastectomy when the cancer returned. . I think having second opinions on pathologists is important. Hindsight is always great. I understand in Israel that they use baking soda . Lemon and water to make the body alkaline. U can also buy alaline water. I am 66 years old. Whe I was 22 - my mom was diagnosis with breast and bone cancer aNnd given six months to live. We took her to a hospital in Bonn German. She lived for 21 years. She was put on mefication that was not approved by the FDA and Vitamin K. I personally believe that cancer has to do with the immune system. I have heard Dr Schwartz is years ahead of his time. He only works with tumors. He does work with the blood and Immune system. He is the head oncologist at a Columbia Presbyterian in NYC. There was a famous doctor who passed away. He mainly dealt with AIDS patients. He put my brother on Nalrxone Low dose - which is super to correct your immune system. And used orprevention of cancer. My brother did not have aids, it had an immune deficiency. . It s a compounded drug and hard to find a doctor to prescribe. Usually holistic doctors will prescribe. I heard there is a doctor in San Diego and works from Mexico. An acquaintance of mine was given no time to live. That was 6 years ago. He has a chemo pill with no side effects. He is expensive. That is what she said. I ended up with 12 surgeries from infections. 8 months of no showers or driving. Also had Vaccuum attached to breast. The doctors left a part of rib in radiated breast. I am only coming out of major depression. I have not finished - because I am going to post on hospital and doctors health grade site to help people not to go thru what I went thru.",
      "MessageIndex": 33,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "What a great response. U really gave such great ?? nformstion. I think this board is so helpful. I was just starting to do research for my broygher. He was diagnosed with CLL minus 17. Prognosis a s 30 months.",
      "MessageIndex": 44,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "What a great response. U really gave such great ?? nformstion. I think this board is so helpful. I was just starting to do research for my broygher. He was diagnosed with CLL minus 17. Prognosis a s 30 months.",
      "MessageIndex": 53,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "Hi - I am also looking for aternative care treatments.  There are so many advertisements. Today my brother sent me an article on Proto cell liquid.  I am going to research it.  It is made in Germany - I think.  I also do not know what to take.  He sends me three articles a day so I do not put much faith in them. This is my first morning looking at this board and I think its wonderful.  When I was 22 and am now 64 -my mom was diagnosed with bone and breast cancer.  My family was into natural.  Mom had a simple mastectomy which was 40 years ago.  I found an article at the time in Esquire that was titled DO I FIGHT OR GIVE UP.  There was a hospital in  Bonn Germany.  I sent her there with my dad.  They looked at her records and said they could help.  They put her on tamoxifen - which was illegal in the USA at that time. The FDA and I went through battle when it was opened by them. You think I was having Cocaine sent to me. I smuggled them through Canada after that.  They also gave her liquid vitamin - I am not sure it was K or A.  She never had chemo of radiation. The doctors in the USA gasped when it showed all cancer was not present.  21 years was a miracle. I have always been so scared to hear - You have  breast cancer. I had two surgeries in three weeks, because they did not get it all. So on the second surgery they had the patholgist there. Why did they not do this on the first surgery??  I did have radiation.  I am not a doctor lover with this disease.  I personally think it is a money maker for healthcare.  When I spoke to the radiation doctor - he said that I should have 32 treatments.  I said - WHAT!!  The next words were we can do 16 like they do in Canada.  So if I did not speak up - I would have left myself open for an additional 16 - not to mention cost.  My insurance is not great. If ever there is a time that they say CHEMO - I would have to think very hard and long on that one.  My hospital has a nutrionlist who recommends the Dr. Weil triangle diet.  It is on the net.  There is also a list of vitamins. A friend of the family went to a Germany clinic with the Vitamin C Chelation, Mistetole, toxic baths, oxygen.  It did not help.  He has prostate cancer and now it has spread.  There was someone from Australia and it did not help him either. The doctor that helped my mom - has died.  Somewhere I have the name of the hospital of the doctors who trained under him.  I am thinking of getting in touch with them. I am thinking that there might be something that is not here in the USA. If you want a list of vitamins - I could send them to you.  I am thinking of going on the baking soda cure.  They say if you mix baking soda and water - it makes your body alkaline.  I understand studies are being done in Israel. In all of my reading - I think that is important.  Also with reading - I am finding that everyone says the immune system.  My brother is on a hand made drug for the immune system.  I am thinking of trying that.  His doctor told him he would never get cancer - so in my brain - I am thinking that this might be something to try.  This pill is used for MS, AIDS and autominune.  I would have to find a doctor that would prescribe it.  I went through a terrible time emotionally.  My husband is not supportive and dropped me at the hospital and never picked me up.  Most of friends dropped me - because - they make you feel like you are contagious.  I do not know if this post with help or not.   ",
      "MessageIndex": 27,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    },
    {
      "AuthorID": "KathyKreicas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KathyKreicas",
      "Content": "Hi,  I am not called cancer free.  I do not think you are ever cancer free.  No they did not suggest chemo.  At first they said no treatment, but when I went back for a 2nd surgery that is when radiation was brought to my attention.  I cannot take Tamoxfin, because I had stents put in my legs.  I was a smoker.  I swore I give cigarettes up if my mammography was okay.  I was told I was okay and gave up smoking.  Two months later I was going for a biopsy.  I will be 2 years off cigarettes this November.  I am not sure about chemo.  Right now I would really try to stay away - but if a doctor - says it is now necessary - I am at a loss to what I would do.  I keep praying that will not happen.  Our pastor did a whole service on cancer.  A member of the church has Stage 4 cancer.  He makes copies of his sermons if you are interested.  I am so into thinking that the medical field uses all this stuff for money.  I could be wrong.  I am now doing some research on a drug that my brother takes for an autominue disease.  It is a pill made up by a pharmacy.  It is not just a script.  I remember the doctor saying that this medication - you will not get cancer.  I will let you know how I make out.  This drug is being used now for MS and is having much success.  Hope this helps.  Take care, Kathy",
      "MessageIndex": 30,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,78351,0.htm",
      "Title": "Calling all alternative cancer treatments experiences..."
    }
  ]
}