{
  "AuthorID": "Katrina73",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Katrina73",
  "Posts": [{
    "AuthorID": "Katrina73",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Katrina73",
    "Content": "  On 2/26/2007 Help me Help Mom wrote: My mom just started chemo treatments for breast cancer. When the docters told her she would lose her hair...she cried. And now...two weeks after first treatment, she has started to lose her hair and is tearyeyed off and on. I want to make her feel better. I offered to shave my head, but she said not to. I don't know what I can do or say to make her feel better. When she crys I cry. Does any one have any ideas for me.                                        Kim   Hi Look up q10 my mum has stage IV breast cancer that has moved to the ribs.  She is on q10 from pharmanord that has given her heaps of energy. Look up q10 on pub med basic info Co-Enzyme Q10: Studies have shown supplementation of Q10 can be of assistance in protecting the heart from toxicity of chemotherapy. One study has reported substantial improvement in cancer response. This study was exceptionally small, did not control for lifestyle factors, disease status or provide a control group of similar patients to compare effectiveness. The have been other studies that looked at other claimed benefits of q10 and found supplementation did not improve cellular oxygenation or VO2 max in subjects despite significant increases in blood levels of q10 after weeks of supplementation at between 200 and 300mg daily. The single study that claimed benefit for cancer patients did deliver improvements in patient condition but subsequent analysis showed this to be not radically different from population statistics and certainly not attributable to q10 at a statistically significant level. The benefits of q10 appear most supported in relation to cardio-vascular health. The study that claimed results in cancer patients delivered 390mg daily with anti-oxidants.  ",
    "MessageIndex": 4,
    "PostDate": "06/03/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9912,0.htm",
    "Title": "supporting my mom"
  }]
}