{
  "AuthorID": "KayleighGrace",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
  "Posts": [
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi red51: I am currently trying to see what my insurance will pay for DIEP in NOLA.  Have they done all of the preauth work?  I will have Dr. Robert Allen.  He has a 99% success rate and invented the DIEP.  I hope to have great results but not sure what the out of pocket expense will be other than my travel expenses.  I am from North Dakota.  I will be curious who else will respond to your query and hope it will help both of us.  Sisters in reconstruction, HAHA!!  Take care! Deb",
      "MessageIndex": 1,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36619,0.htm",
      "Title": "Diep surgery, NOLA has anyone had the surgery and what was your out of pocket fees?"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Dear Beksy: Were you able to get a referrel from your doctor?  That might help with the PPO.  I still haven't heard what my out of pocket will be. Are you going? Deb",
      "MessageIndex": 5,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36619,0.htm",
      "Title": "Diep surgery, NOLA has anyone had the surgery and what was your out of pocket fees?"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "  On 10/26/2008 lilchris wrote: the treatment kept me busy but now i am back to that darn 20% how to keep sane untill pet scan  this is the hard part 4 me as i am starting to fret now that i am finished w/ all they had to offer me at this juncture   chemo took out 3 of four in my liver the drs removed both breast  i pray that pet scan holds good things  wish me luck any one in my situation i would love to hear advice love you all sisters I just opened your message and want you to know that I am praying for you.  I am also HER2 + 3/3.  Fortunatly I am stage two and just finished with my chemo.  I also had a masectomy on the left side and am awaiting radiation.  What is so amazing about this disease is the community that you become a part of.  I feel that we are sisters of that community.  I am not sure what your faith is but remember there is tremendous power in pray and know matter what He is with you.  When you are feeling anxious stop, deep breath and feel the peace that He will give you as you feel He is there.  Picture a light all around you.  He is that light.  It helps!  Please keep us posted!!",
      "MessageIndex": 2,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29668,0.htm",
      "Title": "stage4 her2 chemo surgerey radiation await new pet scan"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Bonnie and Jo: I just read the posts between the two of you and first I want to say yes Jo, we are a sisterhood!  I think you did a very nice job describing side effects and how not everyone gets them.  I too started out with the fear of A/C treatment due to some problems that I had had in the past with heart vavles and regurgitation.  My cardiologist did tell me that there could be change in my heart function with A/C but in almost all of the cases it did return to normal.  I have regular MUGA scans of which I 'm sure you both have heard of those by now.  Anyway, 4 Treatments of A/C and yes they were tough on me but again I'm with Jo because you can do the count down.  Each of these treatments were a little different in side effects for me.  First one was nausea which my oncologist took care of the next time.  He would give me the treatment and then overnight in the hospital to fush me with fluids and control nausea.  The second one was better but by that time I noticed that I was weak and didn't really spend much time out of bed until about 5 days later.  I did notice that climbing a short set of stairs I was very short of breath and I did worry about my heart.  The third treatment was the worst for me as it affected my emotions. My family told me that I also showed this sence of urgency to get things done before my next treatment because I was down in bed for a few days.  The trouble with that was I would give them the list of things that needed to be done and expect them to complete them with that same sence of urgency!  I didn't actually feel that way about this but they said I protrayed that to them.  Because the chemo affects your red and white blood cells I had cravings.  I craved steak.  Couple that with induced depression and anxiety LOOK OUT family!  Now we can laugh about it but what I'm trying to say is you so get over it.  The last treatment was a piece of cake compared to any of the others.  I wrote myself a note after the third to encourage myself to get through the last one!  I too lost my hair after the second treatment which taught me so much about myself.  I never thought it would bother me more than my masectomy but it did.   I felt it was a change in my identity.  Strange huh?  Funny thing is yesterday I was in a hurry to go to work and for the first time I thought, I need to dry my hair!  HA Ha my family and I laughed because one, it is very thick and two only about 1/2 inch long and in celebrating that I needed to dry it.  Getting my eyebrows and eye lashes back was another mile stone.  Please go to \"Look Good Feel Great\" as they help you disguse this very well.  Life is amazing!!  After the 4 treatments of A/C I had 3 months of weekly Taxol and Herceptin (for HER2 + BC).  The next MUGA scan showed some decrease in fuction but not bad enough to discontinue.  After the end of Taxal another MUGA showed more drop in my ejection fraction.  The doctor had to decide if I could continue with the Herceptin or not because it could cause cardiac problems and needed to be on it for one year.  We continued and I started my daily radiation treatments for two months.  I finished those as of Dec. 31rst!!!  The latest MUGA scan showed IMPROVED EJ!!  The cardiologist was right!! Jo you are right about fighting the cancer however we can!  If we don't fight that first it won't matter if we have heart issues.  One more thing about chemo.....chemo brain.   Yes it is true!  You have word salad, memory problems (I hope it's not because I'm 53)  Ha and reaction time were things that I have delt with.  That is past tense becasue it is all getting much better.  The chemo nurses told me it could stay for a year but I have already had tremendous relief.  I also play ds lite and other games, everyday that help improve my brain fucntion.   My strength is returning although I have to concentrate on slowing down and pacing myself because that was my problem precancer. This journey has taught me do much about me, my Faith, family and friends. I am so Blessed and you are too because each day is a Blessing from God!  Take care  - both of you.  You both seem like such lovely women.  We need to stick together because nothing joins us like breast cancer. Deb",
      "MessageIndex": 6,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32937,0.htm",
      "Title": "Change in my Chemo Recommended"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi again Bonnie: We all need to ramble and besides it didn't feel that to me.  Wow - sounds like your family has a load on their shoulders!  I will pray for them.  I am so glad your husband is so supportive.  I know this might sound crazy but find some humor.  It seems like the worse situations get the easier it is to find humor if you look for it.  For instance, when I was first diagnosised and knew I had to have the masectomy I said \" Well you guys know that I have always wanted a breast reduction, I'm just taking the long way around\".  I had another joke about working for Hooter's but I would have to be a Hooter and I would get half the tips. HAHA!!  We all laugh at this and laughter seems to help.  It might sound sad, at first, that I would joke like this but it gets to be a great way to cope.  That and knowing that God has us on a journey where we will learn alot of differnt things and meet alot of amazing people.  We wouldn't be corresponding if it weren't for BC.  Imagine what we can learn from each other and others. About Muga Scans.  They didn't even try to use my port anytime that I've had a scan.  They just take blood from my arm, mix it with radio active who knows what, and put it back the same way.  There are no other painful things involved.  You just lay there and rest while they take the pics.  Find out what your scores are so you can keep track.  I think it helps to have as much info as you can. The other thing about A/C treatment is the chemo nurses told me people who get the worst side effects were people who had trouble with morning sickness during pregnacy.  Everyone that I have talked to so far, that didn't have morning sickness, had no trouble with A/C.  Also It seems to be easier with Taxal for people like me who had trouble with A/C.  Anyway enough about me. Remember God is with you on this journey.  We never know what place we need to grow until God shows us but rest assured -  He does and it is for our good.  Trust in that.  Take care! Deb",
      "MessageIndex": 8,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32937,0.htm",
      "Title": "Change in my Chemo Recommended"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "I loved it....thanks for sharing!!",
      "MessageIndex": 2,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42822,0.htm",
      "Title": "Survivors Bust a Move!!!"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Aquaphor has been amazing!  I had two months of radiation and have ver little skin damange.  Now I am undergoing the tissue expansion and I still use Aquaphor right after a fill and in between. ",
      "MessageIndex": 5,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44564,0.htm",
      "Title": "Message: Radiation burns"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Last March 2008 I was facing the same thing.  I was also scared.  It is very important not too use too much negative energy projecting past today.  You can get extremly anxious, loose a lot of sleep, and exhaust yourself.  I have talked to many people who have had a negative biopsy.  Unfortunatly I was not one of them.  My cancer was caught early and on December 30, 2008 I will recieve my last radiation treatment after five months of chemo and surgery.  I will still take Herceptin until July 2009.  This has been a journey for me and my family.  I have learned so much about breast cancer and met tons of wonderful people.  I truly believe God has been with me from the begining and is leading me toward a better life.  Instead of letting those thoughts suck out your energy concentrate on today and how wonderful and lucky we are.  See things as brighter, warmer, kinder and amazing.  Times like this are meant for us to learn and grow.  No matter what your diagnosis is this time in your life God will grant you wisdom that you didn't have before.  I will keep you in my prayers Heather.  Please let us know how you are doing, ok? Deb",
      "MessageIndex": 2,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31376,0.htm",
      "Title": "seeing a breast surgeon for a needle biopsy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": " Good job Dana!!  You are right with early detection being the key.  Tell her to get a second opinion.  They would at least tell her if they think it is a cyst or something else.  Stick with her.  I am so sorry that you have had to experience so much cancer in your family but because of your history you can help others.  Good luck to you and your friend.  Let us know how it turns out.",
      "MessageIndex": 1,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31954,0.htm",
      "Title": "not new to cancer,...only this board"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "THANK YOU GOD!!!!!!!  I really appreciate you letting me know about the biopsy.  I ended up having another biopsy on Friday and yesterday they told me it was also negative.  Again, thank you God!  I am so thankful that you were negative.  It does seem to give us a new proseptive on life, right?  Take care and good luck to you in the future!!",
      "MessageIndex": 6,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31376,0.htm",
      "Title": "seeing a breast surgeon for a needle biopsy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Kim: I noticed you hadn't had any replies so I thought I would ask if you have had contact with a lyphodema clinic?  I am HER2 +  x3 with one node affected but they only took out six.  I did this clinic and have the sleeve and glove.  They also showed my many excersises to help.  They have a class to express manually that may be helpful.  I am still taking radiation after five months of chemo so still within the first year of dx.  Good luck to you! Kayleigh Grace",
      "MessageIndex": 1,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30542,0.htm",
      "Title": "Lymph nodes, chemo"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "  I just looked at your message and thought I would tell you how I live my new life.  I was dx in March 08, had a left masectomy April 08, started chemo May 08 and finished chemo early Oct.  Now I am having radiation until Dec.30, 08.  The cancer that I have is HER2 + 3/3 with one node positive.  This really through me and all of my family for a loop due to the agressve nature.  There is no breast cancer on either side of my family.  My treatments have been worst to best starting with a left mastectomy.  I had the A/C treatment from hell.  Next was Taxal and Herceptin weekly until early Oct.  Now I am still taking Herceptin (until July 21, 09) and radiation daily until Dec. 30th. Ok now how I looked at all of this.  First , cancer has been a blessing (scary as it is) in my life.  I was working a job where several evenings ( besides my eight hour days) and stress were indicative of my daily grind.  I had to stop and take a look at what God has planned for me.  I really struggled letting go of my job, while on medical leave, to stay open to what His plan was.  It wasn't until Oct. that I started to see somewhat of a path.  There was no breast cancer support group in the town where I live so I am starting one on Jan. 8th, 09.  It has opened a different world to me but one that I can identify with.  I have other plans that will be different in my life but I feel God has shown me this way.  I know that there other ways that I am supposed to be living my life and He will show me when the time is right.  God has a wonderful plan for us but we sometimes need to be patient and look for it to open in our lives.  I have been blessed with a husband of 32 years that is very supportive.  My three grown children and two wonderful grandchildren have been so supportive and comforting.  I have realized that there are a lot of people who are there for me and it helps me on this journey.  I am not sure what your faith is but God has given me peace and a plan that helps me get on with my life.  I wish you this peace and look for the gifts that cancer has brought you.  They are there I promise.  ",
      "MessageIndex": 1,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30593,0.htm",
      "Title": "I am so (&*! angry and sad!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Paddy: I agree with Tre.  This is about you too.  It is important to remember that you do need to talk to someone.  Whether you find that here or some where (or both) because you are important too.  I am so glad that you have Faith.  It is so hard to understand the whys and the hows.  God has given us all gifts to share with people.  It sounds like everything that you mentioned that you want the grands to remember are her gifts and they will remember....through you.  She sounds amazing.  Can you tell us a little more about where she is in her journey?  Please know that all of God's plans are for our good even though we have pain and fear.  I will keep you,  your sister, and your families in my prayers. Deb",
      "MessageIndex": 2,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34316,0.htm",
      "Title": "at the end of day"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "  On 1/30/2009 Bonniee wrote: I have had my second chemo treatment, Cytoxin and Taxotere last Friday. Four more planned. I have had one issue after another, have been hospitalized, etc. and now I have more and more anemia with every blood test. I am taking Neuprgen injections for my low white blood cell count. I have always been more afraid of the chemo then the cancer, wondering how anyone ever makes it through. Since my doctors only tell me \"everybodies different, we never know what to expect\" there is little reassurance there. Has anyone out there needed blood transfusions with this type of chemo treament? I am considering stopping the chemo and just going on with double mastectomies and radiation. Thanks and Bless you All Bonnie believe we all get anemia during chemo.  I also (as many others) had those same shots.  Just listen to what your doctors say and the chemo nurses are great also.  Eat what you crave like steak or watermelon.  Those were mine.  When I went to the next kind of chemo it wasn't so hard on my system and although my levels were down they still were better than of the cytoxin/adremiacin.  I am not sure what type of cancer you have but mine is HER2 3/3 so mine had to be treated very aggressivly.  First, I had a masectomy then 5 months of chemo and two months of radiation ending 12/31/08.  I only have herceptin every three weeks now until July 2009.  My white and red counts came up wonderfully after chemo and now they are perfect.  Hang in there.  It is better to face the medicine that kills the cancer than what the alternative would be.  You can do it.  Take care! Deb Hi Bonnie: I",
      "MessageIndex": 1,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32686,0.htm",
      "Title": "Anemia on Chemo"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Good morning Ray: I just finished 2 months of daily radiation on Dec. 31, 2008.  It is pretty amazing how it is done now.  They acutally do a CT scan then prescribe your radiation according to your deminsions so not to affect any other organs.  My was on the left side so they worked around my heart and lung.  It was the easiest of all of my treatments.  There was a masectomy, 5 months of chemo, then radiation.  At the end of the treatments they did a booster  - 6x - that was only in the area of my 1 affected node.  This was the only placed where I burned - like a sunburn  - then peeled.  I have medium complextion.  It would depend of her skin.  I remember being so nervous and my radiology oncologist told me to relax it will be the easiest treatment so far and it was.  The future is in God's hands.  None of us are sure how long the treatments will keep us cancer free.  Some people are very long time survivors.  I have HER2+ which means the cells grown faster.  I currently take herceptin for this every three weeks until July 21 2009.  This will be a year of this treatment.  Then what...I don't know. So I guess I can't answer the \"future\" question except to say you can change today just by the way you look at it.  Hopefully your friend is slowing the fast pace of life down and trying to live as stress free as possible.  Life is amazing! Deb",
      "MessageIndex": 1,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34149,0.htm",
      "Title": "Breast cancer 6 weeks of radiation therapy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi again Bonnie: It looks like the first of my message was cut off. I was just saying that you can do this! Deb",
      "MessageIndex": 2,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32686,0.htm",
      "Title": "Anemia on Chemo"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "I remember walking up those steps with a pounding heart and very short of breath.  It makes you wonder if there is permanant damage.  It does go away.  How many more treatments do you have?  Sometimes it helps to have the count down.  You can get through this even if you have to tell yourself with every step.  You will get stronger and ready to take a walk or go for the treadmill.  Y heart is there with you!!  God BLess. Deb",
      "MessageIndex": 4,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32686,0.htm",
      "Title": "Anemia on Chemo"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "JCR,  Thank you for the Cooking away Cancer information.  I hope they hurry and get it passed by FDA.  There are so many people who need it right now!  Thanks again! Deb",
      "MessageIndex": 4,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34149,0.htm",
      "Title": "Breast cancer 6 weeks of radiation therapy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi All: I am trying to decide where to do my DIEP and wondering where you have done your.  There is a doctor in Denver or close by who seems to have a pretty good success rate.  Anyone else know of some one in Colorado that has a high success rate?",
      "MessageIndex": 2,
      "PostDate": "17/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40306,0.htm",
      "Title": "DIEP flap Second surgery phase two"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Andi: I just finished my Taxol in early October 2008.  I also had the A/C which I call the chemo from hell!!!  The Taxol was a piece of cake compared to the A/C.  The best thing is to find out as much as you can about Taxol.  I didn't get any side effects until the middle of my (weekly) twelve treatments.  I did get the achey body after the third day but I took aleeve and felt better.  After that point I did have something achiness on a regular basis after the third day but it only lasted a few days.  I didn't get the neuropathy until after I was done and it was very light.  My hands will fall asleep or my toes will tingle.  They say it will last for a little while but should go away.  I hope things go well for you and please let us know how your are doing!  Take care! Deb",
      "MessageIndex": 4,
      "PostDate": "21/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31360,0.htm",
      "Title": "Fear of Taxol"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Jan: I finished all of my treatments last July 09.  I had A/C, taxal and herceptin.  Then I had two months of radiation.  Now I am taking tomoxafin twice a day.  Remember that during all of these treatments you biggest job is to rest and heal.  Do you have help with your daughter?  Does she have someone to talk to?  How about you?  It is important to stay connected with forums like this because you will see what normal is.  How about your Faith?  God is so important during this journey.  He will show you things along the way that you are supposed to learn...about yourself.  He will carry you through all of it.  Do you like Joyce Meyer?  She is on tv 1/2 hour a day.  She is funny and encouraging.  She also had breast cancer.  Keep your sense of humor.  If you look you can make of of anything that will make you laugh.  Please know that in a year you will feel better.  Take each treatment and say one more done.  Sometimes it helps to keep a journal.  Good luck my sister.  You can do this and remember God is with you. Deb",
      "MessageIndex": 1,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44489,0.htm",
      "Title": "INFILTRATING DOCTAL CARCINOMA"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "I had a masectomy April 8, 2008.  I remember I was sort of ok until the day before.  I found myself getting more and more irritable.  Finally that night I was depressed and cried.  The next morning I felt like - Let's do this!  Remember you are getting that ugly cancer out of your body.  You are taking action against something that makes us feel powerless.  You are on a journey that will teach you many things and add to to your wisdom.  I felt like I could always get new \"girls or a girl\" but my life was most important.  You will have the down time but remember to try to stay positive.  As you heal keep your eyes open for the wonders that happen.  It is amazing to watch God's hand in your healing. Deb",
      "MessageIndex": 2,
      "PostDate": "31/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32699,0.htm",
      "Title": "Masectomy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Dear Sylvia: My heart goes out to you and your family.  I think one of the toughest things for me when I found out about my breast cancer was seeing the pain in my family's eyes.  I'm with Gentle.  If you know (or your sister knows) that there is a plan to take care of her family, including you, she will have more peace.  When her journey ends she will be with God and she will be in his arms. There is not a more painfree, warmer and safer place to be.   Your sister may need you to just sit and hold her hand.  She can feel your love with the warmth of your hand and presence.  She may need you to tell her it is okay to go. I can't imagine how painful this is for you.  I feel like I can identify with your sister in some ways because I have wondered what would or will happen to my family should it come to this for us.  My heart breaks for you more than you know.  I will keep you and your family in my prayers. Deb",
      "MessageIndex": 2,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33273,0.htm",
      "Title": "Spreading too fast"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Sabine: Yes I first had a mastectomy, then chemo, then radiation.  My chemo was 4 cycles of ardimyacin/cytoxin then 12 cycles of taxal while also having herceptin weekly.  When the taxal was finsihed I went to herceptin every three weeks to finish off the herceptin year long treatment.  After chemo I had radiation every day for two months.  I thank God for every treatment, even though some were tough, but I am alive.  The radiation that they do now is pretty amazing.  They do a cat scan then put that on the computer.  Next they get the precise measurements to the post tumor bed or beds.  Mine was on the left side so it would radiate the affected areas but skip over my heart and lung.  Then I had 6 booster treatments to the area where the lymph node was positive under my arm.  Now I am on tamoxafin for five years with one year down.  I was at a breast cancer support group this month where someone brought up research on continued hormone treatment after the five year period.  I am all for it.  I want to stay cancer free and alive to enjoy the grandchildren I have now and the ones to come. I hope this helps!  Kayleigh",
      "MessageIndex": 21,
      "PostDate": "30/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi: I have been on Tomoxafin for a year now.  The only side effect that I have had is hot flashes and I say.....God bless every hot flash because I kow it is working.  What does your doctor recomend?",
      "MessageIndex": 1,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "KayleighGrace",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KayleighGrace",
      "Content": "Hi Sabine: Yes I first had a mastectomy, then chemo, then radiation.  My chemo was 4 cycles of ardimyacin/cytoxin then 12 cycles of taxal while also having herceptin weekly.  When the taxal was finsihed I went to herceptin every three weeks to finish off the herceptin year long treatment.  After chemo I had radiation every day for two months.  I thank God for every treatment, even though some were tough, but I am alive.  The radiation that they do now is pretty amazing.  They do a cat scan then put that on the computer.  Next they get the precise measurements to the post tumor bed or beds.  Mine was on the left side so it would radiate the affected areas but skip over my heart and lung.  Then I had 6 booster treatments to the area where the lymph node was positive under my arm.  Now I am on tamoxafin for five years with one year down.  I was at a breast cancer support group this month where someone brought up research on continued hormone treatment after the five year period.  I am all for it.  I want to stay cancer free and alive to enjoy the grandchildren I have now and the ones to come. I hope this helps!  Kayleigh",
      "MessageIndex": 13,
      "PostDate": "30/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    }
  ]
}