{
  "AuthorID": "Kegl72",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kegl72",
  "Posts": [
    {
      "AuthorID": "Kegl72",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kegl72",
      "Content": "Kristi - I read your email and couldn't believe my eyes. My mother also has cancer and my husband and I are expecting our first child in July as well. Such a rollercoaster we are all experiencing. My mom was diagnosed with lung cancer with mets to the brain in mid March. She lost her vision...but during whole brain radiation it started to come back. She came home for a month and was vastly improved physically as well. We made it through chemo round 1 with no problems. Then she developed blood clots. During her hospital stay she was given percocet, morphine and fentanal - simultaneously. Needless to say she was looped. We brought her home and her metal state rapidly declined. She stopped sleeping and was hallucinating severely - seeing people, things, having conversations with no one etc. Her CAT scan showed shrinkage to brain mets and they thought originally it was drug induced. Tomorrow she has the spinal tap to find out of it is Carcinomatous meningitis. My question to you all - did your relatives experience such dilusions? She hasn't a fever, etc. Thanks for your help all - and my heart goes out to you Kristi!",
      "MessageIndex": 7,
      "PostDate": "09/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "Kegl72",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kegl72",
      "Content": "Kristi - I am so, so sorry about your Mom. There are no words. Ironically the day your Mom passed was the same day my mother's cancer was discovered. I am due July 22...right after you. We are having a girl. Should be interesting. lol Thank you so much for responding, my thoughts and prayers go out to you. I wish you the very best, Kelly",
      "MessageIndex": 9,
      "PostDate": "10/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}