{
  "AuthorID": "Kelli62 (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [{
    "AuthorID": "Kelli62 (Inactive)",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
    "Content": "On Dec 31, 2011 2:37 AM ojan123 wrote: Hi All, I am another breast cancer survivor who has had trouble with hair growing back.  Diagnosed in 2006 and after 4 and a half months of TAC, and 5 weeks of radiation, and 2years of tamoxifen, then ovaries removed prophylactically and placed on aromasin for remaining 3 years.  Just finished in October 2011, but my hair is still sparse on top, and very grey.   So I definantly can relate to those of you out there with the same issue...my doctor thought once I had completed the aromasin I might see a change, but there is no difference.  Are any of you out there also hypothyroid, because I think that also might have a contributing factor. I think wigs will be my best friends now, because nothing else seems to be working.  If anyone finds an answer out there let us know.  Take care All. Hmmh!  I wonder what was in the chemo meds in 2006?  I too was diagnosed with breast cancer in 2006. 6 rounds of TAC, 40 rounds of radiation and 17 rounds of Herceptin.  I opted out of Tamoxifen and Arimidex, in favour of a holistic approach using Indole 3 Carbinol and Sulphorafane.  That said, my hair did not come back either.  I had AMAZING hair - it was my crowning glory - before treatments.  Physicians also gave the male pattern baldnes BS. I had tried everything from Nioxen to laser treatments to no avail.  GOOD NEWS though ... I started using a hair growth product from Aveda and supplementing with biotin (capsules), silica (tablets) and liquid Biosil.  Miraculously my hair is growing and people who have not seen me for a couple of months have even commented.   This is more than 7 years later, so there is hope :)",
    "MessageIndex": 26,
    "PostDate": "19/03/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
    "Title": "2 years after chemo, my hair has not grown back"
  }]
}