{
  "AuthorID": "Kerjo530",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kerjo530",
  "Posts": [{
    "AuthorID": "Kerjo530",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kerjo530",
    "Content": "I have had enlarged lymph nodes in my left breast, under arm and collarbone for almost 2 yrs now. My latest mammogram and ultrasound show 3 lymph nodes in my left breast enlarged 2 that look \"reactive\" and one that looks suspicious. 5 years ago I had a small lump removed from my left breast and a titanium marker placed. At the time I was told the biopsy was benign but the breast Dr was concerned about the swollen lymph nodes he found under my arm and sent me to an oncologist thinking I had lymphoma. The oncologist also did an ultrasound but said he didn't feel it was lymphoma, he thought it was probably an autoimmune disease and suggested I have a PET scan done. No PET scan, my primary Dr said nothing in my previous testing warranted the scan and did t order it. Now I have these swollen, sometimes tender lymph nodes in my left collarbone, underarm and breast and just the other day I noticed one under my right arm now. I don't go back until 2/15 for the follow up mammogram and ultrasound and that is for the left breast where they found the swollen lymph nodes on my last test. I've asked my Dr why they don't just do a needle aspiration/biopsy already and make sure it's nothing to be concerned about but she looks at me like I'm nuts and tells me that I just need to follow up in February and there's nothing to be concerned about. I'm concerned! I have been not feeling well/right for a couple of years, I've been tested for everything under the sun and all my blood work comes back \"marginal\" my Dr tells me there's nothing in my bloodwork that's alarming and we will just keep an eye on things. I'm disgusted! I know my body and something's not right! Maybe it's not breast cancer but something is going on, lymph nodes don't just swell for no reason yet my primary care Dr seems to think it is nothing to be alarmed about. It's tender and uncomfortable and I'm worried! Has anyone else had a similar experience? Swollen lymph nodes? Any advice or shared experience would be greatly appreciated.",
    "MessageIndex": 0,
    "PostDate": "25/01/2017",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,94428,0.htm",
    "Title": "Enlarged lymph nodes in breast and under arm"
  }]
}