{
  "AuthorID": "Kimbersue",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
  "Posts": [
    {
      "AuthorID": "Kimbersue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
      "Content": "Huge thanks you all who have replied...she just means so much to me....she is one of those wonderful people who would do anything for anyone.  So...there is no way I could just give a little donation and move on...I really feel strongly about helping her all I can....I feel that anyone faced with the diagnosis of cancer should be able to put all their energy into healing, I dont want her to feel the finiancial strain, although she alreadt does.  But, I will do ALL I can to help!!  THANKS AGAIN   KIM",
      "MessageIndex": 3,
      "PostDate": "10/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20501,0.htm",
      "Title": "fund raiser for friend with breast cancer, and ideas?"
    },
    {
      "AuthorID": "Kimbersue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
      "Content": "Huge thanks you all who have replied...she just means so much to me....she is one of those wonderful people who would do anything for anyone.  So...there is no way I could just give a little donation and move on...I really feel strongly about helping her all I can....I feel that anyone faced with the diagnosis of cancer should be able to put all their energy into healing, I dont want her to feel the finiancial strain, although she alreadt does.  But, I will do ALL I can to help!!  THANKS AGAIN   KIM",
      "MessageIndex": 4,
      "PostDate": "10/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20501,0.htm",
      "Title": "fund raiser for friend with breast cancer, and ideas?"
    },
    {
      "AuthorID": "Kimbersue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
      "Content": "My very good friend from work was diagnosed with invasive ductal carcinoma 2 weeks ago.  She under went mastectomy with sentinal node biopsy with at that time was thought to be negative.  After further pathology the sentinal node, and one other..so 2 of the 5 they removed was + for metastasis.  She goes back in tomorrow for axillary disection, and placement of a port for chemo.  She is only 38, and has 3 wonderful kids at home...13, and 12 y/o twins.  Her husband has been out of work for a short time, but of course will be off now to help care for her.  We took up a collection at work, which helped some, but I really want to do more for her.  Any of you have any ideas?  I mean their income is nothing right now.  Please any ideas or suggestions are greatly appreciated.  My mother was diagnosed with stage IV colon cancer 1 year ago, but we are so lucky that she has unbelievable health insurance, and is very finiancially stable......I work in the healthcare field, and I know that the diagnosis , and treatment of cancer, can cause people to loose everything they have.  This is a very sad situation for soooo many people.  I know I am only one person, but I just want to do all I can for my very good friend.  She is the most wonderful person ever......why do bad things always happen to such good people....",
      "MessageIndex": 0,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20501,0.htm",
      "Title": "fund raiser for friend with breast cancer, and ideas?"
    },
    {
      "AuthorID": "Kimbersue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
      "Content": "Hi! First and foremost takea deepbreath and relax.   I am Kim, I am a registered mammographer in missouri.   Many many women have calcifications in theri breasts.  Yes, they can be an early ign of a cancer, but they also can be benign.  ifa radiologist has any doubt about the characteristics of the calcs that he sees, they will recommend biopsy.  80% of biopsies done are not cancer! Remember 1st and foremost....THAT IS WHY YOU HAD A MAMMOGRAM!!!!! SO WE CAN FIND THE CANCER EARLY!!!!  And when we find small calcifications without a large associated mass....if they are cancerous it is usually very early!!!  So sit back and relax....you can't change anything with worry.  Just know that you have done your part....It will be fine no matter what happens.  I know this from a professional and personal stand point, my mother was diagnosted with stage 4 colon ca in february.  So I am very close to everyone on here and their problems good luck!!",
      "MessageIndex": 2,
      "PostDate": "08/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14877,0.htm",
      "Title": "New To Board - Mammogram Birad 4"
    },
    {
      "AuthorID": "Kimbersue",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kimbersue",
      "Content": "Valerie, Hi! My name is Kim, and I am a registered mammographer.  The previous comment is correct...Mant women have cysts in their breasts....these cysts increase in /decrease in size with flucuations in hormone levels.  YOu need to wait about a week...try to leave it alone, all the poking will only increase the tenderness you feel.  If it is still there, I would suggest you call/see your doctor.  At your age, the first test that should be run is a breast ultrasound/verses a mammogram. Most young women have very dense breasts....and if it is only a cyst ultrasound will more than confirm that.  At that point, if the radiologist that reads theultrasound thinks you meed a mammogram, he can recommend that.  However, I bet that if you give it a week, it will be better...also watch your caffeine intake...soda, tea, coffee, chocolate...these all increase tenderness in the breasts. Good Luck   ",
      "MessageIndex": 2,
      "PostDate": "29/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11618,0.htm",
      "Title": "Lump Found In Right Breast...please help"
    }
  ]
}