{
  "AuthorID": "KrisRooke",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KrisRooke",
  "Posts": [{
    "AuthorID": "KrisRooke",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KrisRooke",
    "Content": "I'm on day two of recovery from the second surgery of the process for DIEP Flap Reconstruction on my left breast. Nipple Reconstruction and Contour Revision Liposuction. I'm so very grateful for many things, here is my top five. 1) I'm allergic to narcotics, so for my best health, I use mediation and breathing exercises. During the recovery I have learned ways to manage my pain that requires little to no medications that could be considered addictive or have long term bad effects. I also have Metamucil on my side....meaning after surgery and without the ability to go into surgery without medications for sedation, I will naturally get an allergic reaction, migraine, throwing up, etc., I pounded a healthy size portion of water and metamucil to push things through me as quickly as possible, and water, water, water, decreasing the length of allergic reactions. 2) I have done due diligence with my research of who I wanted to work on me. I found the best surgeon that could possibly be right for me. Dr. Ottway Louie at the University of Washington in Seattle, WA, is a plastic surgeon with DIEP Flap expertise. His profile: http://www.medical.washington.edu/bios/view.aspx?CentralId=1 3) I have been taking care if my scarring since the first time I was diagnosed over 10 years ago. The second time I was diagnosed again was three years ago. I was blessed with skin that heals well. But I have made it a priority to always keep cancer in its place, and not let it have free roam on my body. Managing scarring is a very good way to take back control of your body, and push cancer out of ones life. Healing skin is a sign that I'm healing in all aspects. 4) I'm motivated to be fit, I have been an exerciser for many of my 47 years, as well as a fitness instructor for a very well known aerobic dance program. Each step of the way of this long journey it has been said to me over and over, that I'm living proof that exercise for health will help one bounce back from illness better. Now, why would somone with such a healthy lifestyle get cancer not once but twice? That's not in my hands at all, and I feel food knowing this. But what if I was not ever exercising and got cancer two times in 10 years, that would be very sad. 5) I have two boobs now.....yes, I have cleavage too. The second surgery, done two days ago, revised my body and liposuction was performed along the sides of my body where despite the flap leaving skin, my own body had settled into that muffin top area. Having it removed is allowing me to feel GOOD about myself again as a fitness instructor who has always naturally carried more weight in her midsection. The final stage of this process is the tattoo, I'm wondering if I can choose the shape...I think I'd like a heart shape? Maybe the yin/yang circle, or perhaps a peace sign..... This is a long process but so very well worth it! I'm an advocate of this process for the person who it is right for, and would never try to talk anyone into doing this, but I have a wealth of knowledge about the topic of breast cancer that I'm will to help others with, please ask! Sincerely, Kris",
    "MessageIndex": 6,
    "PostDate": "20/08/2012",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40306,0.htm",
    "Title": "DIEP flap Second surgery phase two"
  }]
}