{
  "AuthorID": "Kris1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
  "Posts": [
    {
      "AuthorID": "Kris1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
      "Content": "On Dec 01, 2012 4:46 AM LizaMarie711 wrote: We are getting the same exact thing, perhaps we can go through this together because were also getting it around the same time. My first dose will be Monday, you said * am was that today? If it was i hope it wasn't as bad as i keep hearing....Sending good thoughts and prayers your way that you do well with this. My name Is Liza i live in NY i feel i have a great group of doctors but in my whole life i have never ever been more petrified, I know come Monday i will be a basket case. If you are up to it and have already had your first treatement can you please tell me how it was? I dont know anyone going through this so it's hard to relate , as much as people care they dont understand like someone who is going through it themselves. Hope all went well, and please if you can let me know. Thanks so much  LizaI just had my first treatment on 11/29/12. My biggest fear to begin with was accessing the port. I HATE needles plus it's still sore from when the placed it on 11/16/12. The nurses were SO nice and made md feel more at ease. She sprayed Ethyl Chloride on the skin over my port and I didn't even feel it. YAY!! I sat in a big room with recliners placed in a circle going around the wall. The nurses told me every step they were making which made me feel better too. I've taken a couple of Zofran for nausea but mainly bc I thought I needed to go ahead and do that to prevent not really because I had a significant amount of nausea. I went back for the Neulasta shot yesterday (Friday) and it wasn't bad. I have been taking the Clarifin 24 hour for several days now and will continue to do so for about a week I guess. I have had no significant side effects from the chemo/shot yet. But I'm waiting on it to set in probably this weekend. We'll see. Take care!!",
      "MessageIndex": 13,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Kris1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
      "Content": "On Dec 07, 2012 6:15 PM drgnfly64 wrote: Hi, I am brand new to this website and just came across it in trying to educate myself on my recently diagnosed breast cancer.  Went to get a mammogram after finding a lump.  After a mammogram, an ultrasound, and biopsies of two suspicious \"sites\" on the same day, 2 days later I was diagnosed with breast cancer on 10/26/12.  Could not get in to see my surgeon (had colo-rectal cancer in 2005), until 11/14/2012.  Had a partial mastectomy on 11/30/2012 and just got the path report back on 12/04/2012 which staged the cancer at a Stage II with no lymph node involvement (removed and tested 5).  I spoke with my surgeon today and he has told me who my oncologist will be, said radiation for sure but not sure on chemo yet.  I have to say, I have had to support everyone in my life with their emotional health and now that the treatments will start soon, I feel myself starting to break down with fear of what this might all entail.  I am scared of chemo and radiation as well but am willing to do what it takes.  Do all stage 2 patients have to have chemo or is there some that don't?  The Her2 results and ER results are not back yet so I don't know if I am positive or negative on those receptors.  Any advice or responses are very helpful to me at this time, and any additional reading anyone can recommend would be very helpful to me as well. Thank you and God Bless! Theresa I'm not sure that all Stage 2 has to have chemo.  Of all the things I've never even asked what stage I am but from my research I think a Stage 1.  A 1.5 cm cancer, grade 3..but it's triple negative which is not great because it doesn't respond to any receptors so Tamoxifen, Herceptin, etc won't be available to me.  I do know that if you had a lumpectomy it's pretty mandatory that you will have radiation.  I absolutely hated the thought of chemo and it scared me!!  But I want this cancer gone and gone for good so I'd rather be proactive than regret it later.  I've only had 1 treatment so far and I've made it through the nausea and pain from the Neulasta shot and I'm now actually waiting on the loss of my hair.  :(  But it's something that I have to go through to get to the end of this so I'm just having to deal.  ",
      "MessageIndex": 26,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Kris1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
      "Content": "On Jan 11, 2013 4:08 PM stillgoingstron wrote: On Nov 28, 2012 8:11 PM LizaMarie711 wrote: Hi, Im looking for advice, from anyone who can help. I had a double masectomy with reconstruction on Spet 19th. I still have to get chemo. 4 rounds over 12 weeks of cytoxyn and tamofere. I am more petrified of the chemo than i was of the surgery. I dont want to loose my hair but i know thats not AN OPTION. I have no idea what to excpect, other than what the doctors are telling me, Im a wreck. Please any info will help. I am getting my first round of chemo this Monday wich is also my 45th bday ughhh..l  thanks   The chemo is a must, so take it!  I took 3 types for 6 months as I was stage 3 breast cancer in 2005 - the only side effect I had other the hair loss was exhaustion.  I literally slept most of the time. However, I have friends that worked the whole time.  I hope you will be like them.  It's worth it though, as I'm here 8 yrs later. I have just been diagnosed with a recurrance in my bone mrrow and am taking Afinitor which has wonderful reviews and hopefully will keep me kicking around for many more years! Good luck to you - I believe you will do fine!     I was diagnosed in September with triple negative breast cancer and also had double mastectomies with reconstruction.  I actually just had my 3rd round of chemo, Cytoxan and Taxotere yesterday and I just got back to work after having my Neulasta injection.  I thought that the side effect of losing my hair would be horrible but actually it was much less painful than I thought.  I get tired from it all but as I had read many posts before I started this journey..it do-able.  You just do what you have to do to survive.  I still have 5 more treatments to go and I shouldn't have to have any radiation or at least not on the agenda yet.  Hope everyone is doing well.  :)",
      "MessageIndex": 60,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Kris1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
      "Content": "On Nov 28, 2012 10:22 PM JoyceJJL wrote: Hi   what stage cancer did you have?   I had 3b, and they gave me the 2 you;re getting plus one more, I think it was taxatere.  But it was a heavy dose.  I agree I was more scared of the chemo than the double mastectomy.  But what she mentioned about the xanax is a good ideA.   I take an anxiety drug also, its klonopin, which helped me also.  I dont know if they told you that you would get sick or not??  I only know I did loose all my hair, it did come back baby fine, and got sick, but they gave me compazine.  Ah sometimes it helps sometimes it doesnt.  But drink alot, I hated drinking fluids and every tme I got chemo the day after I was back for IV for dehydration  So Please be sure and drink water or anything your stomach can handle.  Jello is great too.  Happy Birthday Monday, maybe it will start a whole new beginning for you.  Hope this helped.  JoyceI am also nervous about the chemo. I have to be there by 8:00 am. Been dreading this..I will be getting Cytoxan/Taxotere. I'm expecting the worst with all of the side effects so may e it won't be SO bad or at least I can cope. The Neulasta shot also scares me with its painful side effects. I started taking the Claritin last night though so hopefully this will help. No one seems to know why this helps with the pain, just that it does so it's def worth a try.",
      "MessageIndex": 4,
      "PostDate": "29/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "Kris1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kris1",
      "Content": "On Jan 11, 2013 4:08 PM stillgoingstron wrote: On Nov 28, 2012 8:11 PM LizaMarie711 wrote: Hi, Im looking for advice, from anyone who can help. I had a double masectomy with reconstruction on Spet 19th. I still have to get chemo. 4 rounds over 12 weeks of cytoxyn and tamofere. I am more petrified of the chemo than i was of the surgery. I dont want to loose my hair but i know thats not AN OPTION. I have no idea what to excpect, other than what the doctors are telling me, Im a wreck. Please any info will help. I am getting my first round of chemo this Monday wich is also my 45th bday ughhh..l  thanks   The chemo is a must, so take it!  I took 3 types for 6 months as I was stage 3 breast cancer in 2005 - the only side effect I had other the hair loss was exhaustion.  I literally slept most of the time. However, I have friends that worked the whole time.  I hope you will be like them.  It's worth it though, as I'm here 8 yrs later. I have just been diagnosed with a recurrance in my bone mrrow and am taking Afinitor which has wonderful reviews and hopefully will keep me kicking around for many more years! Good luck to you - I believe you will do fine!     I was diagnosed in September with triple negative breast cancer and also had double mastectomies with reconstruction.  I actually just had my 3rd round of chemo, Cytoxan and Taxotere yesterday and I just got back to work after having my Neulasta injection.  I thought that the side effect of losing my hair would be horrible but actually it was much less painful than I thought.  I get tired from it all but as I had read many posts before I started this journey..it do-able.  You just do what you have to do to survive.  I still have 5 more treatments to go and I shouldn't have to have any radiation or at least not on the agenda yet.  Hope everyone is doing well.  :)",
      "MessageIndex": 62,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    }
  ]
}