{
  "AuthorID": "Kristie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kristie",
  "Posts": [{
    "AuthorID": "Kristie",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Kristie",
    "Content": "Dear Cancer Victim: No you do NOT have to listen to the doctors or have surgery! Doctors do not know everything and in the area of cancer they do not know much... they are still \"practicing\" and trying to \"find a cure\" .. well others in the field have already found the cure but its hard to get the news out as the media will NOT or CANNOT go after these stories (yes there is a conspiracy). Did you know that one of the chemo drugs they give women for breast cancer is a well known carcinogen? That means it CAUSES CANCER! \"The doctor of the future will give no medicine, but will interest his patients in the care of the human frame, in diet and in the cause and prevention of disease.\" ~ Thomas Edison War does not determine who is right - only who is left. ~Bertrand Russell IF I HAD CANCER I WOULD…: Go to http://brcsuperstore.com/listings/134.html (their Answers for Cancers page) to find lots of resources for books, videos, websites, addresses etc. for natural healing that cures without mutilation or poison. IF I HAD CANCER I WOULD…: find sources for books that tell you why cancer forms and how to cure it like: \"The Germ That Causes Cancer\" on http://www.knowthecause.com . They also have a cookbook and other valuable books. IF I HAD CANCER I WOULD…: As one woman was 24 hours from death and refused removal of her breasts and healed herself completely and is on TV regularly telling people of her experience. She is also a woman of faith and a doctor, her name Dr. Lorraine Day, you can find her books and videos at http://www.drday.com . IF I HAD CANCER I WOULD…: Get all the info I needed from http://brcsuperstore.com/listings/134.html - ANSWERS FOR CANCERS. IF I HAD CANCER I WOULD…: Let doctors and family and friends know that it’s MY BODY and I will decide what is right for ME concerning my cancer. I would not let their manipulation or fear influence my decisions. IF I HAD CANCER I WOULD…: Believe that Dr. Holland is most likely the best doctor for a cure. David Holland, MD 2201 N. Collins, Suite #170 Arlington, TX 76011 Tel: 817-861-4100 Fax: 817-861-4103 http://www.txnutrition.com IF I HAD CANCER I WOULD…: Find out with these resources that antibiotics or penicillin and other drugs, smoking, drinking and bad eating habits and possible air and water pollution are the most likely sources for my disease. A bad diet which includes: grains / wheat (white flour), corn, possibly beer, processed white sugar, and white rice, and processed foods with their preservatives and other things we can’t pronounce (the already made kind so easy and so unhealthy that all your friendly grocery stores are so willing to sell you and well stocked on their shelves). IF I HAD CANCER I WOULD… get the book \"The Germ That Causes Cancer\" IMMEDIATELY and start the \"PHASE I DIET\" in the book. They also have a cookbook out that would be very helpful. Their others books such as \"The Fungus Link I\" and “The Fungus Link II” would also be helpful and I would consider ordering them. IF I HAD CANCER I WOULD… Make an appointment and go see Dr. Holland if possible as soon as possible for my best chance of a cure and a normal life without poisonous drugs, radiation etc.. I would need to DETOX and replenish the PROBIOTICS (good bacteria) all the treatments that I may have already had and a wrong lifestyle has destroyed in my system. The book can be order by calling Phone: (972) 772-0990 . IF I HAD CANCER OF ANY KIND I WOULD GET TO DR. HOLLAND ASAP... HE HAS LITERALLY HELPED SAVE MANY PEOPLE FROM CANCER AND OTHER DISEASES AND ILLNESSES without drugs, surgery or radiation. HE KNOWS WHAT OTHER DOCTORS DON'T OR WON'T TELL YOU. I personally have many DEAD family members the last was Jennifer my sister-in-law who was only 25 with a 1 year old son died March 15, 2002 who died from cancer. Jennifer was treated at the Mayo Clinic with the only three ways medical science knows: surgery, chemo and radiation (chop, poision and burn as the cancer patients call it). I also have no female organs, appendix or gall bladder because I USED TO listen to the doctors, if I would have known about Dr. Holland and Doug Kaufmann and their books I would still have all my parts and be a lot healthier and happier. IF I HAD CANCER I WOULD…: go to http://www.knowthecause.com and get the books and call and make an appointment with Dr. Holland IMMEDIATELY .. it really is a matter of LIFE & DEATH! He is one of the few around that knows what causes disease and how to cure it. The show \"KNOW THE CAUSE\" is on DISH NETWORK on channel 223 and 218 at 10 a.m. and 5 p.m. Eastern Standard time. You may get it on Sky Angel also and what local channels or PBS stations I don't know, you could ask what channel your area could possibly get the show by calling Phone: (972) 772-0990. It would be worth it to find out if you can get it, it is very informative! The nurse Jami Clark that is on the show quite often was an oncology nurse, she left because she knew what really went on behind the scenes... it's all about money and the doctors and hospitals really don't know or really don't care about curing the patients. She did that's why she could not and would not stay. She joined Doug and Dave to try to educate America with the truth, they travel all over the USA bringing the good news of healthy ways to cure disease and illness. God Bless them! www.natren.com for probiotics (since antibiotics and other drugs (poisons have probably ruined your immune system) www.seagateproducts.com (broccoli, grapeseed extract, olive leaf extract is a must along with all the other carrot and fish oil to build immune system) www.all-one.com/index.asp?referer=http://brcsuperstore.com for a mixture of vitamins & minerals (fresh & healthy) http://brcsuperstore.com/listings/323.html for a real AIR PURIFIER that works to kill the molds and toxins in your home or office!) Also The Cancer Treatment Centers of America are good www.cancercenter.com even though they may use surgery, chemo and radiation (if absolutely necessary) but they also use immune building methods that have saved lots of people who were told there is nothing else to do but die. Personally I would go to Dr. Holland and see what he had to say first. I would trust him the most. Maybe he could consult with doctors at The Cancer Treatment Centers of America if it was necessary to go there. Also A MUST FOR CANCER VICTIMS ESPECIALLY BREAST CANCER!! Dr. Lorraine Day, medical doctor who cured her own breast cancer entirely with alternative medicine!!! No surgery and No chemo or radiation! Videos: \"You Can't Improve on God\" \"Cancer Doesn't Scare Me Anymore\" Call toll-free 1-(800) 574-2437 www.drday.com My prayers will go up for you and I pray you choose LIFE and that more abundantly and that God will bless your efforts and you go to the media with lots of information IF you are cured so that others will know about alternative cures that they may also LIVE! If you receive that cure I hope you go to the media (radio, tv and your local newspaper) with lots of information on HOW you were cured so that others will know about alternative choices that are available and that really do cure diseases so that many more may also LIVE and not DIE! If I had cancer I would invest in all the knowledge you will receive with the information available on this letter. More important links if you eat meat: For Natural Grass Fed Beef - Dry Aged Steaks go to: http://brcsuperstore.com/listings/311.html also: http://www.texasgrassfedbeef.com and: http://storesense01.dynamic.net/grassland/index.html Information on all kinds of health subjects: http://www.mercola.com/article/statins.htm - Exposing that Doctors Are the Third Leading Cause of Death... Heart Disease #1 and Cancer is #2!!! STOP ALL SUGAR IMMEDIATELY!!! That means all sweeteners including all forms of sugar like fructose, sucralose etc., corn syrup, and all others. Read labels as corn syrup is in a LOT of things including Ketchup etc. READ LABELS! Eat ONLY STEVIA (an herb), which you can find at health food stores, locally and on the internet. I would not even use HONEY the only other safe sweetener until my cancer was 100% gone, but that would be my option due to the fact that fungal and cancer tumors alike feed on SUGAR! Which also means stop all carbs made from flour that turns into sugar in your body. No bread, pasta, cake, cereal, white rice etc. Get the books they explain WHY. another cancer article link: http://www.mercola.com/2000/oct/8/sugar_cancer.htm ALSO: Free information on financial and other help available. Download this set of 4 e-Books and Reports NOW. It could save your life. The set of e-books and reports at Natural Cancer Cures gives you EVERYTHING you need to know about natural and alternative treatments for cancer. http://www.naturalcancertreatments.com/?hop=brcsuper - CANCER ANSWERS eBooks. I am sending this because I really do care that too many people are lied to about what cancer really is and that a cure is still being researched, there is no research needed they already KNOW how to cure cancer, if your doctor sincerely doesn't know HOW or where to find the information give him this letter. May God Bless your endeavor for a cure. Remember the Holy Bible says: \"My people are destroyed for lack of knowledge.\" - Hosea 4:6 YOU ARE NOW EQUIPPED WITH LOTS OF KNOWLEDGE AND SOURCES TO FIND KNOWLEDGE USE THEM WISELY! Serving Our Precious Saviour the Lord Jesus Christ who is the answerer of PRAYER! Kristie F. - Michigan",
    "MessageIndex": 4,
    "PostDate": "01/02/2005",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1514,0.htm",
    "Title": "Do Not Want a Mastectomy"
  }]
}