{
  "AuthorID": "ksfitness32",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ksfitness32",
  "Posts": [
    {
      "AuthorID": "ksfitness32",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ksfitness32",
      "Content": "I am desperate.  I had breast cancer the first time in 2003 when I was 32 years old.  I had a bilateral mastectomy, 4 rounds of chemo then tried Tamoxifen.  I went into the deepest depression I'd ever experienced.  I elected to stop taking the drug because my quality of life was SO bad!  Fast forward to Oct 2015...breast cancer recurrence. Yeah...I'm living with loads of guilt over that.   I had 16 rounds of aggressive chemo and 5 weeks of radiation therapy.  The tumors were inoperable but the treatments shrunk them down to where they no longer light up on MRI.   Because I'm only 45, I elected to have my ovaries removed so I wouldn't have to take Tamoxifen again.  I started taking Arimidex in late May.  I was doing so great!  The hormonal depression I had dealt with my whole life was GONE!  My moods were consistant along with my energy.  I was back to teaching classes at the gym and started training for a 5K.  (I've run 2 marathons, so running is soooo important to me.) Then, in early August I developed a terrible rash on the radiated area.  The dermatologist said it was eczema.  I've never had anything like that before.  Fastforward to mid-Sept: major fatigue!!!  By the end of Sept I was experiencing severe eczema, daily fatigue and horrific digestive pain.  It felt like I had just finished a chemo treatment.   For the past month I have changed my diet and sought holistic treatments.   The eczema and fatigue are better but the stomach issues and depression are kicking my butt.  I can't teach classes at the gym, I have lost so much weight. (15 pounds since June...which puts me at 105 lbs)  It hurts to eat and hurts if I don't.   I am also a recovering alcoholic.  I know I can't drink, so the the thought that keeps popping up is suicide.  NOW SLOW DOWN...I'm not going to.  It's just the thought that pops up.  My quality of life is absolutely horrible!  Awful!   My oncologist suggested I stop taking the Arimidex for a couple of weeks.  So I'm finally giving in and will give that a go starting tomorrow.   That decision fills me with utter dread.  Not taking Tamoxifen probably caused my recurrence.  And here I go \"quitting\" the only other drug that I know of that will prevent a recurrence...again!  I fought so freaking hard to live and now I feel like it was for nothing.   Life or death.  I'm praying someone out there in the webworld will help me not feel so ****ing alone in this. ",
      "MessageIndex": 0,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93710,0.htm",
      "Title": "Feeling so hopeless!!!!"
    },
    {
      "AuthorID": "ksfitness32",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ksfitness32",
      "Content": "Thank you!!!  Truly! ",
      "MessageIndex": 3,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93710,0.htm",
      "Title": "Feeling so hopeless!!!!"
    }
  ]
}