{
  "AuthorID": "KThomp",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KThomp",
  "Posts": [
    {
      "AuthorID": "KThomp",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KThomp",
      "Content": "  On 7/3/2008 trehouse60 wrote:   On 6/26/2008 Kittycath wrote: I am thrilled to report that I am going to be taking my last tomaxifen in mid- August.  With family and firends we are having a PINK PARTY and I will take that last pill served on a silver platter and down it with pink champagne; everyone is going to wer pink--I am SO excited.  But--on to my questions.  I have read things here and there that soy is a No-No for breast cancer gals.  How dangerous is it to use soy?  I have put whey protein in my morning oatmeal for a couple of years, but it seems I may be having some difficulties eating so much dairy.  So, I have wondered if it would be dangerous to use soy protein instead of whey.  I use the protein powder because I am not much of a meat eater.  Also, what about body lotions containing soy (that certainly has become a trend).  Finally, what about soy \"milk\" like SILK?  Any nutritionists out there that can help with this? Hi Kittycath, Congratulations on your great news! Avoiding phytoestrogens altogether and maintaining a healthy diet, including foods with high anti-oxidant value, is practically impossible.  However, there is a difference in many foods, herbs, and supplements as to the strength of the phytoestrogen they contain.    I have read some pretty respectable research indicating that very strong phytoestrogens will be utilized for growth by estrogen-positive cancers, whereas very weak phytoestrogens will act as estrogen-blockers, just as tamoxifen and arimidex do.  And there are many herbs, supplements and natural foods that are natural aromatase inhibitors, which is what Aromasin and many of the newer drugs do.  SOY is one of the strongest phytoestrogens you will find in naturally occuring foods. (This includes raw soy, soy supplements, tofu, tempeh, and , soy sauce, and soy flour. Soybean oil is possibly the least of these villains, as many products with soy oil have such small amounts e.g. breads with soy oil might be ok, breads with soy flour would be a no-no.)   Yams and red clover are also very powerful phytoestrogens, and probably not good choices for anyone with active estrogen-positive breast cancer or a history of estrogen-positive breast cancer. while there is a huge on-going debate about whether wine prevents or causes cancer, there is creditable evidence that for pre-menstrual women, a small daily intake of red wine (not to exceed 3 - 4 oz) and help prevent or fight breast cancer.  Red wine is very high in resveratrol and flavonoids - that combination allows red wine to act as both a natural estrogen-blocker and an aromatase inhibitor.  Grapes, especially red grapes with the seeds in them, are showing excellent results in alternative prevention and treatment of cancer, (or grape seed extract) -  again because they act as both an estrogen-blocker and aromatase inhibitor.  White button mushrooms are also being used with good results in this particular research.   Some time spent in internet research should be fruitful at revealing other nutritious foods that are low-strength phytoestrogens and therefore can be used as natural estrogen blockers. As for avoiding soy and still eating healthy - yes, it is absolutely possible. I do it, and I eat very well.  Being vegetarian helps.  The suggestion of using brown rice milk is excellent - you can make your own inexpensively, and it keeps well in the fridge.  A little vanilla gives it flavor.  (send me a private message if you want my recipe)  Of course, check labels - the only commercially prepared product I consume with soy is 2% or less soybean oil, in bread only.  Virgin coconut oil (expeller pressed from fresh coconut meat) is an excellent choice for cooking, baking, salad dressing, etc - expensive, but using it really makes it easy to avoid soy and the other oil products that are strong on the phytoestrogen range. Infrequent consumption of some soy is probably not going to cause much harm, especially if your diet is high in anti-oxidants, and you counter the soy consumption with natural estrogen-blockers  or other foods or supplements that are showing creditability in preventing or fighting cancer.  (the old saying an apple a day - has a lot of truth to it. very dark chocolate is also our friend!!!)  I love the chinese food prepared at a local authentic chinese restaurant. I eat there every week or two, knowing that soy is a staple of their sauces.  I make sure to also take the herbs and eat the foods I am using to counter estrogen, and my estradiol level is now the lowest it has been since we started tracking it.  I hope this helps.  Again, congrats on no longer having to take that nasty medicine, and I wish you the best of luck! Sincerely, tre  Thank you so much for all of the excellent information on soy and other phytoestrogens.  Obviously you've done your homework!  I am ER+ 16 yr survivor with stage IV and doing well using natural progesterone to oppose estrogen.  Also avoid hormones in milk, meat, and processed foods.  I take DIM and Calcium D Glucarate to flush out estrogens as well.  Taking D3, Vitamin C, CoQ10 and a high quality fish oil.  Also use virgin coconut oil as a skin moisturizer. In my research of soy, have been confused about the type of soy.  Some say that ferminted is actually helpful. Soy Isoflavanoids or genesistine (sp?) is safe.  I'm just not convinced and so I continue to avoid using soy of any kind.  It's in just about every processed food available, so your advice to READ ingredients should be observed continueously.   I've been on Tamoxifen, Femera and Faslodex during my years in the battle.  Since I'm \"off the map\" as to what to try next to control estrogen dominance.....my Oncologist, OB/GYN and Compounding Pharmacists have been my \"A\" team for monitoring hormones and prescribing appropriate dosages of natural progesterone. I do not encourage any ER+ patient to attempt to treat themselves with OTC hormone products.  Saliva testing and careful monitoring of cancer markers in addition to appropriate supplements to flush out the estrogen are of greatest importance.  As more and more of us survive ER+ B.C., it's so important to learn about how and which hormones can help or harm us.  Also, if you are interested in an alternative method to montior breast health, learn about thermography.  It's fantastic and there's no radiation!  Have a blessed day!  kt   ",
      "MessageIndex": 6,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25442,0.htm",
      "Title": "SOY and breast cancer"
    },
    {
      "AuthorID": "KThomp",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/KThomp",
      "Content": "Originally diagnosed in 1992.  Had 9 months chemo after modified radical mastectomy.  8 of 16 lymph nodes involved.  Estrogen positive tumor. 2002 reoccurence in T11 vertebra spine.  Did 5 weeks radiation and began femara.  2006 came back in multi locations spine and skull.  Switched to faslodex.  Considering discontinuing due to pain and irritation of muscle from injections and elevated markers. Have established that I'm estrogen dominate.  High cortisol levels indicate some compromises with adrenal gland.  OBGYN gave me high dose compounded progesterone to counter estrogen.  Markers now down to 27 from 42 high before treatment with progesterone.  I also drink Flor Essence Tea and use DIM.  Might suggest you look at \"Avoiding Breast Cancer\" by Dr. Joseph McWherter and websites for Dr. John Lee and Dr. Lam.    Wall Street Journal also had excellent article on cancer \"cocktails\" (supplements and nutrician) that are being successfully used by patients to keep cancer in remission.  Keep hope alive to those of us that are \"off the map\" for conventional treatment.  KThomp",
      "MessageIndex": 1,
      "PostDate": "06/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19441,0.htm",
      "Title": "Breast cancer with bone mets"
    }
  ]
}