{
  "AuthorID": "lamb0301",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lamb0301",
  "Posts": [
    {
      "AuthorID": "lamb0301",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lamb0301",
      "Content": "Oh by the way...a new cure is coming and in the works on a small scale.  T-cell therapy.  Being studied in Stanford...used a lot in Europe.  My 3rd cousin who had breast cancer in her 30s and then a recurrence 7 years later to her ribs/liver Stage IV, had tx and is now cancer free....plus tx in Belgium only cost $8000.  People...believe this....the cancer business is a hugh money maker for drug companies, hospitals, and doctors.  I started watching on You Tube \"Truth about Cancer\" by Ty Bollinger...encourage you to watch it.",
      "MessageIndex": 42,
      "PostDate": "17/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "lamb0301",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lamb0301",
      "Content": "I too have a score of 17% and have suffered just minor joint aches and muscle pain from Letrozole.   Moreso was knife-like headaches were I even had a MRI done to check for mets - no mets.  Had my surgery and radiation in summer of 2015.  A nurse in integrative medicine told me because of Letrozole I as depleted in Magnesium.  A health/wellness pharmacist confirmed this along with a depletion of Calcium and Vit D.  He told me to supplement my diet with these minerals (500mg of Mag) and to avoid flaxseed, soy, Vit C, copper, and iron.  Went off Letrozole today to help replenish my minerals then will go back on Letrozole in a week.  This was suggested by another nurse practioner in the field who told me not to tell anyone about this as other patients she knows have done the same with med onc approval.  I am also a Radiation Therapist so I know these hormone drugs help, but maybe their medical makeup has changed where more are getting sicker using these drugs.",
      "MessageIndex": 41,
      "PostDate": "17/04/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    }
  ]
}