{
  "AuthorID": "LaticePorter",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LaticePorter",
  "Posts": [
    {
      "AuthorID": "LaticePorter",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LaticePorter",
      "Content": "On Apr 26, 2008 12:00 AM reyze wrote: I was diagnosed with breast cancer in February 2006, I began chemo (doxorubican, 5FU and taxotere) in March 2006 and had my last treatment in July 2006.  I only have a few sparse hairs on my head and my hair has not regrown.  I don't understand this since I had very very thick curly hair.  I have used Nioxin and am now using Rogaine in an attempt to get hair.  My body hair, eyebrows and eyelashes only have sparse hair also.  Do you have any suggestions or help? I miss my hair. Please help.      I hope this message fines you continuing to heal.  I am a breast cancer survivor and I also lost my hair.  Prayer to Jesus Christ and eating tuna, spinach, almonds (23 recommended daily), eggs and a healty diet with fruit and vegetables will help your hair growth.       After a year and one month, a healthy diet along with the foods I mentioned and more, you should see results in one month.  Remember to keep your hair oil on daily and moisturized.  God bless you.        ",
      "MessageIndex": 43,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    },
    {
      "AuthorID": "LaticePorter",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LaticePorter",
      "Content": "Hi,  I am a breast cancer survivor and I want to encourage you not to give up on your hair.  I was diagnosed with breast cancer in November 2010.  I have four surgeries to remove the cancer.  In March of 2012, I didn't have anymore cancer.  I went threw chemo and radiation.  They put me in a five year treatment plan.  Nevertheless, in 2013 I had to stop treatment because it put sores in my head.  I prayed to God during this whole time.  I changed my diet to lots of fruit,vegetables, fish 100percent juices and nuts.  I use organic foods a bit.  My hair fell out to the point where it was thin and I have a bald spot.  During this time mt thyroid started acting up.  I discontinued the thyroid medicine because it start taking out the hair I had.  I replaced the thyroid medicine with organic coconut oil.  Now after looking on You tube and trying the inversion method with my diet, my hair is growing back.  I massage my ,head with extra virgin olive oil and use the inversion method and it is growing my hair back just as the ladies that testify to it working.  It does work.  Also DHT causes hair loss so to reverse this you can use a supplement called Zinc it will fight DHT. Jesus bless you as well as he had blessed me.",
      "MessageIndex": 49,
      "PostDate": "29/03/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    }
  ]
}