{
  "AuthorID": "Laurie_S",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Laurie_S",
  "Posts": [{
    "AuthorID": "Laurie_S",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Laurie_S",
    "Content": "Hello Marie, I was diagnosed with metastatic breast cancer to bone and lungs on 11/15/2002. I am 39, single and have two teenagers. My original diagnosis was 8/15/2000, hormone positive 2.5 cm mass to right breast, underwent modified radical mastectomy, 9 lymph nodes removed 5 had cancer cells. Underwent adriomycin/cytoxin in four cycles then taxol in four cycles, 20 plus days of radiation to right side of chest and started tamoxifen in May 2001. I was told at original diagnosis I was a stage 2b. Needless to day the tailspin and trauma my diagnosis of stage 4 has caused and the depression and anger. I like you am not ready to go yet and intend to fight tooth and nail!!! I would be happy to assist with upkeep of a positive attitude in a very difficult and scary situation, maybe we can be strong for one another. I live in Belton TX. I have not been to CTCA yet. I am undergoing Taxotere in IV every three weeks (just had second one yesterday) and Xeloda 4300 mg daily for 15 days and off 7. I am taking Zometa to streghten my bones every four weeks and they started me on can't remember name (starts with an A) and is like Procrit, recieved injection in fatty part of back of upper arm. I am to complete a third chemo and go for bone and CT scan to see if any shrinkage. I have spots on my left iliac, T1, T12, and L5. I also have spots 9mm and one smaller in right lung, 7mm spot in left lung. I am told that these places were already there when I recieved my original chemo but were just to small to be seen and I guess they built up an immunity to my tamoxifen and started growning again. I am told they are slow growing and we found the early. I remember asking about the spot in my breast when originally diagnosed and I was told it had been there along time also it was just so deeply planted in breast fatty tissue it took it getting big to find it. I will stop rambling, if you would like to visit please email me. I will keep you in my prayers. Laurie",
    "MessageIndex": 13,
    "PostDate": "13/12/2002",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,444,0.htm",
    "Title": "Stage 4 breast cancer, need help"
  }]
}