{
  "AuthorID": "Leahchey",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
  "Posts": [
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Hi ,My 57 year old mother has had her breast cancer come back in her internal mammary lymphnode chain . Has any one heard of this and what has been their treatment her onocologist says its noncurable this time .Please help me find something to help my mom!",
      "MessageIndex": 0,
      "PostDate": "06/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11883,0.htm",
      "Title": "cancer reaccurence"
    },
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Hi. Mymoms breast cancer has now went from internal mammary nodes to lung to brain in a matter of about 3 mths. She has just finshed 14 whole brain radiation treatments. And is trying to do chemo only to have platlet levels to low. However did recieve it last week they were up to 70 finallay. Does anyone out there no hte risks of getting chemo when platlets are low. And has anyone out there had good luck with whole brain radiation.I can only find bad stuff about it when i research. And does anyone out there have brain mets from breast cancer and if so how are you doing? I am just getting really scared for what my mom may be going to go through soon. Doctors are vauge and i dont want to ask any more quesitons because i dont want to overstep my mo and what she wants to know. If anyone has any information or advise i would appriecitae it. Thanks Leah!!",
      "MessageIndex": 0,
      "PostDate": "15/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14372,0.htm",
      "Title": "mets to brain and lung HELP"
    },
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Hi everyone. My mom was diagnosed in 2005. She had a masectomy 4 mths chemo and 6 weeks radiation. She has been on anastrszole hormone therepy since treatment ended one year ago.We found out 1 mth ago that it has returned in her internal mammary node chain. Has anyone heard of this and if so what has been your treatment? Her onocologist has put her on faslodex injections but says its incurable.She has ct and pet scan coming up in May. Has anyone heard of this. Its really scary. My mom is my life i call her if i have a hang nail and I remember all to well the first time. I hate to see my mom suffer . If anyone has any advice I would love to here from you. My mom is 57. And she has alot to teach my kids yet. The kind of things only a grandma can do.And she is a great grandma.Please help !! Leah",
      "MessageIndex": 0,
      "PostDate": "28/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11665,0.htm",
      "Title": "its back"
    },
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Thanks for getting back to me so soon. My e-mail address is --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--   That would be great if you caould send me what ever you have. Oh i hope your mom gets better. I hate this diesease.It so out of the blue everything ive researched and thats alot i had never came accross this i couldnt beilve it. Please keep me posted on your mom. We will say a prayer for her and you for i know all to well the strenght you need to face this. Thanks Leah  ",
      "MessageIndex": 4,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17127,0.htm",
      "Title": "carcinoma meningites"
    },
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Hello eveyone. My mother has just been diagnosed with carcinoma meningites. We are needing some help in knowing whant to do next. Onongologist says 4 to 6 weeks without treatment 3 to 6 ths with treatment.Can anyone tell me how toxic the treatment is. It would be the resivoiur chemo thing in her brain shes already went thruogh 14 whole brain rads for brain mets. Her breast cancer is already in lungs brain bones and adrenal gland and now this carcinoma meningites. Please if anyone has any knowledge on what my mom will have to go through with and or without treatment. were all trying to figure out what would be best for my mom.She is 57 years young and has been fighting since 2005. Please help were desperate Thanks Leah  ",
      "MessageIndex": 0,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17127,0.htm",
      "Title": "carcinoma meningites"
    },
    {
      "AuthorID": "Leahchey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leahchey",
      "Content": "Thanks so much for your reply. Im sorry to here about your moms condition. When was your mom dx with carcinoma meningites? Its so sad to here about the progression this form of cancer spread has. I havent read any good out comes with or without doing the treatment. Where else is your moms cancer? I asked my moms chemo nurse about side effects of the brain resiviour thing and she said there wasnt any severe side effects and if she doesnt get it there talking weeks with it could be 3 to 6 mths but i dont want her to lose her hearing and be in a wheel chair either. This is so hard her face is already getting tingly and she is seeing things that arent there. Please if you have any more information or insight from your expierence. Please write back this decion is so hard to make.I will keep you and your mom in my prayers. Leah  ",
      "MessageIndex": 2,
      "PostDate": "16/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17127,0.htm",
      "Title": "carcinoma meningites"
    }
  ]
}