{
  "AuthorID": "LearnAboutIPF",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LearnAboutIPF",
  "Posts": [
    {
      "AuthorID": "LearnAboutIPF",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LearnAboutIPF",
      "Content": "Unfortunately chemo and radiation along with all that stress have a cumulative effect.  Has he checked for anemia and if so have you had the shots to build your red cells back up?  I only had radiation and was so surprised that after 16 weeks of radiation I was exhausted.  Wasn't doing anything but laying on the table...but it had lowered my red count to very low levels.  Hope you are feeling better soon!",
      "MessageIndex": 1,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38924,0.htm",
      "Title": "Fatigue"
    },
    {
      "AuthorID": "LearnAboutIPF",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LearnAboutIPF",
      "Content": "Like you I had Stage II DCIS, 5cm,Estogen+, grade 3.  I did lumpectomy and 16 weeks of radiation.  No chemo, my oncologist didn't think it was necessary.  I'm 7 years out, having a few problems with an elevated ca 27.29 but still glad I didn't do chemo. ",
      "MessageIndex": 4,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38620,0.htm",
      "Title": "is anyone refusing chemo for breast cancer"
    },
    {
      "AuthorID": "LearnAboutIPF",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LearnAboutIPF",
      "Content": "Newbie, thanks for responses to come:) I am a 7 year survivor, age 47 at dx,  stage 1, Estrogen +, DCIS with lumpectomy and radiation, no chemo.  5 years of Tamoxifen  (and 5 years of hot flashes) 1 year off then put back on Tamoxifen 13 months ago because ca 27.29 value of 42.  13 months, Petscan, Bonescan, HRCT, and mammo and ultrasound later my ca 27.29 is 98.2 (last month 102), my cea is 1.9 and d.dimer is 0.1.  I have lots of other crap wrong with me but am worried of liver or pancreas involvement as I already have an enlarged fatty liver due to diabetes and problems with pancreas.  1) any thoughts or info on elevated blood tests 2) any other tests that may show more specifics besides Petscan?  I cannot do an MRI unless I am in a hospital. (have lung disease and severe claustraphobia need anathesiologist) Here's hoping someone can direct me",
      "MessageIndex": 0,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38804,0.htm",
      "Title": "ca 27.29/cea/d-dimer"
    },
    {
      "AuthorID": "LearnAboutIPF",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LearnAboutIPF",
      "Content": "I was really worried when after 3 years my mammo showed micro calcifications and a unusual mass that they couldn't resolve right over my scar from the lumpectomy.  Ended up with a 2nd surgical biopsy, had already made up my mind that they were both coming off if this was positive.  Turned out to be multiple cysts and radiation damage.  Wonderful relief.  The only thing is if you have surgery after radiation you can have a horrible time healing.  Took 7 months for a fistula in the cener of the new scar to heal.  I still have a hole the size of a pencil eraser that is healed but will never fill in.  Don't care much better than getting mets.",
      "MessageIndex": 1,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38928,0.htm",
      "Title": "Confuse with dx"
    }
  ]
}