{
  "AuthorID": "Leb047",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
  "Posts": [
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "I have talked about my situation several times. I have been off Arimidex since nov, 2012. I continue to read about others situations and I am surprised that so many suffer on these meds. My life is worth a lot and while I do not want the cancer to come back I am tired of the doctors trying to guilt me by saying I should\" do everything I can\" meaning take these drugs. No one seems to care if my quality of life is worth anything. That is not the concern. I m 64 and if I took Arimidex for the full time I would be 68.(I took it for one year) no one will promise me that the cancer will never come back. Why would anyone consider giving up what coud be the last good years of your life to painful side effects. AND, my doc said the latest recommendations are to take it for 10 years! Now I feel just great for a 64 year old. I walk every day. I am not weakening my bones with this drug. I do not expect everyone to agree with me but I will admit I am a little shocked at what others are willing to give up in quality of life.",
      "MessageIndex": 2,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71512,0.htm",
      "Title": "I am going off of all those anti hormone pills!"
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "I am a breast cancer survivor, stage 1, so my prognosis is very good. I responded to many things about your request. One very interesting thing is that my mother died of hemochromatosis at age 58! Few people even know what that is. Maybe time for another conversations later. I also am a licensed clinical social worker and have done a lot of counseling around health issues over my career. I am now retired. The one thing you might consider is that both you and your mother are trying to be brave for each other. It really is OK to she'd some tears together, to let her know also how much you love her. Saying that you are sad or scared may seem impossible, but it might also open up a conversation she is afraid to start. I do not know your family, so I cannot be sure what kind of emotions are acceptable. Cherish every day. Live life, with her and with your own friends. Life is a gift, and we never know how much we get, until something like this happens. I am glad to respond to any other questions. You sound amazing!",
      "MessageIndex": 4,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "Here is what my doc said. The drug increases the probability the cancer will not come back, but NOT taking it does not guarantee it will come back. I stopped taking it after one year for the horrible side effects. My life is about movement, hiking, gardening walking, etc. if I cannot do these things, life is a whole lot less interesting. With all the side effects, I was getting very depressed, felt old(I am 64). It has been five months since I stopped and I feel great again. Yes, I still have aches and pains, but nothing like on arimidex. This past Saturday, I helped a friend fulfil her bucket list by hiking Old Rag Mountain.. It was over ten miles and some technical rock scrambling. I am still a little beat, but we did the whole circuit, more than ten miles. I plan to live every day of my life to the fullest. How I view this, it is my choice how I deal with the treatment. I think if I had stayed so unhappy and in pain I would have died of something sooner. If the cancer comes back, I will only look at all this beautiful time I have had with husband and friends.",
      "MessageIndex": 5,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71935,0.htm",
      "Title": "Glad I Found This site"
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "Don't know if this exactly responds to the question asked but I did want to share a doctors visit this week. Went back to see radiation therapist for follow up( it had been two years since treatment). I let her know of my decision t o stop Arimidex six monts ago. She was not that upset, but pointed out mine was a very early cancer. She seemed to accept my decision to not endure the horrible side effects for only a small gain from Arimidex. None of my doctors have ever guaranteed taking the Arimidex would guarantee no cancer returns, only improve odds.",
      "MessageIndex": 5,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70301,0.htm",
      "Title": "Arimidex side effects."
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "I have a \"rule of thumb,\" I will never take another drug to counteract the side effects of another drug. For me, if that is necessary to get me through it, I am done. One drugs side effects are then compounded by another drug, that has its own side effects and so on and so on. I have made some doctors mad by my refusal, but this is after all my life for better or worse. I do not judge anyone who sees this differently,just my own judgement for myself.",
      "MessageIndex": 20,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32647,0.htm",
      "Title": "Armimidex and side effects"
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "On Feb 05, 2009 12:00 AM marielena1950 wrote: I took aridedex for about a year, the join pain was so bad that I have to stop taking it, later on doctor put me in femara, that was even worse, at this time I have not taking anything for about six months, will bo in tomoxifen next week.The pain in my joins did not got any better after stoping the arimedex, Good luck to you..I have posted several times but just as an update, I have stage one with no lymph node involvement. I went on Arimidex and stopped it after one year. That was in Nov, 2012. Doctor wants me to try tamoxifen, but I think I am not doing anything else. The joint pain for me was awful, plus sex was very painful, a side effect just recently cited in some studies. Knowing that my recurrence rate is very low, I cannot believe that at 64 I am better off giving up any of my life to these drugs. Two years post lumpectomy and I am still clear. I feel great all the time!",
      "MessageIndex": 19,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32647,0.htm",
      "Title": "Armimidex and side effects"
    },
    {
      "AuthorID": "Leb047",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leb047",
      "Content": "I have a \"rule of thumb,\" I will never take another drug to counteract the side effects of another drug. For me, if that is necessary to get me through it, I am done. One drugs side effects are then compounded by another drug, that has its own side effects and so on and so on. I have made some doctors mad by my refusal, but this is after all my life for better or worse. I do not judge anyone who sees this differently,just my own judgement for myself.",
      "MessageIndex": 27,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32647,0.htm",
      "Title": "Armimidex and side effects"
    }
  ]
}