{
  "AuthorID": "legal_chick",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legal_chick",
  "Posts": [
    {
      "AuthorID": "legal_chick",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legal_chick",
      "Content": "I was diagnosed with this the lst. week of Oct. 08.  I had no lumps/bumps..nothing.  What I did have was a dry cough that wouldn't go away.  I went to have this checked out and an X-ray show some pleural effusion, etc...from this I went for a cat scan..etc...this showed some slight swelling in lymph nodes.  A biopsy showed estrogen/progesterone positive cancer.  A pet scan showed mets to lymph nodes throughout body with mets to bones throughout body.  The tumor marker was 980.  Since then I have been taking Arimidex and Zometa IV infusion.  Last week the oncologist said my tumor marker has gone from 980 to 250 as a result of the meds.  I have had only good side effects from both of these medications, and I am liking them a lot. I was wondering if anyone else has this same kind of cancer, and if so, how you are doing?    The Dr. says that for me this is \"treatable\", but not \"curable\", so I have no dilusions about what is ahead.  I am very athletic, and I work out 7 days a week.  This is something I have done most of my life, so I am in pretty good shape.  The Dr. says this makes a difference.    BTW, I love this place.    Hugs & best wishes, Meg....        ",
      "MessageIndex": 0,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32274,0.htm",
      "Title": "Estrogene/Progesterone + Stage IV BC"
    },
    {
      "AuthorID": "legal_chick",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legal_chick",
      "Content": "Hello, It has taken me a long time to get to this point.  I was a mess this past October.  My whole life when something bad would happen I would say, \"stop complaining, it's not cancer!\"....well, now it is....     I have come a long way from October, and it is this place, Cancer Compass, that has made that happen.  I was very frightened to come here at lst. and read the posts, but I forced myself to come every day.  It has helped me to read the posts, and now I am posting myself (just started today).  This is a big step for me.  Hugs & best wishes to everyone, Meg",
      "MessageIndex": 2,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32274,0.htm",
      "Title": "Estrogene/Progesterone + Stage IV BC"
    },
    {
      "AuthorID": "legal_chick",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legal_chick",
      "Content": "Hello, I was diagnosed with Stage IV breast cancer, estrogen/progesterone receptor positive back on Oct. 6, 2008. A pet scan showed mets to bones and lymph nodes throughout body.  I did not have any lumps or bumps..nothing..except a dry chronic cough.  I went to the Dr. for this, and an X-ray of my lungs showed some cloudiness and pleural effusion (fluid), plus slightly swollen lymph nodes under my arms.  A subsequent lymph node removal/biopsy confirmed I had cancer.  The main tumor was not found, including in breasts.  The good news from the oncologist after the pet scan was that I do not have lung cancer, and it has not spread to any of my major organs, so far.  I have been taking Arimidex every day and I receive Zometa IV infusions every other month.  I have had no side effects from the Arimidez other than good ones, and the same goes for the Zometa.  My tumor marker was 980 back in Oct.  Blood work done two weeks ago shows it has gone down to 260.  I have never had any pain anywhere, not in my bones, not anywhere, and the dry cough is gone. I am very athetic, and I work out vigourously 7 days a week.  I think this makes a difference all around for me.  Receiving this diagnosis was brutal.  I collapsed when the surgeon called to tell me.  I was in my office, and he called to give me the bad news two days after the lymph node surgery.   I am doing the best I can to keep on going.   The Dr. explained that although this is treatable, it is not curable.  If something else does not get me lst.,  this will kill me eventually.  I am also terrified of having it spread, which I suspect it will at some point. I go to work everyday and smile.  I go shopping, I talk to friends, I exercise, read, enjoy my dogs, cooking, etc... but the person I used to be is gone.  Cancer is always there now, everywhere I go.  I am lucky in that I really like my Dr.  She is a real take charge, let's get it done whatever it takes, high energy kind of person.  Also, she graduated from Harvard Medical School and did her internship at The Mayo Clinic. As an example of what she's like, when the surgeon scheduled my lst. appointment with her, I received a call saying that my Pet Scan had been scheduled for the next day, this was before I even met her, and everything has been this way since...no delays of any kind.  Anyway, that's my story.  Maybe it will help someone else.  Hugs & prayers to all, Meg ",
      "MessageIndex": 3,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32421,0.htm",
      "Title": "Breast Cancer Stage4, not in breast"
    }
  ]
}