{
  "AuthorID": "legalbeagle",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legalbeagle",
  "Posts": [
    {
      "AuthorID": "legalbeagle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legalbeagle",
      "Content": "Yay!!!  Great news and thanks for sharing.  I have it in the lymph nodes in my chest area.  Can you tell me what kind you have and what drugs brought about the remission?    ",
      "MessageIndex": 1,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40470,0.htm",
      "Title": "breast cancer state 4 in the liver"
    },
    {
      "AuthorID": "legalbeagle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legalbeagle",
      "Content": "Can anyone give me advice on how to treat positive lymph nodes in my chest area?  I was diagnosed with BC in 2006 and had ACT plus radiation.  Had a recurrence along the scar line about a year later.  Had that removed surgically and started doing Herceptin and Aromasin.  Scans showed some lymph node involvement in chest areas.  Past two scans showed improvements (some lymph nodes disappeared and others remained stable). Most recent scan (9/25) showed \"increased metabolic activity\" but no new sites.  My husband and I are meeting with my onc. today to discuss options.  I'm just devastated by this.....can't stop crying.  There are so many drugs out there; how do I find the right treatment.  The ACT almost killed me the first time around.  I can't understand why the Herceptin seemed to be working and now it's not.  Please help!",
      "MessageIndex": 0,
      "PostDate": "01/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40291,0.htm",
      "Title": "mediastinal lymph node involvement"
    },
    {
      "AuthorID": "legalbeagle",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/legalbeagle",
      "Content": "Dear Elena, Thank you for your response and kind words of encouragement.  After a long meeting with my onc. yesterday he is pretty sure that this is disease progression.  Some new lymph nodes have showed positive in the same region.  But, he is very optimistic that I have lots of options and many different treatment plans to choose from.  He thinks that a different endocrine therapy might be worth a try, or some different chemo type drugs.  He named Lapatinib and Xeloda in combination, or Navolbine (?) or an injection with Fasodex (sp?) plus Herceptin.  I am in the process of getting some additional opinions.  I feel a little better, but I'm still discouraged.  When this showed up last year a thoracic surgeon was able to get a bit of tissue from one of the nodes in my chest and it was positive.  My onc. suggested that it might be worth getting additional tissue from one of the more easily accessible nodes just to verify the ER/PR/HER status.....mine has flipped from negative to positive to negative in the past two years.  I'm happy to read that yours were negative.  Keep the faith and I'll keep you in my prayers! Legalbeagle",
      "MessageIndex": 2,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40291,0.htm",
      "Title": "mediastinal lymph node involvement"
    }
  ]
}