{
  "AuthorID": "Leslie912",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
  "Posts": [
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "It's always best to check with a registered pharmacist for drug interactions.  I personally have found that anti-depressants have helped me, although I take several medications. (In addition to breast cancer, I'm HIV-positive and take ALOT of medication.) I take Effexor to counteract the side-effects of Tamoxifen and it works wonderfully.  I also take Wellbutrin for depression and have not had any problems whatsoever. You can also check on-line for drug interactions at:  www.rxlist.com Best Wishes, ~Leslie",
      "MessageIndex": 3,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15253,0.htm",
      "Title": "Medicines"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "Hello and thank you in advance for any advice or information anyone can share with me! I completed chemo and underwent a double-mastectomy in January. I cannot believe how much pain I still have in the surgery area. Last week I noticed an INCREASE in pain and new swelling under my right arm and in my right upper chest area.  The next day, my left side also started swelling and had a marked increase in pain. My oncologist diagnosed lymphedema, and I'm now receiving Lymphatic Drainage Massage and massage on my scars to loosen the tissue. My questions are: 1) Why Lymphedema after 9 MONTHS? What could I / should I have been doing to prevent this? 2) Could scar tissue prevent proper circulation in these areas? 3) After my first LDM treatment (which wasn't painful and actually felt good), I completely BLACKED OUT!  I am told I went shopping, took the kids to eat Chinese food and a bunch of other stuff that I simply don't remember.  (I didn't have any alcohol or non-prescribed medication.) Everyone who interacted with me during the 24-hour time period that I do not remember says I seemed fine.  Has anyone ever heard of this or experienced this? Any help/suggestions/advice is much appreciated.  ~Leslie",
      "MessageIndex": 0,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16159,0.htm",
      "Title": "Lymphedema"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "Yes, I did have bilateral breast cancer.  Lymph nodes were removed on the right side, but not the left. I did not receive radiation treatment.  I just had an X-Ray of the chest area and something showed up in the nipple area (I have no nipples...?) on the left side.  There will be further testing this coming week. Thank you again for the information you provided.  It makes sense.  The lymphatic massage seems to be helping.  I also saw a Neurologist and I'm starting to take Neurontin, which will hopefully reduce the pain.  Best Wishes, Leslie",
      "MessageIndex": 2,
      "PostDate": "20/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16159,0.htm",
      "Title": "Lymphedema"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "Has she seen a Neurologist, because she may be experiencing nerve pain.  There are other (non-addictive) medications that a Neurologist can prescribe, after validating whether or not the pain she is experiencing is nerve pain. I hope this helps. I wish you and your sister all the best. ~Leslie",
      "MessageIndex": 1,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17081,0.htm",
      "Title": "after effec t"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "Hi Natasha, Please talk to your parents and try to get in to see a doctor ASAP!! It sounds like something is wrong, but hopefully it's not cancer. Best Wishes, ~Leslie",
      "MessageIndex": 2,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17019,0.htm",
      "Title": "im scared that i might have cancer"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "I received the blue dye injection and sentinel node biopsy at the same time that I underwent the bilateral mastectomy. Therefore, I didn't experience any pain from the injection. Also, I didn't have any problems with the dye. I hope all goes well with you.  Best Wishes, ~Leslie",
      "MessageIndex": 4,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16890,0.htm",
      "Title": "Blue Dye"
    },
    {
      "AuthorID": "Leslie912",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Leslie912",
      "Content": "I was diagnosed with cancer in both breasts.  My right breast was diagnosed with Invasive ductal carcinoma Stage II, the left breast was diagnosed with Ductal Carcinoma in situ.  I opted for a double mastectomy (Total Simple Mastectomy--the entire breast removed, along with the nipple and some skin. No lymph nodes removed.) I also underwent chemotherapy (Adriamycin and Cytoxan).  It has been 9 months since my surgery. Post-surgical pain has been an issue for me, as well as lymphedema (a new development within the past 2 weeks). If you have any questions or need advice or someone to chat with, please don't hesitate to contact me. Best Wishes, ~Leslie",
      "MessageIndex": 2,
      "PostDate": "21/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16243,0.htm",
      "Title": "can breast cancer be in both breast"
    }
  ]
}