{
  "AuthorID": "lillady5553",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lillady5553",
  "Posts": [{
    "AuthorID": "lillady5553",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lillady5553",
    "Content": "On Aug 17, 2005 12:00 AM Rossy wrote: I'm new to this site but maybe this will be of interest to someone. I have been on Arimidex for almost 2 years now, having had a mastectomy in November 2003. Firstly I had hardly any side effects and slowly but surely they seem to be building up, some days far worse than the next. I have never had nausea though, thank goodness. The main side effects which I am experiencing now are aching bones and joints, mainly while trying to sleep at night. Also tiredness and seem to want to just go to bed to rest from as early as 8 in the evening - this is sad as I always went to bed late before my breast cancer. I also contemplated coming off the drug but decided that as the cancer hasn't come back at all in almost 2 years then perhaps I am doing the right thing in taking it every day. I am new on here and happen to stumble upon this site as I was researching *side effects of Arimidex*. I was DX with stage 4 breast CA in 2003......a lump was found at the 6 o'clock position on right breast. I went the next day for a mammogram and yes, it definately was suspicious. so off to the breast surgeons, biopsys, and then the dreaded comfirmation words we think we would never have to hear: You have breast cancer! I had a lumpectomy, nodes removed  and the results of that was NO node involvement....Thank God! I then went on to an aggressive form of chemo due to it being stage 4......the 2 drugs that were used on me every other week, usually did not get used that close together. I finished chemo, then onto 36 rounds of radiation, which totally wiped me out.....but......then came the discussion with the oncologist: which drug was I going to take.....Tamoxifin or Arimidex....hhhmm, my hormone receptors were estrogen ---- and progestrone + well, not wanting to due 5 years of either a *blood clot issue* with the Tamoxifin.....or 5 years of a bone eating drug.....hard decision... I opted for the Arimidex only because I *figured* I could counter act bone loss, but the silent blood clot issue scared me too much. I had lost my mom due to a sudden heart attack and she was only 54 yrs young, so that drug was no in the cards for me. I did my 5 years of Arimidex and finished it in 2010. I was only off the drug 1 month, and my front tooth fell out of my mouth into my hand, and that continued until I went to my oral surgeon, and it was decided that I was going to lose all my top teeth....*talk about tears* I had them all pulled this past July and a whole plate put in right away, and this has been another rollercoaster ride that I don't want to be on. I thought my bottom teeth were okay, and today...a bottom front tooth broke off in the back and I have a hole in my tooth:( I go to the dentist tomorrow morning, and pray my bottom teeth can be saved. I have gone thru every symptom you all are..or have...experienced. bone pain, always exhausted but can't sleep, hip joints pop out of their sockets and then I can't walk until they pop back in.....my last bone density was about 4-5 yrs ago and I was DX with osteopenia. I have bursars on my knees and elbows, a bunion on my big toe, sharp burning pain in my feet...and...it never seems to stop! I would of never in a million years ever thought my  teeth would go because of the Arimidex, but yes, that is the case. I still have my meltdowns and cry...except now I am saying: why did I bother to fight....when I got the diagnosis: hearing the words: you have breast cancer and saying: why me?? Everyday, there is an issue to remind me that I have so much damage to other body parts due to the Arimidex.....  ",
    "MessageIndex": 38,
    "PostDate": "29/11/2011",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
    "Title": "Side Effects of Arimidex After Almost 2 Years"
  }]
}