{
  "AuthorID": "Lillys_Mom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lillys_Mom",
  "Posts": [
    {
      "AuthorID": "Lillys_Mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lillys_Mom",
      "Content": "I am new to this site.  I'm 48 eight years old and my Mother has been battling breast cancer for the past 4 years.  I don't use the term battle lightly.  She had a mastectomy 4 years ago followed by chemo which had minimal side affects for her.  As a family, we thought we got off pretty easy.  A year and a half ago, extreme fagtigue and shortness of breath lead to a new diagnoses...the breast cancer was back and has metasticized (sp) in her lungs, liver and bones.  She's practically immobile right now due to back and hip pain.  Her rhumetoid arthritis adds to her pain and inability to get around better. I've tried to be strong calling upon God for a miracle (there isn't one yet), and I'm reading books and talking to a counselor from time to time.  I was a wreck right after she was re-diagnosed and decided I better get my act together so I could be there for her.  My Dad and I are not very close; he's very depressed and is dealing with his own health issues.  I have one younger sister who isn't around very much.  I got angry about that from time to time. The tumors on my Mom's liver are increasing so her onc. is going to put her on Taxol, most likely.  She's been on Navelbean and has had few side effects.  Her lungs and bones are stable.  I've decided to stay positive and will support her as long as she wants to continue the battle. I called ABCD (After Breast Cancer Diagnosis) help line several months ago and was disappointed that they did not have a mentoring program for childen of breast cancer patients.   I would love to hear from other older children about what they are experiencing and how they are coping with a parent's serious illness.  Nothing prepares a person for this.  I feel so lost some times.  Lilly's Mom",
      "MessageIndex": 0,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34503,0.htm",
      "Title": "Emotional Support for Older Children"
    },
    {
      "AuthorID": "Lillys_Mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lillys_Mom",
      "Content": "Hi Carol: I am new to this site; decided to write today as my Mom was just told last week that her liver tumors are increasing (don't know how many she has...she was told she has multiple tumors).  She's been on navelbean, Xleroda (sp?), she's had radiation for the bone pain, and others that I can't recall the names of right now. I can't even imagne what this journey is like for you; no one can really know if they haven't been in your shoes.  I hope you have supportive family and friends that are helping you.  God Bless You with your Fight.   Palmcoast wrote: HI Carol, I was diagnosed in 10/06, started treatment in 11/06. Lost work for 10 months because I work for the post office and if you are not 100% you can not work. I did have a private disability insurance because the post office has none and social security refused me because cancer is NOT a disability. Still am under a lot of debt but you can not get blood out of a stone. I made the mistake the first go round by putting everything on credit cards. Now I make payments monthly and nothing goes on the credit card. The plastic surgeon is going after me for non payment but he screwed up so he will be the last one to be paid. My story in short form. Found a lump on my upper left side that would come and go. Went and had a diagnostic mamogram and ultra sound and it still did not show up. When the doctor asked me to move my arm it shot up and he sent me straight to a surgeon. Had invasive infiltrating lobular carcinoma along with lymph nodes. Went and had ac/t chemo, then double mastectomy and reconstruction. Stage 3A. Wow your cancer is gone. Had a rash during reconstruction and it turned out to be cancer which I even asked the doctors if it could be cancer and was told no. When I had my expanders in they had shifted and when they put my implants in they put the left one in the wrong place. Plastic surgeon came in and said that is not where I wanted them come back in 6 weeks and we will re-do. I was back in for re-do in two weeks cause I needed to get back to work. I have been in pain since then and that was 7-11-7 so you can understand why he will be paid last. Then in 10/07 I went to a dermatologist to have the rash checked out and told him at least we knew it was not cancer. Wrong...now I am stage 4 with metastatic adenocarcinoma. My cancer is on the outside of my body so we can see if it gets better or not. Have new wonderful oncologist and have been on lots of chemos since 11/07. Hanging in there but getting tired. Sorry for the long short story. Every day I say......Lord, keep your arm around my shoulder and your hand over my mouth. Sue    ",
      "MessageIndex": 4,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34444,0.htm",
      "Title": "Hi I am Carol"
    }
  ]
}