{
  "AuthorID": "Linda_Lou",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
  "Posts": [
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Dear Hana, Please get the information that you need from your mother's doctor. Not knowing the facts exactly as they are will cause you more stress and grief. This is not the place to get medical advice but definately the place to get support. I know how afraid you must be right now. Talk to your family and friends and especially your mom. Life would go on even without your mom but cherish each moment with her. Even if the lump is another cancer I am sure they will treat it promptly. Just make sure that you and your mom are very involved with her health care and educate yourself as much as possible. The book \"Living Through Breast Cancer\" by Carolyn M. Kaelin, M.D., M.P.H. is a wonderful resource written by an oncologist breast cancer survivior. Best of luck to you and your mom. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8146,0.htm",
      "Title": "i am so Scared For my Mom!!!"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Dear Victoria, My heart goes out to you for what you are facing.  We all live with the fear that the cancer will return.  I am sorry that you have to face this again.  You sound so strong.  I am sure you do not feel that way at times, but you still are.  I wish you the very best on your fight for your life.  I hope you get the very best of care and have family and friends to support you. Best Regards Linda L.",
      "MessageIndex": 1,
      "PostDate": "14/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15185,0.htm",
      "Title": "had biopsy 8/7/07...it is cancer again!"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Dear Kimberly G., Thank you so much for your thoughful response that meant so much to me. I have never joined a support group or even talked with another woman who has gone through treatment for breast cancer. This is the first time that I looked for a message board on-line or even looked anything up. I thought that no one was going to answer my question...so I was so happy and tearful to see your response. I am 54 years old now and was 51 when this treatment started. They took 13 lymph nodes and three of them had cancer..so I worry. My doctor says it will be four more years on Femera unless something else comes up. Other than the joint pain and hair loss the Femera is easier to take than Tamoxifin...for me anyway I felt like I was taken off of mild chemo. I participated in a drug study during chemo treatment with Xeloda, a drug only approved for advanced breast cancer. They want to see if it helps earlier breast cancer patients. It was a very difficult treatment because I took it in addition to all the other chemo drugs(Adriamnycin, Cytoxan, and Taxotere...Yuk! Have you taken Xeloda before? Have you ever suffered from nerve damage in your hands and feet? I got a severe case and have to take a drug called neurotin to manage the pain. It works pretty well as long as we can keep the dose down...on a higher dose it kills my creativity and I am an artist..so that is not good. I am thankful for the the non-narcotic help with pain management, though. I hope and pray for you that your new treatment will keep you safe. Your kind words and your incredible courage have helped me especially right now. I too will call Femera my miricle drug. (I started in Feb. too.) The study they stopped early so we can take it sure looks promising. Sorry for all the questions. It is obvious that I haven't really talked to another woman going through treatment accept just hello and so forth in the treatment room. I am lucky to have supportive family. Just one more question...if you don't mind answering; how did you learn that the cancer had spread to your bones? I have bone pain as it is and I don't think I would be able to tell the difference. Thanks again for your kindness. I greatly admire your courage. Linda Lou",
      "MessageIndex": 3,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7536,0.htm",
      "Title": "Hair Loss From Femera"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I started Femera after a lumpectomy, six months of chemotherapy, and thirty-one treatments of radiation, plus 2 1/2 years of Tamoxifin for stage two hormone receptor positive breast cancer. I have had slow but steady hair loss since starting Femera with an initial severe bout with joint pain which has settled down but still there. My doctor thinks that my hair loss is probably from Femera but can't tell me whether it will slow down or what will happen with it. My hair has gotten very thin. I just got my hair to chin length after chemo and now it looks terrible! I am thankful for the treatment but can't help from mourning for my hair. Has anyone else had this problem??? Thanks, Linda Lou",
      "MessageIndex": 0,
      "PostDate": "31/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7536,0.htm",
      "Title": "Hair Loss From Femera"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Hi Christine, Thank you for your response. I am so glad to hear that you are doing better on Femera. I'm sorry you had to have another surgery because of Tamoxofin. I do not have a uterus so did not worry about that anyway. The drugs are scary...but are saving our lives. When I went off of Tamoxofin, I felt like I was taken off of mild chemo! But I did not have the hair thinning until now. I am at lindalhoule on comcast.net. I have a hair appt. tomorrow to get advice from my hair dresser and get it cut. Hooray for grandchildren!! They do not care if I have thinning hair. Ha. Thanks so much, Linda Lou",
      "MessageIndex": 7,
      "PostDate": "14/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7536,0.htm",
      "Title": "Hair Loss From Femera"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Just an update on the Lovaza (prescription fish oil) I have been taking for a month and 1/2 now.  The joint pain continues to lessen each and every day.  I am riding a bike now.  My hands are no longer like \"claws\" in the morning.  Everyone can tell just by seeing me that I am better.  My original message is the first response above.  My primary Dr. put me on this.  I have since seen my oncologist and he was amazed that it helped so much and he knew nothing about how it might help joint pain. Linda Lou",
      "MessageIndex": 7,
      "PostDate": "27/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21548,0.htm",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Hi Marjen, I continue to improve daily.  I suffered so badly, especially in the morning...hands, wrists, elbows, knees, ankles.  I picked up a stack of two plates and thought I broke my wrist it hurt so bad.  I am even starting to forget how terrible the pain was.  I was worried that it was too good to be true, but so far so good (over a month and 1/2).  I was amazed that my oncologist knew nothing about this.  He was impressed though, and did extra blood work (don't really know what) to make sure levels of whatever were ok.  Haven't heard anything...so must be good.  As I said, my regular doc prescribed this.  I sure hope that you can take the Lovaza and it will help you too as Aromasin inhibitors are clearly the best treatment.  I am relieved to stay on Femara.  I would have kept taking it even with the pain.  I took Tamoxofin for two years and now Femara until Sept. 2010 unless they change their minds before then.  I completed treatment Nov. 2003 for Stage II hormone receptor positive and so far so good.  I sure hope you find relief for your pain. Best wishes to you. Linda Lou",
      "MessageIndex": 9,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21548,0.htm",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I am not a doctor, but I can tell you about my experience with the joint pain from the Femara I take.  Symtoms sound the same as yours.  My Oncologist asked me what made me think that Femara was resposible for the joint pain.  I said because I didn't have it before I took it....duh!  Goodness, they act like they have never heard of side effects from these drugs.  I am not saying I am going to quit it, just some help, please.  My family doctor started me on Lovaza for high cholesterol (Omega 3 acid ethyl esters or in simplier terms refined highly potent fish oil)  He said this may help your joint pain because he had talked to a Rhumatologist (spelling?) that was prescribing it for arthritis pain.  It started to help RIGHT AWAY!  I still have it, but toned down to where it has totally changed my life. I was blown away that my Oncologist never suggested this for joint pain....so I am going to ask him when I go in for check up this month.  I don't know what it has done for my cholesterol yet, as I just had my blood drawn this morning after one month of treatment.  I never had high cholesterol before Femara either, but I know what my Oncologist would say about that, also, so why bother. Anyway, I have never seen anyone talk about the Lovaza for joint pain on this site before, so hopefully my experience can be of some help to others. Best wishes to you. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21548,0.htm",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "You may or may not lose your eyebrows.  I asked the doc if I would lose my thick long eyelashes and my eyebrows....he said, \"I don't think so.\"  Every single hair fell out.  I used eyeliner to make up for not having one eyelash left, and I used a sharpened eyebrow pencil using short quick strokes to fill in the eyebrow.  Use your eyebrow pencil (brown, not black!) and hold it straight up from the inside corner of your eye and this will tell you where to start your eyebrow.  It takes a little practice, but it looked pretty darn good.  By the way, all of my eyelashes grew back and the ends of my eyebrows seem shorter so I lengthen them a little....but I understand this could just be my age too of 55. Best of luck to you.  Keep your chin up. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20971,0.htm",
      "Title": "Eyebrow \"replacement\"?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 1/25/2007 Mamajlojules wrote: I am going into my 5th year (July 07 will be 5 yrs) from having breast cancer.  I had 1.1 cm, small early stage, HEU2 negative, estrogen positive, had no chemo/radiation, but was put on tamoxifen in 02 then switched to arimidex 04.  My ? is I have had a lot of hair loss and have gone to dermatologist after dermatologist asking ?s...  My oncologist says its unrelated to the meds but I think it is.  She knows I need to stay on it so wouldn't say yes.  Derm said it is early female pattern loss.. i've read up on that and a dr actually said the enzyme \"aromatose\" which is what arimidex is, can cause female pattern.  It seems logical as my estrogen is being depleted daily and its driving me crazy.  I'm considering going off meds now even tho i have 6 mos to go... believe me i know that may be stupid but i dont have a life now even if the cancer does come back.. either way i'm screwed, either deal with this and it will get worse and be more humiliated or go off it and hopefully i wont get cancer again.  Thing is I DONT KNOW IF IT IS THE MEDS, can only assume but all other tests are negative for anything else. PLS CAN ANYONE TELL ME IF THEY TOO HAVE HAD THIS EFFECT FROM tamoxifen/arimidex.  I dont know what to do.  I know this is my life and I shouldn't go off it as my life is more important than my hair, but my daily life and how i feel about myself is just as important.. I just need a dr, anyone, who can tell me if they think this is meds.. and given my case, would it be safe to go off now...   someone told me if i've gone over 4 yrs, the meds have done what they are supposed to, but yet 5 yrs is the norm... pls can someone help me. this has ruined my life, i'm seeing a therapist monthly, on anti depressants, etc....  i truly believe going off meds would give me some relief to see if it will improve.. PLS PLS PLS HELP ME.. I have even considered a transplant and I dont know what to do... PLS help me. someone... I, too, have had hair loss. I had stage two breast cancer with two lymph nodes with cancer. I had a lumpectomy, six months of chemo (plus I participated in a drug study), and 33 treatments of radiation. so far, so good.  Because I was homone receptor positive, I was taking Tamoxifen for 2 1/2 years and switched over to Femera about a year ago.  I did not experience the hair loss until I started taking Femera.  It started slowly and I thought I was just having a shedding period in the winter.  My hair got dull and kept falling out.  My oncologist said it could be from the Femera, any other of my medications, or other factors.  My hair loss was mainly at the back and sides toward the bottom, plus my hair line in the front.  I had my hair grown out to nearly touching my shoulders, so it was upsetting.  I saw myself in a mirror in the dept. store and saw that you could see right through my hair (the part hanging down past my ears) I went out to my car and had a total melt-down!  Luckily, my hair loss on top was on the least amount of it all.  I went to my hair dresser and she said, \"Let's get rid of this.\"  So, she cut my hair in a short bob which got rid of the see-through hair hanging down.  Made my hair look much thicker and I was able to keep the long layer on top.  My hair since seems to have stopped falling out. Just normal daily hairs in my brush for the past month or so.  I am hoping that it has stopped.  I think I am seeing short hairs growing back at my temples.  I believe I lost over half of my hair on my head.  I do believe it is from the Femera.  I did not have a problem with hair loss on Tamoxifen.  I did feel like I was taken off of mild chemo when I stopped Tamoxifen, though.  I think the hormonal change is what causes hair loss in some women.  I remember I lost a lot of hair when after I had my daughter.  I took Tamoxifen for 2 1/2 years and am scheduled so far to take Femera for an additional 4 years.  I personally would not consider going off of this drug unless something new comes about in the next three years.  Take advantage of the newest cutting-edge treatments that are available to us here in the Untied States.  You only have six months to go.  They could be the six months that save your life.  Whatever you decide, good luck and best wishes to you. Linda Lou",
      "MessageIndex": 4,
      "PostDate": "29/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9098,0.htm",
      "Title": "please someone answer a ? - if you have had same thing happen or if you know anything that can help me"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I, too, believe that HRT was a large factor in my ER Positive breast cancer.  I took it by pill for years and was told it was safe right up to when I was diagnosed.  I completed treatment 3. 1/2 years ago, then Tamoxofin, now Femara. No history of any kind of cancer that I can find in my family.  Had my daughter when I was 22 and breast fed.  In my heart I really believe that it was a combination of factors, though.  I smoked some on and off for years.  I also believe emmission pollution is a factor.  I also believe that stress to some point also was a factor.  I spent all of my 30's taking care of my sweet husband who ultimately died from complications of kidney disease in 1990.  At that time there was not much support talked about for caregivers only the patient......so I suffered silently with no time for myself that whole time at such a tender age and became a widow at age 38.  I take every day as a gift now, but always wonder what caused my cancer, as I am sure everyone else does!  Good topic.  I hope more people answer to get more input on personal feelings about what may have caused their cancer.",
      "MessageIndex": 2,
      "PostDate": "22/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12213,0.htm",
      "Title": "What do you think may have caused your breast cancer?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I have multiple side effects, but I still go on as I believe it is obviously the best choice of treatment.  I just wish the Oncologists would be more receptive to the complaints.  You may not experience any side effects at all.  The women who don't experience side effects probably don't write in about it. Best of luck to you, Linda lou",
      "MessageIndex": 1,
      "PostDate": "07/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26884,0.htm",
      "Title": "positive feedback on aromasin"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Dear Marybelle, My heart goes out to you as you must feel so helpless being so far from your twin.  I can't offer any medical advice, but I think you need to go to her side, if you can.  You two need to be with each other, I am sure.  Best of luck to you and your twin sister.  I am so sorry. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20910,0.htm",
      "Title": "another pill, Aromasin"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 1/31/2007 Kimarie wrote: I am probably making a mistake but I quit taking femara last night.  I am going back on tamoxifin.  But if I dont start feeling like my old self, I will probably quit that too.  I want to feel normal again.  I want to lose this added weight.  I dont like feeling depressed and angry and on the edge.  I just want to go back to a normal life. Kimarie Dear Kimarie, Please consider that some of your symptoms could be from menopause (either forced menopause from chemo or just menopause, I don't know what your situation is.)  I felt like I was taken off of mild chemo when I stopped tamoxifin after 2 1/2 years.  Since being on Femara, I have lost a lot of my hair and have suffered bouts of joint pain.  But, I never felt depressed, angry, or on the edge as you have stated.  Please talk to your doctor about your feelings and reconsider your options.  Best wishes to you with what ever you decide. Linda Lou  ",
      "MessageIndex": 1,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9257,0.htm",
      "Title": "I have decided to Quit Drugs"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I took estrogene alone for years (no uterus).  Diagnosed with Stage II hormone receptor positive invasive breast cancer.  Lumpectomy, 13 lymph nodes (two had cancer), 6 months of chemo, 31 treatments of radiation.  Then Tamoxafin, now Femera. Five years out from treatment this month.  Permanent nerve damage.  Joint pain from Femera.  Does anyone know if there are any lawsuits going on for estrogene alone? Thanks  ",
      "MessageIndex": 0,
      "PostDate": "16/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18028,0.htm",
      "Title": "I took Estrogene alone..lawsuit or not?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Thank you for your response.  I greatly appreciate your input and information.  I am laughing at myself for my spelling of Estrogen.  I know how to spell words but they don't come out right sometimes and I don't see it.   I used to be good in language arts before chemo and now I can't spell half the time.  If that is the worst thing that happens to me today...I am doing good! I'll wait to hear more information from you.....I am sure a lot of us will be waiting to hear from you.  Thanks for the help.",
      "MessageIndex": 5,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18028,0.htm",
      "Title": "I took Estrogene alone..lawsuit or not?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "You may be experiencing neurapathy, nerve damage from chemo drugs or a temporary side effect.  You need to tell your Oncologist about this.  I have the neurapathy in my hands and mostly my feet.  I have pain with the numbness and have to take meds.  Good luck on your treatment! Linda Lou",
      "MessageIndex": 1,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19789,0.htm",
      "Title": "numb feet"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I can't tell you how to get new insurance in another state, but I can tell you not to let your insurance lapse for very long. Make sure and keep the proof on insurance that your current insurance co. will provide you so you can have coverage for your \"pre-existing condition\" otherwise they can deny you coverage for it. Can your existing insurance co. refer you or help in any way. Good luck to you. Linda Lou",
      "MessageIndex": 2,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7631,0.htm",
      "Title": "Future Insurance??"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I can't tell you how to get new insurance in another state, but I can tell you not to let your insurance lapse for very long. Make sure and keep the proof on insurance that your current insurance co. will provide you so you can have coverage for your \"pre-existing condition\" otherwise they can deny you coverage for it. Can your existing insurance co. refer you or help in any way. Good luck to you. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7631,0.htm",
      "Title": "Future Insurance??"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I can't give you any medical advice, only a reply to your reaching out.  The waiting is awful.  I hope that you and your sister have found out what is going on by now.  That just sounds like a strange way for a doctor to end a visit....although Oncologists are a different breed, that is for sure.  I think they mean well, but can be so abrupt. Knowledge is power.  Once you know what you are dealing with, you will feel more in control. Best wishes to you both, Linda Lou",
      "MessageIndex": 1,
      "PostDate": "14/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22920,0.htm",
      "Title": "25 y.o. sister told to \"prepare for cancer diagnosis.\""
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "My Oncologist prescribed Vagifem estradiol vaginal tablets 25mcg vaginal tab applictor.  I use it only once a week as I think less is better.  It puts a small amount of estrogen just where you need it, without going through your blood stream.  I understand there is a cervical \"ring\" that emits a small amount of estrogen, also.  My Oncologist says it is safe, if not over used. My side effects were so bad that I would bleed just from a pelvic.  Now I can enjoy being intimate with my husband....well lubricated, though.  The other side effects of Femara...I just deal with as best I can. Best of luck! Linda lou",
      "MessageIndex": 1,
      "PostDate": "05/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26803,0.htm",
      "Title": "femara and side effects"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Hi, I have been on Femara for 18 months.  I had an initial bad bout with joint pain...I could hardly walk with a cane within days of starting the med.  This happened over a long weekend and my regular doc was gone and the nurse for the other doc told me to start taking long walks and it would get better.  I said, \"which part of I can't walk do you not understand??\".  So, I just got angry and made it throught the long weekend.  My doc wanted me to stop the med to see if it got better, but it was better already.  I still have bouts of pain especially in my ankles and wrists.  It has gotten less severe over time.  I also lost about half of my hair over a six-month period at the beginning.(not like chemo, though.)  Again, the doctor is vague about if this is the Femara causing it.  (Don't know what else it could be!)  Anyhoo, my hair is coming back in and the shine in returning a little.  Not fair after just getting your hair to chin length from chemo!  So, my hair dresser gave me a short cut to deal with the hair loss.  It is growing fast now. I think that the doctors don't want to admit that some of these things that happen are from the drug because they are afraid we will stop the drug.  I have no intention of stopping the drug.  I believe in it that it will help keep the big C away for now.  Hopefully there will be something else for us to take when we come off of this one.  Hang in there.  Hopefully your symtoms will lessen also, for a time anyway.  Best of luck to you.  ",
      "MessageIndex": 2,
      "PostDate": "16/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12012,0.htm",
      "Title": "Aromasin pain"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Check out the joint pain discussion on page 2. Best Regards, Linda Lou",
      "MessageIndex": 1,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22491,0.htm",
      "Title": "Does Jt. pain go away when stopping aromatase inhib?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 3/15/2007 Pinkribbon wrote: I was wondering if anyone has experienced the pain in and on their hands and feet while taking the zeloda drug? I have stage 4 breast mets to the sternum,lungs,and liver. I am going for an ultra sound-- already went for the CT, they think now my left ovary has something. Recent exam was very painful on left side but originally went in because of pain on the right side. I can barely use my hands and it is hurting to walk. This is only my fifth treatment and I have read people are on it for years. I wear tons of creme on my hands and feet. I even bought gloves to wear during the day and driving. Any suggestions are welcome, I have been on all the strongest chemo dr;ugs and can no longer have radiation because I reached the maximum dosage, at least for the chest area. Thank you, Bette Hi Bette, I participated in a  drug study involving Xeloda to find out what effects (good or bad) Adriamycin and Cytoxan followed by Taxotere alone or Taxotere and Xeloda have on early breast cancer.  I took the Xeloda.  It was difficult treatment with the additional drug, but hopefully, something good will come of the study.  So far, Xeloda is only approved for advanced breast cancer.  I was treated for stage II invasive breast cancer, hormone receptor positive.  I had lumpectomy, 13 lymph nodes removed (unfortunately 2 had cancer cells, thus the stage II description) 6 months of chemo therapy, and 31 treatments of radiaiton.  I took Tamoxafin, then switched to Femera a year ago.  I lost half of my hair with the Femera, but it has finally stopped falling out. What type of symtoms other than pain are you having with your hands and feet?  Do you have blisters?  I did not get blisters, but became very \"thin-skinned\" on my hands and feet with burning pain.  Could not stand to touch anything warm let alone hot.  My hands and feet were red and hot to the touch by other people.  I was so thin-skinned that a butter knife went right through my finger when my hand slipped cutting toast! i would bleed when trimming my toenails.  I also got neuroapathy (nerve damage to hands and feet) real bad. I remember the doctor having to bump back the dose of some of the chemo on my last treatment because of side effects.  I don't remember what, though.  I was pretty \"out of it\". I completed treatment end of 2003 but still have to take neurotin (meds usually used for seizures) for the pain managment.  Works pretty well, though. I talked to another lady on this site and she is taking Xeloda for advanced breast cancer, also.  She said her doctor lowered her dose of the drug and her hands and feet got better.  She had blisters. She also said she used udder cream on her hands and feet.  I assume that your doctor knows of your symtoms.  I am sorry for all that you have gone through.  You sound very brave and strong.  I wish you the very best and hope that you have family and friends to help you through. Linda Lou  ",
      "MessageIndex": 1,
      "PostDate": "17/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I think the vague headache you describe after chemo treatments may be from the steroids they usually administer with the chemo drugs.  Did you ask the nurses about the headache?  I would get a vague headache and feel jumpy from the steroids for the rest of the day, Best of luck to you. Linda Lou",
      "MessageIndex": 1,
      "PostDate": "23/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21224,0.htm",
      "Title": "would you get headachs from cemo?"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 1/1/2007 Woozzi wrote: Hello ladies, After reading thru postings, I quickly saw that I was not the only person to have atrophied skin kin down under.  I am 53 and had stage 2 breast cancer treatment in 1998, lumpectomy, chemo and radiation.  Then immediately started the 5 years of Tamoxifen, only to start another 5 yrs of Femara which came out just when Tamoxifen finished up for me.  So now I am into 8 yrs of this stuff and the atrophy has gotten bad.  I had taken up long distance biking post cancer and most of my activities in life (away from work) revolve around it. It is hard now to spend 20 miles on a bike let alone 75.  So I tried to take up running.  That is going pretty good but amazingly, I find that even by just running 10 miles, my vaginal skin gets aggravated.  I haven't had a mate for years  but am sure that when I am lucky enough to be blessed with one, sex will be painful.  A lttle rubbing in that area puts holes and tears in the skin that hurt for a week or two.  Yadda, yadda, you get the idea.  My gyn is aware of the problem and a few years ago she cut the skin where the clitoris is because it was fusing over.  The skin just fused together again.  I am not even sure what I am supposed to lok like down there anymore but I am sure it is all out of whack.  I now see ads for labia surgery.  Most of it is meant to be cosmetic but I am hoping there will be some available to me that will give me comfort.  Does anyone know if this condition will improve when I stop taking the Femara?  Right now, my gyn says there is nothing she can give me to treat it while I am on the drug.  So what can happen surgically and medication-wise when I am done with the Femara.  I can't wait. Woozz Dear Woozz: I am surprised that your doctor has not recommended anything to help your symtoms.  I take Femara too after 2/ 1/2 years of Tamoxifin.  I complained to my doctor of vaginal atrophy with tissues so delicate and thin that intercourse was not fun!  He started me on Vagifem, which is a tablet inserted into the vaginia with a applicator.  This is a small amount of estrogen placed in a spot where is needed without it going into your bloodstream.  I played around with the frequency of the dose and came up with once a week....less is better.  They say it can be used up to once a day and not interfere with what the Femara is doing for you but I thought...no way.  Still need to use lubricant, but all is well!  I also understand there is a ring that can be placed inside and it gives a small amount of estrogen also.  I don't have the inside plumbing to hold it in place.  Ask your doctor!  Good luck.",
      "MessageIndex": 1,
      "PostDate": "08/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8537,0.htm",
      "Title": "Vaginal Atrophy Problems"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 1/30/2007 Janie Rocks wrote: Hello ffrom Illinois.  My name is Janie and I have BC with mets to the bone for nearly two years- have been on Faslodex, Taxotere, and now for 5 months on Xeloda.  Hand and foot syndrome has caused dosage to be lessened by 60%, but still have some symptoms.  Does anyone have a history with hand and foot syndrome and any advice?  Otherwise no symptoms so I hate to switch because of hand and foot. Hi Janie, I participated in a drug study involving Xeloda studying the effects good or bad of Adriamycin, Cytoxan, followed by Taxotere alone or Taxotere and Xeloda have on breast cancer.  I was chosen to take the Xeloda.  I had a pretty hard time with the added drug.  I had chemo for six months then 33 treatments of radiation which was a walk in the part compared to the chemo.  I believe I had hand foot syndrome although no blisters...just felt like blisters!  I am still taking medication for neuroapathy which shows no signs of letting up after three years.  Sometimes I think it is hard for the doctor and the patient to tell the difference between the two maladies if there is not a breakout of blisters.  What are your symptoms? Best wishes and good luck to you.  Linda Lou    ",
      "MessageIndex": 1,
      "PostDate": "31/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9234,0.htm",
      "Title": "hand and foot syndrome for xeloda"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "Hi Mietie, I take Femara after taking Tamoxofin for two years after treatment.  So far, now 5 years out from treatment, I am cancer free.  Most likely, you probably won't experience hair loss from the Femara.  I did, but I understand the chances are low.  My hair was almost to my shoulders again after chemo.  When I started Femara, I had a slow thinning and loss of lustre of my hair.  It got bad enough that I had to get a short haircut again, which I wasn't happy about.  But, my body must be adjusting to the Femara, because my hair is growing back in and is almost back to normal, not quite, but good enough!  My breast cancer is hormone receptor positive.  Your's must be both negative and positive?...because of taking Herceptin and then Femara??? Don't worry too much about the chance of hair loss with Femara...it probably won't happen to you...even if it did...we are still here.  Best of luck to you with your treatment.  Keep your chin up and enjoy every day with or without hair. Best Regards, Linda Lou",
      "MessageIndex": 1,
      "PostDate": "27/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21388,0.htm",
      "Title": "Femara and return of hair after chemo"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 9/30/2007 Bob Bon wrote: I have been cancer free for five  and a half months. I was on tamoxefen for two years and aromasin for three years.   I will continue with my aromasin until advised otherwise by my doctor. My problem is hair loss.  Does anyone out there  have  this problem?  Does anyone know what can help? I had sixr ounds of chemo in2002. My hair came back very thin.  It has gotten worst every year.  If anyone has any suggentions please  write.thanks bogey   Hi, Just read your message.  My hair came back fine after chemo.  Then I took Tamoxefen for two years, and am on Femara now.  I started losing my hair after being on Femara....not by the handful..but just a lot in the sink when styling my hair and in the shower drain.  I lost most of it around the bottom and at my temples.  I had gotten my hair to shoulder length after chemo only to lose it again!  At one point you could see right through my hair hanging down.  So, I got it cut short again.  Of course, the Dr. said he didn't know what caused it....well I didn't lose my hair or have joint pain every morning before I started taking Femara. Anyhoo....my hair is coming back in!  I don't know if it was just time for it to come back in or if the shampoo and conditioner my daughter got me has something to do with it??  Who knows.  I am going to keep using the Nioxin.  I like it anyway...makes your scalp tingle. You can find it at beauty supply stores.  Hope you do well.  Best Regards.",
      "MessageIndex": 2,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16647,0.htm",
      "Title": "hair loss"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "  On 6/6/2008 charmed1058 wrote: I'm not at all happy with this, markings for the radiation therapy. I'm allergic to inks/dies and adhesives of any kind. I'm opposed to the markings they want to put on my body for seven weeks and they are also suggesting tattoos but I'm not happy with that alternative either, is there ANY other way to do this without mutilating the patients body any more than it already is?????? I'm so angry and  upset that this HAS to be done and you have no choice in it at all, it's YOUR body for crying out loud  they've advanced  radiation therapy a lot in the many years it's been around,  find something that doesn't mutilate or make the patient feel uncomfortab le Dear Charmed, The only evidence I have left of radiation to my right breast is a tiny, tiny tattoo dot between my breasts.  There are a few other tattoo dots, but I can no longer find them. My right breast was firm for a few years from the radiation, but has now softened up. Of course, the scars from the lumpectomy and having 13 lymph nodes removed has left me with scars, but they remind me that I have survived.  Perhaps, you are not so angry about the markings or tattoos, but are very afraid and just plain angry at what is happening to you. I wish you the very best and hope that you have someone close to talk about how you feel. Best Regards,  Linda Lou",
      "MessageIndex": 1,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24745,0.htm",
      "Title": "Markings for radiation therapy"
    },
    {
      "AuthorID": "Linda_Lou",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda_Lou",
      "Content": "I participated in a Xeloda research study in 2003 for them to find out what effects Adriamycin and Cytoxan followed by Taxotere alone or Taxotere and Xeloda have on early breast cancer. I took the Xeloda. I have stage two breast cancer with no reocurrance yet. Following lumpectomy, six months of chemo, and 31 treatments of radiation, I took Tamoxafin for 2 1/2 years and now take Femara. Xeloda is approved for advanced breast cancer but not early breast cancer. They want to see if it helps early breast cancer patients from getting metastis. It was awful taking a fourth drug for six months of chemo, but hopefully they will learn something. Is there anyone out there in the same study? I understand there were 2,410 participants. Thanks! Linda Lou",
      "MessageIndex": 0,
      "PostDate": "30/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8055,0.htm",
      "Title": "Xeloda Research Study"
    }
  ]
}