{
  "AuthorID": "Linda66",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda66",
  "Posts": [
    {
      "AuthorID": "Linda66",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda66",
      "Content": "I haven't started treatment yet and am confused as to the different types of radiation and am asking you experts out there this question: If you had an old (seven years ago) stage one, grade one, 199% ER+ breast cancer (IDC) return and hide in your sternum... and knew the therapy was going to be hormone blockers and radiation...would you insist on one type of radiation as opposed to another?  If so, can you say why?   I've not yet started my treatments.  This is Tuesday.  On Friday I start.  Tomorrow I meet with the oncologist for a consult.  I'm not sure he will tell me the best type of rad to use as I know here in Victoria, BC, they do not have a sterotactic type of machine.  They do in Vancouver though and I can request to be sent over there.  I don't want to make anyone annoyed with me.  Everyone has made things happen so quickly for me so I'm aware that I may get someone annoyed if I say \"no thanks\" to something they suggest.   Am I making any sense?  Yikes. Thanks.",
      "MessageIndex": 0,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134261,0.htm",
      "Title": "stereotactic or conventional radiation??"
    },
    {
      "AuthorID": "Linda66",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Linda66",
      "Content": "Thank you for your response.  Good thoughts.  The person who recommended I consider the stereotactic approach is the partner of our friend who has been living with stage IV Renal cancer for a number of years now.  They also had some other type of medication that was considered new.  His cancer is completely different than mine, but I see on the site here that some peeps refer to sterotactic radiation and then others refer to basic radiation.   I'm starting to feel somewhat overwhelmed.  As you say, I will listen carefully to the Oncologist tomorrow and see what his recommendations are and go fromo there.   I hope you are well.   Again, thank you very much for taking the time to answer my post.",
      "MessageIndex": 2,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134261,0.htm",
      "Title": "stereotactic or conventional radiation??"
    }
  ]
}