{
  "AuthorID": "Lisa88",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lisa88",
  "Posts": [
    {
      "AuthorID": "Lisa88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lisa88",
      "Content": "Doctors always tell you not to go on-line about drugs.  Well, without the insight from \"users\" all of us would be duped into thining it was \"in our heads\".  I was diagnosed with breast cancer a little over a year ago. Had a lumpectomy and radiation.  If I knew then what I knew now I would have had a complete masectomy.   Went on arimidex for one year.  I was a 62 year old woman that was very active and able to work a second job.  That is done, although being physically active(walking, riding my bike, yoga,etc) does really help with the side effects.  My muscles and joints ached constantly, hot flashes , after I had been done with them, forgetting words, mood swings, etc.....  Went off for two months and things are improving. Now my oncologist wants me to go on Tamoxifen.  Haven't started taking them yet.  Just dont want to go through it right now.  Will decide in the next week.  The odds of it coming back are not significant enough for me to go back on.  Yet still a little scared.  This site has been extremely heapful for me.  Hope this is.",
      "MessageIndex": 7,
      "PostDate": "25/11/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,93741,0.htm",
      "Title": "side effects of tamoxifen and arimidex"
    },
    {
      "AuthorID": "Lisa88",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lisa88",
      "Content": "Last summer 2015 I had an lumpectomy and four weeks of radiation for stage one breast cancer with no lymph node activity.  The cancer was outside the milk ducts.  Was on two types of estrogen blocking drugs for 10 weeks.  Arimidex caused severe joint and muscle pain.  Aromisin headaches and chest pain.  Oncologist took me off both and may try another.  Since then have discovered spot in lung and irritation in middle lobe of lung.  I am being told that it may have been caused by radiation or drugs.  Also have developed dilated descending aorta on right side where radiation was done.  If I had it to over again I would have had a masectomy.  Still plan on living a long time but not happy with what is happening.  Anyone else experience this?",
      "MessageIndex": 0,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,89820,0.htm",
      "Title": "Radiation/Drugs Side Effects"
    }
  ]
}