{
  "AuthorID": "Littlepeasmom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Littlepeasmom",
  "Posts": [
    {
      "AuthorID": "Littlepeasmom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Littlepeasmom",
      "Content": "I just had a lumpectomy on Wedneday. the Dr also removed two sentinal lymph nodes, and because one came back from pathology (during surgery) showing cancerous cells, she took all my lymph nodes out from under my arm. This is what hurts the most and I got to come home from the hospital with that oh so fun drain too! My question is - because one sentinal node was cancerous - will the others be cancerous too? If some are - does that mean cancer spread somewhere else? They did MRI's, PET Scans, bone scan etc and told me it looked like nothing had spread - now this and I am freaking out. Or, if the nodes are positive, what does that mean treatment - wise? Will i ever be cancer free? Thanks!",
      "MessageIndex": 0,
      "PostDate": "15/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7279,0.htm",
      "Title": "Lymph Node Question Please!"
    },
    {
      "AuthorID": "Littlepeasmom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Littlepeasmom",
      "Content": "Hi All, I just had a lumpectomy on Wedneday. the Dr also removed two sentinal lymph nodes, and because one came back from pathology (during surgery) showing cancerous cells, she took all my lymph nodes out from under my arm. This is what hurts the most and I got to come home from the hospital with that oh so fun drain too! My question is - because one sentinal node was cancerous - will the others be cancerous too? If some are - does that mean cancer spread somewhere else? They did MRI's, PET Scans, bone scan etc and told me it looked like nothing had spread - now this and I am freaking out. Or, if the nodes are positive, what does that mean treatment - wise? Will i ever be cancer free? Thanks!",
      "MessageIndex": 0,
      "PostDate": "15/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7278,0.htm",
      "Title": "New-just Had Lumpectomy-lymph Node Question"
    }
  ]
}