{
  "AuthorID": "livinglarge",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/livinglarge",
  "Posts": [
    {
      "AuthorID": "livinglarge",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/livinglarge",
      "Content": "On Mar 11, 2013 6:33 PM Katrinadolls wrote: I had reconstruction that worked, but like most of us the other one was sagging, so my plastic surgeon (a women ) did a breast augmentation on the saggy one, very good, a little smaller than my reconstructed one but with a small pad in my bra it looks great. Made a big difference in how I felt! I can now wear t-shirts. I however have a different problem, I have chest pain on the side of my surgery, it took about a year to start, it is a burning feeling first, then awful pain that is like a knife across my chest, it doesn't last too long and to describe it better it is like an awful Charlie horse then the pain leaves but you can still feel where it has been. This happens very sporadically, some times two days in a row, or once in two weeks, or it has even happened an hour apart. Just about the time I think it is gone it happens again, and a lot of the time it is in the early morning (3AM) and never while I am active, and once when I was driving, had to pull off the road! The Dr.s have tested for almost everything, heart, back, spin, stomach, intestines, you name it! I call them muscle spasms, but they are bad! HAS ANYONE ELSE HAD THESE??  I have chest pain on the side of my surgery, it took about a year to start, it is a burning feeling first, then awful pain that is like a knife across my chest, it doesn't last too long and to describe it better it is like an awful Charlie horse then the pain leaves but you can still feel where it has been. This happens very sporadically, some times two days in a row, or once in two weeks, or it has even happened an hour apart. Just about the time I think it is gone it happens again. I have test etc. and no explaination. I'm not complaining any more I'm looked at like I don't know what I'm talking about. Livinglarge",
      "MessageIndex": 7,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70765,0.htm",
      "Title": "Uneven breast"
    },
    {
      "AuthorID": "livinglarge",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/livinglarge",
      "Content": "On Mar 06, 2013 2:06 AM Misssophie wrote: Can anyone give me advice. I am 64 yrs old. I had a mastectomy on right breast. Reconstruction failed. I am a D cup. Left breast is so droopy. I can't get them even with the PROSESIS. Is there something I can get that will lift my droopy breast. I can't wear sports bras, bathing suits, etc., my life is such a hassle trying to get even boobs!!! Any suggestions will be greatly appreciated!!! :) WELL WHAT ABOUT THIS, I HAD A LUMP WITH LOTS OF TISSUE REMOVED SO...SINCE THE HEALING AND NOW THE SIZE HAS COME DOWN, THEY ARE UNEVEN AND MY BRA IS MORE ON ONE SIDE AS IT'S NOT FULL LIKE BEFORE...I'M NOT LAUGHING ANYMORE AS MY BLOUSES SHOW IT TOO. LIVINGLARGE  ",
      "MessageIndex": 6,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,70765,0.htm",
      "Title": "Uneven breast"
    },
    {
      "AuthorID": "livinglarge",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/livinglarge",
      "Content": "On Dec 20, 2012 6:31 AM Makingway wrote: There is a website devoted to this issue it's called taxotears. There is a 6-8% risk of permanent hair loss when taxotere is the chemo regimen. It's unfortunate the doctors gloss over that fact. Especially so when hair loss can be prevented entirely by using a cold cap during chemo. Penguin cold caps and Elastogel caps are what is available to the public. THIS IS NOT FAIR THAT WE ARE NOT TOLD A LOT OF THINGS THAT MAY HELP US AND HURT THE CHANCE OF THEM...MAKE MONEY OR SEEM TO BE HEROS. IM SO SORRY IT HAPPEN TO ANY OF US. NOW WHAT CAN WE DO TO BE HELPED WITH THESE SIDE EFFECTS? AND WEIGHT GAIN FROM THE FERMARA AND OTHERS, ALONG WITH THE PAIN IN MY ARM AND SHOULDER WHERE I HAD THE LUMP ADN LYNODES REMOVED....HURTING MOST OF THE TIME, LIVINGLARGE",
      "MessageIndex": 20,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    },
    {
      "AuthorID": "livinglarge",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/livinglarge",
      "Content": "On Mar 25, 2012 6:56 PM maggie7 wrote: Hi Everyone, I'm also a breast cancer survivor and had problems with my hair after chemo (which I completed almost three years ago).  I have male-patterned baldness, similar to the way others have described it.  I also have hypothyroidism, and I am currently on Femara.  I'm curious if all of the survivors with hair not growing back after chemo have hypothyroidism.  I'd also like to know if anyone has had any success in growing their hair back.  I haven't found anything that helps -- except hats and wigs!  Take care, Maggie Hi Everyone ( Maggie), I too am a breast cancer survivor and finished chemo one two years ago. I'm now taking Femara and did have hypothyroidism before breast cancer. My hair was coming back fine at first and the top just stop and in the front my forehead. It was long not full full but completely covered. My Skin, taste, smell, sexual desire, all has changed not to mention my feet and hands hurt, memory is slow. 2/2011,10/2012 chemo/radiation, I am gaining weight, I'm darker all has changed and nobody has been able to say what can I do or anything. I just can't get right. Do any of you know or think of what maybe happening? Mood swings too, Livinglarge",
      "MessageIndex": 19,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    }
  ]
}