{
  "AuthorID": "Liz49",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz49",
  "Posts": [
    {
      "AuthorID": "Liz49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz49",
      "Content": "Thanks all for you input. My mom is in a brace to stabilize her spine. She is now getting radiation. The pain is gone. It is unbelievable she is like a new person. She will get 12 radiation treaments. I guess if i understand this correctly the radiation will shrink the tumor and the femera will cut off the estrogen in her body thus slowing down the cancer. Does anybody have experience with radiation treatment or er positive breast cancer? Thank you and god bless",
      "MessageIndex": 4,
      "PostDate": "17/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3719,0.htm",
      "Title": "Stage 4 Into Spine"
    },
    {
      "AuthorID": "Liz49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz49",
      "Content": "Sorry it has taken me so long to reply. My mom is doing better. She had 10 treatments of radiation and is taking Femara and morphine for the pain. For right now things are more in control. I think this is a day to day situation. Wishing you the best of luck.",
      "MessageIndex": 8,
      "PostDate": "27/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3719,0.htm",
      "Title": "Stage 4 Into Spine"
    },
    {
      "AuthorID": "Liz49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz49",
      "Content": "My mom has stage 4 breast cancer that has moved to her spine. Tumor ate thru her vertebrae. They performed a kyphoplosty. She is still in alot of pain. She had another mri now they are saying she may have bone spurs that could be causing all the pain. She is to weak for surgery so they will fit her for a brace and give her phyical therapy. She also has tiny mets in her left lung. Doctor has her on femara and says her cancer can be managed. My gut tells me she is dying. Does anyone have an opinion on this because i am confused.",
      "MessageIndex": 0,
      "PostDate": "11/12/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3719,0.htm",
      "Title": "Stage 4 Into Spine"
    },
    {
      "AuthorID": "Liz49",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz49",
      "Content": "My mother was diagnosed with ER Positive 4th stage breast cancer. It spread to her spine with tiny mets to the lung. Doctor gave her radiation and treated her with Femara. Now the lung mets have grown and the lump on her breast also. The Femara is not working. She is in her seventies so I am wondering how this will be treated. Doctor was orginally very confident that this drug would do the trick. She had a CAT scan and we are waiting for the results. Does this mean her cancer is not ER positive.",
      "MessageIndex": 0,
      "PostDate": "03/02/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4371,0.htm",
      "Title": "Femara Not Working"
    }
  ]
}