{
  "AuthorID": "Liz_p",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
  "Posts": [
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "I'm glad you are feeling better now. Another doctor recently asked whether they had cultured the infected fluid/area to see what the infection was, and when I told him no, he immediately swabbed the area and sent it to the lab. The finding of staff (a very common bacteria on human skin) told them that it had entered the wound during or after the surgery, when the wound was accessible since the incision was not yet healed. That's why they know it was there prior to radiation. And, after surgery the tumor bed naturally fills with fluid (the body's response to the newly created \"hole\"), and then the radiation \"cooks\" it and makes it become a problem. I've learned at this point that doctor's typically react to symptoms rather than considering the possiblity that the stereotypical course of action may not be the correct one at the time. Best of everything to you. Liz",
      "MessageIndex": 2,
      "PostDate": "08/02/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "Catherine, I love your story! I left town about after my radiation as well. It was about a week after radiation had ended, and I was going to spend some time with my parents as a \"reward\" for all the fun and games with medical stuff during the previous months. In fact it was the day I was to leave town that I began experiencing the pain of what would become the abscess. Yes, I am very aware that the majority of women make it through surgery and radiation treatment without this kind of added complication. In fact, at first, I thought that the abscess I experienced was something that almost never happened. And that's when I began to explore the web even more to discover that it wasn't as uncommon as people want to believe. In addition, as you mentioned, the \"cancerhead\" part of my experience caused me great anger and frustration in so many ways, particularly with the added complications. My life basically fell apart--but that was because of my specific set of circumstances. I guess the bottom line is figuring out if there's any way my experience can help others in similar situations by either being forewarned, or having increased information to perhaps avoid the complications altogether. Now, one year after \"graduating\" from wound care, while I find myself in physical therapy to attempt to loosen the severly scarred tissue, I'm happy to say I'm in a different place emotionally. Sure, there are still those occasional days when I wish it had all just been a bad dream, but the reality isn't as stark anymore and life does move on. Hope you're doing wonderfully! Liz",
      "MessageIndex": 11,
      "PostDate": "23/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "Hi there, Yes, please keep in touch. You can find me at: --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html ----. I went to the emergency room the morning the wound \"popped\" but the surgeon said that he had hoped he could clean it there, but found once he saw me that he really needed to go ahead and admit me so he could have full access to an operating room. My wound was pretty large, so I think that's what he was thinking. According to the specialist, the radiation basically \"cooked\" the infection and caused the abscess. For the week between my abscess surgery and when the VAC arrived, they were packing my wound twice a day. It took an entire roll of 4-inch wide gauze to fill my wound each time. It was actually kind of funny when we would pull it out to clean the wound and re-pack. It just kept coming and coming as we pulled. My rad onc guy was amazed the day I was in his office for a re-check (after the abscess had happened), and the surgical nurse wasn't there yet to do the wound un-pack/re-pack. I just went ahead and started pulling out all the gauze. He stood there and just stared as I kept pulling out thing very long piece of fabric. The wound was up high on the right--it was kind of like having a very strange pocket right there attached to my body. I survived a lot of green salve that was very expensive as wound care progressed, plus they had to keep using a little knife to scrape away icky stuff that kept growing inside the wound between changes.....ouch! Hang in there....you'll be just fine!",
      "MessageIndex": 13,
      "PostDate": "23/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "Hi Mary, No, the surgeon did not place a drain in my wound for either surgery. Strange, don't you think? Liz",
      "MessageIndex": 9,
      "PostDate": "23/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "Hi Goeken, When my abscess happened, the surgery to clean the abscess was performed by the partner of the surgeon who performed the lumpectomy, since he was the one on call that Saturday. There was no specialist at that point. I also saw my radiation oncologist since I was scheduled for a follow-up exam (it was about 5 weeks after radiation had ended). He was fascinated to see inside the wound he'd just finished treating. Just a comment: at no time was a drain shunt ever placed in my incision after any of the three surgeries. After one week of twice-daily changes to the wound dressing (basic gauze and tape), my surgeons convinved my insurance company to allow (and therefore pay for) me to be placed on \"The VAC\" from the KCI company: http://www.kci1.com/867.asp, for a picture of a machine very similar to the one I \"wore\" for 4 months. The dressing involved pushing medicated foam into the open wound (that was fun!), covering the skin all around wound with plastic tape to create an airtight seal and finally placing a gadget on the tape that contained a small vented hole that faced into the wound, and had the beginning of a 3' length of rubber tubing on the other side. The rubber tubing was connected by another 3' lenth of tubing that connected directly to the machine's collection container. I wore the machine on a purselike strap wherever I went, or it sat next to me on the couch if I was relaxing by the TV, or it sat on my nightstand while I slept---all the while being connected to my wound. I had to be careful not to turn over while sleeping or I'd tangle in the tubing and the machine would make a terrible noise. I also had to plug the machine in at night to recharge the battery to allow me to be away from a plug the next day. The first day they taped me to the machine, they warned that when they turned the machine on for the first time, it would probably hurt since it was going to create a vacuum pressure to \"suck\" out the continually draining fluid from my wound. \"Probably hurt\" was the understatement of the year since when they turned on the machine I nearly fell to the floor with pain, and the instantaneous tears led the surgeon to say \"Well, it looks like we're going to need some pain pills.\" After having taken no pain meds throughout the previous surgeries, it was now something I could not avoid. My personal situation was such that I opted to stay with my parents for several weeks while the wound was healing and I was wearing the machine. Being on pain meds I couldn't easily drive myself to the wound care center 3 times each week. It was during my stay with my folks that I saw a specialist. His business card was filled with degrees and titles and he also was on faculty at the university's medical school. I went prepared with piles of medical records from my past treatment and it was he who told me that it was the radiation that caused the abscess. He said that it was a stapf infection that would have only had the chance to enter the wound at or soon after the time of surgery. He was in no way implicating my surgeon, but said that stapf is present on our bodies all the time, and could easily have worked its way into the post-surgery wound. At the time I saw the specialist, I had been on the VAC for about 6 weeks, and he told me the treatment appeared to be working well, that no hyperbaric treatments would be necessary (hallelujah). The problem with post-radiated tissue is that it's basically been fried including all the tiny blood vessels that promote healing. The vaccuum pressure created by the VAC was essentially forcing the tissue to heal by drawing new tissue through the fried tissue by virtue of the vacuum pressure....but, boy did it hurt! Yes it has been a year, but I wore the machine until nearly one year ago, and then finished the wound healing with some simple gauze and tape along with a special salve. At this point, I find that the abscess and resulting healing is what shrank the size of my breast (something that surgery and radiation had not done). At this point, I'm currently undergoing physical therapy (and more pain) as they try to soften the extremely hard areas of scar tissue all around the wound and throughout the breast. I still experience pain perhaps as the tissue continues to revive from radiation from so long ago, but also as the PT people knead the hard spots. The pain typically happens a few days after PT as I experience pain throbbing and pulsing deep inside the tissue. I'm still not comfortable with parts of the new me (mamed and irreparable). I still hurt deep inside my soul, and feel tremendous empathy for others who experience anything remotely like what I experienced. I'm so sorry for your pain and wish you the very best as they pack you full of gauze each day. Keep your spirits high, know that the wound will heal and all will be fine! My thoughts and prayers are with you... Liz",
      "MessageIndex": 8,
      "PostDate": "23/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "I received a diagnosis of non-invasive DCIS in June 2004. In July I had a lumpectomy and the two sentinal nodes removed neither of which had any signs of cancer. Raidation (IMRT) began in August and lasted six weeks (until 10/8/04). One week following radiation I developed a fever of 102 degrees with the typical alternating hot flashes and chills. I also noticed a marked increase in pain in my breast. A call to schedule an appt with my rad onc found that he was not in that day, so I met with his associate (who had never seen me before). He told me that I was probably just trying to fight off catching a cold or something since my immune system was basically non-existent after the radiation. The fever jumped most every night (102 or so) for the next three weeks, along with increased pain in my breast, until early one Saturday morning the previously healed incision popped like a pimple and a large volume of very smelly fluid began gushing out. A phone call to the on-call surgeon was followed by a quick trip to the emergency room and then admittance for yet another surgery to re-open the wound and clean out the infection. Now, some 10 weeks later I'm still dealing with what's left of my open and very hard-to-heal wound (residual effects of radiation). I recently met with a specialist who told me that the radiation caused the abscess. At this point, I am eager to chat with anyone who has also experienced a similar situation---abscess of lumpectomy, etc. Thanks...Liz",
      "MessageIndex": 0,
      "PostDate": "06/02/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    },
    {
      "AuthorID": "Liz_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Liz_p",
      "Content": "Hi Teresa, Yes, pain continues...and it varies in it's intensity for no apparent reason. Sometimes I would go for days or weeks with no pain, then would experience several days with pain. I just figured it was the breast tissue continuing to \"wake up\" and heal after having been fried by radiation. I've spoken with many others who also have had varied but ongoing experiences with pain. It does diminish over time...be patient. Perhaps a heating pad or soft massage would help.",
      "MessageIndex": 10,
      "PostDate": "23/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1546,0.htm",
      "Title": "Lumpectomy Abscess After Radiation Treatment???"
    }
  ]
}