{
  "AuthorID": "Lizanne1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizanne1",
  "Posts": [
    {
      "AuthorID": "Lizanne1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizanne1",
      "Content": "I experience tolerable side effects like you describe; however, I was on Arimidex and the side effects were much worse for me.  I felt like I was 90 years old.  Ached all over and could not even get out of bed in the morning I was in so much pain.  I told my oncologist I would not take it any more and she then put me on Aromasin which is better for me.  There is also Femera which I have not tried.",
      "MessageIndex": 40,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "Lizanne1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizanne1",
      "Content": "Has anyone completed the 5 years of Aromasin, etc.  After the 5 years does one get back to feeling \"normal.?\" or do you still have the joint and muscular pain?",
      "MessageIndex": 6,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21141,0.htm",
      "Title": "Need help please!"
    },
    {
      "AuthorID": "Lizanne1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizanne1",
      "Content": "Yes, in Feb, 2006, I went for my yearly gyn check up and the doctore found a lump in my right breast.  He immediately scheduled a mammogram and an ultrasound.  A few days later I had an ultrasound biopsy which was positive for cancer.  I then had to find a surgeon and my gyn recommended one to me which I was very pleased with.  I interviewed 3 before making a decision.  None will give you specific advice about whether to have a mastectomy or a lumpectomy.  I chose lumpectomy because the cancer doctor and the radiation oncologist said the outcomes and life expectancy would be no different. Hence, in March I had surgery for a lumpectomy and after many lengthy tests, Ct Scan, Pet Scan, Blood work, EKG and a mapping of the Sentinel nodes before surgery.   They removed the cancer and a large margin around it and after checking my sentinel nodes found 3 that were positive so they removed 23 apppoximately, lymphnodes.  Believe me this was a shock since there is no history in my family. They sent the results out for an indepth biopsy and found that the tumor margins were not clean and therefore they had to go back in again to get clean margins.  So in April I had another surgery which they basically gutted my breast.  I probably should have had a mastectomy then but I did not.   I filled up with fluid after the surgery in the breast and every week for 4 weeks, I had to have the fluid drained because it was bigger than my other breast and it hurt.   Eventually, it settled down and since the lump was on the side of my arm, I wear a little form inside my bra and no one knows.   In May I started chemotherapy for 4 months and lost all my hair and in October of 2006 I started radiation for 2 months.  When I started this whole thing the Oncologist said to me... Liz - your life is ours for 1 year and they were right. I am a nurse and I worked nights the entire time and never missed one night of work (12 hour shifts) only normal think in my life.   I guess I have said enough.  If you need more infor. let me know. Liz            ",
      "MessageIndex": 1,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21141,0.htm",
      "Title": "Need help please!"
    },
    {
      "AuthorID": "Lizanne1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizanne1",
      "Content": "PS -Having an ultrasound does not mean it is cancer.   It could turn out to be something like a cyst or adenoma where they just watch it.  It does not have to be cancer.",
      "MessageIndex": 2,
      "PostDate": "20/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21141,0.htm",
      "Title": "Need help please!"
    }
  ]
}