{
  "AuthorID": "LizaMarie711",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
  "Posts": [
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thanks so much for the reply, Im so happy for you cancer free...God Bless.  i feel like death now, horrible side effects from the chemo, Im on xanax for the anxiety helps somewhat, but more scared than anything else. Scared of all this pain, the nausea, and feeling like its never going to get better. They have given me naseau meds but they work for a bit, but just reading your message gave me hope that this will end and i wont feel so helpless forever. TY so much for the positivity, you sound great , and happy. i hope to get there i just think its going to be a long haul. Ty so much God Bless you",
      "MessageIndex": 24,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi my name is Liza, and like you this is all new too me also. When i first got diagnosed i was told the best decision due to my type of tumor , was a double masectomy with 7 lymph nodes removed, followed by reconstructive surgery.  I had the surgery Sept 19th started with the physical therapy getting the expanders filled , was always in some kind of pain but things were looking up ...then BAM you NEED chemo.  I thought at that moment the world would just collapse...and in my case after having a lot of anxiety attacks i feel it kind of did. I had my first chemo on Monday and since then have felt worse then ever, people keep saying it will get easier, i just dont see it yet. I wish yiou the best and hoping you do not need to go through the chemo, I think i would have been ok with all this if i didnt have to get chemo. That just depressed me to no end, and im still in a state of shock.",
      "MessageIndex": 27,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "I also have heard that after getting the shot the pain is worse thn the chemo, and you just confirmed that.  I will make sure to have plenty of pain meds hopefully that can work.  So your done or you have two more? Have you started experience hair loss yet? everyone is telling me to shave my head but i just cant push  myself to do that. you seem like your a tough girl and will get through this fine, i hope I m like you. Please keep in touch and i thank you so much for answering",
      "MessageIndex": 16,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "I cannot thank you enough for all this information that i am going to go look at now. You can never know enough and i feel i need to know as much as possible besides being scared to death , I feel i need to be somewhat educated on a short time on what im in for. thank you so so much for sharing, and for your prayers  ",
      "MessageIndex": 18,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi Linda and thank you so much for the concern, so much appreciated. The 5 days after the chemo were horrific, and i have 3 more to go, so god knows i am petrified. I do feel actually pretty good now, only pain is from the expanders. My hair started falling out Friday which has given me so so much sadness as i knew it was going to happen, i never thought so fast and my reaction would be so bad. Its coming out in like clumps just not from the root yet just i would say thinning out (A LOT) im scared to even touch it. I know it will get worse but im trying to take it one day at a time ,i have it up in a ponytail now so i dont touch it.  How did you handle your loss of your hair, even on anxiety pills, the tears just flow.  Love Liza",
      "MessageIndex": 47,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thank you so much for the info and the prayers... God bless you.....i think once i see it fall out i will be hysterical and shave it also.  Im so sorry about your mom, mine passed away when i was very young, its tough but your right its such a great thing to have each other. I thank you",
      "MessageIndex": 21,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Im at stage 2 and was initially told i probably wouldnt need chemo, but of course i did.  I think they were taking things slow with me as they can see my anxiety.  I also had my first treatment this past Monday....was and still am scared to death of the chemo.  I found it to be worse than the operation, but i want to live for my boys so i wasnt really handed a choice. You are feeling better??? I still feel like crap, just horrible and also am sitting here waiting for the loss of my hair. I wish i had some of yoiur enthusiasum, i just sit here and cry, it feels like such a bad dream",
      "MessageIndex": 29,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "were all in this together...somehow someway ",
      "MessageIndex": 33,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "thanks for your post, I am so so sorry you had gone through so much. You sound great now (which i am sure gives us all so much hope) ..The only problem i have with drinking is i have such a bad metal taste in my mouth that water tastes horrible, i do try but this lovely woman Jouyce on here gave me an idea on popsicles and that seems to work. God Bless you you fought the battle and won.....makes me at least feel so much better. Thank you for sharing :)",
      "MessageIndex": 43,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi Theresa, Im glad your back on here and that your healing up. Im right there with you \"chicken little\" Petrifird myself, but I have been talking to this amaing woman Joyce who told me one very important thing, and today when my hair started falling out i remember it...\" This to will pass nad you will be Alive\"  I cant answer your question as this is all new to me too. But my  prayers are with you",
      "MessageIndex": 44,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "i caNT THANK YOU ENOUGH FOR GIVING ME SO MUCH AND SUCH HONEST INFORMATION, I FEEL THE dR'S TRY TO SUGAR COAT THINS, BUT I KNOW ITS GOING TO BE HORRIBLE.  I am already on Xanax so i think they may have to give me something in the IV to calm me down. Wow i didnt even think about claritin, good idea i am def. going to use it.  God bless you, I had a double Masectomy to avoid the chemo but couldnt get away with it, tumor came back large so they said must do chemo. How are you now? How many treatements have you had. Monday will be my first of 4 over 12 weeks there giving me cytoxyn and taxotere followed by the shot the next day. I am so scared, id rsther go through another surgery.  I didnt know about the eye problems, thank you for that info too. I really dont want to be surprised by anything. Thank you and God bless you.",
      "MessageIndex": 7,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi, Im looking for advice, from anyone who can help. I had a double masectomy with reconstruction on Spet 19th. I still have to get chemo. 4 rounds over 12 weeks of cytoxyn and tamofere. I am more petrified of the chemo than i was of the surgery. I dont want to loose my hair but i know thats not AN OPTION. I have no idea what to excpect, other than what the doctors are telling me, Im a wreck. Please any info will help. I am getting my first round of chemo this Monday wich is also my 45th bday ughhh..l  thanks  ",
      "MessageIndex": 0,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "We are getting the same exact thing, perhaps we can go through this together because were also getting it around the same time. My first dose will be Monday, you said * am was that today? If it was i hope it wasn't as bad as i keep hearing....Sending good thoughts and prayers your way that you do well with this. My name Is Liza i live in NY i feel i have a great group of doctors but in my whole life i have never ever been more petrified, I know come Monday i will be a basket case. If you are up to it and have already had your first treatement can you please tell me how it was? I dont know anyone going through this so it's hard to relate , as much as people care they dont understand like someone who is going through it themselves. Hope all went well, and please if you can let me know. Thanks so much  Liza",
      "MessageIndex": 9,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Joyce TY so much for taking the time to let me know your experience as I am so so scared. I will def. be drinking tons of water. I also take the Apricot seeds as my friend Jason vale cured his own cancer by taking them till they arrested him for selling them online as a cure and he didnt have them for 5 years so his cancer came back, he is back on them and swears i dont need the chemo, if i take the seeds. i am all for the natural cures but also too afraid that god forbid 10 years later the cancer does come back , I decided on the chemo only for my 2 boys otherwise i dont think i woukd have even done it. But Now that i have decided I am so so scared and hoping i made the right decision  ",
      "MessageIndex": 10,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thank you Joyce so much for the info. I have Stage 2, I am so grateful for any info. I also am not a big water drinker but i will drink a gallon a day if it will help. Why were you back in the hospital if you were drinking the amount of water you should have been. I really do not want to see another hospital till i have to go finish the reconstruction. Thank you so much for the bday wishes,I guess ill never forget the day i turned 45.....How long did you have the chemo for and are you finished?  God Bless",
      "MessageIndex": 8,
      "PostDate": "01/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "You made me laugh with the bad hair day, but i gotta tell you i am totally fraking out that my hair is coming it. i wear it in a ponytail a lot, and i wont be able to do that for years, Ladies seriously those wigs are heavy even the professional expensive ones, how did you guys do it???? I cant Imagine wearing that wig in the summer, i always just threw my hair up and went out....i will take  back the bad hair days anytime.  I still cant drink the amount of water they want you too so also drink the 7-up and gingerale, and now that the metal taste is finally starting to subside back to my beloved coffee (ahhhhh) tillk the next chemo :(",
      "MessageIndex": 48,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "My hat is def. off to you......Your a survivor, and you've been through hell and back...GOD BLESS",
      "MessageIndex": 50,
      "PostDate": "17/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi thanks for the response im already on xanax....can you imagine??? They gave it to me when i was first diagnosed. Im sorry to hear of your diagnosis, compared to what i read about the chemo, i already had the surgery and it was not that bad, are you getting it with reconstruction, i did and now im glad i did that as it made it easier for down the line. Oh god i wish that there was a way i didnt have to do the chemo, other than pain actually just soarness from getting filled, the surgery is def. do able..The doctors told me i have no choice  thanks for the advice  ",
      "MessageIndex": 2,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "OMG with such little kids my prayers go out to you.. I feel so bad now worrying about loosing my hair when you have 2 babies and did it, and you are right its worth it to LIVE.  God bless you and your family please stay in touch i will do the same   Ty for the info. The more i know the better i am prepared , much appreciates",
      "MessageIndex": 17,
      "PostDate": "02/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thank you Theresa , praying that you do not have to go through the chemo. Not hearing quickly can sometimes be a good thing. Please let me know when you hear something, i will be thinking of you",
      "MessageIndex": 31,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thanks so much Bonnie  Hugs and Love",
      "MessageIndex": 55,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Thank you so much, I have to say i just got off the phone with a friend of mine who runs the organization \"Rocking the road for a cure\" great girl who also went through breast cancer at a young age. She told me holistic is great but DO THE CHEMO dont do it for you, do it for your kids. Still crying and still thinking even afet the phone call i cant do this, i just came upon your answer. After reading your story, if you can do it with a baby, and so young. I CAN and WILL do this. Thank you so much, i dont know who you are or where you are from but you are truly an Angel. I cannot thank you enough",
      "MessageIndex": 4,
      "PostDate": "12/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69095,0.htm",
      "Title": "Chemo after a double Masectomy"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "Hi all , My name is Liza I live in NY, I got the news that i had breast Cancer in August a month after my son left with the Marines, everything hppened so fast, anyway i opted for a double Masectomy as it would assure the cancer would not return. in the process now of getting reconstruction,l, with expanders put in right after surgery. I was dealing with this fine, until today when the ONcologist told me i need to have chemo, i had a nervous breakdown, he wants me to do 4 treatments every 3 weeks of cytoxan and taxofele, I am more petrified of the Chemo than i was on the surgery. I am so scared of loosing my hair and side effects. Im 44 years old and my test came back yes its needed. If anyone has any info please tell me good or bad, there is only enough xanax i can take to keep calm. Thank you all and god bless  ",
      "MessageIndex": 0,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69095,0.htm",
      "Title": "Chemo after a double Masectomy"
    },
    {
      "AuthorID": "LizaMarie711",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LizaMarie711",
      "Content": "What your saying sounds nto good to even be true, i dont understand what anliver detox is? can you privately email me this info please . Thx so much Liza",
      "MessageIndex": 2,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69095,0.htm",
      "Title": "Chemo after a double Masectomy"
    }
  ]
}