{
  "AuthorID": "Lizdep",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizdep",
  "Posts": [
    {
      "AuthorID": "Lizdep",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizdep",
      "Content": "I have a recurrence of breast cancer that came back as inflammatory. 2 years ago I was diagnosed with occult cancer -ie, no tumor. It was found in the lymph nodes and 13 out of 14 were positive. I had chemo and radiation and went to a naturopath in Canada for herbs and IV Vit C treatments -- 50 grams 3x/wk for one month. The recurence is inflammatory in the breast and 2 small spots in the sacrum and pelvis. so far all else is good. I am undergoing chemo - avastin and abraxane - going on week 7. I really want to do VIT C IV !! but am having a hard time finding someone in Central NY State that does it. Does anyone know of an MD who does this? Naturopaths aren't allowed to do it in NY. Thanks - I am also taking avemar and a lot of other vit/suppl;ements. Liz",
      "MessageIndex": 6,
      "PostDate": "21/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Lizdep",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizdep",
      "Content": "Hi Sue, I recenly read your message and would like to hear more about your Mom's treatment. I am 54 wwith 5 children and am concerned because I had an inflammatory recurrence to an occult breast cancer from 2 years ago - no tumor then so I did adriamycin/cytoxin and taxol fpollowed with lymph node dissection 13 out opf 14 nodes positive, then radiation. It came back as Inflammatoy with mets to bones and high chance of spread and/or recurrence - am doing abraxane (taxotere) and avastin but I'm very interested in the tretmanet you mentioned - raiki, acupuncture(to where?) and the antibody treatment. I take herbs from a naturopath is Canada and 2 years ago I took IV VIt c too from him. I'm also looking for an MD to do Vit C IV in Central NY. please respond - thank you Liz",
      "MessageIndex": 2,
      "PostDate": "21/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5355,0.htm",
      "Title": "Ibc Metastis to Lung and Bone Cancer - Help"
    },
    {
      "AuthorID": "Lizdep",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lizdep",
      "Content": "I have a recurrence of breast cancer that came back as inflammatory. 2 years ago I was diagnosed with occult cancer -ie, no tumor. It was found in the lymph nodes and 13 out of 14 were positive. I had chemo, lymph node dissection and radiation and went to a naturopath in Canada for herbs and IV Vit C treatments -- 50 grams 3x/wk for one month. The recurence is inflammatory in the breast and mets to a number of bones. so far all else is good. I am undergoing chemo - avastin and abraxane - going on week 9. I really want to do VIT C IV !! but am having a hard time finding someone in Central NY State that does it. Does anyone know of an MD who does this? Naturopaths aren't allowed to do it in NY. Thanks - I am also taking avemar and a lot of other vit/supplements. Liz",
      "MessageIndex": 0,
      "PostDate": "18/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8340,0.htm",
      "Title": "IV VIT c"
    }
  ]
}