{
  "AuthorID": "Lltj70",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lltj70",
  "Posts": [
    {
      "AuthorID": "Lltj70",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lltj70",
      "Content": "Sent you a private reply- I understand exactly what you are going through...",
      "MessageIndex": 1,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25534,0.htm",
      "Title": "New to this board and scared"
    },
    {
      "AuthorID": "Lltj70",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lltj70",
      "Content": "Well- had the lumpectomy today- it is not that bad. I am a little sore, but other than that, I am ok.  Now the waiting for the testing of the tumor. not fun.",
      "MessageIndex": 1,
      "PostDate": "02/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25570,0.htm",
      "Title": "Worried but dont know for sure..."
    },
    {
      "AuthorID": "Lltj70",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lltj70",
      "Content": "Approx. two weeks ago I felt a little bump on my left breast- and after calling the doctor and waiting for my period to go away (just so I knew it was not a false thing related to that), I went to the gyn. doctor. She scheduled me immediately for a mammogram, an ultrasound, and for a surgical consult. All of this mainly because both my mom and grandmother have had breast cancer (my mom is still on chemo- but two years later, no reoccurance so far). The mammogram came back negative, but the ultrasound showed a 3 mm mass. The surgeon said it has to come out- no waiting around... because if it is cancer- six months could make it a lot worse.  I am having a lumpectomy on july 2nd and I will be honest with you- I am worried it will come back as positive. I just lost my husband six months ago to esophageal cancer- so cancer is not new to me- but I still dont want it. I keep thinking, I cant believe it! Can life be this unfair?",
      "MessageIndex": 0,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25570,0.htm",
      "Title": "Worried but dont know for sure..."
    }
  ]
}