{
  "AuthorID": "Loree",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
  "Posts": [
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Christy, So sorry to hear about your loss. I went down that road too, pre-cancer. It's not easy.I hope you don't mind, but I've thought about your chemo and have some suggestions: Let your girls cut/shave your hair. It'll fall out within 2 weeks or so and it's not easy to take. It also clogs your drain and makes a mess of your pillow. I slept with a surgical cap when it was falling out or whenever my head was cold. It was just the right thickness. Letting the girls play with it may make it easier for them to see you without it. I also got my son tub crayons to draw on my head. He thought it was neat and got him acclimated to the bald mom. Get crayons and coloring books, movies for you and the girls to watch for the days you're too tired to get out of bed. It'll happen. I kept catalogues and magazines with lots of picture around since I was too tired to read. I mostly limited my reading to keeping up on my treatment, reading books with my kids, and reading the parables. Somehow, those were the only sections of the New Testament that I found comforting. Prayer and visualization therapy are musts. Ask if there's a social worker where you are being treated to help you with the visualization; it's great. Re nausea. Insist on Emend or another newer med. There is no reason for it and younger women get hit harder by it. My onc used to hydrate me with saline the day after chemo since I was still sick with anti-nausea meds. This helped tremendously with nausea as well as depression. Not all oncs will do this, but insist on it if you don't feel well. You also need more protein than ever before. I ate hard boiled egg whites and unsalted plain almonds for snacks. Egg white and 10-12 almonds each have 3 grams protein. Stay away fromwhite flour and cut out as much sugar as possible. My one concession was to add a few ounces of ginger ale to 16 oz water to help with funny taste. You need at least 64 oz water daily to flush chemo from your system. Itll also help you get over feeling miserable sooner. You'll probably get steroids with your chemo, take advantage of them. You'll have more energy than the energizer bunny on chemo day and until dinner on day 2. I ran all my errands during this time and then stayed in bed for the next 3. You may get a metalic or salty taste from food. If metalic, try to cook in glass, use plastic instead of metal forks, spoons, etc., avoid canned goods -- either fresh or frozen. If salty, definitely stay away from anything sweet -- It'll taste really salty. American Cancer Society has a good book on foods to help control certain side effects; if you call them, the'll know exactly what you're talking about and send it out to you for free.Sign up for ACS Look Good Feel Better, even if you don't wear make-up. Some locations give free wigs, and there are great moisterizers and cleansers not to mention great make-up. I gave away the things I didn't use to sitters; nothing like giving a gift of Clinique or Merle Norman, even if you got it for free. I used my eyebrow pencil to outline my radiation tatoos. They like to draw on you with a Sharpie marker to line up the radiation fields. I had a reaction to the marker -- also try to bring your own marker. Most places use the same one on every patient so I don't know for sure if the reaction was due to the marker or someone else's germs on the marker.Since you'll be prone to infection, give your daughters small bottles of anti-bacterial soap for school. Also have them wash hands and face whenever re-entering home. Have them sing the birthday song -- this is the proper length of time to scrub hands to eliminate bacteria and germs. I managed to get only 1 cold during the entire winter! Talk to teachers about what you're going through. Have them share with parents in your children's class that they need to be considerate about sending their kids to school sick. Make sure the teachers call you when there is something going around the class. I kept my son home during peak illness time and had his teachers e-mail work assignments. I kept his books here so we could do his work. One teacher even offered to work with him before and after school on homework (added 1/2 hour to start and end of day). This meant that we didn't have to do homework -- I could have more quality time with him.Bless you, and good luck. If you have any questions, please feel free to ask. I had a great \"cancer tour guide\" and just a year later, became one to a neighbor dx'd with stage IB. It helps to have someone who has walked the walk. Also accept all help when offered. I had only lived in my neighborhood for 6 mos and knew virtually no one except to say hello on the street. Someone stopped me when they saw I had no hair (my neighbor who would later have cancer) and asked if I could be mentioned in a prayer group e-mail. Out of that came offers of meals. They arrived on chemo night and for the 6 nights following. So much food, and people even asked what I had to stay away from. This went on for every chemo and I had to stop them for radiation. The Lord works in mysterious ways, he brought me to a new and wonderful neighborhood over a thousand miles away from my family. People would show up at my door and introduce themselves to me as they delivered a meal. We are friends now, pray together and share holidays together.Cancer is a miserable thing, but out of some of life's worst moments comes beauty and love from unexpected places. My prayers are with you. Loree",
      "MessageIndex": 6,
      "PostDate": "02/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Listen to your doctors and get treatment immediately. Breast cancer during pregnancy is frequently misdiagnosed and difficult since you have so many hormones in your body due to the pregnancy that can feed your cancer. Face concerns to your newborn as they arise; I have heard of pregnant women having lumpectomies in third trimester with chemo following, but you need to follow your doctor's instructions. You need to think about your other children as well as your unborn baby. I am emphatic about this because my ob/gyn team ignored every sign of breast cancer that was present during my pregnancy: a lump a 4 mos., inverted nipple, and finally an \"engorged\" breast a full month+ ahead of surgery. Following delivery, I was unable to nurse on one breast and had what they said were repeated bouts of mastitis. They even told my to postpone mammography since it would contaminate my breast milk. I finally started treatment when my daughter was 9 mos., but my cancer had metastised. To my medical team's credit, they were either too stupid or clever to have documented a single complaint or concern I had expressed or was even visible. I would have had one heck of a lawsuit had they not been so sloppy; or better yet, maybe I would be one of those people considered to be cured rather than facing weekly therapy sessions for a 9-yr old who is terrified that he will lose his mother, and a 4-yr old who is just coming to understand that only her mom is sick all the time and unable to do things that other mom's do. Good luck and God Bless.",
      "MessageIndex": 4,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Christy, Write to me at my regular address lasmith02118@yahoo.com, if not blocked by this website. American Cancer Society is at cancer.org. You can look for a local number as I don't know where you live; ACS is 1-800-ACS-2345; booklet is \"Nutrition for the Person with Cancer\". If you're still nauseated, call your onc and ask for the hydration; it'll take an hour plus but it'll be worth it. You'll feel great but tired. Make the call... it can't hurt. Oh, only rent comedies and kids movies -- found it helped keep my mood upbeat. I also watched Christmas movies from July on. Christmas with the Kranks will keep you laughing. God bless, Loree",
      "MessageIndex": 8,
      "PostDate": "03/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6489,0.htm",
      "Title": "Pregnant and Diagnosed With Breast Cancer"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Frannie, Have heard that zoladex will wreak havoc with joints. Also have bone mets. I opted for salpingo oophorectomy (?SP) and hysterectomy. Have also heard, round and about, that Zometa may cause problems with teeth/jaw bones. I have been using aredia. I don't think I need additional bone pain just to know that my med is working. Let me know what else you find out. Loree",
      "MessageIndex": 11,
      "PostDate": "17/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1579,0.htm",
      "Title": "Has Anyone Had Success With Alternative Treatments?"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "At 21, I question whether you would be better served with ultrasound -- your breast tissue may be too dense. Also, you should inquire about possibility of breast MRI in lieu of mammogram. Mammogram is not lengthy, if anything it's a bit uncomfortable because they more or less squash your breast. But anything that can detect a problem or potential one is worth it. Good luck",
      "MessageIndex": 2,
      "PostDate": "14/08/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6414,0.htm",
      "Title": "Help Me!"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Velvet, Just a heads up. I had been on bisphosphonates for over 2 years when I noticed an increase in sensitivity to hot/cold, and other sensations on one side of my mouth. I told my oncologist and he immediately stopped treatment until I folowed up with a periodontist. They did find an area where the gums were receding from the teeth, but not severe (at this time). My oncologist has resumed treatment however only on every other month -- I had been treated every 28 days. There is a class action lawsuit organizing re necrosis. You can search the web for bisphosphonates and side effects and you should pull up the info. Good luck. LAS PS. There had been a study a year plus back that indicated that the bisphosponates just might keep the cancer from returning to the bones. I'm living proof that they were totally wrong on that score! It returned with a vengence after a 1 yr. remission.",
      "MessageIndex": 5,
      "PostDate": "25/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Hi, I'm curious to know if anyone out there in the Northeast had an experience similar to mine:  I was an ob/gyn patient in an HMO in 2001, having undergone successful infertility treatment.  At appx 3 mos., I advised my nurse practitioner during a visit that I had felt a lump in my breast -- I was told it was the result of normal changes to the breast occurring as a result of the pregnancy.  At 4 mos my nipple began to invert, the ob/gyn, nurse practitioner, and lactation nurse could all see this during exams, but again I was given the same explanation.  At 8 mos my breast became swollen as if I was engorged (the other breast remained normal in size).  This lasted for only 2 days and then the breast returned to its \"normal\" size.  I informed my ob/gyn and for the third time, was given the same explanation.  Needless to say, several months later I was given a dx of stage iv with bone mets and learned that breast cancer during pregnancy is often overlooked.  A review of my medical records revealed that my complaints, the obviously inverted nipple, and the post-partem treatment for repeated bouts of \"mastitis\" and the explanation that I could not nurse from my right side because of a suggested blocked duct had not been noted in the file.  Essentially, I have nothing but my word vs theirs for litigation and so I elected not to pursue this.  However, I am concerned that some women may still be getting lame explanations without investigation. Even a complaint to the MA medical board would fail without documentation or proof of other similar experiences. If you have had, or know of someone with a similar experience please respond. The statute of limitations is up , but I'd still like to see the professional records of these individuals (still practicing) documented so women in similar circumstances can either demand further investigation or change medical providers.  I was in an HMO and had little choice. Loree I",
      "MessageIndex": 0,
      "PostDate": "19/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8951,0.htm",
      "Title": "Breast Cancer during Pregnancy in Boston"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "  On 12/1/2006 Mariem wrote: I am in treatment for stage iv (\"early\" stage iv, no organ or bone mets) and the surgeon in the group I am seeing does not want to do a mastectomy. I have had great results from chemo, and am 1/3 through the radiation process, but I'm concerned about recurrence if I don't have a mastectomy. Has anyone else tried this treatment plan? Chemo and rads w/o surgery? Dear Mariem Have you had a PET scan?  I had bone scan that had come up negative and tumor markers were not indicative of metastisis.  Luckily, my oncologist didn't like something he saw on a chest x-ray in 1 rib and ordered CT, MRI and PET.  You should get 2nd and 3rd opinions before going any further.  I'm not familiar with rationale on radiation pre-mastectomy.  I have Stage iv with mets.  My treatment plan was neo-adjuvant chemo followed by simple mastectomy (no node disection), then radiation.  My breast surgeon said she would take the nodes if they were enlarged, but she discussed and left it up to my radiology onc to irradiate them; he said he felt he could get them.  I have not had any problems with my incision site, nor my lymph nodes on the affected side.  Other surgical opinions ranged from do nothing since  Good luck and God Bless Loree  ",
      "MessageIndex": 4,
      "PostDate": "19/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8082,0.htm",
      "Title": "Stage iv - no Surgery"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "  On 1/19/2007 Jean1 wrote: Hi my name is Tara.My mom is 72 her nipple started bleeding 3 days before xmas.she had her mammogram and it came back clear 3 weeks before.She had a sono and a duct gram.She had surgery monday to take out and biopsy her ductsi asked if she could have centinnal node biopsy.they did not do.Ok her are reports.infiltrating duct carcinoma (grade 111/111)  invasive tumer meas.3.8x3.2x3 cm  in sutro component high grade,cribform,comedo,and solid type,grade111/111,necrosis present.  extensive intraductal component  angiolymhatic invasion: present   margins  tumor extends to margin in sections a7 and a 12  block a7 sent for further studies.   fibrous tissue no tumer .needless to say we are overwhelmed she is inover all good health and after loosing my dad 7 yrs ago .(pancriotic cancer) we are scared .I have a 14 (g) and 6 son we is grandmas love he came right after my dad died and well you know.Her surgean recommended a total mysectomy(excuse all my spelling I am shocked today) and need to know how bad it REALLY is.I have books but...they will do a cnb during surgery and take nodes out as needed.My thought is they will.She has been coughing for 7 months was diog.with sleep apnea and her right shoulder often hurts they said artrit.Has any one out there been through this and could help,have I missed anything  .i know they will know more when nodes are biopsy but if it has spread what is her time prog. and what will she be facing .Thet talked to us about radiation and tomaxifin but not so sure on chemo with her age .Would love ANY IMFO OR HELP OR HOPE thank you and may gad bless everyone of you strong strong people. Tara Tara, Please request that your mom obtain a PET scan ASAP.  This will clearly show whether cancer has spread to other parts of the body.  My bone scan came up negative and my PET lit up like a Christmas tree.  My tumor markers were not indicative of mets.  Your mom may have a problem if her only medical coverage is through Medicare, and some docs just don't get as involved as they should with elderly patients.  Certain things that are available to the otherwise insured person are not covered under the Medicare formulary.  If you hit this stumbling block, see if you can get your mom into a clinical trial to get the treatment she needs.  You can also go directly to pharmaceutical cos. and appeal that they provide the drugs to your mom under their compassionate use policy.  If your mom's at a hospital/cancer center, please avail yourself and your mom of the counseling services.  There are some wonderful support groups out there.  Cancer affects your whole family, not just her.   I'm stage iv with simple, single mastectomy and no reconstruction, dx'd at age 44 and have 2 kids under 10. My fourth year of survivorship is coming up in July.  Please stay away from the Am. Cancer Society books on how to explain cancer to kids (too much information about the disease can be frightening), and don't tell them more than they need to know.  Get them tub crayons to write on grandma's head when she's bald and find humor in your everyday situation. For example, I carried a notebook back and forth and included funny situations that occurred right along with my questions and instructions.  Think how great it would be if you could get a pedicure while stuck in a chemo chair for hours.  Take a portable dvd player and have \"movie week\", share it with others. By the way, my mom, 81, just completed chemo and radiation a few mos back for non-Hodgkins lymphoma.  I guess she thought I was getting too much attention from the family and she wasn't getting enough.  Just kidding, but humour does work.  If you'd like some tips for treatment, etc.  write back.  Did you know that facial exfoliating scrubs can give a bald head the most wonderful massage ever? Last but not least, pray.  Your faith can and will sustain you.  God bless. Loree",
      "MessageIndex": 2,
      "PostDate": "19/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8948,0.htm",
      "Title": "I need more imfo PLEASE HELP"
    },
    {
      "AuthorID": "Loree",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Loree",
      "Content": "Dear Piggy, I have been battling stage iv metastatic breast cancer for 3 years and 3 mos. and I am 48 years old. My initial diagnosis was stage iv with breast cancer in bone. There are only stages i through iv. There are a number of treatment options for your sister, depending upon particulars of your sister's cancer: Her2 status, response to chemo, etc. After a full regimen, 6 cycles of taxol, adryomacin, and cytoxin, followed by mastectomy and radiation to breast and largest bone lesions, I was declared cancer-free and enjoyed a 1-yr remission. I have been back in chemo for over 1 yr now and in spite of our inability to control my cancer in the bones at this time, I am grateful that mine has only spread to the bone. 70% of all metastatic breast cancer spreads to bone. While quite painful, bone mets survivors can live many , many years and has the highest survival rate of all metastatic disease. Say a prayer for your sister, your family, get yourself and your sister into a good support group. Help your sister do her research, if you live in So. FL we have a great navigator program at the So. FL Breast Cancer Resource Network. You need a cancer \"tour guide\" and a sense of humor. Someone who's walked the walk, is aware of the pitfalls, and knows the best doc's. Example: my first breast surgeon didn't bother to put a breast clip in at biopsy, so lumpectomy was off the table as an option -- had to have mastectomy. Thought behind lumpectomy vs. mastectomy: the horse had already left the barn... I also opted against lymph node dissection, my surgeon agreed provided she could not feel any enlarged nodes at surgery, and my radiology oncologist was confident he could get all the nodes with radiation to supra and subclavicular regions. Happy to say that this was my best decision since I have not had any problems with my original surgery sight and my nodes. Problems to look out for: 1) make sure your wig doesn't resemble a popular figure you dislike. I only discovered this in the mirror at a movie theater. After going in with a full head of hair, I came out bald! 2)Have your sister use her chemo diagnosis date for pin nos. Trust me, she'll never forget those numbers; 3) my personal favorite is to park in Row C (for cancer) , I never forget where my car is anymore. Write back if you want some more info, jokes, or just need to vent. Stage iv cancer is not a picnic, but it's also not necessarily time to go shopping for a black dress. --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html ---- Good luck.",
      "MessageIndex": 2,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3195,0.htm",
      "Title": "Bone and Breast Cancer"
    }
  ]
}