{
  "AuthorID": "Lou38s",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lou38s",
  "Posts": [
    {
      "AuthorID": "Lou38s",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lou38s",
      "Content": "Most Doctors will take offense if you question them. But, I agree - so many times \"routine\" procedures can miss so much. It's your life and you have every right to seek out a second opinion. It seems so many people - young people -  are being dx with cancer in late stages because the doctors will only give you 15 min  - which includes both time and effort they put into your care. Maybe not all of them, but this is not the only cancer support site out there - - look at how many of us are here. Be paranoid - so what. Hopefully that's all it turns out to be. If not - you just saved your life!!!  Good luck to you - Get it before it gets you.  !!!! :-) God Bless",
      "MessageIndex": 2,
      "PostDate": "13/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11286,0.htm",
      "Title": "pathology reports and doctors"
    },
    {
      "AuthorID": "Lou38s",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lou38s",
      "Content": "Any hairdresser or cancer center or hospital in your area would be able to help you out with this. My sister went through Hodgkins twice, tried the wig, but decided she would take the \"You can't beat 'em, join 'em\" attitude. And she wore ribbons or fancy, practical hats. And BIG earrings! Hoops - or silly ones. Whatever matched her outfit. She HAD to match. And make up. Either just lipstick with face powder (or base) , maybe some blush (not alot of blush) - But the base with lipstick, big earrings and a cool, functional hat. There are so many things you can get that are donated, and options other than an expensive wig. But if it is wig - ask a hairdresser. Cancer centers always have connections.",
      "MessageIndex": 8,
      "PostDate": "03/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9958,0.htm",
      "Title": "Where can i find a wig?"
    },
    {
      "AuthorID": "Lou38s",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lou38s",
      "Content": "OKAY - Retract the claws!!!! I agree with the witchdoctor dx most of the time and mostly on the basis most of us have never been to medical school. The thing is  ---------- No ABSOLUTE Advisements or \"No Ways\"  should be given out. We share our experiences, our dissappointments, and give our opinions as to what we think should happen or looked into. We do this based on what we have educated ourselves on with proven results, not theories. My husbands mother bought that Kevin Trudeau book. It is not based on facts or any proven curative regimens. We all hate that our lives or our loved ones lives are in the hands of the pharmicutecel companies and the doctors that will not go above and beyond to fight as hard as we want to. I will not put in writing concerns I have as far as that goes. There is no wrong way to make every effort alternatively to get well. I give Kevin,  B's and Multis and mushrooms - whatever I can think of. But that's us. Some of us do give advice as to what not to do as far as \"Don't do it. it's a scam\"  Generally, if you are emptying your wallet with an unproven \"cure\", that someone tells you no chemo, no radiation, Just buy my book and my cure thats 650.00 a month, and then the next step is........900.00 a month.  Caution and skeptisism. Alternatives should not be given out as a cure. It's a choice we make in addition to those we must entrust our lives to. We trust only ourselves, and ultimately,we have the power to to decide who we shall allow to aid us in our quest. It's a personal desicion we can share as an option. Not a debate.",
      "MessageIndex": 8,
      "PostDate": "25/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    }
  ]
}