{
  "AuthorID": "LoveandLight",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LoveandLight",
  "Posts": [
    {
      "AuthorID": "LoveandLight",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LoveandLight",
      "Content": "My mom wrote this before her chemo treatment two weeks ago. She is now in the grips of this disease. Blurred vision, loss of legs, bladder, eats little, goes in and out of lucid moments, and is in tremendous pain. The pain is our number 1# concern and we are doing our best to figure out how to control it. She is home right now with the help of me, my brother, my younger sister, her own loving brothers and sisters, and hospice (pain help). I have to say, because of the pain due to inflammation of the meninges, I wish she hadn't done this \"last shot\" chemo treatment. But it was her decision and she realized the risk. She had done this treatment before and lived for 3 years after her initial three treatments in 2004. Her regret as far as treatment is that she had agreed to such a high dose of dyposite (sp) in her port. She had much more success in her last two of three treatments when she had less percentage chemo in her infusion. I think it is important for patients, once diagnosed, to have this site to access and have a clear view of their disease. I think it has helped my mother, even during this confusing time, to have known others stories and have a clearer view of what she was up against and was prepared for it. She has said clearly \"This is my disease progressing\" and was able to tell the doctors on duty at the hospital (her own were at a conference) what was happening to her, that she wanted no more tests, and she wanted to go home under hospice care. It has given her much comfort in her waning independence to atleast have a clear picture of what is happening to her and to know when a treatment is working and when it is not. It has been incredibly peaceful and beautiful at her house. Music playing (she created a 91 song fest called \"sleep\") and candles burning. She wakes and shares she has had deep talks in a \"slower\" world with family members and is at peace about leaving the world. She says that dying is not scary at all. And what I have learned now, is there are far worse things than dying, it is the not knowing and pain that are far worse in this disease. So the more knowledge we have, the more comfort and less fear. Love and light to all dealing with this disease. A.      She is an amazing, strong, smart woman who has given all of us a lesson these past two weeks on making every moment count and the importance of love and healing. ",
      "MessageIndex": 43,
      "PostDate": "10/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "LoveandLight",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LoveandLight",
      "Content": "Hi there..   well first of all I want to say that you are incredibly strong for posting this message. My mother was the only other patient on this page under \"Ladoma\"..and she was brave, like you. She had a port put in her brain and was given a tiny dose of chemo (what they give people for leukemia,,the name is not in my radar right now)...she did this chemo twice and stopped because she had so much pain but it worked..she was cancer free for four years. She went to Dartmouth-Hitchcock in Hanover, NH. She also went to see a Homeopath and chinese herbalist and took a series of supplements and herbs (B12, Vit D, CoQ10, Beta Glucan and a series of herbal supplements). Steroids also helped lessen the blurred vision and bring down the inflammation on the optic nerve and reduce pain, stomach upset..ect). She decided to go into hospice in January because we couldn't get her pain under control. She loved it there and was pain free for 98% of her stay. The hardest thing for my mother ( a single mom, hard worker) was asking for help of any kind...but with this disease you must so don't be afraid to ask for help. God bless and remember to hug yourself often. My mother also took anti-anxiety meds--they helped--remember to breathe and know we are thinking of you. love and light . ",
      "MessageIndex": 55,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "LoveandLight",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LoveandLight",
      "Content": "*How amazing is this, mom! You see there is a reason you are hanging in there! Keep up the great work! Love, A P.S. Steroids seem to be really helping my mom right now.          ",
      "MessageIndex": 47,
      "PostDate": "20/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "LoveandLight",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/LoveandLight",
      "Content": "I just wanted to tell everyone that my mother, \"Lodoma\" died peacefully on June 24th,2008. She was cognitive up until the end and pain free thanks to the wonderful people at hospice in Vermont. She tracked this message board until her vision declined in May and felt tremendous gratitude for all the messages and support. She is now dancing in the light. Much love and light to all who are struggling with this disease and have love ones struggling with this disease. What I learned holding my mother when she passed is that this life is only a small fragment in our soul's journey.  Love and light.",
      "MessageIndex": 56,
      "PostDate": "04/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}