{
  "AuthorID": "Lucy1718",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lucy1718",
  "Posts": [
    {
      "AuthorID": "Lucy1718",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lucy1718",
      "Content": "Yes I have been on Exemestrane 25mg for over a year, it is the second drug as with you. My worst side effect is it truly makes me soooooo tired, and a little achy in the bones.",
      "MessageIndex": 1,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,82461,0.htm",
      "Title": "Anyone taking EXEMESTRANE 25 mg?"
    },
    {
      "AuthorID": "Lucy1718",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lucy1718",
      "Content": "I found out sept of 2013 that I had Breast cancer. Had a full mastectomy October of 2013 they found more Cancer in my lymp nodes and in my bones. I have been taking exeseme, while getting IV treatment of Zometa Back in July they found that it spread to my hip so I started Radation and now getting 2 shots in my butt. Now they just found that more spots are showing up in my lymp nodes and a few new spots also on my liver. So I'm starting Afrinitor. It's a new drug, I guess only been on the market for a year. Just wanted to know if Amy else have tried this drug Thanks",
      "MessageIndex": 0,
      "PostDate": "18/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81320,0.htm",
      "Title": "New med AFINTOR"
    },
    {
      "AuthorID": "Lucy1718",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lucy1718",
      "Content": "Now I have been on this drug for a month, it's a chemo pill. Not getting side effects except for hair loss. Not all of my hair but more theb twice the average. Dr was worried about my white blood count going down. Good news my white. Look count went up. Thank you, I will keep you all posts. This is a new drug that has been out about a year. So far so good Tks, Tracy",
      "MessageIndex": 1,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81320,0.htm",
      "Title": "New med AFINTOR"
    }
  ]
}