{
  "AuthorID": "Lulu_Bell",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lulu_Bell",
  "Posts": [{
    "AuthorID": "Lulu_Bell",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Lulu_Bell",
    "Content": "  On 12/12/2006 Lifecoachbonnie wrote: I am a second time around Breast cancer patient. I have just finished Taxol & Herceptin, however will continue with strong doses of Herceptin until 09/07. They want to place me on Arimidex,and I have high quality of life values. I am almost 51 and I am very concerned about these bad side effects vs the real risk of really increasing my risk of long term survial. From what I am ready it is most likely going to make me, feel like 70 with the joint pain and bring back all the menoplause stuff, that has been long gone. Any body feeling like me?   I'm in almost the same position.  15 months ago I was diagnosed as being highly HER2 positive, lumpectomy, chemo, radiation and am on Herceptin until about March.  A few days ago I was told that because of lab errors, diagnoses were being redone and mine said that I am also ER positive and my doctor gave me Arimidex.  I'm just starting to feel myself again and lost a few pounds since the chemo.  I have a very active job, am 58 this month and still teach dance and work in the performing arts. Quality of life is very important to me.  I'm only finding horror stories about Arimidex so I would appreciate any non-horror stories and also any advice on what would help with side effects, i.e., herbal remedies, or whatever might counteract bone/joint pain or weakening.  I can't continue the kind of work I do if  I'm worrying about breaking bones!  Right now I'm considering not taking it, but that scares me a lot, also.  I feel like I'm painted into a corner.  ",
    "MessageIndex": 4,
    "PostDate": "17/12/2006",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8257,0.htm",
    "Title": "arimidex~side effects"
  }]
}