{
  "AuthorID": "lyss96",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lyss96",
  "Posts": [{
    "AuthorID": "lyss96",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/lyss96",
    "Content": "Hi everyone. I tried going on another forum and asking this question but no one answered me....so I found this website and I'm hoping someone will have some insight!   Anways...My mom is 53 years old and she recently had her yearly mammogram and they called her back for more pictures because there was a small area that was suspicious. So she got her other pictures done and the radiologist ended up talking to her and basically just saying \"I'm 95% sure this is benign but the other 5%...I'm not sure about. So I want you to get a biopsy.\" She then talked to the doctor performing the biopsy and she said she felt strongly that this was benign, which is good and then what they were seeing on the mammogram is calcifications. She ended up getting her biopsy last week and she forgot to stop taking advil (you're not supposed to take it 5 days before a procedure like that because it can make you bleed) and ended up bleeding a lot because of not stopping the advil and the doctor doing the procedure knicked an artery or something like that. She ended up having to go to the hospital to stop the bleeding but knock on wood everything's been fine after that. Kind of one of those weird rare things. I'm a constant worrier. Two of her friends actually had the same thing happen to them and their doctors both told them they were 80% sure that it was benign and both ended up being fine. I'm just nervous because everyones different. I worry about everything. And this is no exception. I'm really nervous my mom has breast cancer and something horrible is gonna happen. Basically what I'm trying to get at here is...should I be this worried about it? I understand it's normal to be a little worried...but I'm really a wreck here. I also see that she's a little nervous and that makes me nervous but the only reason she's super nervous is that she has a ton going on (she's getting a divorce). She gets her results tomorrow but the waiting is killing both of us...but once again...am I worrying too much?",
    "MessageIndex": 0,
    "PostDate": "09/10/2012",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,68602,0.htm",
    "Title": "Breast Cancer help..."
  }]
}