{
  "AuthorID": "Mack1994",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mack1994",
  "Posts": [{
    "AuthorID": "Mack1994",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mack1994",
    "Content": "On Jul 22, 2018 11:51 AM elisa60 wrote: Hello everybody I am new here. I were diagnosed with breast cancer a few days ago now I have to have portacath  put in my chest. I have a few questions to ask.  I had a heart attack in 2016  and had five heart stents put in. I want to know have anybody else had a portacath put in that have heart disease and how safe is it for heart attack patients?  Is a tube inserted down your throat before the portacath placement? Hello elisa60, I'm a brain cancer survivor, however, I was a certified Registered Nurse in Infusion Therapy and also Board Certified in Vascular Access. A porta-cath is the way to go as many chemotherapeutics can only be administered thru a centrally located catheter, the catheter does not actually enter the heart but dwells in the Superior Vena Cava at the cavo-atrial junction. The superior vena cava is the end point for venous blood return, there is a large volume of blood and it is moving very quickly , so what is infused is diluted and exits thru the heart to the arterial circulation, which is the most effecient way of deliviring the medication for where it has to go, and the most effective. If you were my patient I would need to know what Kind of heart attack you had as there are implications related to the rate of infusion, a rapid infusion could possibly be overwhelming for the heart causing cardiac congestion, this is rare though as most chemo is not rapidly infused. In general porta caths are safe for most patients with heart disease, some advantages of a porta cath is that it can be accessed and deaccessed, thereby decreasing the risk of infection and also you can have your labs drawn through the port. You will not have to be intubated to have the surgical procedure to place the port, most likely an anathestic gas through a mask or anesthesia through an IV will be given. Those questions you asked were good, ALWAYS ask questions and always advocate for yourself. I wish for you the best gonig forward.",
    "MessageIndex": 3,
    "PostDate": "16/04/2019",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,137091,0.htm",
    "Title": "Portacath"
  }]
}