{
  "AuthorID": "Maddy",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
  "Posts": [
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "I take issue with the cancer specialists who are alarmed by an increase in the number of women requesting bi-lateral masectomies after a breast cancer diagnosis.  I have been down this road and from my experience, it was a great decision.  My tumor was not found by mammogram, but by MRI (at my request).  Statistics were quoted to me about survival rates and I was counseled by the surgeon that the lumpectomy \"got all of cancer and the margins were clean\".  After researching cancer material for several weeks, I found a female surgeon who agreed with my analysis and she performed a bi-lateral.  The lab report from this surgery showed another very small tumor in a different quadrant of the same breast, plus DCIS.  If I had not chosen the masectomy in 2004, I have no idea when the new cancer would have shown up.  Apparently, the mammogram was not the answer.  The lumpectomy was not the answer.  I am very glad that I did not allow the \"male\" surgeons advice that conserving the breasts is very important to a woman\".  That is a man's point of view.  I think women are now taking the decision procress into their hands and choosing masectomies because they feel more confident that they will have peace of mind.  So far, my scans and bloodwork show no signs of recurrence. ",
      "MessageIndex": 0,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17396,0.htm",
      "Title": "Bi-lateral Masectomy"
    },
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "All women need to be proactive with their healthcare. Even with a clean mammogram, I insisted on a CT scan of both breasts. A tumor was found - invasive breast cancer. A surgeon removed the tumor and lymph nodes. Nodes were clear and I was told nothing else was needed. I searched for another surgeon and found one who would perform a bilateral masectomy (a female cancer surgeon, in fact). Apparently, male doctors believe that breasts are a necessary part of every woman. They will do everything possible to keep the time bombs on our bodies. Lab results came back with extensive DCIS and another group of cancer cells in the same breast. Again, I was right and the doctors were wrong. You need to insist on the best treatment plans - in fact, when I started my search for a new surgeon, a medical oncologist at Washington Medical Center said I had a greater chance of developing ovarian cancer than a recurrence of breast cancer. Guess who was right? By the way, a also found a female gyn surgeon who performed a hysterectomy, to eliminate ovarian cancer, just in case he was right on that point. The lesson I have learned is research, go with your gut feeling and find a doctor who will respect your decisions.",
      "MessageIndex": 3,
      "PostDate": "13/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6584,0.htm",
      "Title": "\"elective Bilateral\" Mastectomy"
    },
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "Good for you!!! Just to let you know, the recuperation from the masectomy was not painful. In fact, I had the surgery at 1 p.m. on Tuesday and was ready to go home on Wednesday a.m. - in fact, I was washed and dressed by 7 a.m. I dislike hospitals and recovered quickly at home. The drains are a little annoying, but there was very little pain. In fact, I did not take any Vicodin that was prescribed for home use. The bilateral masectomy was the best decision I made in my life and in the past two years I have not had one day of regret. God bless and keep your chin up. Life is just beginning. Maddy",
      "MessageIndex": 5,
      "PostDate": "14/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6584,0.htm",
      "Title": "\"elective Bilateral\" Mastectomy"
    },
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "  On 2/28/2007 Patti46 wrote: Hi.  I am really scared.  Had breast cancer and now have been diagnosed with the cancer in both my lungs.  I am in pain and coughing a lot.  Oncologist did the lung biopsy and I was called in yesterday for results.  He started me on Femura or something like that and I take it once a day.  He wants to start on it and see if it shrinks the cancer and not do the chemo (agressive) until later because if this works, it will prolong the chemo.  I am scared because it seems like we should start out agressive first.  I am having a hard time breathing also.  He says the pill takes several months to start shrinking the cancer.  Has anyone else had a similar experience with all this?  Let me know if this is the correct approach or if I should be on agressive chemo to start with.  THanks so much for your help, Patti I also have breast cancer, diagnosed in 2004, bilateral masectomy in 2005.  Started Armidex in 2005 and stopped in 2006.  What I have learned on this long journey is obtain as many opinions as your insurance will cover.  If my cancer returns, I would definitely go to the MD Anderson Cancer Center in Houston, TX for tests and treatment recommendations.   There is an organization that flies cancer patients around the country for free.  What I do know about aramatose inhibitors (Femura/Arimidex) is that these  drugs slow the production of estrogen in your body, which feeds breast cancer cells in many patients.  I have never heard of it shrinking the cancer.  I would definitely get another opinion - and make sure you go to a major cancer center.  This is YOUR life, not the oncologist's life.  When I started my long road to recovery, I had several opinions from cancer surgeons, oncologists and radiologists.  I made an informed decision after researching everything I could.  I don't know how old you are, but you have to take ownership of your recovery.  No one else will care as much as you do.  I remember you in my prayers.  Madeline",
      "MessageIndex": 1,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9970,0.htm",
      "Title": "mets to my lungs now"
    },
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "  On 5/15/2009 ykwas54 wrote: I had a lumpectomy in March 2006, and was immeadiately put on Aromasin as it was hormone positive. I also had 33 full breast radiation treatments, and have been cancer free since.  I have had two more surgeries on the same breast due to seromas and nodules, all negative. I am having all the side effects associated with Aromasin. I can't seem to find what the percentage plus is for taking it. Can anyone help me? Hi!  My name is Maddie and I was diagnosed with ER positive breast cancer in Nov. 2004.  I chose a different path than you and had a bilateral masectomy, which eliminated the need for chemo, radiation, and never ending biopsies.  I was put on Arimidex and after one year, I decided to stop taking it.  My major side effect was irregular heart beat, called SVT's, which  would cause me to pass out.  This is not a usual side effect of this drug, however, I really believe every drug put in your body has an adverse affect on your cells.  Your question should be discussed with an oncologist, but he will just give you statistics.  The docs can tell you what the increase in incidents will be with and without the drugs.  My five year stat showed with Arimidex, a 8% chance of recurrence but without Arimidex it went up to 17%.  So far, I am fine without the drugs.  I go for a CT/PET scan regularly and it still shows no breast cancer.  The interesting thing,  however, is that the CT picked up a separate cancer -non small cell lung carcinoma.  The way I view this scenario is that my decisions about breast cancer allowed me to find a lung cancer at an extremely early stage.  It is interesting to note also that I eat totally organic food - lots of veggies and fruits, little organic meat,  cook with Corning glass, not teflon or aluminum, never smoked, have not had alcohol in 30 years, exercise almost every day and here I am at 66 years of age with 2 separate cancers.  What I have realized with  my journey is you must read everything you can find regarding cancer.  Five years ago, my doc dismissed my feeling that something was wrong in my right breast.  Since my mammo was clean, she did not take me seriously.  I changed docs and pushed for an MRI, which showed a tumor.  It is the same with me pushing for the regular CT scan - both times I found the cancer, not the doctors.  I read years ago that mammograms miss many small tumors and we should push for MRI's.  That is why I am alive today.  Everyone is different and your choice should take into account the amount of bone loss you face with Arimidex.  I hope you are aware of this and are taking some meds to offset this loss.  One year on Arimidex and I had significant bone loss.  Take care of yourself and read everything you can on breast cancer.  If you live near a cancer center, such as MD Anderson in Houston, that is your best chance to get current data.  In fact they have a web site and you can register for e-mails.  Never give up and be your own advocate. ",
      "MessageIndex": 1,
      "PostDate": "15/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36176,0.htm",
      "Title": "Is Aromasin worth it?"
    },
    {
      "AuthorID": "Maddy",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maddy",
      "Content": "Julie, I live in CA, not Michigan. Much warmer here I am sure!! I know what you are feeling. I had lymph node removal in November, 2004 and a bi-lateral masectomy in January, 2005. No doctor shared with me the nerve ending pain I would feel in my right arm and in my chest. In fact, one nurse in the surgeon's office added that the doctor doesn't want to plant the seed in my mind that there could be pain lasting up to two years post surgery. It can be a self-fulfilling prophecy. Can you believe something so ridiculous? This is to let you know that I found relief by putting pressure on my chest with a heating pad or microwavable heating \"buddies\". The nerve endings that were severed during surgery need to find new paths and the electric shock pain you feel will eventually disappear. Every once in awhile, I still feel a sharp electrical shock pain on one side, but the heat and pressure does help. I never took pain meds because I just wanted to try to beat this cancer without anything unnecessary in my body. Good luck and just remember we are survivors!! Madeline",
      "MessageIndex": 1,
      "PostDate": "28/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7820,0.htm",
      "Title": "Post Mastectomy Pain Syndrome"
    }
  ]
}