{
  "AuthorID": "maggiew",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/maggiew",
  "Posts": [
    {
      "AuthorID": "maggiew",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/maggiew",
      "Content": "On 7/22/2008 Gator wrote: Hi All - Does anybody have insight to the chemo drugs Cytoxan and Taxotere? Everything I read seems to be negative. In a nutshell, my 46 y/o wife had stage 1, lymph node-negative breast cancer , with the tumor being under 2cm. The oncologist has informed us that she wants to administer this Cytoxan and Taxotere cocktail every three weeks for a total of 4 treatments...this along with the usual tamoxifen treatment and radiation. We're not sure what to do because my opinion is that this seems to be a bit extreme based on the circumstances...or maybe not. Any opinions? Thanks for the help.",
      "MessageIndex": 2,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26351,0.htm",
      "Title": "Cytoxan and Taxotere?"
    },
    {
      "AuthorID": "maggiew",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/maggiew",
      "Content": "Hi,Gator - Good luck and best to your wife. I'm coming to the end of 8 treatments for lymph-node pos. breast cancer. I had 4 EC (epirubycin/chlorphosphomate) and I've had 3 Taxotere (I more to go). It's best to balance good news with not so good - my experience is very different to your other correspondent's. My guess is that's because I'm older - older than your wife, too (59). Yes, drink as much water or other fluid as you can - that really, really helps. I was not prepared for such a violent reaction as I got and I got the drs. to reduce the dose by 25% second time round. (It's something they don't often tell you they will do)I've lost my fingernails, though they are growing back, and I have bowel and bladder inconsistencies. Be prepared for your wife to be 'wired' and to have bad dreams and disturbed sleep for the first week. Probably the thing I was really not prepared for, though, was - not just LOSS of taste - but for food to taste so bad I could not eat for first 5 days after treatment. I found milk-based food (smoothies, hot chocolate made with all milk) the only things I could take. Taste gradually came back after 5 days. By week 3 I was fine. Tiredness and bone aches come with the territory, of course. Of course, this may all be unwelcome, but I really think all the leaflets, etc. are rather glib and don't prepare you for the things that MAY ( and I stress may) happen - I hope your wife sails through it with none of the above. Everyone's different - and I have had 2 more than your wife will have, so here's hoping!",
      "MessageIndex": 3,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26351,0.htm",
      "Title": "Cytoxan and Taxotere?"
    }
  ]
}