{
  "AuthorID": "Mama47",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mama47",
  "Posts": [{
    "AuthorID": "Mama47",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mama47",
    "Content": "  On 4/4/2008 Reen99 wrote: Hello Ladies! I took tamoxifen for 2 years following surgery, chemo & radiation.  I suffered from horrible migraines throughout the entire treatment, so when the opportunity to switch to aromasin presented itself I was very excited.  It took about four months before I went from being a very fit and active 42 year old to resembling a 90 year old woman when I would get out of bed in the morning.  I would stumble all the way to the kitchen because my feet and ankles hurt so bad.  I was not able to take supplements like glucosamine due to a sulfa allergy.  I persevered, and finally found a solution that seems to be working for me.   I had repeatedly asked my Dr. to test my thyroid as a result of the symptoms, I had no idea that everyone one else was feeling the same way.  Always the test came back normal.  Finally I just asked to be put on a low dosage of synthroid.  The doctor agreed thinking it couldn't hurt to try, and after about five days the pain in my hands and feet started to subside.  I have two months till my five year celebration date, and another six months after until I will throw those meds to the curb, but at least I feel like I am 44, and I nolonger have to drag my ass everywhere I go.  I hit the gym daily which is what we all really should be doing, exersizing and living life!!! I don't know if this will be the solution for everyone's problem, but it couldn't hurt to mention it to your Dr. next visit........ Cheers Reen   Reen and Any others out there, I was diagnosed in May of 2006 with Hert 2 Positive and Estrogen receptor positive breast cancer.  Following 12 weeks of AC (every 3 wks) and 12 weeks of Taxol/herceptin, I had a right mastectomy with no lymph node envolvement (which was Gods work as it was a big area). I continued herceptin until it did such damage to my heart that I could no longer take it.  Purposely lost weight prior to my reconstruction.  Dr. placed me on tomaxifin following surgery.  Had had previous hesterectomy and was very much post menoposal.  Didnt like side effects and knew that I would be switched to aromasin after about 2 years on tamosifin.  Convinced Dr. to switch at 18 monthes.  Had tram flap reconstruction in June of 08 and reduction in Nov of 08 on oher side.  Gained some weight back but thought it was due to surgeries and recovery from tram flap.  Though dieting and trying to exercise weight continued to increase.  Asked endocronologist to due tyroid panel (still taking aromasin and hurting horribly).  Came back normal.  Tyroid was enlarged though and had a byopsy.  Thought pain in feet and ankles due to weight.  Just went to Dr. Stopped aromasin for 4 months.  Feet and ankles much better after just 2 weeks.  Heres my question.  Does anyone know if aromasin effects tyroid function tests.  I am still dieting hard and trying to exercise but weight is still not going down and increasing if I am not very!!!!!!! careful. Help! I don't know what else to do except try to get Dr. to put me on a low dose of synthroid. ",
    "MessageIndex": 90,
    "PostDate": "12/08/2009",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
    "Title": "Side Effects From Aromasin"
  }]
}