{
  "AuthorID": "Mamajlojules",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mamajlojules",
  "Posts": [
    {
      "AuthorID": "Mamajlojules",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mamajlojules",
      "Content": "  On 1/29/2007 Linda Lou wrote:   On 1/25/2007 Mamajlojules wrote: I am going into my 5th year (July 07 will be 5 yrs) from having breast cancer.  I had 1.1 cm, small early stage, HEU2 negative, estrogen positive, had no chemo/radiation, but was put on tamoxifen in 02 then switched to arimidex 04.  My ? is I have had a lot of hair loss and have gone to dermatologist after dermatologist asking ?s...  My oncologist says its unrelated to the meds but I think it is.  She knows I need to stay on it so wouldn't say yes.  Derm said it is early female pattern loss.. i've read up on that and a dr actually said the enzyme \"aromatose\" which is what arimidex is, can cause female pattern.  It seems logical as my estrogen is being depleted daily and its driving me crazy.  I'm considering going off meds now even tho i have 6 mos to go... believe me i know that may be stupid but i dont have a life now even if the cancer does come back.. either way i'm screwed, either deal with this and it will get worse and be more humiliated or go off it and hopefully i wont get cancer again.  Thing is I DONT KNOW IF IT IS THE MEDS, can only assume but all other tests are negative for anything else. PLS CAN ANYONE TELL ME IF THEY TOO HAVE HAD THIS EFFECT FROM tamoxifen/arimidex.  I dont know what to do.  I know this is my life and I shouldn't go off it as my life is more important than my hair, but my daily life and how i feel about myself is just as important.. I just need a dr, anyone, who can tell me if they think this is meds.. and given my case, would it be safe to go off now...   someone told me if i've gone over 4 yrs, the meds have done what they are supposed to, but yet 5 yrs is the norm... pls can someone help me. this has ruined my life, i'm seeing a therapist monthly, on anti depressants, etc....  i truly believe going off meds would give me some relief to see if it will improve.. PLS PLS PLS HELP ME.. I have even considered a transplant and I dont know what to do... PLS help me. someone... I, too, have had hair loss. I had stage two breast cancer with two lymph nodes with cancer. I had a lumpectomy, six months of chemo (plus I participated in a drug study), and 33 treatments of radiation. so far, so good.  Because I was homone receptor positive, I was taking Tamoxifen for 2 1/2 years and switched over to Femera about a year ago.  I did not experience the hair loss until I started taking Femera.  It started slowly and I thought I was just having a shedding period in the winter.  My hair got dull and kept falling out.  My oncologist said it could be from the Femera, any other of my medications, or other factors.  My hair loss was mainly at the back and sides toward the bottom, plus my hair line in the front.  I had my hair grown out to nearly touching my shoulders, so it was upsetting.  I saw myself in a mirror in the dept. store and saw that you could see right through my hair (the part hanging down past my ears) I went out to my car and had a total melt-down!  Luckily, my hair loss on top was on the least amount of it all.  I went to my hair dresser and she said, \"Let's get rid of this.\"  So, she cut my hair in a short bob which got rid of the see-through hair hanging down.  Made my hair look much thicker and I was able to keep the long layer on top.  My hair since seems to have stopped falling out. Just normal daily hairs in my brush for the past month or so.  I am hoping that it has stopped.  I think I am seeing short hairs growing back at my temples.  I believe I lost over half of my hair on my head.  I do believe it is from the Femera.  I did not have a problem with hair loss on Tamoxifen.  I did feel like I was taken off of mild chemo when I stopped Tamoxifen, though.  I think the hormonal change is what causes hair loss in some women.  I remember I lost a lot of hair when after I had my daughter.  I took Tamoxifen for 2 1/2 years and am scheduled so far to take Femera for an additional 4 years.  I personally would not consider going off of this drug unless something new comes about in the next three years.  Take advantage of the newest cutting-edge treatments that are available to us here in the Untied States.  You only have six months to go.  They could be the six months that save your life.  Whatever you decide, good luck and best wishes to you. Linda Lou  ",
      "MessageIndex": 5,
      "PostDate": "15/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9098,0.htm",
      "Title": "please someone answer a ? - if you have had same thing happen or if you know anything that can help me"
    },
    {
      "AuthorID": "Mamajlojules",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mamajlojules",
      "Content": "Linda thanks for your response....  maybe it is the meds and i must be patient it's just mine used to be like yours too and its very upsetting to see me now..   it itches really bad, did yours itch?  i dont know whether to continue going back to dermatologist   my concern is my drs wont tell me if its from arimidex and the thing is i have to be on it for an add'l 3 yrs after 5 yrs is up   -- until 2010.. i just dont know... is there a test they can do to see if its from meds. .it seems like they should be able to tell me yes or no but they cannot... can you offer advice/encouragement?  mine doesnt seem to be getting better and i dont know what to do... thanks",
      "MessageIndex": 6,
      "PostDate": "15/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9098,0.htm",
      "Title": "please someone answer a ? - if you have had same thing happen or if you know anything that can help me"
    },
    {
      "AuthorID": "Mamajlojules",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mamajlojules",
      "Content": "I am going into my 5th year (July 07 will be 5 yrs) from having breast cancer.  I had 1.1 cm, small early stage, HEU2 negative, estrogen positive, had no chemo/radiation, but was put on tamoxifen in 02 then switched to arimidex 04.  My ? is I have had a lot of hair loss and have gone to dermatologist after dermatologist asking ?s...  My oncologist says its unrelated to the meds but I think it is.  She knows I need to stay on it so wouldn't say yes.  Derm said it is early female pattern loss.. i've read up on that and a dr actually said the enzyme \"aromatose\" which is what arimidex is, can cause female pattern.  It seems logical as my estrogen is being depleted daily and its driving me crazy.  I'm considering going off meds now even tho i have 6 mos to go... believe me i know that may be stupid but i dont have a life now even if the cancer does come back.. either way i'm screwed, either deal with this and it will get worse and be more humiliated or go off it and hopefully i wont get cancer again.  Thing is I DONT KNOW IF IT IS THE MEDS, can only assume but all other tests are negative for anything else. PLS CAN ANYONE TELL ME IF THEY TOO HAVE HAD THIS EFFECT FROM tamoxifen/arimidex.  I dont know what to do.  I know this is my life and I shouldn't go off it as my life is more important than my hair, but my daily life and how i feel about myself is just as important.. I just need a dr, anyone, who can tell me if they think this is meds.. and given my case, would it be safe to go off now...   someone told me if i've gone over 4 yrs, the meds have done what they are supposed to, but yet 5 yrs is the norm... pls can someone help me. this has ruined my life, i'm seeing a therapist monthly, on anti depressants, etc....  i truly believe going off meds would give me some relief to see if it will improve.. PLS PLS PLS HELP ME.. I have even considered a transplant and I dont know what to do... PLS help me. someone...",
      "MessageIndex": 0,
      "PostDate": "25/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9098,0.htm",
      "Title": "please someone answer a ? - if you have had same thing happen or if you know anything that can help me"
    },
    {
      "AuthorID": "Mamajlojules",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mamajlojules",
      "Content": "i am on arimidex too and aug will be 5 yrs.. i have had considerable hair loss , have you not had that?  i am so down about it and i know my life is more important than my hair but this is my life now too...  i have been tempted to go off it altogether but i get scared and get back on it..   have you had this side effect?",
      "MessageIndex": 1,
      "PostDate": "02/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10532,0.htm",
      "Title": "a rest from aromatase inhibitors"
    }
  ]
}