{
  "AuthorID": "mandd5girls",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
  "Posts": [
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I am 2 years out.  I too was pretty frightened of chemo.  I am not going to kid... it was way hard.  HOWEVER... I am HERE! It is over, my hair came back, my brain is functioning... I AM ALIVE! Anything you need... ASK FOR! THere is no need to suffer. Talk to your doc. or NP or patient advocate.  Do NOT suffer needlessly.  Hang tough... 12 weeks will fly by and soon you too will say... I AM A SURVIVOR!",
      "MessageIndex": 40,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69332,0.htm",
      "Title": "Petrified of getting chemo"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I was diagnosed in January had multiple tests in Feb. and after doing research TOLD my surgeon in March that my surgery would be a bi-lateral.  I had a pre-cancerous lump on my left breast 10 years ago and when 3 tumors were found on the right side.. for me there was no question.  What? Wait around to see what will happen on the other side and go through the whole thing again? Nope- not me.  After surgery multiple pre-cancerous calcifications were found on the left side.  GOOD- BYE GIRLS! Won't miss ya! I had 4 months of chemo (TAC) and after a brief try with Arimidex (boo, hiss) just started today on Tamoxifin and hope I respond better.  Great web site- breastfree.org gives you the power to do what YOU want to do!! Jump and don't look back!",
      "MessageIndex": 9,
      "PostDate": "09/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17396,0.htm",
      "Title": "Bi-lateral Masectomy"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "You have almost exactly what I had.  I had 4 doses of ACT from May- August 2010 and have been on Tamoxifin since.  I would do take the Taxol. I know we can never say never but I will have to tell you I feel pretty darn good about my chances of dying from old age at 105! I wish they had given you the Taxol when they gave you the A/C but if it would increase your chances... do it. Best to you!",
      "MessageIndex": 4,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,65958,0.htm",
      "Title": "Onconotype DX Score 22 4 cycles AC now taxol??"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I had a bilateral mastectomy and after doing LOTS of research decided against reconstruction and have felt great about my decision since then (3/2010). I have to tell you- when I was post surgery and realized I would have had to have been going back to have bags inflated made me even happier I made the decision I did.  Go on Breast Free.org and think about whether you are defined by your breasts.  I have some fake ones that I wear whenever I have the desire (once so far in 2 years) and feel that for me it was the best decision.  VERY personal decision so follow your own heart. Best to you!",
      "MessageIndex": 1,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64800,0.htm",
      "Title": "Mastetectomy---w or w/o reconstruction"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I had my port put in end of May and will go next week for removal! HURRAY! Yes, it sticks out, yes, the pain goes away- although sometimes it aches, but it WILL get better!! You will rub some lidocaine on it before the do the stick so you won't feel a thing.  I think a port beats a stick each time in the arm! Good luck!",
      "MessageIndex": 13,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46307,0.htm",
      "Title": "Chemo Port"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "As I have read some of the other responses... all are GREAT! Take this absolutely one day at a time and do not listen when others start to tell you their horror stories.  You are young and your doctors will walk you through this. Make a list of questions and when you are with a professional go through the questions with them.  If possible, bring someone with you to all appts. and have them take notes too.  You will always think of things after you leave.  Take your time, breathe, and believe that everything will be just fine. Let us know how we can help!",
      "MessageIndex": 4,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,74147,0.htm",
      "Title": "just got the bad news..."
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I had my port put in end of May and will go next week for removal! HURRAY! Yes, it sticks out, yes, the pain goes away- although sometimes it aches, but it WILL get better!! You will rub some lidocaine on it before the do the stick so you won't feel a thing.  I think a port beats a stick each time in the arm! Good luck!",
      "MessageIndex": 17,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46307,0.htm",
      "Title": "Chemo Port"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "OncPharmacist- now that I am in year 6 of Tamoxifen I would agree and say you are spot on with your description of life on this medication. Not perfect, but I'm here to complain, and won't complain about that! Take it and go forward, crossing your fingers all we'll be well!",
      "MessageIndex": 222,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "Hi Niki... I am so sorry to hear of your cancer spread.  I have to tell you... I told my doctor- I would rather have a shorter life than the pain from Aromasin.  I can only hope that the lung lesion has not grown. My very best to you girl... hang in there! Melinda- San Diego, CA, USA",
      "MessageIndex": 192,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I just saw my oncologist today and told him I quit arimidex after 30 days.  Just cannot take the pain.  He put me on Tamoxifin and we'll see how that goes.  I continue to search for natural measures ... something that will keep the estrogen away and not take my quality of life away too! Good luck to you!",
      "MessageIndex": 133,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "You are right... it is just fear jumping in there- again!!  I just wish there was something else available! Thanks!",
      "MessageIndex": 4,
      "PostDate": "08/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,50751,0.htm",
      "Title": "Chosing NOT to take aromisin inhibitor?"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "The pain I had from only 3 months on Arimadex was more than I can state.  I, like you, felt that if this was the option to living longer- no thanks.  I tearfully discussed this with my doctor who smiled and said, \"This is not a problem.  Tamoxifin will be just as good and without many of the symptoms.\"  I am now on year 3.  I am stiff and sore sometimes but not anything in comparison to Arimidex. ",
      "MessageIndex": 198,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I had, unfortunately, invasive BC.  I am just so frustrated because of the projected side effects.  I feel like I gave up so much of my good health to surgery and chemo- how much more am I going to have to give up?",
      "MessageIndex": 2,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,50751,0.htm",
      "Title": "Chosing NOT to take aromisin inhibitor?"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I stared this is out on arimidx but after 6 months I decided that this was not the drug for me. I quietly explained to my dr. exactly what was happening and he recommended Tamoxifin. I have been on 4 1/2 years and although I have some side effects nothing to compare with not worrying about more cancer. I would recommend a conversation with your dr.to explain what you're thinking. This is your body- YOUR CHOICES!!! Best to you!",
      "MessageIndex": 211,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "OncPharmacist- now that I am in year 6 of Tamoxifen I would agree and say you are spot on with your description of life on this medication. Not perfect, but I'm here to complain, and won't complain about that! Take it and go forward, crossing your fingers all we'll be well!",
      "MessageIndex": 227,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "Has anyone decided to forgo AI's? I had a bilateral mastectomy, no lymph nodes involved, 21 on my blah blah test (can't think of the name) 4 ACT chemo treatments and now he says 5 years of Arimidex? After researching all the side affects... yea- I think not.  I was stage 2, 3 small tumors- all on one breast, other one was clear... suggestions?",
      "MessageIndex": 0,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,50751,0.htm",
      "Title": "Chosing NOT to take aromisin inhibitor?"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I started out with Arimidex after having stage 3 BC, bilateral mast. and chemo.  After 2 months I begged to try something else as the pain in my joints was horrible.  I was then put on Tamox. which my oncologist said was fine although I am post menopause.  I think that both are used on women in both categories.  Hope that helps.",
      "MessageIndex": 1,
      "PostDate": "08/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64896,0.htm",
      "Title": "Arimidex versus Tamoxifen??"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I vote for you to do it.  Once those babies are gone you will never again have to put time and energy into the what-if's- and you can go on living.  I had a bilateral last March and although the surgery is no picnic I would do it again tomorrow to get the peace of mind I have now. Look at breastfree.org - we women should be supporting each other when someone wants to be breast free! I had a BIG argument with my surgeon about not doing reconstruction.  I do not want plastic bags in me!! Best to you! Melinda",
      "MessageIndex": 3,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60263,0.htm",
      "Title": "Bi-Lateral masectomy"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "Marie... I had an oncotype score of 21, node negative, 3 tumors, largest 1.3. I had surgery- bialteral mastectomy then 4 rounds of chemo.  Are you on arimidex? Was it explained that this was an important thing for you to do? Something that would make a huge difference? Thanks",
      "MessageIndex": 13,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32825,0.htm",
      "Title": "Oncotype dx testing and decisions made"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I am 6 years out having had double mastectomy and then chemotherapy. I respect your opinion as to putting poisons in our systems but I am living proof that it worked. Just went to a funeral of a friend who did Gersen. My husband was a firefighter in San Diego and they frequently were called to assist people coming from Gersen's in Tijuana and needed to get across the border to get to a hospital were most died. I encourage you to not be swayed by those who want to gamble on your life. I wish you the very best.",
      "MessageIndex": 25,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32825,0.htm",
      "Title": "Oncotype dx testing and decisions made"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I had TAC every 3 weeks for 6 sessions in 2010.  Here I am, still fat and sassy, doing great.  Was it a picnic?  HELL NO, but I made it through.  It worked out like this- one bad week- slept and not much more, one better week, got out and started breathing again, one good week- ran errands with my cute little bald head, and geared up for my bad week.  All of a sudden- D.O.N.E.!!  Totally doable.  Make up your mind that YOU are worth it and JUMP!  Best to you!!",
      "MessageIndex": 19,
      "PostDate": "10/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32825,0.htm",
      "Title": "Oncotype dx testing and decisions made"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "I am 6 years out having had double mastectomy and then chemotherapy. I respect your opinion as to putting poisons in our systems but I am living proof that it worked. Just went to a funeral of a friend who did Gersen. My husband was a firefighter in San Diego and they frequently were called to assist people coming from Gersen's in Tijuana and needed to get across the border to get to a hospital were most died. I encourage you to not be swayed by those who want to gamble on your life. I wish you the very best.",
      "MessageIndex": 21,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32825,0.htm",
      "Title": "Oncotype dx testing and decisions made"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "hi Janine... I am 60 and had a double last March. I had 3 tumors on one side and had had a tumor on the other 10 years before that was precancerous so I decided- take them both. I then had 3 months of chemo. I am not going to kid you, surgery is no picnic but you will be fine.  Do not be a martyr- take the pain pills.  I choose not to do reconstruction. I found a web site- breastfree.org - and it gave me the power I needed.  Lots of women make it through just fine but I didn't want to have to ever have to worry about my breasts or anything inside of them ever again.  I got a great bra with implants and nobody ever could tell.  As far as the surgery, get yourself some zip up housecoat type things to wear for the first couple of weeks while you have your drains in.  Make sure you get 2 corsets with pockets to put your drains in too.  Read, rest, watch tv, and 6 weeks later you will be feeling pretty darn good.  Let me know if you have anymore questions.  Fear not- you will be fine. Melinda",
      "MessageIndex": 1,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60655,0.htm",
      "Title": "elective double masectomy"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "Hi Elaine... I had a bilateral mastectomy in March.  As soon as I got the info that it would be a mastectomy not a lumpectomy I decided right then that I would have both removed as I had a lump removed in the other side 12 years ago.  So... I was not going to mess around.  I also did research and decided after carrying 2 BIG girls around for 50+ years I would not miss them.  I found a GREAT website- breastfree.org - which reminded me that I am MORE than a pair of breasts! VERY IMPOWERING!!  My surgery found no spread in lymph nodes so that was great.  I scored a 21 on Oconotype and decided that chemo would give me the best chance.  I had 4 rounds which kicked my butt- but I made it.  Yesterday I had my chest port removed which signals I am at the end of this part of the journey.  My oncologist agreed to let me wait until October 1 to start Arimidex- and I will admit I am not looking forward to 5 years on that.  My pain from the mastectomy was strong but bearable.  As long as I didn't push the envelope beyond what I should have been doing- I was ok.  I walked every day and did exercises in the shower.  By the time I started chemo (May) I was totally healed and pain free- so that was 2 months.  Chemo, plus still recovering from surgery, has made me VERY tired and I know it will take time to regain strength.  I am a teacher and took off from March on and also this fall semester.  I have decided to retire in January as I want to spend time- whether I have 40 more years or less- with my family and friends.  The reality of cancer is that anyone's cancer can come back so I want to cherish each day and do what I want. I thought I always did that but have a VERY different attitude now.  Today I helped for an hour in my granddaughter's 1st grade class and if you could have seen the smile on her face.  Priceless. I am walking in the Susan G. Komen 3 day 60 mile walk in November and am up to 12 miles.  I think positively, thank God for walking with me every step of my journey and bless my family for all of their love.  I want you to know... you WILL get through this.  The pain WILL get better and whatever treatment you have after this- you WILL make it through.  Believe.  YOU are bigger than cancer.  I bought some GREAT t-shirts that empower me.  Oh- I also went and bought my first set of boobs last week.  I think it will be great! I can have them when I want and when I want to \"go light\" and I can do that too! God bless!! Melinda",
      "MessageIndex": 6,
      "PostDate": "18/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44302,0.htm",
      "Title": "Recovery period after double mastectomy"
    },
    {
      "AuthorID": "mandd5girls",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mandd5girls",
      "Content": "hi Sandy... I am doing great, now 5 years out.  I am still on tamoxifin and will be for 5 more years, but other than that... doing great!  I truly hope you continue to do well!  Keep in touch! Melinda",
      "MessageIndex": 8,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44302,0.htm",
      "Title": "Recovery period after double mastectomy"
    }
  ]
}