{
  "AuthorID": "map1749",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/map1749",
  "Posts": [{
    "AuthorID": "map1749",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/map1749",
    "Content": "We just got the most horrible news today. My wife's 2nd stage breast cancer has turned into 4th stage unoperable lung cancer! I am my wifes caregiver, her husband and dont know what to do. She had her breast cancer surgery on feb. 25 2009 which was very successful. The surgeon said he got all the cancer. She had 3 cancerous masses removed from her left breast and 3 lymph nodes. She soon developed a swelling in her breast and when we went to see the surgeon about he said that was normal. Several weeks went by and her breast was getting larger so we went to our family doctor and she also said that the swelling was normal. Her breast was 3 times the size of her other breast and they said that was normal? The following week I had to rush my wife to the hospital and she was experiencing pain in the breast. The surgeon at the emergency said it was a hemotoma and thus had to drain her breast. I was there when he did it.About a quart if fluid was drained from her breast. He said had she left it any longer it would have become infected. She had to delay her chemo beacuse of this hemotoma and she has had day care nureses coming to our home every 2nd day to repack the open wound and drain it.This has been going on since April-5 months! The wound his healing nicely so says the day care nurse. She started her 1st chemotherapy July 14 TC chemo. She received her 2nd chemo aug 4th. On august 11 she had difficulty breathing and had chest pains and was rushed by ambulance to the hospital. They did tests to see if she had a blocked artery in her chest. Results showed that she didnt however the ct scan showed the cancer had spread to her lungs and   was now at a stage 4. We met with the oncologist on Aug 12th ad he said he is going to continue the chemo and try to stave off the cancer but it cant be cured. He told me( not my wife) that she has 1 to 2 years to live. She is my life and she is so young ( 50) !  I need some advice as what to do to help her. I feel we should get another opinion however that means putting my beautiful wife through more tests.Plus I dont know if my wife will want another opinion. I have no one to talk to as my wife does not want me to talk to any family member about it. Both of her parents are now deceased and I am all she has. I really need some help as to what to do.   Please! map271",
    "MessageIndex": 0,
    "PostDate": "13/08/2009",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38968,0.htm",
    "Title": "2nd stage breast cancer now 4th stage lung cancer"
  }]
}