{
  "AuthorID": "marcia63",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
  "Posts": [
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hello - I had one nodule found on my lung from breast cancer.  I was diagnosed for the first time in Aug. 2003 - Stage II - Estrogen+ PR+ HER2 negative.  Exactly three years later, I had a recurrence in my breast and a lung met which was one spot.  I had a surgery called a thoracotomy which they went in through my back to get to the spot on my lung because it was in a difficult spot to reach.  They removed it and then I had Taxotere for 4 rounds and Herceptin for a year because when the cancer came back, it was also HER2+.  I also take Arimidex daily for the Estrogen+.  It has been almost 2 years since the lung met and there has been no sign of recurrence and my doctor says that usually the recurrence would have happened within the first year.  Have any of your doctors talked about removal of the lung tumors by surgery?  My surgeon said that these lung surgeries take place all of the time and they had no hesitation with removing mine.  I do know that how many and where they are makes a difference, but maybe you could ask your doctors about it.  I go to a big research hospital and they made the lung surgery seem commonplace and I got through it okay. Another option that was approved for HER2+ patients was Tykerb in 2007 (in pill form).  This seems to have worked quite well in clinical trials and doctors are very pleased with it.  It is usually given when Herceptin and chemos have failed.  I believe it is given with a chemo called Capectabine (Xeloda). I pray for all of us - I think we will see a cure for breast cancer in our lifetime - keep fighting and get all of the information you can to help fight this disease! Marcia  ",
      "MessageIndex": 3,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24033,0.htm",
      "Title": "her2positive estrogen neg"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "I was diagnosed with Stage II breast cancer - estrogen+ in 2003.  I had a small spot in my lymph node which was removed.  I wanted to upgrade my existing life ins. policy (one that I had carried for 20 years).  They said wait one year after treatment and then I could do it.  I did so, passed the physical tests by leaps and bounds, and we sent in my policy.  The underwriters denied it because they said I had lymph node involvement.  I never denied that in the first place.  Then they said I would have to wait 5 more cancer-free years.  Three years later, I got the cancer back and had a small tumor removed from my lung.  I am 1-1/2 years cancer free (after Taxotere, Herceptin and now on Arimidex).  I now know that I will never have ANY chance to upgrade my policy.  I did, however, get something in the mail from Physicians Mutual and it said they had a policy that COULD NOT be denied.  I sent in for it and I got it!!  My credit union offered something similar and I applied for that and got that too!!  The only stipulation is that I live for two years (all premiums would be paid back if I don't).  I have full intentions of making it that two years as I have a wonderful life and am actually quite healthy!  These are win-win policies.  Maybe search the internet for such policies or check your mail for occasional flyers.  If it says you cannot be denied, then they have to follow that. Insurance companies really need to update their policies!  Cancer survivors are living longer and longer and they need to realize that many of us will be around for a long time and deserve to have those life insurance privileges given back to us!  How can underwriters determine my life expectancy when my own doctor is filled with optimism!  I've wanted to take this to a higher level somehow to make insurance companies be held accountable, but not sure how to do it.  I have a friend that is a state representative, maybe that would be a good place to start.  Good Luck! Marcia",
      "MessageIndex": 1,
      "PostDate": "07/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24534,0.htm",
      "Title": "Life insurance"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "I had Herceptin about two years ago and also take Arimidex.  I occasionally have a cough and also a feeling of my throat constricting (especially when I am tired or laying down).  I have read that Arimidex side effects can cause coughing.  While taking Herceptin and Arimidex, my weight went up about 20 pounds!  I'm very active physically and this is about killing me!  However, I think the coughing may also be attributed to the water retention, which may cause irritation to the chest and throat.   If the coughing is severe (mine is not), make sure you pursue it with your doctor.  I had a cancerous spot removed from my lung after my first recurrence of breast cancer; so when I cough, I do get a little nervous, but my ct scans are clear.  Every time I mention a side effect that I didn't have before Arimidex, my doctor dismisses it, but I know it to be true.  Many, many things changed since I've been on Arimidex, and it is not my imagination. Good luck. Marcia",
      "MessageIndex": 2,
      "PostDate": "07/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35003,0.htm",
      "Title": "recovery problems"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi Pauline - I was diagnosed with Stage II breast cancer with one node positive in 2003.  I had a recurrence in 2006 and a small spot was in my lung (which they removed).  I was diagnosed ER/PR+ and HER2+ the second time around.  I took Taxotere for four rounds and a year of Herceptin.  My doctor said Herceptin has made a HUGE difference in treating HER2+ cancers.  I had no side effects from Herceptin (it is not a chemo, but it helps protect the cells).  I ended my year of Herceptin in October of this year.  I was also put on Arimidex last year.  Other than a few side effects from the Arimidex, I feel great!  I read breast cancer medical journals on the internet and on a daily basis there are new treatments coming up all the time.  HER2+ cancers are more aggressive, but because of Herceptin, it really makes a difference.  It is truly a revolutionary treatment.  Good luck to you - I do everything today that I have always done - so you should be encouraged that your life will go on!  Marcia",
      "MessageIndex": 3,
      "PostDate": "05/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22690,0.htm",
      "Title": "her2 neu pos and very scared. I need help!"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi - I'm a two-time breast cancer survivor (one in 2003, one in 2006).  In 2006 it recurred in the breast and moved to my left lung - both were operated on and removed.  Since that time, my rib cage is very sensitive to the touch.  When I turn to my left, at times it just feels like something is in there stopping me from doing it and makes me catch my breath.  I have mentioned this to my doctor and she said it is probably something from the surgery or even radiation.  (I had a mastectomy on my left side and a thorocotomy to remove the spot on the lung.)  The sensitivity comes and goes, and usually does not bother me.  She said to only worry about it if it doesn't stop or gets worse.  The most sensitve area seems to be right in the middle, around the sternum.  I have been taking Arimidex for 1-1/2 years.  Since taking it, I have had such odd things happen to my body.  My doctor always says she doubts that it is from the drug, just my growing older.  After reading all of the Arimidex/Femara posts, I feel much better in knowing that I am not crazy and these side effects are from the drug (even if the medical community doesn't believe us).  However, the worst is the joint pain (and the weight gain!) which I can tolerate.  The joint pain is mostly when I get up from sleeping or sitting in a chair and then it goes away.  I exercise daily and I think that helps. Hope this helps -- Marcia",
      "MessageIndex": 1,
      "PostDate": "18/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26201,0.htm",
      "Title": "Rib pain"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi Jodie - I took Herceptin for an entire year (every three weeks) and never had any side effects.  I started taking it with Taxotere (4 times every three weeks) and then continued the Herceptin for a year.  My hair thinned during the chemo and the Herceptin would not allow full growth, but I still had quite a bit and it did come back slowly.  After my Herceptin treatments were completed, my hair grew back to normal.   If your heart scans are okay, I really would not worry about the heart side effects.  The chances of it doing something to your heart are very minimal.  I came through an entire year and my heart is in great shape.  I think Herceptin is generally given for a year.  Are the pills something new?  I just finished in October and I didn't have the opportunity for the pills.  I wish I did!!  I was diagnosed in 03 with Stage II, one node positive breast cancer.  Mine came back in 06 in my lung also.  They were able to surgically remove the spot in my lung.  I was not HER2 positive until the recurrence.  I find that a little odd. Do you take Arimdex?  The Arimidex gives me far more side effects than the Herceptin ever did.  It diminishes all estrogen from the body so my body feels like it is 80 years old.  But since my cancer was metastatic, I will continue with the Arimidex.  I can live with the side effects if it means my cancer will stay away longer.  How old are you?  I also take Zolodex shots (capsules shot into my stomach) to keep me postmenopausal because of the Arimidex (my body was not ready for that yet - I had never missed a period - even through two rounds of chemo). There is no need to fear Herceptin - it is truly one of the great breakthrough technologies for people who are HER2 positive.  Marcia  ",
      "MessageIndex": 1,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22299,0.htm",
      "Title": "1st herceptin treatment"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "It has been four years since I was diagnosed with Stage IV breast cancer that had moved into my lung.  They removed the spot in the lung and I have been cancer-free ever since.  I took Taxotere and Herceptin.  I have been taking Arimidex for 3-1/2 years.  I have a great life.  The Arimidex makes me a little stiff in the joints at times, but I exercise a lot and it is a small side effect to deal with. I had no side effects with Taxotere - just slight hair loss and I'm not sure if that was from the Taxotere or Herceptin as the hair never came back fully until I was finished with Herceptin.  Good luck!",
      "MessageIndex": 7,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39768,0.htm",
      "Title": "Anyone heard of the drug Taxotere?"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Yes, I took Taxotere three years ago.  I had Stage II breast cancer six years ago and it recurred three years later.  The second time I had a mastectomy, Taxotere (4 times - once every 3 weeks) and Herceptin for a year (I was HER2 positive).  The cancer had spread to my lung and I also had a thoracotomy where they removed the spot from my lung.  Taxotere is made to work more directly on cancer cells and doesn't interefere quite as much with healthy cells.  Taxol is its counterpart.  I lost a little bit of hair on Taxotere, but not all of it - I did not need a wig like I did with Adriamycin and Cytoxin.  Taxotere had very few side effects.  That was three years ago and I am still in remission.  I think it is a good drug and if she has had other chemos in the past, she'll think this one is quite mild, even though it is a very strong drug. Hope all goes well. Marcia",
      "MessageIndex": 1,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39768,0.htm",
      "Title": "Anyone heard of the drug Taxotere?"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi - At the age of 40 (Aug. 2003), I was diagnosed with Stage II breast cancer.   Three years later (Aug. 2006), it had returned and I also had a cancerous spot in my lung.   I had a mastectomy and a surgery called a thoracotomy which they went in through my back to get the spot out in my lung (along with Taxotere and a year of Herceptin - I am HER2 positive).  It is Aug. 2009 and I have been cancer-free since the surgery.  Ask your doctor why they can't operate on the lung.  I go to a comprehensive cancer center in Iowa and as soon as they saw it in my  lung, they immediately told me about the lung surgery.  It was a slightly painful surgery, but I was up and going in no time and it worked!  I, of course, am still a Stage IV breast cancer patient, but am living a great life.  I would at least find a doctor who will talk to you about the surgery.  I thought my life was over when I had the Stage IV diagnosis, but I'm living a great life, cancer free, at least for now. Just because one hospital says they won't operate, doesn't mean that another won't. Best of luck to you and don't give up without a fight - because you might just win! Marcia",
      "MessageIndex": 7,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38968,0.htm",
      "Title": "2nd stage breast cancer now 4th stage lung cancer"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi Jodie - I was diagnosed with Stage 2 breast cancer in Sept. of 2003.  I had a lumpectomy, chemo (AC), and 7 weeks of radiation.  I had a 1cm. spot in my breast and one small spot in my lymphnodes.  I got through everything quite well.  In Sept. 2006, I had a recurrence in my breast and a pet scan revealed a spot in my lung.  I had a thoracotomy (surgery through my back to remove the spot in my lung) because it was in a hard to reach spot.  I took four rounds of Taxotere and a year of Herceptin because I am ER & PR+ and HER2+.  I had no side effects on Herceptin whatsoever.  I am 45 years old and have always exercised so my body is in decent shape.  I think Herceptin is revoluationary and so does my doctor.  If you have heart problems, it might increase the risk, but my heart is fine and I've had a lot of powerful drugs put in me.  My last treatment was in October and so far, so good.  I also take Arimidex and have the joint pain and stiffness.  I can live with the side effects, I'd be too afraid to not take it.  I live my life pretty much the same way I always have - cancer or no cancer.  I work full-time and have a great life with my four sons and two grandchildren!  I believe we will all be alive to experience a great breakthrough in cancer research and it will come soon!  Marcia",
      "MessageIndex": 15,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    },
    {
      "AuthorID": "marcia63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/marcia63",
      "Content": "Hi Jodie - I was diagnosed with Stage 2 breast cancer in Sept. of 2003.  I had a lumpectomy, chemo (AC), and 7 weeks of radiation.  I had a 1cm. spot in my breast and one small spot in my lymphnodes.  I got through everything quite well.  In Sept. 2006, I had a recurrence in my breast and a pet scan revealed a spot in my lung.  I had a thoracotomy (surgery through my back to remove the spot in my lung) because it was in a hard to reach spot.  I took four rounds of Taxotere and a year of Herceptin because I am ER & PR+ and HER2+.  I had no side effects on Herceptin whatsoever.  I am 45 years old and have always exercised so my body is in decent shape.  I think Herceptin is revoluationary and so does my doctor.  If you have heart problems, it might increase the risk, but my heart is fine and I've had a lot of powerful drugs put in me.  My last treatment was in October and so far, so good.  I also take Arimidex and have the joint pain and stiffness.  I can live with the side effects, I'd be too afraid to not take it.  I live my life pretty much the same way I always have - cancer or no cancer.  I work full-time and have a great life with my four sons and two grandchildren!  I believe we will all be alive to experience a great breakthrough in cancer research and it will come soon!  Marcia",
      "MessageIndex": 12,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20949,0.htm",
      "Title": "this time herceptin?"
    }
  ]
}