{
  "AuthorID": "Margarita",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Margarita",
  "Posts": [
    {
      "AuthorID": "Margarita",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Margarita",
      "Content": "Dear lsadallas, thanks for your response. It helps to hear of people who are doing well. I'm not sure what my treatment will be yet, my doc is still considering the options and i'll see an orthopedic onc and radiation onc this week. I know one option is Xeloda--but I didn't think your hair fell out on that. Not that it matters at this point, I'll do whatever I have to. GOod luck to you. I was diagnosed at 42 and had a 2 y.o. son (who will be 15 soon). So, I am grateful that I had all these years cancer-free to raise him. I just hope I have a lot more to see him grow into adulthood. Margarita",
      "MessageIndex": 2,
      "PostDate": "07/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7639,0.htm",
      "Title": "Metastic Breast Cancer What Treatments?"
    },
    {
      "AuthorID": "Margarita",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Margarita",
      "Content": "Hi Terrbear, Thanks for responding to my earlier message. I too was just diagnosed with a nodule in my lung and 3 areas in my bone. I'm afraid I don't know much about the treatments yet since that is still being decided. What my oncologosit told me were there were three possibilities: hormonal treatment (e.g. arimidex, fosadex); oral chemo (Xeloda); or i.v. chemo (Taxol or taxotere and possibly Avastin). I started getting injections of Zometa yesterday to strengthen my bones. They may radiate the areas on the bone. I want to hear success stories too. My sister was diagnosed with Stage IV bc in 1983. They told her she had about 2 years to live. She lived until 1995. She had several recurrences and much treatment, but she worked almost until the end. I guess if we take advantage of the best treatments now and they keep us cancer-free for a few years, we might be lucky and have more options as each year goes by. Good luck, Margarita",
      "MessageIndex": 3,
      "PostDate": "07/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7639,0.htm",
      "Title": "Metastic Breast Cancer What Treatments?"
    },
    {
      "AuthorID": "Margarita",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Margarita",
      "Content": "Hi I was just diagnosed yesterday with mets to bone and lung (caught early because I had a CT scan for problems with asthma). I don't know if it makes any difference if its caught early or not. But I like you wanted to hear some success stories. How are you doing? I hope you are one of those stories. Margaret",
      "MessageIndex": 3,
      "PostDate": "04/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5136,0.htm",
      "Title": "Met to Bone, Liver, Lung"
    },
    {
      "AuthorID": "Margarita",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Margarita",
      "Content": "Hi. I'm in desperate need of some hope. I had cancer (left side) 13 yrs. ago and then on the right side 10 yrs. ago. Did chemo both times and had radiation and stem cell rescue the second time. I've been doing well. Was on tamoxifen for 5 yrs. Then started Arimidex. Was on it for 18 months and had hair loss and other symptoms, switched to femara and then aromasin. Back on arimidex (off and on) from the beginning of this year. I'm kicking myself for not staying on it more faithfully. (had my ovaries removed in 1999). I'm almost 55 y.o. and have a 15 y. o. son. Just found some thickening on the bone (T-5, femur and humerus) and a 1 cm. nodule on lung. I had a CT scan for asthma. Scheduled to start with Zometa on Monday and chemo/hormonal tx to be determined. Anyone have some success stories to tell me about",
      "MessageIndex": 0,
      "PostDate": "04/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7593,0.htm",
      "Title": "Just Diagnosed With Mets to Bone/lung"
    }
  ]
}