{
  "AuthorID": "Marika",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marika",
  "Posts": [
    {
      "AuthorID": "Marika",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marika",
      "Content": "Hi Linda, I, too, am an alternative option cancer survivor.  I opted out of chemo, must to the chagrin of almost everyone around me (thank god for a good neuropath and supportive family) and am cancer free, living an alkaline lifestyle.  I am seeing Dr. Michael Epitropoulos who has me on the God's Herb protocol (ONSET product, as well, to build my emmune system up not tear it apart) and I am thankful that there is a choice out there for people to look into.  Choice is not something offered to a scared public.  I am glad to see the word is getting out. Good luck to you and keep the faith.  God Bless You. M.  On 2/12/2007 Naturespirit54 wrote: breast cancer, with the right diet and lifestyle can be healed in 48 hours with 3 substances.....soy, green tea, and the herb tumeric (which itself stops cancer 12 different ways).......Yes, I know that this will not make the MEDICAL/INSURANCE/PHAMACEUTICAL TRIANGLE any money, but that doesn't mean it doesn't work. It does. I've used it myself with great success. This is together with the appropriate diet, etc. of course. What these 3 substances do to the cancer is very akin to what chemotherapy does only in a non toxic fashion. They attack the cancer at different stages and stop it. And do you know why both orthodox and alternative treatments for cancer must be administered in a very controlled fashion? Orthodox cancer treatments such as chemo and radiation kill so many healthy cells where as alternative treatments such as those mentioned above kill so many cancer cells! One is killing the cancer and the other is killing the patient!! Is it any wonder why I will always opt for alternative treatments that give me a much better chance at not only surviving my cancer but actually healing myself. This is something the TRIANGLE mentioned above can never accomplish because they are employing toxic substances which are foreign to the human body! Is it the way that they try to scare the begebbies out of you that keeps you from trying a new treatment mindset that will not only give you a fighting chance at actually healing yourself but may also give you some quality? Think about it and write me if you have questions or just want to talk. Meanwhile go to cancertutor.com and learn.....blessings, Linda  ",
      "MessageIndex": 2,
      "PostDate": "13/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9565,0.htm",
      "Title": "I realize that I am of a different mindset, but........."
    },
    {
      "AuthorID": "Marika",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marika",
      "Content": "Good evening.  I too, am practicing a raw food lifestyle and working with herb therapy through Dr. Robert Morse in Pt. Charlotte, Fl.  I was diagnosed with Breast cancer in May, double mastectomy in June with reconstruction in progress.  I have declined chemo and have opted for Tamoxifin.  My onocologist wants me to stop the herbs and raw food and Dr. Morse wants me to stop the Tamoxifin.  I am in the process of doing my research as to what is best for me.  Confusing to say the least!  We are a rare breed changing our lifestyle to raw food.  It is so nice to read of someone else taking this step for recovery. Best Wishes for your good health now and in the future.",
      "MessageIndex": 9,
      "PostDate": "30/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7131,0.htm",
      "Title": "Tamoxifen Treatment"
    }
  ]
}