{
  "AuthorID": "Maryann_S_3",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
  "Posts": [
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I, too, have the same concerns about hormone therapy.  I have also been diagnosed with State 1 with no node involvement and hormone receptive.  I was on hormone therapy for 10 years and just stopped taking them in March, no I'm miserable with hot flashes, night sweats, all over uncomfortable feeling plus a sore breast.  I'm getting my last 7 sessions of treatment and very uncomfortable.  So, my problem is more hot flashes on top of hot flashes?  I discussed this with my oncologist and she suggested waiting one month, I told her two months.  She laughed and said okay.  We'll see.... Good luck with your alternative therapy.  If you should find something please let me know.   Mumsy ",
      "MessageIndex": 4,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30155,0.htm",
      "Title": "alternative to hormone therapy?"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Recently, I had breast surgery to be followed w/radiation therapy.  The mas in my breast measured 0.4mm stage 1 with no lymph node activity.  I had my evaluation by the radiologist/oncologist and he prescribes a treatment of 35 doses of radiation on the entire breast plus the breast tissue in the back.  I feel this is drastic considering the size of my cancer and since there was no lymp node involvement.  I was warned about all the side effects from this radiation treatment and it scares me, I visualize flesh falling off my breast.  Please advise if this the normal form of treatment for this kind of breast cancer.   Thank you.  ",
      "MessageIndex": 0,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28550,0.htm",
      "Title": "radiation therapy"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I've finished radiation treatment for the past 5 weeks and am now encountering lumps and bumps in my breast.  Is this normal?  If anyone has gone through this please let me know.  Plus I have episodes of pins and needles at various times of the day.  Again, if anyone had these symptoms let me know. Thanks. Maryann ",
      "MessageIndex": 0,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31678,0.htm",
      "Title": "radiation side effects"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Hi Cindy, I, too, was on Arimidex, but only for 3 months and stopped because of the side effects.  I not only had gained weight, but my joints ached too much.  I told the oncologist and she now wants to put me on Tamoxifin.  I told her not until I see her in May, but even then, I don't know if I want to take anything.  I'm concerned about my bones, and when estrogen is removed, there goes the bones.  I do not need fractures now in my life.  I am 66 years old, had Stage I cancer with surgery and radiation only.  the surgeon removed 21 lymph nodes which all were negative.   My breast is now malformed from the radiation, one breast is a size B, the other DD.  My breast literally shrunk.  The radiologist/oncologist said this is only the 2nd time in his career he saw this.  Oh well, lucky me. The best to you. Maryann ",
      "MessageIndex": 3,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I can relate to your fears about Arimidex.  I just started taking it, after having radiation and surgery.  Now my breast is hard as a rock, after radiation, and I have passed on my concerns about Arimidex to several doctors.  Naturally, they all agree the percentage of recurrence is less taking the med, rather than not.  I'm concerned about bone loss.  I now have very strong bones, due to 10 years of HRT and I have concerns now about my bones in the future, like  5 years from now.  I will be seeing my oncologist this week and have to show her my \"hard breast\" and see what her diagnosis is.  I've been told it's lymph fluid, since 21 nodes had been removed (all negative).  This caused lymph fluid from other areas to collect in my breast.  All I can do is massage it daily and hope it softens up.   I wish you luck with your heart problems, but definitely pass this along to all your doctors, especially your primary doctor.  Good luck.    Maryann ",
      "MessageIndex": 2,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32945,0.htm",
      "Title": "Arimidex and Heart Problems"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Hi Barbara, The first biopsy I had was called a stereotactic biopsy.  It's done while your' awake with a local on a table with one breast set in an opening.  A needle is inserted and asperated for detection of cancer cells.  My biopsy came back inconclusive so my surgeon performed a biopsy in the hospital, under general anesthesia, as an out-patient.  This biopsy came back positive, then I had a lumpectomy and radiation.  My cancer was caught early enough and treatable.  So don't be afraid to have any necessary biopsies.    Good luck to you.  Maryann                          ",
      "MessageIndex": 3,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36778,0.htm",
      "Title": "Breast Cancer Information"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "How great to hear Arimidex worked for you.  Did you have radiation treatment?  I am currently finishing up on radiation treatment, hurting from a major sunburn, and going to start using Arimidex.  I'm concerned because I am currently getting hot flashes and the first side effect is hot flashes.  I will try it in two months (after the holidays) and see how bad the side effects will be.  Stories like yours makes it easier to deal with this situation.  Thanks for the info. Mumsy ",
      "MessageIndex": 2,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30050,0.htm",
      "Title": "Arimidex as sole treatment for breast cancer"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I had a stereotactic biopsy as well as a surgical biopsy.  the stereotactic biopsy wasn't that bad and you definitely should have some form of biopsy performed.  I only had a 2cmm mass in my right breast that did not show up on ultrasound and opted for a second biopsy with surgery and radiation.  ]  Good luck to you and do not hesitate to follow through with whatever tests are necessary.    ",
      "MessageIndex": 1,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36778,0.htm",
      "Title": "Breast Cancer Information"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Hi, I, too, was put on Tomoxifen but haven't started it as yet because of another new medicine at the same time.  I will discuss taking this next month when Ihave my mammogram.  I had a lumpectomy followed by radiation and was first put on Arimidex and had bad side effects, mostly stiff joints, I told the doc about it and she gave me Tomoxifen now,.  I feel reluctant to take any of these meds as I worry about bone loss.  I am 66 yrs old and cannot afford to have broken bones.  I am also in a dilemma, like yourself.  All these drugs remove hormones from the body which certainly will affect other areas of the body, but I guess to keep the cancer at bay, they are necessary. \\Good luck with your decision and God Bless.     Maryann                                                                                                                                                                                                                 ",
      "MessageIndex": 1,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37395,0.htm",
      "Title": "Side Effects Fermara And Tomoxifin"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Hi Carole, Your recent message regarding Arimidex also concerns me. I have been holding off taking it as I am afraid of bone loss. I too took HRT for 10 yrs and took pride in the fact that my bones are in great shape. I worry about fractures, etc. if I take this med. I'm going my doctor today, (surgeon), and I know she's going to insist I start taking this med. I'm bringing all the info I have on it plus the side-effects and showing it to her. I had Stage I cancer in my right breast with 21 lymph nodes removed (all negative). After radiation, my breast looks horrible. I have lumps and bumps all over my breast due to lymph fluid, so I'm told by the radiologist. I shall find out today.... Good luck to you, I know what your going through. Maryann",
      "MessageIndex": 6,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32206,0.htm",
      "Title": "Alternative Treatiments"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I had raw spots under my breast. I applied a large dose of Aquaphor, as I told you in the previous message. I also used Aloe gel, right from the plant. I healed under my breast just fine, however, my breast shrunk from the radiation and removal of 21 lymph nodes. Not to say this will happen to you, but just keep applying the Aquahor liberally. It feels like vaseline, so no harm here. It will sooth the raw spots and cover the lesions without the use of a bandage. Good luck. Maryann",
      "MessageIndex": 6,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39054,0.htm",
      "Title": "Breast Cancer/Radiation Burns and Raw skin treatment"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "I, too, had severe burns and rash and used Aquaphor, sold in drustores by the vaseline products.  It has the consistency of vaseline  and you won't have to worry about bandages, etc.  Good luck. Maryann ",
      "MessageIndex": 1,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39054,0.htm",
      "Title": "Breast Cancer/Radiation Burns and Raw skin treatment"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "  On 5/17/2009 lillemor wrote: Just finished my 3rd try at estrogen feeding tumor and I'm done with the pills!! My shoulders froze,could not bend or use my arms or wrists. Just 3 hrs. of being taken off Feemara and put on Prednisone, I could bend my arms, my head had cleared.  I did not realize how dangerous I was thinking. My husband was amazed. I could not go to the bathroom , take a shower without much help. Towards the end my husband lifted from bed and had to feed me. This is not Life and it is a poor form of existence. I am now eating maitake mushrooms almost daily and am going to look into the Coriolus Versicolan extract.  It has been proven that the maitake mushroom kills the cancer cells. I have been on Aromasin,Tamoxifen and Feemara. lillemor   Thank you for your input about the hormone receptor drugs.  I just started taking Arimidex for 3 months and started experiencing joint pain in my shoulder as well as both hands.  I stopped taking the pill and my doctor now wants me to try Tamoxifen.  I had the script filled but still have not taken it.  I am still suffering with the stiff joints in my hands, which I'm sure I also have arthritis, but did not notice this until I started taking Arimidex.  I have a mental block regarding these hormone receptor meds.  I had a severe side-effect from a lumpectomy and radiation and now my double D size breast is down to a size B.  Totally shrunken from the radiation, all scar tissue.  The end result will be a mastectomy so I feel if the cancer should show up in my other breast, a mastectomy is inevitable.  Good luck to you and I will look into the mushroom remedy you mentioned.     Maryann                                                           ",
      "MessageIndex": 1,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36250,0.htm",
      "Title": "Done with drugs"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "Has anyone experienced a hardening, lumpy breast after radiation treatment? My breast has become extremely hard, rough, prickly. My surgeon said to massage it and in 6 months get another mammogram. The way I feel right now, no one is going to put this breast between plates of glass and squeezing it. It's extremely uncomfortable when I sleep, don't know where to put it. It does not mold to my body as my other breast does. I'd appreciate anyone telling me if they have gone through this discomfort. Maryann",
      "MessageIndex": 0,
      "PostDate": "25/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32492,0.htm",
      "Title": "radiation side-effects"
    },
    {
      "AuthorID": "Maryann_S_3",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Maryann_S_3",
      "Content": "  On 5/20/2009 dkliger wrote: Hi, I have been on Arimidex for 1 1/2 years,  Along with joint pain in my hands, I am now experiencing eye vision problems.  My eyes are always red and I am seeing floaters in my eyes.  All of a sudden my prescription glasses is blurry.  Is there anyone out there that has a similar problem on arimidex??  I also have dry eyes and have always had dry eyes for years before my breast cancer 2 years ago. but the eye vision problem bothers me..I am not sure if arimidex is causing it or is it something else is causing it.  Thanks, Dee   I, too, have had vision problems and until today have floaters that have not gone away.  I even went to the eye doctor and had a complete eye check and retina specialist check my eyes and they see no underlying problems. As for the joint pain, I am still suffering with joint pain since stopping Arimidex in April.  Now my doctor wants me to try Tamoxifen and after reading the side-effects I am reluctant to take any meds at all.  I worry about my bones now.  I am a 66 yr, old woman and do not need added problems with my bones. Don't worry about your floaters, but do worry about the other side-effects.  It's your body and you have to decide what's right for you. Should I have a problem later, I'll opt for a mastectomy and will not go through the rigors of surgery and radiation again. Good luck to you and speak to your doctor about other meds you can take. Maryann ",
      "MessageIndex": 1,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36332,0.htm",
      "Title": "Armidiex"
    }
  ]
}