{
  "AuthorID": "Marybe",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marybe",
  "Posts": [
    {
      "AuthorID": "Marybe",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marybe",
      "Content": "  On 3/26/2009 Ryalma wrote: Would like to know the life expectancy on the above type of cancer. Also, if anyone has had treatments at Oasis of Hope in Mexico and how effective the treatment has been.  Many thanks   As the others who replied to the message already said, each case is different.  I was diganosed with metastatic Stage lV breast cancer in 1998...it had gone to my bones (sternum and ribs), lung and there was also a place in my liver that they were never sure about (now they do know for sure it was breast cancer since it has started to increase in size, BUT almost 11 years later)  I went to the library to read about Stage IV and see what the statistics were.....according to most info I read I had a 50% chance of surviving two years....Don't quote me on this....it may have been 5 years.  All I know is the odds did not sound very good to me and that it was very depressing and I was just praying I would make it to 50,an age I had not looked forward to until I thought I might not reach it.  I had positive estrogen receptors and the onco I went to decided to try treating me with those and they worked....tamoxifen shrunk my tumors in my lung, and although the tumors in the bone did not change they also did not grow.  When the tamoxifen quit working, we went to arimidex, then aromasin and faslodex was the last hormonal treatment and I still get it once a month.  Also I was immediately put on pamidronate (sp....also known as aredia) for my bones and stayed on that until they came out with zometa and my ins approved me getting that.  I  had radiation on my sacrum when a new tumor appeared there last year and caused me pain, then went to oral chemo and avastin and just in the past two months I started abraxane.  So we are looking at 11 years since the diagnosis and I am still working and living a normal life.     I know that I have been extremely fortunate and attribute my getting along so well to an oncologist I have complete faith in. God, and the prayers and support of family and friends.  I really don't think they can give you an exact time frame on something since we are all different and respond in different ways.  I will put you in my prayers.",
      "MessageIndex": 4,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34624,0.htm",
      "Title": "Stage IV breast cancer spread to liver and bones"
    },
    {
      "AuthorID": "Marybe",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Marybe",
      "Content": "   I was diagnosed with recurrent breast cancer in 98....it was in my sternum, ribs and lung....also a place in my liver that they were never able to determine if it was cancer or a hemangioma or something since it never changed.   I started on hormonal therapy....tamoxifen then arimidex, aromasin and now get an injection of faslodex along with my chemo treatments.  My oncologist started me on pamidromate (sp?..same as aredia) IV therapy once a month which I was told was to strengthen my bones......I was on it until my insurance approved zometa which could be given in as little as 15 mins - 30 mins....the other took two hours.  I do not know if these drugs helped with the pain I was having in my sternum, but the pain did go away in this area.  I did have joint aches and pain in my legs, feet, leg cramps, etc, but again am not sure if this was from the hormonal treatments or aredia/zometa.  I still get zometa once a month, but my oncologist did decrease the dosage when they started saying it caused osteonecrosis.  I am a dental hygienist and I had never heard that it caused problems until a patient who was on zometa asked my employer about it.  I was really surprised and said Oh wow, I have been on that drug for years.   It is my understanding that the only way osteonecrosis would happen would be if you had an extraction.  I have had a panorex taken and there is no sign of thinning in my jaw area.  I would not go off zometa unless I was definitely having problems caused by it since I trust my oncologist and he says I need it.  I have been Stage lV since 98 and my dr has kept me comfortable and kept my cancer under control so that I am able to lead a normal pain-free life and I have been able to work the entire time. With any drug there is a list of side effects a mile long....some of us get them, some of us don't.  If a medication is beneficial, I guess you just have to weigh the pros against the cons and decide if it is worth the risk of being on it and what the risks are of not taking it. ",
      "MessageIndex": 3,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34356,0.htm",
      "Title": "Zometta Intervenous Treaments"
    }
  ]
}