{
  "AuthorID": "Mary_Atl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mary_Atl",
  "Posts": [
    {
      "AuthorID": "Mary_Atl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mary_Atl",
      "Content": "Has anyone had the DIEP procedure in Atlanta? Did you go to Dr. Mark Deutsch? How was your experience and outcome? Do you know of any other plastic surgeons in Atlanta who do this procedure at Northside Hospital? If so, what do you know about them?",
      "MessageIndex": 0,
      "PostDate": "14/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7269,0.htm",
      "Title": "Diep Procedure in Atlanta?"
    },
    {
      "AuthorID": "Mary_Atl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mary_Atl",
      "Content": "I am going to have breast reconstruction in a couple weeks.  I have been debating between saline and silicone and also whether to have an implant in  the other breast.  My plastic surgeon is going to do a lift on that breast and says he can get a better result with a small implant.  I am concerned about the safety of silicone and about mammography in the normal breast if I have an implant.  My plastic surgeon is no help as far as choosing saline or silicone and seems to be concerned only with the cosmetic results not with the possibility of cancer recurring.  Any advice for either concern?",
      "MessageIndex": 0,
      "PostDate": "27/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10767,0.htm",
      "Title": "Silicone vs Saline and Implant in Normal Breast???"
    },
    {
      "AuthorID": "Mary_Atl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mary_Atl",
      "Content": " I want to thank the people who answered my inquiry.  Your input was useful.  After reading and talking to as many people as possible, I decided to get the saline implant and forgo the implant on the normal side.  Let me tell you what I found out in case others are having the same debates.  I talked to 4 mammogram technicions.  Two told me there was no way that everything could be seen on a mammogram with an implant even with special techniques.  One said that there is always a blind spot and the other was concerned about visibility of tumors on the chest wall. Two others technicians told me it could be done, one of whom had had a mastectomy on one side and then saline implants on both sides. I was totally confused at this point.  I called and tried to talk to a radiologist to get his opinion, but was told to consult my doctor.   I had been doing my internet search by using breast implant mammography and I had little success, but when someone told me to search breast implant imaging (instead of mammography), I was able to find a lot of useful information that said that totally imaging is pretty much impossible.  As for the silicone vs. saline, my doctor finally said that when silicone ruptures, it is very difficult to clean up and some of it escapes. He assures me that both saline and silicone will rupture eventually, so I decided to take the safe route with saline.  I hope this info is useful to others.  ",
      "MessageIndex": 2,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10767,0.htm",
      "Title": "Silicone vs Saline and Implant in Normal Breast???"
    }
  ]
}