{
  "AuthorID": "mdailey",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdailey",
  "Posts": [
    {
      "AuthorID": "mdailey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdailey",
      "Content": "Late last year a routine mammogram discovered a 8 mm mass in my left breast. From all accounts I was very fortunate - small tumor caught early. Earlier this month I had a lumpectomy and it was a breeze. Surgeon called to let me know that no cancer was found in the lymph nodes so naturally I was over the moon. Today I met with the oncologist expecting to start radiation in a few days only to be told that while my cancer was caught early that I was diagnosed with a highly aggressive form of cancer known as triple negative. The tumor nearly doubled in the weeks between the biopsy and the surgery and now I will require chemo on top of radiation. My head is spinning and just wanted to reach out and see if anyone has any experience with this type of breast cancer? From the minute I was diagnosed I was very positive and upbeat about my prognosis mosrtly due to the fact that when I asked the surgeon about chemo she said that it would not be necessary but today I am falling apart. If anyone has anything to offer in the way of experience with this type of cancer I would love to hear from you.",
      "MessageIndex": 0,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134823,0.htm",
      "Title": "Triple Negative IDC"
    },
    {
      "AuthorID": "mdailey",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdailey",
      "Content": "My apologies for not replying sooner. I am sorry to hear about you sister and of course your current situation. Choosing chemo was not an easy one especially since I was diagnosed very early but after talking with a few Drs it really was the best option for me. The original Dr suggested four rounds but a specialist at one of the big centers strongly suggested six so that is what I am prepared for. It's going to be a difficult couple of months but I wanted to do everything I could to provide me with the best possible outcome. My first treatment was nearly three weeks ago and I had a rough couple of weeks. Not actually from the chemo for the most part although the exhaustion and lack of appetite were no fun. My wonderful ($950 per mo PPO) insurance company declined the Nuelasta shot my Dr said I needed and is the standard of care according to the American Cancer Society. They said they wanted to see that I needed it and after coming down with a 101 fever finally approved Nupogen because at that point it was too late for the Neulasta. Nupogen is a series of 5 shots given daily and causes terrible flu like symptoms so instead of having 1 crappy week I had 2. This week has been good although I still have no energy. Hopefully my insurance co will approve the Neulasta this time around so I can have 1 bad week and 2 okay ones. Any chance you will reconsider the chemo? You are in my thoughts and prayers.",
      "MessageIndex": 3,
      "PostDate": "04/03/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134823,0.htm",
      "Title": "Triple Negative IDC"
    }
  ]
}