{
  "AuthorID": "mdotperez",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdotperez",
  "Posts": [
    {
      "AuthorID": "mdotperez",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdotperez",
      "Content": "She lives in Hawthorn California",
      "MessageIndex": 8,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69860,0.htm",
      "Title": "HELP PLEASE!!!"
    },
    {
      "AuthorID": "mdotperez",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdotperez",
      "Content": "she lives in Hawthorne California. Would you happen to know which Center that would be?",
      "MessageIndex": 7,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69860,0.htm",
      "Title": "HELP PLEASE!!!"
    },
    {
      "AuthorID": "mdotperez",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdotperez",
      "Content": "thank you so much. I have tried all of the names you listed. I even went to the locations and everyone is turning us down. I am so scared right now....",
      "MessageIndex": 2,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69860,0.htm",
      "Title": "HELP PLEASE!!!"
    },
    {
      "AuthorID": "mdotperez",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mdotperez",
      "Content": "I'm reaching out for help becasue I dont know what else to do at this point. My best friend of 25+ years was diagnosed with Breat Cancer on September of 2012. since she is unemployed (a victim of Domestic Abuse), she was receiving Government assistance to make ends meet and receiving their Medical. Since her diagnosis in September, doctors have had to wait for approvals and approvals and finally they approved her to go through Chemo treatment in December. At this time she received a phone call from the Doctor stating that her insurance was cut off and they had no idea why. She checked with the Welfare office and they said that they cut her off and that she had to reapply because she owns property...(she let go of the property back in 2007 due to the abusive relationship). December 7th, 2012 she reapplied for welfare and to date she has not been approved. To make matters worse,  her mother just passed on  December 30th. Throughout Domestic Abuse, Breast Cancer, single Parenting, and now the loss of her mother, the tumor on her breast is expanding and i am basically watching my best friend of 25 years die before my eyes. I have tried every email i could find and have written to so many places, treatment centers, talk show hosts and I have exhausted every avenue. I even went as far as to google \"what do you do if you dont have insurance and you have breast cancer\" and still no opportuinites have arised. I'm begging and pleading with anyone out there that would know some place i can take my friend to get some help. The situation is getting worse and I'm so scared of losing her! HELP ME PLEASE!!!! ",
      "MessageIndex": 0,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69860,0.htm",
      "Title": "HELP PLEASE!!!"
    }
  ]
}