{
  "AuthorID": "MEEMERZ",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
  "Posts": [
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Tre - I always feel that I learn a lot from reading your posts.  Are you a Dr. or nurse or just very well versed in this horrifying disease. Just curious; you seem so knowledgeable.  My husband and I are using some of your suggestions for his cancer.   Cheryl  Oklahoma City",
      "MessageIndex": 9,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34586,0.htm",
      "Title": "Worried Misfiagnosis!"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Sabine,  I am praying for you - such tough decisions - keep strong and do everything anyone tells you.  It is sooo worth the fight.   My thoughts are with you and I send you hugs. Cheryl",
      "MessageIndex": 1,
      "PostDate": "11/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45782,0.htm",
      "Title": "confused.. about treatments.."
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Sabine, This awful dreadful disease never quits.  I guess I am sooo naive.  We have lost many family members to cancer (my dad, Rob's mom, Rob's grandparents, my grandmother - no need to continue).  When Rob was diagnosed I fell apart but thank God I bounced back fairly quickly.  I thought - surely this will be the last person in our family or in our close friendship circle that will have to deal with this BEAST. We have had sooo many - surely no one else we know will have to deal with this.  You know it seems that many times it rains on some of us a flood  and others just a shower - I guess I am having a pity party.  I know that none of us are insulated - it would be nice if we were.  I found out on Thursday that my best friend whom I have taught with 18 years (she is retired this year) has been diagnosed with upper intestinal cancer.  She goes for a PET this week.  I am devastated for her and her family! I feel down again but I know that I am strong and have the faith of my Lord to get me through this so that I can maintain a positive force in her life.  I am sooo thankful your son is o.k. - you will be fine also.  Please know that you will glean that stength that you had for his illness once again; you have to be there for him.  You can and will do this.  Pray and stay positive.  You will have all of us on this forum behind you to help in any way.  God Gless you and your family.  I will pray for you and your son's continued good health.   Cheryl  Oklahoma City",
      "MessageIndex": 3,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Sher -  listen to Dave - he has such wisdom.  This is a very scary part of your treatment.  But - do you have choice - you have to do it to be cancer free - yes - I said cancer free.  Because that is what will happen with this treatemnt.  It will not be a walk in the park but it will be worth it.  Hang tough, stay positive, walk with the Lord and you will be O.K.  Visit this forum often - it will help you sooo much.  Good luck and God Bless you! Cheryl   Oklahoma Cioty",
      "MessageIndex": 2,
      "PostDate": "21/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45971,0.htm",
      "Title": "Starting Chemo Soon.....SCARED!!!"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Hi - my husband just finished 37 tomotheraphy treatments.  He has SCC Stage IV throat - he has a mask.  As a matter of fact, he had to have 3 different ones made.  As his neck swelled from treatment the first one didn't fit and they made another.  Then toward the end, he had lost so much weight, he needed another one.  Wishing your family member good luck.  God Bless You on your continued good health. Cheryl   Oklahoma City",
      "MessageIndex": 2,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35146,0.htm",
      "Title": "radiation"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Hi Sabine - Rob was doing the Essiac tea when he was first diagnosed but then stopped when he couldn't swallow.  After reading more about it I think we are going to go back on it along with the flax and cottage cheese.  We need to do everything to keep him as healthy as possible.  And, God love him, anything I suggest, he is willing to try.  He wants to feel good and stay healthy.  Good luck to you and God Bless your family. Cheryl   Oklahoma City",
      "MessageIndex": 7,
      "PostDate": "09/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45685,0.htm",
      "Title": "essiactea and treatments.."
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Tre - it is sooo good to see you back on here - I got your sweet message and hope that your health continues to be better.  You always have such a wealth of information. Cheryl   Oklahoma City",
      "MessageIndex": 11,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Hello - my husband had a severe reaction to radiation.  The side of his neck was so blistered that he was miserable.  The RO said it was one the worse burns he had seen.  We went to the LindiSkin website and ordered the LindiSkin cooler pad. This was very soothing and healing.  All of these products are great and are formulated for cancer patients. They really helped my husband.  Good luck and may God bless you in your fight with this BEAST. ",
      "MessageIndex": 4,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39054,0.htm",
      "Title": "Breast Cancer/Radiation Burns and Raw skin treatment"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "I am so sorry that you have to go through this stress and wait - especially at such a young age.  I am shocked that you have to wait so long.  Of course, my husband's diagnosis was head and neck but we went to the Dr. on Tuesday, by Friday we had biopsy results and by the next Tuesday we knew that it was not contained (it had spread).  His Drs. were very aggressive from the very beginning and still are very proactive.  Please do not worry; pray for your Lord's guidance.  This is a wonderful forum - so much support - I do, however, would love to see you seek a second opinion.  If you live in the Oklahoma City area, I have names of wonderful Doctors.  Good luck and God Bless You. Cheryl   Oklahoma City ",
      "MessageIndex": 1,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42055,0.htm",
      "Title": "Waiting for Breast Biopsy"
    },
    {
      "AuthorID": "MEEMERZ",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MEEMERZ",
      "Content": "Dear Sabine,  I truly hope that this is the treatment path that  is best for you!  It sounds like you are doing great!  I hope many others post who are familiar with your treatment plan.  Good luck and God Bless you! Cheryl   Oklahoma City",
      "MessageIndex": 1,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48125,0.htm",
      "Title": "tomaxofin and nothing else???"
    }
  ]
}