{
  "AuthorID": "Melissab",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Melissab",
  "Posts": [{
    "AuthorID": "Melissab",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Melissab",
    "Content": "My mom was diagnosed with breast cancer (no primary tumor, though) and treated with chemotherapy for six months and 38 radiation treatments. Her treatment began in August of 2003. At the end of her radiation treatment in February of 2004, she began to experience double vision. The doctors thought it had something to do with some of the medications she was taking. She wore a patch and remained hopeful that she was cancer free. In April, she was referred to a neuro-ophthamologist for the double vision. He thought there was pressure behind the eyes and ordered a lumbar puncture. Immediately after the lumbar puncture, her vision cleared. But the spinal fluid was \"critical\" meaning it was cloudy. Then the cancer doctor called and told us that there were a few cancer cells found in the spinal fluid. Mom was still upbeat and hopeful and asked the doctor, \"So you think you can take care of this and it'll be okay?\" The oncologist told her he thought there was a \"good chance.\" Then came the ommaya res. and more chemo. With each treatment they pulled fluid and had it tested and each time, the doc told her it looked good. In July, she began to lose her sense of balance and had to use a walker to ambulate. Also, she began to lose her hearing. Never were we told that the prognosis was not good. In August she had whole brain radiation and lost her hair again, which never came back. In October, she was in a wheel chair, unable to feel her legs much. Then November, she lost control of her bladder. In the latter part of November, she went to see a urologist and was catheterized. She attributed all this to the side effects of the chemotherapy. The onc. never bothered to correct her. The first week in December, she lost her bowel control and showed the first signs of confusion. We called our oncologist and he was in Alaska on a cruise, so the doc on call returned my call. When I expressed my concerns, he asked me if the hospice nurse had been by yet today. I thought he misunderstood, for we didn't have hospice because we were never apprised of the need. He had us bring her in for evaluation. There we were told she had just a matter of weeks left to live. We were unable to care for her at home, due to the paralysis and had to put her in a hospice home, which was actually quite awesome. She lived until December 31st, after going completely deaf. But thank God, she had her mental faculties until the end (I think they gave her massive doses of some kind of steroid) and we were able to communicate with a dry erase board. I am still struggling with not really knowing (or accepting) all the facts. One thing of interest is that they did a nerve conduction study at the hospital before she was moved to hospice. The nerves of the lower spine, the doc said, were encased in cancer cells. Especially the eighth nerve, which controls the hearing. He told us the way the cancer was acting, she would be a quadriplegic and then the cancer would end up at the brain. That didn't happen, she had a major brain infarc and passed after going into a deep sleep for about 12 hours.",
    "MessageIndex": 13,
    "PostDate": "16/08/2005",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
    "Title": "Treatment for: carcinomatous meningitis"
  }]
}