{
  "AuthorID": "Mercy61",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mercy61",
  "Posts": [
    {
      "AuthorID": "Mercy61",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mercy61",
      "Content": "On Dec 11, 2014 10:41 PM formysister wrote: My younger sister just started chemo this week for stage 3 inflammatory cancer in one breast and stage one in the other. Her lymph node on one side was hard and sore but but on Friday they said it had not spread to the rest of the body.  Good news. Monday I was with her to get her port inserted, education at the oncologists office, and they did another scan on upper body late Monday afternoon. Tuesday was her first chemo treatment; I wasn't with her but she did fine. Now today they tell her they see something and want to do a CT Bone Biopsy.  It was scheduled for Dec 22;  her Dr called and said they are going to try and get her sooner. She tells us it's scary.  When I picked her up Monday we hugged she she I'M SCARED.  I tell her \"I know\". Hell we are ALL scared.  We aren't dwelling on it though. I posted Nelson Mandela quote about courage on her face book.  I texted her back \"of course its scary! you are in a war for your life.  We will win this war. Do not let fear triumph.\" I was wondering what is the best was to keep her  positive through all this? What is the best thing to NOT say?  I am glad that your sister has you by her side. My husband has tonsil cancer. When it was discovered I told him that I would be there with him the whole way! Let her know that she will not be alone through her treatment and recovery. Tell her that you will help her with the big and little choices that are coming her way. Do not sugar coat her situation but tell her that she can handle what is coming her way. Plan some outings with her that have nothing to do with her cancer. Maybe just looking at the christmas lights. Sharing magazine articles that she might enjoy, window shopping . Also tell her that there is no one script for her treatments. One test often leads to another. This is just the way it is. Stay positive yet realistic. Do NOT constantly ask her how she is feeling or what her thoughts are. She needs a rest from cancer talk. Be strong for your sister. Stay positive yourself. Live for each day. Stay in the Present. Enjoy the holidays and visits with friends and family. I will be thinking of you. Paula",
      "MessageIndex": 1,
      "PostDate": "12/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81204,0.htm",
      "Title": "How do I encourage my sister? She just started chemo"
    },
    {
      "AuthorID": "Mercy61",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mercy61",
      "Content": "On Nov 21, 2014 10:14 PM mcon1973 wrote: My mom has breast cancer and it has now spread. She has a mass in the middle of her chest which will soon cut off her air way to a lung and eventually block blood to her heart and lungs.  The Dr. told us she has weeks to months to live. I don't take that at face value because of all the stories I hear about people having an expiration date and they outlive the time given.  My problem is, I am feeling like I have failed as a son. I thought I would be ok with this but after we were told, I haven't stopped crying. I wanted to do so much for my mother but was always so busy with my own issues.  I am so lost right now and just want to shut down and not do anything or see anyone. I am currently in the middle of obtaining my MBA and I have lost all interest.  I'm not sure what to expect here but I just needed to get this out. I don't want my mother to die, I want her to stay here so I can be a better son.  I'm so lost...When we see someone that we love suffering we want to take their pain. I think that your mother is proud of you as you work on your MBA. This is a real accomplishment and takes a lot of commitment . It is natural for you to want to concentrate on your mother and her care. However, if she has support, please consider staying with your school program. Your energy will return and you will be able to handle what is ahead of you. Most students are overwhelmed with graduate school. This is how you are feeling now. Not forever. Hoping that coming days are easier for you. Paula",
      "MessageIndex": 2,
      "PostDate": "23/11/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,80811,0.htm",
      "Title": "Just told my mom is going to die of cancer..."
    }
  ]
}