{
  "AuthorID": "Michaels",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Michaels",
  "Posts": [
    {
      "AuthorID": "Michaels",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Michaels",
      "Content": "My wife, who will be 58 in 10 days, had a similar progression, starting almost exactly 5 years after treatment for breast cancer.  Initial symptoms were pain in the side of her head, unsteady gait and loss of balance.  She was admitted as an emergency patient after the MRI showed leptomeningeal disease in her brain and spine.  High dose steroids stabilized her and whole brain radiation had side effects but helped.  At the Dana Farber, she was given Depocyte through an Ommaya reservoir until a repeat MRI showed progression.  She is now bedridden, with a urinary catheter, essentially paralysed from the waist down, though retaining sensation there.  When she became disorientated and started hallucinating, we increased her daily dose of steroid (dexamethasone) slightly, which reversed the symptoms.  I would be glad for any information about the course of disease with steroid management. Michael",
      "MessageIndex": 30,
      "PostDate": "02/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "Michaels",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Michaels",
      "Content": "I don't know if anyone reads this site but, for the record, my wife passed away in February, 8 months after her first symptoms of headache and unsteadiness and subsequent diagnosis by MRI.  Her disease was restricted to her brain and spinal cord and she almost never complained of pain.  At-home hospice care was continuously accessible and effective (thanks to the nice people at Blue Cross Blue Shield of MA and the hospice nurses) and her final hours were peaceful.  My thoughts are with anyone else caring for someone with this devastating condition.",
      "MessageIndex": 31,
      "PostDate": "06/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}