{
  "AuthorID": "minnie_p",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/minnie_p",
  "Posts": [
    {
      "AuthorID": "minnie_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/minnie_p",
      "Content": "I was diagnosed with primary peritoneal cancer (some ovary involvement) in March of 2002 had 6 rounds of chemo every 3 weeks. That ended in August of 2002. I go every 3 months for check by oncologist. I now find myself getting more anxious as time passes. Just waiting for the other shoe to drop. Was told there is usually about 2 year remission and then reoccurance, and a 5 yr. life expectancy. I am having a CT scan done next week, just because of my history. Really scared they will find something. I also do not know how to get back to living. By the way this type of cancer is treated the same as ovarian, and prognosis is the same, I am stage 3c. Would love to hear how you are coping. Minnie",
      "MessageIndex": 3,
      "PostDate": "06/05/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,549,0.htm",
      "Title": "Does Anyone Else Wonder What To Do Now That The Treatments Are Over?"
    },
    {
      "AuthorID": "minnie_p",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/minnie_p",
      "Content": "Dear Deborah, Your story sounds so sad, I wish I could give you a hug, I know that wouldn't cure you but it might make you feel better. I was wondering if there are any cancer survivor groups in your area, if so you might want to give that a try. I am not a joiner by nature but I have been going to the meetings and it is helpful just to talk to someone who can completely understand your feelings. I hope you can find a group, or keep writing on this message board, we are all out to help one another if we can. Hpoe things take a turn for the better for you.",
      "MessageIndex": 5,
      "PostDate": "09/05/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,549,0.htm",
      "Title": "Does Anyone Else Wonder What To Do Now That The Treatments Are Over?"
    }
  ]
}