{
  "AuthorID": "mitty33",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
  "Posts": [
    {
      "AuthorID": "mitty33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
      "Content": "when I was taking my radiation treatments I had painful joints and just hurt all over. My radiation doctor and even his nurse said it was the arimidex. I saw my provider doctor and he changed me to aromasin and with in a day or so felt so much better and have not had the pain like that again. I was surprized how soon I felt better that way. Hope this helps.",
      "MessageIndex": 1,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71223,0.htm",
      "Title": "ARIMIDEX NEW USER -PAIN"
    },
    {
      "AuthorID": "mitty33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
      "Content": "Thank you Catouheart for your message. it sure helped me alot to feel better about what my decision for treatments. I had stage 2 Inflamatory BC on the right side. scared to death as my brother, Mom and Dad have all died from cancer. I had chemo, then a double mastectomy and then radiation. I always questioned if I over did it, but those same thoughts come to me, I battled it as aggresively as I could not wanting it to ever come back as we all want. I too was proud of my breasts and blonde hair. but lost them both. now I have no breasts as I didn't reconstruct and my hair came back in dark. But I am cancer free. Praise to the Lord for that!! and for you.",
      "MessageIndex": 9,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71191,0.htm",
      "Title": "stg 2 /double mastectomy vs. radiation"
    },
    {
      "AuthorID": "mitty33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
      "Content": "I was searching for answers to pain and discomfort when I found this site. It's a comfort already to know others are out there like me. My discomfort is under my right arm and feels like I am wearing a too tight shirt(like from the bra up) but now I have a achy pain along them top of my shoulder and moving across the base of my neck to the left side. I told my doctor about it as he said if I had a pain that stayed he wanted to know about it, he did a scan and said no cancer. but never did or said anything about the pain. sometimes i feel like the big puffy skin under my arm is cutting off the circulation in my arms and fingers. my fingers have been tingly and numby since the chemo treatment inOct 2010 to Feb 2011. I live in a small town and my treatments where 75 miles away one way, so to have someone to talk to  would really help alot as I don't have a support group. thank you in advance.",
      "MessageIndex": 0,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71226,0.htm",
      "Title": "mastectomy pain?"
    },
    {
      "AuthorID": "mitty33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
      "Content": " thank you, Angie33, I will see if I can get into the massage therapist. I did see one after my surgery but I sure would like to see her again. It was amazing to me the massage that is done to help.",
      "MessageIndex": 2,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71226,0.htm",
      "Title": "mastectomy pain?"
    },
    {
      "AuthorID": "mitty33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mitty33",
      "Content": "thanks, I have not heard of it but I will be looking for it. I have achy, puffy feeling in my shoulders. I am also doing Strong Women Strong Bones. I use a 5 pound weights for that. I was wondering if that is too much for that kind of surgery? I can lift more than that but I am wondering if the weight is not good for my shoulders and mastecomy?  thanks for helping me",
      "MessageIndex": 4,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71226,0.htm",
      "Title": "mastectomy pain?"
    }
  ]
}