{
  "AuthorID": "MLindaG",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
  "Posts": [
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": "Hi!  I was diagnosed with breast cancer June 11th and I'm 59 years old.  I ended up with Chemo first (I had a very aggressive form of cancer and they wanted to stop it from spreading).  I was told 14 days after starting A/C I would lose my hair. The morning of the 14th day I tugged on my hair....nothing by 4 pm I tugged and go a fist full of hair.  I went to the wig shop the next day and had my hair cut off.   I went to a wig shop that specializes in wig's for cancer patients here in my area and picked out a wig the week before my hair was to fall out. They have to order it so it can take a few days to get the wig you want.   We talked with the wig shop owner about others shaving their heads in support and she said that many of the cancer patients really disliked it because when you are walking around the house with no hair you don't think about the fact that you have no hair until you look in a mirror.  When you see your loved ones with shaved heads - all you think about is how you must look with no hair.  A constant reminder of yourself.  She advises people not to do it.  I think there is a difference between a shaved head and your hair falling out......... I actually was not looking forward to my hair falling out either but I kept telling my self.......my hair falling out means the chemo is working and I want the chemo to work!  I did not have my hair totally shaved off.........I had them leave a half inch of hair and I'm glad I did as most of the hair falls out but not all of it.  Wigs are hot and mine was tight on my big head.  I find scarves to be equally hot.  Around the house I don't wear anything.  The best support I had is my husband and family to accept that I don't wear anything around my own house and that they were all OK with that.  My grand daughter who is 3 said Grandma you look like baby Luca.......newborn with very little hair LOL  You've got to have a sence of humor with all this!!!  No doom and gloom!  My husband tells me all the time I'm beautiful just the way I am!  Now that is support!  LOL  (All the hair I have has turned to snow white) I just finished my Chemo on Dec. 20th I'm getting some peach fuzz. I think I would have felt bad if others would have shaved their heads........of course I told my sister that the only way she could show support was to shave her head and she was like sorry but no way!  Hahaha I knew that would be her response! LOL  You do get over it.  My wig looked so natural that I was at a luncheon and two members came over and asked when I was going to lose my hair!  I even had my brother at Christmas time ask if I had lost my hair!  Now that is a great wig!!   I just got my MRI result and the cancer is all gone in my breast and lymph.  I will be having surgery on the 23rd (They will take some tissue samples to send to pathology and also remove all the lymph nodes) and radiation in about 6 weeks.  Support to me was someone bringing us dinner occasionally.........bringing over a comedy to watch..........taking me to chemo and keeping me laughing throughout the whole thing!  Going out to lunch after each chemo session.  Give your Mom a great big hug everytime you see her! ",
      "MessageIndex": 3,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69258,0.htm",
      "Title": "supporting someone with cancer"
    },
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": "My breast cancer was found on my yearly mammogram.  A friend of mine had a lump which was dismissed as a cyst.  A year later when she went for her mammogram she had brain, breast, liver and bone cancer.  My niece at 29 years old found a lump which her ob-gyn said it probably is nothing.  6 months later when she went back because she still felt it.....she had an 11 cm mass over both breasts!  My feeling is never dismiss this as nothing.  I would wait the month as suggested and then if it is still there I would have the biopsy and make sure it truly is nothing which it can be.......my sister has had two \"fibrous lumps of nothing\" removed in the past 6 years.  Scaring and dimpling are nothing in compared to your life. ",
      "MessageIndex": 4,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69794,0.htm",
      "Title": "lump doesn't show up on mammogram or ultrasound, do I need an excision biopsy?"
    },
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": " Hi Wendy, So you gained this all since Chemo/Rads?  Do you feel like your metabolism has changed or do you just think the fact that you can't exercise is what the difference is?  What medication are you on?  It is very hard to feel the pain of Fibromyalgia and feel like your old self.  Are there any pain clinic's in your area.  I have heard that they can be a great help for this type of pain.  I'm assuming you've talked to your oncologist and medical Dr.  plus the specialist that helps you with the Fibromyalgia.  Hoping this gets better for you. ",
      "MessageIndex": 2,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71411,0.htm",
      "Title": "post chemo weight gain"
    },
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": "Hi! I was diagnosed with triple negative breast cancer in June of this year.  It was considered stage 3 as I did have lymph node involvement.  What the oncologist said to me is while tnbc is invasive and fast growing it also responds very well to chemo.  Mine was 3.5 centimeters.  At the midpoint of my chemo it had shrunk and they could no longer feel the lump in my lymph node.  My last visit 3 weeks ago they said is was shrunk to at least 2 centimeters and could possibly be less as sometimes as the cancer leaves will leave some fiberous tissue but has no cancer.  I finished my chemo on Dec. 20th.  I will have my surgery sometime mid January (they did the chemo first to stop the invasiveness of the cancer) and then on to radiation in Feb.  My oncologist has been nothing but positive on how we are going to have a great outcome.  what stage is she?  What did the oncologist have to say about her prognosis? Do you need to go to a different oncologist?  Stop reading things on the internet!!!!  I did that one day and was kind of down about it all............lots of negative stuff about tnbc.  How old is your mil...........I'm 59 and have a lot to live for..........kids and grandkids...........I'm not ready to not fight.  On the other hand..........if it has spread to a lot of places I might be in the mode. ",
      "MessageIndex": 1,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69726,0.htm",
      "Title": "need some positive feedback"
    },
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": "Just a quick positive update.  I had my MRI this week and the results were my 3.5 cm lump does not exsist.  I have no cancer in my breast or lymph!  Wow I was blown away by the news!!  They will still do surgery and take out a small sample to send to the pathologist to see if in fact there is no cells in the area.  I will still have to have all my lymph nodes removed and radiation for preventative care but still to have it all gone with the Chemo!  yeah!!  Please let your mil know that tnbc is not a death sentence! ",
      "MessageIndex": 3,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69726,0.htm",
      "Title": "need some positive feedback"
    },
    {
      "AuthorID": "MLindaG",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/MLindaG",
      "Content": "No they did not misdiagnose,  I looked at the mammogram saw the lump. My lymph node was sore and I could feel the lump  in there. I read the pathology report and looked up what it all meant.  I did go to a pharmacist/nutritionist/homeopath for advice and took many supplements to help my progress. I also went to a hypnotist who has some CD's to listen to that does a mind body connection to keep my positive vibes going.  I never want to do chemo ever again if I can help it. My CAT scan initially showed enlarged lymph nodes in my chest wall as well as lower in my left side where they can't take those lymph out.  Those could have been cancer or not.  We don't know.  I embraced the Chemo since chemo works best on rapidly dividing cells and tnbc is fast growing rapidly dividing cells we were all hoping for a good outcome which we had.  When I go to the surgeon I will be sure to discuss the lymph nodes and the pro's and con's of removal.  I see no reason not to do radiation.  There certainly could be cancer at a cellular level and this would take care of it.   .",
      "MessageIndex": 7,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69726,0.htm",
      "Title": "need some positive feedback"
    }
  ]
}