{
  "AuthorID": "mmsurvivor",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
  "Posts": [
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "No and have you had a blood test, I know it does not always show up in that but please be push and demand a better answer.  After all it is your life not the doctors.  All the best http://www.telegraph.co.uk/health/healthnews/7552135/Blood-t   mms",
      "MessageIndex": 29,
      "PostDate": "17/10/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35542,0.htm",
      "Title": "Did anyone's cancer NOT show up on Mammogram or Ultrasound?"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "I also believe Avistan is now being used for breast cancer, it blocks the blood flow to the cancer cell and is less toxic. Ask about that.  MMS On 1/5/2006 Margie f. wrote: hello all my sister was diagnosed recently with stage 2 breast cancer, and will be starting her chemo/radiation protocol this week. i am trying to find a new york city based naturopath to be in charge of her nutritional and alternative approaches to beating this disease. has anyone used or heard of a naturopath in the new york city area who they thought was fabulous? thanks, margie  ",
      "MessageIndex": 2,
      "PostDate": "01/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3936,0.htm",
      "Title": "Finding a Naturopath in New York City"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "Low dose chemo and radiation have been very effective, along with western medicine. YOu might look into Artimisinin (Sp) Cod liver oil, immune support, healthy diet. Lower the stress. In your case as your lymp nodes have been beat up. Use some Young Living lemon oil on the places you can get to . It soothes the area and also their lavender. 1 drop is sufficient. Do not put on raw or open areas it will burn. CoQ10 and Tumeric are also great. Hope this helps. As this \"silly site\" is new if I get a question I have no clue how to answer if it is private. All the best. MMS",
      "MessageIndex": 1,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40984,0.htm",
      "Title": "Alternatives to Chemotherapy"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "Low Dose Chemo and radiation are those that the doc prescibes, such as as 1/2 strength normal dose or even less. I had a tumor in my sinus in May. The gave me 8 1/2 dose radiation treatments and 10 full dose tumore specific. They also gave me 1/4 of the recomended dose of Dexamethasone.I was cancer free in 8 weeks. Some people do better taking much less chemo and radiation. For Me the Mantra is \"less is more\" Works more efficiently for me, way less side effects, and does the job. Side effects from chemo and radiation can be very severe. You need to do all that you can to lower the risks of these. Just do a lot of research. As the one poster here said, we used to have the archives here but they are either gone or hard to find. If you have an estrogen driven cancer you can ask your doc about estrogen blockers. Also look up the alternative natural hormone blockers. All the best mms",
      "MessageIndex": 4,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40984,0.htm",
      "Title": "Alternatives to Chemotherapy"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "On Oct 25, 2009 11:59 AM rsnicosia wrote: So, if I am understanding you correctly, I can request a lower dose radiation than would typically be administered.  Same drugs at lower dosage.  Since my cancer is hormone negative so can't be treated quite the same way as hormone positive, the drugs that are used can cause some side effects that are quite severe.  My surgeon said that she believes that the cancer had not spread, but as a safeguard and to lower the reoccurance possibility, chemo would be the proper protocol.  If I could request lower dosage, that sounds like a perfect solution to my dilemma.  Did I understand you properly?yes you did and yes you have the right to do so. If you have a compasionate doc they should at least hear you out. I first had a cancer that cannot be cured in 2004. It was a bit of a battle to get them to listen but they finally did. I am now in remission form both cancers and doing great. I put it down to alternative and some Western Medicine. Lowering the dose is a wonderful example. Several years ago a pharmacist in the mid west was in the \"greedy\" mode and he cut the patients chemo dose in half or sometimes less. They did not find out for a couple of years. Did anyone die, No , in fact they did rather well. I thought that was a great way to prove a point. He did a study and did not know it but yes he deserved the prison but I found it interesting. All the best",
      "MessageIndex": 6,
      "PostDate": "25/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40984,0.htm",
      "Title": "Alternatives to Chemotherapy"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "maybe things have changed but I was informed as long as you had worked 10 quarters within the last 2-3 years you were eligible. I would try someone else . Get a church group or someone in your area that specializes in this type of help. Ask your doctor or nurse.  each hospital has a social worker who is supposed to be helping in this area. God bless you and may things work out...mms On 8/24/2009 suegal13 wrote: does anyone have any ideas howi can get some financial help while i am going through chemo? i can not get ss dist. from the goverment because i did not work the year before i was disabled. i have had three different surgeries in the last 17 months, but they do not consider me disabled until i had my chem., which i still am going through. i have an aggressive cancer and they are treated me with an aggressive chem regament. i have a beautiful 10 year old son i need to surrport. please help us with answers.  thank you,  sue  ",
      "MessageIndex": 1,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39276,0.htm",
      "Title": "how to i find financial help"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "On Jun 23, 2009 12:00 AM cardsmart wrote: My daughter is 32 and has just gone through all her treatment and things look good, thank God. But her husband wants a divorce. She cannot afford an Attorney. Does anyone know if there is a free or inexpensive service that can help her through this? Any help is greatly appreciated. I am sorry for your daughter but this is a common happening. (The husband with complaints below unfortunately you had big problems long before the cancer showed up) I was an oncology nurse and many times the husband fled at the word cancer and never came back. There are simple forms on the web that help someone file a divorce petition for as little as $500, depending on the state. See if a friend can help you find someone and get a reference. Go to the local court and ask around. Take care and be well. MMS",
      "MessageIndex": 14,
      "PostDate": "18/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14161,0.htm",
      "Title": "Divorce and Breast Cancer"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "Private reply sent....but it works wonders. mms On 10/5/2009 Guinness wrote: Would like to open up a discussion regarding cannabis. Anyone using to help symptoms? Has it helped? How often? Thank you in advance.  ",
      "MessageIndex": 4,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40411,0.htm",
      "Title": "Anyone using Cannabis? (medical marijuana)"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": " i Ihope your partner takes you seriously..She is in denial maybe she suspected. But drag her along to a doctor if you can. I will send a private email and give some tips. Unfortunately the lady below probably had a good suggestion but you cannot post openly on this site as you don't want private information hanging out there. Hope she sends you a private email. MMS On 2/12/2008 Windsurfer1 wrote: My partner (64) is a breast cancer survivor. She had a lumpectomy, radiations and chemo over ten years ago and her annual mammograms have all been negative(she had one two weeks ago). To make a long story short, while we were intimate recently I smelled cancer near her left breast ( my mom had breast cancer, and I will never forget the smell) She is going to get and ultrasound, probably within the month, but other than that is not taking me seriously. I am very upset about this. Am I over-reacting? I care deeply for my partner and don't want to lose her. Does anyone have any input?  ",
      "MessageIndex": 8,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
      "Title": "Cancer smell"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "On May 05, 2010 1:07 AM SusanL wrote: Yada, yada, yada. Show me the clinical trials. There is no worldwide conspiracy; if it really worked there would be irrefutable evidence. Unfortunately those who cannot see the benefits of faith and natural healing, always listen to the doctors who do NOT always know what they are doing.  If it does not hurt you then go for it.  The clinical trials are a bit of a joke, how many lawsuits for how many products that are defective are now in progress, and how many people will die before they pull the sanctioned medicine.  Listen to the ads on tv.  Side effects, Death, suicide, loss of brain function.  This is all from so called medicine that have had hundreds of clinical trials.  There is no absolute for either side.  Having an open mind can help with healing.  MMS",
      "MessageIndex": 11,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45850,0.htm",
      "Title": "apricotpits / vitamin B17"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "On May 05, 2010 1:07 AM SusanL wrote: Yada, yada, yada. Show me the clinical trials. There is no worldwide conspiracy; if it really worked there would be irrefutable evidence. Unfortunately those who cannot see the benefits of faith and natural healing, always listen to the doctors who do NOT always know what they are doing.  If it does not hurt you then go for it.  The clinical trials are a bit of a joke, how many lawsuits for how many products that are defective are now in progress, and how many people will die before they pull the sanctioned medicine.  Listen to the ads on tv.  Side effects, Death, suicide, loss of brain function.  This is all from so called medicine that have had hundreds of clinical trials.  There is no absolute for either side.  Having an open mind can help with healing.  MMS",
      "MessageIndex": 10,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45850,0.htm",
      "Title": "apricotpits / vitamin B17"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "Der Ryder, It is normal to panic but do not give up. There is always hope for help. Breast cancer can metastasize, I have several friends who had bone involvement, but they are doing fine.  Hopefully you have competent doctors if you are worried get a second opinion.  Have a friend come by, talk to others, on this website there are many answers and people you can talk to online, go to the home page. the medicine for breast cancer has had great advancements and bone mets usually is treated with some radiaiton. I can only pray for you and know that out there many are like you. Unfortunaely fear, while normal when first diagnosed, can be our enemy if we let it overtake you.  Incaseyou are wondering, I had end stage Multiple Myeloma, which is incurable, and 7 years later I am here. Yes I have relapses and struggles but am holding my own, if you look at my profile you can see my story. All the best and prayers for a recovery.",
      "MessageIndex": 1,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60327,0.htm",
      "Title": "Panic"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "I AM ON THE west coast and looking to help a young 36 year old woman with breast cancer with MEts.  Which hospitals are the most understanding and compassionate. She has no insurance but is self insured so has some money..Please help doc name would be great!  Many thanks..MMS",
      "MessageIndex": 0,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35376,0.htm",
      "Title": "Need best treatment for Ohio patient Near the PA border"
    },
    {
      "AuthorID": "mmsurvivor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/mmsurvivor",
      "Content": "Only God knows the answer to your question. The docs can only assume based on her diagnosis.  Everyone is different and how and why we survive is not always a \"known\" Pray for a healing and instead of focusing on what the doc said re time, spend quality time with your sister and do all you can to make her comfortable.  As individuals we all can suvive differently based on our chemical make up our personalities and maybe is it our time to go. I wish you all the best and it us lovely to know you care so much.  MMS On 2/20/2009 paddy 01 wrote: I have posted here before and tonight I posted on the brain cancer forum,,they were nice to tell me to come here but then again I'm not sure if this is the right one either.  I have been reading where some loved ones have been given \"X\" amount of time left.  Since January my baby (51) sister is one of them. When we were told she had had a recent MRI.  She has been dealing with met.breast ca. in her cerebellum, and there are some bone involvement also.  So I guess my question is what does the Dr. know that we don't?  He said that there isn't anything new in her brain her two spots aren't really any bigger.  She takes only.5 mg of decadron twice a day.   I know there are people out there that take much more.,her pain is relieved with pain patches 100's.  What is it that tells the DRS.  that it is almost over??? Does anyone have any knowledge or experience in this? I know that every cancer is as different as the one who has it. Does anyone know how or what the progression  will be?  I will take anything as a generalzation.  Thank you, waiting for your replies.  ",
      "MessageIndex": 1,
      "PostDate": "20/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33395,0.htm",
      "Title": "Looking for answers in all the wrong places....."
    }
  ]
}