{
  "AuthorID": "monicag",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
  "Posts": [
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "I'm very sorry that you are going through this horrible disease. I had bilateral breast cancer, surgery, and 9 months of chemo. As tough as the whole thing was, I made it! Chemo is not a walk in the park, but depending on how often you have the treatments you will be able to have good weeks of high functioning. It is not 100% guaranteed that there will be no recurrence, but it is so far the best available treatment. At the end of it all, you will be able to look back and realize that we survivors are happy and glad to be alive. Keep up the good fight! This is a challenge, not a death sentence. Peace, Monica",
      "MessageIndex": 4,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62698,0.htm",
      "Title": "alternative to chemo and radiation therapy"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "I hope that you get the information you are looking for and you make the decision that's right for you. Please write back and let me know how u r doing. Happy holidays to you too :)",
      "MessageIndex": 6,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62698,0.htm",
      "Title": "alternative to chemo and radiation therapy"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "I don't have metastatic breast cancer, but I can only imagine what this horrible monster is doing to you. I'm here to hear you. Anything you want to say, yell, scream, I'm here. I'm praying for you and sending you hugs.",
      "MessageIndex": 1,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61026,0.htm",
      "Title": "New hear"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "I'm also very concerned and waiting to hear from her. Please let me know if any of you finds out any news. Thanks, Monica",
      "MessageIndex": 14,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60834,0.htm",
      "Title": "I am 20 found lump, nipple is inverting and need advice!"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "I'm also very concerned and waiting to hear from her. Please let me know if any of you finds out any news. Thanks, Monica",
      "MessageIndex": 20,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60834,0.htm",
      "Title": "I am 20 found lump, nipple is inverting and need advice!"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "Andy, as a breast cancer survivor I'd like to add to what others have said: men can and do get breast cancer. The organizations you mention are doing a fenomenal job of keeping the public informed about this disease that affects in1 in 3 women over the age of 55 and 1 in 8 women younger than 55. Too bad that you are tired of pink ribbons: they are here to stay, they don't cause any harm, and the color is lovely and bright, just like the attitude of us survivors of this monstrous disease. No matter what type of cancer: we are united in this fight. I keep you in my thoughts and prayers so that you may get insight, peace, compassion and wisdom. Monica",
      "MessageIndex": 8,
      "PostDate": "20/10/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61555,0.htm",
      "Title": "Importance of Vit D & Breast C"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "After finishing chemo, I was put on Arimidex, which gave me severe pain in my joints, hands, low back and feet. At night, at would close my hands in my sleep into tight fists and would wake up with my hands really hard and sore. My oncologist switched me to Aromasin, which I have used for the past 2 years. I'm in chronic pain, my oncologist says that it is common, and that it may never go away, but it is more tolerable than the pain I had while on Arimidex. Pain is very common while on these medications. I don't understand how there are oncologists that say they \"never heard of it\". Maybe they are not just listening to their patients.",
      "MessageIndex": 3,
      "PostDate": "05/05/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,58876,0.htm",
      "Title": "Aromisin side effects"
    },
    {
      "AuthorID": "monicag",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monicag",
      "Content": "Xela, I'm really sorry that you are having such significant impairment from the treatment. Paclitaxel (Taxol) does cause severe pain and numbness and other forms of neuropathy as well. After the treatment the intensity of the pain may subside, but you, like thousands of us, might still experience pain and impairment for the rest of your life. My oncologist did prescribe pain medication and additionally I consulted with a pain specialist who put me on Lyrica, which helps a lot. I hope you will find some type of relief from this monster. Monica",
      "MessageIndex": 5,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59022,0.htm",
      "Title": "peripheral neuropathy cause by taxol"
    }
  ]
}