{
  "AuthorID": "Monique39",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Monique39",
  "Posts": [
    {
      "AuthorID": "Monique39",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Monique39",
      "Content": "Hi My Name is Monique and I am 39yrs with 4 children, I was recently told that my breast cancer was back and it was stage IV with spread to liver, bones, chestwall and lymph nodes.  I have been reading information on the internet for 2 weeks straight and I am confused. I would like to talk to any that is winning the fight against stage IV and what it is you might be doing. I am look at alternative options, since I went through 16 months of chemo and did radiation when I was first diagnosied in 2003.  So any information would be much appreaciated. Thanks, Monique",
      "MessageIndex": 0,
      "PostDate": "02/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10940,0.htm",
      "Title": "Stage IV Breast Cancer Looking for Advice"
    },
    {
      "AuthorID": "Monique39",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Monique39",
      "Content": "  On 3/1/2007 Lsadallas wrote: I think you meant metastatic BC. I was diagnosed with stage 4 BC in 2004. I had tumors in the breast, lungs and liver. I also did the lumpectomy, chemo and radiation in 2004. By 2005, I had no cancer. Then in 2006 it came back in my liver. Again, I did surgery and chemo. I am now disease free again. I was 38 yrs. old when this started. I never thought I would live to see 40. This month I will be 41. Your daughter can beat this. I also went through what she did with losing my hair both times and dealing with all the side effects. It was all worth it. If she is having trouble with dealing with the stress of treating her cancer, there is nothing wrong with having her doctor give her anti-depressants. It is very difficult to go through what she is dealing with, and it is hard to deal with the stress of feeling sooooo sick and wondering if you are going to survive. Many, many cancer patients need help dealing with treatment, and anti-depressants can help. If her doctors ever say there is nothing else they can do to help her, find a new doctor. There are new drugs coming out all the time. The chemo I took in 2006 wasn't available when I was first dianosed in 2004. Tell her to keep fighting and keep praying. If she is feeling positive and keeps up with her treatment, she can win. I am living proof that stage 4 can be beat. I am a 3 yr. survivor and plan to celebrate yrs. 4, 5, and more. She can do it too. God Bless you all, He has certainly been blessing me and I pray that she will receive that kind of blessing too. Lisa from Dallas    Hi Lisa Your post gives me hope, I was diagnosied with breast cancer in 2003 did all the usual stuff (chemo, surgery, radiation) and was told for the last 2 years that i was cancer free. How ever yeasterday 3/20/07 I was told that I have stage 4 breast cancer and that it spread to the bones , liver, chestwall and lymphnodes. I just turned  39 and have 4 kids and an a amazing husband and I am not ready to check out.  I am glad to see that this can be fought and won.  Thanks for  sharing your story it really helps. If you have an suggestions a can use all the help I can get. Monique",
      "MessageIndex": 5,
      "PostDate": "21/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9984,0.htm",
      "Title": "metaplastic brest cancer"
    }
  ]
}