{
  "AuthorID": "monmouth",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
  "Posts": [
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Maybe Lymphedema?",
      "MessageIndex": 1,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66339,0.htm",
      "Title": "lumps under arms"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Apr 25, 2012 12:41 AM susier wrote: I don't know how it will affect you but I do know since the chemo I have not been able to tolerate anything they try to give me. The tamoxifen was weight gain severe cramping after 7 months my regular doctor said I had to get off the tamoxifen.  I had a hysterectomy thinking I wouldn't need anything. The Arimidex came next. I ended up with what felt like sever carpal tunnel walk like I was 90 after sitting for 15 minute and even the bones felt like they just could break. That was after 1 month.  Now the aromasin to be is the worst. Body and joint pain plus the hair lost oh yeah the severe knee pain. That's what 1 week did to me.  Still on anti depresents cause I don't have anything to deal with the hotflashes. YUCK! Damned if we do and Damned if we don't.  That abouts sums it up.   Yup, that about sums it up !!!I thought post cancer was back to work and my \"normal\" life.",
      "MessageIndex": 108,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Mar 11, 2012 2:52 AM susier wrote: On Jan 19, 2012 9:08 PM Lisaepstein wrote: I just started taking Arimidex and I am getting headaches and I am having really bad heart burn and lots of gas pain. I called the pharmacy and they told me these were normal. The Arimidex didn't give me heart burn but maybe that is because I have been on previcid daily. If you start hurting from muscle and bone pain you can be sure it is the Arimidex. I already have tried the Tamoxifen for 7 months and just this January after a full knee replacement (which had nothing to do with the breast cancer) I have been put on Arimidex so the odds of reoccuring breast cancer would be less since I show up in the high risk group. In almost 3 months my pain, cramps of the muscles , joints and bones have went to severe. Doctor told me  to get off of the Arimidex for 3 wks to see if there is a change. So far it has been one week and I am still walking like a woman of 90 and the pain has not lesson yet (but then again it hasn't been 3wks).  I don't know about thes drugs, they may help one thing but ruin and affect so much more.  Depression sets in so much because I can't walk a block with out pain in my whole body.  But we have to keep keeping on! So I am praying for all my WARRIOR SISTERS and those who didn't make it.  There has to be a better way.  Joint pain or not I will be walking in the Mother's Day Walk for us all ( Walking F.A.B (WALKING FOR ALL BOOBIES).  God Bless you and I hope that those are the only side effects you will experience. It took 2 months after I stopped taking Arimidex you feel relief.  Still not perfect, but WOW .  I was taking a break so I could attend a special event for my son.  I could not attend with the pain.  Awful!",
      "MessageIndex": 70,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I have been on 4 medications. Awful except Tamoxifen. However I was scared with possible life threatening side effects even though very low %.  Since HER positive reoccurance is non detectable I went back to Arimidex. I can hardly stand it, but I make myself.  It's my decision. My cousin chose to take nothing and has tests constantly for all body parts.  She is HER also.  It's what your mind and side effects are comfortable with. I thought chemo was it.  I wish that was it for me.  Good luck and my prayers are with you to be strong.",
      "MessageIndex": 33,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Aug 13, 2006 12:00 AM Willowisp80 wrote: I am also new to this site. I just started taking this drug in June. At fist I was fine but recently I've been having pains. I wake up several times a night with pains in my arms and fingers. If I get up and move around it seems to get better, even now just typing this I'm feeling pain. I didn't know what it was but now I'm wondering if it is this. I have an appointment with my surgeon on Tuesday and will discuss this with him at that time. I did take a Rx for my hands,fingers and feet. No pain at all. It was great until I itched like you wouldn't believe.  Maybe you won't have the side effect!",
      "MessageIndex": 69,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Dec 24, 2005 12:00 AM Dixierae wrote: Also, like you, I'm new to this site. I've been on Arimidex for many years. I was switched to Arimidex after taking Tamoxifin for more than a decade. I believed it was a \"better\" treatment. My breast cancer was in 1980 and after 7 years it metastacized into my lung. That was when I began the drug treatments. Like you, at first I didn't notice any side effects. But for the last 2-3 years I've experienced severe pain in my neck and back, specifically in the thorax region. It is truly debilitating at times. My doctor told me it was degenerative arthritus. He said it was probably brought on as a result of the radiation treatment in 1980. But as I read your and other women's remarks who are on this treatment, I have to wonder if it is the Arimidex. I have no idea why nobody wants to let the Arimidex take responsibility.  That is what it is in my case. I have had bone scans ,MRIs and there is no reason for the horror I feel. Whether to remain on Arimidex or look for an alternative is a personal choice. I struggle everyday because the pain is so intense, but I do not want cancer to return.",
      "MessageIndex": 68,
      "PostDate": "28/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Apr 24, 2012 9:26 PM deezin wrote: June I will be on Arimidex for 2 yrs. after stage 3B Invasive lobular , bilateral mastectomy, lymph nodes cancer & removed, chemo & radiation. I am dealing with the joint pain but now my cholesterol is 285 and liver enzymes are elevated way too high. Had cat scan today to rule out things and was told from oncologist that it may be the Arimidex causing this so I am thinking if all is fine I will have to stop Arimidex and take a chance of BC coming back . I don't see any other choice. Has anyone else had high cholesterol or liver problems?  Yes, high cholesterol. But so much pain I have taken a mental break to decide what I need to do.  I'm going for a 2nd and 3rd opinions on this post cancer stuff. Monmouth",
      "MessageIndex": 107,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Thx but I cannot take anything that tries to replace estrogen!!  Not even Soy.  You may want to check too.",
      "MessageIndex": 34,
      "PostDate": "16/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I so very much I had knowledge to share.  I'm sure someone will get with you ",
      "MessageIndex": 2,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,87842,0.htm",
      "Title": "Breast Cancer mets to lungs"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I also have Arthritis.  I have had 2 hip replacements and 2 knee surgeries.  I finally got to a good point with my knees where I don't need replacement surgery. Now every joint aches.  I used to thrive at working 50 - 70 hours per week. Now 2 hours a day of volunteer work is pushing it!  My back is a new area and often is severe. Takes away all my patience which I usually have an unlimited supply of.  I, like you, just want me back. I take Meloxicam which helps but it's not a med to stay on forever. I just made up my mind to keep moving ahead with a smile.  Sometimes i feel the chemo was the easy part of this deal. The more time goes on, the more I accept everything. Yes fatigue comes and goes. Do you take B complex, Vit D, magnesium?  I take other bone stuff too.  I take Effexor which I was taking at a much lower dose for menopause moods.  I take a higher dose now for mood and hot flashes.  Still get flashes. (how do people work with these?) However, the Effexor does give me energy. I continue to volunteer for my mind and I miss my job.  I can also work as my pain allows me unlike paying job. It has been wonderful for me!!! Ask me any questions.  You have helped me too. I had one PA suggest the option of stopping the cancer meds.  What is she crazy?  She also said work would be good.  Maybe she's not familiar with the intense pain that comes along with these meds.  Hang in there. I have tried different times of day and AM is still best for me. It gives me about 6 hours of time before my body is shot for the day. Even the flashes wait till later. Monmouth",
      "MessageIndex": 6,
      "PostDate": "27/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61211,0.htm",
      "Title": "Arinidex - any difference with side effects if taken in morning or before bed?"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Thank you, mspinkladybug I am going to start taking tonight.  The joint pains are better this round but I have arthritis which seems to just heighten the pain.  I am learning to live with it. I just can't go back to work .",
      "MessageIndex": 2,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61211,0.htm",
      "Title": "Arinidex - any difference with side effects if taken in morning or before bed?"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I, too have had enough !  I am thankful to be alive and these discussions are uplifting  Thank you all. The PA that spoke with me when my Dr was out suggested to stop all together. That surprised me.  No way! Anyway I like to hear all suggestions offered.  Thank you soooooo much.",
      "MessageIndex": 0,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61211,0.htm",
      "Title": "Arinidex - any difference with side effects if taken in morning or before bed?"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I was on all medications trying to see which one was less evil.  When I stopped meds, pain began to lesson.  Probably 6 mos before I could say it was better. Some pain never totally left but my quality of life is back. Bedridden in pain was barely life.  It's a personal decision that took me a long time to be OK with. I tried everything to stay on the Arimidex. A list of suggestions. I pray for you.",
      "MessageIndex": 206,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "I wore simple over the head cotton, comfy sports bra.  I did have reconstruction. Now I mostly wear no bra. No longer need to worry about sagging. BTW I also had a port. Sear belt in car rubs by it and drives me crazy.  I have other surgical scars and I get the willies if I rub against them. ",
      "MessageIndex": 42,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32019,0.htm",
      "Title": "Bra suggestions following lumpectomy"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Aromasin, Arimedex, and Femara were horrid!!!  I was basically bed ridden in PAIN.  I was going to take the 5 years.  My son had a hockey tournament in Philadelphia and it was first travel competition. We live in NC.  I stopped Arimidex 2 months prior so I could make the trip. I was able to go and in comparison I felt good.  I came home and made the decision my Dr had been suggesting - stop taking the Arimidex.  That was over 2 years ago. My Dr is a Duke hospital Dr .  So was 2nd opinion Dr . It took awhile to become comfortable with my decision.  Some pain never totally went away. There is more to my story but basically I could not bare the medications.   It's a personal decision which has to do with type of cancer and the stage. And it's definitely a tough one. Please ask me any questions you may have. Cancer is the devil and if I can help someone in any way I am more than happy to.",
      "MessageIndex": 205,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Arimidexand I'm post",
      "MessageIndex": 13,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64896,0.htm",
      "Title": "Arimidex versus Tamoxifen??"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Dec 04, 2011 11:06 PM pipperpain wrote: For anyone who will respond --how long have patients been on this treatment and what was the procedure for receiving it?    I'm wondering what standard procedure is and if there is one.   Thanks in advance I had received chemo for 6 treatments along with Herceptin.  I continued the Herception for a total of 12 treatments.  It was given via IV.  I had a port since it is very difficult to find veins in my arm.  Also after surgery, only my left arm could be used.  God bless you and ask me anything that i can help with. Monmouth",
      "MessageIndex": 1,
      "PostDate": "02/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63197,0.htm",
      "Title": "herceptin treatment for her II + cancer"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Hi. I didn't have Perjeta.  I had Carboplatin (Paraplatin) and Neulasta. I did have Herceptin and Taxotere. I pray for you deeply. Talk with me anytime.",
      "MessageIndex": 1,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88024,0.htm",
      "Title": "chemo combo: herceptin, perjeta and taxotere"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "The side effects I am having form the after meds will not permit me to work. I'd be too unreliable.  I volunteer as often as my health allows. I feel more back to normal.  I always liked working. I have 2 kids which make me work thru pain and doesn't allow for much pity.. Although I do get caught up in some.. And \"Yes\" I do think of it returning, but I have always prayed since Iwas a little girl. What did you used to do? Monmouth",
      "MessageIndex": 2,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66292,0.htm",
      "Title": "Life after cancer"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "On Feb 18, 2009 12:00 AM betteanne wrote: Has anyone here suffered pain / nerve damage from the Taxol Chemo treatments?  I have severe foot pain and my hands are still numb from treatments that ended six weeks ago. Thanks Hi   My left hand and left toes were awful.  Numb and pain.  I was given an Rx whichI cannot remember name at this moment (memory issue) and it was great.  But I started to itch terribly.  First after shower and just arms.  Then whole body.  Even my face.  Finally I chose the Pain instead which returned immediatly. Now the good part.  After 9 months - gone! Toes a bit numb, but painfree.  Hand and fingers back to norma. Who knows.  I do take B complex. I wish you well.  Maybe an Rx will work for you. It just effected ALL my nerves even in my mouth.",
      "MessageIndex": 31,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    },
    {
      "AuthorID": "monmouth",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/monmouth",
      "Content": "Any comments on tooth decay or loss due to cancer, chemo, or meds?   Thank you",
      "MessageIndex": 0,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63082,0.htm",
      "Title": "teeth"
    }
  ]
}