{
  "AuthorID": "Moonwalker",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
  "Posts": [
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "I am a female 68 years will be 69 this coming May. I have always been very healthy, never in hospital, never had an operation, a cold or flu, had two pregnancies and breastfed without any complications and the babies were very healthy. I never felt sick, exercised a lot, always a vegetarian and thus had healthy food. All of a sudden in May 2009: 1] I had a vaginal hemorrhage, went immediately to the hospital and was referred to an Oncologist. In four days I was diagnosed with cancer though I did not meet the criteria for a Cervical Cancer diagnosis.   2] Cervical Cancer stage 2. Due to ignorance on my behalf and without any further research I accepted immediate treatments: chemo x50 + radio x50 + brachytherapies for 3 days each x3, I was strong, did not feel sick with the treatments and was able to take all these therapies and hold on very well though I had fatigue. October 19th. 2009 after by check up my Oncologist told me the tumor had disappeared but I had to be careful and do my monthly follow ups and later each three months. A month after treatments were finished, I had many image tests of all vital organs to see if any damage had occurred due to treatments or metastasis. Everything was clean. I was then send to a Radiologist for a bilateral mammogram and MRI, had two clinical tests which were clean. The right side mammogram showed clustered mini-calcifications, it was painful due to compression. I was immediately referred to a breast surgeon I had a Grade 1 Breast Cancer. The next day I was hospitalized and had a surgical biopsy with a slight re-accommodation of the gland. Next day I left the hospital and was to return in four days for check-up with the surgeon. Four days later he already had my pathology report which said: Grade 1 BC further studies needed. Next day I was hospitalized and had a single radical mastectomy and three lymph node dissections. After ten days in hospital I was given the pathology report with: ER+92, PR negative, HER2 Neu Negative. I went home holding my soul in my hands. A month later the surgeon said my scar was healing well and that I was “cured” but I had to take a pill for 5 years. He again referred me to my Chemotherapist who said I could not take Tamoxifen because of my previous cancer and one of the Tamoxifen side effects are tumors in the genital area which was dangerous for me and that another chemo was too much for my body. He then said I would be put on Femara starting April 5, 2010. I have had time for research and did so. The side effects were very bad and I paid through the internet for a UK study about two of the worst and most dangerous side effects from the blood clotting caused by Femara and were the following: Heart or brain stroke. I kept on researching and bought another paper from a German Oncology Clinic, the results were the same. Then I searched the Internet and found excellent information with the same results. No doubts in my mind. During my research I contacted a Rheumatologist, explained the moderate joint, muscle, bone and articulation pains including the hurt on my feet. He told me that chemo and radio induce a moderate to severe arthritis causing inflammation of the joints and I had to get rid of the toxins in my body. I began a special treatment to get those toxins out of my system. I am doing much better now and only a month has passed but I will continue with my treatment.   Yesterday I went to see my surgeon and asked him to immediately practice an Oncotype DX Test. He asked why? I told him that I know that test would provide results if any or more of the 21 genes that are studied show chances for a recurrence or metastasis. He did not like it very much but I was firm in my decision. He ordered the Oncotype test right away. I then said I will not take any AI pills no matter what and showed him a study that was done in the US with my pathology results. Survival Chances: with no adjuvant therapies 10 to 12 years well and without cancer symptoms. With Chemo and or AI pills I would gain a 1% which means around 2 or 3 more years. He accepted my decision and agreed with it. I asked if cancer or a metastasis comes up will he provide me with morphine if the pain is bad. He said yes he would. Then I told him that for my osteoporosis and general health I was taking Calcium, Vitamin D, Magnesium, Vitamin B complex, Vitamin K12 and several natural anti oxidants, that I had added wild fish to my vegetarian diet and was taking lots of fluids. I will keep on with my healthy eating and fluids to get rid of the toxins in my body.   I will soon be 69 + 10 or 12 years of a more or less safe prognosis would make me 79 or 81 years old but pain free. Why live 10 years will AI and lots of pain and perhaps a stroke? Is it worth it? I personally don’t think so. I prefer life quality and not quantity.   God bless you all cancer patients.   Moonwalker",
      "MessageIndex": 0,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45299,0.htm",
      "Title": "Chemo induced arthritis and AI pains"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Dear fluffy15: Thank you for your post. I am so sorry you have had a very bad and terrible experience with radioactive iodine, now that you mentioned it I also had the same thing, perhaps the difference was that the amount administered to me was so small because my weight was that of 14 year old boy and I was around 45 + years old, tall and have big bones. In my case that one time I got lucky as my doctor had several consultations with his collegues to be sure he would not use too much and hurt me & he did a fine job. I don't know how your Endocrinologist calculated how much of the iodine he had to use on you but I believe your Endo simply over did it, there is an International chart but it should be  adjusted to the patients age, weight, bone density and several others. These are the mistakes that anger me, we are the patients who seek help to get better because we are in pain, they are the ones who are supposed to know so as not to hurt us. This is becomming too common now a days. Your hearing issue has a horrible name, not for you, for the doctor shame on him. Are you taking any meds for the hypo? I take one pill before breakfast and I feel great. Try to drink lots of fluids, juices are great those will help you feel better & perhaps avoid the breath issue, I understand it must be terrible for you. Do you know what happened with the Pathologists in the US? If you wish and have the time Google it, I can not post such a terrible issue. It is good to know because it is a disgrace for those pathologists to have hurt so very many people with and without cancer. That's why it is good to research on our own and ask all we can until we turn green and if possible get a second and third opinion to be on the save side. Of course I don't believe all pathologists do such terrible things, but this issue gives that community a very bad name, unfortunately we are in their hands, but victims are now going to do something about it I believe I heard it will be in Canada because the courts in the US will not favor the victims, it was a scandal in the US.  In my personal opinion each person should have the right to choose their own pathologist and not have to blindly accept who ever the clinic or hospital likes.    Please take care, don't feel bad and remember that what you have is a doctors mistake. If you ever feel you need to vent, write to my personal email I am a good listener. God bless you and regards.  ",
      "MessageIndex": 4,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45299,0.htm",
      "Title": "Chemo induced arthritis and AI pains"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi Susana2: Nice to meet you. I am so sorry you are in the same boat this is hell and I rejected to take any AIs I had researched a lot and NO THANKS I will never take them. I have had enough with the treatments + a mastectomy.I keep on going for my follow ups each three months, but will not accept a single pill from any of the oncologists.  I am now taking full vitamins: B complex, D3, E, K, calcium & magnesium.  Never take vitamins or calcium on an empty stomach always along with your meals, never take the vitamins in full pills break them down and make a powder & take them along with your meals, food helps you absorb the vitamins and won't have stomach problems. I take Calcium and D3 with breakfast, E + K with lunch and B + magnesium with dinner. Then a very healthy diet with lots of greens, blue fish and the rest of fish should be wild or river fish never from a fish farm, don't eat red meat it has too many toxins. Be careful with what you eat make sure there is nothing in them that is related to genetically modified food [GMOS] those are poison and cancerous, read the labels and if not mentioned ask the people at the super market, if they won't tell you don't buy anything. If you know of people who have their own farm buy you food from them make sure they are grown on soil. Then Sodium Bicarbonate (powder) 2 soup spoons mixed in four glasses of water as many times a day you feel thirsty, don't mix too much at the same time and don't put it in the cold. Don't take any soft drinks like Coke or others. Abstain from spirits and beer. Try as much exercise as you can per day but don't over do it, specially Taichi which is great for stability because of the osteoporosis or to avoid it and also excellent for the aches and pains.Walkin g is great. I am going to a Reumathologist for the aches and pains I have I am doing so much better now. If you had chemo and radiotherapy you have been left with an induced arthritis thus a Reumathologist is the right doctor for those pains tell the doc you don't take drugs or meds, only vitamins. My doctor is now a medical doctor who also practices Alternative Medicine, those docs are great they don't stuff us with drugs or meds that make us very ill. The first thing he did was to check my blood, urine and others for toxins. Once the results were back you could say I was a heavy metal eater, he did what is called a \"flush\", nothing you drink or eat or will they ever introduce anything in your body, it is cleaning your body with specific natural food and drinks. When you have time check these links: http://www.infoholix.net/ http://biotruth.com/ www.michaelthompson-phd.com/ Sign up for their newsletters they have great info. If you need further info drop me a note and I will get back to you. I sincerely hope you will do well and you are a smart lady to choose life quality instead of quantity. See you and take care. Moonwalker",
      "MessageIndex": 6,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45299,0.htm",
      "Title": "Chemo induced arthritis and AI pains"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hello: I have read your answer to my post, I am very sorry you have been so sick and hope you are getting much better, I am glad you did well with FEMARA. There are too many issues that are not yet known about certain drugs, I have the papers from the UK and Germany that explain the clotts issue as well as the jaw necrosis issue with Bonviva or Boniva. I don't believe that the UK and german schools of oncology will publish a paper in prestiged medical journals and that the contents may not be true. The difference is that in the US they have prohibited such information from reaching the public because the big money from the labs sees to it, but in Europe these publications are encouraged as long as the studies have been revised by the individual country's medical community and the EU medical community.  I have not seen any statistics because I am sorry to say but don't believe in them. I have the official study papers from both the UK and Germany, plus the final paper from the San Antonio [Tx] Oncology Symposium where the doctors spoke out on behalf of their patients, it was a pretty rocky symposium.  Thank you for your concern regarding my not taking AIs, yes you are right I can always drop them if I don't feel well  but I am still dragging my feet in pain and have very many aches and symptoms from the chemo, radio and brachytherapies side effects plus horrible stomach issues. Again thank you for your concern. Regards.",
      "MessageIndex": 3,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45299,0.htm",
      "Title": "Chemo induced arthritis and AI pains"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "The pain and swelling in the breast, arm pit and arm and or hands is usually from what is called a Lymphedema, it is an accumulation of fluids if you had lymph nodes dissection. In certain hospitals and pain centers they have specialized and licenced lymphedema therapists, they do massages and some very light exercises. Once you get better and the pain stops get a compression sleeve with a glove, it looks like a nylon stocking but it compresses and then your arm, hand and arm pit will not swell any more but at the begining don't drop the specialized massages have them as many times as necessary  and then several times a week, later you can cut it to a couple of times a week depending on how you feel. I hope this helps. Regards.",
      "MessageIndex": 2,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45134,0.htm",
      "Title": "Severe breast and arm pain after 18 Years"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "TO ALL: I don't know how much research you guys have done, but here is part of my research data about Tamoxifen and AIs. I regret to being able to post links so I can only direct you to the information. The first thing is to get all the names of the different Adjuvent Treatment Drugs for breast cancer. To obtain all the names and classifications go to imaginis.com and look under \"classes of drugs\", there you will have all the mentioned info. You can look these drugs up with Google and searching under Aromatasa Inhibitors in general, or go to any of the these sites: health.com - buzzle.com - encyclopedia.com - rxlist.com medscape.com - chemocare.com - breastcancer.org -  cancer.gov - drugs.com Once in these sites use the generic name of the drug and not the commercial names, type it in their search engines like this: \"letrozole side effects\" which is Femara. When ever you see something in blue print click it. If you see underlined material click it there is where you will find the best info. In some sites check the index to the left of the screen for the drug you are looking for, then if it says \"warnings\" or similar click it.   Remember that Tamoxifen and AIs are all chemotherapy drugs and some are steroidal. Don't look them up as \"medicines\" because you won't find them. There is great info that has been brought to light at the San Antonio Breast Cancer Symposium, many oncologists have spoken out on behalf of their patients about the side effects that are never mentioned and go unreported because of restrictions by the FDA. If you need or wish to obtain good solid info use these instructions. Regards.",
      "MessageIndex": 106,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi and I hope I can help: You had chemo and rads for your breast cancer, so did I. About a month ago I found out that both treatments leave us with an induced arthritis [Rheuma] most likely from chemo but also very possible from rads, thus I am seeing a Rheumatologist and most of my pains are so much better with treatment and without side effects.  I did not take AI pills so no excuses can be made. I don't quite understand if you had a lumpectomy or a mastectomy, sorry but I don't have experience with a lumpectomy. If you had a mastectomy and did not have reconstruction perhaps the surgeon took your breast skin,  folded it and left it just under your skin exactly where you say you have that pain. This happened to me, though I said I did not want to keep the skin as I would not ever have a reconstruction. I was very angry at the doctor and he has promised he will take that skin out of there as soon as my actual scar heals well.  Did you have lung Xrays? If not have them so you can get that issue out of the picture. Good luck and hope it is something simple. Regards.",
      "MessageIndex": 3,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45037,0.htm",
      "Title": "Rib pain anyone?"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "I am sorry I had not seen your post thus I did not reply, I hope this information may help you. After a bilateral mastectomy some women feel they are not attractive anymore but remember a woman is not just a couple of breast.  After a mastectomy we tend to go into a depression, we think we are not attractive and not females any longer that is part of the emotional issue. There are specialized therapist for those of us who have had a mastectomy, that would help you very much. I was more or less like you but I believe my case was worse, I had the horrible idea I had bad smell and that it could be because I was roting, I would take 4 to 5 showers a day and still have the idea I had bad smell which was not true it was simply my depression. The therapist helped me so much. Regarding your husband, most men I know are good, kind and loving to their wifes after all these proceedures, at times some women think their husbands also believe they are not attractive but it is a transfered opinion from your feelings to what may be his attitude. Have you ever thought that he may be sad and stressed because of all you have been through?  If you are already home, get a nice wig and use it, have your eyebrows tatooed very lightly and buy some nice and short eyelashes. Get a couple of breast forms that will look good with the corresponding post mastectomy bras, they look great and no one can tell you had that proceedure. These are links to mastectomy shops were you can order all you need, take a look at the sites and see what you think about what they have available for us and how you will feel using them. Mind you there are hundreds of brest form shops in the Internet. Here you can find most of the things you can use: http://www.headcovers.com/ For breast forms and post mastectomy bras check this site and look at the left side index: http://www.thebreastformstore.com/breast-forms-store-gold-se Once you have made up your mind, get what you like and can afford then use some soft make up, dress nicely and look happy thought you probably will still have a bit of depression but don't show it, that is a private issue and only yours but get help. I hope this information will help you. Regards and good luck.",
      "MessageIndex": 1,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45071,0.htm",
      "Title": "Breast Cancer and Marriage"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi: I just sent you a private message with info. Regards",
      "MessageIndex": 1,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45246,0.htm",
      "Title": "Arimidex withdrawal symptoms"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "You are 62 years old, this places you in the high risk age range which is 50+ years old, that is the most dangerous time in our lives and the risks are huge. Mammograms and biopsies are our only \"friends\" to save lifes. A yearly mammogram after 50 is a must and is recommended by doctors, breast specialist and radiologists.  You had a negative mammogram 12 years ago, that was great for you but too many years have passed. No use in looking back it is done. What could have happened inside your breats during 12 years? We don't know it and no one can claculate a thing as to what may have happened. The insurance companies may have the best available people but they need an updated mammogram and MRI to know for sure if you have new micro-calcification or if these have regrown and perhaps increased in amount and most importantly if they have clustered or not.  For your health insurance plan they will most likely need a recent mammogram and MRIs, if those are clear then your insurance will proceed normaly and you will have the insurance you are looking for. Of course the insurance company can always ask for a recent mammogram + MRIs or have those done by their own radiologists. For your own safety be sure to get a good mammogram, the one that strongly compresses the breast and it hurts a bit but it is for your own safety. If the mammogram shows there are clusters you will need a biopsy and depending on the size and shape of the custers, specially if lobular shape, the doctors require a good sample of the breast tissue for the pathology exam. This is because lobular clusters may be hiding something behing them and  the lobular clusters do not allow the doctors to see what may be behind them. There is nothing further you can do right now but wait, be ready if they ask for a new mammogram + MRI. Good luck and I hope you can obtain your health insurance.",
      "MessageIndex": 4,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45347,0.htm",
      "Title": "Breast calcifications"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi Ron: Not knowing is simply horrible, but here is some solid  information I can provide out of my own experience. There are two types of calsifications, Macro Calsifications and Micro Calsifications. Macro Calsifications: Are large bright white spots on the breast mass, they look like rice that has been thrown in there but not clustered, this is hardly or ever cancer I have not heard of a single case of it being cancer. Micro Calsifications: These look like sand or dust and are white, can be like the previos and spread around not forming clusters. If so then again it will most likely not be cancer. If the micro calsifications are clustered together forming certain patterns specially lobullar in shape then the doctors get very scared as they can not see behind the clusters and something could be hiding behind. In this case it can be from a benign to an advanced cancer, reason why they usually do a biopsy and send the samples to pathology. The pathology report will specify if further testing is required. This means that a larger breast mass is requiered and thus perhaps a surgical biopsy or a mastectomy. The doctor will say which needs to be done, if a mastectomy they will also dissect the sick lymph nodes they may identify if any or the suspicious ones, and again to pathology. From this last testing the surgeon will obtain the ER, PR and HER2-Neu and if these are possitive or negative for cancer. If the results are positive then comes the treatment plan which only the surgeon can say what he thinks will work in a particular case, meantime it would help if your do some research on the Internet, this because at times the patient has to decide which treatment she wants or prefers and if not researched then what would she answer to the surgeon. Google under \"Breast micro calsifications\" and \"Breast Macro Calsifications\", that will take you to further information.      I hope my experience will help and good luck. Regards.          ",
      "MessageIndex": 3,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45189,0.htm",
      "Title": "Wife is scared!"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hello: We all react differently to Hormone Therapy or Tamoxifen, some have side effects and others don't have them that bad. It much depends on your thyroid health. The best you can do is Google \"Tamoxifen side effects\" then \"Zoladex side effects\". I have researched the subject related to HT for over two months I did not like what I found, so I have rejected to take HT.  Sorry not to provide the links but it is not allowed. Please do it so you can take an informed decision. Best regards.",
      "MessageIndex": 4,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hello suebus: I first had a surgical biopsy, four days later I had a mastectomy with a three lymph nodes dissection including the Sentinel. I am now trying to heal my scars. Best regards.",
      "MessageIndex": 6,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hello to all: On January 24 I had a right side radical mastectomy and the dissection of the Sentinel and two nearby lymph nodes. Two months have passed and I still have a swollen armpit like a medium to a small sized balloon [full of seroma] which is not getting any smaller and an uncomfortable numb feeling on the same side but on my back [believe it is the Scapular Area - Shoulder blade or Subscapular area]. Today I touched the area, in other words, the back side of my arm [Shoulder Blade - Scapular Side] it feels very cold and totally numb compared to the left side. I have bought post mastectomy bras and breast forms, but I can not use them because the seroma in my armpit shows a lot more, like a small breast which I don't have, and it is very uncomfortable as if it gets bigger due to the bra compression or so I suppose.    About a month ago I asked my breast surgeon if I could call the Specialized Rehab Nurse, he referred her to me, for massages and help that armpit and my back get better, he said NO it was too soon and he would tell me when. I asked him if he could needle drain whatever liquid may be in there, he said NO because it must reabsorb itself.  A few days ago and two months after the mastectomy I had a checkup and did not ask the surgeon any more, I am very angry at him for several reasons which are not the case now. If possible can anyone tell me why I have both things?  I am suspecting a surgery mistake and damage to the nerves.  I don't have pain, no swollen arm or hand  thus I suppose it is not a lymphedema or so I hope, I did not use the right arm as per the doctors instructions till almost two months later. As I am switching to another Breast Specialist in a couple of days I need accurate information on why I have those two issues, what they are and why do I have them. I need to speak to the new Breast Specialist and explain myself with certain words and not take down my previous surgeon which is not my intention. Can anyone help me with the requested information?       Thank you",
      "MessageIndex": 0,
      "PostDate": "01/04/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45516,0.htm",
      "Title": "Post Mastectomy seroma and back numbness"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi: I have noticed your two questions, you seem worried about how the treatment starts and ends. Breast cancer has stages from 0 on to 4. 1] The enclosed link is to a guaranteed site:  http://www.breastcancer.org/symptoms/ Copy it to your browser, click on it and look at the page. On the upper part of the screen there is a red line with several issues: symptoms, diagnosis, genetic testing, treatments and side effects, day to day matters and finally two others on how to lowers risks for Breast Cancer. To the left side of the screen there is a yellow column with the index to each of the mentioned subjects. Read them in order so you will understand and know how all of this works and you will not be confused if something is before or after the other. I hope you take the time to read it, it helps a lot. Regards.      ",
      "MessageIndex": 19,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "Moonwalker",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Moonwalker",
      "Content": "Hi: I have noticed your two questions, you seem worried about how the treatment starts and ends. Breast cancer has stages from 0 on to 4. 1] The enclosed link is to a guaranteed site:  http://www.breastcancer.org/symptoms/ Copy it to your browser, click on it and look at the page. On the upper part of the screen there is a red line with several issues: symptoms, diagnosis, genetic testing, treatments and side effects, day to day matters and finally two others on how to lowers risks for Breast Cancer. To the left side of the screen there is a yellow column with the index to each of the mentioned subjects. Read them in order so you will understand and know how all of this works and you will not be confused if something is before or after the other. I hope you take the time to read it, it helps a lot. Regards.      ",
      "MessageIndex": 11,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    }
  ]
}