{
  "AuthorID": "Mvspek",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mvspek",
  "Posts": [
    {
      "AuthorID": "Mvspek",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mvspek",
      "Content": "I'm new to the site and read your message from 2002 about your sister. How is she doing or is she still here? My sister, 57 has the same thing. Secondary metastasis of breast cancer in her CSF, ommaya resevoir, chemo and radiation done, due to inflamation in spine, cannot walk. She's given less than 2 yrs to live. Please reply to me, if you're still online with your email. I'm desperate to hear about your sister and how she's doing with the treatments. Thank you Marsha",
      "MessageIndex": 2,
      "PostDate": "21/01/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "Mvspek",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mvspek",
      "Content": "Hi Kristi, Thank you for your reponse. I'd love to email you and talk to you more. Don't know how they work the reply to messages, to get a hold of each other. I'm so sorry to hear about your mother. We'll pray she makes it to see your new baby. How is she doing otherwise? Please let me know how you are doing as well. Marsha V.",
      "MessageIndex": 4,
      "PostDate": "04/02/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "Mvspek",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Mvspek",
      "Content": "I know it's really hard not knowing whether this treatment will help your mother But all I can say, is ask the Doctors to be honest with you, ask them to give you the facts, which will help you gather information, to help your whole family cope with your mom and her treatments. Spend as much time with her and love her, tell her, so you have no regrets. and pray for her.",
      "MessageIndex": 6,
      "PostDate": "16/04/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}