{
  "AuthorID": "nanacarolyn",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanacarolyn",
  "Posts": [{
    "AuthorID": "nanacarolyn",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanacarolyn",
    "Content": "  On 10/18/2007 Jodie wrote:   On 10/17/2007 annalittlebit wrote: I was diagnosed with breast cancer in 2003--I underwent surgery for one breast, chemo and radiation. I have been taking arimidex since. Although I try not to dwell on the possibility of recurrance I find that sometimes I worry a great deal about the cancer coming back.  I also think at times that I want to stop arimidex due to the side affects which I live with daily. Does anyone have input to , or share my concerns??  Please respond. I just stumbled upon this website this morning and am hoping it is a good place to be.  Friends who have not shared my experience cannot relate to my feelings on these matters. Dear Anna: It is a tough thing to go through life now with what will be a continuous concern about recurrence..I use to be the same way, and unfortunately when I did let my guard down this past spring and decided not to dwell on that recurrence possibility anymore...BOOOM!  A small lung nodule that was suspicious turned out to be br.ca. mets to my lung..and it has been 6years since my original br.ca. diag.and treatment..  I had a surgical procedure done on my left elbow, and the dr. did a prescreen xray of my chest, and the lung nodule showed up..the dr's kept saying oh, its just an infection or scar tissue from another pulmonary disorder they kept saying that I had..well my primary dr. did a ct scan, which also showed the nodule..that led me to a pulmonary dr. who then sent me for a pet/ct scan..well the lung nodule and several mediastinal lymph nodes lit up alot!then I had a surgical biopsy in August and low and behold it was now a fact that my original 1.6centimeter br. tumor which was a stage one with no nodes oppositive had indeed recurred and is now stage lV and is in my lungs and mediastinal lymph chain..I am now once again in the middle of chemo treatments for my disease..  all these years I have been very vigilant about my follow up appts. with my other oncologist, always mentioned concerns that went unheard, and always when I had a cough or respiratory infection i sought help.  But, to no avail this stuff came back and went undiscovered since January of this past year till May when the pulmonary nodule showed up on an xray..normally a nodule has to have some size to it already before a chest xray will show up anything..it was just a blessing that it did..  so far I only have the lung involvement and the lymph chain down my sternum..new oncologist thinks it can be put into remission, but there is no longer a cure..it is now living with it that I have to come to grips with..  My cancer was sneaky in that it didnt show itself in the auxilary lymph chain at all..a place where most dr's say that if you dont have any cancer then you are free of the disease..not SO!  apparently my original cancer was able to spread undetected before it was treated in 01..which is another story..I went in 00 for my usualy mammogram in January, a suspicious mass showed up, I was sent to a surgeon who then said he didnt feel it was anything but a cyst, did not want to do a surgical biopsy, and then it was put off for a year until April of 01 when I again had a yearly mammogram..well by then the tumor had really became suspicious and I was went to another surgeon who biopsied and found the invasive small tumor..so it went a whole year in there before it was removed..a whole year that it had to feed my blood stream with its cancer seeds..  My point to all of this is that it is warranted in alot of ways to be concerned about your own body and to be a little paranoid about a recurrence because it does so many times happen..  my cancer was hormone negative, but overexpressed on the her2, I was not offered the herceptin, dont know why?  So anyway,, dont feel bad about being concerned and trying to stay vigilant with this disease..its when we dont stay concerned that things seem to pop up..its learning how to keep alot of the concern hidden so people dont think we are that paranoid..and trying to get our dr.s to go that one step farther when we know in our gutt that something is wrong here.. well, take care..Jodie  ",
    "MessageIndex": 7,
    "PostDate": "18/10/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17158,0.htm",
    "Title": "Recurrance"
  }]
}