{
  "AuthorID": "nancygail",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nancygail",
  "Posts": [
    {
      "AuthorID": "nancygail",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nancygail",
      "Content": "Hi Sherman, I suspect the answers you are seeking haven't been answered yet. Sometimes 'the cure' falls into our hands and bam--everyone takes the magic pill. Other times the road is long, and some stumble and fall. I wrote a book about my experience with breast cancer. It is honest and forthright, but I was stage two. Quite a different story from stage four. To me cancer is chaos. I'm not just talking about cell division. When one hears the words-you have cancer, emotions and thoughts become chaotic. It changes you. Trust that answers are hidden in the rubble, and one day we will have the answers, but not today.      ",
      "MessageIndex": 2,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77232,0.htm",
      "Title": "Looking for different perspectives on breast cancer"
    },
    {
      "AuthorID": "nancygail",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nancygail",
      "Content": "Hey I wrote a book about my experiences with breast cancer and I will be doing book signings, June 7 from one to three at Books on Beechwood, 35 Beechwood Avenue and also another at Chapters at South Keys, June 14, from twelve to four. SHOULD HAVE MENTIONED IT IS IN OTTAWA, ONTARIO, CANADA. I STILL APPRECIATE ALL THE REPLIES FROM MY AMERICAN NEIGHBOURS. I'd love if some other survivors would join me. I don't care about sales. I'd just like to talk to people who believe a positive attitude makes each day brighter. Your company would be appreciated.",
      "MessageIndex": 0,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77539,0.htm",
      "Title": "I'd love some company"
    }
  ]
}