{
  "AuthorID": "nanetteh",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanetteh",
  "Posts": [
    {
      "AuthorID": "nanetteh",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanetteh",
      "Content": "  On 3/2/2009 trehouse60 wrote: If you don't have any symptoms that there is a problem in the other breast, breast exams and mammograms have been good, then I would see no reason to have more surgery.  At this point it sounds like you would be at more risk of complications caused by mastectomy (infection, poor healing, scarring, decreased flow of lymph fluids) than you are at risk of having cancer show up in the other breast. You might consider focusing your efforts on prevention through natural means. Even something as simple as supplementing with a few very basic minerals and vitamins, plus drinking plenty of fresh pure water and getting regular exercise, plus focusing as much as possible on eating raw, fresh fruits and vegetables and whole grains/legumes can make a tremendous impact on preventing cancer in someone who's already had it. Leading advocates of natural therapies recommend that at the very least people should take the following supplements (or ensure that they are getting this amount in their food):  selenium:  200 mcg/day (can start with 400mcg/day but only for a few weeks) magnesium:  200 - 250 mg/day (350 mg/day max), take with food zinc:  50 mg/day (can start with 100mg/day but only for a few weeks), take with food manganese: 10 - 15 mg/day, take with food calcium: 1200 mg/day We need Vitamin D-3 to be able to absorb and utilize calcium. Our bodies manufacture D-3 if we get adequate sunlight (15 - 20 minutes exposure/day) - but I do not believe in leaving this to chance, so also recommend a Vitamin D-3 supplement, 1000 - 2000 iu/day (10,000 iu/day max)  These are excellent sites if you want to learn more about natural treatment and prevention of cancer: http://www.cancertutor.com http://www.lefcancer.org http://alkalizeforhealth.net http://alternativecancer.us You are also welcome to look at my blog for examples of natural choices that for many people may fight and/or prevent cancer: http://motherearthtreasurechest.blogspot.com/2008/09/my-pers (There are quite a few other articles on the blog - please feel free to look through whatever interests you.) Sincerely, Tre   hello. im nanette. i was diagnosed with breast cancer in 2007. i opted for a double masectomy too, as i have a VERY strong family history. my mother died in her 50's at the same hospital that is treating me. well, to make a long story short, i have NO insurance. so, the dr at broward general hospital in ft lauderdale florida, dr bimston, said NO he'd only remove the 1 breast. i was bullied i feel, because, when you are given a cancer diagnosis you are scared to death and at the drs mercy without insurance. now, 2 years later i still have the port in my implanted, cancer breast. the hospital hasnt even mentioned removing it. i REFUSE to go through 2 surgeries as i want my other breast made symmetrical at the same time. the plastic surgeon wants 1500 dollars up front and the hisptal wants 1000 dollars for the use of to operating room. now question ladies, isnt there a 1998 womens cancer act that requires symmetry after masectomy? im not a bum. i now have the hospital gov't insurance, hill-burton and pay ALOT of co-pays and alot of expenses, bills are mounting. im behind in my mortgage. i did pay the plastic surgeon 500 dollars and now have nothing else to give. can anyone PLEASE give me advice on this 1998 act. im desperate. the hospital cares about the money only, not me as an individual. thank-you for letting me vent. tired and need help --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--  oops, i think you should do what YOU want about your breasts. its very personal...................",
      "MessageIndex": 5,
      "PostDate": "06/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33740,0.htm",
      "Title": "need help with decision"
    },
    {
      "AuthorID": "nanetteh",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanetteh",
      "Content": "good morning. my name is nanette, im 44 yrs old and live in Fl. i was diagnosed with stage 1 breast cancer this past June on my birthday. i chose to have a masectomy. since i had no insurance they, being the hospital, decided i needed only the one removed. this was decided when they were told by myself that my mom died of breast cancer in 1998 at age 59. i am truly inspired by your strength. you are an inspiration. may God Bless you and keep you well. if ud like to talk u can reach me at --Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html--i dont have any female friends to whom i can really talk about this. thx for reading this. nanette  ",
      "MessageIndex": 2,
      "PostDate": "17/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21556,0.htm",
      "Title": "Diagnaosed Young, Still Going 13 Yrs. Later"
    },
    {
      "AuthorID": "nanetteh",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nanetteh",
      "Content": "  On 5/16/2008 kaybear wrote: I'm embarrassed by having lots of cleavage on the still being reconstructed side from the tissue expander. My Healthy breast is a saggy Barely B, the side that had cancer was 1+ sizes bigger to start with. And the Sports Bras really flatten out my smaller natural breast. I'm several months away from the implant exchange and from a surgery to bring back symetry. Has anyone else had this problem? any ideas how to gain cleavage on the healthy side while wearing sports bras. For right now, that is the only kind I'm allowed to wear. Thank you. Kaybear  hello. im nanette a 43 yr old woman diagnosed with stage 1 breast cancer 1 yr ago this june. on my birthday. well i have the same problem. what i do is wear two tank tops doubled up. i like to jog and go to the gym so i feel better and it is in style. u could try a piece of padding and maybe use a safety pin. wearing two tops u cant tell. i hope this helps a little. God Bless nanette   ",
      "MessageIndex": 3,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24088,0.htm",
      "Title": "Big cleavage on being reconstructed side only,"
    }
  ]
}