{
  "AuthorID": "nansisi",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nansisi",
  "Posts": [
    {
      "AuthorID": "nansisi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nansisi",
      "Content": "  On 7/8/2009 MissesC wrote: my doctor found two calification on my breast through a mam and he wants me to have a bio. done.  I just wanted some more info on the calification.  He said I would probably never even know it is there, so I wanted to know if it is cancer is there any symptoms.  I know that it is a possibility that it is not, I just wanted to know if I don't have the bio done is there any way I can tell it is cancer?  I was one of the unfortunate 20% but I am thankful my cancer was found early. I was very surprised I had breast cancer as I had NO symptoms except some \"calcifacation\"(sp) on my mamogram.",
      "MessageIndex": 4,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37877,0.htm",
      "Title": "Calification"
    },
    {
      "AuthorID": "nansisi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nansisi",
      "Content": "  On 8/15/2009 butterly13 wrote: I had radiation tx and ended up with severe burns, rash, and horrific 3 1/2x3 1/2\" raw skin between under breast and stomach it lays on(DD). I have tried Silver S. and all kinds of contraptions not usinf tape it will tear my skin. Any suggestions? Thanks, Judi M. Hi Judi, You have already received many answers on creams to use so I will skip that part. I too had severe burns and discomfort so what I did was buy a few yards of soft \"T-Shirt\" material. I cut it into long wide strips and than after liberally creaming up, I would loosely wrap a strip a few times around my body, being sure to get it under my breast to keep skin from touching skin. There are probably much better solutions but this helped me. I had black burnt skin on my nipple area and blisters under my breast which I thought it would never heal but it did. Now, a few months later, it just seems like a bad dream. I wish you luck in your fight against this intrusive disease and just remember you are not alone. Nancy G",
      "MessageIndex": 7,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39054,0.htm",
      "Title": "Breast Cancer/Radiation Burns and Raw skin treatment"
    }
  ]
}