{
  "AuthorID": "navymom915",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
  "Posts": [
    {
      "AuthorID": "navymom915",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
      "Content": "Although I'm a colon cancer stage for for 50 mos. so far, I found a huge variation in side effects among the various chemos for me and among people.  It seems side effects vary greatly in degree among different people. I found the IV ativan harmless but relaxing.  Later, during my second round of chemo, I didn't get the IV Ativan, but I took .5 mg (smallest dose) to help me sleep.  I had no 'addiction\" or dependency problems. For me, insomnia is a serious side effect.  I believe everyone is different in the side effects, every cancer is somewhat unique, that's why I had my tumors DNA tested through Foundation One Medicine, which allowed my 0nc to target treatment instead of just 'trying\" different combinations.  As a recovering type A, this sense of 'just trying\" treatmentst made me angry. Also \"Aloxi\" is the name of the antiemetic that had tolerable side effects for me. Some insurance companies try to limit the use of these very expensive drugs billed at ($2000) per dose. My onc worked around the restriction by alternating drugs. My husband and I also found a therapist helpful.",
      "MessageIndex": 14,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76104,0.htm",
      "Title": "Extreme anger / breast cancer"
    },
    {
      "AuthorID": "navymom915",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
      "Content": "I'm not sure this information will help you... but I too was a type A high achiever but had some time before my stage four colon cancer diagnosis to start to 'change\".   The change I speak of is a reconcilation with the reality that we are not in complete control of our lives, even those of us who have exercised more control than average in order to mold our lives and achieve.  I was 56 when I was diagnosed which helped in that I was well into the midlife turn to spirituality and the acceptance that we all die and hopefully we will have a good death. All I can suggest is a more spiritual and 'accepting\" lifestyle, especially because if she does die of her disease, it will leave the family with something to 'hold onto\".  You didn't mention your wife's stage of BC, so perhaps she will beat it. In my case, I believe I will die of my disease, it's just a matter of time. Not knowing how long I will survive would have been an unbearable feeling for the 'old\" me who had plans, calendars, time lines and outcomes--for everything. no longer being able to work has been a major loss for me--I loved my work.  Now, I try to love my family more, write them letters, work on our ancestry.com family tree and focus on spiritual work.  Perhaps the illness has been an opportunity to put less focus on my work and achievement and more focus on just loving and accepting my family--each of their daily experiences.  And, I thank God every day that my youngest is a junior in high school and will probably make it to college before I pass. I pray that my husband will have good memories in spite of all of the nasty treatments and sickness.  I remind my kids to take care of their dad when I'm not around. Also, early on in the process, my primary care physician referred us to a therapist. This also helped.  We also had all of our home movies put on DVD and we enjoy watching them. Still, sometimes the anger comes out, usually as a wait for treatments or a call back.  And, I think a good cry helps us.  Getting those deep and strong emotions out really helps.  Under that anger is a deep and profound sadness at all the losses your wife has experineced and anticipates. Lastly, I lost my dad when I was nine and I grew up with a very very angry mother.  My mom raised me and my brother alone and she was filled with anger at my father, at God and at everyone who had an intact family.  I never want my family to experience that anger--so I've tried every means to resolve it.  My faith gives me a lot of strength to face our situation. God bless you and I hope your wife can begin to resolve her anger, for her own peace of mind and for all who are part of your family and business.",
      "MessageIndex": 8,
      "PostDate": "14/03/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76104,0.htm",
      "Title": "Extreme anger / breast cancer"
    },
    {
      "AuthorID": "navymom915",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
      "Content": "Shaunmattox, very empathetic and kind response. ",
      "MessageIndex": 11,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76104,0.htm",
      "Title": "Extreme anger / breast cancer"
    },
    {
      "AuthorID": "navymom915",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
      "Content": "Shaunmattox, very empathetic and kind response. ",
      "MessageIndex": 17,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76104,0.htm",
      "Title": "Extreme anger / breast cancer"
    },
    {
      "AuthorID": "navymom915",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/navymom915",
      "Content": "Although I'm a colon cancer stage for for 50 mos. so far, I found a huge variation in side effects among the various chemos for me and among people.  It seems side effects vary greatly in degree among different people. I found the IV ativan harmless but relaxing.  Later, during my second round of chemo, I didn't get the IV Ativan, but I took .5 mg (smallest dose) to help me sleep.  I had no 'addiction\" or dependency problems. For me, insomnia is a serious side effect.  I believe everyone is different in the side effects, every cancer is somewhat unique, that's why I had my tumors DNA tested through Foundation One Medicine, which allowed my 0nc to target treatment instead of just 'trying\" different combinations.  As a recovering type A, this sense of 'just trying\" treatmentst made me angry. Also \"Aloxi\" is the name of the antiemetic that had tolerable side effects for me. Some insurance companies try to limit the use of these very expensive drugs billed at ($2000) per dose. My onc worked around the restriction by alternating drugs. My husband and I also found a therapist helpful.",
      "MessageIndex": 20,
      "PostDate": "22/03/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,76104,0.htm",
      "Title": "Extreme anger / breast cancer"
    }
  ]
}