{
  "AuthorID": "NecieBug",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NecieBug",
  "Posts": [
    {
      "AuthorID": "NecieBug",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NecieBug",
      "Content": "Thanks for the headsup on the Taxotears website. It's quite interesting. I still have a lot more to read there.",
      "MessageIndex": 22,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    },
    {
      "AuthorID": "NecieBug",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NecieBug",
      "Content": "I'm a 6 year breast cancer survivor. Triple negative. No post treatment meds. No hypothyroidism. My hair used to be very thick especially on top. Now I'm still waiting patiently for the top to grow back in. It's very sparse. It's like the male pattern baldness others have described here. I try to look on the bright side. I am alive. But I sure would like my hair back. My body hair is barely there too. I have dreadlocks. I hate that my scalp shines through. I use scalp make-up that keeps the shine down. Gives the illusion of thickness. It's Joan Rivers Beauty Great Hair Day. I think my hair is growing in, until I shampoo it and there is my shiny scalp again. I'm almost 59 and I still want to look my best. I hope there is someone out there with a solution to this problem. I'm glad to know I'm not the only one going through this. It helped to read the other posts.",
      "MessageIndex": 18,
      "PostDate": "02/08/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    },
    {
      "AuthorID": "NecieBug",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NecieBug",
      "Content": "I knew about the cold caps from a young woman who had had cancer treatment in Europe in the late 80s. My concern is that I had heard the cold areas might have a recurrance of the cancer. I'd rather be bald than have cancer. Livinglarge, I'm sorry that you're in pain. Physical therapy has helped ease the pain from my surgery scars. Helps with my mobility.",
      "MessageIndex": 21,
      "PostDate": "06/09/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    },
    {
      "AuthorID": "NecieBug",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NecieBug",
      "Content": "I'm triple negative. I believe I asked the original question years ago. Anyway, It's been 8 years cancer free for me (Thank You God) and my hair is still the same. Thin on top.  A friend has about 15 years out and her hair eventually came back to normal. That is my hope for my hair. If not, I'll just continue to work with what I've got.  I cut off my dread locks because as they got longer and heavier more of my scalp showed through. Now it's about a year and a half later and I'm wearing it loose and natural. This gives me a little more coverage up top. If you look hard or if the light is behind me you can see my scalp. Thankfully no one looks that hard.",
      "MessageIndex": 54,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23460,0.htm",
      "Title": "2 years after chemo, my hair has not grown back"
    }
  ]
}