{
  "AuthorID": "NeeNee",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
  "Posts": [
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "  On 5/21/2009 CindyD wrote: Darlene,  Loved your message -- thank you for showing such strong faith. I try to accept things, but you know, we all have those dark nights where the doubts come back.  Funny you mentioned the chiropracter.  Two days before I went to the hospital with back spasms (and found out about the cancer) I had been to a chriopracter.  He did not take x-rays and told me he knew exactly what the problem was, etc.  I went through an adjustment session and yikes, my back felt terrible.  He told me that was normal and to come back the next day.  I did and received another treatment, which made things worse.  The next day is when I went to the hospital.  So I think your doctor is right on this.  When you have growths on your back, I don't think chiropractic treatment is good.  Plus, I know for me they are worried about the bone retaining its strength (that's why I take the Zometa).  Good luck and let's try to keep in touch during our \"adventure.\"  Cindy Cindy,      I had the MRI and yesterday I was at the doctors. The MRI showed no fractures, which is good, however it did show that there is something in the bones and the doctor said it was probably the breast cancer showing up. So he took me off Fosamax D and now I have to go once a month for an IV of Zometa. He said this would strenghten my bones. He also suggested I have radiation treatments on my back. So he set up an appointment with the doctor I had before after my breast cancer surgery 7 years ago. But I thought they told me at that time that the radiation weakens your bones. Because they told me to be careful and not fall into anything that would be near where I was receiving the radiation because it could break my rib cage. Maybe it is different now. I don't know but I have an appointment with the radiation doctor on Monday and I will ask him that. My back doesn't hurt very much now. But when I was having that MRI. Laying on my back for 2 hrs. and then he had to turn me around. Wow, it sure was painful. I sure was glad that was over. But you know the next day I felt better. You said you take Zometa. Do they give that to you by IV? How long did they say you will have to take the Zometa? Thanks for you great letter. It is nice to be able to correspond with someone who knows what you are going thru. God Bless You, Darlene",
      "MessageIndex": 9,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "Cindy,    I went to the radiation doctor on Wednesday. He told me the breast cancer is in almost every other vertebrae. He said the radiation will kill the cancer that is there. If I don't do this the cancer can spread to my spinal cord and that would be so much worse. So the marked me and tattooed me and want me to come back Friday(tomorrow) to make sure everything is marked correctly. The Monday I start radiation. That will be for 5 days a week for 5 weeks.     My cancer doctor I saw on Monday before I saw the radiation doctor. The cancer doctor put me on Zometa also. I get it thru an IV. The nurse was great. Although my veins are small she used a small needle and got it right in. About 25 minutes later I was on my way home. Now I go back and get another IV on July 1st. They have to check my blood first to make sure the Zometa isn't causing any kidney problems.     You said you went off Femera and onto Aromasin. That's what they did to me also. They after I bought a 3 months supply of Aromasin they took me off that and put me on metestrol. Sure wish I knew someone that could use the Aromasin. I have two bottles 30 tablets in each. Never opened. The same thing happened with the Femera. I couldn't find anyone that was taking it so I threw them out. There should be a place for cancer patients to turn in the medicine to give to someone else free of charge.      I keeping my chin up and try to keep busy. My husband has helped me plant flowers, tomato plants, put up bird feeders, wash windows and enjoy what the good Lord has given us. My husband is 82 years old and is suppose to take heart medicine. He said he hasn't been taking it. But now he is refilling his meds because he said I am going to need him so he had better be healthy. I am 61 years old and hope to live as long as I can to see my grandkids and step grandkids have families.      I grandchildren, one a girl (15), and the other one a boy (14). I am starting a journal so that my granddaughter, if she should get breast cancer, will understand how I am feeling. How we must trust that all will work out for the best. I am keeping you in my prayers, Darlene.",
      "MessageIndex": 16,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "  On 5/15/2009 Logicat wrote:   On 5/9/2009 NeeNee wrote: Seven years ago I had a lumpectomy. Not sure of the spelling. The cancer had not spread into my lymph nodes which was good news. The doctor said they got it all and I went thru a series of radiation. Now after a PET scan they said it is back. I had three vertebrae that was affected. My doctor set up a back surgery to repair my vertebrae and did a biopsy at the time. It was confirmed that is was breast cancer. So my cancer doctor put me on aromasin but that didn't work. After another PET scan they found the cancer is now in my left leg, in each of my hips and in my right side in my back. So he changed the medicine now I am taking Megestrol. I was taking 40 mg of aromasin. Now I am taking 160mg of Megestrol. My cholestrol went over 400 and my tricly. was over 380 so I went on a diet eating only fruits and vegetables, whole grain cereal and pasta, fish and chicken. All lean and without fat. Last time my cholestrol was down the 287. I have lost 15 lbs. Which is all good. In a week I have to have another blood test to see it the Megestrol is working. I am 61 years old and I have grandchildren I dearly love. I want to be around to see them graduate. Has anyone else been thru this same thing? What treatments have you had?   Thanks so much. NEENEE Neenee, I've read the other responses and the very first thing I would tell you is NOT to start on adding \"Natural\" medicinal herbs and such without asking your oncologist FIRST!  It's chemical fact that quite a few of these old \"remedies\" are quite harmful when you are in treatment for cancer.   They might make the chemicals inactive or combine with the drugs to make them actually harmful!!!  Just ask you doctor, FIRST!  Please. My breast cancer has metastasized to my spine, I was diagnosed with it just this February after the initial diagnosis and treatment in 2005.  I'm presently in chemotherapy treatments and I'm on Taxol, Zometa and Avastin. Originally, I was treated with a left mastectomy, 18 nodes removed with all 18 positive for cancer, chemotherapy with A/C and Taxol, then 30 radiation treatments.  I went three years on Arimidex before the cancer returned. I've had two aunts, one blood, one by marriage, that lost their lives to cancer.  One had medical treatments, went into remission for about 12 years, then when the cancer returned, refused medical attention and turned to \"natural\" healing.  The other went only with the natural healing.  Both lost their lives quite quickly.  The one that had originally been treated by regular medicine, changed her mind and went back to her doctor, but she'd waited too long and there was nothing that could be done for her except manage the pain.  The other started with the asparagus diet, went through a few others and finally spent most of the family's savings on trips to Mexico for their \"miracle cure\". Always ask your doctors, first, and do your own research.  Most of these people are only out to make money, sell you a book, sell you a product or ask you to do a testimonial for their company to get some other schmuck to buy into the same thing.  If I hurt some feelings with this statement, that's too bad.  I'd rather hurt your feelings than harm someone else by not giving them at least a head's up.   Thank you for warning me about Natural herb cures. I don't think I will try anything unless I talk to the doctor. After my lumpectomy 7years ago and after the radiation treatment they put me on Tamoxifin for 5years then they put me on Femera and I was on that for 2 years. Then they told me the breast cancer was back. I have great faith in the Lord and I know he has me in his hands. It just I feel so helpless. I can tolerate pain but right now I have been having problems getting out of a chair. By lower back has a lot of pain. I have never  and hope never have to take pain medicine. It get very discouraging not to be able to do much. Now is the time to be out in the yard and enjoy life but it is hard for me to go down the steps. I am sorry I just feel so blue today. I just learned this morning my one cousin died. She had stomach cancer. She was a lot younger than me. Thanks so much for your message. NeeNee  ",
      "MessageIndex": 5,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "  On 5/21/2009 CindyD wrote: I have metastatic carcenoma unknown primary - stage 4.  It was diagnosed in March 2007.  I went to the hospital ER which a terrible back spasm and they found the cancer up and down my verebrae from the PET scan.  It was a complete shock.  At the time they told me I may have as little as 2 - 6 months to live. I was treated with Gemstar and Carboplatin and also monthly Zometa.  I did great on this treatment.  I was able to stop chemo and began taking Femara (continuing with the Zometa) and actually have been back at work for the last 18 months with very little back pain.   But last week on my follow-up Pet Scan, it is showing that the cancer is active again and has spread to my left hip and lower lumbar.  I just finished a battery of more tests and another biopsy.  I am hoping that they find the primary site this time.  They are leaning toward breast cancer since the cancer responded to the Femara for 2 years.  I am now taking Aromasin with Zometa (instead of Femara) I just try to live each day as a gift. I'll get all my test results back June 1 and will then find out if I have to go back on chemo for a bit (hoping not).   It's hard because my husband just lost his job (after 37 years working at the same place).  He is now 58 and is looking for a new job mainly for the health benefits.  I can carry my own benefits through work -- but with the cancer back, I have no idea how long I'll be able to keep working full-time.  It is a difficult time right now but we are trying to stay positive.  This site is nice because you understand that \"you are not alone\" in your fight -- there are others who are fighting just as hard ... or harder.  Sometimes you just can't understand the \"why\" of things and I think you have to force yourself to accept Faith.  Everyone is on this earth to \"die\" -- it is how you live your life while alive that counts.      I have been having problems with my back this past week. So at my cancer doctor's appointment I told him about it. I wanted to go to my chiropactor and get a treatment. He told me that wasn't a good idea right now. He is concerned that I have some factors in my back now. This was Wednesday and he scheduled an MRI for friday. Then back to his office next Wednesday. He said if it is a factor I may have to have back surgery again. You know I read \"If God takes you to it, He will get you thru it\". I have great faith in him and will just have to see what the next step is. My husband is 21 years older than me and he is my best friend. He has been thru this with me from the start way back 7 years ago. He is 82 years old and he helps me with everything. I don't know what I would do without him and I am not sure what he would do without me. I trust God he will get us both thru this so we can live again. Thanks so much for you messages and thanks for this site. I feel like part of everyones family. Darlene   ",
      "MessageIndex": 7,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "Cindy,    I went to the radiation doctor on Wednesday. He told me the breast cancer is in almost every other vertebrae. He said the radiation will kill the cancer that is there. If I don't do this the cancer can spread to my spinal cord and that would be so much worse. So the marked me and tattooed me and want me to come back Friday(tomorrow) to make sure everything is marked correctly. The Monday I start radiation. That will be for 5 days a week for 5 weeks.     My cancer doctor I saw on Monday before I saw the radiation doctor. The cancer doctor put me on Zometa also. I get it thru an IV. The nurse was great. Although my veins are small she used a small needle and got it right in. About 25 minutes later I was on my way home. Now I go back and get another IV on July 1st. They have to check my blood first to make sure the Zometa isn't causing any kidney problems.     You said you went off Femera and onto Aromasin. That's what they did to me also. They after I bought a 3 months supply of Aromasin they took me off that and put me on metestrol. Sure wish I knew someone that could use the Aromasin. I have two bottles 30 tablets in each. Never opened. The same thing happened with the Femera. I couldn't find anyone that was taking it so I threw them out. There should be a place for cancer patients to turn in the medicine to give to someone else free of charge.      I keeping my chin up and try to keep busy. My husband has helped me plant flowers, tomato plants, put up bird feeders, wash windows and enjoy what the good Lord has given us. My husband is 82 years old and is suppose to take heart medicine. He said he hasn't been taking it. But now he is refilling his meds because he said I am going to need him so he had better be healthy. I am 61 years old and hope to live as long as I can to see my grandkids and step grandkids have families.      I grandchildren, one a girl (15), and the other one a boy (14). I am starting a journal so that my granddaughter, if she should get breast cancer, will understand how I am feeling. How we must trust that all will work out for the best. I am keeping you in my prayers, Darlene.",
      "MessageIndex": 11,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    },
    {
      "AuthorID": "NeeNee",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/NeeNee",
      "Content": "Seven years ago I had a lumpectomy. Not sure of the spelling. The cancer had not spread into my lymph nodes which was good news. The doctor said they got it all and I went thru a series of radiation. Now after a PET scan they said it is back. I had three vertebrae that was affected. My doctor set up a back surgery to repair my vertebrae and did a biopsy at the time. It was confirmed that is was breast cancer. So my cancer doctor put me on aromasin but that didn't work. After another PET scan they found the cancer is now in my left leg, in each of my hips and in my right side in my back. So he changed the medicine now I am taking Megestrol. I was taking 40 mg of aromasin. Now I am taking 160mg of Megestrol. My cholestrol went over 400 and my tricly. was over 380 so I went on a diet eating only fruits and vegetables, whole grain cereal and pasta, fish and chicken. All lean and without fat. Last time my cholestrol was down the 287. I have lost 15 lbs. Which is all good. In a week I have to have another blood test to see it the Megestrol is working. I am 61 years old and I have grandchildren I dearly love. I want to be around to see them graduate. Has anyone else been thru this same thing? What treatments have you had?   Thanks so much. NEENEE",
      "MessageIndex": 0,
      "PostDate": "09/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35987,0.htm",
      "Title": "It has returned now in my vertebrae"
    }
  ]
}