{
  "AuthorID": "neverthesame",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/neverthesame",
  "Posts": [
    {
      "AuthorID": "neverthesame",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/neverthesame",
      "Content": "I need your help !  I posted once before recently about losing my brother to pancreatic cancer after only 2 weeks.  We are still devastated but thank you for all of your replies.  But this time its my Sister......She has been fighting breast cancer for 8 years now and had originally done a double mastecomy and years of meds to prevent a recurrance.  LAst year it returned in her bones.  Although she has kept it controlled with the least amount of chemo and drugs, she wants to know if she should be more aggressive.  We feel the less amount of drugs it takes to keep it controlled the better, so that when it decides to act up again, she can increase her chemo or try something else.  Her MRI and cat scans show that there are no new sites but her bones have not improved with Zometa. At her last appt. she felt that her doctor of the past year ( She had moved to Texas), just wasn't very optimistic like usual.  When asked how long they treat people with this regimen, her doctor replied that people can live for MONTHS on this.  Well, she has been on it for 10 MONTHS and when she said something to the doctor, her reply was well its about quality Not quantity.  Of course she is upset, but she told her that she wants QUANTITY.........I can find out the meds she is taking if that would help, but we feel she needs to see a more positive and caring doctor.  Does anyone have the name/names of great, compassionate and positive thinking, caring doctors in Texas.  She said she has been going to the University of Dallas Southwest, but can also go to Baylor or Anderson or anywhere for that matter.  Thank you for all of your help and I pray for all of you and yours going through this nightmare. ",
      "MessageIndex": 0,
      "PostDate": "18/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29443,0.htm",
      "Title": "Doctors"
    },
    {
      "AuthorID": "neverthesame",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/neverthesame",
      "Content": "Thank you so very much for all of your very helpful information.  I appreciate your reply and you taking the time to answer so thoroughly. I will definitely give her all of this important information.  Wishing you the very best. Sincerely, D",
      "MessageIndex": 3,
      "PostDate": "19/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29443,0.htm",
      "Title": "Doctors"
    }
  ]
}