{
  "AuthorID": "nicmax",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nicmax",
  "Posts": [
    {
      "AuthorID": "nicmax",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nicmax",
      "Content": "My heart goes out to you. I am a single parent of a 19 year old daughter. I can only imagine your mom did not tell you about her condition as she wanted you to be sad for as little time as possible. I'm sure of this because I've already decided that if I were to ever learn I had a terminal illness I wouldn't tell my daughter until I absolutely had to because I don't want her spending so much time stressed out and upset about the thought of losing me. Nonetheless, I can only imagine how you feel not wanting to be around your mom right now. However, I'm sure she wants nothing more than to be with you during her final time on earth. In addition, you will treasure these next few months more than any time you've ever spent together. You'll look back later and appreciate that you devoted your time to letting your mom know how much she meant to you when she needed people most. A close friend died from liver cancer a few years back. I felt the same way. I wanted to avoid the inevitable. I didn't go see her in her final months until two days before she passed. I regret it. I often wonder if she thought I really didn't care much about her because I didn't go to visit her. You don't want those regrets. I also have a friend who had a terrible relationship with her mother throughout life. Her mother was diagnosed with lung cancer and had a short time to live. She lived 11months. She says that 11months was the only time in her life she actually had a relationship with her mother and now all she have are good thoughts of her. She really treasures that time. This is a very difficult time for you. They say losing a parent is like losing your past. However, mom will always be mom, even in her illness. Let her comfort you while you comfort her. I wish you strength and comfort during this time.",
      "MessageIndex": 6,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60467,0.htm",
      "Title": "My Mum Has Terminal Breast Cancer"
    },
    {
      "AuthorID": "nicmax",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nicmax",
      "Content": "Hi, If anyone here is in Philadelphia or nearby areas and currently on Placitaxel, please send me a pm.   Thank you.",
      "MessageIndex": 0,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62970,0.htm",
      "Title": "Anyone in or near Philadelphia on Placitaxel?"
    }
  ]
}