{
  "AuthorID": "Nicole.H",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Nicole.H",
  "Posts": [
    {
      "AuthorID": "Nicole.H",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Nicole.H",
      "Content": "I am a college student, 24 years old, and my Mom was daignosed with breast cancer last Thursday, the 18th of April. This will be her third time having it, but this time is so different.... It's stage 4, incurable, and has spread from a lymph node between her lungs to her right ribs. I wasn't alive for the first bout with it; that would be what caused early menopause, and the reason that I am adopted. The second time, I was 12 and 13, in eighth grade, and my Dad died of Hemochromotosis two months after my Mom finished her Chemo treatments.... I've essentially been taking care of my Mom since I was 13. I don't know what to do right now, though. I feel so alone; we moved to a different state, and we don't have any family --that counts as close family-- here, and all of our family friends and our support system are back in our home state.... My Mom is talking about how she won't see me graduate, or get married, or see any of her grandchildren; tomorrow we're going to meet with an oncologist who is going to tell us what we can expect, including life expectancy.... My Mom is a tough cookie. She was given 5 months last time, and is still going, and that was about a decade ago. But she's in such a depression, and I don't know how to help her. I don't know what I'll do if I lose her.... She's trying to teach me how to run her business so that I can have some sort of income while I'm still in school. Everything has such a final sort of feeling to it, that I don't know how to cope. My head is reeling, and I'm trying to keep up with my classes and manage my Mom's clients and inform our family and friends about the situation and make her doctor's appointments.... I know that there are people who do this every day, and I can't even express the respect I have for them.... I am in awe of their strength. I've been trying to find mine.... I've been trying to keep a happy face on for my Mom, and not cry around her, and not freak out or have a mental breakdown.... I keep bottling up everything that I am feeling, for lack of any coping mechanisms. I need advice. I need help. I need to know what I should be doing, and what I can do to help her.... Please.... Help me?",
      "MessageIndex": 0,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    },
    {
      "AuthorID": "Nicole.H",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Nicole.H",
      "Content": "Thank you all for your support; I'm glad to know that I'm not alone in this.... I really appreciate that you're all willing to share your stories with me. :) Here is the latest update: The oncologist said that, instead of Stage 4 Breast Cancer, it is most likely Stage 3 Lung Cancer that has spread to the bones. The doctor wants a biopsy done, and if it is Lung Cancer, then they will do radiation and chemotherapy to shrink the cancer, and then an operation to take out the cancer, the infected ribs, and replace them with titanium ribs.... It's a huge operation, and slightly terrifying to me. Mom was supposed to have the biopsy yesterday, but the insurance company has cancelled all of her appointments, saying that it is a pre-existing condition. This is simply not true. Mom has never had lung cancer. There is no gene for it in her family either (I'm adopted). If they are saying that it's connected to the breast cancer, then it shouldn't count, because they specifically define pre-existing as 12 years, and she hasn't had cancer on her right side in 30. Needless to say, I'm trying to find a medical insurance lawyer.... I'm also going to try to convince Mom to let me have power of attorney; I don't think that she's up to it. I feel swamped. Stressed. Finals are next week, and I'm so far behind in my classes.... I'm trying desperately to keep my GPA up so that I can keep my scholarship to my university, and I'm just so overwhelmed by everything that I can barely make it through a week without having at least two breakdowns and an axiety attack.... I'm trying to help.... I just don't know if I'm doing things \"right\".",
      "MessageIndex": 9,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    },
    {
      "AuthorID": "Nicole.H",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Nicole.H",
      "Content": "Definitely giving her lots of hugs, and will look into that diet that was mentioned. The latest update: So, after finding a lawyer and everything, it ends up that the we won't need one. The insurance company has approved the tests and everything and (hopefully) won't pull something like that again. So, now Mom is going to go and get that Biopsy done.... She also got her mammogram results that said that she does not have breast cancer; she's extremely upset right now, because the doctor had said that she had Stage 4 breast cancer, and then, seeing those results.... She's not a happy camper. So, with that part confirmed, we're fairly certain that it's lung cancer. I'm sort of in this, \"What now?\" phase. I suppose that it's just the waiting game now? I don't really have an adult to go to. The semester is ending in a couple of weeks, and I won't have much support from my college professors or faculty after that. The majority of our family is on the East Coast, and those who aren't we're estranged from. I feel like it's all on me. I have friends in the area who have offered to help, and my best friend's mom has said the same, but I don't want to impose on them. I'm grateful that they want to help, but I also don't know how they can help; at least, not yet.",
      "MessageIndex": 13,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    }
  ]
}