{
  "AuthorID": "ninasuzie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ninasuzie",
  "Posts": [
    {
      "AuthorID": "ninasuzie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ninasuzie",
      "Content": "Hi out there, I just got dx with invasive ductal carcinoma, hormone receptor negative and the lump is pretty large 4.5cm.  They said it's a different breast cancer called metaplastic cells and there isn't alot of research answers. My male surgeon is nice, but I told him I'd rather even an extensive lumpectomy than a total mastectomy.  I know getting the tumor and a \"clear\" margin is critical to removing the cancer. Also, since it's not certain what chemo is most effective, what ones seem best in your experience for invasive breast cancer?  I read they try to treat this as invasive ductal breast cancer to the best of their ability. Whatever effective options and \"building yourself up\", say with Reclast or alternatives would be appreciated.  Thanks...sad today.",
      "MessageIndex": 0,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32852,0.htm",
      "Title": "Experiences with breast surgery and chemo options"
    },
    {
      "AuthorID": "ninasuzie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ninasuzie",
      "Content": "hey gals! Know whether ALL Metaplastic breast cancer is \"triple receptor negative\"?  I just found out and am trying to make sound treatment decisions about the chemo and the extent of the breast surgery.  It is hard to \"re educate\" yourself on breast cancer when everything is about another whole grouping of actual breast cancer, and this is an entirely different animal (ha ha) with so little actually known about it-weird! I read alot of the messages from you Metaplastic gals and it's hard...any Boston area gals who found good resources for staying gorgeous, having fun and getting monies since I can't work?  I'm thinking SSI and maybe some foundations for clothes, makeup, hair or replacement wigs, etc?  Hugs to you ALL who read and chat back, whatever your kind/position. PS-there is a \"triple negative\" foundation website which is great!  Check it out gals/family/friends! Much love, Nina",
      "MessageIndex": 0,
      "PostDate": "01/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32734,0.htm",
      "Title": "Metaplastic question?"
    }
  ]
}