{
  "AuthorID": "Noel4349",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Noel4349",
  "Posts": [
    {
      "AuthorID": "Noel4349",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Noel4349",
      "Content": "michella, i am 29, tomorrow morning i have to have the exact same surgrey and i also have a three year old son. i know how you feel, the questions going through your head and the wait has to be the worst. i am praying for a mircle, hoping everything will be fine but something tells me i am in for a huge disappointment.",
      "MessageIndex": 2,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36139,0.htm",
      "Title": "early breast cancer"
    },
    {
      "AuthorID": "Noel4349",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Noel4349",
      "Content": "Sue,  Thank you for the advice, i know nearly nothing about breast Cancer. Up until now i never thought i would need to eduate myself. I just got home from my doctor appointment where i found out that i not only have the lump behind my nipple but also have a large lyphm node under my armpit. The surgeon was surprised that i did not know it was there. I can not tell you how many times i have had my breasts examined within the last year and this is the first time anyone has brought this to my attention. I became extremely upset because all i could do was think about the many times i walked in and out of the doctors office over the last year and had them tell me i was fine and had nothing to worry about. This could have been taken care of a long time ago. Now the thoughts that go through my head are Do i have cancer? did it spread from under the arm to my nipple? could this have been avoided if it was caught earlier? am i going to be ok? It's not fair, i never thought i would ever have to worry about this. Tomorrow morning i have to go in for surgery and have them both removed. The way the doctor was talking he made me feel like it was nota big deal until i spoke with the nurse. He made it sound like it is a simple procedure, afterward i would be fine but thats not the case. I wont know if i am fine until after they test them. My family is telling me to wait because they think that removing them not knowing whether they are cancer or not will make it worse. I dont know what to do or even if thats true. Can it really spread and get worse if they remove them before knowing? The doctor said i am a very healthy women and everything should be fine. Am i making the wrong decision to go ahead with the procedure?",
      "MessageIndex": 2,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36786,0.htm",
      "Title": "Breast Cancer signs and symptoms"
    },
    {
      "AuthorID": "Noel4349",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Noel4349",
      "Content": "Hi my name is Noel, i just turned 29, i have a 3 year old son. I am very nervous i may have breast cancer.  I do have a few questions and really hoping someone can help me out here or at the least set my mind at ease a little. About a year ago i started noticing some discharge from my left nipple. At first i was not too concerned until one day i squeezed it a little and some bloody pus cameout. I made an appointment right away and the doctor told me i was fine and had nothing to worry about. a few days later i saw my regular doctor for a routine check up and he asked why i hadnt mentioned it to him then told me i needed to have a mamo right away. I went for a mamogram last october, when having the mamogram they told me my breast were to dense so they had to do aultrasound. They tried to tell me it was routine which i didnt believe because if that were the case they would have scheduled them both when i made the appointment. That same day i had a ultrasound for kidney stones and was taken in for emergercy surgery. The mamogram was over looked for a while. 3 months ago i started experiencing iching, burning, and what felt like i was being stuck with a bunch of needles along with redness and swelling around my left nipple. I tired to make an appointment with thes surgeon i was refered to but by the time they got me in it was gone. Just a few days ago the same symptoms have come back and this time its alot worse then before. There is a larger area which is red, swollen, burning, iching and feels like i am being stuck with needles along with a very large hard lump inside my breast. I can barely stand to wear a bra and just having something brush up against it causes it to hurt very badly. I went to see my doctor today and as soon as he looked at it the expression on his face told me it cant be a good sign. He scheduled me an apointment to meet with whatever surgeon was available right away. I have an appointment at 230, i am just really nervous i may have breast cancer. It has gone untreated for almost a year. You can see a huge difference between my left and right nipple. the left one kinda looks like its inside my breast where the other does not. I dont have any pitting or rashes which are described in articles i have read.  My doctor keeps telling me not to worry he doesnt think it is cancer. He thinks it may just be a bad infection. This is the same office i went to and saw 3 different doctors within a week telling them i thought i had kidney stones. They sent me out telling me there was nothing wrong with me. It wasnt until i saw my regular doctor that they finally sent me for a ultrasound which i ended up having to beg for. By the time they realized i did indeed have kidney stones i had to have emergency surgrey because it was completely blocking my urine passage along with unbelieveable pain. I am a little skeptical of my doctor. I am still young with a 3 year old. I dont know how i would ever get though that and be strong enough to take care of him. Can anyone tell me if they have experienced any of the signs or symptoms relating to breast Cancer? i recently read somewhere that women with dense breast are at higher risk for breast cancer because the mamogram picks up the same spots for brest density as they do for lumps in the breast. in whic case they cant tell whether or not i do have breast cancer. I have read that women end up losing both their breast because they were not diagnosed properly due to breast density. I want to demand they do a biopsi even if it is just an infection. Sitting here and wondering, stressing over this is horrible. I need to be ok so i can raise my son, watch him grow, graduate, get married, and have his own kids. If there is anyone out there that can help me please please please give me all the infomation you have. I was reading about paget's desease , alot of the signs are what i have other then the rash or scaling skin. Nobody is giving me enough infomation to either except that i may have breast cancer nor enough info to believe that it is definatly just an infection. When i had my son i neer once breast fed and barely ever had any leaking so i dontunderstand how that could have caused an infection, besids he is 3 years old now. i am sorry for the long message i am just very nervous and tired of stressing over this. someone please help me.                                                                      Noel",
      "MessageIndex": 0,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36786,0.htm",
      "Title": "Breast Cancer signs and symptoms"
    }
  ]
}