{
  "AuthorID": "nursegirl13",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nursegirl13",
  "Posts": [
    {
      "AuthorID": "nursegirl13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nursegirl13",
      "Content": "I am 42 (with 3 kids) and was diagnosed with DCIS about 3 weeks ago. At first I was told the area was minimal (just 2mm) but after my MRI I was told that there were \"enhancements\" throughout the breast in a ductal pattern that spanned 6.5cm. I have elected to have a double mastectomy with immediate reconstruction. While telling people was difficult, I have found that sharing my surgical choice is harder. To me, breasts are a private thing. However, after a breast cancer diagnosis it seems like they become everyone else's business! Do I really want everyone knowing I'm having a double mastectomy? It feels like people will see me differently - not whole and not \"real\". I don't know why I'm having such a hard time with this.  Everyone keeps asking about my treatment and plans and I just can't bring myself to make the big announcement. Did anyone else have these feelings and how did you deal with them? ",
      "MessageIndex": 0,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79891,0.htm",
      "Title": "New dx- need advice re: what to tell/ not tell"
    },
    {
      "AuthorID": "nursegirl13",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/nursegirl13",
      "Content": "I had my first breast MRI about two weeks ago. My sugeon told me that it was important for this to be done in the first 10 days of my menstrual cycle because hormonal fluctuations can affect the results. If you are the anxious type or don't do well with confined spaces and loud noises, ask your doctor for a sedative prior to the MRI. You will have to have someone take you and pick you up but it might be worth it! When you get to your appointment the nurse will start an IV (usually in the bend of your elbow). When you go into the MRI room, ask for headphones. My MRI tech tuned in my favorite Pandora station for me :).  You will probably be placed on your stomach with your breasts hanging down through some holes in the MRI table. If you haven't had an MRI before, there will be very loud noises. Do your best to relax. My MRI lasted about 35-40 minutes. Contrast was injected around the 20 minute mark.  The MRI can \"enhance\" areas that may not be seen with mammography. Mine was helpful in seeing some DCIS areas that didn't present on my mammogram.  Hope this helps!",
      "MessageIndex": 1,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,79855,0.htm",
      "Title": "Breast MRI w/Contrast"
    }
  ]
}