{
  "AuthorID": "OKnow",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
  "Posts": [
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "Dear peggypraying - I hope you got good news on the tests. The scariest part (for me at least) is that the cancer always seems to be lurking in the background - like a stalker. I was also ER-/PR-, but got chemo and bilateral mastectomy. PET scan showed BC clear, buy showed something in my digestive system. So, we'll get working on that next. Just wanted to let you know I'm thinking of you and hope the worries fade with each good checkup.",
      "MessageIndex": 3,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,58723,0.htm",
      "Title": "Just need to talk"
    },
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "You said you're curious about the bilateral plus chemo, so here goes. I understand that the typical treatment is just the bilateral and/or radiation. Unfortunately, I received radiation 30 years ago when I had Hodgkin's. They can't irradiate a site that's been done previously, so the docs got together and decided to attack with chemo first (neo-adjuvant), then surgery. In a way it's interesting because all of my many ailments stem from the 1980 radiation - they are known long term side effects, including the BC. Of course, they weren't known at the time (and radiation has since improved) and I wouldn't be here today without the radiation. My latest side effect was a damaged aortic valve that the chemo totally pushed over the edge. I had to have emergency open heart surgery 2 months after the mastectomy. But you know ....that's just MY story. It's not typical, and it's certainly not applicable to your situation. But you asked :). Be strong and at peace. Take care.",
      "MessageIndex": 9,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,58723,0.htm",
      "Title": "Just need to talk"
    },
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "Hi iolite - Thanks for sharing your story, and your sister's. You're right - her experience is very similar to mine. So please let her know that she's not alone either. I think there's a boatload of us out here! But at least we're HERE, right? Take care, OKnow.",
      "MessageIndex": 7,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59737,0.htm",
      "Title": "Radiation-induced breast cancer (long term side effect)"
    },
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "Thanks Karie! After I sent the posting I googled the subject and did find a two other women who had radiation for cobalt then BC years later. Only one was told directly by the doctor that the BC was radiation-induced. It's just good to hear from others. Thanks again. Peace.",
      "MessageIndex": 2,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59737,0.htm",
      "Title": "Radiation-induced breast cancer (long term side effect)"
    },
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "Has anyone out there experienced breast cancer as a long term side effect to radiation? I had cobalt mantle radiation in 1980 for Hodgkin's. Everything was great for 15 years, but then I started having problems: thyroid cancer, bowel obstructions caused by adhesions (scar tissue), breast cancer, pulmonary fibrosis, aortic valve damage....all attributed to radiation (not anecdotally, but by all of the doctors). The breast cancer was the one that really threw me, because I hadn't heard about that as a potential side effect. I'd love to hear from anyone who has experienced. BC or any long term side effects from radiation. Thank you!",
      "MessageIndex": 0,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59737,0.htm",
      "Title": "Radiation-induced breast cancer (long term side effect)"
    },
    {
      "AuthorID": "OKnow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/OKnow",
      "Content": "Thank you so much for sharing. My goodness...it's amazing what the human body can withstand. Hang tough and good luck with treatment.",
      "MessageIndex": 6,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59737,0.htm",
      "Title": "Radiation-induced breast cancer (long term side effect)"
    }
  ]
}