{
  "AuthorID": "pamintx",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pamintx",
  "Posts": [
    {
      "AuthorID": "pamintx",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pamintx",
      "Content": "  On 3/29/2009 sunnygirl wrote: Hi Diane, Had stage 2 breast cancer. Had maste,chemo 6 months, then went on tamox for 3 months, started getting blurred vision, switched to arimidex and then the real pain began..could have used a cane for walking...quit that..My oncolgist is really unhappy, but I dont believe that it is necessary to take those specific drugs to live...am doing alternative medicine for aromatase inhibitors like Dim, melatonin, vitamin d, mangosteen juice, green tea extract, maitake d mushroom extract, fish oils, little to no dairy, organic everything as much as possible walking 30 or more everyday........cant live the other way I had stage 2 breast cancer diagnosed in Jul/08. Had double mastectomy in Aug/08 and started 6 months of chemo in Sept. After finishing the chemo I was put on Arimidex. That lasted a month and a half!  My feet were so swollen I could no longer wear shoes! I was put on 2 different fluid pills to try and reduce the swelling but they could not keep up. I told my oncologists it was hampering my new excersise routine (have to wear shoes at the gym you know!) so he changed me to Aromasin. After another few months - it's the same thing! Not to mention the time stopping hot flashes from both drugs. I guess my question is: how are so many survivors able to go years on these meds and I can't get through a few months! I feel TOO good when I am not taking them - so, I am not taking them. I will try the meds my oncologist recommends but I won't spend 5 years in pain and discomfort just because it's the current treatment. Life is meant to be good...",
      "MessageIndex": 82,
      "PostDate": "29/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "pamintx",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pamintx",
      "Content": "  On 5/17/2009 lillemor wrote: Just finished my 3rd try at estrogen feeding tumor and I'm done with the pills!! My shoulders froze,could not bend or use my arms or wrists. Just 3 hrs. of being taken off Feemara and put on Prednisone, I could bend my arms, my head had cleared.  I did not realize how dangerous I was thinking. My husband was amazed. I could not go to the bathroom , take a shower without much help. Towards the end my husband lifted from bed and had to feed me. This is not Life and it is a poor form of existence. I am now eating maitake mushrooms almost daily and am going to look into the Coriolus Versicolan extract.  It has been proven that the maitake mushroom kills the cancer cells. I have been on Aromasin,Tamoxifen and Feemara. lillemor I understand. I have been through Arimidex and now Aromasin - felt horrible on both. I couldn't go 2 months on either without severe swelling in my feet, ankles and hands. The Aromasin also started the blisters in my mouth and on my lips much like the IV chemo did. No Thanks! I felt better within 48 hours after getting off of each of these drugs. My Oncologist will have to find something else for me. I agree with you - this is not living. I am ok with my decision, because it is - my decision. Good Luck to you! I am pulling for you! Pam",
      "MessageIndex": 4,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36250,0.htm",
      "Title": "Done with drugs"
    }
  ]
}