{
  "AuthorID": "Pat52",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat52",
  "Posts": [
    {
      "AuthorID": "Pat52",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat52",
      "Content": "I was diagnosed with DCIS, stage 1 breast cancer in April of 2006. I had 2 lumpectomies in May and 30 radiation treatments that summer.  From 9/06-6/06, I took arimidex, as recommended by my oncologist.  Weight gain, fatigue, and especially nausea with vomiting were my symptoms during that whole period.  I took myself off of it, but my oncologist convinced me to try aromasin beginning in Dec. of 07.  I have been taking it for 7 months now, and I've never felt so bad daily for so long before.  My first trigger finger developed while on the aromosin.  I have had 2 cortisone shots to help temporarily and only slightly relieve that one.  I have same digit, middle finger, on right hand now, with very limited movement and lots of pain. The pain and stiffness in both hands and feet, is probably the most debilatating symptom for me.  I have trouble walking and using my hands normally.  I too, am so stiff after sitting for even a few minutes or when getting up in the morning, I feel like someone might feel at 100 years old.  My arms and legs hurt, as do my rib area and hips at times.  I go back to my oncologist for a regular check-up in a week, but I am quitting the aromasin TODAY!  My mammogram recently came back clear.  I don't know about the bloodwork yet, until my appt.  My fingers are so swollen.  I am CONSTANTLY tired, regardless of how much sleep I get, which has been about 8-9 hours a night this summer, since I am a teacher.  I rarely have any energy to do anything, but force my self too.  But I also find myself on the couch much of the time, if I really don't HAVE to do anything.  I hate being and feeling like this.  I will post another message in a few weeks to reflect on what I notice about being off the meds.  I'm 52, going on 92!",
      "MessageIndex": 0,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26120,0.htm",
      "Title": "side affects of aromasin and arimidex for me"
    },
    {
      "AuthorID": "Pat52",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat52",
      "Content": "  On 7/16/2008 trehouse60 wrote:   On 7/16/2008 Pat52 wrote: I was diagnosed with DCIS, stage 1 breast cancer in April of 2006. I had 2 lumpectomies in May and 30 radiation treatments that summer.  From 9/06-6/06, I took arimidex, as recommended by my oncologist.  Weight gain, fatigue, and especially nausea with vomiting were my symptoms during that whole period.  I took myself off of it, but my oncologist convinced me to try aromasin beginning in Dec. of 07.  I have been taking it for 7 months now, and I've never felt so bad daily for so long before.  My first trigger finger developed while on the aromosin.  I have had 2 cortisone shots to help temporarily and only slightly relieve that one.  I have same digit, middle finger, on right hand now, with very limited movement and lots of pain. The pain and stiffness in both hands and feet, is probably the most debilatating symptom for me.  I have trouble walking and using my hands normally.  I too, am so stiff after sitting for even a few minutes or when getting up in the morning, I feel like someone might feel at 100 years old.  My arms and legs hurt, as do my rib area and hips at times.  I go back to my oncologist for a regular check-up in a week, but I am quitting the aromasin TODAY!  My mammogram recently came back clear.  I don't know about the bloodwork yet, until my appt.  My fingers are so swollen.  I am CONSTANTLY tired, regardless of how much sleep I get, which has been about 8-9 hours a night this summer, since I am a teacher.  I rarely have any energy to do anything, but force my self too.  But I also find myself on the couch much of the time, if I really don't HAVE to do anything.  I hate being and feeling like this.  I will post another message in a few weeks to reflect on what I notice about being off the meds.  I'm 52, going on 92! Hi Pat, You are not alone in either the symptoms you are experiencing, or in your decision to go off the medication.  If you have a little bit of time, go back through some of the earlier posts on this message board about aromasin, arimidex, tamoxifen, etc.  In addition to seeing women talk about how bad these meds made them feel, you will also find posts chock full of answers about things that will alleviate side effects, and help in the battle against cancer. I myself am a survivor of breast cancer (2002), and more recently diagnosed with metastasis to the lungs.  I did not do tamoxifen or arimidex after my surgeries, chemo and radiation (which I quit halfway through due to lymphedema) because they made me sick after just a few doses, and I chose immediate quality of life now rather than the not-guaranteed possibility of quantity of life later.  While I didn't quite make it the magic 5 years before we found the nodules in my lungs (last fall), I don't regret those choices in the least little bit.  They were the best 5 years of my life, and part of the reason is because I wasn't letting treatment make me sick. After surgical biopsy of one of the lung nodules, I was officially diagnosed with mets in Feb this year, I once again had to make treatment choices.  I took 2 doses of the Aromacin - just that little made me extremely ill, so I said \"No more.  I'm not being sick like this.\" My lung nodules were very small, and the oncologist said I had lots of time before we needed to consider chemo, so I did a lot of research and designed my own herbal/supplemental and nutritional food regimen for fighting cancer, and it is working. I also became vegetarian and am concertedly working at losing weight (which I badly need to do.) My PET scan in June was great - some small areas of concern, but overall both the oncologist and radiologist said from that scan they cannot say that the nodules represent cancer. My blood chemistries and cell counts are fantastic - better than they've been in at least 20 years, and the cancer marker I had drawn last week is down despite the fact I haven't had chemo or prescription treatment. And I feel great!   There are herbs and natural treatments that can help you regain your health, put the side effects of aromasin behind you.  My best recommendation is that you see a certified naturopath for help with this process.  A registered nutrionist or a well-respected herbalist could help if you don't have access to a naturopathic, homeopathic, osteopathic or wholistic doctor.  If you need help with this from the message board, I myself, and some of the other frequent responders could help, but I highly recommend that you check our for yourself (through internet research, herb books, persons in the community knowledgable about natural therapies)  advice anyone on the board gives before  trying it for yourself. Not only can herbs, natural foods, alternative and/or complementary therapies help you get over the nastiness of the Aromasin, they can help you continue your fight against cancer.  Right now you appear to be cancer free - sure would be nice to keep it that way without having to suffer the pain and indignities of conventional treatments.  If you are interested in learning what you can do for yourself to prevent the cancer from coming back, I offer the same recommendations as for getting over the side effects. (There are other things to explore - ayurvedic tradition, traditional chinese medicine, diet and exercise, accupunture...) If you are interested in learning more about natural alternatives to conventional prescription treatment, feel free to send me your questions in a private message, and I will try to help you find the answers that are right for you.  Or post your questions publicly on this message board - lots of other people here that can get you started in a direction other than pain and suffering while recovering from the aromasin. I hope this answer has helped, and I wish you the best of health in the months to come. Sincerely, Tre Hi Tre, Thanks so much for your quick response.  I actually  spoke to a nutritionist after my cancer diagnosis, and she was not helpful at all.  Knew about eating with diabetes and high cholosterol.  That was it.  So, I will research on the internet like you suggested, but if you have just a few natural tips for methat would be much appreciated.Sincerely, Pat  ",
      "MessageIndex": 2,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26120,0.htm",
      "Title": "side affects of aromasin and arimidex for me"
    }
  ]
}