{
  "AuthorID": "Pat_R",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat_R",
  "Posts": [
    {
      "AuthorID": "Pat_R",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat_R",
      "Content": "I would have to say that the Amino acid therapy worked for what it was suppose to do. Keep food nutrients going through the body and keeping the patient from getting sick during treatment. Ron never got sick through Chemo or radiation treatment. I can't say it helped from getting infections because he did and they thought he looked too good to have an infection. I guess it depends on your doctors too. I do believe in what they offered and how I kept his body from rejecting food during treatment and would do it again if I was to help someone else. Cancer is a terrible thing!!! Good luck!!",
      "MessageIndex": 4,
      "PostDate": "30/09/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,339,0.htm",
      "Title": "Controlled Amino Acid Therapy"
    },
    {
      "AuthorID": "Pat_R",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat_R",
      "Content": "Is it called the CAAT Amino Acid therapy? My husband was on it during his treatment with renal cell cancer and did not get sick once. I hope it did some good but we had a really bad experience with doctors not addressing the infection issue and he was put into the hospital for over three weeks with a kidney/bladder infection that was starting in the blood. VERY sick. So we quit the CAAT therapy but I do hope it helped the cancer treatment and we will know tomorrow how the cancer cells have shrunk. If you are still interested I will let you know. I just visited this site so I didn't know you were asking. He was on it for almost two months. The group is wonderful to work with.",
      "MessageIndex": 2,
      "PostDate": "08/01/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,339,0.htm",
      "Title": "Controlled Amino Acid Therapy"
    },
    {
      "AuthorID": "Pat_R",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pat_R",
      "Content": "I agree to what the others have told you. None of us know what causes cancer and all the different kinds of cancer. Look at yourself - How you are feeling. Don't stop trying. Have you thought of accupuncture. It is safe if you go to the Cancer Treatment of America Center. It is safe if you go to a doctor. I had it done for sinus problem AND I had it done on my husband and the hypmotism was the best I could have asked for which saved him from pain and taking pain medicine. He was at the Cancer of America Center when he received these treatments. We all have someone we know with cancer now-a-days and we need to find out more of the options. Don't stop with the doctors in your town. That is not always the best place to go. If you can't afford to go elsewhere at least look what else is available to you close to where you are. I did loose my husband and I knew it was terminal but I fought the doctors in our town and went to Illinois to the Treatment Center and wished we had gotten him there sooner. Trust your feelings if you think something is wrong or you might have an infection, go to another doctor to be checked out, because you probably do and it can be treated!!! Just find other things that can help. If your spine is causing the pain for you accupunction and hypmostism might just give you the relief you need to be able to smile again and enjoy your family - no matter how long you are here!! God Bless you and hope you get relief soon!!! Pat",
      "MessageIndex": 4,
      "PostDate": "13/07/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2431,0.htm",
      "Title": "What Did i Do, to Get Cancer"
    }
  ]
}