{
  "AuthorID": "Pattit",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pattit",
  "Posts": [
    {
      "AuthorID": "Pattit",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pattit",
      "Content": "Hi Inez, I was diganosed last June with triple + as well. I had a lumpectomy to remove a 2.2cm lump. Went through 6 rounds of chemo & now I'm doing radiation for 5/6 weeks, 5 days a week, like going through hell right? Well, besides being kept on Herceptin until August, I'm looking for an alternative to Temoxafin & Femera. This stinks that we don't have decent alternatives. I was told everyone is different & may or may not suffer from side effects. I'm very nervous about taking any of it, please keep in touch & how you're doing. Best of luck. ??????????",
      "MessageIndex": 1,
      "PostDate": "25/01/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88781,0.htm",
      "Title": "Triple positive breast cancer/ long term issues with femara?"
    },
    {
      "AuthorID": "Pattit",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pattit",
      "Content": "Hello all, I was diagnosed last June with 2.1cm tumor ER+ BC. I had a lumpectomy with no lymphs involved & clear margins, thankfully. Now that I've completed 6 rounds of chemo as of Dec.1st., we move into 5-6 weeks of radiation. I'm hoping for a shorter time frame but I'll meet with the head radiologist next week to confirm. Oh my goodness! I'll be kept on an iv infusion of Herceptin every 3 weeks until August. I was readings some posts about Arimidex & now I'm scared out of my wits because the complaints are overwhelming. There has to be a better way because 5 years is a long time, especially with the side effects. I asked my oncologist about it & he seemed nonshalant about it, Any thoughts? I know, none of us signed up for this ride & every bit of information helps. I'm grateful that there are sights like this so we can help each other. Best of luck to all fighting this battle & look forward to any response. Happy New Year! ??",
      "MessageIndex": 0,
      "PostDate": "30/12/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,88823,0.htm",
      "Title": "Scared out of my wits thinking about Arimidex"
    },
    {
      "AuthorID": "Pattit",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Pattit",
      "Content": "Hi ladies, I'm in the middle of radiation with another 3 weeks to go. I was diagnosed with triple + in June & I was done with chemo on Dec. 1st. I'll be kept on Herceptin until next August. My oncologist suggests I take taxmoifen for 5 years. After reading all the horror stories about these drugs, there's nothing else on the market with limited side effects? This really is outrageous, and all the problems you ladies are experiencing is crazy. This is the 21st century & we're limited to these drugs. I'm 58 years old & don't want to feel like I'm 85. What to do is the big question & it's very concerning. Thanks & good luck to all of you.????????",
      "MessageIndex": 30,
      "PostDate": "26/01/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    }
  ]
}