{
  "AuthorID": "pattycakes",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pattycakes",
  "Posts": [{
    "AuthorID": "pattycakes",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pattycakes",
    "Content": "On May 29, 2011 3:33 AM kcsusan wrote: I could not find the subject on the Message Board after joining Cancer Compass, so thought I create a new one. I have had pain at the site of my right side mastectomy, also under the arm. I take heavy pain medications because of a chronic back pain syndrome, yet after taking heavy meds the pain breaks through. I had intense pain right after the mastectomy, they gave me 750 mg of fentanyl, which did absolutely nothing for it, then gave me morphine. I just had to endure relentless pain through the entire surgery recovery. I did not want any reconstruction surgery at all. I am 67 years old, and reconstruction only meant something a person could not bear to look at, and wanted to look better. I felt that surgery was for alot younger women than I. I can't stand wearing a bra, none of them are comfortable. So I bought men's tank tops for summer and they are very light weight, so don't have the rubbing of the bra on my scars. I pray for those who have the unrelenting pain. I am not very positive about a complete recovery, I think the cancer will return within the 5 year period of survival. Mine was HER+ invasive, bordered on one side. It was only the size of a pea, sometimes I wish I had not chose the mastectomy, maybe just had treatment instead. Too late for that.  I would find a doctor for those of you whose doctor is unsympathetic to your pain. seek more opinions, doctors are suppose to relieve pain and suffering. Just plain, say look doctor, aspirin and aleve and tylenol do not help this pain, I need something alot stronger to kill this pain. Don't be afraid to ask for it.  Yes there is chance of addiction with pain killers, it is a better scenario than sitting day in and day out with unrelenting pain, that keeps you down. Good luck in your pursuit of the relief of pain. And it is real. Extremely frustrating but extremely real, this post mastectomy pain. I am 3 years post, bilateral, and had second surgery next day due to blood leak, then another surgery to put in the saline implants, then another two surgeries to put the right implant back in the pectoralis pocket; finally went to another plastic doc, he took out the saline and put in silicone, end of sureries except for the simple creation of the nipples, which is a total of seven on that right side.  I woke on day two on a ventilator, an have recurring nightmares from that.  OK...enough history of that...as soon as I could think, I was aware of the stabbing and burning in the right breast/chest, rib and underarm, running down the arm to the wrist, which remains today in varying degrees.  That new PS said he had no idea what it was...bs, he just didn't want to deal with it. Ended up with primary, gave me vicodin; I sought out acupuncture, with little relief, found a physical therapist that is gold, she did scar therapy and myofascial release with only some relief, then went to a pain clinic, gave me Cymbalta and Lyrica and doubled the vicodin dose to 10mg 4X a day, did three injections in shoulder blade area...useless, then did one in spine area three weeks ago, same useless thing. I am walking on eggs trying to live with this, getting off the pain meds now gently so as to not have withdrawl but struggling and think I may not be able to get by without the narcs. I am 68, active and involved with life, and only this activity keeps me from jumping off a cliff. Desperate for more help. This post mastectomy thing is not a passing thing, and I am puzzled as to why the docs are not digging in and trying to find causes, although some are doing their best to treat te symptoms.  Thousands of us are desperate.  Will someone help us??? I have found tht a heating pad or a cold pack work better for some relief, but it means sitting down and resting when I want to live actively.  I need someone to state how they made their post-pain go away.",
    "MessageIndex": 1,
    "PostDate": "10/06/2011",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59651,0.htm",
    "Title": "Post Mastectomy Pain Never Goes Away"
  }]
}