{
  "AuthorID": "pbixler",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pbixler",
  "Posts": [
    {
      "AuthorID": "pbixler",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pbixler",
      "Content": "Re: Lost and Alone, You are not alone. Look at all the replies. I got on to search for support for myself and I was just diagnosed. But for some reason saw your post and wanted to respond. Sometimes you have to be your own cheerleader. Take each day at a time. Do what you can do and start again each morning. It is ok to cry. Start some kind of project with your Mom. When I knew my Father was in his final stages of Parkisons,  I started a notebook. I would ask him questions such as give me advice if I have trouble at work, give me advice if I become sick later in life. Oh his good days I would ask questions and write his replies down. They were valuable to me later and he enjoyed knowing I would have his advise. I even asked him to give me advise for raising my daughter and asked him advise when she married. I will get on later and write more. And most of all you have your Father in Heaven. He never sleeps and is availiable 24/7.",
      "MessageIndex": 16,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71484,0.htm",
      "Title": "Lost, Alone, and in Need of Advice"
    },
    {
      "AuthorID": "pbixler",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pbixler",
      "Content": "I have just been diagnosed with Ductual Carcinoma in Situ. But it is high grade and has comodo patterns in it. I am also ER + ,PR-. My Mother had Breast Cancer last year and had a mastecomy and my step sister had breast cancer at age 32 and died. So, I have decided to have a mastecomy. I want to have reconstruction surgery immediately. Thinking abou the DIEP or the implants. Being cut in two places is scary and the length of the surgery is scary. Need advice. I live in Florida. Where is the best reconstruction plastic surgeons. I heard about some in New Orleans.",
      "MessageIndex": 0,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71627,0.htm",
      "Title": "Ductual Carcinoma in Situ."
    }
  ]
}