{
  "AuthorID": "Peggy_D",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Peggy_D",
  "Posts": [
    {
      "AuthorID": "Peggy_D",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Peggy_D",
      "Content": "Hi - No sign of cervical cancer so far and I'm nearly done with my five year regimen of tamoxifen. I had DCIS and a mastectomy (due to DCIS being in many locations throughout my left breast) with reconstruction. I did not \"have to\" take tamoxifen but decided to do so after researching the drug and discussing options with my medical oncologist. Side effects I've had: onset of menopause, with hot flashes hitting me the first day I took tamoxifen (at age 49) and menopause setting in (at age 52). The medication is easy to take -- one pill every morning, with or without food, no stomach or other discomfort. Some weight gain (I hear that from many people to take the drug, though some in fact lose weight according to my breast surgeon. Haven't found those people among the many survivors I know who have taken tamoxifen.). My hair has also turned almost completely grey, but that may relate to the trauma of simply being diagnosed with breast cancer; I had a limited number of grey streaks in brown hair before my diagnosis. My menopause came earlier than my sister's (at age 54), but later than my mother's (at age 47). All my mammograms and pap smears have been clear since I started taking tamoxifen in August 2000. Here's a hint that works well for me -- certain antidepressants can diminish the hot flashes, if not entirely eliminate them. I use Effexor; I had been taking Celexa when I was diagnosed with breast cancer. I understand they can be prescribed in smaller doses when you don't need the medication for depression. Check the internet for other antidepressants that have this happy side effect. I still get some hot flashes and night sweats, but not nearly as severely as before I switched from Celexa to Effexor (which both my medical oncologist and psychiatrist approved, at my request). The internet certainly was a godsend to me when I was diagnosed. Hope this note and other input helps you make the best answer for you.",
      "MessageIndex": 1,
      "PostDate": "09/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2020,0.htm",
      "Title": "Has Anybody Taken Tamoxifin?"
    },
    {
      "AuthorID": "Peggy_D",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Peggy_D",
      "Content": "Hi - That's exactly what they did with me when they suspected breast cancer. In my case, they tried to cushion the message by saying the mammogram was a bit fuzzy. They just wanted to make sure, and in my case it was DCIS (Ductal Carcinoma in Situ). That was good news to the extent that my cancer had not mestastized. It is normal to ask for a repeated mammogram, from what I understand, in cases like yours (and mine). Mine was in March of 2000. I'm doing just fine now, 4+ years into recovery. ( ended up having a simple mastectomy of my left breast, as the growths were all over my left breast. They had not spread elsewhere or into the good margins of the area biopsied before the mastectomy. I'm on tamoxifen and have had clean mammogram ever since. Most people with DCIS don't need a mastectomy but some of us do. It did relieve me of the need for radiation. I also had reconstruction at the same time and did not need a separate surgery for that purpose, for which I am grateful. I was able to complete a 10K walk for Race for the Cure within 4 months of my surgery, after spending 6 weeks off to rest and recover. Peggy",
      "MessageIndex": 2,
      "PostDate": "08/11/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1360,0.htm",
      "Title": "Repeated Mammagram Becuse That Want to Rule Out Cancer"
    },
    {
      "AuthorID": "Peggy_D",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Peggy_D",
      "Content": "Hi - I had a simple mastectomy in 2000 after 3 (!) biopsies found DCIS spread in locations throughout my left breast. The mastectomy saved me from radiation therapy; I had reconstructive surgery (tramflap) at the same time. The nipple was replaced about 18 months later (due to repeated cancellations by my plastic surgeon, when in fact a nurse handled the procedure). I don't regret the mastectomy; I surely did not miss having radiation, which due to the widespread nature of my DCIS would not have been effective (50/50 chance of recurrence). I did not feel the need to \"save\" my breast that I really did not need and which could be replaced. Note that I was near the age for menopause (49) and did not expect to bear any children after my surgery. I am taking tamoxifen voluntarily to prevent the spread of cancer to my right breast. I for one consider all that I went through cancer surgery. I would not have wanted to wait and see if the so-called noncancerous DCIS turned into a cancerous form, especially because it was prevalent in so many locations in one breast. I wonder if for many of us \"breast conservation\" is oversold, especially those of us who do not need to have our original breast in place. Your comments, especially from any of you who have had a mastectomy following a DCIS diagnosis. Thanks. P.S. I'm cancer free, five years past my diagnosis and will complete my tamoxifen therapy this summer.",
      "MessageIndex": 0,
      "PostDate": "09/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2041,0.htm",
      "Title": "Dcis and \"breast Conservation\""
    }
  ]
}