{
  "AuthorID": "Perkins",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Perkins",
  "Posts": [
    {
      "AuthorID": "Perkins",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Perkins",
      "Content": "My mom was diagnosed invasive ductal carcinoma . I am told that the tumour is poorly differentiated or high grade . The tumour is negative for estrogen and progestrone receptors. Apparently the pathology is also equivocal for Her2/ neu levels and I beleive this is still being evaluated. So we don't know herceptin treatment will help. My mom's lymph nodes were clear. She is obviously very worried. She is 72 years old. She does not think she needs chemo and isn't really prepared to do it. I don't know what to do or how to help her. Can anyone provide advice ? Or has anyone had a similar pathology ?     ",
      "MessageIndex": 0,
      "PostDate": "10/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19580,0.htm",
      "Title": "Mom Diagnosed Need Advice"
    },
    {
      "AuthorID": "Perkins",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Perkins",
      "Content": "It has now been established that my mum has triple negative bc. She is 72 , tumour 2-3cm no lymph involvement. She would like to avoid chemo but the reading I have done with triple negative suggests that it is the only option along with radiation and surgery. My mum does not meet the usual profile for this . Does anyone have advice about this form of bc. Is there ia centre in Canada whch specializes in this form ?",
      "MessageIndex": 0,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19781,0.htm",
      "Title": "Triple Negative"
    },
    {
      "AuthorID": "Perkins",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Perkins",
      "Content": "My mum is a 72 year old with stage 2  agressive form. I wrote for advice earlier. I have just found out that she is not positive for either estrogen/progesteron and nor is she positive for the Her2 gene marker so can't take Herceptin either. Her doctor is recommending both radiation and chemo now that she has healed from her lumpectomy. My want wants to avoid chemo. Does anyone know what other treatment might be available for someone who has these markers ?  ",
      "MessageIndex": 0,
      "PostDate": "11/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19618,0.htm",
      "Title": "Treatment Options"
    }
  ]
}