{
  "AuthorID": "phdjoan",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/phdjoan",
  "Posts": [
    {
      "AuthorID": "phdjoan",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/phdjoan",
      "Content": "i also changed to aromasin from arimidex, because of the side affects of arimidex.  i t has been 4 years since i was diagnosed. did tamoxifen first, then  aromasin- arimidex.  i can't believe that i still feel so tired- i just turned 60 and feel 90.  i get home from work and feel like i just came home from a chemo treatment.  i just want to sleep all the time.  i will take what the doctors give me, but i want to start feeling alive again.  when???",
      "MessageIndex": 6,
      "PostDate": "31/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6451,0.htm",
      "Title": "Changing From Arimidex to Aromasin"
    },
    {
      "AuthorID": "phdjoan",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/phdjoan",
      "Content": "  On 5/5/2008 debbief wrote: I had nodes removed under my left arm 3 years ago and had no problem with any swelling. Then I had a reaccurance in July at my masectomy site.  I had 2 positive nodes this time on my right side. Unusual, anyway I also had 5 fields of radiation one at the armpit. They told me lymphodema could be a side effect, so I started seeing a therapist right away, four months later I developed lymphodema and its not getting better, not worse, I bandage at night, wear a sleeve everyday, exercise and do massage.  Im interested in the rebounder. How do you use it  all you do is gently bounce on the rebounder.  i broke my ankle in january and the doctor just gave me permission to start using it again, because you do not need to jump on it.  you can if you want to.  while i was recooperating, i had to go back to the sleeve, the wrapping and the pump, but now that i am back using the  rebounder the fluid is out of my arm. i bought my rebounder from it's my health.   goole rebounder and you will find out who sells them locally.make sure it has a bar you can hold onto. let me know how you make out or if you need any more infor.  god bless and keep up the good work.",
      "MessageIndex": 9,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23216,0.htm",
      "Title": "lymphodema"
    },
    {
      "AuthorID": "phdjoan",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/phdjoan",
      "Content": "hi ladies, i have had problems with lymphodema in my left on. did the physical therapy, compression wrapping, compression sleeve and also, the compression pump for 2 1/2hrs per day. everything was temporary,the fluid kept coming back.  my sisten-in-law told me about a rebounder(a small trampoline).  you do on it for 3 mins every hour. it works. you don't have to do any major bouncing on it!  i gave all the info to my surgeon and she is now recommending it to her patients.  joan",
      "MessageIndex": 6,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23216,0.htm",
      "Title": "lymphodema"
    }
  ]
}