{
  "AuthorID": "pinkbunny",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
  "Posts": [
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "  On 4/17/2008 Trina wrote:   On 4/12/2008 pinkbunny wrote: Hi everyone I am new to this site but would like some advice. In 2006 I was diagnosed with Breast Cancer ER and PR positive. I had a mastectomy and radiotherapy to the chest wall. I did not need chemotherapy.I am on Tamoxifen for five years. In 2007 I had an LD Breast reconstruction. Recently I have found a very tiny lump on th escar of th ereconstruction. I am now terrified that it has come back. I have made an appointment to get it checked out bu t I am very anxious and so many questions keep popping up in my head. If the cancer has returned how will they deal with it if I have had a reconstruction? Will I have to have chemo this time round? If it is not cancer again what could th ehard lump be? Any advice appreciated. Thinking of you all.x   I also had reconstruction and found a place that concerned me on my scar.  They ran all the test, and determined that it was only scar tissue.  The place is still there, but I don't worry about it anymore.  And with time, the pain that was associated with it went away.  This was almost 2 years ago So I hope this helps and that yours is just scar tissue.Hey Trina thnk you so much for this - it has helped calmed my fears. I am seeing my doctor on Monday to get it checked out. I pray that it will be scar tissue. Thinking of you .  ",
      "MessageIndex": 2,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22982,0.htm",
      "Title": "Recurrence after reconstruction"
    },
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "Hi everyone I am new to this site but would like some advice. In 2006 I was diagnosed with Breast Cancer ER and PR positive. I had a mastectomy and radiotherapy to the chest wall. I did not need chemotherapy.I am on Tamoxifen for five years. In 2007 I had an LD Breast reconstruction. Recently I have found a very tiny lump on th escar of th ereconstruction. I am now terrified that it has come back. I have made an appointment to get it checked out bu t I am very anxious and so many questions keep popping up in my head. If the cancer has returned how will they deal with it if I have had a reconstruction? Will I have to have chemo this time round? If it is not cancer again what could th ehard lump be? Any advice appreciated. Thinking of you all.x",
      "MessageIndex": 0,
      "PostDate": "12/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22982,0.htm",
      "Title": "Recurrence after reconstruction"
    },
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "Hi everyone   I had my appointment to check out the tiny lump on my reconstruction scar and after an ultra sound and examination it was all ok.   I am so relieved and will be looking forward to a good nights sleep tonight!   Thank you for your thoughts and support.   Thinking of you all.x",
      "MessageIndex": 3,
      "PostDate": "21/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22982,0.htm",
      "Title": "Recurrence after reconstruction"
    },
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "Thank you for sharing this with us. I pray that you continue to grow strong and that you stay in good health. Sue",
      "MessageIndex": 1,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22738,0.htm",
      "Title": "hope for all of us"
    },
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "  On 4/26/2008 Estrella wrote: After 5 month of my FLAP reconstruction the sorrounded area of the breast is hard as a rock. It is called Fat Necrosis. I will have another reshape of the breast since it's very flat, and a removal of that hard tissue in one and a half month.  I'm very exceptic of the final results because I think that the breast will look even smaller than now, even when the plastic surgeon told me that he may use some of that fat for the reshape. He also told me that he wants to adjust the other breast to the size of the reconstructed one, making it smaller. I said \"Don't touch the good breast\" but he says is for\" symetry\" I'm 63, and I think that I can find the symetry with any \"wonder bra\" and be away of any other complication in the good breast.  I will like  the comment of someone who may have been trough the same experience. Thank you !! Hi Estrella   Although not really similar I do understand what you are going through. I had a mastectomy in Nov 06 and had fat necrosis on the scar which terrified me because I thought the cancer had returned. There was quite  a lot of it so they gave me a breast reconstruction in October 07 which was wonderful and they took away all the fat necrosis during the operation. The reconstructed breast was great but it made my normal boob look even saggier than before! The surgeon said he would do something with it by reducing it and  giving it an uplift. I did not want them to touch the normal boob but in the end I said ok and boy I am so glad I did. The operation was minimal compared to all my other operations and the normal boob looked wonderful - not sagging but nice and round and pert!   It will not effect future mamograms or breast checks and I was not sore after it at all. Only stayed one night in hospital too.  Go for it - it does not matter your age - it makes you feel great.   Thinking of you and keeping everyone in my prayers.   Sue ( UK)  ",
      "MessageIndex": 1,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23457,0.htm",
      "Title": "Fat necrosis after breast reconstruction"
    },
    {
      "AuthorID": "pinkbunny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/pinkbunny",
      "Content": "Thank you for sharing this Pat. I will visit the site you recommend and keep you all in my prayers. Sue",
      "MessageIndex": 1,
      "PostDate": "13/04/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22476,0.htm",
      "Title": "In Need of Spiritual support?"
    }
  ]
}