{
  "AuthorID": "PinkPenguin76",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PinkPenguin76",
  "Posts": [
    {
      "AuthorID": "PinkPenguin76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PinkPenguin76",
      "Content": "To the person dismissing pain as fibromialgia.  They diagnosed me with so-called fibromialgia... A year later I was diagnosed with a malignant breast tumor... A tumor is now found in my belly, a huge one a couple inches in my armpit and a lump in my neck plus groin pain.  I am still in the process of finding out where the primary was even though I'm pretty sure it's going to be said it was melanoma. I also have symptoms that it's spread to my spine and pelvis. I already have symptoms of late-stage cancer that has spread throughout the body. It's just a matter of time before the doctors put it all together on paper and actually admit it to me. I already know the news will be very bad. They really do drag this process out. In fact I had to find out by researching my records online to even find out I had a malignant breast tumor because they never said anything to me.... So then I played smart detective and went to Urgent Care and played like I already knew I had a malignant tumor and the doctor sung like a canary cuz he thought  I already knew. But my point is... Fibromyalgia is a joke. It's what they tell you when they can't put two and two together and need to just come up with a diagnosis. It's not until folks start realizing the medication never truly works and symptoms always come back and the cancer has metastasized already that they realize their diagnosis of fibromyalgia was BS. Fibromyalgia is a joke.",
      "MessageIndex": 6,
      "PostDate": "21/11/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1159,0.htm",
      "Title": "All Over Pain"
    },
    {
      "AuthorID": "PinkPenguin76",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PinkPenguin76",
      "Content": "On Nov 22, 2017 6:23 PM Stwhittington wrote: Yes I agree with you 100%. I too was diagnosed with fibromyagilia. Kept have all over pain.  Started having seizures and got a  blockage in my intestines.  The  Dr did an xray and found out where the blockage was and also found out that I had kidney cancer  in which I had had for 6 years and was never  diagnosed.  I was so sick throwing up and having seizures and scaring my family to death.  I feel like the lord caused me to get the blockage  so the Dr would find the cancer.  I wouldnt be here if they hadn't found it.  But since my kidney has been removed I feel so much better.  The cancer was poisoning NY body.  But now after 6 years I'm having pain where my kidney was.  Bad stabbing grabbing breath taking pain.  But the drs  don't know what could be causing it. Ut hurts to move . I have been to the emergency room  no answers. Good luck with your  problems.Keep \"\" target=\"_blank\" rel=\"nofollow\">http://problems.Keep \" target=\"_blank\" rel=\"nofollow\">problems.Keep me posted. Ok My prayers are with you . It really is a shame. I also believe the Lord is involved but due to my walk I actually speculate that it wasn't found because the Lord is calling me home. I know a lot of people won't understand that but that's where I am on my walk. I just keep praying for His will to be done whether it's through healing or death. It sounds morbid but that's how much I trust the Most High. It really is a shame how little the medical field really knows. In fact my situation is similar that I had symptoms for a long time that for about two to three years the doctors were dismissing me including that diagnosis of fibromyalgia. Then I got a new doctor cuz my doctor left the facility and I just took whatever doctor I was given and he took me serious enough because he found out there was a cancer history in my family. My brother was just diagnosed last year with stage 4 rectal that had spread to his liver. He's been under treatment for a year and seems to be improving but it's still a fight for him. It was because of my brother's cancer history that he immediately made arrangements for me to get the mammogram, a biopsy of one of my moles, and to have me go to a GI doctor for colonoscopy. I have yet to do the last two, as my mole won't be biopsied till December 7th, but the mammogram instantly picked up a malignant tumor and tomorrow I go back to Radiology for Diagnostic testing. So it was only because the doctor sent sent me to an actual specialist who literally looks for cancer, such as a mammogram, that my first tumor was even found. I tried to tell doctors about this huge lump under my armpit a year or year-and-a-half ago and I was dismissed and told that lump is just my muscle. They did no further testing, no ultrasound, nothing the doctor just touched me like you would be afraid to touch a spider and said I'm fine. It's really a shame. In fact, at my last two woman's health check-ups for a pap smear, they didn't even do a breast exam. But at least I'm actually getting the help I need now to at least find out how far this has progressed if nothing else. If it has spread as far as I think it has spread, I don't believe I will be looking into treatment, rather pain management for quality of life for whatever time I'm diagnosed with... However, if it isn't as bad as I personally think it is then I will consider treatment options. Right now I just have to play the waiting game. I trust Jesus.",
      "MessageIndex": 8,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1159,0.htm",
      "Title": "All Over Pain"
    }
  ]
}