{
  "AuthorID": "PM25yrsnowthis",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PM25yrsnowthis",
  "Posts": [
    {
      "AuthorID": "PM25yrsnowthis",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PM25yrsnowthis",
      "Content": "On Jan 05, 2012 11:13 PM JewelsOhio wrote: I was diagnosed with breast cancer back in September, 2011.  I went through a core needle biopsy, lumpectomy and sentinel lymph node biopsy. I opted for the Oncotype DX Test. The results were steller.  My chances for reoccurace are next to nill. I started Tamoxifen and radiation therapy in December.  And here lies the problem.  I hate the cancer center where I receive my treatments.  I have no other choice but to go there.  I'm stressed to the max.  I cry before radiation, during radiation and on the way home from radiation. The first day it took them over two hours to set up the simulation.  Family members (both male) of a technician came into the room during my set up.  Here I am naked from the waste up and strangers are allowed to come and go as they please.  I was mortified. I told the doctor and that was as far as it went.   My second visit I found out that two of the meds I'm on shouldn't be taken with Tamoxifen.  I printed the information off of the internet and asked the doctor about it.  She told me that I have to take it up with the doctor that perscribed it to me.  She told me that I need to stay off of the internet then walked away. I've been wheelchair bound for a year now.  One time after the treatment I was scheduled to see the doctor for my weekly visit.  The technician got me into the wheelchair, threw my clothes on my lap and proceeded to take me into the exam room with no gown on. I yelled at her and she said, sorry I forgot; chuckling. What do I do to survive this? I do not have the answer your question, but although you have an awful situation with your treatment center, you are fortunate to have such a great outcome for your cancer.  I do not have breast cancer, I have Lymphoma.  I have a great treatment center but poorer prognosis.  I'd rather have the terrible treatment center anyday....(but surely there has to be someone to address your many concerns.  And by all means keep your eye on the internet.  An informed patient is YOUR BEST Friend.",
      "MessageIndex": 1,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    },
    {
      "AuthorID": "PM25yrsnowthis",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PM25yrsnowthis",
      "Content": "I agree there should not be a trade off.  I was not implying so.  I spent 4 years convincing my physican that something was wrong with me.  Another year trying to have them correctly diagnose Lymphoma. I was a very informed patient.  I've had misinterpreted CT scans, MRI, needle biopsies, and had to beg for a PET scan and biopsy of enlarged lymph node and change facilities to get the BEST Optimal care.  I am my best Advocate.  Had I not been, my prognosis would have been worst.  My life shortened prematurely unnecessarily.  Being informed to me means to be able to recognized recommended treatments or medications that are not compatible.  It means looking for advances in research for ones specific cancer.  It means asking a phlebotimist to wash their hands before preparing to draw my blood.  It means asking for the pulse ox probe to be swiped with alcohol before use between patients....and it means knowing who to complain to when I am treated with substandard care.  After all, ultimately it means I want to be treated with the same standard of care that each health care provided would treat their loved one.  Insist on this at your center.  I did, that is why they were so GREAT!!....they obliged.",
      "MessageIndex": 3,
      "PostDate": "06/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63698,0.htm",
      "Title": "How To Cope?"
    }
  ]
}