{
  "AuthorID": "Polly57",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Polly57",
  "Posts": [
    {
      "AuthorID": "Polly57",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Polly57",
      "Content": "Hi Paulette, I just had to answer your letter, as I do believe I know what you are going through. I was diagnosed with colon cancer 6 years back this past September. In November of 2004, my cancer came back a second time, this time to my bones. I took chemo twice in 6 years and it keeps coming back. So this time I said “no more chemo”. The oncologist was not pleased and gave me months to live. I am still alive 15 months later. I am doing well. I don’t know how much longer I have, but no one does. I attended a funeral this past Saturday for a friend 57 years old (my age) who was diagnosed in December of this year. She took chemo and after the first treatment, she developed blood clots and died this past week. One of the clots traveled to her heart. This would not have happened had she taken no chemo. Another friend of mine passed away last year. He was diagnosed with the same type of colon cancer as I was. They wanted to give both him and myself Cisplatin (a type of very aggressive chemo). I refused. He took the chemo and passed away. I have done as lot of research on chemo on the Internet and nowhere did I find any good that chemo does. Chemo does not cure cancer. For every patient that takes chemo, the cancer clinic gets paid about $5,000. Chemo is all the cancer clinic knows. Why don’t they start teaching their sick patients how to boost their immune systems rather than take chemo that lowers the immune system? You should get busy first thing tomorrow morning and start doing research on ways to boost your immune system. For starters, I am on a near vegetarian diet and take modified citrus pectin tablets. They can be found at your health food store. I take 4 a day. They kill newly formed cancer cells. I also do not smoke or drink and try to stay positive 24 hours a day. I have to keep telling myself that no one on the face of this earth (including the Pope) knows when their time is up. So start building your immune system and start living and enjoying your grandkids. Chemo will never give you a good quality of life and I think that’s all we want. Good luck to you and let me know how things work out.",
      "MessageIndex": 1,
      "PostDate": "31/01/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1512,0.htm",
      "Title": "Chemo Treatments"
    },
    {
      "AuthorID": "Polly57",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Polly57",
      "Content": "Hello there - Palpable abnormality is nothing more than cystic breasts.  Discharge from the breast, rather it be blood, clear, greenish color or black is all normal breast tissue but is related to cystic breasts. I had all the above for many years and the discharge went away when I reached 50 years old. I had one biopsy done and it was negative and only showed more of the cystic breast tissue.  I was diagnosed with colon cancer 9 yrs ago. Thats why I'm on this cancer section. Good luck to you and don't worry about little pains that you get, here and there. I used to also have alot of pain in both breasts but mostly in my right one. The pain is no longer a bother to me. Keep the faith. On 6/21/2007 Noreneol wrote: ...I have been having pain,tenderness,and soreness in my breast since last year. I went to the doctor and they wrote on the report it is \"a palpable abnormality.\" In other words,there is something growing there. They thought it was a cyst,as I have had fibrocystic disease a few years back. So they send me for a mammo & said there was nothing there! Fine. But now,this year,the pain is still there,in and around the breast,outside quadrant and near the nipple. Also it hurts when I lie on it,pain in my underarm too that was horrible a couple times. A few days before my period,I saw some stuff coming out of that breast,clear fluid,then it turned white. I can squeeze it out & it also comes out by itself. As a matter of fact,for a long time I've had sudden spotting from that breast,very briefly,but this came out more this time. I have NEVER had any kind of nipple discharge in my life,only when I had milk in the breasts for the kids. I'm hoping it was cyclical,but,as I said,this is the 1st time I EVER had anything like this. Nipple also looks kinda strange,and breast feels kinda rough,like the pores in it are enlarged. What do you guys make of this? Thank you, N.Y.",
      "MessageIndex": 4,
      "PostDate": "23/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13648,0.htm",
      "Title": "Hello..I have a few questions..."
    },
    {
      "AuthorID": "Polly57",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Polly57",
      "Content": "What a wonderful story and what a wonderful person you sound like. Congratulations on your clear x-ray and my prayers and thoughts are with you.",
      "MessageIndex": 1,
      "PostDate": "10/01/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1458,0.htm",
      "Title": "Stageiv/thirdtimer Success Story"
    },
    {
      "AuthorID": "Polly57",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Polly57",
      "Content": "Hi Kaddy - In answer to your concerns.....sounds kind of \"fishy\" to me. I don't think, by what your saying, that your oncologists are very observant. Whenever I go for 6 month or even a year follow-up, they always do scan, MRI, blood work, consultation talk, and then a complete physical. This takes place each and every time I see them, no matter how long the appointment time interval is. If I were you, maybe try asking more questions and also demanding that they do some pertinent tests. God Bless you and you have to look after yourself because no one else will do it for you. You also have to be your own advocate because most doctors are just there to put in their time and then go home. You have to be the one asking the questions and also the one to order the tests that you want done.",
      "MessageIndex": 2,
      "PostDate": "05/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4997,0.htm",
      "Title": "Follow up Care After Last Treatment"
    }
  ]
}