{
  "AuthorID": "PunkyD",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
  "Posts": [
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "I just found this.  Check out the internet, if you haven't already.  https://www.mskcc.org/blog/coping-pain-after-breast-surgery Punky",
      "MessageIndex": 2,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134507,0.htm",
      "Title": "Pain 14 yrs after mastectomy and reconstructive surgery"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Jen, I'm afraid I don't have any real solutions for you, but I just want to tell you not to lose hope and not to give up. Don't give up what you love to do.  I can relate to that.  I also am very active. I am an athlete and former phys. ed teacher/aerobics instructor/gymnastics coach, and I love to be active as well.  Even if your shoulder/arm isn't working as well as it did, and you still have pain- Keep up what you can!  Do you feel like you have exhausted your attempts at physical therapy or pain management?  How about special massages?  I'm sorry I can't help you more. Wishing you only good things and improvement of your situation. Punky",
      "MessageIndex": 5,
      "PostDate": "07/01/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134507,0.htm",
      "Title": "Pain 14 yrs after mastectomy and reconstructive surgery"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Jen, I'm sorry to hear that you are in so much pain. You are definitely a survivor.  I am not a doctor of any kind, but it sounds to me like a family doctor would not have a clue.  You need a specialist of some kind.  Either an oncologist for breast cancer, as I'm sure you are not alone in these symptoms.  Or a physical therapist/chiropractor.  Often when there is pain, your body (muscles) compensate, which causes pains in other places as well.  Are you physically active?  Do you stretch?  Do massages? Use creams or hot compresses?  I'm just throwing some ideas out there. But if you have always had pain since your surgery, then a breast cancer specialist would be your best bet.  I'm sure someone on this site can give you advice as well.   Hang in there. Please don't give up in finding relief.  Punky",
      "MessageIndex": 1,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134507,0.htm",
      "Title": "Pain 14 yrs after mastectomy and reconstructive surgery"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Brenda, I will pray for you as well.  You sound so strong that you're keeping it together while you wait patiently.   Sending positive thoughts your way and praying for you have to have the most favorable results.  Punky",
      "MessageIndex": 3,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72907,0.htm",
      "Title": "Mass found during follow-up ultrasound to mammogram"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Amazing news Brenda!  I'm so happy for you. Punky",
      "MessageIndex": 11,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72907,0.htm",
      "Title": "Mass found during follow-up ultrasound to mammogram"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Trinity, I'm just writing to say that someone is listening. I'm sorry to hear about your diagnosis, but so happy for you that you are now cancer free!  I'm sure it is a very confusing and stressful time, especially since life can often be complicated to begin with. I was a caregiver to my mother and father in law, found this site, and have just stayed, to support others.  As for the preventative chemo and radiation.....I'm sorry I don't know enough about it.  I can only assume that if the doctors are suggesting it, it is in order to prevent a reccurence.  Get a second opinion, if you need to.  So sorry to hear about your father's accident. I hope his rehabilitation continues to improve. My 3 kids (1 girl and 2 boys) are the exact same ages as yours (My youngest son also just turned 10 in January). After my father in law lived with us for 1.7 years with dementia and prostate cancer, (86), he passed away 11 months ago.  So I can relate to some of what you are going through.  Yes, you can pat yourself on the back for keeping everything together under very difficult circumstances.  I always tell myself that, and you should too. Stay healthy, do whatever research you need to do in order to make decisions, and take one day at a time.  I'm here to talk if you need to. Punky",
      "MessageIndex": 1,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,135106,0.htm",
      "Title": "38 yrs old recently diagonsed with idc"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Amazing news Brenda!  I'm so happy for you. Punky",
      "MessageIndex": 13,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,72907,0.htm",
      "Title": "Mass found during follow-up ultrasound to mammogram"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Simone, Your post inspires me to write back. I'm sorry to hear about your mom's diagnosis.  I have been through some bad patches myself, and yes, it does make you stronger and make you look at life differently.  Don't every lose hope.  I know it can be overwhelming.  There are a lot of survivors on this forum. Just do the best you can for your mom.  Can't expect more than that. Do you have other family members that are helping you?  In any case, just wanted you to know that I'm here and listening.  Punky",
      "MessageIndex": 1,
      "PostDate": "08/01/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134562,0.htm",
      "Title": "My mom was diagnosed, looking for a little support."
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Simone, Your post inspires me to write back. I'm sorry to hear about your mom's diagnosis.  I have been through some bad patches myself, and yes, it does make you stronger and make you look at life differently.  Don't every lose hope.  I know it can be overwhelming.  There are a lot of survivors on this forum. Just do the best you can for your mom.  Can't expect more than that. Do you have other family members that are helping you?  In any case, just wanted you to know that I'm here and listening.  Punky",
      "MessageIndex": 2,
      "PostDate": "08/01/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134562,0.htm",
      "Title": "My mom was diagnosed, looking for a little support."
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Hi mbgardner, Wow.......I'm so sorry to hear about your diagnosis.  I can only try to imagine how shocking and worrying this must be for you. I'm sure you have so many questions. Please don't think of the worst - you haven't even gotten the biopsy brief yet.  Breast cancer has so much awareness and such a good prognosis.  Please try to be optimistic, though I know it must be hard now and you're still in shock.  Hang in there and try to stay calm until you have more information.  One day at a time. Think positive.  Sending you a hug, Punky  ",
      "MessageIndex": 1,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,74147,0.htm",
      "Title": "just got the bad news..."
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "If you're not getting the answers from your current doctor, look for another doctor!!!  These symptoms shouldn't be ignored. Keep searching for answers.  Are your parents helping you with these appointments?  Good luck and don't give up until you get some answers.  Punky",
      "MessageIndex": 1,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,74229,0.htm",
      "Title": "i am 17 with nipple discharge in one breast along with other symptoms... could use some help."
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "Dear Angel, I agree with Jillian.  All that you are feeling sounds perfectly normal, considering what you are going through.  It's understandable that you're confused, scared, changed, sad, etc. You also sound very mature, responsible and caring and you are doing a great job taking care of your Mom and siblings, while going to school. It is good that you go out with your friends. You do need to take a breather sometimes.  I am so sorry that you are going through this.  Do the things that make you happy or help you relax.  It seems that you already know what to do.  Exercise, prayer, talking to friends............Enjoy every day with your mom. You say: \"Sometimes happiness does not even feel like an option\" Remember that you're allowed to have fun and be happy.  Don't feel guilty.  Your heart is breaking at the same time.... Just take one day at a time and don't lose hope.   Punky ",
      "MessageIndex": 2,
      "PostDate": "14/12/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,81243,0.htm",
      "Title": "How do I deal with my mum's breast cancer?"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "On Jan 24, 2017 2:47 PM Sunflower121 wrote: My mom was diagnosed with Stage IV a little over a year ago. By this October, she was doing really well -- no signs of disease except for a very small mass on her left breast. Previously she'd had metastases to her liver and lungs. Anyway, we thought things were going well. The oncologist told us she could have five years ahead of her, maybe even longer if she was really lucky. Then in early December she started having problems with her left eye. At first she and her doctor thought it was just a temporary side effect from some of her new meds (she'd recently started hormone therapy as disease \"maintenance\"). Then they decided to get a brain scan just to be sure... and found over a dozen tumors in her brain, including a big one on the nerve leading to her left eye. She's just finished WBRT, but the doctors are not particularly optimistic. They're thinking she'll have somewhere between 6 months and a year. Now, I know they don't know everything and it's hard to predict when anyone will die, but nevertheless it's got me thinking about what will happen when she's gone and the grieving process. Now the issue: I don't know if I want to attend the funeral. To me, the purpose of funerals is to help people accept that their loved one is gone and to give/receive support from others that knew her. It's not for the dead. The problem is that I do not find funerals helpful when I'm grieving (I've been to a few in the past few years for grandparents and older friends). In fact, in the case where a family member has died, I find them distressing -- in part due to a number of ill-behaved aunts and uncles. I find other things more helpful when it comes to grieving. For example, after my Grandma died, I looked through family photos, and I played scrabble (her favorite game) with my family. The point is, I think I need to grieve differently. I know I won't regret missing it. But I'm concerned about the reactions I may get from family members. I'm not worried about friends and extended family -- I either know they'll understand or simply don't care enough about their opinion -- but I know that my dad and my younger brother and sister will both attend, and have a tendency to judge others harshly. Should I just go with my gut and grieve in my own way? Or go (even though I'll find it the opposite of helpful) to avoid potential issues with my immediate family? So sorry to hear about your mom.  I can relate to your fears, worry, and anticipation of what lies ahead. I'm coming up on 4 years since I lost my Mom to pancreatic cancer. Regarding your different way of grieving.............it may be helpful to simply talk to your siblings and father now or soon about how you grieving process will look, so it won't take them by surprise.  Then they can process the information and come to terms with it (or not). I wish you a lot more time with your Mom to make special memories. Punky",
      "MessageIndex": 2,
      "PostDate": "10/05/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,94413,0.htm",
      "Title": "Maybe premature - thoughts on funeral"
    },
    {
      "AuthorID": "PunkyD",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/PunkyD",
      "Content": "I'm so sorry to hear what you've gone through.  If you don't want to scare her, then don't jump to any conclusions until you know more.  Take her/advise her to a doctor and try to stay calm. Be positive until there is something to worry about.  Pimple spots sounds like it could be a million things.  Not necessarily serious.  But I'm not a doctor.  She should go so you both can have peace of mind.  Good luck and prayers for no news. Punky ",
      "MessageIndex": 1,
      "PostDate": "01/08/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,73004,0.htm",
      "Title": "my daughter"
    }
  ]
}