{
  "AuthorID": "Ragsmom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ragsmom",
  "Posts": [
    {
      "AuthorID": "Ragsmom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ragsmom",
      "Content": "Has anyone had experience with fat necrosis? I had a lumpectomy over a year ago, and completed radiation treatments a year ago. I have had several lumps appear In close proximity to the incision. My breast surgeon said they are fat necrosis. In one case, she ultrasounds the area. With a new lump, she told me she is \"positive\" it is fat necrosis, but didn't do any ultrasound or biopsy. I am going for a second opinion next week.",
      "MessageIndex": 0,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,94238,0.htm",
      "Title": "Fat Necrosis"
    },
    {
      "AuthorID": "Ragsmom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ragsmom",
      "Content": "this blog has given me much food for thought. I have been on Anastrazole for only 3 1/2 months. My biggest challenges are bone pain, and cramping, which are significantly more challenging at night; and sleeplessness. I also have a low libido and vaginal dryness. Being post menopausal, I had previously had trouble with dryness and lack of sex drive. Now it's much worse. But the bone pain worries me most. I have an elevated blood calcium level, which the doctor is watching, and osteopenia, which I Discovered at the same time as my breast cancer diagnosis. I plan on talking with my doctor, now that I understand there may be other drugs that might not make me feel quite so bad.",
      "MessageIndex": 245,
      "PostDate": "21/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "Ragsmom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ragsmom",
      "Content": "I am three years out from stage 1b breast cancer (small cancer in right breast and 1 lymph node). I noted a lump on left breast. Follow up ultrasounds and mammograms revealed a complex cyst in left breast. Radiologist said it was stable, but my oncologist was not satisfied with that. My breast surgeon scheduled an MRI. Has anyone had what appeared to be a complex cyst, and found out it was cancer?",
      "MessageIndex": 0,
      "PostDate": "04/11/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,137636,0.htm",
      "Title": "Breast MRI"
    }
  ]
}