{
  "AuthorID": "Ramon",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ramon",
  "Posts": [
    {
      "AuthorID": "Ramon",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ramon",
      "Content": "I will just copy/paste another message from other member I read. Again, the mesage at the bottom is not from me, is from another member. I just read this online magazine to keep myself informed and help my mother who survived angiosarcoma now in remission, only god knows for how long. Before I copy/paste, I have to add on my own that my mother takes 2 oz of Flor essence mixed with 2 oz of water first thing in the morning and before going to bed at night. She also in the morning eats a shake of fresh aloe-vera and edible cacti. She takes 3 capsules of Modified Citrus Pectin from the brand Pectasol, one with each meal. I am also tring to get her a new product called BIRM which is widely sold in Ecuador and other Latin American countries but not in USA. Here are some links with info about BIRM: http://www.med.miami.edu/MNBWS/Dandekar106.html http://www.annieappleseedproject.org/annieappleseedproject/oracamplanex.html http://translate.google.com/translate?hl=en&sl=es&u=http://www.diariofrontera.com/index.php%3Faction%3Dshow%26type%3Dnews%26id%3D7536&prev=/search%3Fq%3Dbirm%26start%3D270%26hl%3Den%26lr%3D%26sa%3DN Well now next I copy/paste the message from another member I read somewhere else in this website: \"I was diagnosed with colon cancer 6 years back this past September. In November of 2004, my cancer came back a second time, this time to my bones. I took chemo twice in 6 years and it keeps coming back. So this time I said “no more chemo”. The oncologist was not pleased and gave me months to live. I am still alive 15 months later. I am doing well. I don’t know how much longer I have, but no one does. I attended a funeral this past Saturday for a friend 57 years old (my age) who was diagnosed in December of this year. She took chemo and after the first treatment, she developed blood clots and died this past week. One of the clots traveled to her heart. This would not have happened had she taken no chemo. Another friend of mine passed away last year. He was diagnosed with the same type of colon cancer as I was. They wanted to give both him and myself Cisplatin (a type of very aggressive chemo). I refused. He took the chemo and passed away. I have done as lot of research on chemo on the Internet and nowhere did I find any good that chemo does. Chemo does not cure cancer. For every patient that takes chemo, the cancer clinic gets paid about $5,000. Chemo is all the cancer clinic knows. Why don’t they start teaching their sick patients how to boost their immune systems rather than take chemo that lowers the immune system? You should get busy first thing tomorrow morning and start doing research on ways to boost your immune system. For starters, I am on a near vegetarian diet and take modified citrus pectin tablets. They can be found at your health food store. I take 4 a day. They kill newly formed cancer cells. I also do not smoke or drink and try to stay positive 24 hours a day. I have to keep telling myself that no one on the face of this earth (including the Pope) knows when their time is up. So start building your immune system and start living and enjoying your grandkids. Chemo will never give you a good quality of life and I think that’s all we want. Good luck to you and let me know how things work out.\"",
      "MessageIndex": 4,
      "PostDate": "21/02/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1579,0.htm",
      "Title": "Has Anyone Had Success With Alternative Treatments?"
    },
    {
      "AuthorID": "Ramon",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ramon",
      "Content": "When my mother was given 3 to 6 months to live last year, I was lost. My world crumbled and I was devastated. I was never into religion and I forgot the last time I went inside a church, probably in my early teen years. I'm in my late thirties now but I always somehow was convinced that the design of God called Life works in misterious ways. I decided to ask God for a miracle (there was nothign to loose!). So I got on my knees and in the loneliness of my room I would, from the bottom of my heart, implore for a miracle. I put myself at God's service using St. Francis of Asisi prayer, and I do it every once in a while now. My mother survived angiosarcoma cancer which is so rare that only 2 in 6 million people will get it, with survival rate of only 5%. Don't get mad at the creator (wheter his name is God, Ala, Budah, Jehova, etc). Instead, kneel to him, it doesn't need to be in a church, show complete humbleness and renounce to any rights you might think you have, including the right to life of you and your loved ones. Ask him for mercy. Pour out your heart to him. If short of ideas, use St. Francis of Asisi humble and simple request to God: \" Lord make me an instrument of your peace Where there is hatred, Let me sow love; Where there is injury, pardon; Where there is doubt, faith; Where there is despair, hope; Where there is darkness, light; And where there is sadness, Joy. O Divine Master, grant me that I may Not so much seek to be consoled As to console; To be understood, As to understand; To be loved as to love. For it is in giving that we receive, It is in pardoning that we are pardoned. And it is in dying that we are Born to eternal life \". St. Francis of Asisi Italy, 1526.",
      "MessageIndex": 13,
      "PostDate": "29/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2066,0.htm",
      "Title": "Both my Parents Have Cancer"
    },
    {
      "AuthorID": "Ramon",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ramon",
      "Content": "When my mother was given 3 to 6 months to live last year, I was lost. My world crumbled and I was devastated. I was never into religion and I forgot the last time I went inside a church, probably in my early teen years. I'm in my late thirties now but I always somehow was convinced that the design of God called Life works in misterious ways. I decided to ask God for a miracle (there was nothign to loose!). So I got on my knees and in the loneliness of my room I would, from the bottom of my heart, implore for a miracle. I put myself at God's service using St. Francis of Asisi prayer, and I do it every once in a while now. My mother survived angiosarcoma cancer which is so rare that only 2 in 6 million people will get it, with survival rate of only 5%. Don't get mad at the creator (wheter his name is God, Ala, Budah, Jehova, etc). Instead, kneel to him, it doesn't need to be in a church, show complete humbleness and renounce to any rights you might think you have, including the right to life of you and your loved ones. Ask him for mercy. Pour out your heart to him. If short of ideas, use St. Francis of Asisi humble and simple request to God: \" Lord make me an instrument of your peace Where there is hatred, Let me sow love; Where there is injury, pardon; Where there is doubt, faith; Where there is despair, hope; Where there is darkness, light; And where there is sadness, Joy. O Divine Master, grant me that I may Not so much seek to be consoled As to console; To be understood, As to understand; To be loved as to love. For it is in giving that we receive, It is in pardoning that we are pardoned. And it is in dying that we are Born to eternal life \". St. Francis of Asisi Italy, 1526.",
      "MessageIndex": 10,
      "PostDate": "29/05/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2066,0.htm",
      "Title": "Both my Parents Have Cancer"
    }
  ]
}