{
  "AuthorID": "Ravenitz",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ravenitz",
  "Posts": [
    {
      "AuthorID": "Ravenitz",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ravenitz",
      "Content": "Yes, knee pain. great difficulty in execising which I use to love I now find it so easy to blow it off. And yes belly,belly fat. Does this now mean that with weight gain one now has to worry about dibeties ? Hope I dont sound too negetive, I mean I am reading a great book, and I do have an adorable grandchild. Thank You for sharing, rosa",
      "MessageIndex": 11,
      "PostDate": "02/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3222,0.htm",
      "Title": "Aromasin and Arimidex"
    },
    {
      "AuthorID": "Ravenitz",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ravenitz",
      "Content": "Hi ,I found your message very iteresting. Since I had arthroscopic knee surgery 1 year before I was diagnosed with hormone receptive cancer, I never thought that the increase in knee pain could be from the aromasin.It is very limiting and find it hard to do my favorite exercise ( dance class). The knee surgen sugest physical therapy which I will do but at least I can't blame my knee pain on knee surgery that just didn't solve my knee problem when it could very well be the medication. I simply never thought of it. very enlightening. And yes I have had weight gain ( belly fat ), since I have always been rather slim this disturbs me as well as fears of diabeties with weight gain since I have a family history of this and did have gestational dibeties in 2 pregnancys. However, It would be foolish to risk a return of cancer if the meds can possibably prevent it . someone once said to me that you draw a line down a peice of paper , mark one efficacy and the other toxicity. and from this you can make a reasonable decision. A rock and a hard place. Thanks for sharing , ravenitz",
      "MessageIndex": 10,
      "PostDate": "02/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3222,0.htm",
      "Title": "Aromasin and Arimidex"
    }
  ]
}