{
  "AuthorID": "Redgem",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Redgem",
  "Posts": [{
    "AuthorID": "Redgem",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Redgem",
    "Content": "  On 6/21/2007 Monalisa wrote: Hello everyone,                      my name is Monalisa and I'm on aromisin and I hurt real bad. I've also been gaining weight. My joints hurt so bad. And unless you take the stuff, I don't think you could possibly understand how bad it makes you feel. I'm a very active person and would love to get back in shape. I do yoga and tai-bo every other day + I play volleyball once a week and now I'm trying double dutch jump rope. Last night I could hardly jump, I thought my ankles were going to break. During volleyball I can hardly run in the sand. True statement, I'm going to get back in shape, even if it kills me! (and it might). I resorted to taking a hydrocodone last night and iced my ankles and knees. I'm taking ibu's daily for the pain, my doctor doesn't seem to care about any of my side effects and tells me I just need to keep taking the pill. If anyone can give me any tricks of the trade, please help me.                                    God Bless all of you                              Hi Monalisa,  I just found this website.  It's so helpful knowing that other people are experiencing the same things.  My joints ache badly, my hands more than anything.  It takes me a few moments after getting out of bed in the morning to get going...my ankles are so stiff.  I just started working out again and notice after doing cardio my hands don't hurt at that moment.  Things do seem to get better as the day goes on.  I've been trying to take advil a few times a day to see if this helps but keep forgetting the afternoon pills.  I took yoga in San Diego for several years and just started a power yoga class here in Pennsylvania.  I feel like it's making my hands worse and possibly increasing what was previously mild carpal tunnel syndrome in both hands.  I was on Arimidex for a month previous to this and leg pains were much worse.  I have an appointment with the oncologist in July and am interested to see what he has to say.   Thanks for sharing,   Cindy",
    "MessageIndex": 21,
    "PostDate": "01/07/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
    "Title": "Side Effects From Aromasin"
  }]
}