{
  "AuthorID": "Reina",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Reina",
  "Posts": [
    {
      "AuthorID": "Reina",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Reina",
      "Content": "Is there an alternative treatment for postmenopausal ER positive breast cancer? Arimidex has caused many unpleasant side effects. Are there herbal or nutritional supplements that have some proven effectivness in reducing the percent of reccurence?",
      "MessageIndex": 0,
      "PostDate": "25/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18332,0.htm",
      "Title": "alternative treatment to aromatase inhibitors"
    },
    {
      "AuthorID": "Reina",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Reina",
      "Content": "  On 8/21/2008 iloverobs wrote: My sister is just about to start treatment for medullary breast cancer. She needs IVF then Chemo, radiation and mastectomy at this point. I have made her a book for her her doctors notes and a folder for path reports etc. But I am wondering if anyone can recommend other ways to help her through the next few months. Can you give me examples of great things people did to support you. What did they do or say? Also what did not help or bothered you? Thanks. Sending you all my positive energy Your sister is so lucky to have you. I hope you can go to her appointments with her, for support and to remember things she might not hear because she is afraid or overwhelmed. Help her find a breast cancer support group. Even if she is a very private person, she will almost certainly benefit. Personally, I was bothered by people who were too curious about what my breasts would look like after surgery/reconstruction.. Please, When you are fighting for your life,that kind of curiosity is annoying, and definitely not comforting. A friend suggested I respond by simply saying, \" Everything is  fine.\"",
      "MessageIndex": 1,
      "PostDate": "21/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,27391,0.htm",
      "Title": "Hw can I help?"
    },
    {
      "AuthorID": "Reina",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Reina",
      "Content": "  On 11/24/2007 sososcared wrote: i have this liquid clear stuff coming from my nipple...well no its beside the nipple and i am so scared but the thing is im only 14...and my breast arent that big...and i have a tiny tiny lump under the nipple..i think...what should i do??????? PLEASE HELP If you can talk to your Mom or other adult,get a doctor appointment right away. If you cannot do that,please go to Planned Parenthood or a clinic like it and get medical advice and direction.You don't need adult permission to go to PP. Be brave. You can do it, and set your mind at ease when you find out what is causing your symptoms. It is most likely something very treatable and you will be well, and no longer scared. You are already very capable because you have looked for help.",
      "MessageIndex": 4,
      "PostDate": "25/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18307,0.htm",
      "Title": "omg SCARED"
    }
  ]
}