{
  "AuthorID": "remmus52",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/remmus52",
  "Posts": [
    {
      "AuthorID": "remmus52",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/remmus52",
      "Content": "I had a mastectomy and tram flap surgery in May 2007.  The plastic surgeon told me he would make the new breast slightly larger than my natural breast to compensate for swelling.  He would liposuction it smaller if necessary after all the healing.  Well, it was never bigger.  In fact, it was not big enough to match my natural breast and my choices now are either wear a prosthesis or have a breast lift and/or reduction on the natural breast side.  Has this happened by anyone else?  I am so disappointed after going through all this.",
      "MessageIndex": 0,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19757,0.htm",
      "Title": "tram flap surgery"
    },
    {
      "AuthorID": "remmus52",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/remmus52",
      "Content": "  On 1/14/2008 2008info wrote: Hi everyone, Can anyone give me any suggestion on whether taking Tamoxifen or any other drugs after mastectomy? I had mastectomy surgery four months ago since I had ductal carcinoma in situ(DCIS, stage o breast cancer). After the surgery, I went to see an oncologist. The oncologist suggested me to take tamoxifen for five years. And I was told about the side effects of may getting uterine cancer. I'm still hesitating to take tamoxifen. But I'm scared of the recurrence of the bc. Does anyone have the same situation as mine? What should I do? Any input would be greately appreciated. I also had DCIS and a mastectomy and reconstructive surgery in May 2007.  I started Tamoxifen in Sept.  And will take it for 5 years.  The only side effects I have are occasional hot flashes, which are really not that had.  Because of the possible uterine problems I am also being followed by my GYN doctor.  I have already had one uterine ultrasound.  So far, no problems.",
      "MessageIndex": 2,
      "PostDate": "15/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19713,0.htm",
      "Title": "Tamoxifen?"
    }
  ]
}