{
  "AuthorID": "rinach",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/rinach",
  "Posts": [
    {
      "AuthorID": "rinach",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/rinach",
      "Content": "  On 10/9/2007 raingirl wrote:   On 10/1/2007 Judy2007 wrote: 3 weeks post lumpectomy and SNB. Tumour 8mm. I now have lots of painful burning and hypersensititivity on upper arm and around excision. Nobody warned me about this. Does it go away in a few months? What have you found that helps? GP suggesting low dose of Tricyclic antidepressant. Does that work? Panadeine etc doesn't. Thanks for your ideas and thoughts - love to hear from people who have overcome this problem!! I am two weeks post lumpectomy and they also took out 16 nodes also. I've got about 24 cm of scars.  I was covered with tape burns also. I also had no forewarning by surgeon of numbness or that damn  drainage tube.  I use both gentle massage on my arm and shoulders and a cold poultice of aloe vera. I buy 100% pure aloe vera from the health food store and put in the fridge - 3 times a day or more and put it directly on my surgical incisions and on my upper arm and areas that are numb and cover with a clean tissue. this feels so wonderful cooling and soothing.  I'm also using 100% natural vitamin E on all incisions (now that tape has dropped off) and numb areas. My goal is to heal the skin with the best natural healing agents - and that is vitamin E and aloe vera - which they use in burn units.  I massage my neck, shoulders that knottted up in the surgery by using a tennis ball ( lean against a wall and put the tennis ball in the right spot) Or get a friend to help. there is no reason for you to put up with muscle pain (even in the upper arm) which can be easily relieved with careful, gentle massage. hope that helps I had a sentinel node biopsy along with the removal of the malignant tumor  on October 2, 2007m just 10 days ago.  I have not yet seen my surgeon for post operative follow up yet.  What should I expect pain wise?  There was no warning that I will have in pain , it started two days after the surgery,  It seems that there will be pain, but for how long?  This is my question.  I also have trigeminal neuralgia for which I took Lyrica.  I am glad to see that someone is helped with Lyrica.  I will see my surgeon in 4 days, what questions do I need to ask? Any suggestions? Thanks Rinach",
      "MessageIndex": 7,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16674,0.htm",
      "Title": "Post-lumpectomy neuropathic pain treatment suggestions"
    },
    {
      "AuthorID": "rinach",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/rinach",
      "Content": "I was diagnosed with invasive ductal carcinoma in August, 2007 and had a lumpectomy on Oct 2nd.  I had two sentinel nodes removed for biopsy and were negative.  I am waiting to see an oncologist on Oct 31,  In the meantime I am experiencing occasional sharp pain near and around the incisions.  (I also have trigeminal neuralgia for many years which was treated with radio-frequency lesion about 18 years ago, the pain came back again in mid 2006.  I was waiting to be treated with the repeat surgery while taking lyrica.  It did help me but not without side effects for which I had to discontinue it).  The pain I am experiencing now is not anything like I have experiened with Trigeminal neuralgia but it is very uncomfortable and it is felt with a chill often. How long will this go on, I do not know but I will certainly try whatyou all have suggested.  Cold pack, support bra etc.  What is the dosage of lyrica that is effective in your case?  I am curious to know, with my doctors advice I would like try as I still have a few left. One thing I have noticed in my case, if I use perfumed soap under arm during my shower, the pain increases and stays for days.  Same if I sleep without a bra.  Are any of these common with anyone else? I certainly wish the cold pack suggestion was given during surgery.  I benefitted with cold packs after stereotactic biopsy and needle biopsy.  That was advised by the radilogist and the nurses. Prayers, meditations and volunteering helps me to keep my mind off the pain for sometime. ",
      "MessageIndex": 8,
      "PostDate": "27/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16674,0.htm",
      "Title": "Post-lumpectomy neuropathic pain treatment suggestions"
    },
    {
      "AuthorID": "rinach",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/rinach",
      "Content": "Hi! I had a lumpectomy of my invasive ductal carcinoma on oct 2,2007.  My surgeon did a sentinel node biopsy prior to the surgery to detect whether the cancer has spread.  The prep for the procedure started early in the morning where they had to insert a wire that would latch on to the tumor and then they would inject a blue die, the die traveljed to the nearest node.  After detecting the nearest node to the tumor the surgeon removed the node to test it instantaneously for malignancy.  In my situation the tumor was very small and the node result was negative, meaning it had not travelled anywhere but the grade of my cancer is not good, it is very high grade.  I have just started chemo recently.  I am told, it is not the size or  whether it has spread -- it is the grade of the tumor which is important.  I am going to have another biopsy tomorrow.  I have accepted the situation and am dealing with it as any normal illness with a difference.  I hope your sister's tumor is not high grade and is 'node negative'.  A friend of mine had a node positive tumor and she is doing all right so far.  She never stopped working. There are somany treatments and so much research is going on that mortality rate has gone down.  Please help your sister keep her spirit up. It is very important and consult someone re cancer diet as soon as possible. With my thoughts and prayers for your sister, I wish her well. Rina  ",
      "MessageIndex": 1,
      "PostDate": "14/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18836,0.htm",
      "Title": "Insight on breast cancer not treated for a year"
    },
    {
      "AuthorID": "rinach",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/rinach",
      "Content": "Hello Terri, I was diagnosed with Stage 1 but grade 3 breast cancer with HER-2 factor positive.  I also had similar procedure done, it is called sentinel node biopsy to trace whether the cancer has spread in the nearest lymphnodes.  My diagnosis came out to be initially negative and only two  lymphnodes were removed even though they were not infected.  However, later on in another ultra sound a third node was discovered (close to the ones removed) with cancer cells in it.  Somehow it was not detected with sentinel node biopsy.  I was told it was an exceptional situation. The procedure of sentinel node biopsy is done on the same day of surgery.  It took about an hour and a half.  I am now undergoing chemo and waiting to have another surgery after my last (6of6) chemo  next week,  to be followed by radiation. Best wishes for your sister.  Just know that so many sisters are out there like yours.  Keep the spirit up. God bless us all! Rina",
      "MessageIndex": 3,
      "PostDate": "22/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22201,0.htm",
      "Title": "My sister just found out"
    }
  ]
}