{
  "AuthorID": "rjcrossley (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "http://www.health.ninemsn.com.au/healthnews/8577784/non-surg My friend found she had a lump in her left breast she thought there must be a better way she found this link on freezing breast tumors. She ask me to post it so I did  ",
      "MessageIndex": 0,
      "PostDate": "10/12/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69513,0.htm",
      "Title": "freezing breast tumors"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Sep 12, 2011 10:44 AM kittypest wrote: My husband just turned 65 and was just diagnosed with male breast cancer. It is believed to be caused by Agent Orange exposure in Viet Nam. He has Post traumatic stress syndrome and diabetes. Plus, I recently lost my step-mother to ovarian cancer, and my step-dad, the man who raised me, just had a cancerous kidney removed.  I am just tired, really tired. I wonder everyday when \"I\" am going to have a nervous breakdown.  You will not notice on the outside...everyone thinks I'm so strong, but I feel like I am on the edge. We don't know much about hubby's cancer. All we have is the diagnosis. They say we caught it early. We go this week to talk to oncology surgeon. He insists on having the VA hospital take care of it all. It is the DeBakey center in Houston, TX, that is a teaching hospital, so I don't think I am too worried about their care.  I am just very anxious about this week, because it all becomes very real.  And then I start reading some of these posts about side effects from different meds.  He is already depressed...we fight his PTSD everyday. He has diabetes...what about the loss of appetite.....and what about me??? I feel so guilty about even asking that question. I feel like I don't have anyone. I can talk to my mom, but she is dealing with my dad and their fear that his cancer may have spread. Every little pain scares them, or him...he told me this. But I know it scares her too, because I know what she is going through now.  I can't talk to my best friend, she just tries to tell me what to do, how to feel. I just need her to be there. I feel like I am burdening people when I talk to them. I've gotten a little help from some special online friends, but it seems like they have heard enough and don't really want to hear about it anymore. I don't sleep, my mind just won't shut down.  I am dealing with some medical issues of my own that are causing me to be depressed, and now this.  Do I ever get a break? I am always the strong one, I am always the happy one, I am always the positive one.  I just feel to guilty to worry about me...he is the one with Cancer. I started a blog, that didn't help. I am on anti-depressants, well cymbalta, for bone disease in my neck and back. But all that has done for me in this instance is make me feel soul less. I haven't cried, I can't cry, but I don't want to cry...I need to be strong. I want to sleep, but I can't sleep. My doc gave me sleeping pills, but I don't want to take anymore drugs. Oh, I did cry once. My dog hurt her leg last week and I totally lost it. But then I felt guilty about crying about that and not being able to cry about the fact that my husband has cancer. I am a mess. I am truly at loose ends. I feel like I may just explode one day. .....what about me (see, there goes that guilt again for asking that)     Hi Kittypest you have a right to worry about you I just turned 60 and though Im in remission from advance prostrate cancer  with prostrate bone mets Im find now Im also an Australian ex National service Men 1972 intake if you need to talk let me know in 2008 my doctors told me they were out of opinions on how to treat me as I had a heart problem that prevented me from having any conventional treatment all so in 2008 with the help of a natural path all I did was go off any sugary food and do a detox with flor essence tea large dos of vitamin C with in too week I could sleep again and I could pee adonocarinoma in both breast cancer and prostrate cancer there both gland cancer and both can be controlled so they wont kill use you have a right to worry obout you please dont feel bad about it  Ray   ",
      "MessageIndex": 1,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61818,0.htm",
      "Title": "I'm a newbie.....need support"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Dec 02, 2011 3:01 PM smoser wrote: I am stage 4 breast recurrent cancer. I was on taxotere 5 rounds and received terrible sideeffects It cooked my skin, now on now on gemso  two weeks on one week off and feel better. My question  is how dangerous is to be on chemo ? A year? What negatives are there for internal organs re; to chemo? Any response would be appreciated! Susan How chemotherapy kills cancer cells Hi Susan Sorry for what your going though. Wow a year a long time to be n chemo. Im on an holistic aproch my naturopath put me on in 2008 its mow put me in to compleat remishion but All the best with it any way hope this will help Ray Body tissues are made of billions of individual cells. Once we are fully grown, most of the body's cells don't divide much. They spend most of their time in a resting state and only divide if they need to repair damage. When cells divide they split into two, identical new cells. So, where there was 1 cell, there are now 2 and these then divide to make 4 and then 8 and so on. In cancer the cells keep on dividing until there is a mass of cells. This mass of cells becomes a lump. The lump is called a tumour. Cancer cells divide much more often than most normal cells. Chemotherapy enters the bloodstream and damages dividing cells. Cells in the process of dividing are more at risk of being damaged by chemotherapy. Chemotherapy kills the cell by damaging the part of the control centre inside each cell that makes cells divide. Or it may interrupt the chemical processes involved in cell division. The main ways you can have chemotherapy are as •An injection into the bloodstream •A drip (intravenous infusion) into the bloodstream •Tablets •Capsules The chemotherapy drugs circulate all round the body in the bloodstream and can reach cancer cells almost anywhere in the body. This is known as systemic treatment. There is information about how normal cells grow and about how cancer cells differ from normal cells in the about cancer section of CancerHelp UK. Back to top How chemotherapy kills dividing cells Chemotherapy damages cells as they divide. In the centre of each living cell is a dark blob, called the nucleus. The nucleus is the control centre of the cell. It contains chromosomes, which are made up of genes. These genes have to be copied exactly each time a cell divides into 2 to make new cells. Chemotherapy damages the genes inside the nucleus of cells. Some drugs damage cells at the point of splitting. Some damage the cells while they are making copies of all their genes before they split. Cells that are at rest, for instance most normal cells, are much less likely to be damaged by chemotherapy. You may have a combination of different chemotherapy drugs. The combination will include chemotherapy drugs that damage cells at different stages in the process of cell division. So, with more than one type of drug, there is more chance of killing more cells. The fact that chemotherapy drugs kill dividing cells helps to explain why chemotherapy causes side effects. It affects healthy body tissues where the cells are constantly growing and dividing. The skin, bone marrow, hair follicles and lining of the digestive system are examples of cells that are constantly growing and dividing. Your hair is always growing Your bone marrow is constantly producing blood cells The cells of your skin and the lining of your digestive system are constantly renewing themselves. Because these tissues have dividing cells they can be damaged by chemotherapy. But normal cells can replace or repair the healthy cells that are damaged by chemotherapy. So the damage to healthy cells doesn't usually last. Most side effects disappear once your treatment is over, and some only happen during the days while you are actually having the drugs, for example, sickness or diarrhoea. The section about cancer drug side effects explains this in detail. Back to top How well chemotherapy works The chance of the chemotherapy curing your cancer depends on the type of cancer you have With some types of cancer most people are cured by chemotherapy With other types of cancer fewer people are completely cured Examples of cancers where chemotherapy works very well are testicular cancer and Hodgkin's lymphoma. With some cancers, chemotherapy can't cure the cancer on its own. But it can help in combination with other types of treatment. For example, many people with breast or bowel cancer have chemotherapy after surgery to help lower the risk of the cancer coming back. With some cancers, if a cure is unlikely, your doctor may still suggest chemotherapy to Shrink the cancer Relieve your symptoms Give you a longer life by controlling the cancer or putting it into remission Back to top What remission means Remission is a word doctors often use when talking about cancer or leukaemia. It means that after treatment there is no sign of the cancer. You may hear your doctor talk about complete remission and partial remission. Complete remission means that the cancer or leukaemia can't be detected on scans, X-rays, or blood tests, etc. Doctors sometimes call this a complete response. Partial remission means the treatment has killed some of the cells, but not all. The cancer has shrunk, but can still be seen on scans and doesn't appear to be growing. The treatment may have stopped the cancer from growing. Or the treatment may have made the cancer smaller so that other treatments are more likely to help, such as surgery or radiotherapy. This is sometimes called a partial response. Another term doctors use is stable disease. This can mean that the cancer has stayed the same size or it may even have grown by a small amount. http://cancerhelp.cancerresearchuk.org/about-cancer/treatmen",
      "MessageIndex": 3,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63161,0.htm",
      "Title": "When to no longer receive chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Dec 02, 2011 7:09 PM Johnr_1 wrote: On Dec 02, 2011 3:01 PM smoser wrote: I am stage 4 breast recurrent cancer. I was on taxotere 5 rounds and received terrible sideeffects It cooked my skin, now on now on gemso  two weeks on one week off and feel better. My question  is how dangerous is to be on chemo ? A year? What negatives are there for internal organs re; to chemo? Any response would be appreciated! Susan I am a 4 time Lung Cancer survivor. I have had over 35 chemos of Taxol, Carbo/Cisplatin, and Alimta. 2 major lung surgeries, over 40 CT and Pet Scans and over 600 needles and IV's and 28 Radiation treatments to the neck. And right now i am all clear over the 12 years i have been doing this. Naturopathic things have their place and i have used them (maybe 10 to 15% of what i do) but they are not a substitute for Surgery, Chemo and Radiation. Here are all my personal notes:   http://liveforeverwithcancer.com/ \"\" target=\"_blank\" rel=\"nofollow\">http://liveforeverwithcancer.com/ \" target=\"_blank\" rel=\"nofollow\">http://liveforeverwithcancer.com/   My Best to You Johnr_1 Hi john with me in 2008 the option of treatment was taken away from me. So I had no choice but the go down the naturopath road, or die a painful death. I agree with Susan your a valiant fighter and you truly are a remarkable person. I remember I once talk to a lady in the old church cancer support group who had Non-small cell lung cancer.  she told me she never smoked in her life.  but her husband and sons did.  she to had Radiation treatment.  Surgery, she said she also had Chemo. a few times   but unlike your cancer it keep coming back she fnily come to our church to make her peace with god.  But from other members She learned aboutLiquid cellular Zeolite that how it removes heavy metals and toxins . and how it may be able to help her though it notNaturopathicshe told us, later  there was an great  improvement after she went on a course of 15 drops 4 times a day so the must be some thing in this one. All the best mate Ray    ",
      "MessageIndex": 7,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63161,0.htm",
      "Title": "When to no longer receive chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Dec 02, 2011 3:01 PM smoser wrote: I am stage 4 breast recurrent cancer. I was on taxotere 5 rounds and received terrible sideeffects It cooked my skin, now on now on gemso  two weeks on one week off and feel better. My question  is how dangerous is to be on chemo ? A year? What negatives are there for internal organs re; to chemo? Any response would be appreciated! SusanHow chemotherapy kills cancer cells Hi Smoser Sorry for what your going though Wow a year a long time Im on an holistic aproch my naturopath put me on in 2008 its put me in to compleat remishion but All the best and  I hope this will help Body tissues are made of billions of individual cells. Once we are fully grown, most of the body's cells don't divide much. They spend most of their time in a resting state and only divide if they need to repair damage. When cells divide they split into two, identical new cells. So, where there was 1 cell, there are now 2 and these then divide to make 4 and then 8 and so on. In cancer the cells keep on dividing until there is a mass of cells. This mass of cells becomes a lump. The lump is called a tumour. Cancer cells divide much more often than most normal cells. Chemotherapy enters the bloodstream and damages dividing cells. Cells in the process of dividing are more at risk of being damaged by chemotherapy. Chemotherapy kills the cell by damaging the part of the control centre inside each cell that makes cells divide. Or it may interrupt the chemical processes involved in cell division. The main ways you can have chemotherapy are as An injection into the bloodstream A drip (intravenous infusion) into the bloodstream Tablets Capsules The chemotherapy drugs circulate all round the body in the bloodstream and can reach cancer cells almost anywhere in the body. This is known as systemic treatment. There is information abouthow normal cells growand abouthow cancer cells differfrom normal cells in theabout cancer sectionof CancerHelp UK. Back to top How chemotherapy kills dividing cells Chemotherapy damages cells as they divide. In the centre of each living cell is a dark blob, called the nucleus. The nucleus is the control centre of the cell. It containschromosomes, which are made up ofgenes. These genes have to be copied exactly each time a cell divides into 2 to make new cells. Chemotherapy damages the genes inside the nucleus of cells. Some drugs damage cells at the point of splitting. Some damage the cells while they are making copies of all their genes before they split. Cells that are at rest, for instance most normal cells, are much less likely to be damaged by chemotherapy. You may have a combination of different chemotherapy drugs. The combination will include chemotherapy drugs that damage cells at different stages in the process of cell division. So, with more than one type of drug, there is more chance of killing more cells. The fact that chemotherapy drugs kill dividing cells helps to explain why chemotherapy causes side effects. It affects healthy body tissues where the cells are constantly growing and dividing. The skin, bone marrow, hair follicles and lining of the digestive system are examples of cells that are constantly growing and dividing. Your hair is always growing Your bone marrow is constantly producing blood cells The cells of your skin and the lining of your digestive system are constantly renewing themselves. Because these tissues have dividing cells they can be damaged by chemotherapy. But normal cells can replace or repair the healthy cells that are damaged by chemotherapy. So the damage to healthy cells doesn't usually last. Most side effects disappear once your treatment is over, and some only happen during the days while you are actually having the drugs, for example, sickness or diarrhoea. The section about cancer drug side effects explains this in detail. Back to top How well chemotherapy works The chance of the chemotherapy curing your cancer depends on the type of cancer you have With some types of cancer most people are cured by chemotherapy With other types of cancer fewer people are completely cured Examples of cancers where chemotherapy works very well are testicular cancer and Hodgkin's lymphoma. With some cancers, chemotherapy can't cure the cancer on its own. But it can help in combination with other types of treatment. For example, many people with breast or bowel cancer have chemotherapy after surgery to help lower the risk of the cancer coming back. With some cancers, if a cure is unlikely, your doctor may still suggest chemotherapy to Shrink the cancer Relieve your symptoms Give you a longer life by controlling the cancer or putting it into remission Back to top What remission means Remission is a word doctors often use when talking about cancer or leukaemia. It means that after treatment there is no sign of the cancer. You may hear your doctor talk about complete remission and partial remission. Complete remission means that the cancer or leukaemia can't be detected on scans, X-rays, or blood tests, etc. Doctors sometimes call this a complete response. Partial remission means the treatment has killed some of the cells, but not all. The cancer has shrunk, but can still be seen on scans and doesn't appear to be growing. The treatment may have stopped the cancer from growing. Or the treatment may have made the cancer smaller so that other treatments are more likely to help, such as surgery or radiotherapy. This is sometimes called a partial response. Another term doctors use is stable disease. This can mean that the cancer has stayed the same size or it may even have grown by a small amount. http://cancerhelp.cancerresearchuk.org/about-cancer/treatmen",
      "MessageIndex": 2,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63161,0.htm",
      "Title": "When to no longer receive chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Apr 22, 2012 7:12 AM rhebie wrote: On Apr 20, 2012 8:35 PM sandigirl wrote: I was diagnosed with pre-stage one invasive ductal breast cancer. Had double mastectomy and had herz 2 positive. Adriamycin and cytoxen followed by taxol and herceptin.  Finished taxol May 25, 2010.  Hair started to come in.  July I had breast implant surgery and hair fell out.  Finished herceptin on January 25, 2012 and still no hair.  Has anyone experienced this?  Please help...I'm beside myself. I was diagnosed with  breast cancer in 2009. Maybe my hair won't grow because of the many chemo drugs I took. I had epirubicin,FU5,Cytoxan and Taxatere plus 6 1/2 wks of radiation. And I still look like a plucked chicken LOL. yeah  breast cancer bad enough with out this A few patient here say they have good reults with  oxigan theripy if you do a surch you find morehttp://www.ncbi.nlm.nih.gov/pubmed/22258812",
      "MessageIndex": 3,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,65730,0.htm",
      "Title": "My hair hasn't grown and it's been almost one year since I finished chemo???"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On May 15, 2012 7:04 AM setyawan_jody wrote: In My Country, cancer can be cured with the skin of the mangosteen fruit extract. Because it contains over 17,000 ORAC antioxidants needed to kill cancer cells. Trivial but effective and cheap. If you are interested please try. Hi selyawan jody interesting though from what I have read I feel mangosteen should not be use  as a primry cancer treatment. but it seems may be of benifit in the first stage of cancer. Can you let me know where did you get your information from all the best Ray http://www.cancertutor.com/Cancer/Mangosteen.html",
      "MessageIndex": 0,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66204,0.htm",
      "Title": "BEAT THE CANCER WITH MANGOSTEEN SKIN EXTRACT"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "A friend of mine who fighting breast cancer ask me to post this  article Ray http://www.organicauthority.com/blog/organic/breast-cancer-s    A comprehensive study published in the January 2012 issue of the Journal of Applied Technology shows more evidence of a correlation between parabens and incidences of breast cancer. Titled“Measurement of paraben concentrations in human breast tissue at serial locations across the breast from axilla to sternum,”the team of researchers led by Dr Philippa Darbre from the University of Reading in the UK, found that virtually all—99 percent—of thetissue samplescollected from women participating in the study contained at least one paraben, and 60 percent of the samples contained no less than five parabens. Parabens are chemicals used as a preservative in a number ofcosmetics and personal care productsincluding deodorant, shampoo, makeup, lotions and oral care products, as well as in processed food items and some pharmaceutical products. Underarm deodorants often contain parabens and have been thought to contribute to an increased risk of high paraben levels in the body that have been linked tobreast cancer. But according to Darbre’s team, even women who did not use underarm deodorant were found to have parabens present in breast tissue. The estrogen-mimicking properties of most parabens are believed to be a factor responsible for the rising cases of breast cancer. The prevalence of the number of types of paraben toxins found in the human body, however, make it difficult for researchers to conclude which of the preservatives are most likely the causal agents, but many speculate that parabens commonly found in underarm antiperspirants and deodorants can easily move into breast tissue and may result in tumors.Parabe ns",
      "MessageIndex": 0,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63917,0.htm",
      "Title": "Parabens in breast tissue"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Feb 18, 2009 12:00 AM betteanne wrote: Has anyone here suffered pain / nerve damage from the Taxol Chemo treatments?  I have severe foot pain and my hands are still numb from treatments that ended six weeks ago. Thanks If you can get about 30 sessions in a oxigan richhyperbolic chamberit will help with the damage the chemo had done to your nerves",
      "MessageIndex": 34,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "hi though I havent had  chemo or nerve damage from  Chemo treatments but Ive been told that oxygen theripy work well in help repairing the damage the chemo has done Ray   ",
      "MessageIndex": 54,
      "PostDate": "02/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "hi though I havent had  chemo or nerve damage from  Chemo treatments but Ive been told that oxygen theripy work well in help repairing the damage the chemo has done Ray   ",
      "MessageIndex": 45,
      "PostDate": "02/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    },
    {
      "AuthorID": "rjcrossley (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "A friend of mine who fighting breast cancer ask me to post this article Ray http://www.organicauthority.com/blog/organic/breast-cancer-s A comprehensive study published in the January 2012 issue of the Journal of Applied Technology shows more evidence of a correlation between parabens and incidences of breast cancer. Titled“Measurement of paraben concentrations in human breast tissue at serial locations across the breast from axilla to sternum,”the team of researchers led by Dr Philippa Darbre from the University of Reading in the UK, found that virtually all—99 percent—of thetissue samplescollected from women participating in the study contained at least one paraben, and 60 percent of the samples contained no less than five parabens. Parabens are chemicals used as a in a number ofcosmetics and personal care productsincluding deodorant, shampoo, makeup, lotions and oral care products, as well as in processed food items and some pharmaceutical products. Underarm deodorants often contain parabens and have been thought to contribute to an increased risk of high paraben levels in the body that have been linked tobreast cancer. But according to Darbre’s team, even women who did not use underarm deodorant were found to have parabens present in breast tissue. The estrogen-mimicking properties of most parabens are believed to be a factor responsible for the rising cases of breast cancer. The prevalence of the number of types of paraben toxins found in the human body, however, make it difficult for researchers to conclude which of the preservatives are most likely the causal agents, but many speculate that parabens commonly found in underarm antiperspirants and deodorants can easily move into breast tissue and may result in tumors.Parabe ns",
      "MessageIndex": 0,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63918,0.htm",
      "Title": "The preservative Parabens can cause breast cancer"
    }
  ]
}