{
  "AuthorID": "ROCH81",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ROCH81",
  "Posts": [
    {
      "AuthorID": "ROCH81",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ROCH81",
      "Content": "Hello,            My mom was diagnosed with Lung Cancer in November 06.  Her oncologist had referred her to a surgeon to have her lung removed.  During this they found a mass on her pancreas and discovered she had a weak heart.  My mom being nervous, did not want to have a biopsy done on her pancreas because it was very invasive.  It was never confirmed if she had pancreatic cancer.  But, this basically ruled her out as a candidate for surgery.  Instead she began undergoing chemotherapy in January 07.  She was responding very well to the treatment. The tumor in her lung had shrank significantly.  Her cough was going away and she felt much better.  She was doing so well her oncologist was stopping chemotherapy for this summer.  In early June my mom had to be hospitalized.  She wasnt thinking straight and she had a hard time recognizing my father and I.  During her hospital stay the doctors did a MRI only to reveal a change in the lining of her brain.  To rule out infection they did a lumbar puncture and tested her spinal fluid for cancer cells.  The cytology showed cancer cells in her CSF.  The doctors explained that the lung cancer had metastisized to her meninges(lining of her brain) and spinal fluid.  She was cleared to leave the hospital 6 days later.  She began getting better day by day.  It was nice to have her back to somewhat \"normal\".  About a week later she began undergoing radiation to the brain.  She had 10 sessions of this.  As of now she has been a little forgetful here and there and her hand has been trembling a lot while writing or holding something.  She has a hard time getting up the stairs and her stomach has been hurting.  We met with her oncologist again and he explained that this was \"terrible\".  We explored a second opinion and went down to Baltimore Maryland to Johns Hopkins this past weekend.  They basically told us the same thing and explained that the prognosis was poor.  They told us that they could treat the spinal cord with intrathecal methotrexate.  But they said there is minimal effect and that the toxicity level is high and would probably make my mom feel really sick.  They also talked of some clinical trials which were located in Chicago and New York City (not anywhere near us).  She would basically have to live there.  My mom has had a positive attitude throughout this the whole time.  I dont know if she knows how serious this really is and I really dont want to bring her spirits down by telling her this.  Is that wrong?  This has been very difficult for my father and I.  I am only 25 yrs. old.  It makes me sick thinking about losing my mom at such a young age.  She is only 57 yrs old.  After reading these messages it breaks my heart knowing what you all have had to go through.  I am writing on here to find out if there is any treatment out there that would save her.  Any alternative methods or known clinical trials that have worked for any of you?  Any help would be much appreciated.   -Brian",
      "MessageIndex": 35,
      "PostDate": "18/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "ROCH81",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ROCH81",
      "Content": "Hello,             I hope all is well with you and your friend.  My mom continues to get worse.  Yesterday we had to take her to the hospital to get a MRI to see if there is a progression of the disease.  She is having a hard time walking, speeking and understanding my father and I.  The oncologist has basically written my mom off.  The hospital social worker told my aunt that our oncologist told him that my mom was terminal and her case was closed.  It really hurt my feelings when I heard this because this was never relayed to us.  They have increased my moms dosage of steroids so hopefully that will help with her confusion.  I was wondering if there was a way to get in contact with you off this message board.  Perhaps an AOL screename, email address or phone number?  It would really help to talk with someone who is going through the same stuff.  Your friend seems like a very strong person who is open to trying whatever it takes.  Time seems to be running out for my mom which scares me to death.  I tried looking into Dr. Schulze's \"Incurables\" program.  It is $456 which is extremely expensive.  I hope you receive this message soon.  It would be great to get in contact with you!  Thanks,  Brian",
      "MessageIndex": 37,
      "PostDate": "07/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}