{
  "AuthorID": "Ronart",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ronart",
  "Posts": [
    {
      "AuthorID": "Ronart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ronart",
      "Content": "I had a lumpectomy, sentinel node surgery followed by a mastectomy with reconstruction 1 month later. I went from the smallest cancer detected to mulitcentric breast disease after the pathology report.I found the lump by self examanition. mammograms never showed it. I was on Arimidex for 9 months and thought I was 20 years older than my chronological age. I was 65 at the time, my oncologist switched me to Aromasin which I found even worse. Joint pain, hot flashes and depression took over my life. I was switched to Tamoxifn and now Lexapro has been added which my oncologist wants me to stay on for a year. I also take Ambien CR to get to sleep. I had none of these problems before the Aromatase Inhibtors. Tamaxofin has been easier for me. Yes, still night sweats and hot flashes. Sorry these drug comoanies don't look at the side effectcts more seriously!!!  ",
      "MessageIndex": 3,
      "PostDate": "06/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16756,0.htm",
      "Title": "More on personal side effects from Aromasin"
    },
    {
      "AuthorID": "Ronart",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ronart",
      "Content": "I was diagnosted with stage 1 cancer and LCIS, 12/05 I had a left breast masectomy with reconstuction.No chemo or radiaition. I was on Arimidex for 7 months, joint pains after 3 months, and sciatica and beginning of nueropothy in my feet. My cholestral jumped 30 pints. Oncologist didn't address any of these issues, but took me off for one month then put on Aromisin. After 3months I was contantly depressed, angry, joint pains and nuerophathy hands and feet. Numbness and tingling all my waking hours. I was taken off Aramsin and two days later felt like a weight was off my shoulders. My hands seem to be doing better.I am not on anything for the next month. She will be hard pressed to talk me into another drug.",
      "MessageIndex": 4,
      "PostDate": "07/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9646,0.htm",
      "Title": "Should I keep taking Aromosin?"
    }
  ]
}