{
  "AuthorID": "roofrat63",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
  "Posts": [
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "Hi this is Susan. Its the 7th now and past her surgery date. i pray all went well. Joining support groups with other BC women really helped me and to this day I still do 2 groups. In our group we have a women getting ready for a double mastectomy. I too would love to know the brand of the cammy you got your friend. warm regards Susan",
      "MessageIndex": 0,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19465,0.htm",
      "Title": "breast cancer camisole"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "  On 12/28/2007 cancergirl wrote: cognitive impairements we suffer after cancer treatment. I've have my onco's constantly tell me that it will pass and it can't be that bad. Well it's emabarassing offering a plate of chips and calling them bandaids with a perfectly serious look on my face. Forget important appointments, being afraid to drive a times because of fogginess and fatique.  Putting up the joint pain and bone pain.  Addd that to losing your hair and your skin drying up no matter how much you slather on it. It's about time it's been looked at as a serious part of cancer after care.  When this happens I tend to feel so alone and afraid that it will never end.  Maybe now they can do studies that will help future chemo patients not have to suffer these effects as well as everything else cancer throws our way. Pearl   I agree with Pearl. There needs to be more research and followup on cancer patients after chemo. Its not recognized and in the mean time alot of chemo survivors (that's not a meant be cancer) are going crazy with pain. Where is Opra?  Right now I have two braces on my arms trying to type' if they'd fit on my feet i'd try it,however they hurt too. Throw brain fog in. Can u see me behind the wheel? Where are the research programs to sign up for. If anyone knows of one i will gladly enter. Is there no funding? I wonder if I called up Arnold S the Mayor of Sacramento if he would give me a ride in his spiffy hummer  to the grocery store. Sorry im doing to much venting. im am serious about if there is a program out there and want to know about it......... P.S Please dont feel alone. My prayers are with u.",
      "MessageIndex": 1,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19177,0.htm",
      "Title": "Provders finally realizing the importance of aftercare for"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "Oops I called Gov Arnold  a mayor. I guess im not going to get that ride to the grocery store. Looks like yogurt and granola for the rest of this week. :) susan smiles and prayers",
      "MessageIndex": 2,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19177,0.htm",
      "Title": "Provders finally realizing the importance of aftercare for"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "thank you i will look into b vitimines. Im taking a print out from this websit from the Fibromyalgia treatment center/Guaifensin Protocol to my Dr. Im praying for some relief. warm regards Susan",
      "MessageIndex": 6,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19163,0.htm",
      "Title": "chem and fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "thank you for the replys. I did 8mths of aggressive chemo for stage 3 invasive breast cancer. I had three chemo meds, of the 3 names I can recall but 2. I cant spell worth beans due to chemo brain.. 5-fluor, cytosin, the other started withm an a. Sorry. By the end of chemo I had lost my ablity to whistle, form words or put sentences together, let alone follow a topic.  I also lost my equalibram and could not walk unassited. I just started to whistle two months ago. It has been a year now since chemo. My oncologist said they did not exspect me to remain in remisson for more than 2 years. I plan to prove them wrong. I do have pain mangement. But it is not managed well. I am stuborn and wish to find the cause of the pain rather then mask it. I feel the musle and ligamint pain is due to am toxic build up. Maybe acids or cacium,  ect due to the chemo. im open to opinions and appreciate everybodys replys and prayers. I will give the b vitamins a try. I was thinking that they will help with the cell delivery of oxgen and help detox me. I forgot to mention I had 3 weeks of infusion for a staff infection from surgery. My immun system is low. Susan",
      "MessageIndex": 4,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19163,0.htm",
      "Title": "chem and fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "I have a old version of Susan Loves book. Yes it is excellent. I dont remember much on the chemo side effects. im going to drag it out. I might need her latest one. Sounds like a road trip. Taxols???? Im going on the web. Thanks Pearl. I hope u find some relief. Prayers your way. warm regards Susan",
      "MessageIndex": 5,
      "PostDate": "28/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19163,0.htm",
      "Title": "chem and fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "I hope you have found some relief too. My pain management dr put me on nerontin and guaifenesin(same stuff in mucinex), 11 shots in back and hip + (nero and milo blocks) and all is working so well that Im walking the dogs twice a day now. The Guaifenesin made the most difference. I dont know why it works but it does.   warm regards Susan",
      "MessageIndex": 9,
      "PostDate": "23/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19163,0.htm",
      "Title": "chem and fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "Is anyone experiencing fibromayalgia after chemo. I feel like im going crazy with pain all over. My oncologist says its fibro from the chemo. My body feels bruised all over. The pain in my hip is now in my thigh. My hands hurt so bad and go numb at night. At first it was just my fingers now its the entire hands. Right after chemo I had low back pain to the point of throwing up and taking 14 shows and baths in one day. My feet scream with pain in the morn.It is just escalating. This is just a short summery. There is more. Tell me Im not going crazy. Susan",
      "MessageIndex": 0,
      "PostDate": "27/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19163,0.htm",
      "Title": "chem and fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "Has anyone heard about the use of Guaifensin for the use of fibromalgia?I am a breast cancer survivor with on going side effects from chemo. I know to be careful about what you read on the web. Im curious if anyone has heard of research on the use of Guaifenesin for fibromyalgia. Is there any known treatment for it? My oncologist recomended accupunture. warm regards Susan",
      "MessageIndex": 0,
      "PostDate": "29/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19207,0.htm",
      "Title": "breast cancer, chemo, fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "I know I have have been experiencing increased pain joints, hands , feet, hip, thigh and low back. im under pain managent but still feel like im getting the pat on the head. it seem to me like somethings not right and my body is filling up with fluid. My hands swell till they want to pop as well as the rest of my body. I cant take senna tabs be cause of the sodium makes me feel like im going to exploid. I dont have estrogen receptors, not a candidate for (her2) and not progesterone recp positive so never was put on anything after. i go to 2 support groups and hear of all of the horrable side effects they go thru with arimidex ect. comforting part is there are 20+ yr survivors. Actually some old enough to be my gr grandmas. Im not sure what is out there on what really happens to the body from chemo but im going to keep searching. I did bring up to my dr about risking heart damage with the aggressive chemo (since my father and 8 of his family of 10 died of heart desease). My drs reply was we feel the benefits out way the risk.....im not sure how i was to take that.. ...I known my husband sometime forgets what ive been thru because the package looks okay on the outside. My girl friend said to me...dont put your make up on to soon...theyll think your okay....that was after my second mastectomy...in all fairness he's not a total heal because he just asked me if i was okay. But sometimes in acting like they do theyre just as scared as we are and just want everything to be alright, some men are just better at caregiving  then some others...yet theyre all scared...Im not sure if I helped or made sence..regardless my prayers are with u hun.. warm regards susan",
      "MessageIndex": 2,
      "PostDate": "30/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19207,0.htm",
      "Title": "breast cancer, chemo, fibromyalgia"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "I am a bilateral Maatectomy survivor. She will likely have two drains. Buy over sized tops to accomidate for the bandages and the drains she will probably have for 10 to 12 days depending on fluid drainage.She will not be able to lift her arms far from her sides so buttons are advised. She will need help washing her hair, washing cloths, no lifting and lots of gentle hugs. I'll keep her in my prayers. Susan",
      "MessageIndex": 4,
      "PostDate": "27/12/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19018,0.htm",
      "Title": "Appropriate postop/chemo sleepwear"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "  On 1/4/2008 denny1 wrote: Hi, I am a 1 year BC survivor, never took the drug you are taking but did chemo and now tamoxifen. I have had hip/pelvic bone pain continuous since, I hate taking so much pain med but don't know what else to do. I am 49 yr old and I am in nursing school, it is getting unbearable so next week I am going to a chiorpractor and am thinking  about discontinuing the tamoxifen until I finish school at least. I wish I could give you some encouragment. I'll let you know how the chiorpractor goes. DeniseI am a almost 2 year survivor and did aggresive chemo for my stage 3 triple neg cancer. I had 2 mastectomys. I have been having sever pelvic pain too ( I was throwing up and taking 14 showers a day for relief)..I now have fibromyalgia pain every where now. I take Guifenisin for the Fibro (it works!) and for the pelvic pain methadone... I chose to take the methodone because I didnt want the icky, wiped out feeling of the percocet. The methadone actually blocks the high of pain meds that I dont like and I can function almost pain free from the pevic pain. Everything has a PRICE THOUGH. you have to take it like clock work or you will feel a with drawl. Methadone is also use for people with drug addiction, but also for sever pain. it gave me back my life. I hope this helps. do major research before you commit to any treatment. Ill keep you in my prayers warm regards  Susan  ",
      "MessageIndex": 2,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19338,0.htm",
      "Title": "Neutropenia and pelvic bone pain"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "Hi Tammy I am a Bilate BC survivor too. I have had several implants (long story). With three different plastic surgeons. Filling the expanders over the amount that your permanent implants will be, is common with most reconstuctions. They over fill the expanders so the skin will grow and stretch. This extra skin will be needed for nipple construction giving you 60cc less in the final implant, allowing a more natural resting breast. The chest muscle needs to be stretched out alot with the expander so that it doesnt cause a less desirable effect when the muscle is flexed. I would highly recommend the extra 60cc in the expanders before final implants just from my own personal experience. warm regards Susan",
      "MessageIndex": 1,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19448,0.htm",
      "Title": "Breast Reconstruction after Bilateral"
    },
    {
      "AuthorID": "roofrat63",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/roofrat63",
      "Content": "  On 1/4/2008 Boston wrote:   On 12/22/2007 BC Caregiver wrote: Thanks for taking the time to pass along those great tips.  I ended up investing in a soft post surgery camisole designed specifically with the breast drains in mind.  It is 90% cotton with ony a hint of slight stretch, just enough to keep in from sliding around.  It is something that can be stepped into like a bathing suit and has little pockets attached under the surgical site where the bags from the drains can be placed.  Once the drains are out, the pockets can be removed (they attach/detach with a soft Velcro strip).  It came with a set of breast forms that also have an opening on the back side that enables her to remove the foam padding if she finds that uncomfortable and replace it with a more light-weight natural fiber stuffing that she can use to adjust the size of the form....up to a D size cup, if desired.  I am hoping that the cami will help minimize the restrictions the drains may impose on other types of sleepwear she may want to  use.  It was a bit pricey ($65) but can be filed on the insurance, so I will pass along the receipt to her for that purpose and that way, she can keep 80% of the cost once the insurance reimburses....a sneaky way to pass a little money along to her at the same time.  She would otherwise have a pretty hard time trying to accept the $$ directly to her hand.  Hopefully during the course of hospitalization, they will provide her with another one, since it is covered by the insurance (along with a few other items such as breast forms and mastectomy bras) and that way she will have 2 of them.  The day I was shopping, I found myself in a specialty BC boutique run by 2 senior  26-year survivors who told me they still find their camisoles useful.  I ended up with 2 pairs of open-front PJs and a long open-front light-weight terry cloth robe.  I thought the \"modal\" fiber was softer and lighter weight, but I avoided it just the same because I was not sure about the skin irrigation factor, reactions to medications, etcetera.  I hope those 4 pairs will be enough to get through the need for open-front PJ so that the other sleepwear can be a bit more feminine beyond the initial super-sore stage.  One of the survivors told me that many of her customers experience a permanent spreading of the rib cage that alters the circumference of the original bra size and that swelling can also bump up a person's size a level or two for the sake of comfort.  In any case, I think we are ready for the next stage of preop fun...saying goodbye to the hair....a final family portrait with the long locks, followed by an extreme makeover, starting with a pixie crop hairdo.  I cut my own hair in that style and tried a little color majic and put on some makeup for that excursion in an attempt to show her that super-short and even bald can still be feminine.  It took 10 years off my face immediately (whoopee!), so now were are both pretty excited about the upcoming trip to the salon.            I bought a silk fishermans vest - put the drains in  the pockets - put a large shirt on over it and went out- I felt I felt better than staying home and the drains were not showing.  I am curiouis - where is the store that sells the camisoles - I am having reconstruction in Feb. Thanks Hi this is Susan. Its the 7th now and past her surgery date. i pray all went well. Joining support groups with other BC women really helped me and to this day I still do 2 groups. In our group we have a women getting ready for a double mastectomy. I too would love to know the brand of the cammy you got your friend. warm regards Susan  ",
      "MessageIndex": 7,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19018,0.htm",
      "Title": "Appropriate postop/chemo sleepwear"
    }
  ]
}