{
  "AuthorID": "Rosie5",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosie5",
  "Posts": [
    {
      "AuthorID": "Rosie5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosie5",
      "Content": "I too had a double mastectomy in June 06 ..right breast cancer only but 2 lesions.. Now they want me to take Arimidex and I have not heard any good things about it.. Were you told that you had to take pills for the next 5 years. I thought that by doing the double mastectomy that I was ridding myself of this disease.. I guess I just want confirmation that I am doing the right thing by questioning taking this medication that may change my life for the worse.. it would seem that sacrificing my breasts was enough?? How do I get email from here.. or do I just have to keep checking back from time to time to get and answer??",
      "MessageIndex": 9,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6584,0.htm",
      "Title": "\"elective Bilateral\" Mastectomy"
    },
    {
      "AuthorID": "Rosie5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosie5",
      "Content": "I am currently in the expander process for implants.. but just finished a course of 6 weeks of radiation for unclear margins.. I was considering a diep instead because of the natural feel and shape. I had skin sparing mastectomy in June.. how long should I wait for the reconstruction to start.. and should I see if my doctor in California does this?? I have 2 insurances so money might not be an issue..",
      "MessageIndex": 2,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7269,0.htm",
      "Title": "Diep Procedure in Atlanta?"
    },
    {
      "AuthorID": "Rosie5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosie5",
      "Content": "I was curious as to how long after stopping medication did the cancer return. I am just now beginning Arimidex and I have not read one encouraging thing about it. I am 52 .. I had bi-lateral mastectomy June 06.. very small early BC.. but not clear margins so radiation for 6 weeks just finished.. Now they want arimidex for 5 years.. but I already have joint pain due to fibromyalgia. So not sure I want to contribute more to that. Also how did your reconstruction go and what procedure did you choose?? If I could ask?? I am so scared of this drug..I keep looking for alternatives to taking it such as nutrition and vitamins..",
      "MessageIndex": 8,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7330,0.htm",
      "Title": "What Would Happen If..."
    }
  ]
}