{
  "AuthorID": "Rosi2",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
  "Posts": [
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I'm 49 and was on the Femara & Aromasin for about 2 years. I had such pains in my whole body and felt like an 85 year old women. I started getting really bad pains in my wrist and thumbs. Went to rhumatoid doctor, neurologist and physical theropy and othopedic doctor. I was also told by my doctore that it was not the pill, but couldnt take the pain any longer so I went off it. It has been almost three months and one shot of steroids in my one wrist and I am back to the way I was before I took the pills. I asked my doctor what kind of percentage I have staying on the pill and she couldnt give me an answer. I dont know if I did the right thing but I do know I just couldnt live like that anymore.",
      "MessageIndex": 11,
      "PostDate": "20/06/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5121,0.htm",
      "Title": "Can Frmara Make You Ache?"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I'm 49 and was on the Femara & Aromasin for about 2 years. I had such pains in my whole body and felt like an 85 year old women. I started getting really bad pains in my wrist and thumbs. Went to rhumatoid doctor, neurologist and physical theropy and othopedic doctor. I was also told by my doctore that it was not the pill, but couldnt take the pain any longer so I went off it. It has been almost three months and one shot of steroids in my one wrist and I am back to the way I was before I took the pills. I asked my doctor what kind of percentage I have staying on the pill and she couldnt give me an answer. I dont know if I did the right thing but I do know I just couldnt live like that anymore.",
      "MessageIndex": 10,
      "PostDate": "20/06/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5121,0.htm",
      "Title": "Can Frmara Make You Ache?"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I went for therapy around 24 visits. It really didn't help. My nerologist sent me to a orthepedic doctor next. He said he couldnt do anything. I stopped the pill and started feeling much better but left wrist was still bad.Went to another orthepedic doctor and he gave me a shot of steroids in the left wrist only. I was told not to do the right side where my lymp nodes were removed and the right side was feeling much better. The shot helped a great deal. After a month being off the pill I started feeling great. The only other problem was my neck which they gave me a shot of something else on right side and now I need to do the left side. That helped a great deal also. I got myself a new oncologist who admitted that she had other patients who had to go off the pill because they had so much pain. I am nervous that I couldnt stay on the pill, but I just couldnt take the pain any longer. I wish you lots of luck and know you are not going crazy because this pill does cause you lots of pain even though most doctors don't admit it or know about it.",
      "MessageIndex": 3,
      "PostDate": "16/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4393,0.htm",
      "Title": "Side Effects of Aromasin"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I started in 10/04 with Femara then Aromosin and am back to the Femara. They both casued the same kind of pain so I want back to the Femara because my insurance covered that and not the Aromsin. I am 47 and feel like an 80 year old. I have pain through out my body and since last summer I have started getting severe pain in my wrist and thumb area. The pain is so bad it keeps me up at night and I can barly open jars because I am so weak. If you look you will notice there are numberous people who are having the same pains with these pills. The doctors don't seem to be aware of the side affects. If it wasnt for this site I would still be thinking there was something wrong with me.",
      "MessageIndex": 1,
      "PostDate": "25/03/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4393,0.htm",
      "Title": "Side Effects of Aromasin"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I am 48 and was on Fareston (like tamoxiffin) for five years. Was off all medicine for approx. one year. I was feeling great that year, but then put on Femara Oct. 2004. I started getting severe pains and complained to my oncologist numerous times. She switched to Aromasin but really thought the pains were not from the medicine. I still have severe pains and four months ago started to get really bad pains in my right hand and wrist area. I thought I was being a baby complaining about the pain and nobody seemed to listen to me when I complained. I am afraid to go off the pills but can't stand the pain any longer. I have gained the weight also and feel like I'm 80 years old. Did your doctor give you a percentage on the benefits of staying on the pill to going off it. I feel the same way as you on how these doctors and the drug industry are not letting the patients know these horrible side affects. At this time I am trying to find natural things to take to ease this pain. I will write back again if I get any results and hope if anyone knows what can be taken to ease the pains they will inform us also. One last note I did take a steroid pill (which could only be taken for just days) it seemed to help with the hand and wrist pain and I finally had 3 nights of good sleep, but after the pills were done the pain came back and you cant stay on steroid medicine for long. Not sure of the connection and if something else can replace it.",
      "MessageIndex": 3,
      "PostDate": "21/10/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3038,0.htm",
      "Title": "Arimidex, Side Effects --survivors of Inflammatory Breast Cancer"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I have been on Femara, Aromisin and back to Femara, since 10/2004. I have had severe pain in my whole body right after starting the pill & since last summer I have also started the pain in my wrist and thumb area. The pain is horrible, it keeps me up at night and I have lost any strength in my hands. At first my oncologist said she highly recommended I go on this pill. This last visit she told me she sees no problem with me going off it. I don't know if it's because she is just tired of me complaining about the pain plus I am in so much pain I am now trying to get disability. I am really confussed and don't know if I should go off the Femara. I feel like an 80 year old person even though I am only 47. I don't want to live like this but I don't want to take the chance of getting the cancer back if I get off the Femara. Do you know if it wise to get off the pill? I just don't know if I trust my oncolist anymore!",
      "MessageIndex": 8,
      "PostDate": "26/03/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4435,0.htm",
      "Title": "Aromasin & Femera Cancer Pills"
    },
    {
      "AuthorID": "Rosi2",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosi2",
      "Content": "I had stage II breast cancer and cancer in the lymp nodes and I am cancer free for 8 years. Don't give up and always stay positive.",
      "MessageIndex": 4,
      "PostDate": "07/04/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4816,0.htm",
      "Title": "my Mum Has Breast Cancer - i Need Some Help"
    }
  ]
}