{
  "AuthorID": "Rosies_mom",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
  "Posts": [
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "I had tram flap reconstruction and started feeling pain and a lump about a year and a half after surgery.  The lump was pea sized though. They biopsied it to be on the safe side and said it was scar tissue.  It is kindof near my armpit so I was freaked out it was a lymph node.  Stretching seems to help is some but not sure what to do about something golf ball size. Scar tissue is a very common result from surgery. Have you talked to your doctor about it?",
      "MessageIndex": 1,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,53520,0.htm",
      "Title": "hard sore lump of scar tissue after lumpectomy and radiation"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hi,   I saw your post and was wondering if you were able to get your mammo.  Hoping for good news for you.",
      "MessageIndex": 1,
      "PostDate": "25/10/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62536,0.htm",
      "Title": "DCIS & LCIS ??"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "  There are some charities that provide free mammograms to women with no insurance.  Please call the American Cancer Society or google to start your search.  Don't beat yourself up about your decisions in the past.  You made the best choice for your situation based on the information that you had.  And there is someone who is always worse off than us, but it doesn't negate what we are going through.  Best of luck to you, Karen",
      "MessageIndex": 3,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62536,0.htm",
      "Title": "DCIS & LCIS ??"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Aloha Wahine!     Thank you for your words.  Hmmm, what do I have in common with you??  We both have sported that same fashionable knit cap sans eyebrows look lol.  I have breast cancer too. And I do believe God is always with you. Keep the faith! Karen",
      "MessageIndex": 1,
      "PostDate": "29/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,65142,0.htm",
      "Title": "Do I have anything in common with you ?"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hey Connie,   You are not a pathetic loser.  Diets don't work and medications can make you lose weight.  I have found out that exercise has helped me through my life with depression, stress, appetite and  its proven that it does help.  I'm not talking about going to a gym, you can walk or dance to your favorite music in your house.  It does help to get out of your home.   I'm starting chemo myself in August.  This is my second diagnosis and the first time I did not have it.  I will lose my hair and will most likely be bald at my daughter's wedding but I've come to terms with it and went wig shopping with my friend Saturday and actually had a good time.  Wigs have come a long way baby and my insurance is picking up most of the tab.   Not to shrink you, but I think by posting you are reaching out for help and there is help for you but it may take some time before you find out what is best for you.  Please let your doctor know how you are feeling. You may need to have your medication adjusted.  There are also suppost groups for caregivers.  You are not alone in your situation. Never, never, never give up. Rosie's mom",
      "MessageIndex": 5,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60910,0.htm",
      "Title": "thoughts on depression"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hi  Britt,   I am sorry to hear about your mom. Your mother sounds like one tough lady. There is a group of women on the Susan G. Komen forums who have Stage IV bc and some of them have been living for quite a while with stage IV.  They have alot of good info and provide great support.   Once your mom gets in to see her doc, she can see what treatment plans are available to her.  Your family will then be able to see what decisions/routines need to be made.  I don't know your life circumstances, but could you be available to your mom if she needs help down the road?  If not, maybe you could rally neighbors, co-workers, friends, church members?  You will be amazed at the people who come out to help you at a time of crisis.   Of course that would be with the blessing of your mom, and you know her best.   Everyone reacts in their own way.   Prayers for you mom, Karen  ",
      "MessageIndex": 3,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54629,0.htm",
      "Title": "Mom was just diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Dear Connie,   Have you sought help for your depression?  It is a medical condition, there is nothing to be ashamed or embarrassed about.  There may be help for you.  I know you are hurting but suicide is not the answer.   Rosie's mom    ",
      "MessageIndex": 1,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60910,0.htm",
      "Title": "thoughts on depression"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": " Dear deemarie,   Oh my goodness.  Not sure where you are, but please call the American Cancer Society, or the Komen Foundation for support. The Komen boards are much more active then this one and the ladies are wonderful. You are not alone, there are many others out there fighting the battle with you.   I'm not sure what is up with your daughter, but I would like to give her a virtual kick in the ass, but that's besides the point.  You need to focus on you and what you need to do to be strong and healthy.  Keep the faith and I will be praying for you, Rosie's mom",
      "MessageIndex": 1,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60614,0.htm",
      "Title": "so all"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Wow, we are almost cancer twins.  Same scenario for me, same status and three years from the day of the dcis diag, I was diag with idc in the other breast.  I was not offered a bilateral mastectomy at the time. Everyone was very happy that I \"only\" had dcis stage 0.  20/20 hindsight..  Got a suspicious mammo and I had my second mastecomy end of June.  Nodes were neg and I have an onc appt in a week.  The buzz is to take Herceptin.  I also have family hx so I will most likely take the drugs they recommend.   This is not to scare you.  Hopefully at the very most it is dcis again, but if it is, I encourage you to explore the possibility of a mastectomy as a precaution.  I know alot of factors go into making such a decision.  I'm a few years shy of 50 and I know if I was younger it would have been tough.  I've been married to a wonderful suportive man for 25 years and my children are grown, so it was a no brainer for me. Hoping for a good result for you. Please keep us posted. Rosie's mom  ",
      "MessageIndex": 12,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,58723,0.htm",
      "Title": "Just need to talk"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Wow, we are almost cancer twins.  Same scenario for me, same status and three years from the day of the dcis diag, I was diag with idc in the other breast.  I was not offered a bilateral mastectomy at the time. Everyone was very happy that I \"only\" had dcis stage 0.  20/20 hindsight..  Got a suspicious mammo and I had my second mastecomy end of June.  Nodes were neg and I have an onc appt in a week.  The buzz is to take Herceptin.  I also have family hx so I will most likely take the drugs they recommend.   This is not to scare you.  Hopefully at the very most it is dcis again, but if it is, I encourage you to explore the possibility of a mastectomy as a precaution.  I know alot of factors go into making such a decision.  I'm a few years shy of 50 and I know if I was younger it would have been tough.  I've been married to a wonderful suportive man for 25 years and my children are grown, so it was a no brainer for me. Hoping for a good result for you. Please keep us posted. Rosie's mom  ",
      "MessageIndex": 10,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,58723,0.htm",
      "Title": "Just need to talk"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hey GramNurse,   I just found out yesterday I will be having chemo also.  Got diag in 2008 with DCIS and ended up having a mastectomy but no further tx since is was Stage 0.  Not so lucky this time.  Since the nodes were neg, I thought I would have the option, but it is not recommended as I am HER+.  I teared up as I was leaving the hosp trying to keep it together and cried a bit more that day.  (I'm better today though)  took me some time to wrap my head around it.   I know it sucks, but you have to put your health in the forefront and some things may have to take the back burner. Let people know your situation.  I know it can be hard to ask for help, but people do want to help. This too shall pass. Rosie's mom",
      "MessageIndex": 4,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60781,0.htm",
      "Title": "New Diagnosis"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "  Then why don't you just post what you have learned instead of leaving these cyptic messages.  Sorry if that sounds harsh, but it is very frustrating and your messages sound spammish.",
      "MessageIndex": 2,
      "PostDate": "25/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60831,0.htm",
      "Title": "Nutritional suggestions ?"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "No, sorry kay, it was in response to sjk1963.  He/she always posts the same type of msg.  He/she sent me a private msg that said he would leave me with the name of a doctor for me to check out, but then didn't leave the name of the doctor???? I am on my second diagnosis of bc and will start chemo in Aug.  I have no patience for bs these days.   I do favor your viewpoint in that it takes a multi-disciplinary team to beat cancer.  Nutrition is extremely important, but unfortunately, I think that when cancer rears its ugly head, nutrition alone is not enough.  I'm with you.  Fast food is crap. Keep the Faith!  ",
      "MessageIndex": 6,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60831,0.htm",
      "Title": "Nutritional suggestions ?"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hi,   I'm sorry to hear about your grandmother and mom.  You have alot on you plate. You mentioned you have had three scares with breast cancer.  Did you get suspicious mammos?  I was also wondering if you had brac testing done.   I had dcis in one breast and ending up having a mastectomy.  Three years later, they found idc in the other one and I again had a mastectomy.  No one brought up the thought of just taking the \"good\" breast three years ago, but I wish they had.   If you decide not to do the mastectomy, if they could shorten the mammo time and what the risk/benefit would be from doing that.  It's never an easy decision no matter which way you go, but it needs to be one you can live with. Rosie's mom",
      "MessageIndex": 4,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,60263,0.htm",
      "Title": "Bi-Lateral masectomy"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "  I hear ya sister!  I was given HRT after my hysterectomy.  My doctor told me that it reduced the risk of heart disease (not!)  There is also no heart disease hx in my family.  There is a strong bc hx though.  Threw the pills in the trash the day of my diagnosis.   Due to my family hx, there is a strong chance I would have developed bc anyway, but I feel that the hormones brought it  on sooner.  My mom was 72 when diagnosed and I was 45.  I have two sisters both several years older than me and both are cancer free.    Hope your treatment is going well.  ",
      "MessageIndex": 1,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54762,0.htm",
      "Title": "Compounded Hormones"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hello,   I am sorry to hear about your friend.  My advice is to not push her for info, she is getting it from her doctors and needs to absorb it when she is ready.  The best thing to do is be her friend and support her. Run errands, prepare meals, offer to watch the kids, clean her house,  if she wants to talk be there to listen and let her vent, cry or moan. If she has other friends, maybe you could organize them to take some of the load off the family. There is a wonderful message support board atwww.komen.orgtha t have women who are going through the same or similar thing.   Best wishes to you and your friend. Rosie's mom",
      "MessageIndex": 1,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,62015,0.htm",
      "Title": "supporting my friend"
    },
    {
      "AuthorID": "Rosies_mom",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Rosies_mom",
      "Content": "Hi,   I had fat necrosis after surgery (lumpectomy) but it was pretty quick after surgery (within a few weeks) and it caused my sealed incisions to split.  My doctor said that the fat had broken down and that the body could only absorb so much and it had to find a way out.  I had to pack the opening with gauze and change it a few times a day. So my experience sounds quite different from yours.  It was more like liquidized fat.   Do you think it could be scar tissue from the surgery?  I don't know the answer on the mammo, but I would think a needle biopsy would definately put your mind at ease. Congrats on the BRCA.  Great news.",
      "MessageIndex": 2,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,54940,0.htm",
      "Title": "Fat Necrosis of breast"
    }
  ]
}