{
  "AuthorID": "Ruth601",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
  "Posts": [
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "It could definitely be pre-menopausal.  A simple blood test can check your hormone levels to determine if that is the cause.  If you had chemo and your cycle stopped because of the chemo, it could just be resuming.  I was pre-menopausal when I started chemo, my cycles stopped and have not recurred.  My oncologist said they could resume, but given my age (47 at the time, 49 now) it was likely they would not.  And yes, breast cancer and other \"female\" cancers (ovarian, uterine, etc.) DO have a connection.  So get it checked out!!!!! ",
      "MessageIndex": 3,
      "PostDate": "02/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26609,0.htm",
      "Title": "Reocurring Menastration"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "A second opinion never hurts, but if you're uninsured and cost is an issue I understand that might not be possible.  I had triple negative cancer, which was followed up with chemo and radation (following lumpectomy).  My understand is that triple negative responds better to chemo than some of the ER+, PR+ cancers - meaning chemo is not as essential for your type of cancer.  Depending on the size of the initial tumor, and only 1 positive node, you may be fine with the mastectomy and Tamoxifen.  If you live near a Cancer Center, you could try there for a 2nd opinion as I don't believe insurance is an issue there.",
      "MessageIndex": 2,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24759,0.htm",
      "Title": "Do I need a second opinion?"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I was diagnosed with triple negative breast cancer last year.  It is one of the more rare types of breast cancer.  I'm sure the doctors will explain to you friend that what this means is, of the possible estrogen, progesterone or HER2 protein receptors that can potentially attached to a breast cancer tumor, hers has none.  While this is good is some ways, because those hormone and protein receptors can cause fast-growing tumors, it's also bad because there is no drug therapy (like Tamoxifen or Herceptin) that will help block those receptors from future cancer growth.  Depending on the size of her tumor, her doctor will most likely recommend chemotherapy.   I had a lumpectory - 9 mm tumor removed with clean margins.  Sentinel lymph node biopsy was negative for spread.  4 rounds of A/C chemo, followed by 33 radiation treatments.  I don't know if there is a Cancer Center of America anywhere near where your friend lives.  I went to the Cancer Institute at Robert Wood Johnson University Hospital here in New Jersey, although there are several other great hospitals in the Phila and New York areas that I would have considered if needed. If I can help with any information, please feel free to respond.  I hope your friend's cancer was caught early.  Breast cancer detected early is very treatable with high success rates.  Best wishes, Ruth",
      "MessageIndex": 1,
      "PostDate": "18/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15405,0.htm",
      "Title": "Triple Negative Breast Cancer"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "First, I'm sorry for your news.  Now, take a deep breath and move forward.  You have a lot of information to gather before you panic.  Have you had a biopsy yet?  If not, wait until you get there results of that.  Many lumps are nothing at all.  If you've had a biopsy, what were the results?  Don't be afraid to ask questions.  Find out what all your options are.  Don't be afraid to get a second opinion.  You can get through this.   Best of luck to you,  diagnosed 2 years ago and doing great!",
      "MessageIndex": 1,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25435,0.htm",
      "Title": "my doctor found two tumors"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I completed chemo in September '06, and noticed hair growing back in late November, which was quite a bit earlier than they had told me.  I quite wearing my wig around Christmas of that year - granted, my hair was \"boy\" short, but I was just so darn tired of the wig!  My underarm hair is nowhere near as \"thick\" as it once was, but that's not a bad thing.  I wish it hadn't grown back in a few other places - like my upper lip and chin!  I didn't miss waxing my lip while I was doing chemo!  See - there's good in everything!  Everyone responds differently to chemo, and not every chemo cocktail is the same, so your regrowth of things will be different than everybody elses.  Enjoy what you have and be patient for the rest to grow out - it will, it just takes time.  God bless.",
      "MessageIndex": 2,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24037,0.htm",
      "Title": "Curious and impatient"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I agree with Judy - the best gift you can give your mom is time together.  Plan to do something together that she really enjoys - go to a special restaurant, just the two of you, get pedicures or facials together, go to a play or museum that she loves.  In doing that, you'll also be making memories for yourself, because even though treatment today is so much better than it was 20 years ago, the bottom line is that none of us lives forever.  And none of us ever knows what day will be our last - so make every day special, don't put off spending time with people you love.  Ruth",
      "MessageIndex": 3,
      "PostDate": "19/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19779,0.htm",
      "Title": "Gift for my mom"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Were you able to find a wig for your mom.  I have a short, dark brown one that I wore for about 4 1/2 months last year after my hair fell out.  I'd be happy to send it to you.  Let me know. Ruth",
      "MessageIndex": 3,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11275,0.htm",
      "Title": "wig for chemo patient"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I, too, started to notice hair loss 2 weeks after my first treatment.  Had foolishly waited to get my hair cut (mid-way down my back).  Went right away and had it cut up to shoulder length, and then got a wig to match my hair color and texture, although I went short with the wig.  Had been bugging my husband for several years to let me get my hair cut, yet for some reason when they told me to get it cut before starting treatment, I dragged  my feet.  Isn't it funny the things we hold on to? By a week after 2nd treatment, it was so thin my husband cut the rest off and buzzed me down to stubble.  I wore my wig to work and church, bandanas and a crocheted cap at home and everywhere else.  Some people didn't even realize I was wearing a wig and complimented me on my new haircut! Didn't miss the mustache hairs!  And leg shaving went down to once every 2-3 weeks.  Nice!  Finished treatment in mid-September and by Christmas, although my new hair was still very short, I gave up the wig.  As many people have probably told you, my hair grew in curly where it had been fairly straight before.  And so many people liked my hair short, including my husband, I'm keeping it that way.  Good luck to you on your journey.",
      "MessageIndex": 6,
      "PostDate": "16/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13250,0.htm",
      "Title": "hair lose and chemo effects"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Putting the guide wire in is no more painful than a normal mammogram, except that they will leave you in the mammo machine till they check to make sure the wire is in place properly.  And of course, you can't move till they're sure it's in the right place.  I got to laughing at the whole thing - probably nervousness - and had to make myself stop so I didn't more out of place.  Gives a whole new meaning to the old expression about \"having your tit in a wringer.\"   The dye/radioactive material injection, was, however the most painful part of the process.  They told me it would feel like a beesting - ha!  Don't mean to scare you, but it was more like 100 bee stings all in one spot.  I held the assistant's hand so tight I thought I'd break it.  But it's all over pretty quick.  I read somewhere, long afterward, that they can give you lidocaine creme, or something like that, to help.  Also, don't be afraid to ask for a pain killer, or mild sedative.  I never thought to ask - didn't even know I could.  But I have read that you can.  Hang in there - you can get through it. I hope you have family and lots of good friends to support you. God bless, Ruth  ",
      "MessageIndex": 2,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16599,0.htm",
      "Title": "guide wire insertion"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I would check with your local hospital and see if there is a ladies auxilliary group who does things like this.  Or perhaps local chuch women's groups do this type of work.  I have a friend who is in a ladies group at her church who do this type of work, but I live in New Jersey so I don't think they would ship stuff to you.  But I'm sure there are probably churches in Greenville that have ladies groups of this type.",
      "MessageIndex": 3,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20777,0.htm",
      "Title": "Seamstres needed to make pillows for pts having axillary disection"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I just happened to still have a bottle left from my chemo 2 years ago - I was taking 4 mg Dexamethazone the day of chemo and for 2 days after.  So yeah, 16 mg is 4 times that amount.  It may have to do with what chemo drugs they are giving her, and in what dosage.  But in any case, don't ever hesitate to ask the doctors, nurses or even the pharmacist.  They will tell you why the dosage is what it is.  I did have trouble sleeping, even with only 4 mg, so I would imagine that may be a side effect she will experience.  Benadryl helps some (it's the same sleep aid that's in Unisom), but at one point I asked for something stronger and was given Lorazepam (sp?) - which is also a mild anti-nausea med.  Best to you and your family.   Ruth",
      "MessageIndex": 7,
      "PostDate": "15/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24904,0.htm",
      "Title": "dexamethasone and treatment"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Taxol or Taxotere?  I believe they are some of the newer chemo drugs, but I don't know much about  them.",
      "MessageIndex": 1,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21429,0.htm",
      "Title": "\"T\" Treatment"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "From my understanding, chemo is not the normal course of treatment with stage 1 breast cancer.  If you were ER+ or PR+, or HER2+, and are taking Tamoxifen or Herceptin, then I don't believe you would need to do chemo also.  With stage 1, they often just do a lumpectomy rather than removing the whole breast, so I already think you've done more than you absolutely have to.  Don't be afraid to seek a second opinion.  It's your body and the decision on treatment is yours, nobody elses.",
      "MessageIndex": 2,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21495,0.htm",
      "Title": "recurrence"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I did not experience this \"cord\" but did have period pain, achiness, twinges, etc. in both the breast and underarm area.  My oncologist told me this is nothing to worry about - as nerve endings regenerate, you will experience all kinds of sensations and it can last up to 2 years after the surgery.  I am just past the 2 year mark on the lumpectomy, and almost up to the 2 year mark on the lymph node removal, and I have very little sensation anymore in those areas, just as the dr. said.  But I also didn't hesitate to mention it each time I saw her, just to be sure.",
      "MessageIndex": 4,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24042,0.htm",
      "Title": "Pain 10 months after having lymph nodes removed"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Hi!  I had a different cocktail -  Adriamycin and Cytoxin.  They gave me decadron (steroid) and compazine for the nausea.  I had no problems.  Take whatever they give you, on schedule, even if you don't feel sick.  Don't know what steroid they will give you - side effects I had were difficulty sleeping, and constipation.  Eat lots of fruit (canned is fine) and yogurt like Activia helps.",
      "MessageIndex": 1,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16544,0.htm",
      "Title": "Chemo side effects"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I have wondered the same thing since I have only had routine mammograms and regular doctor checkups (with 3 doctors, it ends up being pretty frequent).  What I'd like to know is, if they're only checking my breasts, how do I know if it shows up somewhere else?  The only other test my onc recommended is a colonoscopy.  Apparently there is also a connection between BC and colon cancer.",
      "MessageIndex": 3,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20051,0.htm",
      "Title": "Followup testing post bc treatment"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "My advice, based on my own mistake, is to be proactive and at least cut it short before starting chemo.  My hair was halfway down my back and I failed to cut it short before starting chemo.  Sure enough, about 2 weeks after the first dose (I had 4 rounds of Adriamycin/Cytoxin) - it started to fall out.  And short little clumps would have been easier to deal with than long strands.  So for starters, go get that hair cut.  I opted for a short wig - easier to deal with.  Any many people just thought I'd gotten a short haircut.  When my hair grew out enough that I was ready to let go of the wig, people just thought I went shorter.   Continue to tell your wife she's beautiful.  Our hair really is a huge part of our appearance and it's hard to feel the same about yourself without it.  If she doesn't feel comfortable in a wig, try hats, scarves, whatever.  I only wore the wig in public - hats and bandanas at home.  It does grow back - and in the grand scheme of things, it's still a small price to pay for beating cancer. Time for regrowth is different for everyone.  I finished chemo in mid-September and stopped wearing my wig just before Christmas - shorter than the onc. warned me.  My hair was REALLY short, but I was ready to move on. Best to you and your wife.",
      "MessageIndex": 7,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28972,0.htm",
      "Title": "Hair Loss with Cytoxan and Taxotere Therapy"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Hi.  My name is Ruth and I was diagnosed in May 2006 - I was 46 at the time (turned 47 in July, just before my first chemo).  I'm told also that it is one of the more rare types of BC, but very responsive to chemo.  I was very much against chemo - stage 1, less than 1 cm, no lymph node involvement - thought I only needed radiation.  But after some online research, and finding that it is a more rare, more agressive type of cancer, with no systemic treatment, I went for the chemo.  My onc has not used the word remission, just that everything is fine.  My first mammo since diagnosis was in Feb and was OK.  Have seen both the onc (2X) and radiation dr (1X) since then and both say everthing looks good.  See the onc again in 2 weeks.  I don't know if the fear of recurrance goes away, or just moves to the back of your mind at times.  I have hope that the chemo got everything that the lumpectomy might not have, but I will be vigilant w/mammograms and check ups.  Best to you.",
      "MessageIndex": 2,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16579,0.htm",
      "Title": "triple negative br. cancer"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Hi Andi - I am a 49-year-old caucasian woman, diagnosed 3 years ago with triple negative breast cancer.  I had never heard of it before my diagnosis - didn't really even know there were different types of of breast cancer.  For more information, check out tnbcfoundation.org.  It is a website dedicated to triple negative - rare breed that we are!  My cancer was stage 1, .9 cm tumor.  I had lumpectomy, sentinal node biopsy (negative), 4 rounds of A/C chemo, and 33 radiation treatments.  All my check-ups, to date, have been fine.  I'm grateful that it was caught early.  You don't say what stage you are in this process.  If you need more help from someone who's been through it, feel free to respond.",
      "MessageIndex": 1,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35114,0.htm",
      "Title": "Triple Negative Tumors"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Hi Emily,  The lump I had removed last year sounds very much like yours - small, undetectable by touch but showed up on mammogram.  Nothing unusual on ultrasound.  Left breast, on the underside and close to the chest wall. I had an excision biopsy with needle loc - essentially same-day surgery.  They insert a needle with a hook during a mammogram to pinpoint the lump for the surgeon, and then they go in and remove it.  I was in and out of surgery in about 45 minutes, out of recovery in an hour and home about an hour later.  They glued the incision closed, so there were no stitches or staples.  I took nothing by Tylenol for the minor discomfort, and was back at work the next day. If your lump is found to be benign, which I hope it is, you'll be fine and not need anything further.  If it's not, my guess is they will want to go back in and remove some lymph nodes to see if it has spread.  Mine, unfortunately, was cancer, which I didn't find out for 4 days after surgery.  So I did have to have the 2nd procedure.  I don't know if you've had your biospy yet, but if you haven't, take heart, it's really not bad at all.  Unless you are sensitive to anesthesia, you'll be fine.  I hope all goes well for you. Ruth",
      "MessageIndex": 2,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12359,0.htm",
      "Title": "Scared and need info"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I had the same type of cancer as your mum - what they call \"triple negative.\"  Because it does not respond to some of the other drug treatments, such as Tamoxifen, Aromasin and Herceptin, the doctors do tend to recommend chemo as the only systemic drug treatment to battle any residual cancer that may not have been removed by the surgery.  My tumor was .9 cm, stage 1 - and most doctors only go with radiation with a tumor under 1 cm.  But the triple negative status really caused my doctor to strongly recommend chemo.  To be honest, aside from losing my hair, I had less problems with chemo than radiation.  I had 4 cycles of cytoxin/adriamyacin, and minimal side effects.  The radiation, having to go every day, became very tiring.  I'd honestly have to say, knowing what I know now, I would still have done the chemo.  Don't know if that helps you or not, but if your mum is in generally good health and strong, she should do OK with the chemo.",
      "MessageIndex": 2,
      "PostDate": "14/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19618,0.htm",
      "Title": "Treatment Options"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Oh, and by the way - you DO have a say in it.  The doctors can only recommend treatment, they can not force it on you.  But take a careful look at the survival statistics with or without treatment before you make a decision.  It is ALWAYS your decision.",
      "MessageIndex": 3,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24745,0.htm",
      "Title": "Markings for radiation therapy"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "The markings are essential for the radiation people to line you up properly - any other kind of marking would wear off/wash off/move during the course of the 7 weeks time.  And Linda Lou is right, only the dot between my breasts is really visible, and only when I wear a bathing suit or something lower cut.  Look at is a badge of honor for surviving.  With the popularity of tattoos these days, consider it a fashion statement!  Hey, it's better to be alive with a small dot on your chest, than unmarked in a box 6 feet under!  The scars fade, and the radiation markings aren't that big a deal in the larger picture.  I'm not sure about your allergies, but I doubt it's enough dye to really have much effect.  But be sure to mention that - they may have different types of inks that you wouldn't have a reaction to.  Good luck!",
      "MessageIndex": 2,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24745,0.htm",
      "Title": "Markings for radiation therapy"
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "I too was recently diagnosed. I have had a lumpectomy and sentinel node biopsy. I was orignially told the lump was 6 mm, now am told it was 9mm - just under a centimeter. The lump had clean margins and no spread to the lymph nodes. I was ready to go ahead with radiation, but the oncologist is pushing for chemo. My tumor was triple-negative - ER-negative, PR-negative, HER2-negative. Anyone else with triple negative just doing radiation or is chemo really necessary?",
      "MessageIndex": 3,
      "PostDate": "07/07/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5650,0.htm",
      "Title": "Diagnosed..so Now What..."
    },
    {
      "AuthorID": "Ruth601",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Ruth601",
      "Content": "Hi! Thanks for your reply. I did end up going through with chemo. In light of the triple-negative status, it seemed like it was the best option. I four rounds, spaced 3 weeks apart. The first 2 were pretty easy, actually; the 3rd was harder to bounce back from. The last one was just a week ago and I'm not back to \"normal\" yet. I still have to do radiation as well. I get a couple weeks' break and will start that in October. Other than having to go 5 days a week, I don't believe that will be as bad. Even so, if someone asked me if they should do chemo or not, I would say if the doctors are recommending it, do it. You can make it through it. Honestly, the worst part is losing your hair (mine was halfway down my back), and I know it will come back, it just takes time. If anyone can tell me how long it took them for their hair to grow back, I'd appreciate it.",
      "MessageIndex": 5,
      "PostDate": "21/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5650,0.htm",
      "Title": "Diagnosed..so Now What..."
    }
  ]
}