{
  "AuthorID": "sabre8",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sabre8",
  "Posts": [
    {
      "AuthorID": "sabre8",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sabre8",
      "Content": "I have read some of the most wonderful posts so hope that maybe someone out there might be able to help me. My mum was diagnosed with a rare form of breast cancer in April '06 just months after the accidental death of my 23 yo brother. She had suspected there was a problem in Oct 05 after being kicked by a sheep and a lump forming in her breast, her local regional Registered Nurse told her not to worry. She was wrong! In 06 I had moved here to the US from Australia, so was only able to go home during chemo in the Sept. Mum's cancer lump was removed ok and she was able to keep her lymph nodes, but the cancer ended up in her blood stream and later formed tumours in her lungs requiring 3 sessions of IV chemo in which twice she got an infection on day 10 when the immune system was down and we nearly lost her. I was home for the 3rd session to be of some comfort to my then 8yo brother.  The tumours cleared away and she was fine until early this year when tumours were rediscovered in her lungs and required her to have fortnightly surgery. I went home for my sisters wedding and then down to spend 2 weeks with mum, as my step father said she was losing the battle, but as she was up and walking and quite healthy I wanted to take the opportunity to enjoy her and it turned out I was going to be able to be there for her new lot of chemo treatments. This time she had a combo of IV and oral which she started while I was putting my husband and 3 kids on a plane back to the US before heading to where she lived. The following day she had a reaction and ended up hospitalised, I was then told that the cancer had formed 6 tumours in her brain. My step father was a total jerk and although mum was not at optimum health and did have trouble getting all her words and thoughts out, he was telling me (and everyone else he met) that she was dying and not going to come out of hospital. Up to this point I knew very very little about her condition as 06 had been a rough year with losing 6 family members from our little family and mum didn't want to worry me. Out of concern I talked to the hospital staff who assured me she would be able to return home in few days, but they were watching her 2 of her particularly large brain tumours very carefully. Mum was aware of my step fathers attitude and ended up confessing to me that she wondered if he had tried to poison her prior to her diagnosis after spraying pesticides on her side of the bedroom wall for termites, at the time he did not allow them to vacate the house for the minimal 24hours and though she had some breathing problems from the fumes she didn't think anything further about it. I didn't give the thought of him doing anything deliberate until a day later when one of the tumours leaked. I was there at the time and when her husband arrived was shocked when he whispered to me 'I knew she would die today'. I had already found that my little brothers biological dad was aware of the situation and had tried contacting me via email -after being denyed access to my brother for many years due to my step fathers false claims that my brother was sexually abused. I watched my step fathers reactions for about 20 minutes while they prepared her for transportation to a big city hospital before I decided to tell him about the email, I explicitly asked him not to go telling every person he met of the current situation as my brothers dad was being fed the information. He responded that it didn't matter as he had been to see the solicitor that day to make sure he was going to be able to keep my brother (who I had also discovered inherits everything-which isn't much given we predict they are just off bankrupcy and the only money still entact is my brothers trust funds). Fortunately my mum survived and was transported back to the hospital closer to her home after just 4 days since her neuro surgery. Up to this point my mum had been on a variety of herbal remedies 10 apricot kernals a day, swedish bitters, colludal silver and other concoctions of st johns wort, horsetail and calendula tea. At my concern of her husband encouraging her to mix her herbal remedies with the multiple medications and pain killers I got her to agree take a break from them until she finished the current medicines. I even went so far as to spend $70 on moisturiser to stop him from applying his herbal one, which worked up until the day before my sister and I were due to return to our own families. While it hasn't been concluded to be the cause, he had rubbed a moisturiser containing st johns wort and horsetail amongst other herbs on her legs which she then ended up suffereing incredible pain in her legs to the point that her body broke out in a sweat before she passed out and my sister and 11year brother were removed from the room while they stabalised her. Again my mum pulled through, then had radiation therepy-which during this time my step father had childsupport ask my brothers bio dad to change his payments to my stepfather instead of my mother prior to her death, fortunately the bio dad asked me for advice and I told him guardianship wasn't guaranteed to be to my stepfather and she could still potentially be around for months even though the doctors dont think she will see another christmas. My step father also refused the OT home safety inspection or replacing the 6 rickety planks of wood on bricks that form the steps into their 2 br 'trailer' house or even put a hand rail in the shower. While I have no control on being able to get the rail in the shower, I can organise a builder to put in proper steps and hand rails to enable her to safely leave the house. At this point I have no idea what to do, my step father has managed to convincer her that her 2 grown daughters are just out to get him and she didn't even particularly want to talk to us on Mothers Day-she kept stating that it was just to be her, her husband and my little brother. Having been groped by my step father and made to touch my dead brothers ashes against my will, I know I am biased against him and dislike him passionately-but more deeply than that I am concerned for my mother and her health. I understand that her chances of survival are minimal, but I don't believe that have exhaused all the possibilites and have been mainly going on the advice of Australian small town oncologiests. Any advice would be appreciated. Thank you!",
      "MessageIndex": 0,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36079,0.htm",
      "Title": "Mum's rare breast cancer situation"
    },
    {
      "AuthorID": "sabre8",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sabre8",
      "Content": "Contacting the police has certainly crossed my mind, but as mum has just had radiation therepy and is pretty delicate at the moment I don't want to be creating any extra stress. For the moment she has lost her short term memory and doesn't remember be being with her only 3 weeks ago, but hopefully that will settle down with the swelling goes down in her brain. Her husband has also managed to convince her that I am nothing but a trouble maker and she doesn't even want to talk to me on the phone. I am keeping a fairly close eye on the situation as my grandfather lives in his own small house on the same property-which adds to the complication of getting her out of there. I feel pretty helpless in the situation and just pray that she gets through this to get strong enough to be able to get her out of the situation. I have also been looking at some of the alternative forms of cancer treatment out there as now that traditional medicine feels there is very little else they can do. Thank you for your advice.",
      "MessageIndex": 2,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36079,0.htm",
      "Title": "Mum's rare breast cancer situation"
    }
  ]
}