{
  "AuthorID": "Sandy_B_5",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sandy_B_5",
  "Posts": [
    {
      "AuthorID": "Sandy_B_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sandy_B_5",
      "Content": "Barbara, I had to change insurances which would not cover my Xeloda. It would cost me $938.00 a month. So I went this site and it helped me with Xeloda and other meds. Since my insurance would not cover prescription drugs. www.needymeds.com (or .org) This site takes you directly to pharm. company. They have a patient assistance program. THere are qualifications to meet the requirements. And maybe you do. Try it. I was approved due to being on disability and doctor filled out form. And when approved, meds are free! I did not utilize this, cause ironically, I had a set back that I was put on taxatere. Let me know. Good luck. I hope this helped.",
      "MessageIndex": 1,
      "PostDate": "01/06/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1107,0.htm",
      "Title": "Insurance Co. not paying for Xeloda"
    },
    {
      "AuthorID": "Sandy_B_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sandy_B_5",
      "Content": "I have been dealing with Breast Cancer for 7 years. This past July, a slight cough while driving, creating unbelievable pain in rib and back area. While in ER, they found cancer spread to spine area and bones. I experience a lot of pain, contant fracture of ribs, and overall depression. I was put on Xeloda. And living on Ocycotin, neuortin, etc. Which I hated. I was then given Zometa once a month...a miracle! No more fractures and pain subsided. I am now on Taxatere (due to liver being effected now) I get once a week injections and still receive Zometa. I feel fine. Besides the effect of the Chemo, I am glad my bones, back and rib areas do not hurt anymore. And no more pain killers! I really feel the Zometa is a wonder drug. DOn't give up...goood luck Sandy",
      "MessageIndex": 3,
      "PostDate": "22/06/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1168,0.htm",
      "Title": "my Mom Has Breast Cancer and it Has Spread to Her Spine"
    },
    {
      "AuthorID": "Sandy_B_5",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sandy_B_5",
      "Content": "I buddy with another women on our weekly chemo 'outings'. It is great support for the two of us and we can talk and express to each other when we can't to family and friends. But today, my friend, told me somehting and asked for my advice and I was lost for words. I was wondering if anyone had any information that I may try to relay to her or 'sites' to get the facts. My friend is on taxetere and herceptin. She is on 11 round on a 14 round protocol. She told me today she is worried that her usage of cocaine and alcohol may hinder her recovery. She told me she was a 'partier' and has curved her intake since starting chemo, but still at least 3 times a week and when she is down, feels she wants more. She told me before about the drinking (and it's not just one or two), but was shocked and scared about the cocaine. Can anyone help me, help her with some facts and advice. Sandy",
      "MessageIndex": 0,
      "PostDate": "08/06/2004",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1160,0.htm",
      "Title": "Concern With a Fellow Cancer Patient and Need Advise to Help Her"
    }
  ]
}