{
  "AuthorID": "sarahruth66",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sarahruth66",
  "Posts": [
    {
      "AuthorID": "sarahruth66",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sarahruth66",
      "Content": "I was on tamoxafin for 5 years.  I had very few side effects.  I was changed to femara.  I stayed on it for 3 years, and never knew the horrible pain and arthritis in joints was a side effect.  I have been off it for 9 months and still can't stand up straight and walk.  I have constant joint and muscle pain.  Does anyone know if this goes away?  Is there any thing that can be done for relief from these terrible side effects? ",
      "MessageIndex": 0,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "sarahruth66",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sarahruth66",
      "Content": "Thank you for your reply.  I wonder how long it takes for femara to get out of the system.  I stopped last May 13th, and it has been 10 months.  I wonder if I'll ever get my life back.  After this experience, the meaning of 'quality of life' takes on a whole new definition.  Not to mention that it is only a little over 40% effective.  I guess that is high for cancer treatment, but with a new drug I wish I had all the information and side effects before taking it. I would have stopped taking it much sooner. Thanks again and I wish you a very complete recovery. Sarahruth",
      "MessageIndex": 5,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    },
    {
      "AuthorID": "sarahruth66",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sarahruth66",
      "Content": "Thank you so much for your response.  It is somewhat comforting to know someone else can relate to the problems I am having.  I stopped because my oncologist said I had to take actonol with the femara for calcium and mineral loss.   I took one a week for 3 weeks and thought I was going to die.  It felt lke I had ground glass between all my joints and nothng wouold help.  Couldn't walk and just laid in bed.  Only then did I start reaearching the side effects of both drugs.  I had thought that at 65 I had arthritis,etc.  I am considerably better now that I am off femara.  I would like to be able to walk normally again without pain.  I can not stand up straight.  I am very hunched over but MRI doesn't indicate stenosis.  I have been off femara now for 10 months. I have tried physical therapy, acupucture, water aerobics, chiropractors, massage therapy along with various meds.  Advil (800 mg twice a day) is the only thing so far that helps a little. I had a lumpectomy in 12/99 for invasive lobular breast cancer.  The tumor was very small and all nodes and tissue were negative.  I had radiation, but not chemotherapy.   My oncologist told me 2 years ago that I could stop femara, but I continued it because my insurance paid for it and I thought it would give me more protection.  How I wil I had listened to my oncologist.  She never mentioned side effects.  But then they seldom do. The pain I have in hips and knees is bilateral.  I have wondered if there is natural remedy or herb that would help.  I am at a loss to know what to do next.  I have wondered if there is any safe  estrogen replacement.  I also had a hysterectomy15 months ago.  That was elective. Again, thank you for your reply, and I hope your pain lessens too.  I would be interested to know what your oncologist recommends.    Sarahruth  ",
      "MessageIndex": 2,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,34104,0.htm",
      "Title": "femara long term effects"
    }
  ]
}