{
  "AuthorID": "Sarah7814",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sarah7814",
  "Posts": [
    {
      "AuthorID": "Sarah7814",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sarah7814",
      "Content": "Thank you so much for all your responses, I appreciate you taking the time. It is great to hear a balanced view of how effective diet and supplements can be. Whilst I appreciate the alternative/complimentary approach may not help everyone, I feel at this point in time, there is nothing to lose by trying it, good nutrition can only be beneficial, right? I asked my Mum's Oncologist about the supplements I quoted in my previous message, he looked at me blank and said he had never heard of them, and why would he? He is a Doctor not a nutrionist, I've heard Dr's only undertake 11-20 hours of nutritional study in their training. Whether this is true or not, it does pose the question, should the medical world be paying more attention to the power of food? I am carefully researching the effects of each of the supplements I plan to give my Mum to ensure each one does not pose a risk of DVT (so far I've read that Curcumin might do this). I'm also checking if any of it is likely to interfere with the Tamoxefin.  I came across a great website in the UK www.canceractive.comwhi ch is all about fighting cancer with a holistic approach and has lots of great information backing up the use of supplements and diets. I figure with so much information detailing success stories using alternative methods and hearing that clinical trials are commencing on various plants to fight cancer, then there has to be something more than pure luck which is reducing tumours in the people that take these supplements. Springflowers you are very knowledgable, and it is so wonderful to hear what you have managed to achieve without conventional treatments. Are there specific quantities of each supplement that you would recommend? I hope that your regime can work for others and for Carriebelongs too. I will be sure to keep you informed of Mum's progress and I would love to hear how you are both progressing. Sincerest thanks again,   Sarah",
      "MessageIndex": 103,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64060,0.htm",
      "Title": "Beating stage IV Breast Cancer"
    },
    {
      "AuthorID": "Sarah7814",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sarah7814",
      "Content": "Thank you so much for all your responses, I appreciate you taking the time. It is great to hear a balanced view of how effective diet and supplements can be. Whilst I appreciate the alternative/complimentary approach may not help everyone, I feel at this point in time, there is nothing to lose by trying it, good nutrition can only be beneficial, right? I asked my Mum's Oncologist about the supplements I quoted in my previous message, he looked at me blank and said he had never heard of them, and why would he? He is a Doctor not a nutrionist, I've heard Dr's only undertake 11-20 hours of nutritional study in their training. Whether this is true or not, it does pose the question, should the medical world be paying more attention to the power of food? I am carefully researching the effects of each of the supplements I plan to give my Mum to ensure each one does not pose a risk of DVT (so far I've read that Curcumin might do this). I'm also checking if any of it is likely to interfere with the Tamoxefin.  I came across a great website in the UK www.canceractive.comwhi ch is all about fighting cancer with a holistic approach and has lots of great information backing up the use of supplements and diets. I figure with so much information detailing success stories using alternative methods and hearing that clinical trials are commencing on various plants to fight cancer, then there has to be something more than pure luck which is reducing tumours in the people that take these supplements. Springflowers you are very knowledgable, and it is so wonderful to hear what you have managed to achieve without conventional treatments. Are there specific quantities of each supplement that you would recommend? I hope that your regime can work for others and for Carriebelongs too. I will be sure to keep you informed of Mum's progress and I would love to hear how you are both progressing. Sincerest thanks again,   Sarah",
      "MessageIndex": 112,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64060,0.htm",
      "Title": "Beating stage IV Breast Cancer"
    },
    {
      "AuthorID": "Sarah7814",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sarah7814",
      "Content": "Hello,  I'm new here. I am inspired reading how many of you are beating the odds the dr's have given you and I wonder if you could advise me... My mum was diagnosed breast cancer May 2006 aged 51, lumpectomy, but into lymph nodes. 6 x chemos, 4 x radios, 5 years arimidex. It returned last summer, arimidex Jul-Dec '13, no effect. Jan '14 informed spread to liver and spine and terminal but Mum told she has  'years'. 3 x chemo's Jan-April '14, no effect. 4 x attempted cycles of Oral Chemo Capecitibin April onwards but couldn't not get through one without side effects, dr's kept stopping the drug. We found out ten days ago now has 3 spots on liver (1x 1\" wide and 2 x 1/2\" wide) two spots on spine and two on tube between kidneys. She's been put on Tamoxefin but we've been told she has 3-9 months max. After researching the net I came across this blog and thank god I did. It's given me hope that we can help my Mum prolong her life and make her feel better. I am looking at the supplements you suggest, I3c, DIM, Curcumin, Fucoidan. I'm also hoping to get Mum on an Alkaline based diet, we've also looked at Macrobiotic and Vegan. I've suggested laser ablation on the liver to my Mum's Oncologist (we're in the UK on NHS treatment in the hospital) he doesn't think it will do any good, and also he said \"in 30 years I've never seen a diet change a prognosis\"(VERY FRUSTRATING!!). I want my Dad to take her to a private hospital and have this proceure done anyway but he doesn't think it will help. HOwever, my thinking is that if we get the ablation done and put Mum on the diet with the supplements, we can stop/reverse what's happening. Mum is er+pr-her-so not suitable for Herceptin either. I'm trying to figure out what to feed her, when exactly in the day, which supplements to give,  doses and when etc, I have to be careful with Mum because I can't give her anything that thins the blood because she is high risk for blood clots. I'm starting to feel a little overwhelmed with it. Any advice, suggestions of other supplements to give her or inspiration would be very much appreciated. Many thanks",
      "MessageIndex": 96,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64060,0.htm",
      "Title": "Beating stage IV Breast Cancer"
    }
  ]
}