{
  "AuthorID": "Sassy9",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sassy9",
  "Posts": [{
    "AuthorID": "Sassy9",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sassy9",
    "Content": "  On 2/21/2008 Shemay wrote:   On 2/21/2008 Moon Masque wrote: P.S. - I recently read an article regarding the use of dogs in detecting certain types of cancer.  The study is revealing amazing results.  Hopefully in the future it will become another tool for the early detection of cancer. Blessings, Moon Masque   I am so glad I read your post here.  Before I first found the lump, I began noticing a strange smell at work when I went to the potty.  I saw a drain on the floor and assumed it was that.  Then, I began smelling the odor at home, and since my bathroom is small and I was very close to the sink drain, I put it off on that.  I told very few people about this, but on my 10th visit to my onc., I asked him if anyone had mentioned any odors to him prior to being diagnosed.  He said no, kind of laughed, and said he knew there were some kind of tests going on with dogs.  This really disappointed me since I feel your body tries to tell you things in many different ways, and someone in his profession should be interested in all tests.   This is such a fascinating subject. Yes I too smelled \"cancer\" although at the time I didn't realize what it was. I had never before taken any notice of how my urine smelled but then some months before my becoming ill and being diagnosed I was startled and drawn to \"pay attention\" to the oddness each time I went to the bathroom. I mentioned it to my husband but he dismissed it as probably just being diet related but somehow my instinct told me differently and so it was a concern. Once my health improved, the strangeness was gone. You can be sure I'll be aware of any change should it happen again. This past week there was a documentary on TV about this very subject. Trials were run in Britain involving a number of dogs that had been trained to detect certain cancers, one being prostate. The accuracy rate was very high. In the 90's if I remember correctly. As I said, fascinating. Shows us we have so much to learn. Blessings to you too Moon Masque.  ",
    "MessageIndex": 11,
    "PostDate": "20/04/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20874,0.htm",
    "Title": "Cancer smell"
  }]
}