{
  "AuthorID": "Scaredstless",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scaredstless",
  "Posts": [
    {
      "AuthorID": "Scaredstless",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scaredstless",
      "Content": "I am trying so hard to hold it together! My mother, who was diagnosed with stage 3 breast cancer 11 years ago has been complaining of shoulder pain on and off for the last couple of months along with swelling in between the collar bone and the neck towards the middle. The swelling and pain went down and returned and is much worse, both times she believes it was caused by heavy lifting. Convinced her to go to the hospital today and though the xray to her shoulder and chest were clear, the doctor is sending her for a CT scan in the morning. My concern is that the doctor said they are concerned and then said there is a tumor and the CT scan will show more. I asked her \"how is it possible that you are saying the xrays were all clear and show (her words) absolutely nothing, yet you said there is a tumor?\" She didn't really answer and there was no more mention of the word \"tumor\" and she said that because of the swelling they need to send her to the scan to \"rule out anything bad, fingers crossed\". She also said it could well be a muscle or lymph node or something else that isn't a big deal but the CT scan will tell us more. I am so confused! She clearly said that it was a tumor and then changed her story when questioned! I understand that mets to the shoulder is possible even after years, but would the pain and swelling come and go? The first time it lasted a few days then the pain went entirely away as did the swelling and now it's back since she lifted some heavy boxes a few days ago. So worried :(",
      "MessageIndex": 0,
      "PostDate": "15/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69172,0.htm",
      "Title": "Pain and swelling collar bone 11 years after breast cancer?"
    },
    {
      "AuthorID": "Scaredstless",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scaredstless",
      "Content": "Hi, I'm sorry that you're dealing with the same fear. It's not easy. My mom had a CT scan done and the results aren't looking too good. We don't see the onc till tomorrow so there are still lots of questions and no definitive diagnosis until a biopsy and bone scan are done, but they found 3 lytic lesions -- one on the clavicle/collarbone that is causing swelling and then 2 others around her pelvis area. The conclusion/possible diagnosis are: possible mets from her breast cancer, possible myeloma, or \"other?\". The ER doctors were both very negative about it all and only yesterday after a second visit to a different ER did they finally give her pain meds. She can't even lift her arm at this point but no one actually bothered to physically examine or feel the area. So frustrating! Please do see your orthopedic or even your onc. My mom first complained about this pain and swelling 2 1/2 months ago and it seemed to get better, now the pain is debilitating and the swelling doesn't go away. I worry that the time she waited has made the situation worse for her. I'll be sending good vibes your way! xo",
      "MessageIndex": 2,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69172,0.htm",
      "Title": "Pain and swelling collar bone 11 years after breast cancer?"
    }
  ]
}