{
  "AuthorID": "Scrunch",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
  "Posts": [
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Hello Linda, I'm so sorry to hear that you have breast cancer metastisis now.  I know what you mean when you get this diagnosis; it's like a kick in the stomach.  You figure that when you get the cancer the first time and it's treated and they say you're a survivor, that's it.  No such luck!  I'm on the Taxol now and having very few side effects, but am terribly tired, but keep stumbling around trying to do what I have to do.  I had my 3-month CT scan done on Feb. 24th, so I am meeting with my oncologist today before chemo to discuss the results of that.  I'm hoping everything will look good.  However, he has told me before that this type of cancer does not completely go away and that I will have to be on a maintenance dose of chemo.  It will be interesting what he will say today.  I check this site daily and will be interested to hear how you are doing.  It's good that you have supportive family and friends.  That makes all the difference.  I am sorry to hear that your husband couldn't handle your having cancer.  My husband is my rock!  He goes to all my appointments and speaks up when I'm too intimidated to talk about a certain issue.  I don't think I could have gotten through this as well as I have if he weren't there.  Just know that I will be wishing you all the best.  Carolyn               ",
      "MessageIndex": 1,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33560,0.htm",
      "Title": "stg 4/reaccurance b.c. in abdomen now"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Hi Linda, glad to hear that you aren't having any serious side effects from your latest chemo regimen.  The tiredness is definitely one side effect that I am having also.  If I don't get everything done early in the day, forget it.  I run out of steam and get pooped as the day goes on.  A lot of people get that neuropathy, a tingling and burning feeling in the hands and feet, but I haven't gotten that so far.  Good that you are getting into that healing touch and imagery stuff; your're right that anything's worth a try.  It seems as if these alternative things really help some people.  Doesn't Suzanne Somers use a lot of that stuff?  I wonder how she is doing now.  As for the results of my scan, the pathology report says that \"the omental disease appears somewhat improved particularly along the surface of the transverse colon, and there is less ascites (peritoneal fluid) now\".  I can be happy about that.  However, it also says that there is a mass measuring 2.5x5x7 cm. wrapped around the pancreatic head.  My oncologist doesn't know what it is, but is consulting with some other doctors about it.  I think I will call him some time this week to see if he has found out anything.  I have this week off from chemo, so will not be seeing him at the cancer center.  I keep doing research on the computer about peritoneal masses, so am getting kind of worried until someone can tell me what it might be.  The oncologist gets mad at me for doing that, saying that I am just putting myself under a lot of stress.  Well, I can't help doing it, so there.  Anyway, don't want to burden you with my problems, and will be hoping your chemo regimen will be working for you and not causing you any real problems.  As you see from some of the messages on this board, some people have some really bad side effects from their medications, and I really feel sorry for them.  Take care, and let me know how everyting is going with you. Carolyn            ",
      "MessageIndex": 5,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33560,0.htm",
      "Title": "stg 4/reaccurance b.c. in abdomen now"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Hi Linda, How are you doing on the Taxol regimen?  Hope you are not having any bad side effects from it.  Interesting about the no sugar in your diet.  I know they say that cancer cells feed on sugar, so maybe that's a good idea.  I seem to crave sweet and sugary things; not that I am eating a lot of them though.  Anyway, hope your next markers, scans show a big improvement.  Sending you my best wishes. Carolyn",
      "MessageIndex": 3,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33560,0.htm",
      "Title": "stg 4/reaccurance b.c. in abdomen now"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "  On 1/15/2009 Rainyid wrote: I had breast cancer two and one half years ago.... It was followed up with radiation.... All of a sudden my breast has turned a bright red and is very warm.... It is just like it has been sunburned....  It is just as red as when I was taking the radiation treatments....  Has anyone else had this problem this far down the road after having cancer??? I go to my doctor in the morning and I am hoping for good news... Hi Rainyid, this sounds like cellulitis.  I had breast cancer in 2001, and in subsequent years following that I had cellulitis in that same breast 4 times.  They said it was because I had lymph nodes removed from that side and that made it more vulnerable to infections.  2 of those times I was hospitalized with it with antibiotic IV drips.  If that is what it is, you need it taken care of right away before it spreads too far.  My infection was going up my back and neck.  Good luck with getting it taken care of.  I will be thinking about you and wishing you the best. Scrunch              ",
      "MessageIndex": 1,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32180,0.htm",
      "Title": "Red and Sore Breast/ I had breast cancer two and one half years ago"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "  On 2/3/2009 rose1325 wrote: I need to select a treat ment for breast cancer stage 4 that spread to the omentum of the peritoneal lining.  My liver and other organs are all right but there is fluid in the abdomen and pelvis.  My doctor stopped arimidex and wants to put me on tamoxafin.  I wondered if there are any other options.   Tahnk you Hello Rose, I had breast cancer in 2001 and last July was diagnosed with Stage IV Peritoneal Carcinomatosis, which was traced to the breast cancer.  So far, it hasn't penetrated any internal organs, but it did crowd many of them.  My kidneys were swollen and the ureters were crimped, so they put stents in both ureters.  But to get to the point, I was first put on Arimidex, which didn't work.  Now they have me on Taxol infusions, which are working.  My tumor markers (last time they checked) have come down to 39, which is nearly normal.  I have 3 more infusions, and then they are going to do scans to see what is going on.  I so seldom hear about anybody else who has this that I had to contact you and commiserate about the situation.  I keep worrying about when it might penetrate any of the internal organs, especially the colon, because I don't want peritonitis.  Feel free to contact me any time to discuss our common condition.  Best wishes, Carolyn            ",
      "MessageIndex": 1,
      "PostDate": "04/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32803,0.htm",
      "Title": "Any information on peritoneal breast cancer spread?"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "  On 12/8/2008 southerner15 wrote: I know that you all will think I'm a real baby with  my question, especially after what you have endured.   However, I  want to know what would have helped you get through a stereotactic biopsy without a lot of discomfort.  They won't put me out.  I've read all the \"medical\" info on what they do, but I want words from those who have been through it.  I don't expect it to be comfortable since I won't be out, but I'm not into pain.  LOL Thanks for taking time from all your problems for me. Jacqueline  Hi Jacqueline, I have had a stereotactic biopsy and, at least in my case, there was absolutely no pain involved.  You lay on your stomach, arms over your head, with your breast down through a hole in the table.  The table is then raised up, and the technicians are working beneath the table.  I didn't feel a thing.  The only pain involved for me was laying in that position for so long and getting up off of the table when it was finished.  It's much simpler than an excisional biopsy, where anesthesia and IV's are involved.  Go for it!  Unless you have arthritis, as I do, it's the way to go.  Good luck! Carolyn         ",
      "MessageIndex": 1,
      "PostDate": "08/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31001,0.htm",
      "Title": "Biopsy Question"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "  On 12/8/2008 ShirleyM wrote: Well it wasn't painless to me! They run a hollow needle  into my breast and extracted tissue from the lump,then shot a metal pellet into my breast,so that the surgeon could find the lump. All this while they had my breast mashed in a mamogram machine! I thought my breast would explode when they shot the metal pellet into it. They didn't give me nothing. Insist that they do something to ease the pain before hand; I wouldn't have another one! I would just tell them to remove the breast! I am not telling you this to scare you but to warn you that you need something to ease the pain before having it done. I wish someone would have told me before I had it done then I could have told them,to either give me something or forget it. Never again for me!!! Hugs Shirley Hi Shirley, pardon my saying so, but what you had doesn't sound like a stereotactic biopsy, but sounds like a core needle biopsy, which I also had.  That one stung a little.  Really, I can truly say that the stereotactic biopsy didn't hurt at all.  My back and shoulders were killing me while laying on my stomach with my breast down in the hole, but the actual procedure didn't hurt at all.  I remember telling the technicians that. Best wishes, Carolyn           ",
      "MessageIndex": 4,
      "PostDate": "08/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31001,0.htm",
      "Title": "Biopsy Question"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Hi Jacqueline,     Have you had your stereotactic biopsy yet?  I will be interested to know what you thought of it.  I certainly don't want anyone to think that, just because It didn't bother me at all (except for having to lay still on the table in an uncomfortable position), that others might find it painful.  That's just it; we all have different tolerances for pain.  I, however, didn't feel any pain from the procedure at all, so maybe I have a high tolerance for pain.  I can honestly say that it was the least painful biopsy that I have had so far.  Please let me know how it went.  I've been thinking about you going through this and how frightened you must be about the whole thing.  Many of us have been there and know exactly how you feel, so your're not alone in the feelings you are having.  Take care, and know that we're hoping for the best for you. Carolyn",
      "MessageIndex": 7,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31001,0.htm",
      "Title": "Biopsy Question"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Hello Jodie, So sorry to hear about your cancer recurrence.  That's the trouble, isn't it, that we think we're home free when we first get it taken care of.  We know now that that isn't necessarily the way it is.  It sounds as if you have had a lot more experience with chemotherapy than I have had.  I opted not to have chemo the first time around, since it was only Stage 1, Grade 2.  A mistake on my part?  Who knows.  Maybe now I'm paying the price.  It's now metasticized to the lining of the abdomen and coating the internal organs, Stage IV, incurable but treatable.  Anything they give me now is for the purpose of shrinking the cancer so that it is more treatable.  It sounds as if our situations are somewhat similar.  You had elbow surgery, with a chest x-ray prior to that which showed the cancerous lung nodule.  I was hospitalized with what they thought was diverticulitis (which I had previously) and after umpteen CT scans ultra-sounds, x-rays, and an MRI, they found that it was the cancer recurrence.  What a shock!  You probably felt the same way.  Pardon my being nosy, but why did you have to change doctors?  It's none of my business, so don't answer that if you don't wish to.  I know my oncologist said that the PT scan shows a lot of false positives, so he tends not to use them.  I just feel that I have to have faith in what he's telling me, up to a point that is.  You do have to advocate for yourself and make judgements about your treatment at times.  My husband comes with me to my appointments and is not afraid to speak up when he has some input.  I hope you have a good support system behind you as well, and I wish you all the best in making a full recovery.  Best wishes from Carolyn (Scrunch:  My father's nickname for me)               ",
      "MessageIndex": 6,
      "PostDate": "16/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30234,0.htm",
      "Title": "Taxol"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "I have metasticized breast cancer to the peritoneum.  I was first put on Arimidex in hopes that it might shrink the cancer.  That didn't work, so I am now on chemotherapy with Taxol.  My veins are terrible, so now they are going to have to put in a port.  The warning I have gotten about that is that it commonly gets infected.  The cancer is crowding my internal organs, so I had to have stents put in both kidneys to avoid kidney failure.  Had breast cancer in 2001 with lumpectomy and 33 radiation treatments and went seven years cancer-free.  Now I was hit with this last July, and it has turned my world upside down.  Has anyone else had experience with this kind of cancer and how has your treatment gone?  Thank you for any input.",
      "MessageIndex": 0,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30234,0.htm",
      "Title": "Taxol"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Do you have to have the ports changed at any point, or do they just stay in there until you no longer need them?  If they get infected, probably they might move them elsewhere I suppose.  Thank you for all your good suggestions, especially about support groups, etc.  The Healing Garden is right nearby in the town of Harvard, and that may be a good one to look into.  As far as HIPEC, I have seen a lot about that on the internet, and it sounds kind of like a last resort in my case, though that's just my opinion.  My oncologist is trying to give me treatments that give me the least amount of side effects possible.  Then I say to myself, does that mean that my type of cancer just keeps spreading like fungus or mold and there isn't anything that will really get rid of it?  I think that really is the case actually.  He did say that it was Stage IV and was incurable.  I think what I'm getting is really what they call palliative care, but it doesn't really sink in, does it.  That is probably what you're dealing with too.  How do you stay so upbeat?  I wish I could be like that, but I'm afraid that I have a very gloom and doom attitude about the whole thing.  I put on a happy face for my husband, who is having his share of health problems now too (not cancer).  Taking care of him and endeavoring to do the household chores (a lick and a promise) as well as doing all his real estate (terrible market right now) computer work keeps me busy enough so that I don't have a pity party for myself. You sound like a person who has a lot of faith and a wonderful support group.  Is that so?  We both need to have a lot of faith and confidence in our medical personnel too, don't we.  They are, for the most part, wonderful, caring people.  It is amazing how attached we get to them and they to us.  Thank goodness the right people get into these jobs!  They all seem to enjoy what they are doing.  Well, I've rambled enough here.  Take good care of yourself, and we both must remember, as you say, to live every day to the fullest!  Thank you for your very uplifting message.        Carolyn                         ",
      "MessageIndex": 4,
      "PostDate": "15/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30234,0.htm",
      "Title": "Taxol"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "Sorry to hear about your recurrence.  I had Stage I, Grade 2 ER+ breast cancer in 2001 and just opted for lumpectomy and radiation (33 treatments) but not chemotherapy.  Then, 7 yrs. later last July I was diagnosed with Stage IV peritoneal carcinomatosis (cancer nodules in the abdomen lining and omentum (fat layer in abdomen).  I was first put on Arimidex to shrink the cancer, but it didn't work, so now have been on Taxol infusions, and that seems to be working.  I also was told that it was a chronic thing, incurable but treatable.  If one kind of treatment doesn't work, they go on to another one and on and on until something starts to work.  I feel pretty good, although I have lost 25 lbs. (not that I didn't need to lose weight) and don't have the greatest appetite.  Don't be discouraged; everyone's system is different and how they react to different treatments.  You can hear horror stories about it, but that doesn't mean that you are going to have all the problems some other people have.  So far, I have not had many of the side effects that other people have on the treatment I have been getting.  Good luck!  Please let me know how things go for you. Carolyn        ",
      "MessageIndex": 1,
      "PostDate": "23/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32421,0.htm",
      "Title": "Breast Cancer Stage4, not in breast"
    },
    {
      "AuthorID": "Scrunch",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Scrunch",
      "Content": "  On 10/21/2008 Delia Margaret wrote: I was operated on four years ago today for breast cancer.  After serious infections, chemo and radiation and a \"flap\" operation to close up open the wound after 18 months of daily dressing, I seemed on the road to recovery. Yes ,Hair never did return to former luxurient growth (dammit!) and for many months there was a very painful adjustment to the Arimidex, which disappeared on changing to Aromasin.  My feet and hands are chubby and two sizes larger, but what the heck!  Aren't I alive?  Now my question is?  Does anyone know how I can avoid the recurring cellulitis I have endured since the beginning?  I have had nine different episodes each involving being on a drip in hospital for either two weeks or four weeks at a time.  In the past 12 months I have been in hospital for four and a half MONTHS pumping those dreaded anti biotics into me.  My doctors look pityingly at me and say \" you are just unlucky\".  I have decided NOT GOOD ENOUGH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!  I get it on my breasts, ribcage and back especially where there is scar tissue. There seems to be excessive radiation burn ,although I did not have any adverese effects at the time.  I can NOT plan anything in my life and would so appreciate any input, if any, from out there.   Kindest regards, Delia Hi Delia, Boy, you've been through a lot.  I have had breast cellulitis 4 times, beginning in my left breast that I had breast cancer in in 2001 and had lymph nodes removed.  I was hospitalized 3 of the times, a week at a time.  The infection would spread all the way up to my neck and up my back.  It got so that the antibiotic of choice, Keflex (?), wouldn't work any more and they went on to other ones.   Knock on wood, I haven't had a recurrence this year, but did get a diagnosis of metasticized breast cancer to the peritoneum.  I think the cellulitis kept coming because of my immune system being compromised because of the lymph node removal.  They would take a nasal swab and would know right away what germ caused the cellulitis.  This would be done by an infectious disease specialist.  The last one was caused by Streptococcous.  Hopefully, you will be able to build up your immune system so that you won't be getting this any more.  See a nutritionist and they may be able to give you some good tips on how to accomplish that.  Good luck and take good care of yourself!             ",
      "MessageIndex": 5,
      "PostDate": "13/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29520,0.htm",
      "Title": "Recurring Cellulitis"
    }
  ]
}