{
  "AuthorID": "sehuntington",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sehuntington",
  "Posts": [{
    "AuthorID": "sehuntington",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sehuntington",
    "Content": "My 25 year-old daughter was diagnosed with a Stage III (primary) brain tumor on her right optic nerve in August 2012. It is inoperable. She developed Cushing's Disease from high dose Decadron and was hospitalized numerous times due to complications caused by this and a weakened immune system. She has been through radiation and Temodar. She woke up from her August 2012 crainiotomy completely blind in her right eye. Her tumor was finally shrinking the last 6 months or so when they noticed \"something unusual\" on her November 2013 MRI. She started having seizures later that month. After 4 hospitalizations with the doctors trying to say she was overmedicated and experiencing a \"conversion disorder,\" she experienced her worst seizure yet last month. She was hospitalized for ten days and they finally tested for LC. Both her MRI and the spinal tap were positive. They are now treating her with Avastin and Temodar. Besides the seizures, she has severe headaches and back pain. She has complained of some hallucinations. She also thinks her hearing is affected and says she feels her one seeing eye is now going blind. Her short-term memory has never come back since the last seizure in December and she often seems confused. I am her primary caregiver. The doctors refuse to give us any kind of prognosis, but from what I am reading here and what I've seen online, it doesn't sound promising at all. Sometimes, I think I'm losing my mind. To watch my daughter go through this has been the worst torture imaginable. I want to be home with her all day, every day but I am our only means of support and I have to work full time to keep a roof over our heads and keep her medical benefits. I am emotionally and physically exhausted. I've aged ten years in the last 18 months, but this isn't about me. I could handle anything if I knew how to help my child recover from this. Please pray for her if you are the praying type. Her name is Abra, and she is far too young to die this way. Is there really a new pill approved for treating LC? I would think they'd be using it if that were the case.",
    "MessageIndex": 102,
    "PostDate": "29/01/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
    "Title": "Treatment for: carcinomatous meningitis"
  }]
}