{
  "AuthorID": "sharingwithu",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sharingwithu",
  "Posts": [
    {
      "AuthorID": "sharingwithu",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sharingwithu",
      "Content": "Hi, Just learned that I have breast cancer.  Taking tests to determine the stage and whether any of the cells are vacationing in my lungs, bones or liver.  Surgery is scheduled for 10/20. Usual denial at first but the terror is striking now. I need help and want to offer support to others. Just joined this community so I'm not sure how to navigate the website. What can I do to help others???? Hang in there! Phyllis    ",
      "MessageIndex": 0,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40131,0.htm",
      "Title": "Need support"
    },
    {
      "AuthorID": "sharingwithu",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sharingwithu",
      "Content": "  On 9/25/2009 Janices Journey wrote: Hi, I can tell you one thing, that the breast cancer community is full of support and prayers for each other.  There are so many ways to find help and to help others that makes it possible to keep yourself going. I have been doing fundraisers for the cause and find it keeps me busy as well as I feel I am helping and I know that if we stand together, the girls coming up behind us will benefit greatly. I was diagnosed in 2/2007 and follow my care very closely.  Always make sure you are educated in these subjects so that you can help in your medical care decisions and find s doctor you trust. I will keep you in my prayers and if you need support, just reach out someone will always be there to grab your hand. A breast cancer survivor never has to do this alone and every survivor understands and is happy to help or just listen. From a fellow breast cancer survivor, Janice   Dear Janice, Thanks so very much for reaching out to me...so quickly!!!!  At first I had difficulty getting your e-mail...I kept clicking on the link provided by cancercompass...no luck but I kept clicking and finally I was able to read your lovely e-mail. At this point I have just received the news from my absolutely amazing brest surgeon that, indeed, I have breast cancer.  Next week I have 6 to 8 additional tests to take that will determine the stage of my cancer and whether any cells are vacationing in my liver, bones or lungs.  Regardless of these results, my surgeon scheduled my surgery for 10/20.  I will have an appointment with her on 10/12 to discuss the test results. My cousin, second cousin at that, was diagnosed with breast cancer a few years ago at age 28.  She opted to have a double mastectomy.  Very brave at her young age.  Otherwise there is absolutely no cancer anywhere in my maternal or paternal family. Depending on the results from the up-coming tests, my surgeon outlined exactly what course of treatment I will face.  She thinks I will be able to have a lumpectomy with radiation.  But then again, she thought she was able to remove the entire tumor during the biopsy and seemed sure that  I was fine. When she called with the results, she scheduled an appointment for the very next day.  Dr. Maureen Kling (practicing in New Jersey) is a highly trained and very experienced surgeon as well as a very special person.  I was surprised though at one of her remarks.  I told her I thought, regardless of test results, that I want a double mastectomy...that I want to be proactive.  She replied saying that being proactive then escalates to paranoia and that what we may be dealing with is a mental health issue.  She also assurred me that she does this (double mastectomy). I am 59 and have an 81 year old mother who is now showing signs of serious memory loss although she is functioning very well.  She lives with my adopted brother, who was born with cerebral palsy.  My mother is a magnificent woman and my brother, Mike, is simply an angelic human being.  I live with my adopted sister who has a disabling back problem...she's on Morphine etc.  During my surgery, this will be the first time she will be alone.  We have four Poodles...nurturing, loving, loyal and healing dogs. This is now a major concern because Barbara won't be able to care for two of the pack.  We're also extremely concerned about how kenneling will affect our 11 year old Standard and our 5 year old Toy, who has slept by my bed in her little crate ever since she was only 4 weeks old.  Within a very short period of time she was house-broken and from the very beginning has been completely attached to me, having to have me in her eye-sight at all times. Beegie (the Standard) is 11 now and requires a lot of care.  Samantha (Samie) is the alpha female and is very active whenever she goes out...pulls way out in front of the pack, often tries to fly when she sees a bird, and becomes overly excited whenever she sees a person.  Whenever she sees another dog...watch out!!  Barb will be able to handle Misty and Suze...sweet as sugar.  But Barb will not be able to bend over and clean up after them.  We feel kenneling Beegie and Sammie will be too drastic a change for them, particularly Sammie.  And we have an extremely tight monthly budget, so kenneling or getting in-house pet services will be an extreme financial challenge. Hmmm...I just realized that I wrote almost 3 paragraphs all about our dogs!!!  Probably a component of denial but nevertheless a major concern. I am in the process of making the difficult decision to opt for a double mastectomy and radiation, assuming that this can be an option, because I feel this is the most reasonable and proactive decision to make as I consider my responsibilities.  My mother will be needing much more care and support from me.  Mike will need more and more emotional support.  Eventually I am thinking that my mother will need more physical care.  My sister, Barbara, needs physical and emotional support from morning to bed-time.  My thinking is that I cannot risk the chance of having to have further surgeries.  It makes much more sense to me to do as much as I can do now. I've only learned of my diagnosis for a little over a week.  The denial stage is over!!  I do experience a lot of difficulty sleeping and when I wake up I experience a feeling of terror in the pit of my stomach. I have a VERY small support system.  Essentially, I'm flying solo.  I am so very grateful that I have found a supportive on-line community. I also want to offer my support to all people in our community!!!  This is very important to me and it is a continuation of my life's work...I'm a psychotherapist with over 30 years of experience, was the president/CEO of a comprehensive mental health center that I founded in 1976 and I am Hospice trained.  Now that I am facing my personal challenge, I'm hopeful that I can offer my support to others. Thank you so very much for listening! With this e-mail comes my gratitude. Please know that you are in my prayers. Phyllis (everyone calls me Phyl)       ",
      "MessageIndex": 2,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40131,0.htm",
      "Title": "Need support"
    }
  ]
}