{
  "AuthorID": "smitten",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/smitten",
  "Posts": [
    {
      "AuthorID": "smitten",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/smitten",
      "Content": "Oh, does this post ever hit home.  Just today I told my husband he could leave me and I'd understand.  Ya know, he said he'd stay. K, this diagnosis hits and it hits hard.  I catch myself saying and doing things I'd never ordinarily say and do.  But, sweetie, that's not really us....that's the cancer talking and acting. You are still K....the person your husband fell in love with and married.  It's just right now you're \"someone else\" for lack of better words.  You will be K again, though....and he'll still be there and he'll still love you :)",
      "MessageIndex": 7,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25872,0.htm",
      "Title": "not sure if I can fight this battle"
    },
    {
      "AuthorID": "smitten",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/smitten",
      "Content": "Hi, y'all. I'd love to say it's nice being here, but...... 53 years old, married, two children, one still at home.  I'm a RN and found a lump in my left upper chest wall at work one day in late February.  Asked one of the docs to check it out and he sent me to a surgeon who specializes in breast cancer.  Biopsied the spot, and low and behold it was invasive ductal breast cancer.  Then began my journey to the land of oncologists, radiologists, plastic docs, etc.  We elected to do bilateral mastectomies and the first surgery date was March 18th.  All ready to go to surgery when a critical lab was reported:  blood glucose was 517 :( Surgery was rescheduled for March 28th..spent one night in Observation, discovered a hematoma and had to have surgery again the 31st.  So far I still have the tissue expanders (I call them my hockey pucks) in place.  Implant surgery is scheduled July 30th.  Had the Oncotype DX testing and scored a 43...sigh. I got my Bard PowerPort yesterday.  I see the oncologist next week to discuss type of chemo, schedules, etc.  I also see a gyno doc for the lovely and exciting transvaginal ultrasound as I'm having a complete hysterectomy (prophalactic) and my doc doesn't want to go in blindly.  Honestly, I think the thought of losing my hair is my biggest worry.  I've decided to shave it and get a spray on tan..hehe And I'm seriously considering foregoing the nipple tattooing and get a hummingbird on one breast and a flower on the other.  I've never had tattoos and love the thought of being a secret rebel ;) I've had great family/friend support, but it's great to have a place like this with people that KNOW what I'm going thru.  Thanks, y'all :-)",
      "MessageIndex": 0,
      "PostDate": "12/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25965,0.htm",
      "Title": "Newbie here....."
    },
    {
      "AuthorID": "smitten",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/smitten",
      "Content": "To make things \"interesting\", one of my expanders slipped out from under the muscle wall so now I have that one looking sorta normal while the other is under the muscle looking sad and deflated..although they both have the same amount of fill. Most times they don't bother me at all....but when they do it's strange how they ache differently.  Just weird.",
      "MessageIndex": 6,
      "PostDate": "29/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25965,0.htm",
      "Title": "Newbie here....."
    },
    {
      "AuthorID": "smitten",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/smitten",
      "Content": "Hi, K I believe you're talking about the Oncotype DX testing and it IS expensive....to the tune of $3600.  If your insurance doesn't cover it, though, the lab offers financing. I had bilat mastectomies in March and then started seeing the oncologist and I insisted on the testing.  Unfortunately, my score was a 43 and that's much higher than the 20 you need to score to avoid chemo.  I had my Bard PowerPort put in today, but not sure when I'm actually starting chemo.  I still have to have my tissue expanders removed and implants put in PLUS I was just informed I have to have a complete hysterectomy because my ovaries were enlarged on CT scan.  Does it ever end?!?! Anyway, my advice is get the testing and hopefully you'll be one of the lucky ones :-)",
      "MessageIndex": 2,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25942,0.htm",
      "Title": "thank you"
    }
  ]
}