{
  "AuthorID": "Soul_Flower",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Soul_Flower",
  "Posts": [
    {
      "AuthorID": "Soul_Flower",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Soul_Flower",
      "Content": "I too believe HRT caused mine.  No family history, no other risk factors but had been on Premarin for years.  Mine was estrogen sensitive. ",
      "MessageIndex": 3,
      "PostDate": "24/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12213,0.htm",
      "Title": "What do you think may have caused your breast cancer?"
    },
    {
      "AuthorID": "Soul_Flower",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Soul_Flower",
      "Content": "  On 4/27/2007 Valerie1979 wrote: Hi everyone. I am really nervous right now, can anyone please help me? Thanks. I am a 27 years old female. I just finished my period today and I found a lump yesterday in my right breast (about 2 inches from my armpit towards the center of my body). It feels tender when I press on it and the tenderness last for a few minutes. I asked my father, who is a pediatrician, to examine it for me and he said it's moving and it's doesn't feel like cancer. However, this evening when I re-examined it, I found that the area between the lump and my armpit is slightly hardened and thicker than the the same area in my left breast. It's also a bit tender when I press it. I just don't know what that is...Could anyone please help me? Thanks again. It is not unusual to have \"lumpy bumpy\" breasts during and after a period.  Hormonal changes can create tenderness.  Wait 10-14 days and recheck the area.  If it is still there, see your personal physician. ",
      "MessageIndex": 1,
      "PostDate": "28/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11618,0.htm",
      "Title": "Lump Found In Right Breast...please help"
    },
    {
      "AuthorID": "Soul_Flower",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Soul_Flower",
      "Content": "Am a breast cancer survivor currently taking Femara instead of Tamoxifen.  Would be interested in hearing from anyone who is also on Femara and the side effects encountered.  I am having trouble with arthritis and fatigue.  Have been on it 5 months. Diana",
      "MessageIndex": 0,
      "PostDate": "18/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12188,0.htm",
      "Title": "Femara Side Effects"
    },
    {
      "AuthorID": "Soul_Flower",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Soul_Flower",
      "Content": "I am on heart medication but have been on it long enough to know that it is not causing the problem.  I ache in the \"bones\" as well as joints.  It is not like pulled muscles, it is deeper.  Hands are affected right now--joints painful, diffult to use fingers, and fingers are swollen.  Nice to hear from someone who has completed Femara.  I am hoping the symptoms will ease the longer I stay on it.  Thanks for responding.",
      "MessageIndex": 3,
      "PostDate": "19/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12188,0.htm",
      "Title": "Femara Side Effects"
    }
  ]
}