{
  "AuthorID": "Sozo_in_2000",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sozo_in_2000",
  "Posts": [{
    "AuthorID": "Sozo_in_2000",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sozo_in_2000",
    "Content": "First of all, I am sorry.  I am sorry you even have to be in this place!  I had a mastectomy when I was 34 years old.  I can relate to the anger.  You are allowed to be angry!  There is nothing RIGHT about this.  Your feelings are valid.  What I did was took that anger and tried to turn it into something I could use.  I became my own best advocate (asking questions, researching etc).  I knew that if I let myself go to that dark place too often it would take over.  I also kept the Christian music going in my house all the time!  All day long playing in the background and it really helped me.  Eventually a day came when I realized I was beyond the anger for the most part.  I still had my pity party moments but I realized that as bad as it was, I was still HERE.  That was something I had to learn to celebrate.  I realized it would be very easy to curl up in a ball in a corner and hate the fates or whatever for serving this up to me but I wouldnt do anyone any good that way.  I had a husband and child that needed me to LIVE.  I made a decision right then to not let BC steal anything else from me and tried every time the anger reared its ugly head to list 5 things I was grateful for instead.  Could be as simple as I was painfree for the past hour :)  Baby steps!  I hope you too can get to the other side of that anger and wish you well on your journey.  For me, it has been 13 1/2 years and while I STILL have my moments of anger/sadness for what it has done to me, they are fleeting and nowhere as painful as they had been.  Sozo_in_2000",
    "MessageIndex": 5,
    "PostDate": "23/05/2014",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,77137,0.htm",
    "Title": "Mastectomy in two weeks, STUCK in anger??"
  }]
}