{
  "AuthorID": "spagirl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spagirl",
  "Posts": [
    {
      "AuthorID": "spagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spagirl",
      "Content": "  On 12/26/2008 Bonniee wrote: HELP - I start chemo in 1 week - 1-2-09, I am 58. I will we getting Cytoxin and Taxatere every 3 weeks until mid May. Has anyone \"been there, done that\" that can help with encouragement, expecations? All I hear is \"everybodies different, we can't tell you what to expect, we will give you medication for nausea and vomiting, you will be fatigued and you will be more prone to infections.\" What do you eat? - My tummy is in knots with fear, I've lost 10 lbs - and don't have that much to lose! Bonnie Hello Bonnie, this is Brenda, I just wanted to see how you are doing, I know you started Chemo today, and I hope all went well.  When you feel up to it please feel free to e-mail me anytime. I will pray that everything goes well with your treatment. Take care get lots of rest. Brenda",
      "MessageIndex": 23,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31518,0.htm",
      "Title": "Terrified of Chemo - HELP!"
    },
    {
      "AuthorID": "spagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spagirl",
      "Content": "  On 12/26/2008 Bonniee wrote: HELP - I start chemo in 1 week - 1-2-09, I am 58. I will we getting Cytoxin and Taxatere every 3 weeks until mid May. Has anyone \"been there, done that\" that can help with encouragement, expecations? All I hear is \"everybodies different, we can't tell you what to expect, we will give you medication for nausea and vomiting, you will be fatigued and you will be more prone to infections.\" What do you eat? - My tummy is in knots with fear, I've lost 10 lbs - and don't have that much to lose! Bonnie Hello Bonnie, I was on Adriamycin and Cytoxin for breast cancer, I was stage 2A infiltrating ductal carcinoma. I am 5 years cancer free and feeling very good. Stay positive at all times, this is part of healing. When I started chemo, which was every 2 weeks for 4 months.  I would go with my husband and or friend who ever could take me and afterwards we would go to lunch, then I would go directly home and crawl in bed and sleep for a good 3 days. My husband would wake me up to drink lots of water and try to eat something. I know strong smells would make me sick. My daughter wanted to help so she would make me those natural vegi burgers, to this day I can't even look at those things. If anyone wants to cook, make sure it is not something with alot of smell. If you are having problems with hunger, have your doctor prescribe Marinol, it is prescription marijuana in a pill form, even with prescription it is expensive, but well worth it because it will give you an appetite. Try to eat a very clean diet, fresh foods, no processed, basically what God put on this earth, no growth hormones etc.  I was affraid right before I did my first chemo. I cried all the way to the doctors office, I told my husband I did not want to do chemo and he stayed strong and said \"you have to do it, you have kids, a family, husband and we need you around so you have to do it, you have no other choice!\" So I did it and they put some type of medication in the chemo so that it would put me to sleep while I was getting it injected into a porto cathe which is so much better than  getting it with an IV. If you don't have a porto cathe I would ask your doctor about it. If you started chemo already and you are using and IV and it is ok with you, then I guess I would continue it that way, but the porto cathe is surgically put under your skin and the chemo goes through the porto cathe. I did lose my hair, all of it, but I just wore bandanas, I had no problem with this. When it started coming out was when we were on a weekend camping trip, and my scalp hurt when it was coming out, so we just did it a quick way.  I  had a family affair to cut my hair prior to it falling out. My daughter got to cut it with her scissors, my son shaved it and then my husband completely shaved it with shaving cream and a razor. My kids were fine with it, I explained it to them that we know the medicine is working since my hair is falling out. When my hair started coming back in, it was very curley and dark, I shaved it 2 more times after just to get all the chemicals out of my new hair and it was so pretty when it grew in. Very shiney and pretty and nice and thick. There is a really fun class you can go to which you can ask your doctor if you have it in your area, and it is called Look Good Feel Good, and the fun thing about it is you are in this class with lots of other women going through the same thing with losing their hair and not feeling good, so you can all talk about it together. They have a make-up artist that shows you how to wear your makeup when you lose all your hair, You get a big box full of all this really good make-up that has been donated from all these incredible make-up companies, Chanel, Lancome, Estee Lauder, to name a few. You get to take all the make-up home with you. They also have wigs people donate and if one fits you can take it home with you. Also most insurance companies pays for wigs, so if you feel you want to wear a wig, you can check with your insurance company. I didn't mind being bald, it was actually nice because I didn't have to do my hair. Every negative about chemo and radiation I tried to turn it into a positive thought. You do not have any room in your life for negative people or negative thoughts, because this will bring you down.    If a doctor tells you something, make sure you really research and get other opinions. I am in the process of getting second opinion on  my lungs right now with  possible mets from Breast cancer to lungs, and I think it is very important to really research all you can with sites such as John Hopkins, or any other sites that have information that you can trust is correct information. If you have any other thoughts and concerns, you can e-mail me anytime Good luck and God Bless Brenda    ",
      "MessageIndex": 9,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31518,0.htm",
      "Title": "Terrified of Chemo - HELP!"
    },
    {
      "AuthorID": "spagirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spagirl",
      "Content": "  On 12/26/2008 Bonniee wrote: HELP - I start chemo in 1 week - 1-2-09, I am 58. I will we getting Cytoxin and Taxatere every 3 weeks until mid May. Has anyone \"been there, done that\" that can help with encouragement, expecations? All I hear is \"everybodies different, we can't tell you what to expect, we will give you medication for nausea and vomiting, you will be fatigued and you will be more prone to infections.\" What do you eat? - My tummy is in knots with fear, I've lost 10 lbs - and don't have that much to lose! Bonnie Hello Bonnie, this is Brenda, I just wanted to see how you are doing, I know you started Chemo today, and I hope all went well.  When you feel up to it please feel free to e-mail me anytime. I will pray that everything goes well with your treatment. Take care get lots of rest. Brenda",
      "MessageIndex": 30,
      "PostDate": "03/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31518,0.htm",
      "Title": "Terrified of Chemo - HELP!"
    }
  ]
}