{
  "AuthorID": "spencer1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spencer1",
  "Posts": [{
    "AuthorID": "spencer1",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/spencer1",
    "Content": "On Dec 27, 2008 12:00 AM barna wrote:   On 12/27/2008 barna wrote:   On 12/14/2008 suzy2225 wrote:   On 12/13/2008 Rach01 wrote: Hi there, i live in Australia, am 35yrs old and was diagnosed with Metaplastic breast cancer earlier this year. I had a full mastectomy and axillery clearance. I have finished chemo and have to have follow up breast scans every 3 mths. I had the highest level of the metaplastic cancers. My concern now is that I am wanting to know if anyone has this cancer and if they have remained cancer free since operation. Or is recurrance has happened, how far between was it. I would love to talk to someone who had this type of cancer as it is different to normal breast cancers. cheers You have to try to go on and live your life without looking over your shoulder.  Try not to waste time worrying about what might happen and have fun.  Those quarterly tests work against that but don't look beyond next Sat. night.  Plan some fun for then.  I'm 12 years out and it took me a long time to stop worrying.  I'm not in the clear but I now see the docs every 6 months and go for the chest, abdomen & pelvic scans every 2 years.  Every case is different -- try not to stop living because you fear what could go wrong.    I was diagnosed with metaplastic spindle cell carcinoma that is triple negative last year and was happy to see someone 12 years out that had been diagnosed with this. Did you have a mastectomy, chemo or radiation as treatment?  Did you follow any specific diet after treatment? How many cm. was your original mass?  Any information you could give me would be greatly appreciated.  Thanks! I was diagnosed with high grade metaplastic carcinoma with spindle cell features 1/29/2010.  It was triple negative, clean Lymph nodes and 5-6cm.  It was removed by mastectomy on 2/15 and i was to start chemo this week, but I need a little more information to understand my doctor's prognosis.  I was told that he plans to treat this with T.A.C. chemo every 3 weeks for the next 18 weeks, which is the standard treatment for general breast cancer.  He feels that this would lower the chance of  the cancer coming back to as little as 20% - My doctor was out of the office this week, and I can find no literature to explain this or how well this 20% prognosis has worked in the pass.  MD Anderson states that there is no such prognosis for this rare cancer and that the 20% re-occurrence is the prediction if TAC is used on a general cancer.  MDAnderson treats this cancer type with there Sarcoma cancer treatment regiment - hitting the body much harder with chemo and radiation. Please tell me who you received treatment from and what regiment and prognosis you were given.   Can anyone tell me who has the most experience with high grade metaplastic carcinoma with spindle cell features?  Mayo Clinic - MN, CCTA , MD Anderson, Emory-Atlanta?",
    "MessageIndex": 7,
    "PostDate": "03/04/2010",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31163,0.htm",
    "Title": "Metaplastic cancer"
  }]
}