{
  "AuthorID": "Srfrgrl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
  "Posts": [
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "Good luck to you and your mom!  Don't be afraid to ask questions...of the doctors...of people here.  There's lots of support groups out there. If she has to undergo chemo, find out if there is a Look Good, Feel Better program in your area.  Just google it and you should find it no problem.",
      "MessageIndex": 1,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26850,0.htm",
      "Title": "The Journey Begins"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "I've been having problems with lympoedema myself and have been doing some research.  I don't know how viable this is, but check out http://www.lymphnet.org/.  I'm wondering if massage might help you.  They aren't big proponents of the bands and other things that only treat the symptoms.",
      "MessageIndex": 1,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25948,0.htm",
      "Title": "lymphadema"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "That's exactly the same treament I had for the same amount of time! I never got physically ill once.  They gave me steroids the day before, the day of, and the day after treatment.  Also, day 1 and 2 after treatment, I had to take something called Emend for nausea. The key is drink lots of water.  Once the chemo treatment is done for that day, it doesn't need to stay in your body.  So drink GALLONS of water.  Also, eat a heathy diet and you won't get sick. The only side effect I had to the Taxotere was temporary discoloration to my skin.  I also had a headache a few days after one of the treatments (one of the side effects of Cytoxan), but it could have just been sinuses. She will start losing hair approx. 2 weeks after the first chemo treatment.  Get a couple of wigs in advance.  One of the wigs I ordered was from Paula Young (they have a website).  Good luck to you!",
      "MessageIndex": 1,
      "PostDate": "23/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26351,0.htm",
      "Title": "Cytoxan and Taxotere?"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "Oh yeah, I forgot to mention - I had the lymph nodes removed in March 2008.  My first bout of swelling in April 2008, which went down by itself, then reoccurred after my last chemo treatment on 6/25. Thanks for the links.  It very well could be the bra.",
      "MessageIndex": 3,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26375,0.htm",
      "Title": "Swelling after Chemo"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "I brought up the issue of swelling to my radiologist and he gave me the *scar tissue* excuse.  Ugh!  The last time I was told that, it turned out to be cancer.  A friend of mine told me to contact the surgeon who originally performed my surgery, so I did.  He ordered an ultrasound and it was fine.  It turns out it is just fluid - lymphoedema.  I could have it drained, but no guarantee that it will not occur again. I will have my first radiation treatment this Monday - 26 treatments in all - I will be done Sept. 15.  After that, I will contact the plastic surgeon again to match up the breasts.  It's good to know insurance will cover it.",
      "MessageIndex": 5,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26375,0.htm",
      "Title": "Swelling after Chemo"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "Thanks for your reply, Tre.  I called my oncologist the other day, who told me to bring it up at my radiology consultation appt. today.  I did and the doctor said it was caused by scar tissue/healing.  But...I will be having a CT scan on August 1 where they look to see how they will radiate me (put the marks, etc.). Yeah, scar tissue is what my doctor said I had 3 years ago when I complained about a lump on my side (after masectomy).  When it kept growing, I went back to the doctor who still thought it was nothing, but referred me to a surgeon.  Well, it turned out to be cancer again, which is why I'm going through this today. I asked the radiologist if this would keep happening - the swelling, and then the swelling going down, and then recurring again months later.  He said yes.  To me, that just didn't sound right. He also said my impant could burst in about 3 years after radiation.  <shaking head>.  This is quite an adventure!",
      "MessageIndex": 2,
      "PostDate": "24/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26375,0.htm",
      "Title": "Swelling after Chemo"
    },
    {
      "AuthorID": "Srfrgrl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Srfrgrl",
      "Content": "I had a double masectomy 4 years ago, but the cancer came back and I had to have all the lymph nodes removed on my right side. Here's the problem.  After a PET scan, I had swelling on my right side.  I could feel the swelling under my arm as well as in my right breast (implant).  It gradually went down by itself after about 3 weeks.  Well, a couple of months later, after my last chemo treatment, I have the swelling again as well as pain off and on. Has anyone else experienced this?",
      "MessageIndex": 0,
      "PostDate": "23/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26375,0.htm",
      "Title": "Swelling after Chemo"
    }
  ]
}