{
  "AuthorID": "srmac",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
  "Posts": [
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "On Mar 24, 2010 9:40 PM joeys_mom wrote: That sounds like a plan .. I like to hear more from people who take hormontherapy  I am taking the tomaxifin..and started yesterday ..I don't mind it taking longer I just hope it will work for us.. some of the scariest words you will ever hear are \"you have cancer\".  i was 41 years old and a single mother of a 9 year old.  i had a lumpectomy, chemotherapy, + radiation.  then i had 2.5 years of tamoxifen and have been on aromasin for 4 years.  there are some rough side effects to some of these meds but the docs think the benefits outweigh the side effects (aches, pains in the joints, etc.) so i am determined to stick it out.  the hardest part is waiting for the plan, waiting to hear exactly what is going to take place and for them to get started.  you will have overwhelming support on this site - no doubt.  when your feeling down or defeated, just come and ask for emotional help, we are here for you!! ",
      "MessageIndex": 30,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "On Mar 24, 2010 9:40 PM joeys_mom wrote: That sounds like a plan .. I like to hear more from people who take hormontherapy  I am taking the tomaxifin..and started yesterday ..I don't mind it taking longer I just hope it will work for us.. some of the scariest words you will ever hear are \"you have cancer\".  i was 41 years old and a single mother of a 9 year old.  i had a lumpectomy, chemotherapy, + radiation.  then i had 2.5 years of tamoxifen and have been on aromasin for 4 years.  there are some rough side effects to some of these meds but the docs think the benefits outweigh the side effects (aches, pains in the joints, etc.) so i am determined to stick it out.  the hardest part is waiting for the plan, waiting to hear exactly what is going to take place and for them to get started.  you will have overwhelming support on this site - no doubt.  when your feeling down or defeated, just come and ask for emotional help, we are here for you!! ",
      "MessageIndex": 31,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 9/21/2007 Barb57 wrote: Hi, I'am on aromasin also. I started on Arimidex Aug. 2006 and the doctor changed me to aromasin in Dec,2006 because I was having so much pain in my hands and feet.  I also wound up having knee surgery last Nov. for a torn meniscus. Shortly after starting the medication my knees sounded like ground glass whenever I walked up step or stooped down. They said the medication had nothing to do with it but I had no problems before that. Since taking aromasin, the pain in my hands improved slightly, but my heels are still painful especially in the morning.  My index fingers also become stiff overnight. Once I start moving things ease up but by evening my feet are killing me. Also if I sit for any amount of time my knees and feet hurt and are stiff.  I too walk like I'am 200 yrs. old until I loosen up.  Good luck to you, it was just a year this Aug. for me.  It scares me to think what kind of shape I will be in four years from now.  I also tried asprin, tylenol, even a pain killer and nothing helped.  Keep your chin up, I guess its better than the alternative. Barb i was just told that i had a torn meniscus and needed knee surgery.  i have been on aromasin for 3.5 years.  i am 46 yoa.       ",
      "MessageIndex": 61,
      "PostDate": "01/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 8/10/2009 Nancie wrote: I have been on Aromasin since Nov 09 and in Dec 09 had a torn miniscus repaired and now they want to do a knee replacement. I'm willing because the pain in my knee is constant and I want it gone. But, after reading in this site, I'm wondering if the aromasin is contributing to it. Any comments on that. Nancie I am still holding out on the surgery.  i am trying to wait until i hopefully am closer to getting of the medicine so perhaps i can lose some weight since the surgeon said that weight is a factor once they do the surgery. i had never in my life had a weight problem until i went on this medicine. my oncologist does not believe the medicine has anything to do with it but after reading many messages on this board i am not convinced of that, along with the side effects written. i go back to the oncologist in november and am going to ask if i am any closer to being off the meds.  i am now riddled with arthritis, had a bone scan and have a severe degenerative disc in my back as well.  i am too darned young to have so many aches and pains   my general dr. wants me to get the surgery on my knee, she really feels that i need to get back to walking for my arthritis but i cannot get back to walking much (i was walking 3 miles most every day) until i get my knee fixed. keep me posted on your progress and what you decided to do... sheila",
      "MessageIndex": 88,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "On Jan 19, 2010 1:47 AM Charlote50 wrote: On Aug 10, 2009 12:00 AM Nancie wrote: I have been on Aromasin since Nov 09 and in Dec 09 had a torn miniscus repaired and now they want to do a knee replacement. I'm willing because the pain in my knee is constant and I want it gone. But, after reading in this site, I'm wondering if the aromasin is contributing to it. Any comments on that. Nancie I have been on arominsin for two years and in December I had scope surgery for a torn meniscus also.  He doens't want to do knee replacement .....but sometime I might have it.  I didn't know I had a torn meniscus, but had pain in my knees when I got up and walked ...it was that bad but annoying...the mri in nov. showed I had the torn place.  I wonder also if the aromasin causes all this pain.....etc......I fell terrible most of the time and my nerves have suffered lots also in the last few year.  I had a mastectomy in 77 and lost one breast and no chemo and then in sept 2005 a clump of cells barely there and had the other breast taken off and take the aromasin....I also am low on ViT D and take 50,000 once a week since a year ago and get check every 4 months.  I hope this web site can grow and we can see what these drugs are doing to us...I am 67 and live in Oklahoma....please write everyone who is one these drugs......there should be something else for us!! I've been on aromasin for 4.5 years, I was advised a year ago that I had a torn miniscus as well...  Seems awfully coincidental that we all are on the same meds and are having the same problems.  My doctor tells me that the meds do not cause these problems (including my weight gain, although it is a side effect listed on the pamphlet and I have never had a weight problem until I started taking this medicine).  Hopefully I will get to discontinue meds at the end of the year.  2.5 years on Tamoxifen + 5 years on Aromasin, I want to be done!!!",
      "MessageIndex": 104,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 10/22/2008 donna56 wrote: In May of 2007, I got the news that I had always dreaded/feared.  Since December, 1996, I had taken Estrotest due to an complete hysterectomy.  I was 44 years old and working at the FBI.  I argued with my doctor about taking that damn pill but I gave in and took it for 9 years with my gynocologist telling me every yearly exam that everything is alright.  The ninth year I started weaning myself off of it and by that time it was too late.  I will always believe that the Estrotest caused the Hormonal Positive cancer in my left breast.   Now I'm on Aromasin and I feel like an old 80 year old women and I'm 56.  I've taken this since September, 2007, and the joint pain just gets worse.  My feet ache and feel like they're swollen in the mornings when I rise from bed and 2 minutes later they're fine.  My knees feel like they could break especially getting up off the couch or folding my legs up under me for very long.  I move so slow, like my 79 year old mother.  I have gained some weight and my hands are swollen.  Just lately, my back feels achy, I know its my bones getting more brittle.  I have a bone-density test yearly and now I have osteoporosis and am now taking Boniva.  Sometimes I just want to chance it all and stop taking the Aromasin.  Why are there so many side effects, it's really getting me down and I'm basically an upbeat person, I love life and want my old self back. I would have thought I had written part of this message.  I am 47 years old and am on Aromasin.  I was just diagnosed with degenerative bone disease (arthritis).  I feel 90 years old, it's so sad I just want to cry.  I am a single mother of a teenager and I want to be able to still go do things with my son and he's helping me up out of chairs.  I told my son that this year on vacation I would not be able to ride go-carts with him, a yearly tradition for us, there is no way I can get in and out of them and that made me want to cry.  I just feel so old...  I have gained so much weight since being on this medicine, although the doctor said it isn't from the medicine (I have never had a weight issue until I started taking it). There are many days I have just wanted to stop taking it, but I haven't.  They told me to begin with that 5 years combined on meds but now they changed protocol and have upped the amount, they want you on Aromosin for a total 5 years and then they will see what protocol is then (I spent two and a half years on Tamoxafen first).  So I will be on meds 7.5 years before they will even consider taking me off. The side effects are horrible but what choice do you have?    ",
      "MessageIndex": 66,
      "PostDate": "02/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "On Sep 23, 2010 4:00 PM VivMasser wrote: On Sep 23, 2010 2:29 PM kshea wrote: I am on Femara and having joint pain.  My oncologist is suggesting switching to Aromasin but reading these posts it sounds like the side effects are the same.  I have three more years on this drug.  My question for everyone is does this pain go away once you go off the drug?  I think I can handle it for three years if I know it will be gone once I can go off them but if it is causing permanent damage that is another story. I was on Femara, then Aromasin for 2 years and suffered joint pain. I have a once in a lifetime holiday coming up and was determined to enjoy it, so I spoke to my GP about having a \"holiday\" from these drugs. He agreed that I could come off them for 6 weeks, but resume taking them directly after my holiday. I have to say that after 4 weeks my pains have gone almost completely, just a little stiffness in my feet remains. I will start taking them again in two weeks, but in the knowledge that in two years time, when I stop them completely the side effects should gradually go away. Hope this helps. I am happy to hear the pain goes away.  I was on Tamoxifen for 2.5 years then was switched to Aromasin for 5.5 years and was just taken off two weeks ago.  I am hopeful that the aches and pains will diminish soon.  After having been on meds for 8 years I am ready to be drug free and hopefully get my life back and feel like living again.  I just turned 49 years old but have felt much, much older due to the aches and pains over the last many years of taking these drugs.  Am excited to start feeling better and glad to know I should start feeling better soon.    Take care!!",
      "MessageIndex": 128,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "On Jul 20, 2010 8:26 PM Karenasmith wrote: On Jul 15, 2010 3:25 PM JoyceJJL wrote: HI I have been taking Femara for 2 yrs and my joints and legs, back are killing me,.   I tried the aromasin and arimidex, but had different side effects.  I am seriously considering to be asked to be taken off of this.  I have read so many posts about the side effects of this drug or others its beginning to scare me.  I can barely walk without leg pain.  I just wish I knew more about what would happen if I stopped this.  But its beginning to be more of an option to stop.  As its a continual joint pain 24/7.   Is everyone else having these symptoms?  I wonder if there are people that dont have this problem.,  Mine was a stage 3b ductal breast cancer and had a double mastectomy , chemo & radiation.  Would love to hear feed back from others.  Thanks   Joyce Hi Joyce, I too had stage IIIB ductal and lobular cancer, bilateral mastectomy, etc.  I was on Femara for about 18 mos and couldn't stand the pain in my joints.  It was unbearable.  My oncologist switched me to Aromasin about 9 mos ago, and I am doing better on it.  I still have pain, but not as severe.  However, the hot flashes, weight gain, and lack of energy are the same.  I'm tired of feeling tired all the time, but I'm afraid if I stop the drug the cancer will come back.  Its kind of a no-win situation, but I'm just not willing to take the chance.  I know the symptoms will go away if and when I can stop taking the drug.  I was very intersted to hear of all the incidinces of carpal tunnel on this site because I've just been diagnosed with that.  The brace at night helps.  I don't want to have surgery on that arm as that was the side all the nodes were removed from and they said to not even have blood work or blood pressure done on that arm.  Good luck to you - try to stay positive and be kind to youself.  I found a yoga stretch class very helpful. Hello.  I was on Tamoxifen for over two years and then was switched to Aromasin for over five years.  I did have to have carpal tunnel surgery on both hands, trigger finger surgery on both hands, wrist surgery on one hand.  Too many aches and pains to list and some major weight gain to boot. I was just taken off the meds so hopefully things will start to get back to normal soon.   Good luck to you.",
      "MessageIndex": 129,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 5/28/2009 ykwas54 wrote:   On 5/28/2009 srmac wrote:   On 5/15/2009 ykwas54 wrote: I had a lumpectomy in March 2006, and was immeadiately put on Aromasin as it was hormone positive. I also had 33 full breast radiation treatments, and have been cancer free since.  I have had two more surgeries on the same breast due to seromas and nodules, all negative. I am having all the side effects associated with Aromasin. I can't seem to find what the percentage plus is for taking it. Can anyone help me? I would love to know the answer to this as well. I had a lumpectomy in Oct. 2002, chemo & 33 radiation treatments. I have been on Aromasin for 4 years.  I have numerous side effects with the latest now including a severe degenerative disc.  However, I am a single mom and am afraid not to abide by my doctors wishes.  I did 2 years on Tamoxifen, I thought I was going to get off of my meds last year (at the 5 year of meds mark) but my doctor said they changed protocol and now want you on Aromasin itself for a total of 5 years...  I worry that next year they will say, let's just keep on going.... The sore/tired joints, muscles, aches, pains, weight gain, fatigue, etc....  and I am only 47 (I feel 77).. Good Luck!!My oncologist told me I would probably have to take it for the rest of my life!  Last week my regular MD told me I may have developed Rheumatoid Arthritis, so on my own, I have stopped taking the Aromasin. I don't know for sure if the Aromasin is what caused it, but no one in my family has ever had it.  I am so tired of being sore and tired!    ",
      "MessageIndex": 4,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36176,0.htm",
      "Title": "Is Aromasin worth it?"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 5/28/2009 srmac wrote: yikes...  i was afraid of that.  i took have learned that i have arthritis in my right knee, left ankle and both thumbs..  i guess it just never ends but i sure was hoping the medicine would.  i will certainly have to re-evaluate that situation soon.   On 5/28/2009 ykwas54 wrote:   On 5/28/2009 srmac wrote:   On 5/15/2009 ykwas54 wrote: I had a lumpectomy in March 2006, and was immeadiately put on Aromasin as it was hormone positive. I also had 33 full breast radiation treatments, and have been cancer free since.  I have had two more surgeries on the same breast due to seromas and nodules, all negative. I am having all the side effects associated with Aromasin. I can't seem to find what the percentage plus is for taking it. Can anyone help me? I would love to know the answer to this as well. I had a lumpectomy in Oct. 2002, chemo & 33 radiation treatments. I have been on Aromasin for 4 years.  I have numerous side effects with the latest now including a severe degenerative disc.  However, I am a single mom and am afraid not to abide by my doctors wishes.  I did 2 years on Tamoxifen, I thought I was going to get off of my meds last year (at the 5 year of meds mark) but my doctor said they changed protocol and now want you on Aromasin itself for a total of 5 years...  I worry that next year they will say, let's just keep on going.... The sore/tired joints, muscles, aches, pains, weight gain, fatigue, etc....  and I am only 47 (I feel 77).. Good Luck!!My oncologist told me I would probably have to take it for the rest of my life!  Last week my regular MD told me I may have developed Rheumatoid Arthritis, so on my own, I have stopped taking the Aromasin. I don't know for sure if the Aromasin is what caused it, but no one in my family has ever had it.  I am so tired of being sore and tired!      ",
      "MessageIndex": 5,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36176,0.htm",
      "Title": "Is Aromasin worth it?"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 5/15/2009 ykwas54 wrote: I had a lumpectomy in March 2006, and was immeadiately put on Aromasin as it was hormone positive. I also had 33 full breast radiation treatments, and have been cancer free since.  I have had two more surgeries on the same breast due to seromas and nodules, all negative. I am having all the side effects associated with Aromasin. I can't seem to find what the percentage plus is for taking it. Can anyone help me? I would love to know the answer to this as well. I had a lumpectomy in Oct. 2002, chemo & 33 radiation treatments. I have been on Aromasin for 4 years.  I have numerous side effects with the latest now including a severe degenerative disc.  However, I am a single mom and am afraid not to abide by my doctors wishes.  I did 2 years on Tamoxifen, I thought I was going to get off of my meds last year (at the 5 year of meds mark) but my doctor said they changed protocol and now want you on Aromasin itself for a total of 5 years...  I worry that next year they will say, let's just keep on going.... The sore/tired joints, muscles, aches, pains, weight gain, fatigue, etc....  and I am only 47 (I feel 77).. Good Luck!!",
      "MessageIndex": 2,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36176,0.htm",
      "Title": "Is Aromasin worth it?"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 4/15/2009 sleepychele wrote: Has anyone else noticed memory loss on Aromasin? I have been on it for a year now and it seems to be worse, plus cant sleep without sleep meds, lower back pain/aches. Just wondering if anyone else has had these side effects. absolutely, plus a lot of other side effects.  however, my doctor says only the side effects that include the bones/joints really have any real relevance to the meds (i don't necessarily agree w/that). i just had an x-ray on my lumbar and have a severe degenerative disc, i also have bone disease in my right kneee and left ankle.  i will mention that i am in my mid 40's and have been on aromasin for 3 years. your not alone, i have read several message boards with people in the same boat.",
      "MessageIndex": 1,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35321,0.htm",
      "Title": "memory loss on aromasin"
    },
    {
      "AuthorID": "srmac",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/srmac",
      "Content": "  On 4/16/2009 sleepychele wrote: Thank you, that makes me feel better. I have decided to go off for a while and see if I notice a difference. So many of the side effects listed on the comparison study were true for me, like insomnia, depression, back pain, visual disturbances (had to get glasses) hot flashes and the back pain--besides the memory issue. I too am in 40's-almost 49. I was on Tamoxifen for 2 yrs and now Aromasin for 1 year. Thanks for responding! michele please keep me posted.  i have thought about going off myself but being a single mom have not been brave enough to go against doctors desire for me to stay on.  i was on tamoxifen for 2 years also and was switched to aromasin,  that i was going to get off of meds last year but dr. told me new protocol was to stay a total of 5 years on aromosin so it will be a total of 7 years on meds. and then will see at that point what protocol is. good luck!!",
      "MessageIndex": 6,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35321,0.htm",
      "Title": "memory loss on aromasin"
    }
  ]
}