{
  "AuthorID": "starfire774",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/starfire774",
  "Posts": [
    {
      "AuthorID": "starfire774",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/starfire774",
      "Content": "  On 12/6/2006 Gailc wrote: This is my first visit to this site, and am happy I made it here. I am taking femara and have been experiencing severe bone pain, legs, etc., thought it was my arthritis. I thought my arthritis pills were no longer working. Swelling in between fingers on top of hand also. I have also been experiencing hair loss, which is very disturbing. I see in this area all of the other messages are about the same. I am more hopeful that femera is going to do the trick for the cancer. But such bad side effect. Liver, too? --- Message edited by CancerCompass staff: for personal protection, email address removed. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html ---- I to have been taking Femara about 3 1/2 months and have been having increasingly painful join and muscle pain nothing my MD has prescribed for the pain has helped. Does anyone know if / when I stop Femara will the pain go away? I started taking Arimadex made me have severe mood swings crying alot and hot flashes those  are better on Femara but I don't know if I can stand the pain  ",
      "MessageIndex": 5,
      "PostDate": "14/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1620,0.htm",
      "Title": "Stage1v in Liver. Femera Side Effects"
    },
    {
      "AuthorID": "starfire774",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/starfire774",
      "Content": "  On 3/24/2008 Jodie wrote: hello, I have posted other messages here before, and have always been informed from others going through similar treatments.. last week I had my 1st herceptin drip treatment.. so far not to bad.. I expected worse, and have been given better!  The only thing I have noticed and the dr. doesnt seem concerned about is chest pain which could or may not be related to the heart at all but it has just started since taking the herceptin last week.. I know this medicine is toxic to the heart, and they did an efraction injection the day before I started this treatment.. but didnt get the results back as to what the heart scan showed..  should I be concerned about these pains or just figure its part of the side effects.. the one thing I did have was the night of the treatment I had terrible chills, fever, and body aches.. much worse than I was told they would be.. they went away the next day.. I just wanted to ask others who may have taken this medicine what their experience has been?  I am Her2 positive and was in 01 when my first breast cancer diagnosis was made and treated.. the onco I had then didnt suggest I be given any herceptin to ward off any recurrence and so it is now metastatic in my lung area.. new onco dr. wants to keep it from spreading into other areas of my body so he has put me on the herceptin drip ever 3 weeks and hopes to put me on the pill form of this medicine if it proves beneficial after my next pet/scan in June..  I really dont want to have to take this stuff for the rest of my life... I am hoping for a break in treatment for a few months if things look good in June.. has anyone else had this and been able to take periodic breaks in treatment to give the body a chance to regroup? love to hear from you.. JODIE Hi Jodie,   I have been on Herceptin treatments every other week since Feb 07  I have to say I haven't had any side effects from it except for feeling more tired on the days I have the treatment.  I did have to take a break while they did a cardiac work up on me for shortness of breath.luckily every thing is alright.  Yes I would be very concerned about the chest pain and have it checked out even if it turns out to be nothing. it will ease your mind and you have enough to worry about.  I have a MUGA scan or a Echocardiogram  every 3-4 months to monitor for the toxic effects.  I am also HER2 positive and ER positive the herceptin is much easier to take than the Aromatase Inhibitors I have to take for the next 7 years.   Do they give you any premeds with the Herceptin they started out giving me Benadry IV before the 1st few treatments in cause I had any side effects. Good Luck, Carol     ",
      "MessageIndex": 2,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22299,0.htm",
      "Title": "1st herceptin treatment"
    }
  ]
}