{
  "AuthorID": "Stave.Aslen (Inactive)",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
  "Posts": [
    {
      "AuthorID": "Stave.Aslen (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Jun 20, 2011 4:37 PM aimejia wrote: I took Arimidex for five years.  I took the last pill on April 30, 2011.  I think that during this period of time I experinced all the sides effects listed by all you who have taken Arimidex including a metal taste in my mouth when I woke up in the morning.   The metal taste in my mouth is gone.  However, what concerns me now is that I have been having stomach problems since I stopped taking the Arimidex (coincidence?)  After nagging my GI she ordered complex blood work which included  HVY MTL PN (Heavy Metal Poison) and AMY LIPASE (This is to check the pancreas functions).  Can hardly wait for the HVY MTL PN's results to see if my experience with the metal taste in mounth every morning when I woke up have any relationship. On the other hand, the pressure that I feel in my stomach has affected mysciatic nevers which hasresulted in excruciating pains thatmake rolling on bed or getting up in the morning a living hell, because the musles on my lower back feel like some one was wringing them. Hope this information, helps someone outhere.  I am sure that if I had to do it again I will take the Arimidex.  What are the choices: cancer, side effects, or ???   He who said \"Cancer does not kill you, is the medicines that kill you\" was not lying. Stay hopeful and let faith carry you on.! This is men's induced disease not God’s given punishment. Know that He is with us at all times and he will give us thestrengthto survive. Phil 4:13 Blessed you all. Joint pains are predictable side of Arimidex and manageable as well. you have to consult to your oncologist.",
      "MessageIndex": 29,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "Stave.Aslen (Inactive)",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com",
      "Content": "On Jun 01, 2011 4:03 AM Rivergal wrote: I have been taking Femara daily for almost 2 years and I think it's FABULOUS because I am still alive & doing everything I always have done even tho' I have stage IV 'bone only' breast cancer.  I've had no chemo, no radiation, & no surgery. Just my daily Femara and once a month infusion of Zometa along with a monthly shot in my butt of Faslodex. I must take all of it for the rest of my life unless it quits working & I have to switch to another medication.  I am not curable, but I'm \"fine\"!  I'm VERY happy with Femara!  Hope it's good for your condition as well. Best of Luck, Toni you have keep eye on on ur Cholesterol levels while taking femora, because studies shows that femora tend to increase the rick of Cardiovascular events and serious adverse events because femora increase the LDL .",
      "MessageIndex": 2,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59589,0.htm",
      "Title": "Side Effects on Femora"
    }
  ]
}