{
  "AuthorID": "steelcowgirl",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
  "Posts": [
    {
      "AuthorID": "steelcowgirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
      "Content": "Toni Just spending some time searching for some possible answers/suggestions.  Your post caught my eye and I was hoping I understood you -- are you really taking both femara and faslodex? Thanks, because that was something I was going to ask my doc about. S",
      "MessageIndex": 2,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,53824,0.htm",
      "Title": "Stage 4 breast/bone cancer"
    },
    {
      "AuthorID": "steelcowgirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
      "Content": "Try United Way also.",
      "MessageIndex": 3,
      "PostDate": "24/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39276,0.htm",
      "Title": "how to i find financial help"
    },
    {
      "AuthorID": "steelcowgirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
      "Content": "I am grateful for these medications.  I was on Femara for  over 3 years, had some pain, stiffness in the joints.  I was also on Arredia and  Zometia which cause bone pain, so I couldn't attribute the pain to the Femara.  I wasnt switched to Faslodex until my cancer began to grow again.  I stayed on that medication  until my condition stabilized and the cost of the co-pay was a problem.    I switched to Aromasin at that point.  Again, stablized, had a knee replacement and removed part of the left lung to remove the metastatic disease.  These drugs have kept me alive, and yes I have some aches and pains, it's just a reminder that I'm alive and enjoying life.",
      "MessageIndex": 145,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "steelcowgirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
      "Content": "Check with the National Cancer Institute and they can give you a list of all available clinical trials and treatment possibilities.  They will break the list down to nationally or locally. Hoping you have a doctor that will work with you and help you decide on the treatments.  Just remember the doctors don't know all the treatments available.  Not sure where you live, but if there is a Gilda's Club close, join, they can help with researching too.   Good Luck",
      "MessageIndex": 4,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,53358,0.htm",
      "Title": "Seeking advice stage 4 running out of options"
    },
    {
      "AuthorID": "steelcowgirl",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/steelcowgirl",
      "Content": "I am very sorry to hear of your diagnosis.  I'll give you a synposis of my situation.  I was originally diagnosised in 1988 with Stage 3 Breast Cancer, muconius carcina.  That started my journey.  Now nothing  I say may help, check out the National Cancer Institute website and search for a highly rated NCI center close to you.  Seek out a 2d and third opinion. I agree, get a copy of Mr. Seigel's book, I've had a copy since my original diagnois.  I've been through my 4th trial with the disease as recently as Aug 10, 2009 having a portion of my left lung removed.  In 1995/96, I had a stem cell transplant and ended up with 10 years cancer free.  Breast Cancer does not have a cure as yet.  But there are many ways to control the disease and maintain a quality of life.  Get your wife to agree that you both need a good support group, friends, relatives, neighbors, or thorugh your local cancer society.  These areas can be a great way to maintain as much normalcy as possible. As you go through your search a couple of things that you musht keep in mind:  What is the primary site of the cancer? What kind of cancer is it? Is it hormone receptor positive? Is the lung cancer a metastatic disease from the breast cancer? Good luck and Gd Bless.  ",
      "MessageIndex": 4,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38968,0.htm",
      "Title": "2nd stage breast cancer now 4th stage lung cancer"
    }
  ]
}