{
  "AuthorID": "stoutej",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/stoutej",
  "Posts": [
    {
      "AuthorID": "stoutej",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/stoutej",
      "Content": "I'm so sorry about your mother!  I don't think that I ever updated.  But my wife passed at the end of March from this condition.  For her, she only had several weeks from the time when it began to noticably affect her cognitively.  However, her cancer appeared to have been very aggressive from the start.  I'm sure that there is a lot of variability in these time frames. For my wife, radiation did have a dramatic initial benefit.  Given that your mother has not yet been treated for CM, it's possible that this treatment could prolong her life.  However, her condition is much worse than was my wife's. Again, please accept my condolences that you must deal with this!",
      "MessageIndex": 91,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "stoutej",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/stoutej",
      "Content": "We got in-home hospice for the last week of my wife's illness.  It worked well for us.  When she was hospitalized briefly before bringing out hospice, she continually wanted to leave the hospital and go home.  This was terribly difficult because she was completely unable to walk by this time but did not know it at the moment. Once she got home, her desire to leave was less frequent.  However, she often did speak of wanting to leave and attempting to stand.  This is a common symptom of people suffering from brain cancer.  I relied frequently upon the website below to understand what was going on.  You can check out the symptom timeline to have some sense for for answering your initial question. http://www.brainhospice.com/ Some of this is intended more for solid tumors in the brain, but it's mostly useful. Also, I realize that, when talking of hospice decisions, my situation was surely different than yours.  I know how difficult these decisions can be.",
      "MessageIndex": 93,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "stoutej",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/stoutej",
      "Content": "I just spent some time reading over the many experiences posted here.  With this illness affecting my wife, I have been combining the internet for information and found this to be the most comprehensive place for personal experiences.  I appreciate the depth of perspective and wanted to share some of mine own. My wife, Lynn and 32 years old at this writing, was diagnosed with invasive ductal breast cancer with lymph node involvement, stage 2 in January 2012.  She underwent neo-adjuvant chemotherapy including adriamycin-cytoxan then followed up by Taxol.  When doctors performed mastectomy and analyzed the tissue removed, we were overjoyed to hear them pronounce a complete pathologic response.  No sign of living cancer!  Since then, I have read multiple reports (one of them in this thread) explaining that Taxol seems to destory the tumors but spread cancer cells throughout the body.  Since large-molecule chemo does not efficiently cross the blood brain barrier, some cancer cells find refuge there.  I'm not sure how well doctors understand this, but I suppose that it could just be one of the terrible trade-offs in treating cancer. She went through radiation and began Tamoxifen (cancer is ER+).  In late September 2012, she had almost finished radiation, and we were hoping to put cancer behind use forever.  She began experiencing terrible headaches and nausea.  MRI revealed a lesion in her brain.  Not yet CM.  Doctors explained that it was very operable and in a place where you'd want to have a brain tumor if you had to have one.  They surgically removed the tumor and followed up with Gamma Knife radiation.  All indications indicated a good result. She did fine for a few months.  Then, in late December 2012 she began experiencing headaches, loss of vision in one eye and lower back pain.  Diagnosis was CM based upon MRI.  She also had a small tumor showing up in her L2 vertebrae.  The doctor indicated that the prognosis is poor and that treatment was sometimes only palliative.  He did say that \"some patients do respond to treatment\" though he did not communicate that response is typically measured in increased survival of months.  The extent of typical prognosis is something that I have discovered in my research.  Lynn seems to not want to know the prognosis though she has grasped that this is dire.  I have not pressed to force her to know just how dismal it is.  I struggle with thinking about when/if there must be a reckoning. She received whole brain radiation and began taking Decadron, getting as high as 16 mg per day.  [You can find many sites delving into the difficult trade-offs of this drug.]  She also began intrathecal chemo therapy with DepoCyt.  She initially enjoyed dramatic clinical improvement.  Her headaches and back pain ceased, and her vision restored completely.  At the same time, she began to experience gradually progressive leg weakness.  By the beginning of February, she had to be lifted from a seated position and required a walker or wheel chair to get around. We attributed that leg weakness to the Decadron and began weaning her off of it.  Not convinced that the weakness was due to the Decadron, one of the doctors on our team ordered a new MRI of the lower back.  We discovered that the bone metastasis had progressed to the L2 through L5 vertebrae and the sacrum.  Doctors immediately began a regimen of radiation to the lower back and started her on a new oral chemo drug, Xeloda. More recently, the leg weakness has intensified to the point that she can not remain standing unassisted.  She is also suffering from progressing arm weakness.  She is also having minor losses of hearing, and I've noticed little lapses in memory.  Last weekend, she began suffering from debilitating pain in the lower back (certainly the bone mets), and we had to hospitalize her for a few days to get it under control.  She now manages the pain well with morphine. Lots of things are going on at once, and I worry that she is declining rapidly yet fear that she could survive for a long time but with a poor quality of life.  I go crazy not knowing what to expect and so seek solace researching others' experiences.  I'm not sure whether it helps to know, but I can't help it. I know that I wrote pretty extensively.  I hope that it wasn't too verbose to be helpful to others seeking as I am.  Yet I think that it may be cathartic to share in a forum such as this.",
      "MessageIndex": 84,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    },
    {
      "AuthorID": "stoutej",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/stoutej",
      "Content": "It's coming up on two years since wife passed from this awful disease, and I'm getting back to a place where I can think about it again.  We've established an endowment at The Ohio State University to fund research toward treatment of LC. Going on one year survival is very promising for this condition.  I hope that your sister continues to fare well and that her outcome denotes progress for future treatment.  Having both my mother and my wife develop breast cancer (the later being the primary cancer that developed into LC), I am very concerned for my young daughter! My heart goes out to Abra, her mother and family.  I'm sorry to have not been paying attention at that time to offer support! :(",
      "MessageIndex": 104,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,285,0.htm",
      "Title": "Treatment for: carcinomatous meningitis"
    }
  ]
}