{
  "AuthorID": "struggling",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/struggling",
  "Posts": [
    {
      "AuthorID": "struggling",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/struggling",
      "Content": "My fathers girlfriend had a mammogram last week and they called her yesterday and said that there were some \"dark spots\" on the right breast and they need to redo the mammogram for that breast before they can send the results to her doctor. Does anyone know from experience if she should be concerned? She is thinking it's cancer, is that the way it looks in mammogram? I know the only real way to be sure is a biopsy, but I really don't know if she will do that. Do cysts and tumors look the same on a mammogram, or do they look different?? Thank you for any help you can offer Renee",
      "MessageIndex": 0,
      "PostDate": "14/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21981,0.htm",
      "Title": "Can anyone offer assistance??"
    },
    {
      "AuthorID": "struggling",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/struggling",
      "Content": "I understand what decadron is it's effects excetera because my dad is on it. My question I guess was more why is the dose so high for breast cancer treatment? Was just saying that with the worst for of brain cancer there is my dad has never been on 16mg/day. The highest was 8 mg and that didn't last long. But I guess since it is used for such a short period of time the effects of decadron are not as damaging thankfully!! :)",
      "MessageIndex": 6,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24904,0.htm",
      "Title": "dexamethasone and treatment"
    },
    {
      "AuthorID": "struggling",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/struggling",
      "Content": "My dads girlfriend was recently diagnosed with stage 3 breast cancer. She had a lumpectomy and no lymphnodes are involved. She is due to start treatment next week. There is one thing I am confused about and was looking for a little insight on it. They have her taking 16mg/day for 2 days of dexamethasone to help with nausea?!?!?! Combined with some other things. They have written her a script for kytril (sp?) to be used as necessary if experiencing nausea as well. I don't understand why dexamethasone is being used for nausea. My dad is fighting brain cancer right now as well and he uses dexamethasone but to reduce brain swelling and with a stage 4 GBM has never been on 16 mg per day. I know how ugly this drug can be and I don't understand why they are using it in treatment of breast cancer. I also don't understand how they can flood her body with such a high dose and then just stop it after 2 days. I thought it needed to be tapered down (I guess she isn't on it long enough for tapering?!?!?) Any information on this would be greatly appreciated from anyone who has experience with decadron (dexamethasone)  Struggling",
      "MessageIndex": 0,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24904,0.htm",
      "Title": "dexamethasone and treatment"
    }
  ]
}