{
  "AuthorID": "Sue_1952",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sue_1952",
  "Posts": [
    {
      "AuthorID": "Sue_1952",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sue_1952",
      "Content": "I had the surgery on Monday, and though there was a delay of a couple of hours (which was almost like torture...I was READY, and had my 'game face' on...) the result for the sentinal node came back as negative! (My daughter-in-law told me, after I got back to my room, she said the doc had told me in the OR, but I guess I was pretty out of it, the anestheseologist must have given me some really GOOD stuff!) I was still pretty fuzzy even on the way home, but it seemed that the surgery went well. I don't have all of the results yet, probably won't til some time next week. I did as I said opt for lumpectomy, and it does seem as though there is some swelling, that there is not that much missing. Perhaps it was not as big as they thought originally. (not sure, as I said, I don't have all the results yet) The most irritating incision is the one where they removed the lymph node. That's OK. I do feel much better today than I did when I found out, I think it's the initial shock, and the flurry of activity that comes after the diagnosis, it may be that this is the calm before the next flurry of activity. I appreciate the information you passed along, there was almost too much information initially, and I think that was the problem for me. It's hard to make an informed decision with all of that stuff flying around in your head. I am keeping fingers crossed for the next bit of info, that it is another step towards a positive. Again, thank you for your response, you have no idea how much that contact means! sue",
      "MessageIndex": 2,
      "PostDate": "23/06/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5650,0.htm",
      "Title": "Diagnosed..so Now What..."
    },
    {
      "AuthorID": "Sue_1952",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Sue_1952",
      "Content": "Just got the 'word' last friday that I have breast cancer, and am scheduled for a lumpectomy on monday next week. (the surgeon said that I was a candidate for this and did not think that mastectomy was necessary) He said that I could take a week to think about it, but the nurse I have been dealing with is just absolutely JAMMING me through test after test after test, my answering machine is full of messages from the hospital, oncology, you name it...I have not even had a chance to breathe! Saw an oncologist yesterday, and even though the professionals have all told me that they do not know what kind, or type or stage or anything like that, he said that I will have chemo, radiation, and some sort of pills. I guess my question is, is this a standard thing that is done or said without knowing the type? I know that there are lots of people that are success stories, and I really want to be one of them, but I am not really hearing anything positive from the health profession..other than ... you need this test you need that test, and oh by the way, fill out this paper again for the 800th time with the same information we asked you for yesterday when you were here. is it just ME? Is there hope? I don't know, I am so stressed and depressed, and in addition..my mother just passed away in april, so I am still working on that. I just need to know from SOMEONE somewhere, that there are positive things here, so far it all seems to be BAD BAD BAD...and I don't even know what kind of bad it is yet. THank you for listening..I hope I haven't sounded like a lunatic. s.",
      "MessageIndex": 0,
      "PostDate": "14/06/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5650,0.htm",
      "Title": "Diagnosed..so Now What..."
    }
  ]
}