{
  "AuthorID": "suebus",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
  "Posts": [
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I am so sorry to hear about your mother in law. I also have stage 4 breast cancer in my liver and hip bone, I was just DX in Feb of this year stage 4 from the get go. I am 47 years old and hope to live at least 10 more years if not more. Yes at this point they just treat us we can live for a very long time. If one treatment stops working we move on to the next.  I feel fine work full time, you would never know I am stage 4. Best of luck to you both. There is a very good web site called BreastCancer.org it has section that is just for Stage 4 breast cancer and will be informative for you to post questions and also to see that your mother inlaw is not alone in this battle.",
      "MessageIndex": 1,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51461,0.htm",
      "Title": "Breast Cancer now in lungs, spine and vertabrae."
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I just started Zometa due to my breast cancer had spread to the bone. On my first infusion the next morning I could not walk my feet hurt so bad it lasted two or tree days. I just had my second infusion on Monday as no pain, I hope the same happens for you. I take a advil before the treatment and four hours after have you tried that, it was recomended from another site, best of luck I hope the pain stops for you.",
      "MessageIndex": 1,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,50501,0.htm",
      "Title": "Anyone have pain with Zometa?"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I am sooo happy. Yesterday I went to get the results of my three-month scans and the liver tumor had shrunk from 4.1cm to2.7cm, I can’t believe it in only three months. It seems like it was just yesterday I was posting on this site looking for help, you gave me so much support. I had no option for surgery due to it was stage IV, just hormone therapy. I thought this is it, how could hormone therapy work. I have been on Tamoxofin and monthly Zoladex injections,  I was just hoping for no progression, but this, this is awesome. I feel like a new person : )",
      "MessageIndex": 0,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48926,0.htm",
      "Title": "Great scan results...just after three months."
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Susan, I am also a stage4 mets to liver and bone. I am on Tamoxafin, zometa and zoladex for a year and a half now, I was dx Feb 2010. My liver tumor has shrunk 75% and the bone in not showing active on the PET scans. How could your Dr. say that your treatment may fail in 6 mths, no one knows when treatment will fail, it could work for years...hopefully it will. But once it fails you will move on to the next line of treatment. I wish you the best.",
      "MessageIndex": 1,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,59957,0.htm",
      "Title": "June 2010 breast Cancer Recurrence stage 4"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I did ask my oncologist about Green tea she said that it is ok to use, if you search on line you will see that green tea increases tomaxofin benefits. See below: Epidemiologic data have suggested that green tea may prevent breast cancer. Studies in our laboratory have provided evidence that green tea extract inhibits breast cancer growth by a direct anti-proliferative effect on the tumor cells, as well as by indirect suppressive effects on the tumor-associated endothelial cells. In this study, we asked whether concurrent administration of green tea may add to the anti-tumor effects of standard breast cancer therapy. We observed that green tea increased the inhibitory effect of tamoxifen on the proliferation of the ER (estrogen receptor)-positive MCF-7, ZR75, T47D human breast cancer cells in vitro. This combination regimen was also more potent than either agent alone at increasing cell apoptosis. In animal experiments, mice treated with both green tea and tamoxifen had the smallest MCF-7 xenograft tumor size, and the highest levels of apoptosis in tumor tissue, as compared with either agent administered alone. Moreover, the suppression of angiogenesis in vivo correlated with larger areas of necrosis and lower tumor blood vessel density in treated xenografts. Green tea decreased levels of ER-alpha in tumors both in vitro and in vivo. We also observed that green tea blocked ER-dependent transcription, as well as estradiol-induced phosphorylation and nuclear localization of mitogen-activated protein kinase. To our knowledge, this study is the first to show the interaction of green tea with the ER pathway, as well as provide mechanistic evidence that the combination of green tea and tamoxifen is more potent than either agent alone in suppressing breast cancer growth. These results may lead to future improvements in breast cancer treatment and prevention.",
      "MessageIndex": 1,
      "PostDate": "30/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45457,0.htm",
      "Title": "tomaxofin and other meds."
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Sorry to hear about your sister. I am also stage 4, mets to liver and bone. It does not mean that the breast cancer returned in her breast, it has spread through her blood and is now in her bone. There is a great web site called Breastcancer.org that has a message board for stage four, the ladies are great and are a wealth of info and support.   PET scans are the norm, usualy done every 6 months. Is your sister on Zometa, it is used for bone cancer to strengthen the bones. I get an infusion monthly. You should ask about this also.",
      "MessageIndex": 0,
      "PostDate": "13/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,53824,0.htm",
      "Title": "Stage 4 breast/bone cancer"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Ya, I agree its on my mind all the time...I hope once I start the Tamoxifin treatments and hopefully see results I can stop thinking and rethinking. Yes I wanted to just sleep too, but than you realize, I have to have clean laundry, clean the house, go to work, I have to move on...Thats what I am trying to do. I guess it will always be on our minds. Stay strong : )",
      "MessageIndex": 15,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I just started hormone thereapy today belive it or not. I had my first injection of Zoladex and will pick up the Tamoifen on my way home tonight. I have estrogen recepter posative breast cancer that met to my liver, from what I understand this treatment works well but slow, they say we may not see any results for 3-6 month. I will go back monthly for the Zoladex injection and will be taking 12mg of Tamoifen daily. Lets keep our fingers crossed for all of us, were in it together.",
      "MessageIndex": 28,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I too have just been diagnosed with breast cancer about a month now. Had all the tests found out it met to my liver. My cancer is estrogen receptor posative ( a good thing ) so I will be starting hormone therapy next week, lets keep our fingers crossed it stops the cancer growth. I find I have good days and not so good days because I cant stop thinking about it... Cancer takes over your mind, its hard to stay possitive but I am going to...you need to stay possitive too. Were going to kick this. Keep in touch.",
      "MessageIndex": 13,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Julie, I also have stage 4 breast cancer, liver and hip bone. I am being treated with Tamoxafin and Zoladex both hormone type drugs, I am ER+, PR+. Surrgry was not an option as they say it does not increase your life span, I am fine with this. We can live for a very long time, once one treatment stops we move on to the next. I am having great results on my treatment the liver tumor shrunk almost 50% in the first 3 months and my tumor markers are in the normal range. Best of luck to your friend.",
      "MessageIndex": 1,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,51372,0.htm",
      "Title": "Stage IV lobular cancer - tumour in peritoneum"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I also have metastatic breast cancer, in my bones and liver. It has been about a year and a half and I am doing fine (great). The liver tumor has shrunk about 75% and the bone is not active, my last PET/CT sacn last week said I am stable. I am ER/PR + and currently on hormonal treatment, no surgery so I still have the primary tumors in both breast, they have also reduced in size about 50%. I still work full time feel great, I would never know I am stage four...",
      "MessageIndex": 2,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,61026,0.htm",
      "Title": "New hear"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Yes, there is hope. I was DX from the get go with stage IV liver and hipbone. I am ER/PR+ and Tamxofin is helping. My tumor markers are down from 177 to 44 in a short time (3 mths) and both the live and bone mets are shrinking down 50%. I also am getting Zometa infusions monthly for my bones. You don’t say what type of BC you have but chemo is not always the first round of treatment depending on what type you have, but yes, there is hope. I was in your shoes just in Feb of this year when I was DX. I know were you are coming from. It does get better. .",
      "MessageIndex": 6,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41808,0.htm",
      "Title": "bone cancer"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Vitamin D is sooo important, take a look on line you will be surprised every one should be taking it. I just had mine Vitamin D checked last occ visit will find out on Thursday what it was. In the time being I am taking 2000 IU per day, my occ approved this and also I take Tamoxifen. You might even see an improvement in your mood once you increase your vitamin D level. I just finished my three month scans today, cant wait until Thursday to see the out come. Hope all is well...",
      "MessageIndex": 2,
      "PostDate": "22/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48816,0.htm",
      "Title": "vitamin d is good for having breastcancer..??"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "On Feb 24, 2010 5:48 PM Rivergal wrote: On Feb 23, 2010 11:32 PM jpah123 wrote: Hi, I am awaiting my results form a breast biopsy but was told I probable have stage iv breast cancer that has gone to my bones. I currently have a lower back fravture which brought along other tests to see why this happened. My mamagram came out ok but my CAT scan showed suspicion in my breast along with 6-8 places in my spine, ribs, pelvic, etc. I have been reading a lot I want to start on treatment. I have been suffering with my broken bone in my back for 5 months and feel a lot of pain in the places the CAT scan showed disease. Should I start taking Immunopower, Ultramet, Polymvul or is there soething better. I think the doctors will give me a gloomy outlook but I want to start fighting back right now. Any suggestions would be greatly appreciated. Hi, Have you been given your diagnosis yet?  Your case sounds very similar to mine, depending on what type of cancer you actually have.  You can click on my profile to read about mine, but the bottom line for me is that having Stage IV LOBULAR breast cancer (which was determined by a biopsy to a couple of my vertibrae) is not such a bad thing, so don't panic.  I was diagnosed in July & thought I wouldn't have much time so I gave away a lot of things that I wish I had kept since I really feel just like I did before I knew I had cancer.... some aches & pains, but mostly just fine.  I have no symptoms at all & have been told I can \"live for years\" with this disease & that seems to be the way Stage IV lobular breast cancer works because I've heard from others who are the same. If your diagnosis is the same, I can go into more detail as far as treatment goes.  I'll be hoping for the best for you.  Write me....... Toni I also have breast cancer that spread to my liver and bone. I have not started treatment yet I have a vist with the Oncologist onThursday of this week. They are looking into hormone therapy. The crazy thing is I feel fine. Your case sounds similar to me, what treatment have you had?",
      "MessageIndex": 9,
      "PostDate": "09/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44414,0.htm",
      "Title": "diagnoised with stage iv breast cancer metastasized to bones in spine and pelvic"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Glad to hear from more stage iv.  I am currently on Tamoxifin and monthly zoladex injections no SE yet. I feel great, would never know I have mets to liver and small area on my hip bone.",
      "MessageIndex": 13,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44414,0.htm",
      "Title": "diagnoised with stage iv breast cancer metastasized to bones in spine and pelvic"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Sabine, Every one is different; I had results in 3 months. I had a three month PET scan and my liver tumor is reduced by almost 50% and my TM were 177 are now 44. As far as how , my occ said it could work for years. Just one day at a time that’s all we can do.  Have you had your 3 month scans yet, I know you started right around the same time I did.",
      "MessageIndex": 1,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,49875,0.htm",
      "Title": "tomaxofin"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Hi Anna, I also have stage IV with mets to my liver, I go on Monday June 21 for my three month scans to see if treatment is working. I am on Tamoxifen and monthly Zoladex injections. I am ER+, PR+, HER2-.  DX 2/12/10 I have read the vitamin D and green tea both have impact on shrinking the tumors, I am giving it a try. What is mgn and protocell? Sue",
      "MessageIndex": 11,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48125,0.htm",
      "Title": "tomaxofin and nothing else???"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I am also on Tamaxofin but with monthly zoladex injections to shut down my ovaries. I feel great would never know I’m stage 4. I will go for my three month scans the end of June that has me worried. But so far so good. The only thing I am doing is adding Vitamin D.",
      "MessageIndex": 3,
      "PostDate": "01/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48125,0.htm",
      "Title": "tomaxofin and nothing else???"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "Hi Anna, I also have stage IV with mets to my liver, I go on Monday June 21 for my three month scans to see if treatment is working. I am on Tamoxifen and monthly Zoladex injections. I am ER+, PR+, HER2-.  DX 2/12/10 I have read the vitamin D and green tea both have impact on shrinking the tumors, I am giving it a try. What is mgn and protocell? Sue",
      "MessageIndex": 16,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,48125,0.htm",
      "Title": "tomaxofin and nothing else???"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": " I also have liver mets. I have been on hormone therapy for a year now and the liver mets are almost gone. I am scanned every three months, tumor markers are checked monthly they are currently in the normal range, from this blood test they can keep an eye to see what’s going on meaning it they see a rise they may want to do a scan sooner.  I hope the best for your sister.",
      "MessageIndex": 2,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,55281,0.htm",
      "Title": "BREAST CANCER MET TO LIVER"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I would like some morale support from others with stage four advance breast cancer that has met to my liver and the doctors say no surgery, they will treat it like a disease. I have estrogen positive breast cancer being treated now with hormone therapy, just started, its my fifth day on Tamoxafin and Zoladex injection. It seems like every one has had surgery, any one in the same boat as me? The doctors say this treatment is very successful.",
      "MessageIndex": 0,
      "PostDate": "29/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45448,0.htm",
      "Title": "No surgery for advanced breast cancer?????"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I would like to find out about Tamoxifen and Zoladex, I start this treatment next week. My cancer has been tested as estrogen receptor positive, has this treatment worked for any one.",
      "MessageIndex": 0,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": "I have just been diagnosed with stage 4 cancer that has met to my liver. It tested estrogen receptor positive, and they say no surgery because it spread, we just control it at this point with Tomaxafin. Is this your situation, has it stopped the growth and from spreading?",
      "MessageIndex": 2,
      "PostDate": "22/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    },
    {
      "AuthorID": "suebus",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/suebus",
      "Content": " Have you had surgery or just hormone theropy, I am just having hormone theropy no surgury.",
      "MessageIndex": 5,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45143,0.htm",
      "Title": "Any one on Hormonal Therapy"
    }
  ]
}