{
  "AuthorID": "sumeetnag",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sumeetnag",
  "Posts": [{
    "AuthorID": "sumeetnag",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sumeetnag",
    "Content": "Hello Everyone, My mum has been diagnosed with Stage 4 breast cancer having metastasised to her right lung and bones. I have been doing a lot of reading on various protocols and been in touch with nutritionists, oncologists and different practitioners from different parts of the world. I read the book on radicalremissions by Kelly Turner and following the 9 point approach, which is wholistic healing. Unfortunatelyintegrative oncologyis not practised where mum resides. Following is our approach and we need help with this cocktail appraoch, though it is considered herbal and not of any side effects. 1) Mum's currently on hormone therapy of Letrozole and Zoledronic Acid. 2) She is ondietof cruciferous vegetables, no sugar, no meat and no processed food. 3) She has 3 green juices and 3 carrot/ginger juices as reccomended by our nutritionist. 4) She takes supplements of vitamin D(10,000 IU's), pectasol C and beta 1 3d Glucan. 5) We will be starting with tibetan herbs which has shown effective results in a clinical trial. 6) She is on a 6 course cycle(8 in one course of alternate day) of mistletoe therapy. 7) She practices Yoga, QuiGong and Pranayam. Unfortunately, I do not have any oncologist who can help me with this cocktail effort and warn me of any side effects. Could anyone on cancercompass, help advise me on the current protocal and suggest any pitfalls, side effects or anything which I should reconsider. As you can see, I have tried to research my best but I am a software consultant and not a Dr. Everyones experience of an ER/PR+ metastatic breast cancer remission stories will help. Regards, Sumeet",
    "MessageIndex": 0,
    "PostDate": "03/03/2015",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,83168,0.htm",
    "Title": "Integrative therapy for Metastatic Breast Cancer"
  }]
}