{
  "AuthorID": "SunnyHeather",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SunnyHeather",
  "Posts": [
    {
      "AuthorID": "SunnyHeather",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SunnyHeather",
      "Content": "I'm a survivor like you and have been on Arimidex 13 months when I started having hand and knee stiffness and pain. The pain is worse in my right hand (perhaps it's because I use that hand more since I'm right-handed). I'm in my early 50's but I feel older than my 80-year-old Mom sometimes. I told my oncologist about this and she said I can stop Arimidex for a month to flush it out of my system, then take it again. She said this sometimes works on some patients. However, I'm afraid my body might start producing estrogen if I stop Arimidex, so I use reusable hand warmers which I purchased online and massage and exercise my fingers when I first wake up or after a period of inactivity. As for the weight gain, I do exercise on the treadmill and limit my food intake but I'm still gaining weight slowly. I don't have edema, though. I'm cautious about taking Aleve or Celebrex or other Cox-2 inhibitors such as Vioxx and Bextra because previous studies have connected some of these medicines with an increased incidence of heart problems and stroke, and this is not even mentioning their adverse effects on the kidneys (http://www.ccjm.org/pdffiles/WEIR.PDF ). On particularly bad days, I take a couple of ibuprofens but I rarely do this since ibuprofen is also an NSAID. I'm thinking of consulting a rheumatologist if the pain gets too unbearable. I haven't tried glucosamine yet.   ",
      "MessageIndex": 5,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21548,0.htm",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "SunnyHeather",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SunnyHeather",
      "Content": "This is a mammogram terminology. A biopsy is indicated for this suspicious lesion.This website will tell you more. http://breastcancer.about.com/od/diagnosis/a/birads.htm ",
      "MessageIndex": 1,
      "PostDate": "19/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21992,0.htm",
      "Title": "Question about Ultrasound Terminology"
    }
  ]
}