{
  "AuthorID": "sunshineMuriel",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sunshineMuriel",
  "Posts": [
    {
      "AuthorID": "sunshineMuriel",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sunshineMuriel",
      "Content": "Hello, My name is Muriel. I am new to the Cancer page here, but I am writing to you regarding your beloved mom. After reading that she passed on March 7th, it brought a tear to my eyes. My deepest sympothy go out to you. I too lost my wonderful beloved mom to this dreadful cancer. She had Breast Cancer. God was still good to her though. Her name was Grace. She was 69 years young, and fought it for fifteen years. She never was sick until last year in 07.. about the month of June her Doctor prescribed her some new medication Chemotherapy called Tykerb Oral. She actually gave my mother an overdose and spead up her illness. Tykerb Oral is a pill and really she should have taken one pill a day... but her careless doctor told her to take five a day on an empty stomach. She gave my mom six weeks to live in June of 07, but she fought on and lived until September 11th. Never Complaining about anything, it's just was the way she was. Boy do I miss her. But what is so rare is that I noticed you said that your wonderful mom passed on March 7th? That was my mom's birthday. Hope to keep in touch with you. God Bless, Muriel",
      "MessageIndex": 2,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23569,0.htm",
      "Title": "My mom has passed away"
    },
    {
      "AuthorID": "sunshineMuriel",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/sunshineMuriel",
      "Content": "  On 5/8/2008 Prayer for Cancer wrote: Sorry to hear of the death of your mom. May God who comforts all comfort you and grant you peace. My mom passed away in November because of a heart attack. I miss her and I can understand how you feel. If you have time, let us pray for those with cancer..here is the list http://www.prayer-for-cancer.com . Blessings, Chester Thank you Chester for your kind words. I know that God gives comfort, because I am comforted everyday from him. He has given me unspeakable strength.",
      "MessageIndex": 4,
      "PostDate": "08/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23569,0.htm",
      "Title": "My mom has passed away"
    }
  ]
}