{
  "AuthorID": "susanah",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susanah",
  "Posts": [
    {
      "AuthorID": "susanah",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susanah",
      "Content": "I was diagnosed last week with breast cancer.  I told my two daughters and it was very hard.  They both cried.  I will have surgery sometime in the next few weeks.  The problem is how to tell my mother.  She is 77 years old and is the worst worrier I've ever known.  She recently lost a friend to cancer and I know this will keep her up nights.  But, she lives close and it would be hard to keep it from her.  Any suggestions?",
      "MessageIndex": 0,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22276,0.htm",
      "Title": "how to tell my mother"
    },
    {
      "AuthorID": "susanah",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susanah",
      "Content": "thank you.  I'm seeing my mom later today and I have spent more hours dealing with the decision of what to tell her than I have spent dealing with what to do at my next appt with the doctor.  Every parent is different.  Some are comforting and relate from a place of wisdom and life experience.  But some, like my mother, are emotional and stressed out even when there isn't anything wrong.  I love her dearly but I think the idea of telling her as little as possible is the right way to go.  She will invent plenty of horror stories in her own mind without me telling her anything at all.  I think I need to continue to think of her health and well-being as well as looking after my own.  Maybe time will help me to with this question, and I appreciate all the good advice.",
      "MessageIndex": 4,
      "PostDate": "25/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22276,0.htm",
      "Title": "how to tell my mother"
    },
    {
      "AuthorID": "susanah",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susanah",
      "Content": "I'm sorry for your situation.  I don't have a husband.  But, it seems like tough times should bring people closer.  If you or your husband think his actions are somehow normal, I think he needs some serious counseling. ",
      "MessageIndex": 1,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22232,0.htm",
      "Title": "husband problems anyone?"
    }
  ]
}