{
  "AuthorID": "susans_friend",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susans_friend",
  "Posts": [{
    "AuthorID": "susans_friend",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susans_friend",
    "Content": "  On 7/9/2007 Lt2797 wrote: Hello All, Does anyone know anything about a possible relationship between breast cancer & melanoma?  Here's my story;  dx'd with stage 1, er/pr positive breast cancer of the left breast in 2002 (no lymph node involvement).  Had a modified radical mastectomy of the left breast followed by 4 rounds of AC, then 2 years on Lupron (I didn't tolerate Tamoxifen well).  I was also tested for the BRCA-1 &2 mutation and came up negative.  I've been on no meds since 2005.  In April of this year a small, \"indeterminate\" mass was discovered in my right breast during a routine breast MRI.  My onc decided we should wait and do a follow-up MRI in October to see if the mass has grown.  Two weeks ago I discovered an unusual lesion on my back.  The mark is .50 centimeters in size, irregular in shape, light tan in color with a scaly, raised portion on one side.  I saw my regular doctor today and she referred me to a dermatologist.  While she assured me that it was probably nothing she did mark the referral slip \"urgent\" and advised me to get an appointment ASAP. I've since found articles on the internet indicating that there may be a connection between an increased incidence of breast cancer & melanoma.  I know much of the information on the net can be misleading so I hope that someone can shed some light on this subject.  I'm not afraid of having any kind of cancer again, I just want to have all of the information I can upfront so that I can ask my doc's good questions. Thanks for you help.  Good luck to all! Lisa Hi Lisa..my best friend is just finsihing up her first year of treatment ( surgery chem radiation and herceeptin) and has just been diagnosed with melanoma..I am a medical professional and have access to some  reliable data sources..I have not found much  about melanoma and breast cancer yet but I am looking and will keep you in mind  Sue",
    "MessageIndex": 3,
    "PostDate": "23/07/2007",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14203,0.htm",
    "Title": "Breast Cancer & Melanoma"
  }]
}