{
  "AuthorID": "SusanRB",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SusanRB",
  "Posts": [
    {
      "AuthorID": "SusanRB",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SusanRB",
      "Content": "Hi. I started Tamoxifen back in the summer of 2009 after surgery (Sept. 08), four rounds of chemo, and six weeks of radiation. Within weeks my mood had crashed and I was having suicidal thoughts. I have a history of depression and suicide attempts, so I went off Tamoxifen. This, after reporting it to my oncologist and having her say that none of it could be from the Tamoxifen. [After she said that, I checked online, and sure enough, found women with the same experience. So, I went off it, the symptoms got better, and I weaned myself onto it again, within weeks the symptoms returned. That's when I insisted I go off of it.] I had my ovaries removed on Oct. 8, 2009, to get rid of most of the estrogen (my mother died of ovarian cancer in 1980, when I was 14). I started Armidex, and my feet and hands swelled up, hard to walk, really painful hips when I slept. I can't remember what else. I sent my oncologist pictures of my feet and hands. She said to stop the drug. I started Femara, and within a month or so developed trigger thumb in my right hand. My oncologist said that trigger thumb cannot be caused my Femara. I looked online and sure enough, many women have developed trigger thumb on Femara. I went to an orthopedist and he wanted to give me cortisone shots. I don't want more shots. I went to a hand specialist and he made splints for my thumbs, which helped (by the time I saw him I had developed trigger thumb in my other hand too). Oh, by the way, I earn my living by using my hands, so now I'm faced with quitting one of my jobs as a window designer.  Now I can't do much with my hands without experiencing pain. I can't do any of the things I once enjoyed pain-free like making jewelry, writing in my journal, gardening, walking my dogs (it kills to unclick their collars), creating art, cutting paper with scissors (one of my all-time favorites) anything, really, do to with fine motor skills -- cooking, cleaning, lifting heavy objects (which is one of my favorite things to do), rearranging furniture to make my home nicer, folding laundry, working on my house, folding up a futon couch, once it's opened up. Fixing things in my house, mowing my lawn, anything. Counting change at work, making change at work, vacuuming at work, moving fixtures, anything. I feel like a prisoner in my own body. In any case, the point of me writing is, I am thinking of stopping the Femara to start Aromicin, but after reading the posts here I don't know if it will make a difference. I don't know what to do. I'm also thinking of stopping Femara and not taking anything else for that matter. Like someone else wrote here, I'd rather go through chemo again than live with this. One thing that just occurred to me though, is to get a second opinion. Maybe I'll look into that. Good luck to everyone. Blessings, Sue",
      "MessageIndex": 135,
      "PostDate": "05/12/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "SusanRB",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SusanRB",
      "Content": "Hi Everyone: It's been a while for me, but I thought I'd comment here about what I experienced as side-effects from estrogen inhibitors. For a complete saga, you can visit my websitewww.suesboob.blogspot.com Chemo, radiation, then (aside from the typical menopause symptoms -- hot flashes, etc.): 1. Tamoxifen, which led to suicidal ideation, joint pain, etc. DOC TOLD ME SUICIDAL IDEATION WAS NOT FROM TAMOXIFEN READ ONLINE THAT OTHER WOMEN HAD SAME RESPONSE, THEN WENT OFF, THEN STARTED AGAIN SLOWLY AND IT WAS OK 2. Off Tamoxifen 3. Restart Tamoxifen, restarted very slowly then suicidal ideation, joint pain, etc. Screw that. 4. Oophorectomy (ovary removal) -- my mother died from ovarian cancer at age 55, and I've never had a strong urge to have children, so I just said \"take them out\". 4A. Instant menopause. 5. Arimidex, swollen hands and feet, major joint pain, even when I was in bed, sleeping. Other stuff too, but it's all a vague memory. 6. Off Arimidex 7. Onto Femara, trigger thumb starts and DeQuarvain's (sp?) tenosinivitis. Little bumps on my outer wrists that hurt. Couldn't move my wrist toward the left. Mobility in both wrists starts to diminish. TOLD THAT THE TRIGGER THUMB \"COULD NOT\" BE FROM THE FEMARA. Sound familiar? 8. Still on Femara, MAJOR trigger thumb and wrist problems, so much so that I couldn't do my job (window designer). Worse in my right thumb (I'm right handed). Couldn't turn doorknobs, use a can opener, open jars, pick up coins off a counter. It was like having rheumatoid arthritis.  9. Went off Femara, thumb and wrist got better. 10. Went back on Femara, trigger thumb and wrist problems returned. 11. Cortizone shot in my wrist and thumb for the trigger thumb and DeQuarvain's. THE MOST PAINFUL THING I'VE EVER EXPERIENCED IN MY LIFE (OF COURSE TOLD IT WOULDN'T HURT). I was screaming in the doctor's office, wailing in pain, almost fainted. Screaming. It was one of the most traumatic things I've ever experienced. 12. Still on Femara, thumb and wrist better, but mood dropping and dropping. Suicidal thinking. 13. I told my oncologist THAT'S IT. I'M DONE. I stopped all medication. Over time trigger thumb and wrist problems went away entirely. 14. My hands are perfectly fine now. I have full mobility in both, no pain at all. Mood is stable (I've been on anti-depressants close to 25 years anyway). My motto is, \"I want to be happy for the rest of my life, however long that is.\" I am unwilling to live in pain. Good luck, one and all, and remember, doctor's are smart, but they don't know everything, even if they mean well. Keep looking online for answers. Talk to the people who live it. Peace and Love Sue    ",
      "MessageIndex": 174,
      "PostDate": "18/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    }
  ]
}