{
  "AuthorID": "susier",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
  "Posts": [
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Thank you that sounds like a great idea. I have been rolling up little terry cloth hand towels but that irrates it more. Wish I knew about this board when I was going through the cancer you ladies are great.",
      "MessageIndex": 65,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "My Port was removed in surgery only cause they had a hard time putting it in.  They end up cutting me 2 different spots to get it in.  I was happy to be a sleep because when they tried to put it in during a twightlight sleep it was a painfull ordeal for me and a day I will never forget.  So agin glad I was put under.",
      "MessageIndex": 66,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I know the chemo did a lot to me as well. I had the taxol as well and it made me very sick.  Then they swithch me to the taxotere I think that is how you spell it. With that one I ended up with neuropathy (tingling in the hands and feet). To this day I still have it in my legs. So they put back on the taxol along with something else.  That started the bad body and joint pains. The swelling and weight gain was awful.  I didn't even regonize myself. These medications now just add to what already is happening and the night sweats, hot flashes in the morning, headaches and the mood swings really is a terrible way to live. I always feel like I am out of breath. Still on anti-depression pills. It's almost like you never really get over cancer cause one way or another we still have to deal with it's lasting affects.",
      "MessageIndex": 83,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Hi Hadia, Where can I find these shampoo (Nioxin) does it help the hair get thicker what does it do. The one thing I notice is my scalp is like that of a baby with the new hair. It looks and feel like cradle cap. I always feel these little bumbs on my scalp. So much in our lives change and to me is depressing.  I am 54 and can hardle get out of a chair after sitting for a while.  I use to jog every weekend. Talk long walks with my husband and now I can't even go with him to walk the dogs. My whole life has been altered.",
      "MessageIndex": 87,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I have stopped taking the arimidex and  the aromasin that was given to me after that.  My body does not hurt like a 100 yr old woman who probaly still had more strength than me.  I am able to walk more sit longer and the pain is almost gone. I have been of the meds for around 2 weeks. I will be checked in August to be sure I am still cancer free. Good luck. :)",
      "MessageIndex": 132,
      "PostDate": "03/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "On Jan 19, 2012 9:08 PM Lisaepstein wrote: I just started taking Arimidex and I am getting headaches and I am having really bad heart burn and lots of gas pain. I called the pharmacy and they told me these were normal. The Arimidex didn't give me heart burn but maybe that is because I have been on previcid daily. If you start hurting from muscle and bone pain you can be sure it is the Arimidex. I already have tried the Tamoxifen for 7 months and just this January after a full knee replacement (which had nothing to do with the breast cancer) I have been put on Arimidex so the odds of reoccuring breast cancer would be less since I show up in the high risk group. In almost 3 months my pain, cramps of the muscles , joints and bones have went to severe. Doctor told me  to get off of the Arimidex for 3 wks to see if there is a change. So far it has been one week and I am still walking like a woman of 90 and the pain has not lesson yet (but then again it hasn't been 3wks).  I don't know about thes drugs, they may help one thing but ruin and affect so much more.  Depression sets in so much because I can't walk a block with out pain in my whole body.  But we have to keep keeping on! So I am praying for all my WARRIOR SISTERS and those who didn't make it.  There has to be a better way.  Joint pain or not I will be walking in the Mother's Day Walk for us all ( Walking F.A.B (WALKING FOR ALL BOOBIES).  God Bless you and I hope that those are the only side effects you will experience.",
      "MessageIndex": 50,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "On March 1 had my port remove. To this day were the port was at I still feel irratation like if I have a bad sunburn.  When I put my seat belt on I am always tugging at it because it hurts that spot.  Can anyone tell me how long before that irratiion goes away? It is very uncomforable sometime I put ice on it just to numb it.",
      "MessageIndex": 56,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Well I have been off the arimidex for  a few weeks and yesterday they started me on Aromasin.  Has anyone out there taking this medicine?  Are the side affects any different. This is the 3rd medication they are trying.  First it was the Tamoxifen, then Arimidex and now the Aromasin. It goes by the generic name exemestane 25 miligrams.",
      "MessageIndex": 74,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "On so many levels your e-mail is true but my friend from work was on the Arimidex 4yrs and the BC returned and she had to have a double masictomy and her ovaries removed.  I guess there are no guarantees. I will try the shampoo.  I too am happy to just have hair but it's hard to be positive when it came back for a second time on my sister and the BC won. I do work everyday and try to go through my life lik normal but it's not normal when all I want to do is sleep and the neuropathy gets worst and well as the pain.  I think each day is different and I live each as it was my last.  You are right happy to be alive but really limits and pain is not my idea of living.  I thank God for life and I will enjoy what ever quality of life I am giving, cause my sister can't even do that.  Thank you for your take on this.  You have to do it forever they told me 5yrs so I have nothing to cry about.  I guess I am one of the luckier ones. :)",
      "MessageIndex": 89,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Couldn't you get those handles that have suction cups on them to put od the walls or the tub so you can get in and out on your own?  I am sure you can get them at kmarts or walmarts or hardware store.  Maybe even at Bed Bath and Beyond. I believe they are inexpensive. Is there someone that maybe can install a bar on the wall of your bathroom so you can take a nice long hot bath? Sorry just trying to find ways you can enjoy a relaxing bath.  Sounds like you would like to if able.  ",
      "MessageIndex": 120,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Wow, I don't mean to sound stupid but what does METS stand for?  This is the first I am hearing about this from anyone on this board.",
      "MessageIndex": 121,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I had stage 2 BC put it did not get to my lymph nodes. I still had to go throuh the 6 rounds of chemo and radiation 5x's a week for 8 weeks and a lumpectomy. I didn't think I would have to go through a hysterectomy but I did.  I just don't want to myself through anymore not when the odds are still either or on those dreadfull meds they put me on. So I want to detox my body and take it from there don't know how it will go but it has to be better than what the side effects of these pills are.",
      "MessageIndex": 122,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Wow Hadia, it is so scary just about everyone I know who had the cancer regardless of taking the meds or not the awful C came back a second time. I live in total fear because my sister who was 1yr and 9 months older than me died and her and I were the youngest of 8 girls. There was never any breast cancer until us two. All the meds are making the healing of my knee replacement slower.  I am 54 yrs old now and never looked my age until all this happen.  My cancer was also estrogen receptor positive and I was premenopausal.  So chemo really pushed me over the edge. My oncologist said I need to take the pills for 5yrs. why is everyone one her taking them so much longer?",
      "MessageIndex": 84,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Today I called my oncologist to tell her no more aromasin. I have been on it a little over 1 week and now my hair is falling out. In september it will be 2yrs I finished the chemo and radiation. My eyebrows or eylashes have hardly grown back yet.  My hair came back really thin appose to the think hair I had and now to have that fall out now thank you. Sick of tamoxifen, arimidex and now Aromasin.  Sorry to say Arimidex causes all sorths of things to certain people was only able to take that 1 month and the tamoxifen only 7 months.  I feel like we just can't get a brake unless it's a bone with all these meds.",
      "MessageIndex": 100,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I am sorry to hear that. You sound like my sister use too. Her breast cancer had metasticied. She was on Femera which caused her even more pain. she was getting bone infusions which after wards all she did was moan in pain.  Why can't they find a better way to help us get through this.  Isn't haven't cancer enough that we have to endure medicine that makes it feel that much worst. I know that I couldn't take the arimidex because of severe bone and joint pain. These meds are terrible.  ",
      "MessageIndex": 101,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I don't know how it will affect you but I do know since the chemo I have not been able to tolerate anything they try to give me. The tamoxifen was weight gain severe cramping after 7 months my regular doctor said I had to get off the tamoxifen.  I had a hysterectomy thinking I wouldn't need anything. The Arimidex came next. I ended up with what felt like sever carpal tunnel walk like I was 90 after sitting for 15 minute and even the bones felt like they just could break. That was after 1 month.  Now the aromasin to be is the worst. Body and joint pain plus the hair lost oh yeah the severe knee pain. That's what 1 week did to me.  Still on anti depresents cause I don't have anything to deal with the hotflashes. YUCK! Damned if we do and Damned if we don't.  That abouts sums it up.  ",
      "MessageIndex": 103,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Hello I am new to this board. I just started taking Arimidex on January 13,2012. I was told a year after my older sister lost her 5yr battle to breast cancer that I had breast cancer as well. The doctor did a lumpectomy treated me with 6round ofchemo and 7rounds of radiation. I was put on Tamoxifen afterwards and in 7 months time I was suffering from severe cramps in my legs, toes and hands everynight then all through out the day. The oncologist took me off the Tamoxifen and started me on Arimedex and as of today she has taken me off because of severe muscle and joint pain. I woke up with my hands cramped up in a fist. Took me a while to get up off the bed or couch. I have burning sinsation in my hips and my bones feel like a truck ran over them. I also started having neropathy in my legs again just like from the chemo. The doctor said after 3wks if the symptoms stop they will have to try something else.  Is there anyone out there who is not taking Tamoxifen or Arimidex and if so what is it called and are you having any bad side effects?",
      "MessageIndex": 47,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Yes indeed, when I told the doctor I didn't want to try anymore of there perventive drugs she said it is a numbers game.  There is a chance it will come back and a chance it won't. You have to put your feet in the shoes that have the right fit for you. We are all wired different but same.  I just couldn't take the bone and joint pain and wanted some of my life back.  Please be sure your choice is your own an no one elses.  You are the one who deals with what ever it is your body goes through, so you decide what is good for you and most of all I whish you health.",
      "MessageIndex": 136,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I hated it as well but my doctor didn't ask me if I wanted to keep it.  The irratatiion now that it is out is as bad as it was while it is in there.  As for the seatbelt that is the worst. Mine is on the left side so as I drive it just hurts so bad that I have to put my arm over it so that just the waist part is on correctly.  As for the lidocaine isn't that like the stuff they give you to put on your port site before you get the chemo.  I think I still have some. Well for all our sakes I hope we never have to see the site of a port ever again.",
      "MessageIndex": 62,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Hello, I just started taking the Aromisan this is now the second day. Tamoxin caused to much toe and calve cramping. Then it got real bad in my fingers. So they tried my on the arimdex that made my fingers curl up so bad and so painful I couldn't brush my teeth. They told me they will keep trying different ones until there is one that I can tolerate. I was diagnoised at 52 tha'ts how old my sister was when she died and now I am 54 feeling like my body is a 100. That must of been so scary to find out for you as well with a 2yr old. If you don't mind me asking how soon after your first treatment was the reacurrence? That is my bigest fear, just like my sister. She fought for 5 yrs and it still metasticied and she just gave up.  It is starting to sound more like an apademic.  So many woman and younger girls are getting breast Cancer.  I just don't understand.",
      "MessageIndex": 86,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "The Arimidex didn't give me heart burn but maybe that is because I have been on previcid daily. If you start hurting from muscle and bone pain you can be sure it is the Arimidex. I already have tried the Tamoxifen for 7 months and just this January after a full knee replacement (which had nothing to do with the breast cancer) I have been put on Arimidex so the odds of reoccuring breast cancer would be less since I show up in the high risk group. In almost 3 months my pain, cramps of the muscles , joints and bones have went to severe. Doctor told me to get off of the Arimidex for 3 wks to see if there is a change. So far it has been one week and I am still walking like a woman of 90 and the pain has not lesson yet (but then again it hasn't been 3wks). I don't know about thes drugs, they may help one thing but ruin and affect so much more. Depression sets in so much because I can't walk a block with out pain in my whole body. But we have to keep keeping on! So I am praying for all my WARRIOR SISTERS and those who didn't make it. There has to be a better way. Joint pain or not I will be walking in the Mother's Day Walk for us all ( Walking F.A.B (WALKING FOR ALL BOOBIES). God Bless you and I hope that those are the only side effects you will experience",
      "MessageIndex": 51,
      "PostDate": "11/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I guess they will never understand onless they have to deal with it personally. Not that I wish this on any woman.  I truely hope you can win this battle although we neve truely win completly. I can't believe you didn't have the support you needed.  That is just wrong on so many levels. I think people are crazy they don't know what they are talking about.  Sometimes their stupid remarks gets me very close to turning their lights out and tell them because of their life style they deserve that and tell them to get over it. Dr. don't know everything an all the money they raise for the Susan Coleman race or whatever the name is they still haven't found a cure.  I raise money but it is for the Y-Me because that has nothing to do with finding a cure but it did get me through tuff time. They helped me get all my bills paid 100% and a knee surger I had prior to the BC. free makeup, spas, massages, wigs (I couldn't wear),scarves, manicures, pedicures and a friendly person to talk with me when times got really tuff. They are all women matched up with you to talk with that had the same kind of cance you have.  When I walk I will be thinking of you.",
      "MessageIndex": 94,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "well in this journey we all seem to be walking, some have a positive attitude (which I say go for it) other's like me are angry, scared and hard to be positive(after being at my sister side and seen the painful death she had) and others so negative they wll never have a good day until they have left this earth. Like I said I will enjoy life like it is my last day on earth because the way this BC is attacking more and more women no one really knows. It's ok to be angry, happy, greatful, negative, scared or positive these are all feelings that go with the terrirtory.  We all face it with whatever is inside us but I have to wonder why is it happening more and more.  People say it's the way we eat or what is in our food now a days.  Other's say through the genes in our family.  Nope my sister and I are the first in a huge family on both sides.  What ever is causing this why haven't they found a cure after all these years? For God sake they were fast to come up with a protocal for aids.  Something has to be done can't believe with all the millions of dollars they raise for research we have nothing positve about a cure, treatment or meds that can really change the quality of life for a BC patient. Until then we will deal with the way we with whichever way get's us through.  To me you are all strong wonderful women cause you have come this far no matter what.",
      "MessageIndex": 95,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Wow I woul like to know what the autoimmune diseases are as well.  I am suppose to call my oncologist to see what they have decideded on as far as meds for 5yrs.  All I know is that my hands aren't cramping up anymore when I wake but the bottom of my feet hurt and I feel like the neoropathy is back in my legs. ",
      "MessageIndex": 55,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I am still laughing, know what you mean.  I did the same thing when it was time to get out it was impossible.  There were no rails or anything else to help me stand up.  Good thing my other half was in the basment. Or I would have had to wait till he got home.....LOL",
      "MessageIndex": 110,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Sorry I was addressing you.  I only asked to see if you had try other of the meds.  You are so right Tamoxifen gave me the worst cramps ever after 7 months and the others as you said the bone pain unbelievable. I watch my sister go through all this and she said she whish she would have stop the meds.  She past away fighting 5yrs with the meds and pain.  So after that I don't want to do that to myself. I was diagnoised 1yr after she past and on her birthday.",
      "MessageIndex": 114,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I sure hope it don't get any worst.  I work pretty far from where I live and driving there and back is really taking a toll on my body.  It gets more and more difficult to get out of the car and walk.  I have only started the Aromasin but my body hadn't stop wit the joint paint from the chemo and the arimidex.  I don't know if I want to do this anymore. What kind of life will I have if I can't hardly move or enjoy doing anything.  My job consist of me sitting in front of a computer all day. When I get up I hurt every where.  Some how I feel like thngs really aren't any better.  What to DO?",
      "MessageIndex": 79,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I understand sometimes the body has taken so much the strength just is there or enough to do what you have to do.",
      "MessageIndex": 130,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "That is exactly what I am talking about not looking back and no second guessing becasuse what happens is gonna happen no matter what. I to am glad for you and pray that we all continue to fight and win the battle. May God put his arms around us all and keep the cancer away.",
      "MessageIndex": 140,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "O.M.G that is exactly the way I feel and you hit it on the head. When I would say that people would tell me I was being negative. One of my sister's went so far as to say we brought this on ourselves for our way of living. WTF. is all I had to say. Unfourtantly I had a total hysteroctomy in Oct. of 2011.  The only thing I can say is that I had it done with the robot and that is the only thing that didn't hurt. I will never feel normal if anything I am angry ! No matter what I am always afraid of it (BC) coming back just like it has with so many others.  I would never want to do this all over again.  You made me feel a little better knowing I am not the only one that feels like we got screwed.",
      "MessageIndex": 91,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Oh trust me I my sister said when cancer is in your bones you will not it.  Her's went into her ribcage on the same side the BC was. She couldn't even cough it hurt so bad. The meds do make your bones hurt really bad but the bone cancer is a whole other pain. Then when they give you that infusion through an IV once a month you feel like a truck rain over you and it is bad.  That's how I feel no more drugs it's only a 30-40% to stop a reoccurance.  I don't think that's much of odds in favor of me not.",
      "MessageIndex": 105,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "Is the Arimidex the first one they gave you? 8 months is a long time to put up with what you have. Have you ever taken anything else like Tamoixifen? Did yor doctor say how long you would be on the Arimidex? I just got off the Arimidex this past Monday.  It made me itch all over and it started to make my hair fall out.  No I opt for my system to get rid of all these toxins they have put in my body.  The chances of reoccurrence is always going to be there with or with the meds.  I want my life back instead of feeling like I should be in a nursing home so I can get help up from the bed or chair.  I want to enjoy soaking in the tub and taking walks with my honey again. Cancer has taken why to much from me already.",
      "MessageIndex": 112,
      "PostDate": "28/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    },
    {
      "AuthorID": "susier",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/susier",
      "Content": "I'm sorry, I do know what metastatic means just never seen anyone use the word METS for short.  That is what happen with my sister it went into her rib cage on the same side she had the BC. She didn't have neither of her breast removes but by time they finish cutting her it sure look like they did.",
      "MessageIndex": 124,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2763,0.htm",
      "Title": "Side Effects of Arimidex After Almost 2 Years"
    }
  ]
}