{
  "AuthorID": "SuzieQ_1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SuzieQ_1",
  "Posts": [
    {
      "AuthorID": "SuzieQ_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SuzieQ_1",
      "Content": "    Hang in there.  I was on Tamoxifin for 2 & 1/2 years.  Ny oncologist then switched me to Aromasin because it was supposed to offer great results after taking Tamoxifin.  I had  pretty terrible bone and joint pain  from the Aromasin.  Then about six months into the Aromasin I  started with a headache  that was I was able to cope with some of the time even though it never went away.  By the 9th month the headaches were really pretty bad.  After a full year on Aromasin, my oncologist finally told me off it.  It took 8 weeks for the headache to go away.  During that 8 weeks, I didn't take any AI.  Now my doctor has started me on Femara.  I've only been on it one week with pain only in my feet and knees.  What an improvement!  My oncologist said not taking anything for the 8 weeks wouldn't hurt me.  I do trust him and am glad to be headache  and bone pain free!  My doctor says all AIs work the same way but don't always affect each woman the same way.  Work with your doctor until you find the one that causes the least side effects.  Good Luck!!",
      "MessageIndex": 4,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23711,0.htm",
      "Title": "reactions to femara"
    },
    {
      "AuthorID": "SuzieQ_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/SuzieQ_1",
      "Content": "    Well, you've asked the question that has been driving me crazy since I was diagnosed with BC in 2004.   My next door neighbor had just made it through a year of chemo and radiation for BC.   The older woman across the street died from it and a year after I was diagnosed with it, another friend living three houses away was diagnosed with BC.    Four of us  within 5 houses!    Is it the water?   Actually, we live in an area that has lots of  apple orchards among other  fruit farms.   There is lots of talk about the chemicals that are sprayed in orchards.  But I too feel I live with lots of stress,   took birth control pills in my late twenties,   and quit smoking about 30 years ago.  I have no history of cancer in my family in ANY form.   Could it be that all of the things?  Maybe living in the 40's, 50's & 60's is finally catching up withall of us.   It is something I think about often. I thought all of the previous answers were interesting since there were parts of each one that I could identify with as I look back over 60 years of  varying lifestyles.",
      "MessageIndex": 9,
      "PostDate": "13/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12213,0.htm",
      "Title": "What do you think may have caused your breast cancer?"
    }
  ]
}