{
  "AuthorID": "Teresa921",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
  "Posts": [
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "Hi Carolyn, I too had Estrogen and Progesterone positive breast cancer. However, I was told that Flax seed oil is the best for cancer patients. The diet I follow and recommend is from a website called: www.hacres.com. I have been on this since September when diagnosed and did have a lumpectomy (4 cm. cancer). I take no chemo or radiation and did not have lymph node disection. I am depending on God, diet and lifestyle changes to prevent recurrence, as the margins around the tumor were clear. I feel great and have a lot of energy. I hope the best for you. Teresa",
      "MessageIndex": 1,
      "PostDate": "12/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3944,0.htm",
      "Title": "Diet and Breast Cancer"
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "Hi Gary, I was diagnosed last Sept. with Hormone positive breast cancer. Against my doctor's advice, I chose not to have chemo or radiation or even lymph node removal. My doctor told me there was a 25% chance it would return in 2 years without the treatment. Well, that is a 75% chance in my favor! The cancer was 4 cm. and they said they had clear margins upon removal. I just had my 6 month check up and everything is going well. I made drastic changes in my diet and lifestyle. I follow the diet which can be found at: www.hacres.com. There is also a very good book by Anne Frohm (sp.?) called the \"The Cancer Battle Plan\". My best to you both. Teresa",
      "MessageIndex": 7,
      "PostDate": "23/06/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,5469,0.htm",
      "Title": "Lumpectomy With Raditaion? Yes or No?"
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "I, too believe that nutrition is the key to curing cancer.  As a breast cancer survivor, who has not gone the chemo/radiation route, I suppose I am basing my life on it.  My question is that I was told not to use soy, as my cancer is hormone fed, and soy feeds it in the same way.  I will check out the site you mentioned. ",
      "MessageIndex": 1,
      "PostDate": "13/02/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9565,0.htm",
      "Title": "I realize that I am of a different mindset, but........."
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "  On 3/12/2007 Angelfromabove wrote: for all of those who know someone with cancer or you yourselves have cancer... (((((BIG HUG ))))). I have researched alternative therapies for  cancer for the last few years and here is what i have found... 1. I highly suggest the book cure for cancers by dr.  hulda clark 2. Google and read up on the Dr. Budwig cancer diet.... this diet is amazing 3. Google and read up on vitamin b17 it has anti cancer properties 4. Google and read up on natural cellular defense ( cellular zeolite) lots and lots of testimonials from people cured of cancer 5. Google frequensea and read all of the testimonials about that as well i am by nooo means a doctor or anything like that ...ii have a dear friend whos father has cancer and i have been doing alot of research. also for those with cancer..... stop using deodorant, shampoo, hairspray, perfume, lubes, gels, creams, bathroom sprays,  etc...... USE ORGANIC..... my suggestions would be aubrey organics visit their website.. i am by no means affiliated with them. There are soo many chemicals in these products that they are feeding your cancer and making you sicker!! also sunscreen has 5 known toxins in it that promote cancer as well.... do not wear sunscreen it will give you cancer!!! also do not eat anything out of a microwave oven and check out the qlink . google it.. May God Bless you on this difficult journey!   Hi, I agree with your message....  Also check out www.hacres.com, they are also having amazing results.  They have testimonials also. It is the diet I am on.  I had breast cancer in 2005 and did not do the chemo or radiation the Dr. proposed, but I did radically change my lifestyle and diet.  Keep up the good work!   Teresa",
      "MessageIndex": 1,
      "PostDate": "15/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10300,0.htm",
      "Title": "CANCER CURE... PLEASE READ!"
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "  On 5/20/2007 Roz59 wrote: I thought this might be a good discussion to see how you all feel as to what may have caused your breast cancer. I, for one, think 99% that it was HRT that caused mine. I was on it for 10 years and I was given the implant that was inserted into my bum (with a couple of stitches) every 6 months. Not just one dose either, I had TWO!!! I could actually feel my body changing within 24 hours of having the implant......I have no cancer my my family, ate right, exercised, had 2 kids when reasonably young, breastfed and did everything do stay fit......yet the big C got me. Has anyone else got views of how they got cancer? I also took Premarin for a short time, and I did not have a very good diet.  I ate lots of sweets and did not take care of my health.  In 2003 I fell and injured my breast ( found out later I had broken the rib under it) and in 2005 I developed a lump in the exact location of the injury and had pain for about three months.  I went to my Dr. and she said it didn't move like a cancer, and after going off all caffeine, the pain subsided, so I didn't do anything.  Four months later I had an ultrasound which showed a mass and in one week a core biopsy which came back cancer.  I had a lumpectomy and it was 4 cm. with clear margins.  I elected not to have chemo or radiation or lymph node removal.  I changed my diet and lifestyle drastically.  I feel great, and my last mammogram was clear. Also, lots of prayer really helps.",
      "MessageIndex": 4,
      "PostDate": "01/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12213,0.htm",
      "Title": "What do you think may have caused your breast cancer?"
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "  On 3/27/2007 Michel wrote: I need help!!!! Any info where i can buy concentrated mineral drops in Riyadh, k.s.a. It is also referred as ionic mineral drops sourced from Lake Utah, Nevada USA.  Help pls. I bought some from a company called Ultimate Living.  They are a very reputable company.  I believe they are from the Great Salt Lake, with the sodium removed.    Just Google Ultimate Living and it should pull up. Teresa",
      "MessageIndex": 1,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10737,0.htm",
      "Title": "ionic mineral drops"
    },
    {
      "AuthorID": "Teresa921",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa921",
      "Content": "Hi Duomi, I had a lumpectomy 1 year ago and decided against chemo or radiation or lymph node removal. I started eating a mostly raw vegetable and fruit, nuts and whole grain diet with quite a few supplements, esp. Vit D and CoQ10 and a green Barley powder. For a while I juiced 50 lbs of carrots a week. I feel great and am going to a Homeopathic doctor who does vibrational medicine. I go for my first Mammogram tomorrow, against my Homeopathic Dr's wishes, but my breast surgeon has ordered it if I want to continue to see her. A site you may find helpful is www.hacres.com. They have seen many good results with diet alone. Keep researching and praying, prayer works! God Bless, Teresa",
      "MessageIndex": 7,
      "PostDate": "19/11/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,317,0.htm",
      "Title": "I stopped my chemotherapy"
    }
  ]
}