{
  "AuthorID": "Teresa_Marie",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
  "Posts": [
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Vee, I had accupunture with all my chemo treatments and it helped immensely with the nausea.  I was not nausious at all during any of my treatments.  God bless and good luck to your friiend. Teresa",
      "MessageIndex": 1,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40416,0.htm",
      "Title": "Nausea and vomiting on the first day?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I had a DIEP in Los Angeles at Little Company of Mary Hospital.  I have a HMO Plus which means I can use either the PPO side or the HMO side of my insurance.  My doctor did a fabulous job and I could not be happier.  It has been 2 years since my surgery and it still looks great and I have not had any problems.  If anyone is interested in interviewing my doctor in Torrance, CA let me know and I can get you his information.  I am a Breastlink patient and Breastlink is one of the top 10 breast cancer centers in the country and they only refer out to the best. Good luck to you all and whatever you decide, you will be glad you had the DIEP. Teresa",
      "MessageIndex": 3,
      "PostDate": "04/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36619,0.htm",
      "Title": "Diep surgery, NOLA has anyone had the surgery and what was your out of pocket fees?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Pat Z, I too am very sensitive to drugs and my first chemo treatment was the worst.  I could not function at all, my eyes were scrambled, I could not write, I was a mess.  It felt like I was hit by a semi (whatever that feel like).  I had a very hard time with the steroids.  I did accupuncture with my chemo treatmens and that was a God send.  My oncologist told me he wished more of his patients would consider accupuncture.  It helpled with the nausea, I was never sick once.  My doctor and I decided that I could cut back on the steroids, I think because the accupuncture was working so well with me.  Steroids are to help with the nausea and I was having accupuncture to help with that.  I have to tell you that my first chemo was the worst and after that it got better.  I had 4 cycles of cytoxin and adrimycin, 4 cycles of taxotere, a mastectomy and then 4 cycles of gemsar and cysplatnum.  I would visualize the chemo eating up the cancer cells and just go with the flow,  your body sets up a cycle of good days and bad days and is pretty consistant. I knew what days would be my bad days after chemo and just gave in to it,  I lived in bed on those days and with my good days I coped as best I could.  I know that 7 more cycles seems like an eternity but believe me, you will get through, it is a tough fight but you are strong and can do it.  The cycles do get a bit better as your body gets used to the drugs.  Adrimycin and cytoxin were the worst, taxotere was better and I could actually function with the gemsar and cysplatnum,  I could actually drive myslef to chemo with the last 2 drugs.  One suggestion I wish my dr. pushed, was if you have taxotere and your tear ducts plug, go have the tubes put in, it will save you much misery in the long run.  I did not have the tubes put in and am paying for it now, that is my strongest advise. I wish you the best and will be praying for you during your journey to good health. Teresa",
      "MessageIndex": 2,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37364,0.htm",
      "Title": "How can I handle Chemo better?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I did not have a TRAM Flap, I had a DIEP flap and I had the same question for my surgeon.  He said that they could take fat and tissue from another doner locatoin.  I realize you are receiving this after your surgery and I hope you had a successful surgery with a speedy recovery.  Best of luck and good health to you Teresa",
      "MessageIndex": 1,
      "PostDate": "07/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15376,0.htm",
      "Title": "TRAM Flap"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hello, Cancerbites is right.  But first of all if you have fribroids, run don't walk to that mammogram. I started with fibroids that developed calcium deposits that developed into a tumor.  Who cares if you get stretch marks, I have two very thin daughters who have strethc marks on ther thighs from growing.  I was also very thin growing up and developed strech marks on my small breasts and thighs, THEY ARE FROM GROWING.  Please, if you have fibroyis, do not give up on the mammograms.  I was very vigilant with my mammos, went every 6 months because they were monitoring my calcium deposits.  I missed almost 2 years due to lack of insurance but as soon as I got insurance again I ran to my next mammo and this is when they found my cancer.  My tumor was now the size of my fibroid, over 6 cm.  Yes it pinches to have a mammo, so you can deal with a few seconds of pinching or (God forbid) possibly cancer.  Continue to have the fibroid monitored, maybe ask for a sonogram just for good measure.   Best of luck to you, Teresa",
      "MessageIndex": 2,
      "PostDate": "29/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30600,0.htm",
      "Title": "Do mammograms cause stretch marks?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Marcy, I had a skin sparing mastectomy.  No tissue expanders are used with a DIEP because they use your own tissue and fat harvested from your abdomen.  I had chemo first then my mastectomy and then radiation.  Six months after I finished radiation I had my DIEP.  Hope this answers your questions.  Teresa",
      "MessageIndex": 3,
      "PostDate": "01/01/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42543,0.htm",
      "Title": "DEIP Flap after radiation"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "If your insurance will let you, I had accupucture treatments along with the chemo and it helped to eleviate the symtoms.  My oncologist said he wished more of his patients had accupucture treatments along with chemo.  I do reccomend letting anyone and everyone who wants to help, help!  Not only does it ease the stress on you, but it helps your loved one feel better when they are helping.  Also, I did not fight the effects of chemo, I went with the flow knowing that the medicine was doing it's job.  I used visual immagery, seeing the chemo eat up all the cancer, to help me relax and let the drugs do their job.  On your good days, don't over do it, let your loved one help.  I know it's scarry but you will get through and you will survive!  Always laugh at yourself because some pretty unusual things will happen and the best you can do is just laugh at it.  \"Just a spoon full of sugar helps the medicine go down\"  Best wishes for a successful and uneventful treatment. Teresa",
      "MessageIndex": 7,
      "PostDate": "14/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29887,0.htm",
      "Title": "chemo"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I had a DIEP after chemo and radiation 2 years ago and I could not be any more happy.  My results were beautiful and I do not have to have any more surgeries unlike implants which have to be replaced periodically.  The DIEP grows with you (meaning when you lose or gain weight) and always looks natural.  My surgeon is in LA, I'm not sure where you are.  If you would like to know more about my DIEP please do not hesitate to contact me and I will be happy to talk to you about in more depth.  Best of luck with your decision. Teresa",
      "MessageIndex": 1,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,42543,0.htm",
      "Title": "DEIP Flap after radiation"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "  On 5/15/2008 Mally0404 wrote: Hello to all: I have just completed treatments for breast cancer... DX June 19, 2007, removal of lump July 30, 2007 began chemo Aug. 30, 2007 and ended Dec 13, 2007, had radiation 5 weeks ended February 27, 2008.and also hormonal therapy since Dec. 2007..  I am now cancer free Thank God!!!  I would appreciate any answers as I am beginning to worry as my hair is not growing as quickly as I would like it to, still bald spot on the back of my head, also having problems with numbness at tips of all fingers and thumb as well as toes and having major problems with my nails, discoloration and even lost 2 toe nails... I know some of these side effects could happen but what I find weird is that everything began after my chemo, hair did not begin to grow until end February, numbness in fingers and toes in January, and nails in February also... any response would be greatly appreciated.  Regards    Mal Hi Mal, I completed all my chemo and radiation 2 years ago, I still have numbness in my fingertips and toes.  I have talked to a neurologist since and he told me that if I had not regained any feeling at this point there is a strong chance it will never come back.  I have gotten used to it and can now go bare foot again.  I lost all my finger nails and they have grown back nicely.  I didn't believe that they would becuase they looked so ugly and jagged.  Your finger nails will grow back.  I still have problems with my toe nails though.  I just keep them painted because they are ugly.  As for my hair, I was lucky enough to not grow back my underarm hair, I am still waiting for my eye brows (they are not growing back) and my hair is very thin now but it is back.  I think everyone has different experiences with this and that there is no hard and fast answer.  Just be glad to be alive everyday and that you can function.  So many of our sisters have it worse off than us and I remind myself of that everyday when I start to complain about my eyebrows or thin hair.  The reason some of your side effects happened after chemo is because even though you have finished your treatments, the chemo is still in your system working and it takes a while for it to dissipate, just be patient and know that the drugs are still working to kill the cancer.  Talk to your oncologist about your concerns and I sure he/she will have an answer.  Best of luck to you and just keep a great sense of humor, it makes going through this darn disease easier. Teresa  ",
      "MessageIndex": 1,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24037,0.htm",
      "Title": "Curious and impatient"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "As a patient of Dr. Granzow, I was very pleased to see him quoted in the front page article on reconstructive surgery.  I can attest to his surgical skills as I am reminded of his talent every time I visit my oncologist and surgical oncologist.  They are very impressed with his work and always take a few extra minutes to admire it.  It makes me laugh every time and not to mention feeling like a flasher, (I’m asking for beads on my next visits to my Drs.)  If you live in the LA area and need his information, please send me a private note and I will be happy to send you his contact information.  He truly is gifted and cares very much for the health and well being of his patients.",
      "MessageIndex": 0,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,38953,0.htm",
      "Title": "Dr. Granzow"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I had a DEIP on my left side 2 years ago, so now I have one live and one memorex, it's a joke from an old commercial, sorry.  But anyway, when I had my nipple done the first time it fell off and the second time it flattened out and I have one of the best plastic surgeons in my area, he's great and I love his work.  If it were me, knowing what I know now, I would just have them tattood on, that way you can go without a bra and not have your nipples showing through.  One woman from my \"club chemo\" has implants and never wears a bra.  That's my vote.  Good luck with your decision :) Teresa",
      "MessageIndex": 8,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40589,0.htm",
      "Title": "Nipple reconstruction...to do..or not to do???"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I have been on Aromasin for almost 4 years now (4 in January) and this past year has been the best.  I do have stiffness in the morning but the pain has diminished.  I suffer from neuropathy in hands and feet but that has gotten better over the years as well.  Check out the Naturopath as Trehouse suggests and see what works best for you.  I stick with the drugs because I'm afraid of re-occurance.  I was stage 3C with Lobular which can show up in the other breast later on. Actually, Tomoxaifin does let some hormones in, it just changes the cell structure so that the body reads it differently.  Aromasin completely stops any hormones from entering the body.  Check out NBCC for information on how those 2 drugs work.  I learned that at a workshop I went to through NBCC.  Good luck to you in either decision and pray for the day when we find a cure. Teresa",
      "MessageIndex": 2,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41216,0.htm",
      "Title": "selling and joint pain"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Tata, I started out with Arimidex and ended up with osteoporosis, my doc switched me to Aromasin and I now have osteopena.  I had joint pain with both.  I am 2.5 years out and experience no joint pain for the last 4 or 5 months, so it may eventually go away.  I was stage 3 with extra chemo and extra radiation.  The only pain I experience now is my constant back pain.  Try taking Glucosamine Chondroitin, it might help.  Good luck to you in your search for pain free meds.",
      "MessageIndex": 5,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,26884,0.htm",
      "Title": "positive feedback on aromasin"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I just found this site.  I am a one year survivor.  After Chemo I started on Arimidex and I went from osteopena to osteoporosis and now have arthritis in my knees and back.  My Dr. switched me to Aromasin,  I have a bone density next month so we will see how I am doing.  I also take Flax seed and Vit. E and B-12.  I was taking glucosamine and could not see any progress.  I also was taking Advil 3x a day and still felt the same.  I take a pillaties class 3x a week and have gotten a lot stronger but still am in pain.  My pain goes away when I start to move but if I sit or ride in a car it for an extended period it's hard for me to stand.  I'm replying to your message because I had my chemo in Long Beach and was wondering if we had the same Dr. Take care Teresa",
      "MessageIndex": 25,
      "PostDate": "30/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I just signed the petition to have this very important bill passed.  What a great site, I did not know it existed.  Lots of information and great pictures of all the brave women and their stories.  I am very lucky I got to stay over night after my mastectomy, but I like to stay as short as I can in hospitals, I call myself a \"bolter\".  Hope everyone has a chance to check out the site and sign the petition : ) !",
      "MessageIndex": 1,
      "PostDate": "19/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16263,0.htm",
      "Title": "Congressional Bill: Mastectomy Recovery Time"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "If you live in the LA area, I have a great Dr.  I had a DIEP and am so glad I did, my outcome is great and I look normal.  My friend had a DIEP at UCLA.  Her docs were great of course, it's UCLA, but compairng her surgery to mine, my doc beats her doc hands down.  My doc is also a professor at UCLA Harbor.  Anyway, my doc better prepared me for recovery than my friend.  I gave her all my pre and post op information and she was very thankful.  Her doc did not give her any of this information and she now refers others to my doc.  When other docs see my work, they want to know who did the work and where is his office.  Not only is this surgeon brilliant, he has a great bedside manner and is genuinly interested in what his patients have to say and takes it to heart.  You can send me a private message if you are interested I will give you his name and number.  I don't believe we are allowed to do that on the general message board.  Good luck to you on a speedy recovery. Teresa",
      "MessageIndex": 1,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28510,0.htm",
      "Title": "DIEP or SGAP surgery"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Fighter, When I was going through my battle, my radiation oncologist's billing department gave me information for a prgram that helps with bills.  I contacted them and they helped with my bills.  Along the way I have found a few other organizations that also help.  I am happy to forward you all my information. Patient Advocate Foundation (Co-Pay Relief) 700 Thimble Shoals Blvd., Suite 200 Newport News, VA  23606 866-512-3861 or 800-532-5274 www.patientadvocate.org They provide financial assistance for Breast Cancer, Kidney Cancer, Lung Cancer, Prostate Cancer, Sarcoma, and Macular Degeneration.   Sensational In Survival 277 Alexander St., Suite 208 Rochester, NY  14607 585-586-5680, fax 585-586-7299 www.sensationalinsurvival.org They help breast cancer patients with rent/mortgage, utility expenses, vehicle payments, childcare, groceries, pharmacy co-pays, uncovered prosthesis/medical clothing, wigs, transportation.   CancerCare 275 Seventh Avenue, 22nd Floor New York, NY  10001 800-813-4673, fax 212-712-8495 www.cancercare.org  email info@cancercare.org This organization helps with financial assistance for any type of cancer.   The Breast Cancer Society 6859 E. Rembrant Ave., Suite 128 Mesa, AZ  85212 480-284-4041 fax 480-659-9807 www.breastcancersociety.org email support@breastcancersociety.org Hope these organizations can help you or any one else that need a financial helping hand.  I am a 3 year survivor of stage 3 cancer and I always make it a point to make a donation to any of these organizations because without donations thay can not help those in need. God bless you and keep us posted with your progress. Teresa",
      "MessageIndex": 3,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36376,0.htm",
      "Title": "Financial Assistance I NEED HELP!!!"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Sunshine13, If your oncologist says your hair will fall, it will.  I had my hair cut short after my first chemo treatment.  I personally took my treatments with a large dose of humor.  After you have your first treatment you are able to pull large chunks of hair out, it was my first magic trick and I used it often.  I had a lot of fun with that trick, next your scalp hurts like you have had your hair up in a pony tail for months, this is when you know its time to either buzz it off or I just went in the shower and \"washed that hair right off my head\".  Most women have a pitty party and I very well understand why.  I did not cry though, I was ready to get rid of my aching hair and that ment I moved on to the next step of my adventure.  I did not wear wigs, I wore hats.  The day I lost my hair I tried to tie a scarf on but my head was too slick, I wanted Johnny Depp to come and tie a pirate scarf on my head but he did not answer my call, oh well.  Wearing a scarf or hat is like wearing a handycap sign.  Strangers go out of their way to help you.  There really are a lot of nice people out in the world.  Take advantage of their kindness, they truly want to help and you should let them.  This was the biggest lesson I had to learn in this adventure, you have to let people help you so you can heal faster.  Take your treatments in stride and just remember that the chemo is killing your cancer and not you.  Just relax and let the medicine do it's job.  I was terrified at my first treatment because I did not know what to expect but you will do just fine and if your insurance allows accupuncture try it, it was the only thing that saved me from the side effects, but everyone is different.  I was 45 when I first diagnosed and I am not quite 2 years out.  I had stage 3 invasive lobular cancer.  I had chemo first to shrink my tumor then a mastectomy, then more chemo because there was still some cancer, then radiation and finally reconstructive surgery.  I had a DIEP flap and am very please with the results.  My oncologist specializes in breast cancer so when I went to club chemo there was always a group of women having chemo cocktails, hydration chasers or herceptin and I learned so much from these women, my last day of chemo was bitter sweet because I would not see my new friends again, but I was now in the healing stage. I hope everything goes smoothly for you and let me know how you are doing.  Good luck to and God bless you, Teresa ",
      "MessageIndex": 2,
      "PostDate": "13/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17052,0.htm",
      "Title": "Hair Loss"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Red 51, depending on you, there can be some liposuction.  My second phase was done as an out-patient procedure and it was fine.  I had my nipple done in my surgeons office without any numbing because there is no feeling in your breast anyway.  If you are using tissue from another source on your body then yes you would have to be put out.  Your plastic surgeon should be able to explain to you exactly what she/he is going to do.  Good luck and enjoy!",
      "MessageIndex": 5,
      "PostDate": "25/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40306,0.htm",
      "Title": "DIEP flap Second surgery phase two"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I had a DIEP in '07, I think what you have is scar tissue and you need to massage it to soften it.  It hurts to massage it but it won't hurt it.  The pain if from breaking up the scar tissue.  I had great success with my DIEP also and would do it again if I had too.  I had radition which canceled me out for implants.  Best of luck to you and I'm sure you will love your reconstruction. Teresa",
      "MessageIndex": 1,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37028,0.htm",
      "Title": "DIEP reconstruction after radical mastectomy"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hello Phillip, I just want to tell let you know about my reconstructive surgery.  I too had chemo and radiation.  Because of the radiation, I did not qualify for implants (which I knew I did not want in the first place).  I had a DIEP free-flap, which is different from the TRAM free flap.  The DIEP does not take the muscle, they only use tissue and fat.  The TRAM free-flap uses muscle, which has it's own complications.  I am very very pleased with my results and would recommend a DIEP over implants to anyone who has the availability of a qualified surgeon to do the proceedure.  I also had a friend who had a DIEP at UCLA.  Her results were completely different from mine.  I am so thankful that I went to my surgeon and not UCLA.  The results are like night and day.  My surgeon is also a professor at UCLA but has a private practice. Like the previous response above, do your research and ask a lot of questions.  Ask to speak to patients who have had the proceedure, I did this, it not only will put your wife at ease but it will help her feel more confident when it comes time for the surgery.  Best of luck to both you and your wife. Teresa ",
      "MessageIndex": 4,
      "PostDate": "23/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37814,0.htm",
      "Title": "Breast Reconstruction Options"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "To answer your question, I believe they always make the breast a little big so that they have room to go back and \"sculp\" the breast to what they want.  Yes this can involve liposuction in some cases.  I had my DIEP 2 years ago and could not be any happier.  I love my new breast and you would never be able to tell the difference just by looking at me.  I have not had any problems and new breast feels very natural.  The recovery time is about the same but a lot less involved and is done as an out patient proceedure. I had my surgeon do extra lipo on another part of my body while I was there.  My surgeon constructed my nipples in his office a few weeks later after the swelling went down.  There is no feeling in the area so there was no need to use anesthesia and I watched him perform the proceedure. Good luck to you and hope you enjoy your new breast(s). Teresa ",
      "MessageIndex": 1,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40306,0.htm",
      "Title": "DIEP flap Second surgery phase two"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "  On 9/25/2008 abrironwoo1 wrote: Hi, I read you story this morning and I have to tell you something that may help your wife.  There is a treatment called NAET. It is not just for cancer but all disease.  I just learned this technique 5 months ago and am treating my sister who has metastisized breast cancer.  This treatment is accupressure and kinesiology.  It can clear the side affects of chemo and may clear the cancer all together.   I am having good results.  Search the internet about NAET and read the testimonials.  The practitionaer who helped me ( I had many health problems like celiac and RA symptoms and migraines) has had good results with cancer patients and has cleared tumors of cancer.  You don't have to suffer the affects of cancer or anything else when there is a treatment that can help.  Do the research and find a good practitioner. My heart goes out to you and your family,   Amy I would just like to respond to your suggestion of using NAET to \"cure\" cancer.  I used NAET throughout my chemo and radiaton.  What cured my cancer was my chemo treatments and radiation.  I highly do not recommend using NAET alone to \"cure\" cancer.  What was good about the NAET is that it did ease the chemo side effects.  I was stage III with an aggressive cancer and I am still a high risk candidate for reoccurring cancer, I am 2-1/2 years out and doing great.  I was using NAET for allergies before I was diagnosed with cancer and upon my diagnosis, my accupucturist suggested I see a person who could \"cure\" my cancer.  I went to see this person just out of curiosity.  This person used a diving rod and the medical diagrams to tell me all my ailments.  I did not say anything and then this person asked me why I was there and I told him I was just diagnosed with BC and he waved his magic wand again and said Yes I see that you have cancer.  DUH, I just told you had cancer.  Anyway, my accupucturist suggested that I strictly use NAET to cure my cancer.  I did not.  I feel that the combination of eastern and western medicine in unison is great.  The western \"cures\" the cancner while the eastern releaves the side effects.  Thank you for listening to my view on the use of strictly using NAET to \"cure\" cancer and best of luck to you and your beautiful family.  Going through cancer is a beautiful lesson in life.  You learn that each day is a gift.  Teresa  ",
      "MessageIndex": 6,
      "PostDate": "25/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,28586,0.htm",
      "Title": "Metastatic or not?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "In response to your question, yes, I had a DIEP after 38 rounds of radiation.  Because of the radiation I was not a candidate for implants.  The radiated skin is not used, they use the skin and fat from your stomach area so there is no need to worry.  I had wonderful results and would do it again.  Good luck with your surgery and if you have any questions, please do not hesitate to contact me and I will be happy to answer any questions you may have. Teresa",
      "MessageIndex": 4,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41394,0.htm",
      "Title": "DIEP FLAP"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I too had a DIEP in '07.  I was and still am small breasted.  After the first surgery I was so happy to have at least 1 larger breast, but after the second surgery they did bring it back down to normal size.  If you want smaller breasts bring that up with your surgeon and I'm sure they can accomodate your wishes.  I had my DIEP in the Los Angeles area with Dr. Granzow and I could not be any happier.  These young doctors are brilliant and so talented. My surgery was 10 hours (I only had one done) and I was in the hospital for 5 days.  The second phase, if I remember right, is out patient and you get the damn drains again but it is much easier than the first surgery. No one can tell I has surgery and the scars fade in about a year.  I wish I had a double so both sides have the same consistancy.  Anyway I am just so happy to be hear and look normal that the rest does not matter.  Best of luck to you and enjoy the new you. Teresa ",
      "MessageIndex": 1,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41394,0.htm",
      "Title": "DIEP FLAP"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi, I have had both cisplatin and gemzar for breast cancer.  I was diagnosed at stage 3 and after my mastectomy they found more cancer and started me immediately on cisplatin and gemzar.  I know everyone reacts differently to chemo, but these two are the only ones where I was able to function.  When I had the ACT I could not function.  I was unsure how I would react to gemzar and cisplatin because I developed every strange side effect possible with the ACT.  With gemzar and cisplatin, I was able to drive myself to my treatments which was a great relief.  I understand that men react differently than women do on these two chemo.  I am hopful that your daughter will do fine with this protocal and that it will beat her cancer.  My prayers and thoughts are with you and your daughter. Take care,  Teresa ",
      "MessageIndex": 2,
      "PostDate": "11/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30920,0.htm",
      "Title": "Has anyone taken carboplatin and gemzar?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "All I can say is Hooray for your sister!  My oncologist has a news letter and he just wrote about metastatic BC. He said, and I quote \"I am telling women with metastic disease that they should consider themselves living with a chronic disease that will require appropriate treatment rather than a 'terminal' disease.  This is very good news and I am so happy to hear such optimistic news.  He also goes on to say \"that the most siginicant thing they can do to impact their breast cancer risk is to do aerobic exercise 5 hours per week and reduce their caloric intake from fat to 20% of thie daily caloric intake.\"  I think eating properly and getting in that aerobic exercise is still part of the battle against BC.  I don't mind the exercise but I am having a hard time giving up my chocolate!  Best wishes to your sister and my she live a long and healthy life. Teresa",
      "MessageIndex": 4,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23510,0.htm",
      "Title": "Survival.. confused about prognosis"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I have been on Arimidex for about 1 year now.  Lately I have gained about 15 lbs. in less than 6 months.  I understand that it is the medication causing the weight gain.  I would like to know if anyone has seen a nutritionist or has a good diet to keep the weight down.  I do pilaties 3x a week and have started back walking, this also helps to reduce the joint pain that this medication causes. Thanks for any information Teresa",
      "MessageIndex": 0,
      "PostDate": "11/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16081,0.htm",
      "Title": "Weight gain with Arimidex"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "  On 4/28/2008 sweet5720 wrote: My mother was diagnosed with Stage III breast cancer in December of 2007.  She has gone through 2 different sets of chemo treatment, just had the masectomy and is starting chemo again.  She has great doctors but I am just confused on what life expectancy of someone diagnosed with what she has is.  From what I've read about the different stages, she does not completely fall into stage 3.  She did have a very large tumor, 7 cm I believe.  It had spread to 3 lymph nodes, but not to anywhere else in her body.  When they removed the tumor the outside of it texted negative for cancer, which means they removed all of the cancerous tissue successfully.  The doctors don't offer much information other than when her next appointment is (and I know they can't predict anything) and my mother is terrified to ask questions because she's scared of what the answers will be.  I am just looking for anyone who can offer me any opinion about this.  I know it's just an opinion, but I am desperate for someone to tell me something about what she is going through and what the final outcome may be.  I am looking for any information or maybe someone with a similiar diagnosis.  I keep thinking that she has to make it through this because they removed all of the tumor, it hasn't spread and it was only in 3 lymph nodes.  Thank you. I was diagnosed with Stage III lobular BC in '05.  My tumor was over 6cm.  I had chemo first to shrink the tumor, a mastectomy, more chemo (they found more cancer) and 36 rounds of radiation.  I had 2 positive nodes before I started chemo and 2 more positive nodes removed at my mastectomy.  My Drs. tell me they do not know how many nodes I lost altogether because the chemo discintegrated a lot of them (this is good).  My oncologist and radiation oncologist both give me a high survival rate (only 20% chance of reocurrance).  I take my Aromisin every day and am very optimistic about my survial rate.  I will always have that little nagging reminder in the back of my mind, I acknowledge it and move on.  I am very positive and live a very happy life.  Being optimistic and having a great outlook on life really make a huge difference.  Your mom's best allies are her Drs.  Please tell her not to be afraid to ask questions, I'm sure they will alleviate her anxiety by voicing her concerns. I wish your mom a long and happy life. Teresa",
      "MessageIndex": 2,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,23510,0.htm",
      "Title": "Survival.. confused about prognosis"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I had a unilateral mastectomy with DIEP Flap 2 years ago and would do it all over again.  The breast expands and contracts naturally with weight gain or loss and always looks natural.  As stated before, it is major surgery (mine was 10 hrs.) but it was the best decision.  What more could a woman want, a tummy tuck and new boob and have insurance cover it :).  I did not qualify for implants due to radiation and I was concerned about having a foreign object in my body that had to be replaced later on.  My surgeon was Dr. Granzow in LA.  Good luck in your decision and your recovery.",
      "MessageIndex": 4,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41566,0.htm",
      "Title": "implants or flap reconstruction"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Kah49, I was stage III, had chemo, mastectomy, more chemo and radiation with a couple extra rounds thrown in for good measure, all in that order.  I was definately not a candidate for implants.  I had a DIEP flap instead of the TRAM flap.  The DIEP does not take the abdominal muscle, they just use the fat and tissue to build the new breast.  Yes it was a long surgery but I would do it all over again, I could not be happier.  With the implants you have to have them replaced every so often, with a DIEP you have the surgery and you are done!  Since they do not take the abdominal muscles in the DIEP, it is a much easier recovery.  I also have had a hystorectomy and would have the DIEP over the hystorectomy any day :~).  With the DIEP you get a tummy tuck and a new boob, what more could a woman want?  When I was going through club chemo, I learned so much from the other women, the one thing that really sealed the deal for me was when one woman told me that her implants were the most uncomfortable thing she has ever done.  She said they sit on her chest like 2 big hard rocks, just something to think about.  I would throughly research and ask other women who have had implants, ask your surgeon if you can talk to other women who have had the procedure you are leaning towards.  If you are only having one side done, just think what the other side will look like, you will have one perky breast and one saggy breast.  The DIEP breast expands and contracts naturally as your weight fluxuates and it always looks natural and it is soft, not hard like implants.  It feels like it is a part of me and not an add on. I hope my experience helped and best of luck to you on your decision. Teresa",
      "MessageIndex": 1,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37271,0.htm",
      "Title": "breast reconstruction"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I am 47 years old, and like you, my first year after chemo and radiation I did not gain any weight.  I am not quite to my second year but I have also gained 20 lbs.  I also am chemo induced menopausal and am taking Aromasin.  I found a web site that deals with menopause, it is Woman To Woman and also look into Dr. Diana Schwarzbein's program.  You can google both sites and contact them that way.  Woman to Woman has a nurse that calls you to make sure things are going ok.  The main Dr. at this facility is on Sabbatical with Dr. Susan Love so they know quite a bit about Breast Cancer.  If you order the supplement it does come with estrogen cream.  If you are estrogen positive they highly recommend you do not use the cream.  I took it out of the box with \"steel gloves\".  So far I have not lost any weight but I have not gained any weight either.  I also practice Palates 3 times a week and do a Kundalini Yoga dvd on the other days.  You can get the dvd through raviana.com.  I also use my eliptical for cardio.  I also have osteoporosis and arthritis \"fall out\" from all my treatments.  My infustion nurse told me that the Aromasin helps with the weight gain because we have no hormones to help balance out our systems.  Check into my sources and hopefully they will help.  Good luck to you and congratulations on being cancer free! Teresa",
      "MessageIndex": 3,
      "PostDate": "12/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16896,0.htm",
      "Title": "Weight Gain"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "After my radiation therapy, mastectomy, reconstructive surgery etc.  The person who tattooed my areola, tattooed over my radiation tattoos with brown to make them look like freckles or beauty marks.  No one would even know that there is blue ink underneath and even if they did, so what, I'm still here and who cares what the other person thinks.  I have a friend who is very sensitive as well.  She had a major reaction to the placement marker left in for her lumpectomy.  She had no problem with the tattoos for radiation.  Best of luck to you and a positive attitude goes a long long way. Teresa",
      "MessageIndex": 6,
      "PostDate": "12/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24745,0.htm",
      "Title": "Markings for radiation therapy"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Belusa, Another couple of great books for your friend are \"Breast Cancer Survival Manual\" and \"Take Charge of Your Breast Cancer, A guide to getting the best possible treatment.\"  Both are by Dr. John Link.  Your friends should stay informed as to her stage, type, etc.  Knowledge is power and the more she knows and understands her disease the better prepared she will be to conquer it.  Also, laughter is the best medicine, there will be many things she will just have to sit back and laugh at, it eases the worry.  More and more B/C patients are surviving now, it is no longer a death sentence.  I also had accupuncture along with my chemo to ease the side effects and it does work.  Another member on this site has some great information.  Her name is Trehouse and I'm sure she will respond to your post as well.  She has a great web site with a lot of helpful information.  Also, have your friend ask her oncologist lots and lots of questions.  Dr. Links book has suggestions on things to ask.  I am actually a patient of Dr. Weisman who is Dr. Links partner and their B/C practice is awsome.  These Drs. teach their patients about their disease and keep not only themselves up to date on the latest and greatest, but their patients as well.  Dr. Susan Love's book is great too.  You friend should read all these books.  Best of luck to both you and friend and keep a positive attitude with lots of laughter. Teresa",
      "MessageIndex": 3,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32396,0.htm",
      "Title": "Survivors"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi BetteAnn, I am 3 years out and still have mild neuropathy in hands and feet.  I had Adramycin, Cytoxan, Taxatara, Cisplatinum and Gemsar.  I must say that the neuropathy has gotten better, but I feel that I will have this till the end.  I take B-12 and Vit. E.  After reading through this topic, I am going to get some B-6 and L-Glutamine and see how that works.  Best of luck to you and may we all live to be old and wise. Teresa",
      "MessageIndex": 24,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Chrishoida, I too was 45 when I was diagnosed with B/C.  I had chemo first to shrink my 6 cm tumor, then I had a mastectomy, then more chemo because they found more cancer and then radiation.  After finishing my 1st round of chemo I was staged at 3a, before chemo I was probably stage 3c.  I am not afraid of cancer coming back.  I am 3 years out and I am confident that I am cancer free.  I don't think I was ever afraid because I knew I was not going to die.  I did not fight the process, I let the process take it's course.  One thing I did that really helped with the chemo side effects was having accupuncture along with the chemo.  I laughted a lot at myself and this helped. I was bald for halloween and had a great time with it, I used it to my advantage.  Visualization also works well.  If you have faith in your Dr. and the process you will come out the other side in great shape.  I wish you the best and have faith that you will be ok.  Let me know how you are doing. Teresa",
      "MessageIndex": 3,
      "PostDate": "29/01/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,32650,0.htm",
      "Title": "scared"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "Hi Lucy, I was wondering the same thing.  If you go to her blog sight I think you can get some information.  www.motherearthtreasurechest.blogspot.com After reading it, I think she is ok. Take care Teresa",
      "MessageIndex": 1,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,37631,0.htm",
      "Title": "Hi Tre, How are you?"
    },
    {
      "AuthorID": "Teresa_Marie",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Teresa_Marie",
      "Content": "I am almost 2 years out and I still have ringing in my ears.  Sometimes its loud and sometimes its gone.  I had acimydrin, cytoxin, taxatere, cycplatin and gemsar.  I had so many different side effects from all these chemo.  During the winter I was not allowed to get a flu shot because they did not know what strange side effect I would develope.  Chemo was a very interesting science experience for me.  Hang in there, it does get better. Teresa",
      "MessageIndex": 6,
      "PostDate": "03/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16603,0.htm",
      "Title": "strange side effects"
    }
  ]
}