{
  "AuthorID": "Thankful777",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thankful777",
  "Posts": [
    {
      "AuthorID": "Thankful777",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thankful777",
      "Content": "On Mar 01, 2010 3:25 AM joeys_mom wrote: I just went through My son having a braintumor in 07 and I still being upset about that.. Now I got diagnosed with breast cancer and I am scared to death... what to expect and how to cope. I was there for my son ,,he is ok now .. I was strong .. I am lost now.. Any support or intput .. please thanks Joeys mom   sabine Joey Mom: I am sorry about your son and only God knows the reasons for his decision about anythibg that he allows us to go through. You must get yourself together and take care of yourself go to thee doctor and find out exactly what you are dealing with and proceed to get started with what they tells you to do and lean on God for his strength.  There are going to be some hard times to deal with but you know what? It will be okay stop being upset because it accomphishes nothing just a trick of the devil/deceiver pray and trust God Be Blessed, Thankful777",
      "MessageIndex": 21,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "Thankful777",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thankful777",
      "Content": "Hi, I do not want to be the bearer of bad news buts honesty is the best, You probably may have reason for concern but take the biopsty, pardon my spelling but keeps a clear mind and a thankful spirit and remember ,If God brought you to it he will bring you through it. I had the same problem two years ago selected for them to take breast  no radiation or chemo so blessed and its been two thankful years of being cancer free. Thankful777",
      "MessageIndex": 2,
      "PostDate": "20/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,45181,0.htm",
      "Title": "Breast cancer concern!!"
    }
  ]
}