{
  "AuthorID": "THERESE_L_1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
  "Posts": [
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "I am a 52 years old .. was on tamoxifin for about 2 years.... gained about 30 lbs and felt absolutely horrible.  I did talk to my dr and switched to Aromasin.  I am feeling alot better although I am still going to a naturepath and getting accupucture in my feet. I have foot pain when I am on them to long.  It was worst on tamoxifin for me ..although I would rather not be taking any of it!    And yes I have thought about stopping but  I have a friend who went the drug free way an is now dealing with tumors in other parts of her body. I wish there was an alternative... I just keep weight training, taking my vitamens and walking a couple miles when I can... it helps alot mentally and physically. Therese",
      "MessageIndex": 6,
      "PostDate": "23/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16129,0.htm",
      "Title": "Aromitase Inhibitors"
    },
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "Hi I have been taking aromasin for four years now... I did gain about thirty lbs somewhere between chemo, tamoxfin and aromasin and I am not sure how.  I was happy to get off of tamoxifin and the side effects are not fun with aromasin either I suspect they are somewhat like arimidex.  You could try to switch aromasin may be easier on your body.  Working out at the gym 4 days a week has strengthen my body and I have lost some weight and my joints feel much better. It is good for the head too. I am just going to tough it out until year five... then I will need to look at whether to continue or not. It is a personal choice but anything that is proven to keep cancer away I am willing to tough out ......I do not like the alternatives. Good Luck, T  ",
      "MessageIndex": 19,
      "PostDate": "26/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "I am 52 in remission for going on three years....  I started on tamoxifen I was still pre menopause...until chemo. Switched to aromasin about six months ago... I am counting down the years to get off of this stuff.  I have gained about 30 lbs ... which is not good.  Aromasin has actually been easier on me then tamoxifen was...  Accupuncture seems to help alot with the leg and foot aches.  I have been taking melaton 20mg. Working out at the gym seems to help alot. I usually can handle about 10 minutes on the eliptical before my feet start aching ... or burning. I have tried a  personal trainer to push me past where I am comfortable.  I  believe I feel better mentally and physically if I stay moving and active.  I feel about 70 when I get up from sitting for any long period of time.  The alternative is taking a chance of my estrogen receptor positive cancer coming back... I do not want that to happen.  If someone out there can come up with a drug that is kinder on the rest of the body I would be so happy! Any body out there have any other suggestions to make the aromasin experiance any easier I am  listening too.....  Therese  ",
      "MessageIndex": 2,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17261,0.htm",
      "Title": "taking aromasin"
    },
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "  On 3/22/2007 Colorado Cancer wrote: I'm a husband of a tamoxifin user and the use of this product has totally wiped out what sex drive my wife had.  She's worried about using something that might increase her risk of recurrence.  She's been on it about 4 months now.  She's only 39 so we're not ready to give up.  Her symptoms are itching and general pain during intercourse.  Can anyone help us here?  This seems to be a cruel drug. Tamoxifin and the aromatase inhibitors have their side effects.  I was on tamoxifin for 3 years and moved to aromisin.  Loosing estrogen in your body which is what you are trying to do if you estrogen Receptive is bound to create side effects... sexual side effects are just part of it. The best thing for me was to start exercising, weight training, and long walks with my husband. Knowing that he still finds me attractive and I am working on being physically fit helps!   On the down side I have a friend that chose not to take any recommended treatments .... she is battle multiple tumors in her body! Stay positive... Really it works!",
      "MessageIndex": 10,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "  On 3/22/2007 Colorado Cancer wrote: I'm a husband of a tamoxifin user and the use of this product has totally wiped out what sex drive my wife had.  She's worried about using something that might increase her risk of recurrence.  She's been on it about 4 months now.  She's only 39 so we're not ready to give up.  Her symptoms are itching and general pain during intercourse.  Can anyone help us here?  This seems to be a cruel drug. Tamoxifin and the aromatase inhibitors have their side effects.  I was on tamoxifin for 3 years and moved to aromisin.  Loosing estrogen in your body which is what you are trying to do if you estrogen Receptive is bound to create side effects... sexual side effects are just part of it. The best thing for me was to start exercising, weight training, and long walks with my husband. Knowing that he still finds me attractive and I am working on being physically fit helps!   On the down side I have a friend that chose not to take any recommended treatments .... she is battle multiple tumors in her body! Stay positive... Really it works!",
      "MessageIndex": 11,
      "PostDate": "24/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "THERESE_L_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/THERESE_L_1",
      "Content": "  On 9/25/2007 Kimarie wrote: Has anyone given any thought, that all the treatment we have been thru for breast cancer, chemo, radiation, and tamoxifin in my case.  Has caused an imbalance in our thryroid which may be the reason for our weight gain and foggy brains.  I recently called a wellness center that could not treat me for my menapause because of the estrogen positive cancer, which I knew.  But they mentioned how I should have my thyroid checked.  Tell me what you think. Kimarie Yes, Yes, Yes.... I was battling foggy brain and weight gain for 3 years... chemo, radiation, tamoxifin, aromasin.   I am still on Aromasin.  My thyroid test were coming out in the normal ranges... but a naturpathic dr. suggested that monitor my body temperature in the Am when I wake.  My temp was running consistantly low.  The natural path started me on 1/2 grain thyroid (pigs)... we have moved it up to 1 1/2  I feel ALOT better.  I work on network and servers so I do not have time to think foggy. My weight has not changed that much.. but I do not think I have gained any more. I have about a month into this program ... we shall see :-) I do not know if it will help you but it is worth checking it out! ",
      "MessageIndex": 3,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16480,0.htm",
      "Title": "Tamoxifin/Thyroid"
    }
  ]
}