{
  "AuthorID": "thinkingofdad",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/thinkingofdad",
  "Posts": [
    {
      "AuthorID": "thinkingofdad",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/thinkingofdad",
      "Content": "Oh Joey's mom... how awful and scary. I am so very sorry you were diagnosed with that dreadful disease. You must feel so confused and scared. I am so glad your son is okay. And yes you are strong.... stronger than you even know. Your strength will come back to you, don't worry! Just give yourself time to adjust, and you will be ready to kick tail! Do you know what kind of breast cancer? You are in my thoughts and prayers. Tina J. - daughter of GBM warrior!",
      "MessageIndex": 1,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44618,0.htm",
      "Title": "Just got diagnosed with breast cancer"
    },
    {
      "AuthorID": "thinkingofdad",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/thinkingofdad",
      "Content": "Good for you - start fighting now, and don't give up until your heart tells you to, and even then second guess your decisions three or four times! :) I am so sorry about your probable diagnosis. So, your mamagram came back okay? Holy cow... that seems so strange. I am so very sorry you may be in the Cancer Sucks club. My father was diagnosed with stage IV - multifocal Glioblastoma Multiforme brain cancer last October 09. He is doing so well despite the monster lurking under his skull. I hope everything goes well for you - and may I suggest the book: Anticancer - A new way of life by David Servan-Schreiber. It has a ton of information in it about nurtrition and the power of your mind (not in a weirdo type way either!). He is a neuroscientist, a doctor, a author, and most importantly a survivor, yes a brain cancer survivor of 17 years. God Bless, Tina J. - daughter of GBM warrior!",
      "MessageIndex": 1,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,44414,0.htm",
      "Title": "diagnoised with stage iv breast cancer metastasized to bones in spine and pelvic"
    }
  ]
}