{
  "AuthorID": "Thomascade",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thomascade",
  "Posts": [
    {
      "AuthorID": "Thomascade",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thomascade",
      "Content": "Carline, Where did you purchase the PH monitor? Thanks, Terry",
      "MessageIndex": 17,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Thomascade",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thomascade",
      "Content": "  On 6/1/2007 Carlineann wrote: Hi Donna, I just now saw your email. How exciting to find someone else that is using alternative treatments. I have had a hard time finding other people like you. I would love to get a board of us together so that we can share and record and document our findings. I decided against the vitamin C IV but I did take 50 g while I had my teeth and cavatations taken care of and I felt great. No drying of my mouth, etc that you experienced. I hope you can read my other email of the things I am now doing with my treatments as far as nutrition and enemas and cleanses.  I was wondering how you got a doctor to give you an IV? I live near Austin, TX and there is an internal medicine doctor in Austin and a doctor in Wimberly that will give the IVs.( I hope this answers the other message that was before your message) I just did not feel comfortable about having the IV done continuously. Call it intuition I guess.  I have not done anything for markers but I did order the AMAS test which was sent to me from a group out of Houston. Now I need a doctor to give it to me. It is a blood test for cancer. I will try the doctor in Wimberly. The one in Austin wants me to do Chelatan and vitamin C IV first. Please keep in touch and let me know how you are doing and what you are doing.  God Bless. Carline   Carline, Just saw your post on Vit c and alternative treatments.  I am very interested in joining the group who want to discuss and track any treaments that patients are taking.  I am lung stage IV, 8 PET scans are clear and am on Tarceva for maintenance.   I have an oncologist in my town and one in New York.  He is the nutrition and Vit.C guy.  Alot more to share if someone is interested.  I would love to share all info I have if it might help someone else with cancer.  Blessings, Terry",
      "MessageIndex": 16,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    },
    {
      "AuthorID": "Thomascade",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Thomascade",
      "Content": "Donnna and Carline,  Hello, I am Terry Durham from TN and I just saw your posts on vit c iv.  Must have meant to be....I had my first iv therapy today at the oncologists office.  I will receive 8 more treatments one a week.  Dr. Mitchell Gaynor Onclolgist from New York (google him) ordered after I finished 12 chemo treatments.  Stage iv lung.  Feel great.  Take over 35 nutritional supplements a day prescribed by Dr. Gaynor.  Please email me with any questions if you have any.  I am so excited to finally find someone that is interested in alternative therapy.  Thanks, Terry",
      "MessageIndex": 15,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7645,0.htm",
      "Title": "Vitamin c iv"
    }
  ]
}