{
  "AuthorID": "Tinas",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
  "Posts": [
    {
      "AuthorID": "Tinas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
      "Content": "Madge, Did they test your tumor for HER2pos? Tina",
      "MessageIndex": 9,
      "PostDate": "19/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4009,0.htm",
      "Title": "Metastatic Breast Cancer"
    },
    {
      "AuthorID": "Tinas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
      "Content": "I had terrible bone pain with Arimidex, and weight gain. Now I am on Aromasin. It has only been a week, so I don;t know yet how it will be. But getting of the Arimidex was great.",
      "MessageIndex": 3,
      "PostDate": "11/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1336,0.htm",
      "Title": "Aromasin"
    },
    {
      "AuthorID": "Tinas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
      "Content": "Madge, I will pray you keep getting better! I don't know much, but my doc put me on Aromasin. I heard it is stronger than Femora. I think if I were you I would switch to Aromasin. Keep up the good fight. Tina",
      "MessageIndex": 1,
      "PostDate": "11/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4009,0.htm",
      "Title": "Metastatic Breast Cancer"
    },
    {
      "AuthorID": "Tinas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
      "Content": "I had this test done. Thank goodness I had neither gene. Now I do not worry about my two daughters, my mom and my sister. I cried when I found out both were negative. I had my test done through Grant Hospital in Columbus. It is something I think every women should have as a preventative measure. Did you end up doing the test? Tina",
      "MessageIndex": 2,
      "PostDate": "19/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1289,0.htm",
      "Title": "Genetic Testing - Brca 1 & 2....questions?"
    },
    {
      "AuthorID": "Tinas",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinas",
      "Content": "I had stage 2 with 6 positive nodes. I went through chemo and radiation. I took tamoxifen and arimidex and had to stop both because of side effects. Some ladies don't have any trouble with them, but I did. The tamoxifen caused shortness of breath, rapid heart beat, minor hair loss and joint pain. I took it about 18 mos. then tried arimidex . After a couple months, Arimidex caused stiffness and joint pain and my oncologist told me I had fibromyalgia from it. I couldn't take it any more. He took me off it, and now I am trying aromasin. I've only taken it a week, but it is causing moderate dizziness. I will be a 4 yr survivor in May, so I hope I don't have to take the meds too much longer. I hope you don't have side effects. Just because I did, doesn't mean you will. These meds are helping women survive breast cancer, so that is a good thing. God bless you! Tina",
      "MessageIndex": 1,
      "PostDate": "15/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4071,0.htm",
      "Title": "After Chemo & Radiation"
    }
  ]
}