{
  "AuthorID": "Tinkerbell_1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
  "Posts": [
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "  On 11/21/2008 pkmm63 wrote: I have a Lump in my right Breast and I Have Pain And Burning in it all the time.I am 45 year old. and I had this lump send 2007 but now it got biger.they want'ed to take it out.but now they chang there mind.I ask them what was the lump. but they could'nt till me for they was not sure what it is. so they told me to just come back next year for they nothing they can do for me. But I know in my Heart they got to be somthing a m.d. could do for me But I just Don't know what. for if it breast cancer I\"LL like to know. so I call cancer treatment centerset america and they told me to go to aother m.d. and talk to them about it. see what they can do for me. so I am going to try one more time. and if that m.d can't help me I am just giveing up. for my love one's don't want me to talk to them about it anymore for they say they geting sick of talking about it. and geting sick of takeing me to see the m.d. about my breast but they don't unstand I am worry. for they Don't unstand I am sick of hurting . so now I don't say anything about it to them anymore. and when I go to hurting I just don't let them know for I just go on like nothing a wong whit me.  please,please do not give up! first of all God is on your side alwayys there for you. we are here for you, we all stand together here so feel free to lean on us. i wll keep you in my prayers. by all means get a second opinion and let me know how you made out. may God bless!  God love you and so do i",
      "MessageIndex": 1,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,30535,0.htm",
      "Title": "I am about to give up."
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "a friend whom the dr. had givien 6 months to live 2yrs 1/2 ago sugggested i take lglutamine. you can look this up on the pc. she suggested i take 2 tsp 3x daily. this  helps the immune system and  helps with side effects from chemo. also visit the website: www.scotthamilton.com for some good info. i hope and pray your mother will be fine of course you know to check with her dr.first to make sure this supplement is ok. does she take viatmins? what would the dr. think of some mild form of physical therapy in the home and some range a motion of her limbs? i think some healing scripture tapes and some tranquility tapes be good for her. i do all the above. alsothe book healed of cancer by dottie olsteen           www.amazon.com   just keep your belief in God and keep the faith. anoint her and yourself with olive oil everyday with prayer and let the saints from your church anoint her and lay hands on her. thanks for your prayers. i will put a special request on line for our state churches to pray for her if you like. let me know. i dont have to use her name if you dont wish me to. i can just say a special request for healing for a special person and God will know who it is. love and take care. keep in touch. the tumor markers i cannot answer about as far at what point she feels bad.  tinkerbell1 ",
      "MessageIndex": 16,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "yes i sure will. thanx for your prayers also. we can all use it. temember worry about nothing pray about everything. may God bless! tinkerbell 1",
      "MessageIndex": 19,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "hello, this is tinkerbell, how is everything going? i tested pos for the her2 test and now on the herpectin along with the zeloda. i am getting pain in my knees and i still have the numbness in my hand feet and legs but its getting better. i playing the digital piano much better now at church thanks be to God. i want eveyone to consider theirselves as warriors. no weapon shall be formed against us and we will stand strong and know that God has empowered us to go through this and He will give us the grace we need to endure. we are more than conqerers. may God bless all of you and my prayers will continue to go up for all. remember God loves you and so do i. love always, tinkerbell take on day at a time!",
      "MessageIndex": 13,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "know that God is with you and your mother. i am praying for the both of you. be a warrior and think positive. God will take care of everything. i am on the zeloda also and  herceptin 2x weekly have a few side affects. still have numbness in the feet legs and hands but i am coping. God will give us the power to overcome. take one day at a time. get up each day with a good positive attitude. i know its difficult at times but we will get through it. i was diagnosed with stage 4 liver ca last july and will celebrate 11 yrs in may of being cancer free from breat ca. my hubby is on dialisis 3 x weekly and is doing pretty good. my mom is in good shape and helps us out. i wanted to share this with you and others to let you know you are not alone. let me know how you all are doing. God loves you and so do i. tinkerbell 1  ",
      "MessageIndex": 14,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "hello betty, that is ok, sometimes the perfect pc messes up too ,smile. God will take of you and your baby boy. i am sorryyou are having so much pain but God will see you through. worry about nothing and pray about everything. i have you and your family in prayer. do you mind if i put you on line so our state churches can pray for you? we need all the prayers we can get. have a happy easter and remember by His stripes we are healed. love and hugs, tinkerbell",
      "MessageIndex": 5,
      "PostDate": "04/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "what a beautiful message! this should be framed and read everyday. you are really encouraging and i appreciate you and your prayers. i hope others get to read it because it would really help a lot of people. speaking of olsteen, his mother wrote the book \"healed of cancer \"and www.amazon.com has it. i have it but havent read it yet. my cousin who is 2x cancer survivor also said to say i was diagnosed with cancer so you on track with that and that is exactly what it is. as uou say we need to believe things as if they were and have faith.the Redeemer and theHoly Spirit is with us always to protect us from the enemy. \"i will not die but declare the works of the Lord\"  \"i am saved, healed and delivered\" paise God what a wonder He is! so comforting and compassionate and so loving. it is His will to heal us. have a happy easter.  wiill continue to lift you and your family in prayer too. may God bless! love ya, tinkerbell1  ps: pray about everything, worry about nothing!   ",
      "MessageIndex": 9,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "hello betty, i am taking xeloda  going on 2 weeks now. i dont have the side effects you mentioned but i doi have the tiredness and bloatness around my abdomen and swollen feet. i was on taxol and taxatere, but i am still having numbness and tingling in my hands feet and legs. i was diagnosed with stage 4 liver ca. but i know God has healed me. i claimed my healing from the beginning. my ct scan showed the tumors are still there but the hav shrunk and are regressing. let me know how you are doing. i emailed you recently and i have kept you in my prayers. i am sorry we all  have to go through this but we have to think positve and do the best we can. may God bless. love ya!",
      "MessageIndex": 3,
      "PostDate": "03/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "right on sister, you are talking now. where would we be without the Lord on our side? i like you could not have made it without him. what a might God we serve! he helps us think positive thoughts and know that by His stripes we arre healed. i think like you as far as being here for years to come. we have Jesus and we do not have cancer. those were the first words a brother  in church told me to say right after my diagnosis last year. so that along with healing scriptures is what i say each day. we have to instruct our body through God what we want it to do. have a blessed Easter. will be singing a solo \"Redeemer\" i know my Redeemer lives. love ya! keep the faith! may God bless! tinkerbell1",
      "MessageIndex": 7,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10410,0.htm",
      "Title": "Xeloda and side effects-advice needed"
    },
    {
      "AuthorID": "Tinkerbell_1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tinkerbell_1",
      "Content": "God is the great physician. i will pray for your mother and you. also i have  heard that L glutamine is good for the immune system. God bless ! tinkerbell1",
      "MessageIndex": 2,
      "PostDate": "03/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11624,0.htm",
      "Title": "Altenative therapies"
    }
  ]
}