{
  "AuthorID": "tongrenhealer",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tongrenhealer",
  "Posts": [
    {
      "AuthorID": "tongrenhealer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tongrenhealer",
      "Content": "It is not a big deal (of course I have a husband who has seen many indignities in 3-1/2 years of esophageal cancer, so I may see things differently). They use ultrasound to locate the area, inject a needle, and remove some fluid. It only takes a few minutes. Not really very invasive. I'm a wimp too.",
      "MessageIndex": 1,
      "PostDate": "09/06/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,36948,0.htm",
      "Title": "Information on Aspiration"
    },
    {
      "AuthorID": "tongrenhealer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tongrenhealer",
      "Content": "My husband has a port. It should get better, but it's like a surgical procedure to put one in so it takes a few days before it becomes less painful. His bumps out some, and always has. Some people have something they rub on them ahead of time that numbs it, but husband says it's just like a little poke. Much easier than having iv's threaded all the time, easier on the blood vessels, easier on the psyche. The people that work on you are generally pretty experienced. I've seen nurses who could access his port so fast I missed it blinking. You'll get used to it once it heals, and probably appreciate it.",
      "MessageIndex": 2,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,46307,0.htm",
      "Title": "Chemo Port"
    },
    {
      "AuthorID": "tongrenhealer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tongrenhealer",
      "Content": "Hi-My husband has had esophageal cancer, so I don't have breast cancer experience to tell you what is or isn't normal, but I would be concerned and make sure I went back to dr. even though it is scary.  Letting things go is worse.  Does she have regular follow up visits?  We've been on this road over 2 years starting with radiation and chemo, followed by 2 major surgeries together, with another surgery for mets and two more rounds of very intense chemo after mets reemerged.  He was doing well for quite a few months, until he needed emergency surgery on Christmas.  Since then lung mets seem to be returning, although he was clean in early December.  Even though it looks like we may be facing more treatment,  I have faith that things can work out.  I will be doing tongren more intensively than we have been, since we attend a weekly class and I work on him daily, but now plan to do some conference calls or cancer specific groups.  I think the shock of surgery and all the morphine (which feeds cancer) were more than his immune system could take and the cancer got ahead of us again.  All we can do is keep fighting.  Personally I choose to try to maintain the fearless stance, although I occasionally succumb to negative thoughts and the fear takes over.  Don't let the fear immobilize you.  During my husband's first round of chemo I was really afraid about him making it through because he was so sick and diagnosed so late.  One night right before chemo ended there was a rush of police, fire and ambulances up our street.  My Mom called in the morning to tell me my sister's best friend had crashed into a tree and died instantly.  I was afraid of losing Pat to and fretted over it some, and here was this person who was like family gone just like that.  Each moment is precious whether we face terminal illness or are just living our lives-just live each moment as fully as you can and there is no room for regrets no matter what comes.  You will miss this precious moment fretting over what might be.  Will keep you in my prayers.",
      "MessageIndex": 1,
      "PostDate": "26/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20338,0.htm",
      "Title": "please reply someone! urgent!"
    },
    {
      "AuthorID": "tongrenhealer",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tongrenhealer",
      "Content": "I have a clip I saved a few years ago about a study with Vitamin E use with platinum drugs which frequently cause neuropathy. They recommended taking E through treatment and there was much less neuropathy reported. Of course any supplements during tretament need to be mentioned to the oncologist. Ours was okay with this since it was either 300 or 400 units a day, but she did not want him taking large doses of it.",
      "MessageIndex": 27,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,33314,0.htm",
      "Title": "Nerve damage from Chemo"
    }
  ]
}