{
  "AuthorID": "Tonir24",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
  "Posts": [
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "  On 2/14/2008 cayenneblue wrote: Absolutely!!!!  I also had a bilateral, and had my ovaries removed and am now on Arimidex. I have no libido at all, and on the few occasions that we did \"try\", I was so sore that it really wasn't possible.  I know a couple of my doctors have mentioned vagifem or another \"low\" estrogen solution, but I do not want to go that route. After all, I had my ovaries removed and am now on the arimidex to get rid of estrogen so that this darn cancer doesn't return. Why would I want to tempt fate????  Let me know if you figure out a solution!  I had a bi lateral 2 1/2 years ago with radiation -  at my age I did not notice any libido problem -as my husband passed away -  but major depression and loss of sleep among other side effects terrible bone pain in hips and legs -- I could not even sleep in my pillow top bed without pain -- I went off Arimidex but as my cancer was estorgen positive I started taking an estrogen blocker (over the counter) capsule called Brevia which can be purchased at certain food stores or over the internet ) I get mine at Mothers Whole Foods - if you have one there and so far it seems like I am doing fine -  my blood work comes out good and THERE ARE NO SIDE EFFECTS.   If any med has ten aside effects I will get at least eight of them -- I am allergic to so many meds -- I hav enot heard abou the libido problem but most complaints are terrific bone pain and it does affect your bone loss which is why I had to have a bone density test and would have had to continue having them if I had stayed on Arimidex.  Toni R",
      "MessageIndex": 3,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20911,0.htm",
      "Title": "Loss of libido after bi-lateral mastectomy and Arimidex"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "I would suggest you get a second opinion --  I think you have been very brave to have been taking those meds as long as you have -- most perople have such terrible side effects - mainly pain -- I was on Arimidex for one month and had to quit - the pain was so bad and the depression was terrible  - I cried all the time and I NEVER cry - I have since stopped taking any meds and am using alternative supplements instead -- there is an article on the front page of this Cancer Compass page today re\" grape seed taken for breast cancer\" -- I have been taking grape seed for almost two years now - no side effects at all and eating grapes also with other supplements and antioxidant foods, pomgrante juice, blueberry juice and blueberry capsules among others.  The article said it is good for post menapausal women, but sounds like you are.  There are so  many alternatives to these horrible meds, but of course it has to be a personal decision .  Mine was that I wanted to finish out my life without the pain and be able to enjoy my life however long or short it was. .  So far all my tests have come back good with no recurrance or any signs of it so I guess it is working. Toni R. ",
      "MessageIndex": 1,
      "PostDate": "03/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19306,0.htm",
      "Title": "Lupron and Arimidex"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "The grape seed extract I take is 50 mgs.  but you can take more than one a day -  the suggested dosage is one to two capsules a day - I only take one as I forget to take another when I get home from work sometimes.  There are so many alternatives (that may or may not work) but I prefer trying them as to putting up with the side effects of these meds.  I am now on a  med (or was) for thyroid -  supposedly my thryroid is a LITTle low ( how low is little?????)  the side effects are terrible  --  insomnia -- I did not sleep for a week when I first started taking them -- increased appetite ( I gained 6 pounds even though I do not think I increased my food intake) diarreaha - supposedly weight loss  -- HAH  -- I gained six pounds -.  so now I am looking for a supplement for the thyroid meds.  .  I was happy to see the article on Cancer Compass re -  grape seed as that means I am probably on the right track with these supplements-  All I know is I feel great and no side effects..   Keep in touch -- Toni R",
      "MessageIndex": 4,
      "PostDate": "07/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19306,0.htm",
      "Title": "Lupron and Arimidex"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "Shemay -- thanks for answering my messg. and telling me that you know many who are doing fine on diet instead of meds.  Good to know.  I have my next check up in November and will see then if it is working.  I feel good and am still working  I eat a lot of salmon and broccoli -  as they are both very anti cancer but just read where it is doubly effective if eaten together at the same time -- living alone I rarely cook salmon but have a small resturant close by that has wonderful salmon ( on their Senior menu) and also serves it with broccoli so that is my weekly treat after working all week.  Stay well.  Toni Y - Orange, Ca.",
      "MessageIndex": 2,
      "PostDate": "06/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14859,0.htm",
      "Title": "alternative to meds"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "  On 8/6/2007 Shemay wrote: HI TONY I ... HOW NICE TO HEAR THAT YOU ARE FEELING GOOD AND STILL WORKING. THE PROTOCOL I FOLLOW IS WORKING WELL FOR ME TOO. I HAVE NEVER FELT STRONGER NOR HEALTHIER THAN IN THE PAST THREE YEARS SINCE I WAS FIRST DIAGNOSED.... STILL NO SYMPTOMS OF DISEASE. HERE IS A WEBSITE WITH REALLY VALUABLE INFORMATION TO READ ABOUT WHEN ONE IS FOLLOWING AN ALTERNATIVE PATH. FOLLOW THE LINKS OF INTEREST IN THE LEFT HAND COLUMN.... CONTINUED GOOD HEALTH. Shemay http://www.doctoryourself.com/index.html   On 8/6/2007 Tonir24 wrote: Shemay -- thanks for answering my messg. and telling me that you know many who are doing fine on diet instead of meds.  Good to know.  I have my next check up in November and will see then if it is working.  I feel good and am still working  I eat a lot of salmon and broccoli -  as they are both very anti cancer but just read where it is doubly effective if eaten together at the same time -- living alone I rarely cook salmon but have a small resturant close by that has wonderful salmon ( on their Senior menu) and also serves it with broccoli so that is my weekly treat after working all week.  Stay well.  Toni Y - Orange, Ca.    Shemay -- thanks for the new website -- always willing to listen to something new and maybe better --  I have been reading other messages on the Board and it seems that quite a few had recurrances as much as five years later and that scares me -  at my age I cannot handle a recurrance five years from now as my only treatment then would be chemo and I do not think I could handle that in 5 years.  I have already had both breasts removed ( cancer in only one) but took the other as a safeguard against it popping up in the other one later.  I am a widow and no boy friend so did not care about not having  one and reconstruciton, at least not at my age.   Toni R - Orange, Ca.",
      "MessageIndex": 4,
      "PostDate": "06/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14859,0.htm",
      "Title": "alternative to meds"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "  On 7/30/2007 Tonir24 wrote: I had to stop taking Aramidex as the side effects were too drastic and to date -- one and a half years after surgery, I am clear of any cancer, and  I am just taking green tea, pomgranate, blueberry, grape and PomBerri Max capsules which I get from my vitamin company by mail and eating lots of fruits and veggies, very little meat other than fish and chicken.  .  All of the above are supposed to have powerful anti inflammatory agents in them so I will stick with them for now.  I am allegic to so many meds and from what I have read,  all the other after surgery meds are just as bad re: side effects I guess I have no choice.  Toni Y.  Got your message this morning -- sorry to hear you had to have chemo, but if it takes care of the problem go for it and maybe you will not need the surgery.  I had estrogen positive cancer (probably from taking birth control pills for 12 years - a no no) and the Aramidex is supposed to limit the amount of estrogen in the body so I do not have a recurrance but I just could not take the pain and depression from the pills.  As of now -- it will be 2 years Oct 22, I am still cancer free according to my oncologist so I guess something is working.  I go on line and try everything that sounds semsible -- but I will not do anything I do not understand.  I am now also drinking V 8 Fusion which supposedly gives me my complete daily requirements of fruits and vegetable I am supposed to have.  It is not cheap at the grocery store $4.99 - but only $2.99 at Wal Mart for 46 ounces so that lasts at least a week -- still cheaper than the Aramidex and much more pleasant.  According to everything I have read most fruits and vegetables have great anti toxins against cancer in them so I have gone to eating much more fruit and fresh vegetables, especially broccoli and brussel sprouts.  Due to working it was hard to have the 3 servings of fruits and veggies every day so the V8 fusion works great.  My grandson turned me on to it -- he says he has more energy and sleeps better and feels so much better since he started drinking it.  He works for Google as a program security tech and is on call 24/7 - he prevents hackers from getting into their programs -  so he was really getting tired.  I get my capsules from my vitamin company through the mail from a  company in Utah but I am certain most vitamin companies have them although I have been told this company is the best of all of them.  Keep in touch and let me know how you are doing with the chemo and if it has stopped the progression.  I live in So. Ca. where do you live?  Toni R",
      "MessageIndex": 7,
      "PostDate": "26/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14859,0.htm",
      "Title": "alternative to meds"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "Do keep in touch and let me know how you are doing -- also my grandson said if you get the V 8 Fusion - get the \"light\" it has half as much sugar.  I live in Orange, Orange County so I do know Laguna Niguel and love San Diego -- I do not know if they had the Gaslight District there when you lived there or not but it is fun to go to and they have college kids on bicycle carriages that drive you all around for $3.00 Many. many resturants and they have completely re done the Grant Hotel -- very elegant now.  They cleaned up the downtown area and turned it into the Gaslight District -- gas lamps and all.  Very snazzy.  Best wishes and keep well.  Toni R. ",
      "MessageIndex": 9,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14859,0.htm",
      "Title": "alternative to meds"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "I had to stop taking Aramidex as the side effects were too drastic and to date -- one and a half years after surgery, I am clear of any cancer, and  I am just taking green tea, pomgranate, blueberry, grape and PomBerri Max capsules which I get from my vitamin company by mail and eating lots of fruits and veggies, very little meat other than fish and chicken.  .  All of the above are supposed to have powerful anti inflammatory agents in them so I will stick with them for now.  I am allegic to so many meds and from what I have read,  all the other after surgery meds are just as bad re: side effects I guess I have no choice.  Toni Y.",
      "MessageIndex": 0,
      "PostDate": "30/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14859,0.htm",
      "Title": "alternative to meds"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "Hi steph  -  I had a radical mastechomy two years ago also and as far as a get well gift is concerned my suggestion is just \":being there for her\"  is the best gift -- we really do not need gifts -- my daughter (who works,  but lives with me) pre made lunches for  me that I could heat in the micro wave and stocked up on snacks (easy for me to  access) made sure I had books to read  (I am a reader) and as I live in a 2 story house - we fixed up the couch for me to sleep on in the family room as I was not supposed to lift my arms over my head or strain my surgery area for two weeks, and it was easier to get in and out of the couch than my regular bed. I also slept in a recliner a few nights as a change from the couch -  worked great.    Also it was closer to the bathroom and as I could not take showers anyway -- I did not need a full bathroom. Also that way I was downstairs so friends could come and visit and I did not have to go up and down stairs and also I was in the family room where the activity was and the t.v. so I did not feel isolated.  I am assuming she will have drainage tubes and that requires emptying and recording the drainage and if I needed help I was where someone could help me without a drastic drain on them.  As it turned out -- it was not at all what I envisioned and it was much easier than I assumed it would be, but I was glad to be in the family room and not stuck in a bedroom.  Good luck and have patience with her as she will probably be not scared, but apprehensive about what she can do and not do -   If she has or had very many lymph nodes removed she will be more restricted in her movements than I was as I only had two removed..  Let me know how she makes out and please let her know it is not the end of the world.  I do not know her age but if she is concerned about her appearance afterwards there are false boobs to wear and I have them,  but at my age I only wear them when I go out dressed up - I just slide them in my regular bra and it works great.   I have joined the bra burning age.  Toni R.",
      "MessageIndex": 22,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19779,0.htm",
      "Title": "Gift for my mom"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "Hi steph  -  I had a radical mastechomy two years ago also and as far as a get well gift is concerned my suggestion is just \":being there for her\"  is the best gift -- we really do not need gifts -- my daughter (who works,  but lives with me) pre made lunches for  me that I could heat in the micro wave and stocked up on snacks (easy for me to  access) made sure I had books to read  (I am a reader) and as I live in a 2 story house - we fixed up the couch for me to sleep on in the family room as I was not supposed to lift my arms over my head or strain my surgery area for two weeks, and it was easier to get in and out of the couch than my regular bed. I also slept in a recliner a few nights as a change from the couch -  worked great.    Also it was closer to the bathroom and as I could not take showers anyway -- I did not need a full bathroom. Also that way I was downstairs so friends could come and visit and I did not have to go up and down stairs and also I was in the family room where the activity was and the t.v. so I did not feel isolated.  I am assuming she will have drainage tubes and that requires emptying and recording the drainage and if I needed help I was where someone could help me without a drastic drain on them.  As it turned out -- it was not at all what I envisioned and it was much easier than I assumed it would be, but I was glad to be in the family room and not stuck in a bedroom.  Good luck and have patience with her as she will probably be not scared, but apprehensive about what she can do and not do -   If she has or had very many lymph nodes removed she will be more restricted in her movements than I was as I only had two removed..  Let me know how she makes out and please let her know it is not the end of the world.  I do not know her age but if she is concerned about her appearance afterwards there are false boobs to wear and I have them,  but at my age I only wear them when I go out dressed up - I just slide them in my regular bra and it works great.   I have joined the bra burning age.  Toni R.",
      "MessageIndex": 14,
      "PostDate": "21/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19779,0.htm",
      "Title": "Gift for my mom"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "I had  bi lateral breast surgery 2 l/2 years ago - no lumps but my right nipple was growing inward (inverting)  my mammogram showed nothing - the ultra sound showed enough that they ordered a biopsy -- oh yeah,  it came back positive - so mammograms are not all that accurate as many doctors are now saying - I think it is best to have as many tests as possible - my biospy was not painful and took only a few minutes so I would suggest that you definitely consider having that done also.  At my age I opted to have both breasts removed so that I would be (hopefully) certain that it would not show up in the other breast a year or so down the road.  Also that way I would not be lop sided and I can wear a  bra with pads or not as I choose -- around the house I choose not to - but do when I go out   I also found that the mastoctomy bra I purchased at the cancer center gift shop did not work for me -- a bi------ to get on so I just use a regualr bra and insert the pads in the cups (which I did buy at the gift shop as they try to fit you with as close to what you had so that the weight is still the same)  -- works great for me. Supposedly one can have back problems if you do not replace the weight loss in the front ??????? Chin up and get as many tests as necessary  toni 24",
      "MessageIndex": 5,
      "PostDate": "21/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,21141,0.htm",
      "Title": "Need help please!"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "I had a  bi-lateral mascectomy Oct. 22, (will be three years this Oct) and had radiation, no chemo - estrogen positive - and was put on Aramidex-  the side effects were so bad I had to stop - doctor wanted to put me on tamoxifin but i reaearched it on the internet and it said that it was to be taken AFTER 5 years of Aramidex.  In asmuch as I had only been on  Araidex for one month I could not see taking the Tamoxifin, besides according to the research, the side effects of that was even worse, so I elected to take nothing -- I am not recommending this to anyone - but this was my decision --  I then did a lot of research on the internet and on other cancer sites and am now taking Brevail (which is an over the counter estrogen blocker) recommended by others on the internet whio are taking it (and the doctor who invented or discovered it).  So far , so good - my exams and blood works come out great, I also take other over the counter tablets from my vitamin comopany that I have been using for years and years that are supposed to be anti cancer -   blueberry capsules, green tea, pomgranate capsules, , eat a lot of fresh and frozen broccoli  and  fresh blueberries.  Again, I am not saying you should try this, but I do think you should do a lot of research and see if there is not a better way without all the meds with their terrible side effects.  The side effects are worse than the illness.   Toni R - Orange, Ca.",
      "MessageIndex": 8,
      "PostDate": "11/07/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25847,0.htm",
      "Title": "SEVERE HOT FLASHES due to tamoxifin"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "sherry -- if you have Internet do on gogle Search and look up Dr. Joanna Budwig and read all abnout her -- other remedies besides meds --I just skimmed over it as I have to leave now, but I intedn to pull it up and really read it  -- it is \"How to Care for and Prevent cancer\"  Ton R",
      "MessageIndex": 4,
      "PostDate": "10/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14269,0.htm",
      "Title": "arimidex"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "  On 7/12/2007 Phiza wrote: I've been on Arimidex for almost 4 years along with joint pains mostly in the hand and wrist I fractured.  Will this pain go away after I'm off the Arimidex or is it already too late?  I had breast surgery 18 months ago and was put on Arimidex but I had to stop taking it after one month as I ached all over and also had severe depression -- I do not know if the paid will go away fro you, but I have heard that it does not.  I am now not taking anymedication but am taking green tea, blueberry, pomgrante and some other capsules whcih I get from my vitamin company which are suposed to be great anti toxions against cancer -- I felt that I needed to enjoy what life I have left and not be sick doing it -- of course I am much older- do not know your age - if I were younger I may have a different opinion.  So far my tests all show that I have absolutely no sign of cancer recurrance so I am sticking with what I am doing for better or worse.  Hope you get more feedback to help you. Toni R.  ",
      "MessageIndex": 1,
      "PostDate": "13/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14269,0.htm",
      "Title": "arimidex"
    },
    {
      "AuthorID": "Tonir24",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tonir24",
      "Content": "I have read where two to three cups of coffee a day is good for starving off cancer but I would  research it further if I were you.  I do drink two to three cups a day anyway normally, so I did not research it any further.  I remember commenting to my son - GREAT - I DO NOT HAVE TO GIVE UP MY COFFEE. I do not remember where I read it but I am constantly researcing cancer on the internet -  I had a bi lateral mastoctomy two years ago last month with radiation ( no chemo) and seem to be doing fine according to my oncologist and I do not take any meds -  I did for one month and the side effects were so bad I had to give them up and now am going the natural way - certain foods and a estrogen blocker capsule that is over the counter- which has no side effects,  as yet anyway.  Another lady in Georgie who is also on Cancer Compass is doing the same thing so we keep each other up to date on what is good and not good .  Go on the internet and look up coffee usage for cancer patients on Google and see what comes up.  Keep in touch ToniR",
      "MessageIndex": 1,
      "PostDate": "16/11/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,18019,0.htm",
      "Title": "Caffeine and breast cancer"
    }
  ]
}