{
  "AuthorID": "Tooshort1",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tooshort1",
  "Posts": [
    {
      "AuthorID": "Tooshort1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tooshort1",
      "Content": "First surgical biospy showed DCIS without clear margins.   Due to small amount of breast tissue and implants, decided to have mastecomy (also bilateral to stop worry about occurrence in other  breast).   Surgeon stated he looked at nodes and saw only one that appeared to be swollen so he removed that one not taking any others.  Biospy results came back talk about total shock- I had 75% tumor DCIS but the remaining amount was infiltrating carcinoma.  The report stated not enough nodes were taken to biospy I guess to determine if spread.   Ok, I go to my surgeon for appt and he states the amount of infiltrating cancer boiled down to 1/8 of an inch and that he was not worried about it spreading.   I mentioned the node and he stated he did not take a sentinel node at surgery and did not see reason to do so now.  He also stated the chemo and radiation onocologist said I didn't need either treatment based on that small amount of infiltrating cancer.   I am all confused about this situation.  First of all - I had mammograms and ultrasounds since age 30- I am now age 55.   I had dense tissue with cysts is the main reason for both.   I have never missed one year having both done outside of maybe being a month later than the previous year.   I have asked and they seemed to not have an answer- how did I end up with invasive cancer having my screenings every year.  Has anyone ever had a same or similar problem like this.   Now my current exisiting concerns are - even though I had mastecomy - since the cancer was invasive - should I not have some type of treatment such as radiation or chemo.    Also I cannot understand why this doctor didn't go ahead and remove a sentinel node just to err on the safe side rather than letting go and playing 'God' thinking everything was just ok. Has anyone had a mastecomy with invasive and not had treatment?  What about the node situation?",
      "MessageIndex": 0,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,57266,0.htm",
      "Title": "confused after surgery- nodes and treatment"
    },
    {
      "AuthorID": "Tooshort1",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tooshort1",
      "Content": "Had surgical biospy in Feb. had 2.7 cm removed (tumor was 2.5).  Path indicated DCIS with unclear margins.   Surgeon order MRI after the biopsy - report indicated 2.5 cm neoplasm remained.  I opted for bilateral mastecomy- prior to surgery asked surgeon what if the remaining area had became invasive - his reponse your report says DCIS.  I asked the question again during our discussion - same answer - your path report indicated DCIS.   On the morning of surgery - I asked about lymph nodes - he had mentioned during our office discussion - that he would look at the nodes and take any suspicious but would likely NOT take any nodes.    On the surgery morning he stated the same thing when I asked him about nodes.   After surgery he told my family - he had taken one node that was swollen- he had no idea what node he took or why it was swollen - I had not been sick.    He did not take the sentinel node - which I understand is pretty much standard procedure.    When my path report came  back from the mastecomy - it indicated there was a 0.3 cm of infiltrating ductal carcinoma.    When I went back for my surgical follow up I asked him about the invasive and he stood there looking like he had no idea what I was talking about.   He took me and I had my daughter and friend come in- into the conference room.  He came in in obviously a bad mood about my question.  He said he wasn't concerned about a 1/8 inch of invasive cancer and radiology was going to say no radiation and chemo guy was going to say no chemo.   He then started mumbling and mentioned he had not taken the sentinel node.   He then started to dismiss me and asked had I decided how 'big' I was  going to go with my implants and that he understood the surgeon who was doing my reconstruction would take me a large as I wanted to go.   Now why the heck would he waste his time asking me who at this point could care less about the size of my new  breasts- I was concerned about the fact infiltrating cancer had become a part of my life.   He scheduled an appt for the next week and pretty much told me if he had known the remaining area had invasive cancer he would have taken the sentinel node - hindsight is 20/20 Doc you were treating undignosed remaining tumor as knowing what it was when in fact you didn't have a clue.   He told me he had met with onocology and they said no chemo, no radiation, no more surgery to remove any more nodes and no hormone suppressant - even though tumor both DCIS and invasive were positive for estrogen and progesterone.   I sat there and about died - I asked the question how did he know there wasn't cancer cells sitting in the sentinel and would end up going somewhere else.  He then jumped in my s for lack of better wording telling me he could order chemo and I could sit for six months and watch my hair fall out  or he could order radiation and I could suffer from lympodemia (spelling not right) and he gave the percentage of women who get this or he could do more surgery and went into the scare the wrath of God out of you with the gross graphic details.    He told me the hormone therpy had lots of bad side effects.    Now based on my information - is it pretty much standard procedure to remove the sentinel node or to at least obtain a better sampling on the nodes WHEN A MASTECOMY IS DONE REGARDLESS OF ORIGINAL DIGNOSIS. HAS ANYONE EVER HAD INVASIVE CANCER EVEN THOUGH VERY SMALL AND NOT HAD SOME TYPE OF TREATMENT IF THIS WAS YOUR SITUATION  WOULD YOU TRUST THE SURGEON AND HIS OPINION/COMMENTS/RECOMMENDATION AND BE ABLE TO LIVE WITH IT OR WOULD YOU GET A SECOND OPINION ADDITIONAL INFORMATION   this surgeon works for a privately owned breast center.    I requested all my hard copy mammogram and ultrasound reports - I had been going to this place for 7 years and having dignostic mammograms and ultrasounds due to dense breast tissue with cysts.   I had been ordered to have both since age 30 I am now age 55.    I obtained hard copy reports for 07, 08, 09 and 10 (the later was when they found the cluster of microcalifications).   It appears in 08 there the ultrasound noted grouped microcalifications in the right breast.   Then in 09  when I went for the screening the ultrasound woman told me there was nothing in my breasts including cysts, etc.  She was short tempered with me and seemed in a hurry.   The day I was there was the first day the breast center had opened at their new location.  I have that report stating no problems.   So apparently in their grand opening first day at new location mode - they over looked what was there and likely in the 'works' the year before.  I have asked them the question - how did I have mammograms and ultrasounds every year and have breast cancer that had became invasive.   They have not answered that  question.  I have ordered both a CD of my last two year mammograms and they are sending me the ultrasound hard copy films. After reading this last section as well, how do you all translate the issues with my situation.  Is it just in my head or is there a problem with the  breast center, the surgeon and his attitude and recommendation for treatment? Any input will be appreciated",
      "MessageIndex": 0,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,57779,0.htm",
      "Title": "Surgeon did not take sentinel node"
    }
  ]
}