{
  "AuthorID": "Toxic_Rainbow",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Toxic_Rainbow",
  "Posts": [
    {
      "AuthorID": "Toxic_Rainbow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Toxic_Rainbow",
      "Content": "  On 12/30/2006 Kmabecca wrote: Wow! I just posted a message as \"Happy New Year! maybe not\". I am a very stubborn person and have experienced the itching you mentioned. Now I have an unexplained bruise. I have made a Dr appt but can't be seen until Jan 8th. I feel you should encourage your friend to go in for just a checkup and mention the itching to her Dr. It could just be hormonal changes or it could be the starting of something bigger that could lead to bruising. It is best to have a piece of mind, then to wake up with a bruise from no where. Please have her make an appointment. There are so many Survivors out there that can support her, yourself included. Maybe you can refer her to this site and have her read some of the messages. Becca It may be a yeast infection on your skin (especially where you sweat), which can be easily cured with baby rash powder, or diflucan.  Yes, it's the same yeast infection as candidas, which can affect many different areas.  I was frantic with itchy stomach, breast, hands, etc., until I took Diflucan and powder (precription) for the problem.  Immediate relief!  In 3 days I was feeling better, and the rash disappeared.  Ask your doctor or a breast specialist nurse about this.  It took me 2 months to get a straight answer.  Happy New Year!",
      "MessageIndex": 3,
      "PostDate": "30/12/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8363,0.htm",
      "Title": "has anyone ever had this symptom"
    },
    {
      "AuthorID": "Toxic_Rainbow",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Toxic_Rainbow",
      "Content": "I am so sad to read about your mother's (both) cancer.  Were they triple negative hormone receptor negative?  Were there lymph nodes involved? It states clearly, in most of the medical literature I've read, that some chemotherapy treatments, such as, Cytoxin, Taxols, and others may cause other cancers to develop elsewhere.  In fact, as a triple negative with Invasive Ductal Carcenoma, I was recently informed that many physician don't even bother to look for local recurrance and wait for distant metastasis to appear, somewhere. There are so many variables, depending on what type, size, stage and grade the cancer is, and whether or not it has entered not only the lymph nodes, but also the blood stream's vascular system, as well as surrounding tissue are capable of hiding cancer cells.  That's why most women are given radiation, which in itself can cause multi focal cancers elsewhere. I am repulsed by the physicians and how many little \"details\" they DON'T tell their patients; such as, long term side effects, the lymphedema, skin problems, instant menopause, and their general lack of care regarding pain and quality of one's life.  Chemotherapy all too often causes brain dysfunction, memory loss, and with radiation, it all becomes cummulative and can be devastating for so many women.  The information and instructions for breast care and nutrition, as well as psychological adjustment to life was NEVER offered or even discussed.  All of the research was done by none other than ME; and I was quite ignorant going into this world of ambiguous terrifying and unknown medical world. There are treatments for metastasis, and clinical trials which are proving to be quite successful, according to the latest research.  I would find a hospital, a qualified surgical oncologist, and a Breast Cancer Only Specialist to guide yourselves and your mothers through this difficult time.  Ask about Parp Inhibitors, Avastin, Xeloda, Abraxane, and the latest miriacle chemotherapy recently approved, some are: Cisplatin, Carboplatins, and a long list of new and exciting methods of treatments using particle radiation treatments, and targeted therapies.  I was reading about some treatments called Heat Shock Proteins, along with many new molecular treatments that are proving to be effective in halting the spread or appearance of new cancers.  My mother passed away from Inlammatory Cancer years ago, and almost every breast cancer patient was given the same treatments (and somewhat brutal, I might add).  I know the heartache and helpless pain you are feeling now; but truly, if you are able to locate a top notch doc, a great hospital doing clinical trials, and act quickly...you can get a second, third, even five opinions if need be. It's worth a try, anyway.  I am 18 months NED.  Always thinking it's back, every pain and ache is frightening.  I never got my \"things in order\", either.  Keep meaning to get these legal and other issues completed.  Right now, my greatest wish is to clean my house and keep clean.  No one ever expects a diagnosis of cancer, and when of if it happens, we go into shock, denial, panic and fear.  Your mother's are blessed to have such loving daughters.  Hope this helps and that you will find help and encouragement.  I've met many women who lived with metastasiis for ten to twenty years and longer in some cases.  Hope is not lost, there are still options available and I know you can find them.  Prayers and positive meditations you're way...sending the power of love to you all! T.R.",
      "MessageIndex": 2,
      "PostDate": "24/02/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20403,0.htm",
      "Title": "just some truth"
    }
  ]
}