{
  "AuthorID": "Tracy_N",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
  "Posts": [
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Hi Yvonne, I don't really have an answer to your question, but my mom had breast cancer and her doctor also saw her only every 6 months. Personally, i think that she should have been and should be seen more often. Nothing would have been prevented by her going to the doctor more often, but I would just feel more at ease. She now has cancer in her liver, and her doctor still doesn't see her as often as I'd like. If you feel more comfortable going more often, I am sure that they will understand. Good luck to you and God Bless. Tracy",
      "MessageIndex": 1,
      "PostDate": "12/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,354,0.htm",
      "Title": "Check ups while on Tamoxifen"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Hi Dalila, Thanks for your response. The last couple of weeks must have been horrible for you. I am sorry for that, but I am glad that you found my message and responded to it. It helps me to talk to other people; although I would like to make new friends in much happier circumstances! I can't believe how much we have in common. My mom also did not receive much follow-up care after her mastectomy a few years ago. I feel like if they would have done more she wouldn't be in this situation. When my mom started getting sick last December, she was also continuously misdiagnosed. No one knew what was wrong with her, but she was throwing up constantly and extremely fatigued. It sounds like your mom must have also been having some nausea if they told her she had acid reflux. Is your mom in any pain? my mom has lots of pain on a regular basis in her right side. she is going to have an MRI on Wednesday of this week to see what's going on. She also has blood tests every week now. Her spirits are up and down. She's really not the same person that she used to be. It's so hard cause I am so very close to her. I have no siblings. I think you said that you have a sister. Does she live close to you? Where in Texas do you live? What day do you leave for CTCA? Are you coming all the way to Zion? Please let me know if there is anything I can do. My mom and dad only live about 15 miles from the Zion facility. Thanks again for responding to my messages. It is so nice to talk to someone that understands. Believe me, I know what you mean when you say angry and sad. Somedays, I am so angry, I can barely even speak to anybody. Take care of you and your family. You will be in my thoughts and prayers. Sincerely, Tracy",
      "MessageIndex": 6,
      "PostDate": "13/10/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Hi Dalila, Thanks for your reply. I am sorry to hear about your mom; it is always so scary to get that kind of news. So, your mom and my mom seem to have similiar conditions. My mom recently started a new treatment; she is now undergoing a low dose chemotherapy in conjunction with a pill called femara. The chemo is actually an intramuscular injection that she gets once a month and it doesn't have many side effects at all. I can't remember the name of it though. How old is your mom? My mom is going to be 52 around Thanksgiving. How is your mom's spirit? How is your spirit? Somedays, I feel so down; I could literally cry all day. Most days I just immerse myself in my job, and that keeps me from thinking/worrying too much. Well, please keep in touch. I like to hear from others that have similiar situations. It's nice to know that we're not alone. I will keep you and your mom in my thoughts and prayers. P.S. Don't forget to wear your pink ribbon for Breast Cancer Awareness Month. Take Care, Tracy",
      "MessageIndex": 4,
      "PostDate": "10/10/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Dalila, I forgot to tell you that my mom was on Arimidex from December of last year until approx August. A couple of her tumors continued to grow in the last couple of months, so that is why they changed the treatment. She is going for another MRI on Wednesday of next week because she has been in constant pain and they want to see what's going on. anyway, good luck at the appt with CTCA. Please let me know how it goes. Take Care, Tracy",
      "MessageIndex": 7,
      "PostDate": "10/10/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "My mom had breast cancer a few years back and underwent a mastectomy. Now, she has been diagnosed with breast cancer in her liver. The doctors say that it has been there since she had the breast cancer, but it went undetected because her lymph nodes were clean. I am just wondering if there is anyone with a similar diagnosis that can share their experiences with me. As of right now, her only treatment is a pill called arimidex. She has not had any chemotherapy or radiation.",
      "MessageIndex": 0,
      "PostDate": "12/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,356,0.htm",
      "Title": "Experiences with or Information on Breast Cancer that has metastasized to liver?"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Can anybody offer me any information or advice?",
      "MessageIndex": 1,
      "PostDate": "12/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "My mom had breast cancer a few years back and underwent a mastectomy. Now, she has been diagnosed with breast cancer in her liver. The doctors say that it has been there since she had the breast cancer, but it went undetected because her lymph nodes were clean. I am just wondering if there is anyone with a similar diagnosis that can share their experiences with me. As of right now, her only treatment is a pill called arimidex. She has not had any chemotherapy or radiation.",
      "MessageIndex": 0,
      "PostDate": "12/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,355,0.htm",
      "Title": "Breast Cancer in Liver"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Hi Betty, My name is Tracy Nielsen, and I live in Palatine, IL. It has been a few months since your message, so I am not sure if you will get this. My mom is 52 years old and was diagnosed with breast cancer in her liver in December 2002. She had breast cancer previously (about 2 yrs. ago), and she had a mastectomy. They biopsied lymph nodes, and said that she was cancer free. However, the cancer metastasized to her liver, and docs say that it has been there for a few years. Her doctor has put her on Arimidex only. He has not been very receptive when it comes to talking about other kinds of treatment. He just keeps saying that the pill (Arimidex) is doing well for her (preventing growth of the tumors in her liver, of which there are approx 5-7. I don't know what to do. I feel very lost, and my mom is being very passive about the whole thing. I just want her to get the best care possible, and there are so many new treatments. HELP! Maybe you can offer some advice or insight. I hope that you are doing well. God Bless you; you will be in my prayers.",
      "MessageIndex": 4,
      "PostDate": "12/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    },
    {
      "AuthorID": "Tracy_N",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Tracy_N",
      "Content": "Hi Betty, Thanks for your reply. I appreciate it. How long ago were you diagnosed? This is still pretty new to us. My mom also had a second opinion at Froedert (in Milwaukee, WI - my parents live in Kenosha, WI), and that doctor strongly suggested chemo. My mom instead chose to continue to go to the oncologist closer to where they live, and not to undergo chemo for right now. I think her main objective is also to have the highest quality of life possible, and I think that in her opinion, the cost of the chemo would outweigh the benefit. I just wish that her current doctor would offer her other options. I feel like he thinks his way is the only way. How often do you go to the doctor? He has my mom come approx every 2 months. I also have kind of dumb question - I don't know what \"tumor markers\" are. I haven't heard this phrase yet. Last time I went with my mom to the oncologist (April 16), I asked how many tumors there were exactly, and he said, I don't know; I didn't count them this time!!!!! I couldn't believe it. He knew that there were somewhere between 5-8. I am not sure of the size of the biggest one. Do you have any pain in your body? My mom often complains of her side hurting. A nurse told me that it was common to have this kind of pain with liver cancer. Also, do you ever get sick? My mom sometimes gets very ill with flu-like symptoms (vomiting, nausea). Her doctor doesn't seem to believe that it's related to the cancer. I don't know what to think. I just worry about her. I am 24 years old, about to get married next year, and my mom is my best friend in the whole world. I love her so much and just want the best for her. I wish I could send her to the best doctor in the world. Anyway, thanks again for listening. Please keep in touch and good luck to you. It sounds as if you have a wonderful spirit. I admire that. Take care and God Bless. Thanks, Tracy",
      "MessageIndex": 6,
      "PostDate": "13/06/2003",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,675,0.htm",
      "Title": "Breast CA-now mets to liver and bone"
    }
  ]
}