{
  "AuthorID": "Travelfromhm",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Travelfromhm",
  "Posts": [
    {
      "AuthorID": "Travelfromhm",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Travelfromhm",
      "Content": "re: breast to bone cancer I'm a daughter of a 3x metastatic breast cancer survivor, but i do have a BS in Public Health (chronic disease prevention & education - not a clinical degree) & have been advocating for my Mom since her 1st go round in 1996. Perhaps some of my opinion may be useful or supportive. Congradulations on your fighting spirit! Find someone to attend appts with you, who will suppport your wishes & concerns. Someone who is a good listener, and will challenge to status quo if necessary. While your lining up your personal support retrace your steps to find a conventional medical team who will listen to you, the patient. They must allow you to be part of your medical treatment team, it's your body & you sound as though you're in tune with messages it sends out. If doctors or nurses aren't listening ask around in the profession for recommendations. I ask them, if the patient was you, your Mother or Sister is this the treatment (tx) you'd support for them, and why? Keep asking for copies of blood work results and a copy of the normal ranges for each test result. Demand if necessary, their all your (you own them) medical records, blood work, scans, xrays, studies, ect. Hospitals, clinics, private doctors offices are the best keepers of these files, but you may want them for reference. Push for satisfaction in diagnosising all you aches, pains, weakness, inflamation, anything out of the ordinary. If your medical history or family history doesn't support the arthritis, keep pushing for knowledge, diagnostic information, treatment and support until you feel as confident as possible.  Hope some of this is helpful. My Mom is 75, radical mascet in 1996- including 9 lymph nodes, cancer was stage 4B. Result- no lymphedema & cancer free for eight years. 2004, metastaic breast cancer behind the breast bone (sneeky bugger floating around, looking for a weak spot). After nurses & doctors who were not clued in, made assumptions, & told her she was dying of lung cancer - were called to an inpromptu meeting by me, and asked to stop with the assumptions unless they had a definitive diagnosis and all the test report findings. Boosting her spirits took some doing, but getting clarification from the diagnostic/treatment doctors helped. But then, I had a bit more knowledge to draw from when asking questions. Mom went through very focused radiation 31 fractions and took femara until 3/07. pain she had endured since the previous november, dehydration, and possible TIA resulted in me spending nearly 4 hrs off and on one day with her med. oncologist arranging for her hospital admission. She says she doesn't remember that day, but admits the following 4 days in the hospital were a restful vacation during diagnostic testing (five test in one day - with me comforting, humoring, and policing the technicians - while listening to their comments & TAKING NOTES). Otherwise I could never have filled in my family and Mom's aging husband. She withstood 13 of 15 very intense radiation fractions to her lower back, hips, pelvis & femurs. The welts in the vag & rectal areas were the obstacle. She's recovered from the tx and taking megestrol along with nutritional/dietary supplements to boost her immune & cardiovascular systems. God Bless you & yours, and good luck!  ",
      "MessageIndex": 1,
      "PostDate": "19/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13597,0.htm",
      "Title": "Breast-to-bone cancer"
    },
    {
      "AuthorID": "Travelfromhm",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Travelfromhm",
      "Content": "  On 6/21/2007 Willowwillow wrote: Thank you so SO much! Your experience and expertise are invaluable and I appreciate it all. Wow! I am amazed at what your mom has gone through and understand fully that it is what I would do as well. Daughters and mothers, such a strong bond. What an amazing role you've played in her life since the beginning of her cancer journey. God blesses you.  I did have a friend who took notes in the beginning. She was a great listener and note taker but not so good at defending me when I was upset, confused, or othwise frustrated. She doesn't like conflict. Neither do I but I agree that it's MY body and it's MY life so I have learned to deal with conflict just not the science of it all. I'm learning. What I am good at is writing about my experience and drawing - my majors in college. In fact, I did poorly in science but managed to pass. Here's where my learning comes in - I have to! Thank you so much. I really get that they will give you the runaround when they don't know and don't have time or are willing to get honest with me. I understand that knowledge is power and I'm more likely to get an answer if I ask the right questions. I've been doing research on the internet (thank God for this, eh?) and understand more about CEAs and CA counts and other terms. In fact, I asked my nurse on friday to slow down and explain to me everything and though she did and I did write it down...it still remains a mystery about whether or not it's arthritis in my rib and femur or if it's bone cancer that has \"quieted down\"  which is what I think it is. Although I'm so afraid to leave the place (Seattle Cancer Care Alliance) I found to be the best, I am not afraid to switch oncologists. The hospitals who treat around here feel like \"herding\" vessels for so many people going through with all sorts of problems versus a cancer-specific treatment center through the University which I prefer. Now I need to find a good team willing to listen and respond  Are you going to Michael Moore's movie, \"Sicko\" when it opens June 29th? I know I'm going to be enraged with it because it really opens up the facts about the health and insurance industry...something we both know is a mess. To close, thank you again for all your words and the fact you took the time to write. I dont' know where you are but THANK YOU!!! I'll include you and your mother in my prayers and think of you when I get my new doctor.   Hello WillowWillow, I hope you're diagnostic team has moved ahead, all on the same play book. Conflict is the battle you are waging against any cancerous cells trying to invade your healthy cells. There is the oncological (medical/radiation/chemotherapy) strategy coupled with strategies based on your faith, building of educational knowledge on the treatments/side effects/ and outcomes of fighting cancer, and homeopathic & nutritional supplements. The later two I mention with a great deal of caution, everyone seems to have their opinion on what helps them, or some unknown person, WILL automatically also heal you. What I've learned in the past many years is that cancer adapts to the individual, so the strategy we developed to fight my mom's cancer was very individual. We let the oncologist know we were going to try nutritional supplements, and what they were. Back in 1996 my mom did a parasitic cleanse for three weeks. It included wormwood(capsules), cloves(drops) and black walnut(capsules). I have seen this combo in intestinal parasitic blends (capsules) in organic & natural food stores. Wish I still could get to the Natural Food Pantry in Anchorage, if it still existed. At the time my knowledge was based more on nutrition & environment. I suggest you read Prescriptions for Nutritional Healing, by Balch & Balch and the Cancer Treatment Center's former nutritionist's book, Beating Cancer Through Nutrition (I'm not positive of the title). Both books are extremely informative. Scientific American (July '07) Beating Cancer by controlling inflammation. If your body or medical regime cannot include a cleanse right now, you can always try one down the line. Please continue to be strong, brave and on top of your health issues. I will also keep you in my prayers and be in contact via cancer compass. \"Sicko\", no, I won't be going. I learned the truth about western civilization's medical delivery systems as a student at OSU in Corvallis, Oregon class'03. I figure Michael Moore is just spreading enough half truth/fiction to aggravate people. I try to find comedies, even the ones for children. Laughter improves the immune system. Pretty intense of me I know. When you have some time and support handy read on for my suggestions. My mom is taking this regimen and was even during radiation, with no objections from her oncologist. I'd like to suggest you taking Barlean's Highest Lignan Flaxseed oil (kept refrigerated) good for all women. Combine with cottage cheese. Therory is that the lignans of the flax oil work super well with the sulfur in the cottage cheese. Cottage cheese supposedly has the highest sulfur content of all dairy. The flaxseed is gaining acceptance from the conventional medical community because it is believed to attack tumor growth, cut off the tumor's source of nutrition and thereby slow or eliminate the growth of cancerous cells. Twice a day my mom takes 2 oz. in 1/2 cup of cottage cheese along with organic canned pineapple or pears. The pineapple is good for reducing body inflammation. Inflammation & pain control also can help hinder cancer's progress. Also the cottage cheese is a good supply of protein. Other nutritional supplements include Garlic Factors (brand) garlic 150 mg taken with Now CoQ10 enzyme 150 mg, one of each 1x a day. This is to help her cardiovascular system recover from the intense radiation fractions. Next is to make sure the immune system has good support. If it's working the blood work results will show declines in elevated cancer indicators, and Mom really feels a difference. Alpha Lipoic Acid (Lipoic Supreme) 300 mg capsules, one  3 times a day. This aids the CD 4 cells in the immune system to mobilize, identify and catabolize the weakened and dead cancer cells. Remember, our bodies have the lifelong ability to produce bone density, pity we can't grow taller :)  This strategy is aimed at living a quality, comfortable, and strong life for my Mom's constitution. You will need to consider your own individual health dynamics. She uses plastic untensils, paper plates, filtered water (plenty, plenty), and as much organic food choices as financially feasible. Speculation: environmental causes of cancer and/or agitators of hormones; metal (hence plastic untensils). I've also read in Scientific American (july issue) that it's important to keep inflammation to a minimum, inflammation ( as with pain) excites cancer cells. my mom is doing well physically, she doesn't have any pain and has gotten stronger after recuperating from the radiation. Mentally (more emotionally) she is very fragile, possibily more from the aging process than the worry of when cancer may return. I'm working on getting her a peer counselor thru the local mental health dept. take care",
      "MessageIndex": 5,
      "PostDate": "24/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13597,0.htm",
      "Title": "Breast-to-bone cancer"
    },
    {
      "AuthorID": "Travelfromhm",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Travelfromhm",
      "Content": "  On 7/23/2007 Mathnerd wrote: I had  a mammogram,ultrasound, and an MRI.  Now they want to do a Biopsy.  Should I be concerned?  I have know idea what the heck is going on, I am so confussed!!!!!!!!!!!! Hi, I can tell you're brave, you're asking questions, looking for answers & moving ahead to find the diagnostic tools that confirm a problem exists or belay your fears. I would need someone (friend/family) to help me thru the unknown until the results come back. Someone to kindly hound the doctors for answers & proof. knowing is better than not. My Mom has had metastatic breast cancer 2x the last diagnosis was march 07. She too is brave. She is beating the odds, doctors are baffled by her resilience. You too are brave. Those tests will confirm or disprove. Just get the diagnosis done accurately & competently. God Bless & Good Luck",
      "MessageIndex": 1,
      "PostDate": "23/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14642,0.htm",
      "Title": "So many test, I am confussed!!!!!!!!!!!!!"
    }
  ]
}