{
  "AuthorID": "trinitybc38",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinitybc38",
  "Posts": [
    {
      "AuthorID": "trinitybc38",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinitybc38",
      "Content": "Hello, my name is Trinity, I am now 39 years old and have been recently diagnosed with invasive ductal carcinoma of the left -sided breast, grade 3 IDC of 1.8 cm, negative margins, no lymph node involvment or LVI, with a triple negative pathology. I also underwent a left breast mastectomy and sentinel lymph node biopsy on January 24th,2018. 6 sentinel lymph nodes were clear. Currently my case is in review with the tumor board and they will be presenting me the treatments they suggest for me soon I hope. AS OF FEB 20TH,2018 I WAS TOLD I AM CANCER FREE!!!! BUT............. also at this follow up appointment NOW  THEY'VE RECOMMENDED CHEMO and RADIATION, anyone else think there's a problem with this? Or in the same situation? What did you choose to do? How we're you feeling at that moment? Me, I just started balling my eyes out! I was so sad, so much has been going on in my life. I'm recovering well, but I can defiently say I've had a few \"moments\" already. But more so I can't seem to get out of my own head lately. Overall, mind you I think I've done pretty dam well considering. List of events: -diagnosed with BREAST CANCER in Oct and by the end of the month had to quit my job,  almost lost my father who was hit by a car in Nov; he broke his pelvis, ribs, staples in his head, amongst other injuries that doctors had said he may never be able to walk again. Well to our surprise he was able to go home just in time for his 59th birthday in Dec. With a back brace to help him walk . To date he's still recovering. Has a bit of brain damage and emotionally messed up a bit but hopefully time will tell. He's doing very well for the position he's in at this moment. Christmas has arrived, now I've used my savings, to get threw the hoildays and credit cards to pay bills and such. Oh.........I didn't mention, I have 3 daughters ages 18,15, and 10. January my youngest daughter turned 10, just before this she figured out that I had cancer just by chance one day, she found my Setinel node biopsy and mastectomy booklet. Not long after that we then burried one of my grandfathers at the age of 85.  Wait there's more........mind you this whole time  lmy husband, our children and myself also live with my husbands grandparents ages 86 and 92,  his grandfather has been up and down the past few years. That in it self hasn't been easy. Who cared for him, my husband............in our home and with our deepest sympathy's on Feb 17th, 2018 he passed away. We then had to wait a week to lay him to rest. Now here we are.....AND I'M IN MY OWN HEAD MORE THAN EVER.  I'm not the person I used to be and I don't like it!  So this weekend I'll be attending the Landmark seminar. Here's to the weekend and me finding myself again.",
      "MessageIndex": 0,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,135106,0.htm",
      "Title": "38 yrs old recently diagonsed with idc"
    },
    {
      "AuthorID": "trinitybc38",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinitybc38",
      "Content": "I'm in this similar situation. Was completely in good spirits as well , surgeon also said the same thing that there should be no need for chemo or radiation. Then \"BANG\" they used those words at my follow up. Now I'm finding it really hard to stay positive. Doing research helps a bit but I find the more I read the more confusing I'm getting. Positive and negative information, how the hell are you suspose to keep an open mind. I had my husband with me at all my appointments due to the fact that I/we as the patients are like \" a deer in headlights\" . They come after us when we're down. Trust me you're not the only one who is falling apart. How are you feeling now? What did you end up doing for treatment if any?",
      "MessageIndex": 4,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,134823,0.htm",
      "Title": "Triple Negative IDC"
    }
  ]
}