{
  "AuthorID": "trinivio",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinivio",
  "Posts": [
    {
      "AuthorID": "trinivio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinivio",
      "Content": "I am a new member. I'm a six year breast cancer survivor, I took Tamoxifen for five years, and have been on Arimidex for just over 1 year now. My oncologist told me that I must now take Zometa every 3 months. because Arimidex causes osteoporosis. I didn't have a bone density test. I've so far had one treatment of this 15 minute injection, the side effects were lots of pain, which after 2 weeks i'm still experiencing, plus upset stomach and loss of appetite. I've been told that I have to have this treatment for the rest of my life, which, I think is a hard pill to swallow. Is anyone here on Arimidex and receiving this kind of treatment, or have been told that they must have it? God bless.",
      "MessageIndex": 0,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25372,0.htm",
      "Title": "Arimidex and Zometa"
    },
    {
      "AuthorID": "trinivio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinivio",
      "Content": "Thanks so much for your replies to my message. The Arimidex did not cause any pain for me, it was the zometa that caused the pain. I am going to try to get them to do the bone density test before I go back to see my oncologist. I really do think that it should have been done before I started on the Zometa.  I'm really going to check out all of my options before I take another dose. God bless. Violet",
      "MessageIndex": 3,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,25372,0.htm",
      "Title": "Arimidex and Zometa"
    },
    {
      "AuthorID": "trinivio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinivio",
      "Content": "I took tamoxifen for five years and if I suffered side effects I never noticed. After five years, I was taken off Tamoxifen and put on arimidex, I  have had no side effects, haven't gained any weight. After one year on Arimidex my oncologist told me that he had to put me on Zometa, because Arimidex thins the bones. I was very upset about having to take another medication to offset that sideeffect, but, I decided ,if that was what I had to do to survive, then, so be it. I have been on Arimidex now for two years. Sometimes at the start of a new medication, you may experience side-effects that go away after a little while. We all have to do what we think is best for us. Good luck with whatever decisions you make. God bless. Violet",
      "MessageIndex": 16,
      "PostDate": "24/04/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,35501,0.htm",
      "Title": "Arimidex and side affects"
    },
    {
      "AuthorID": "trinivio",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/trinivio",
      "Content": "I too am on Arimidax and I have to punch out one every day, the one advantage I find with the strip packaging is that the days of the week are in, so that if you miss a day, you know it. I am taking more than one pill a day for other ailments, sometimes you forget which bottle you took from, can't happen with Arimidex where the days are shown.",
      "MessageIndex": 4,
      "PostDate": "30/10/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29812,0.htm",
      "Title": "Arimidex Packaging"
    }
  ]
}