{
  "AuthorID": "tuckersmimi",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
  "Posts": [
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 05, 2015 11:53 PM myaveo wrote: Good luck to you,I had an ultra sound that showed 3 spots? I'm a nervous wreck ,its the waiting haven't had my biopsy yet,got to see my regular doctor,first I'm scared that's for sure hope your OK  I know this is hard to do. Been there so I know it is, but try your best to just be calm and try to focus on positive thoughts.  My surgery is over and done and for that I'm thankful. The surgeon found a few cells in the sential (sp) node but he stressed very few. I guess it will be up to my oncologist to make suggestions about my treatment. The wish of luck to you.  Bobbie",
      "MessageIndex": 22,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 16, 2015 6:31 AM stitchboots wrote: Hi, I have just read your message. My name is Beverley and I was diagnosed two years ago with BC. I know it's hard but try not to be frightened. Being positive, chin up and just take whatever you go through, one day at a time. It is scary, scary of the unknown. I went through twelve months of treatment, chemo, radiation and herceptin. Now on Tamoxifen for the last 18 months. I wish you all the best Thank you so much.  It is so reassuring to hear from some one that has traveled this journey before you. You are so kinds to take the time to comment to my message. ",
      "MessageIndex": 24,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Sep 30, 2015 2:38 PM Carol13 wrote: Well thank you for sharring this information with me. I did just have the lumpectomy done as well. waiting to start the radiaton next. Most likley next week. You did make me feel so much more better. Stay well, hug. Carol13 I am seeing my oncologist for the first time today. Yes I am a nervous wreck now, and my appointment isn`t until 1:00. Three hours from now. In the very beginning after my surgeon`s visit I too was leaning toward a lumpectomy. My surgeon says mine is early stage, low grade, and doesn`t think lymph nodes are involved. Of course only surgery time will tell that for sure. I am now having a terrible time deceding which way to go... I`m being very honest here. I am seriously thinking of having a Mastectomy and fore going the radiation. My only sibling ( much younger sister) died at 49 years of age from lung cancer. I am a witness of what radiation did to her and I am TERRIFIED to have it done to me... I need some encourgment here. Good luck to you Carol13...I honestly wish you only a healthy, happy you..That goes for everyone here on this message board...                                       Bobbie",
      "MessageIndex": 15,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 05, 2015 11:53 PM myaveo wrote: Good luck to you,I had an ultra sound that showed 3 spots? I'm a nervous wreck ,its the waiting haven't had my biopsy yet,got to see my regular doctor,first I'm scared that's for sure hope your OK  I know this is hard to do. Been there so I know it is, but try your best to just be calm and try to focus on positive thoughts.  My surgery is over and done and for that I'm thankful. The surgeon found a few cells in the sential (sp) node but he stressed very few. I guess it will be up to my oncologist to make suggestions about my treatment. The wish of luck to you.  Bobbie",
      "MessageIndex": 27,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "I had a core biopsy last Friday Sept. 12. on my right breast. Today my GP called me with the news that we all fear. She says I have a low grade treatable cancer.  I have an appointment with her at 9:00 tomorrow morning to discuss my options and to talk about the oncolgoist visit. I am terrified. I will say I am 72 years old so far from young. I am just needing some positive thoughts from some of you that have gone through this journey before. Right now I`m unable to even think.",
      "MessageIndex": 0,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Sep 30, 2015 3:05 PM Carol13 wrote: Hi Bobby, The lumpectomy is the way most of us early stagers are gong with great long term success. Talk it over with your surgeon . The lympnodes would be my determing factor if I were you. But if the masectomy is what you want then do it . You are the one in charge here ,not the doctors. If it will give you peace of mind then so be it. Please know you are not alone. We are here for you. I send you prayers ,positive energy and the biggest hug! You will be ok. Carol13 Thank you Carol so much. My decision has been made and I will be having surgery on Monday the 5th. I did not go into complete details with my fear of radiation but let me just say, that both my mom and sister had cancer. My mom pancreatic cancer, my sister lung. Both had not so good results with it.:(  I just feel this is the best for me and I am at peace with it. I`ll continue praying for everyone here and thank you all for doing the same for me.<3   Bobbie",
      "MessageIndex": 18,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 03, 2015 12:28 PM Commett wrote: I had stage 2 invasive ductal Cancer and I chose a mastectomy so I did not have to have radiation. I had only the chemo. I am 6 years out and doing well. I am praying for all here! Commett Thank you for the encouraging words. That is the path I have choosen to take too. Because my HER2 was in the grey zone, and until more testing is done, and until they get a clearer pictiure of it, I am not sure if chemo is on the table for me or not. Maybe only hormone therapy.  I guess I will know more when I see my oncologist on November 11th. Thank you all for continued prayers.",
      "MessageIndex": 20,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 16, 2015 6:31 AM stitchboots wrote: Hi, I have just read your message. My name is Beverley and I was diagnosed two years ago with BC. I know it's hard but try not to be frightened. Being positive, chin up and just take whatever you go through, one day at a time. It is scary, scary of the unknown. I went through twelve months of treatment, chemo, radiation and herceptin. Now on Tamoxifen for the last 18 months. I wish you all the best Thank you so much.  It is so reassuring to hear from some one that has traveled this journey before you. You are so kinds to take the time to comment to my message. ",
      "MessageIndex": 29,
      "PostDate": "16/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Sep 18, 2015 4:43 AM DeniseD51 wrote: On Sep 18, 2015 3:06 AM tuckersmimi wrote: Carol my gp that gave me my bioapsy report gave me an anti depressent drug so I could rest as I wasn`t sleeping either. It`s TRAZODONE (Desyrel) and it`s wonderful in that I can at least sleep. Yes I know that I can`t take it forever but for now it`s my miracle drug. I have an appointment with a surgeon on Tuesday for a consulte and the onacolioist on Sept 30th. I am glad you were able to get help with not being able to sleep. Getting proper rest is very important when you are stressed and worried about what is going to happen.  Before you meet with your surgeon make a list of questions or concerns you have. I always did this whenever I met with the surgeon or the oncologist. I would make a list in my head and forget it, so I learned to write it down! I also would take a pad of paper and write down the anwers he gave me. My docs were pretty good and took the time to explain things thoroughly so that I understood. I hope yours are the same. Good luck with your appointments, stay strong. D. Thank you for the idea to take pad and paper. I have started on my question list for the surgeon on Tuesday already. I`m starting to get stressed about meeting him. This is all so new to me, what if I just do not get good vibes about him when we met? Am I allowed to request an appointment with someone different? I just need all the advice and help that you here can give me. How long should I have to wait before surgery? That may be a dumb question because it probably depends on how busy the surgeon is. Another question what can I expect for the hospital stay to be? Thanks to you all for any answers.",
      "MessageIndex": 11,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Oct 03, 2015 12:28 PM Commett wrote: I had stage 2 invasive ductal Cancer and I chose a mastectomy so I did not have to have radiation. I had only the chemo. I am 6 years out and doing well. I am praying for all here! Commett Thank you for the encouraging words. That is the path I have choosen to take too. Because my HER2 was in the grey zone, and until more testing is done, and until they get a clearer pictiure of it, I am not sure if chemo is on the table for me or not. Maybe only hormone therapy.  I guess I will know more when I see my oncologist on November 11th. Thank you all for continued prayers.",
      "MessageIndex": 25,
      "PostDate": "03/10/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Sep 15, 2015 1:14 AM Carol13 wrote: Hello, I too am newly diagnosed with breast cancr stage one. It was given to me on August 28. I just had a lumpectomy done on september 3rd. I went in with stage two and surgeon said I am now stage 1. I hade a lymp node removed and it was found clear . (thank you GOD!) I see my surgeon tommorow for follow up. Then I next will be meeting an oncologist. I believe I will only need radiation treatment and will be starting that drug Tamoxifin. (spelling) I had my 58th birthday on Sept. 13th. Nice way to spend birthday hu? But sounds like you caught yours early too. You will be ok. My arm hurts more then breast area. But , its managable. I would love to give you any support or answer any questions you may have. Sounds like we may have much in common. I just found this website yesterday and so far I like it allot. Such nice people with this terrible plight we share. I will be here for you. Sending positive energy your way. Carol   Thank you Carol. This makes me feel so much better just to share things with people that are in the same club as I am now. I`m just ready to get this show on the road so that I can start to be healthy again. Excellet news that your lymp node was clear. I do hope and pray that I can come back here and report a good report as well. Good luck with your surgeon tomorrow and a Happy Belated (not by much) Birthday to you. Bobbie",
      "MessageIndex": 3,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "Carol my gp that gave me my bioapsy report gave me an anti depressent drug so I could rest as I wasn`t sleeping either. It`s TRAZODONE (Desyrel) and it`s wonderful in that I can at least sleep. Yes I know that I can`t take it forever but for now it`s my miracle drug. I have an appointment with a surgeon on Tuesday for a consulte and the onacolioist on Sept 30th.",
      "MessageIndex": 8,
      "PostDate": "18/09/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,86747,0.htm",
      "Title": "Newly Diagnoised"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On May 21, 2016 4:06 PM KettleKween wrote: I have a lumpectomy and 3 sentinal nodes removed April 6th. My underarm is till killing me. My breast is also still very sore and I am wondering just how long to expect this pain. I usually heal very quickly and this is disturbing to me. They make it sound like its nothing but if I had to do it over, I would have refused the node removal, for many reasons. I had a mastectopy last October with node removeable. I`m really sorry to say that I am still having underarm soreness and pain almost 8 months later. I have decided that maybe I will never be pain free. Also still have nerve burning pain and electorial nerve shocks. Really wish for you to be pain free very soon now.",
      "MessageIndex": 1,
      "PostDate": "25/05/2016",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,91970,0.htm",
      "Title": "Pain underarm from sentinal node removal-How Long???"
    },
    {
      "AuthorID": "tuckersmimi",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/tuckersmimi",
      "Content": "On Apr 21, 2018 7:45 AM Timetoenjoy wrote: Any positive suggestions.... New to blog Thank you Timetoenjoy I`ve taken Arimidex for almost 3 years. The not positive part is that I do have muscle and join pains.  The positive is. that it does improved with time and some added supplement pills. Good luck to you.",
      "MessageIndex": 1,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,136370,0.htm",
      "Title": "Starting arimidex"
    }
  ]
}