{
  "AuthorID": "Vanilla_Queen",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Vanilla_Queen",
  "Posts": [{
    "AuthorID": "Vanilla_Queen",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Vanilla_Queen",
    "Content": " Dear Beautiful Women, Tonight I became curious about liver mets from breast cancer and survival issues and came across this blog.  I have no idea how any of you who wrote in 2004 or later are doing, but in case new women find this blog and are frightened about liver mets, I felt I should share my story as it hopefully will provide some hope as you travel your journey with cancer. In December of 2003 I was diagnosed with breast cancer with mets to my liver.  I had a tiny lesion in my right breast, one very infected lymph node, and it had gone to the left lobe of my liver.  It was estrogen and progesterone positive. I was given Femara with the hope that it would help. I decided that with as dire a prognosis as this I'd be wise to really ramp up nutrition and do whatever else I could to strengthen my body.  Within two months the tumors in my liver had shrunk by 3/4; by November of 2004 there was no evidence of cancer. In September of 2005 the cancer had returned to my liver.  I went on a year of chemotherapy.  First my oncologist used Doxil, but I had a severe reaction to it.  I then went on Abraxane and Avastin.  I went into complete remission again in September of 2006. During all of this time I continued to work but I also continued to look for the best supplements to keep my body strong as well as kept up as much exercise as I could.  I also made sure to get at least nine hours of sleep each night. In February of 2008 I went to China and, while there, I visited an acupuncture university.  The doctors checked me very carefully and immediately picked up that I had had chemotherapy.  They said that there was fire in my liver but otherwise my body was very strong and healthy.  When I returned to the US there was, indeed, a tumor in my liver again.  For whatever reason, the cancer returned to one spot and was not in pieces through that part of my liver or anywhere else. The tumor was 6.2 cm. I had spoken with a thoracic oncology surgeon at UCSF, Dr. Robert Warren, in 2006 about liver resection therapy.  I returned to talk with him in April of 2008.  He indicated that I would be an excellent candidate for surgery as my body was so strong.  I had surgery May 13, 2008.  I had anticipated a rough recovery.  In fact, it wasn't nearly as difficult as I had anticipated.  I had no complications and was at the computer within five weeks of surgery!  It has been 13 months since surgery and there is no evidence of disease. Each of our journeys is very different and each of us has different responses to treatment.  I'm extremely drug-sensitive and I knew that chemo would not be easy for me. I have no idea if the supplements and a focus on nutrition I have followed are in any way responsible for the good response I've had to date, but I do know that being strong has made my quality of life much better.  I certainly don't take for granted that I have managed to live well for 5-1/2 years post-diagnosis.  I hope that this might provide some measure of hope for any of you who might read this.  While we may need to be in treatment for life, you may live for many years despite a scary diagnosis. Patricia Rain   ",
    "MessageIndex": 52,
    "PostDate": "13/06/2009",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1311,0.htm",
    "Title": "Breast Cancer Metastasi to The Liver"
  }]
}