{
  "AuthorID": "vee345",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
  "Posts": [
    {
      "AuthorID": "vee345",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
      "Content": "My friend had her first chemotherapy session today, and since she's gotten home, she's had severe nausea and vomiting. From everything I've read and heard, it isn't normal to be this sick after the first time. She's on cytoxan and taxotere. If anyone has any idea on why she's getting so sick or any tips to help with the nausea, we would really appreciate it. It's tough to see her feel so bad. Thanks and God bless, Vee",
      "MessageIndex": 0,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40416,0.htm",
      "Title": "Nausea and vomiting on the first day?"
    },
    {
      "AuthorID": "vee345",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
      "Content": "Sewwonderfulwoman- He has prescribed several anti-nausea drugs for her, but nothing seems to be helping. We've been making sure she's following the directions and eating foods that are easy on the stomach, but no luck. We'll give him another call, though. Thank you for your help. God bless, Vee",
      "MessageIndex": 4,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40416,0.htm",
      "Title": "Nausea and vomiting on the first day?"
    },
    {
      "AuthorID": "vee345",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
      "Content": "Teresa, thank you for your help. Did you have acupuncture a few days in advance to your treatment, during, or after? And also, was it covered by your insurance? She agreed to finally look into it since she has been able to find a good drg combo that helps.",
      "MessageIndex": 3,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40416,0.htm",
      "Title": "Nausea and vomiting on the first day?"
    },
    {
      "AuthorID": "vee345",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
      "Content": "My friend was just diagnosed with stage I breast cancer. She's very lucky to have caught it so early, but she's running into some problems with her insurance company. Does insurance have to cover the complete cost of reconstruction surgery/surgeries? She would prefer to have reconstruction done, but finances are extremely limited at the moment and she cannot afford what the insurance company says it will not cover. Thank you for reading and bless you all on this fight.",
      "MessageIndex": 0,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39590,0.htm",
      "Title": "Reconstruction and Insurance"
    },
    {
      "AuthorID": "vee345",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/vee345",
      "Content": "Jodie, thank you so much for your input! I was looking for something exactly like that mandate to bring up with the insurance company. It’s very helpful. You’re in my prayers, and I hope you continue to beat this monster!",
      "MessageIndex": 2,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,39590,0.htm",
      "Title": "Reconstruction and Insurance"
    }
  ]
}