{
  "AuthorID": "veggienft",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
  "Posts": [
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "On Feb 29, 2012 9:24 AM andy73 wrote: recommend looking thru the 'diet' and 'supplement' sections on this site also. Diet can be just as important, if not more so, than any drug or supplement. For example, they've found in clinical study that saturated fat consumption can cut a C patients survival time by 1/2 What utter hogwash. Your experiments, the important \"they\", fail to test sugar ingestion against fat ingestion. Oh wait, you didn't cite any experiments, did you?",
      "MessageIndex": 5,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64768,0.htm",
      "Title": "Chinese Herbs"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "On Mar 01, 2012 1:18 AM andy73 wrote: http://nutritionfacts.org/videos/saturated-fat-cancer-progre ssion-2/\"\" target=\"_blank\" rel=\"nofollow\">http://nutritionfacts.org/videos/saturated-fat-cancer-progre target=\"_blank\" rel=\"nofollow\">http://nutritionfacts.org/videos/saturated-fat-cancer-progre The reasons (or mechanisms) for these outcomes are clear to someone having taken Nutrition 101 and/or one class in biochemistry So lemme get this straight. I alluded to the fact that all studies which conclude that saturated fat causes cancer or any other chronic disease fails to isolate saturated fat ingestion from carbohydrate ingestion. Then I pointed out the fact that you had not in fact referenced any study ......ANY study. So my challenge to you provided you with all the time you needed to overcome the fat vs sugar dictum. And what study did you choose to link? A study which varies the intake of wheat-covered fried chicken. Hahahahaha.... So I'll give you another try. Show me a study which actually isolates carb ingestion from fat ingestion, like you said in your claim.",
      "MessageIndex": 16,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64768,0.htm",
      "Title": "Chinese Herbs"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": ".....still waiting.",
      "MessageIndex": 18,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64768,0.htm",
      "Title": "Chinese Herbs"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "On Mar 01, 2012 1:18 AM andy73 wrote: http://nutritionfacts.org/videos/saturated-fat-cancer-progre ssion-2/\"\" target=\"_blank\" rel=\"nofollow\">http://nutritionfacts.org/videos/saturated-fat-cancer-progre target=\"_blank\" rel=\"nofollow\">http://nutritionfacts.org/videos/saturated-fat-cancer-progre The reasons (or mechanisms) for these outcomes are clear to someone having taken Nutrition 101 and/or one class in biochemistry So lemme get this straight. I alluded to the fact that all studies which conclude that saturated fat causes cancer or any other chronic disease fails to isolate saturated fat ingestion from carbohydrate ingestion. Then I pointed out the fact that you had not in fact referenced any study ......ANY study. So my challenge to you provided you with all the time you needed to overcome the fat vs sugar dictum. And what study did you choose to link? A study which varies the intake of wheat-covered fried chicken. Hahahahaha.... So I'll give you another try. Show me a study which actually isolates carb ingestion from fat ingestion, like you said in your claim.",
      "MessageIndex": 10,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64768,0.htm",
      "Title": "Chinese Herbs"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": ".....still waiting.",
      "MessageIndex": 12,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,64768,0.htm",
      "Title": "Chinese Herbs"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "Cancer happens when cells stop burning food for energy and start fermenting sugar for the creation of mutated tissue. Differing parts of the body attempt to lose differentiation, and start becoming a single mass of undifferentiated tissue.",
      "MessageIndex": 0,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66170,0.htm",
      "Title": "What is cancer? No, I'm serious."
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "Your question is the most important question which can be asked about cancer. Most people have heard of mitochondria, but don't know what they are. Mitochondria are tiny \"organelles\" inside of cells, but outside of cell nuclei. Mitochondria create and sustain life. Mitochondria perform multiple tasks, probably the most important task is metabolic. Mitochondria create adenosine triphosphate (ATP). Cells use ATP for energy. People start out as single stem cell organisms ......a nucleus with DNA-filled chromosomes, surrounded by cytosol. Mitochondria exist in this cytosol. Mitochondria communicate with DNA in the chromosomes through epigenetic proteins. As cells divide mitochondria direct them to differentiate into cells which perform specific functions .....nerve cells for transmitting impulses, pancreas cells for making insulin, muscle cells for working, etc. Mitochondria even arrange cells so that each cell goes where it's needed. Mitochondria can only perform these tasks in conjunction with our DNA. But still, mitochondria are the little workhorses which make it all happen. Mitochondria are the builders of life. Mitochondria are thought to have been an infectious microorganism extremely early in life evolution. Instead of harming its victims though, mitochondria helped them to survive and flourish. Human cancer cells are mutated human cells. Some cancer cells might have vestiges of mitochondria left in them, but they are essentially mitochondria free. Cancer represents the shutdown of both major functions of mitochondria ......differentiation and metabolism. Cancer of any particular type represents cells which are all the same, undifferentiated. Cancer cells use the same type of metabolism which bacteria use. They ferment sugar. Mitochondria have requirements for staying healthy. One of them is fat. Mitochondria perform their duties through membrane actions. As with all membranes mitochondria membranes are mostly composed of lipids .....phospholipids and glycolipids. Lipids are made from fat. One of the most heinous hoaxes foisted off on an unsuspecting Western populous is the advice that fat is bad for people. Fat is good for people.",
      "MessageIndex": 1,
      "PostDate": "14/05/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,66170,0.htm",
      "Title": "What is cancer? No, I'm serious."
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "Cachexia happens to end-stage cancer patients. Cachexia is characterized by the inability to move or respond to anything. Cachexia highlights the fact that cancer represents the failure of cellular metabolism, and the replacement of diversely-functional insulin-resistant cells which can't feed themselves with non-functioning cells which feed on glucose. So whole body metabolism is the driving force, and not some isolated weakness. Unless you change your diet to eliminate the insulin resistance, and stop feeding the cellular metabolic mutation, expect a takeover.",
      "MessageIndex": 7,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1162,0.htm",
      "Title": "Link Between Breast Cancer and Ovarian Cancer"
    },
    {
      "AuthorID": "veggienft",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/veggienft",
      "Content": "I know this is hard to accept. In fact 70% of cancer patients, when given the chance to live via a ketogenic diet will reject it. You said that you need to live in order to be a mother to your children. If that's true, then you will go immediately onto a ketogenic diet.",
      "MessageIndex": 8,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,1162,0.htm",
      "Title": "Link Between Breast Cancer and Ovarian Cancer"
    }
  ]
}