{
  "AuthorID": "Velvetjb",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
  "Posts": [
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "I have had faslodex for about 17 months and originally had shots in the bottom. Afterwards I would have a lot of redness, swelling, then pain for about three weeks. Then my nurse gave the shots in the thigh which really helped, these were very good for a couple of months but the latest trick is to divide the dose. Half the dose goes into the top of the thigh and the other half into the bottom. I have had no pain whatsoever, no swelling and no redness.",
      "MessageIndex": 0,
      "PostDate": "19/11/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3529,0.htm",
      "Title": "Faslodex Without Pain"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hi Mel, I read you reply from today but then the computer did something odd and i lost it. I was hoping you would join the forum recommended as I can give you my home email address. Then we can keep in touch. However I did read part of you reply re coming off the drug. Again I can't advise you but if you have been diagnosed with ONJ then all the info at the moment says come off it although there are one or two that say it doesn't make any difference because the drug is in the body for years. Get some way to a diagnosis with OPG X ray and bone density scan to see if your bones are 'up to scratch' Do you really need to be on the drug?  Hope this helps yo come to a decision Velvet",
      "MessageIndex": 11,
      "PostDate": "01/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hello Anita, I had exactly the same experience from Femara but not so much from Arimidex however when I was changed to Faslodex, the muscles and epsecially the hip pain is quite dreadful. I take morphine, I need it anyway for boney mets but it is the only way I can function. Like you and many others (just read the mesage board) we don't like taking tablets, especially the stronger ones but what are the options? - pain. I gave up in the end, give me anything for the pain and I take it. My choice is complain all the time, be in pain or get myself treated, does it really matter if I take a strong painkiller? At least I am able to do things that I couldn't previously and mentally I am stronger because I switch off from the pain and the cancer. The hot flashes (we call them flushes in UK) can be helped by phytoestrogens. Apparently it's not the reduction in eostrogen that causes the flashes but the fact that the hormone is up one hour(or whatever time period) and down the next, so it's the lows and highs that cause the problems. Phytoestrogen can balance things but check the research, look up peri/postmenopausal symptoms and ask your doctor before taking anything. Phytoeostrogen took about a month to kick in. Ask at the hospial for any information. Good luck, take care and keep well, Velvet",
      "MessageIndex": 3,
      "PostDate": "17/11/2005",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,3478,0.htm",
      "Title": "Femara Muscle Pain"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Has anyone had any jaw bone problems with bisphosphonates? Apparently some bisphosphonates can cause jaw bone necrosis. I can't find any information on how this now recognised adverse event begins. Yes, info on necrosis but not early symptoms. I have had bisphosphonate treatment for about 5 years. I have breast cancer mets to the bones. I have a piece of exposed jaw bone in my mouth on the lower jaw/gum. I haven't had teeth there for many years. It started about a year ago with a swelling and tendeness and progressed to a small abcess. A week or two after a piece of bone appeared and has progressively got bigger in height, length and width, now occupying the space of 3 double teeth and half as high. I have a dragging sensation, faint, dull ache, the gum gets sore and the side of my face is slightly swollen. My dental surgeon has no idea, her colleagues had a look and have never seen anything like it. My oncologist asked me to have an OPG X ray and said there was no evidence of necrosis (nor cancer according to the bone scan) but isn't happy that it is there and to see the maxillo-facial surgeon end Jan 06. If anyone has any experience of this kind of problem please reply, thank you, Velvet",
      "MessageIndex": 0,
      "PostDate": "20/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Thank you, Michael R for the info, reference my message number 1. Is this the way osteonecrosis begins? How does it progress? And what is done to remedy it? Can it be remedied? Thank you Velvet",
      "MessageIndex": 2,
      "PostDate": "23/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hello anyone out there with ONJ. It is 9 months since I first wrote about ONJ asking questions about how it progresses and whilst I have read a whole lot on the lawsuits and the correllation between bisphosphonates and ONJ I still can't find any case studies or hear from others with the same condition. So here I am reporting back on how I have been getting on. My jawbone continues to extrude through my gum (where back teeth had been removed from my lower left side some years before) It has got taller and longer and two holes have appeared. Inside the holes is soft squidgy tissue that bleeds quite often but oddly enough always feels better after a bleed. The holes have been the biggest problem as food debris gets into the holes and I have had several infections. I had pain from my temple to my collar bone, so much swelling in the gland beneath my jaw and in the back of my tongue that I didn't dare sleep through the night incase I asphyxiated and spent 4 days drinking through a straw, unable to chew or swallow solid food. I was in all consuming pain and had high doses of Metronidazole. I have some pain 24/7 but when it becomes infected it is incredibly painful. I keep records of any hospital/family doctor visit; what I asked , what was said, what was given etc. and I record too any problems or changes so have got some interesting news on the ONJ. What I noticed was about 10-12 days after my Zometa IV I had a growth spurt on the jawbone and extra pain too. I have stopped the Zometa (6 weeks now) and have had no growth spurt this month. I also know when an infection is beginning. Twice now the first sympton is a smell (rather than a taste) I wake up in the morning and the room seems to be filled with something like a sour/biscuit odour and within 24 hours I am in excrutiating pain, the gum deep red and swollen around the bone and the taste in my mouth is disgusting (just like a camel's). I told my family doctor this but he seemed doubtful, but I can only go on what I have observed. My Oral Max Fax surgeon has now seen 11 patients and still says I am the worst of all. I still rinse several times daily with hot salty water, I know it's not always possible to keep it up regularly but carry a little bottle of salt with me and an old aerosol lid for a cup so I can keep up the rinses when I am out. My Oral MF says salt is as good as anything, the mouthwashes made my gums sore and my teeth pink, (very pretty but not for teeth!) I am now considering something called debridement, where the surface dead bone is removed as the holes, one at each end lead to a cavity beneath the 'lid' of bone and food debris collects and I can't remove it but if and when the 'lid' is removed I am concerned about the exposed soft tissue beneath. I am also thinking of having a gum shield made so I don't hit the soft tissue with anything I eat yet can remove it to clean. I will feedback here any decisions I make. I think one of the things that concerns me most about ONJ is the drug companies' lack of response in advising patients as to how it progresses, the best course of management, yes, lots of advice on prevention but it seems once you have it you are left to get on with it. I feel incredibly angry and I am really fed up with, 'well we just don't know!' 'we will monitor!' 'it is a rare complication!' responses, it simply isn't good enough; drug companies out there ~ are you listening? Rare? Are the drug companies sure about this? And what does 'rare' mean to someone who is up all night crying with the pain, pain on top of their original bone disease. In the UK we seem to have less reported cases, this is probably due to the fact that the USA got licenced for bisphosphonates earlier than UK so our problems are just emerging. And as prescribing HRT has been reduced for osteoporosis (partly because women are more informed nowadays) and bisphosphonates have taken their place, I foresee this present 'tip of the iceberg' exploding in the coming years. I will post back here with any other information or just to have a moan, in the meantime stay well, Velvetjb",
      "MessageIndex": 7,
      "PostDate": "20/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hi Mel remember this... jot it down as I will fill in the rest when you join  dir.yahoo.com/Health/Chats_and_Forums velvetjg@uk   Hope all is well with you Velvet x       On 5/1/2007 Mella wrote: Thanx Velvet can you post a link for the yahoo forum... I am having trouble finding the site.  ",
      "MessageIndex": 13,
      "PostDate": "02/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "hello Mel I know it is ages since i was here last but i couldn't find this post again till today. It seems this site has ONJ under bisphosphonates, Zometa side effects. ONJ, Jaw problems and a few others ~ someone organising the site needs to read these and put them under one heading--Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html-- \" target=\"_blank\" rel=\"nofollow\">http://www.cancercompass.com/common/guidelines.html--  this is what you asked for over a year ago.  I hope this finds you Velvet On 5/2/2007 Velvetjb wrote: Hi Mel remember this... jot it down as I will fill in the rest when you join  dir.yahoo.com/Health/Chats_and_Forums--Message edited by CancerCompass staff. For personal protection, email address removed. Consider private reply. Please review CancerCompass Member Guidelines at http://www.cancercompass.com/common/guidelines.html-- \" target=\"_blank\" rel=\"nofollow\">http://www.cancercompass.com/common/guidelines.html--   Hope all is well with you Velvet x       On 5/1/2007 Mella wrote: Thanx Velvet can you post a link for the yahoo forum... I am having trouble finding the site.    ",
      "MessageIndex": 14,
      "PostDate": "18/09/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "hello lucymay i read your message with interest. being told not to worry about it isn't good enough. yes onj is rare but if you have it then it makes no difference if its rare or not. i think you need to see a good oral maxilo facial surgeon, one who is up to speed on onj. if the omf doesn't know anything about it then go somewhere else. you need the latest info and advice. telling you not to stop the fosamax isn't helpful either. i stopped having my bisphosphonate for about a year and my jaw condition did improve. some do not though. i think you should have an opg x ray, its a revolving x ray of your jaws and from this you could find out exactly what your jawbone is doing, once you know that you can take better advice.  apparently you don't have to have had cancer to get onj, just having had  bisphosphonates is likely to cause it. many lawyers have poor and wrong information on their sites so do go for medical advice from someone who knows what they are talking about.  one of the best things i have done over the years is to rinse 4-5 times a day with hot salty water. this is to prevent infection setting in. when the bone becomes infected the pain is something else and difficult to treat, clindamycin or metronidazole are the drugs of choice. i can't emphasise enough to find someone who knows about this condition... difficult i know because it is so rare.. but i suspect not as rare as its said to be for dentists fail to diagnose it, likewise oral max fax's haven't the wealth of experience either to diagnose it therefore it isn't reported. i am in uk but i am sure you have a reporting system where you are, to report the adverse effects of drugs. i mean patients can report themselves... not left to doctors to do it. you might get some help from the american dental society.. i have a feeling dentists have been informed and if you get on that site you might find some info. here in uk we say leave well alone, for healing can be a huge problem. do not go for any invasive treatments, not jaw cuttting of any description. if bone is coming through leave it, allow it to come through on its own. once its through the saliva degrades it and after a while it turns soft and tears away or you can have debridement, cutting all above the jaw line but not below, not flesh. i have heard of cases never ever healing. some have had titanium jawbone replacement but healing has been the biggest problem. prof. salvatore ruggerio  [marx et al ] at long island jewish medical centre new york is probably the world expert on this condition, type his name and onj and you will get all the current info. [marx is at miami univ i believe] check out the american dental society, maybe contact them for someone in your area who could look after you. don't change md until you find the one who knows what they are talking about. because i am in uk i find it difficult to suggest the best place to contact so if you find any one who is really very helpful please post here for the benefit of others... also check out the american osteoporosis site.... they have some onj info but also may help with osteoporosis advice. i hope you get the help you need.. there is a bit above to get you started  one last thing keep a diary of when you began fosamax, when you noticed any dental/bone/jaw changes with dates and descriptions.. should you ever think about a claim then you have the info in your diary but also for the medic who is going to look after you, it is invaluable  wishing you well lucymay... velvet jb x... uk   On 5/24/2009 Lucymay wrote: I found this site by Googleing \"Exposed jawbone in mouth\" I don't have cancer, although I have been treated several times for skin cancer and go regularly to my Dermatologist for checkups and treatment, as needed. A few months ago I was looking at my teeth and one of them seemed to be a little \"tilted\" (bottom teeth).  When I looked closer in the mirror and tried to see the inside surface of my tooth I saw something white on the gum beneath the tooth.   I have a dentist's type small round mirror on a long handle and I used this to check the inside of my lower teeth/jaw...and discovered two spots, one on the right side of my jaw and one on the left side beneath corresponding teeth.   Running my tongue over both of these spots told me they were hard (the left side also feels \"ridged\", the right side is smooth). I went to the dentist and he confirmed that it was bone tissue, specifically jawbone, not teeth bone.   He said it is not unheard of, but not common....maybe 5% of the population.   I didn't think, at the time, to remind him that I've been taking Fosomax for years.   Later I saw an advertisement in the newspaper pertaining to a law suit for several things, one being symptoms of osteonecrosis of the jaw (ONJ).   It listed several symptoms, the only one I have is the exposed bone.   I called my MD, who put me on Fosomax because I have osteaoporosis (sp?).   I told her about the jawbone issue, she said, essentially, don't worry about it and not to stop taking the Fosomax.   After a couple of weeks I decided on my own to stop the Fosomax. I appreciate the candid information and historys that you folks are writing about here.  I've been considering changing MDs, and now I think is a good time to follow through on that.  I like my present MD very much, but I have felt for awhile that I'm not getting the thorough attention that I think I need.   I'm a 77 year old female, in quite good health condition, and I'd like to keep it that way!  (grin)  ",
      "MessageIndex": 16,
      "PostDate": "25/05/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hello Madge, sorry to hear you have Br Ca mets, I do too and have done for over 5 years now and 10 years since the origal tumour. My oncologist here in UK says sometimes bone mets go on for years and years and you just go along as you would any other chronic (long term) disease. I was on Tamoxifen in the beginning, then Arimidex for 18 months, Femara for 21 months Faslodex for 15 months, and have only just changed to aromasin. I only changed when I knew for certain that the drug was no longer working and the disease had progressed and I knew this because I either gained new sites or suddenly went into uncontrolled pain where it had been controlled before. I have had great difficulty finding out what disease progression (and disease progression is the reason for changing your medication) actually means and now understand it to be, (either or both,) new tumours anywhere or bigger or more painful current sites. But someone may yet tell me something different??? Why we have to drag information out of the medics I don't know and there is no good reason for them 'playing with their cards so close to their chests'. I have bone scans every 3 months which gives me and the doctors the information.I like to know and see my bone scan result and have 18 sites at the moment, spine, pelvis, ribs and femur. I would suggest that you ask your oncologist if the Femara has stopped working and if so how does he/she know and why the colleagues thought what they did. You surely wouldn't want to give up a good drug because your doc 'thinks' it has stopped working. Don't be afraid to ask for clearer explanations or if they make a decision ask them for their reasons. Find out what sites you have and where, and ask for an update after your next bone scan, ask how this scan compares to the last. Keep a record of all your scans, the results and dates of starting treatment and any adverse events, also anything else you notice that seems different, e.g. swelling, tenderness or pain etc. The Aromasin made me very sicky the first week but settled. I just took anti nausea tablets. It has made me sweat a bit too and reduced my apetite. But the way it affects me may be completely different to how it will affect you. I don't know of any specific sites other than the makers/company site but because a drug acts differently on each person any information you find will be statistical, over a range of patients. Always look for 'evidence based' information. Regular check ups are the key to controlling the disease and 'listening' to your body because even if it was possible to find info that said, 'this is a really good drug, would you keep on taking it if it made you very ill in the process? What suits one may not suit another. I believe I have control over what I take and what quality of life I have and expect. I am 58 by the way. And something interesting here I name my sites with names I dislike, so my big site is called Cedric, another is my ex husband, Clive. A psychiatrist once told me this is good because naming your sites gives you power and power gives you a good feeling, increasing your drive and positive attitude. Good luck with going home, keep up the spirit and fight and I wish you all the very best, Velvet",
      "MessageIndex": 2,
      "PostDate": "12/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4009,0.htm",
      "Title": "Metastatic Breast Cancer"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Dear oncrx, Thanks for the info. I had read about jawbone problems and bisphosphonates but still can't find any info on how it begins, if what I am experiencing is the typical pattern. Today I have seen the maxillo-facial surgeon and he has seen two other patients with similar jawbone extrusion but mine is the worse. So he says he may be learning from me ~ which really doesn't help! He doesn't know how it will progress except he read about a case inwhich the bone sheared off, bled for a while (didn't say how long a 'while' was) and self healed. For the moment I am to be closely monitored, he suspects it is due to the bisphosphonates as so many are now reporting this condition, especially in USA. He is well versed in a similar ocurrence due to radiotherapy and at the moment is calling my problem osteosclerosis. The surgeon and my oncologist are to have a chat but I have told him I am reluctant to give up the bisphosphonate because it has kept blood calcium within normal levels and the mets stable. I have 18 sites in the , femur, pelvis, sternum, ribs and spine which have been stable for 3 years. I told him I thought I would be foolish to just opt out of a treatment at this point (give up the bisphosphonates)and he agreed. Even though I have a sharp edge on the bone the surgeon says put up with it if I possibly can as any interference always makes it worse. I think anyone interested in this article will just have to watch this space for updates ~ I will send a message with more news soon, Be safe, Velvet",
      "MessageIndex": 4,
      "PostDate": "25/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hello. Thank you for your post which I have only just seen. Yours is a very interesting case. Did your dentist describe your condition as osteonecrosis and have you had any follow up Xrays or scans to see how the rest of your jawbone is reacting? I only hope you do not have ONJ as it is quite a nasty condition. Has anyone explained to you why this might be happening? Has anyone else looked at your jawbone? I hope the bits of bone that came thorugh have disappeared and all is well for you now, thanks again for responding to my post.  Velvet (UK)",
      "MessageIndex": 9,
      "PostDate": "23/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4146,0.htm",
      "Title": "Jaw Bone Problems"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hello Gladys H/Novisi, you asked me how people survive? I wish I knew I would bottle it and give it away. I don't know how I do it, except for not only thinking positive but being positive, a subtle difference there. Whilst you are suffering because of your sister's plight, you must remember that throughout, it is her choice what she does. Cancer has no time scales, needs no qualifications and affects everyone differently. Whilst I have metastatic disease, I do not have any cancer in the soft tissues (organs) The only thing I can suggest is a second opinion and maybe a third. Her cancer may have spread so much that her major organs are affected inwhich case it is incredibly difficult to control but not impossible. Discuss her wishes. Does she want to undergo more tests, see other doctors, get more scans, take other treatment? Don't waste money on so-called miracle cures, seek evidenced treatment plans. Suggest she tries anything and everything the doctors can offer but keep in mind she may be resigned to her news. If it comes to the end make everyday very special for both of you. I wish her and yourself good news ~ Velvet",
      "MessageIndex": 8,
      "PostDate": "19/01/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4009,0.htm",
      "Title": "Metastatic Breast Cancer"
    },
    {
      "AuthorID": "Velvetjb",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Velvetjb",
      "Content": "Hi Kim. I am on Aromasin and for the first 2-3 weeks had side effects from it. I am post menopause, have advanced BC to the bones and have been taking Aromasin for 10 months. The side effects I had at the beginning were sleeping less, vomitting, and feeling dizzy but I took an anti nausea tablet until my body had accepted the drug. The sleeplessness was improved when I changed from taking it in the evening to breakfast time. I also find I have less apetite ~ don't really call that a side effect as it's not troublesome ~ I just eat smaller meals and make sure they are well balanced. Over the 10 months I have lost about 12 lbs (and can get into all my clothes so a bit of a bonus really)(but not if you are underweight to start with) I am 5 foot 3inches and now weigh about 129-130lbs and feel good. I didn't have any more pain than I usually get, that is a bit stiff and my joints aching in the morning but I get up and go on my rowing machine for 5 minutes, nice and steady and I am OK. I had been on Faslodex (for about 16-17 months)before that and my hair went very thin but I seem to be back to normal now. Give it a try and don't expect side effects because they may not happen, infact 3 friends take it too and only had the nausea at the beginning. When I took Tamoxifen I too had weight gain and drenching sweats all night and most of the day too and my hair went thin and a bit bald in patches. I have also tried Arimidex and sailed through with that but my disease progressed after 17 months and I had to change drugs. Good luck with the drug I am sure you will sail through, be safe, be well, be happy, Velvet in the UK",
      "MessageIndex": 2,
      "PostDate": "20/09/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6920,0.htm",
      "Title": "Anyone Not Having Bad Side Effects With Aromatose Inhibitors?"
    }
  ]
}