{
  "AuthorID": "Vicki325",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Vicki325",
  "Posts": [
    {
      "AuthorID": "Vicki325",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Vicki325",
      "Content": "I had the same symptoms that you decribe... I hab fibro breats (at age 28) and I too was told to eleminate caffiene... I did that and at 32 moved to t new city and had to find a new doctor... 24 hours later I was having a biopsy and 24 hours after that I had a right mastectomy with 8 out of 10  lymph nodes that were also cancerous, so I had so had all nodes removed form under my right arm.  I suggest a new doctor and insist on more aggressive measures. I was diagnosed as a stage 3 cancer with lymph node invovlement in 1993 Thanks to a move to the city and a new female doctor...I am a 15 year cancer survivor i this October... Hope this sheds new light on the subject. Vicki325",
      "MessageIndex": 4,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24093,0.htm",
      "Title": "Need advice/ Fybrosistic breasts"
    },
    {
      "AuthorID": "Vicki325",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Vicki325",
      "Content": "I have had a mastectomy and lymph nodes removed and have had yhis problem and I know what causes this. Lymph nodes create lumph fluid and once they are removed the fluid is supposed to be absorbed into your body on that side.  The fluid that is not absorbed will crystalize around muscles and tendons and therefore the more it hardens the more it aches and hurts.  Also if not tended to it can cause lymphodema if a blockage of fluid occurs. Lymphodema as of date canot be cured only managed.  Your arm will swellup and not deflate.  I am a 14 year breast cancer survivor and what I have learned is that crystalization needs to break away from the muscles and tendons. The best way I have to do this is with stretching my arm over my head and pulling in an upward motion across the top of my head and leaning over toward the pull.  This stretches the muscles and tendons and cracks off the lymph fluid crystals.  At first it may be uncomfortable but then you'll get the 'AHHHHH\" goof feeling.  I do this exercise morning, noon and night daily and have never had this problem again.   Hope this helps!   Vicki325",
      "MessageIndex": 7,
      "PostDate": "18/05/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24042,0.htm",
      "Title": "Pain 10 months after having lymph nodes removed"
    }
  ]
}