{
  "AuthorID": "VivMasser",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/VivMasser",
  "Posts": [
    {
      "AuthorID": "VivMasser",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/VivMasser",
      "Content": "Hi I had a lumpectomy followed by radiotherapy, but no chemo. Then I started on Tamoxifen and am currently on Femara for the next 2 years. Radiotherapy had it's side effects ( my skin was a little \"sunburnt\", and I felt tired after each session) All the aromatase inhibitors have more or less the same side- effects which I agree can be horrendous, but they do work. I have done a lot of research to find a natural alternative, but have not found anything with the same proven results. I would agree that healthy diet and gentle exercise do help and I found that I was a lot less tired on Femara than when I changed to Aromasin for a few months. Hang on in there and good luck!",
      "MessageIndex": 125,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    },
    {
      "AuthorID": "VivMasser",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/VivMasser",
      "Content": "On Sep 23, 2010 2:29 PM kshea wrote: I am on Femara and having joint pain.  My oncologist is suggesting switching to Aromasin but reading these posts it sounds like the side effects are the same.  I have three more years on this drug.  My question for everyone is does this pain go away once you go off the drug?  I think I can handle it for three years if I know it will be gone once I can go off them but if it is causing permanent damage that is another story. I was on Femara, then Aromasin for 2 years and suffered joint pain. I have a once in a lifetime holiday coming up and was determined to enjoy it, so I spoke to my GP about having a \"holiday\" from these drugs. He agreed that I could come off them for 6 weeks, but resume taking them directly after my holiday. I have to say that after 4 weeks my pains have gone almost completely, just a little stiffness in my feet remains. I will start taking them again in two weeks, but in the knowledge that in two years time, when I stop them completely the side effects should gradually go away. Hope this helps.",
      "MessageIndex": 127,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,2965,0.htm",
      "Title": "Side Effects From Aromasin"
    }
  ]
}