{
  "AuthorID": "Walking_Jim",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Walking_Jim",
  "Posts": [
    {
      "AuthorID": "Walking_Jim",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Walking_Jim",
      "Content": "Hi All I have been fighting stage iv kidney cancer with mets to both lungs and several bones for almost 7 and 1/2 years.  Cancer was discovered when a met caused a pathological fracture of left humorous, which was repaired with a pin and bone cement after removal of about 3 inches of full crossection of bone.  Other bone mets to spine and ribs.  I have used both Zometa and Xgeva.  My bone mets are smaller today then when I was diagnosed.  Therefore I believe the drugs helped me.  I have had two minor bouts of gum tissue loss when on Zometa and none when on Xgeva. I strongly recommend the taking of one or the other drugs.  The frequency of dosing is not so clear.  I having been taking Xgeva every three months and I previously took Zometa every 6 weeks for a year and then slowly stretched out the dose to every 6 months. Jim",
      "MessageIndex": 4,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71760,0.htm",
      "Title": "Zometa vs strontium citrate for bone mets"
    },
    {
      "AuthorID": "Walking_Jim",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Walking_Jim",
      "Content": "Hi manibedi There isn't any answer to that question.  It varies greatly from person to person.  Some of the factors are age, general health, luck, subtype of cancer, and I believe attitude. Seven years and 4 months ago (Jan 2006) my arm broke due to undiagnosed kidney cancer, from a met that was thru the entire bone.  The cancer was thru the entire right kidney and had spread to several bones and both lungs.  My prognosis was poor. Both breast and kidney cancer have similar outcomes when they reached the advanced stage.  Some people overcome the disease or at least fight it off for several years. I still am on chemo, but went camping last week.  Good luck and give hope to your sis in law.  Jim",
      "MessageIndex": 4,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,71570,0.htm",
      "Title": "how long does a person survive once cancer has spread into different parts of the body"
    }
  ]
}