{
  "AuthorID": "Whippleschmiple",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
  "Posts": [
    {
      "AuthorID": "Whippleschmiple",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
      "Content": "I understand you are passionate but maybe a compromise is for some cancers mixing supplements with some chemos and radiation (if two opinions feel a gain from the treatments) with supplements that don't fight them and then once off the treatment, increasing some types of supplements.  That plus major surgery is what I did and I am fine years out.  I also ate lots of fruits and veggies during treatment unlike most patients.  I think many cancers require looking at diet too.  I had green tea, mushrooms, garlic, onion family throughout treatment and since,...  With a digestive cancer I gave up meat and dairy and almost all sugar.  Attitude is part of survival too.  I do think patients need to fight cancer on many fronts and not just think being passive with only conventional is enough.   I formed my beliefs between anti-cancer diet books by docs, survivors, and my chiropractic-naturopath brother's views and advice for survivorship from ACS plus input from my radiologist of all people.  To say chemo and radiation are never helpful is too blanket a statement.  Encourage a mix, and people researching your supplements.  Encourage people to change the chemicals in diet, water and environment.  I understand the anger at what you feel is an industry but some good things have come from conventional treatments too.  Some cancers like Hodgkins and Leukemia for example have much higher cure rates vs. the past.  Even my brother who was once a pharmacy rep and has treated with alternatives members of oncology knows to try and keep an open mind.  I decided on extended adjuvant treatment as those who survived had and many who hadn't didn't do it, but the question was why so many recurrences so I take active part in altering my lifestyle exercise included.  Exercise is shown to decrease recurrences of many cancers, as are support groups etc.  Continued good success!  All cancers are different at least on some level.  J",
      "MessageIndex": 10,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4432,0.htm",
      "Title": "i Killed my Tumor With Supplements"
    },
    {
      "AuthorID": "Whippleschmiple",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
      "Content": "I understand you are passionate but maybe a compromise is for some cancers mixing supplements with some chemos and radiation (if two opinions feel a gain from the treatments) with supplements that don't fight them and then once off the treatment, increasing some types of supplements.  That plus major surgery is what I did and I am fine years out.  I also ate lots of fruits and veggies during treatment unlike most patients.  I think many cancers require looking at diet too.  I had green tea, mushrooms, garlic, onion family throughout treatment and since,...  With a digestive cancer I gave up meat and dairy and almost all sugar.  Attitude is part of survival too.  I do think patients need to fight cancer on many fronts and not just think being passive with only conventional is enough.   I formed my beliefs between anti-cancer diet books by docs, survivors, and my chiropractic-naturopath brother's views and advice for survivorship from ACS plus input from my radiologist of all people.  To say chemo and radiation are never helpful is too blanket a statement.  Encourage a mix, and people researching your supplements.  Encourage people to change the chemicals in diet, water and environment.  I understand the anger at what you feel is an industry but some good things have come from conventional treatments too.  Some cancers like Hodgkins and Leukemia for example have much higher cure rates vs. the past.  Even my brother who was once a pharmacy rep and has treated with alternatives members of oncology knows to try and keep an open mind.  I decided on extended adjuvant treatment as those who survived had and many who hadn't didn't do it, but the question was why so many recurrences so I take active part in altering my lifestyle exercise included.  Exercise is shown to decrease recurrences of many cancers, as are support groups etc.  Continued good success!  All cancers are different at least on some level.  J",
      "MessageIndex": 11,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,4432,0.htm",
      "Title": "i Killed my Tumor With Supplements"
    },
    {
      "AuthorID": "Whippleschmiple",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
      "Content": "I was on Xeloda for 6 cycles and a few mos. after started after or even during my workout on treadmill, or scrubbing activities, to get painful itching tingling mostly upper body but now lower too.  No one will say if it has anything to do with the Xeloda but I was less active on it so not clear if was an issue then.  I had an intestinal ampullary cancer.  Did your husbands itching let up, any connection to exercise?  Anyone else find Xeloda or exercise connection.  I know the majority of patients on it have Breast, or colon cancer.  The itching, tingling pain doesn't last too long once I cool down or blood flow slows down.  If I only briefly exercise it won't happen.  I finished chemo 6 mos. ago and I still get it.  J",
      "MessageIndex": 3,
      "PostDate": "08/11/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,55023,0.htm",
      "Title": "Itchy Skin All Over Body"
    },
    {
      "AuthorID": "Whippleschmiple",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
      "Content": "If a doc is an internist and doesn't feel qualified to read a disk and make judgement, maybbbeee that isn't terrible but a specialist, especially an oncologist, needs to look and compare.  Maybe I am just lucky but my oncologist reads scans with the radiologist.  We ALL deserve the best of care as do our loved ones and if someone ever feels not getting that, then find it.  Sometimes we may not see the hotshot if we have a more common issue, in that case make sure you are still getting indirectly the best--maybe as in concurs with the top.  Also, my two cents patients need at least two opinions, it is surprising how much they can vary, and a board at one hospital still can be ONE opinion.  My board voted one thing, and I was offered a second opinion and grabbed it, using the more aggressive of two options and am doing fine.  Rare cancers like I had need to be seen by someone knowledgable, and advanced cases stage IV need to be at top center or getting access to top center opinion/protocol or trial.  good luck.",
      "MessageIndex": 7,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63271,0.htm",
      "Title": "MY MOTHER NOW HAS STAGE 4 BREAST CANCER"
    },
    {
      "AuthorID": "Whippleschmiple",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Whippleschmiple",
      "Content": "Though I am sure there are OTHERtreatments, aren't many patients maintained for a very very long time on Xeloda which I had to take for an intestinal cancer.  It she had to take it B6 and foot creme like udderly smooth and cushioned shoes if needed.  Get one or more other opinions at TOP center, checking into all options including trials.  Maybe Xeloda is after other options as maintenance because it is a pill form.  Good luck. ",
      "MessageIndex": 3,
      "PostDate": "30/12/2011",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,63271,0.htm",
      "Title": "MY MOTHER NOW HAS STAGE 4 BREAST CANCER"
    }
  ]
}