{
  "AuthorID": "Will33",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Will33",
  "Posts": [
    {
      "AuthorID": "Will33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Will33",
      "Content": "I'm a 40 yr old man with about a 2cm lump behind my left nipple. It's been there about a month and the nipple is sensitive. Does this sound like a typical presentation, in your experience? I'm a bit concerned because I've had both Hodgkins and non-H lymphoma in the past five years, and the chemo, along with an immunosuppression regimen for a lung transplant, puts me at risk for any type of cancer. What other things could this be? I haven't talked yet to my doctors because there are so many other things -- I'd never notice a cough on top of my non-stop congestion and infections, and I have CF related bone pain anyway. I guess I'm just looking for confirmation that the improbable isn't happening. What other things did doctors suggest would be the cause of such a lump before cancer was diagnosed? And was it diagnosed early or late, with what size tumor? Thanks, if anyone can reply. I'm not all that worried but wondering what my basic approach might be to this concern.",
      "MessageIndex": 7,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,29624,0.htm",
      "Title": "stage IV mets to lungs"
    },
    {
      "AuthorID": "Will33",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Will33",
      "Content": "  On 1/23/2005 Onein100 wrote: I have just discovered your CancerCompass message of Oct 8, 2003. I am a male who had breast cancer in 1998. I had a mastectomy, took tamoxifen for five years, and I am still cancer free. How did your husband fare? I hope he is still with you and healthy. If either of you would like to correspond with another man who had breast cancer, please reply. If you have any questions,I  do not hesitate to ask. Lyn onein100 I'm a 40 yr old male with a sore left nipple with about a  2cm lump behind it. I've noticed it for a month.What concerns me is that I've had Hodgkins and non-H lymphomas (chemo and rituxan, respectively), both in the past five years, in remission, take immunosuppression for a lung transplant, and have other risks that greatly increase my chance of getting any type of cancer. While the lump is a symptom, the pain would seem to indicate  something else, although it could just be irritation from the stiffness of the nipple. No discharge, discoloration, inversion, or other things. Did you discover your condition with a lump? where was it, and did it hurt at all (or could you feel it on your chest?)? I'm wondering whether to raise it with my doctors and am concerned about seeming like a hypochondriac. It's been there for a month, as I said, and I have a lot of other problems that I should otherwise concern myself with. WH  ",
      "MessageIndex": 3,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,951,0.htm",
      "Title": "Healing Brest Cancet in Men"
    }
  ]
}