{
  "AuthorID": "winter09",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/winter09",
  "Posts": [
    {
      "AuthorID": "winter09",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/winter09",
      "Content": "My sister (47) was diagnosed with breast cancer (T3, ER+ PR+, HER2-) 4 years ago. She had radiotherapy, followed by mastectomy+radiotherapy and chemo with anthracycline, followed by tamoxifen.  October 2007 she was diagnosed with brain metastases (not operable). She was treated with radiotherapy and temodar, which initially had some effect, but then in July 2007 the metastases progressed and her left leg and arm were paralyzed.  She is currently taking CCNU (she had her second treatment a few days ago) and several natural supplements, including Boswellia Serrata (4,200 mg/day; CoQ10, melatonin, bromeline, low fat cottage cheese and flax oil and seeds) and she is on a low fat diet.  However, no much improvement has been noticed. I would appreciate any advice/suggestion about treatments of brain metastases that could be relevant to my sister's case. What do you think/know about xeloda and insulin potentiation therapy? Thank you.   ",
      "MessageIndex": 0,
      "PostDate": "27/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31547,0.htm",
      "Title": "brain metastases from breast cancer treatment options"
    },
    {
      "AuthorID": "winter09",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/winter09",
      "Content": "Thank you very much for responding to my message and for describing the insulin potentiation therapy.  Can you please let me know if you are aware of the efficacy of this therapy in cases of breast cancer and brain metastases from breast cancer? What chemo has been used together with insulin? Do you know if this therapy is supported by results from clinical trials? Another thing which is a bit controversial is that there is some data that insulin actually stimulates cancer cell growth and specifically breast cancer cell growth?! Can you please comment on that?  Thank you.    ",
      "MessageIndex": 2,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,31547,0.htm",
      "Title": "brain metastases from breast cancer treatment options"
    }
  ]
}