{
  "AuthorID": "Witchdoctor",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
  "Posts": [
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "I notice you are a granny, if you are elderly with a small primary which has good cytoloogical features and risk factors, it would be reasonable to pursue just surgery, irradiation (breast and at least lower axilla and hormonal therapy.)  In older women with lowgrade ER /PR positive tumors  etc.  It has been tough showing a significant benefit of Chemotherapy.  If it is high grade or has negative features then the gain is more potentially.  Bilateral Mastectomy I do not think is indicated in your age group and is unnecessary as long as you are followed appropriately.  It fails as well but is used mostly in young women with BAD tumors and BAD genetics ie. BRCA positive.",
      "MessageIndex": 3,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15883,0.htm",
      "Title": "recurrance"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Not knowing all information and based on best evidence you could probably stop the pills.  However, this is with a paucity of information. There are studies being done but the proof of prolonging or combining treatments is scarce.  If the medication is causing bad problems then stop it after five years.",
      "MessageIndex": 2,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9843,0.htm",
      "Title": "Sweats (SWIMS)"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Aromatase inhibitors cause menopausal type symptoms ie Hot Flashes and sweats.  Also they can cause Osteoporosis (nobody warned you??) If the hot flashes are bad taking Megestrol will decrease them.  People on these meds should at least supplement Calcium 1500 mg a day with vitamin D and magnesium.  You should have had a bone density before and every year you are on the medicine.  Sometimes they give a osteoporosis drug to assist.  If it is real bad they may change to Tamoxifen which actually protects against the loss of calcium and is nearly as good in post menopausal women.",
      "MessageIndex": 4,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10201,0.htm",
      "Title": "side effects of arimidex"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Once again, berry picking mets with stereotaxic.  She should have had whole brain at the time as well and that may have prevented the second lesion. In almost all cases , brain mets are multifocal, even when they can't be seen on MRI.  It is ok to treat the known lesion with stereotactic but then you have to prevent subsequent recurrence and new lesions.  If it is a primary brain tumor , then the situation is different in most cases.  You should go after the rad onc who initially treated the lesion on why he did not do WB as well.  He may have recommended it but was over ruled by the neurosurgeion etc.  It has happened to me before.",
      "MessageIndex": 2,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14312,0.htm",
      "Title": "Stereotactic radiation for Brain Tumor"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "It is a combination of the previous surgery and irradiation and the current surgery.  The involved breat undoubtably had some scare tissue to begin with and it will take more time to heal.  It may always be a little different at least.  You should have physical therapy to stretch the muscles and tissue since scar tissue tends to contract.  I would use moisturizers and some vitaimin E applied to the scar.  May be too late for this though. Why was breast reduction necessary?  You should have been counseled about the chance for slower healing.",
      "MessageIndex": 1,
      "PostDate": "30/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14795,0.htm",
      "Title": "radiation and breast riduction"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You need re resection if possible and Local irradiation.  Probably should have been done up front.  Chemo for adult soft tissue sarcoma has not shown significant benefit or results are at best mixed.",
      "MessageIndex": 1,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11287,0.htm",
      "Title": "Angiosarcoma of the breast"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "What kind of surgery did you have? and What was the histology of the cancer, there are some that are different ie Tubular, Lobular, infiltrating ductal etc. You have an early stage with \"good\" features so chemo while possibly improving your outcome to some degree it will be smaller.  Had your tumor been just a little smaller then there would be close to no benefit. The main reason for being more aggressive is your age, which is pretty young and associated with more aggressive disease in some cases, although you appear to be the exception.  Whether to receive chemo should be based on how much it will improve your outcome, if any, and whether the risk and short/ longterm effects are worth it.",
      "MessageIndex": 1,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11499,0.htm",
      "Title": "Stage 1 breast cancer chemo options"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Did they get a biopsy?  If so and the ER/PR receptors are positive and HER negative she may actually do well with hormonal treatment which though not curative can keep the tumor in remission.  Worrisome is the Liver Mets , hormonally sensitive tumors usually go to bone and live the Liver and lung alone until late in the disease.",
      "MessageIndex": 1,
      "PostDate": "26/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13776,0.htm",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "1.  If you ask/demand, they should give you something to calm you and they probably can numb the area.  The injection of dye is not like the biopsy. 2.  You need counseling, although this is a stressful time, it sounds like your cancer is very treatable.  Reasonably you should fear the cancer MORE not  the procedures. 3.  I do agree the physicians should try to make you more comfortable if possible.",
      "MessageIndex": 4,
      "PostDate": "19/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10444,0.htm",
      "Title": "Coping with fear and anxiety"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "http://jnci.oxfordjournals.org/cgi/content/abstract/89/22/16   The gain is an average of 4-5 percent over a wide range of patients.  In your case it is probably lower although age was also an important factor.",
      "MessageIndex": 2,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11499,0.htm",
      "Title": "Stage 1 breast cancer chemo options"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Sorry for your bad experience, however, stay the course.  The lumpectomy and LN are done under anesthesia so that should not hurt you as much other than some post op discomfort, which they should give you something for.   Remember , the cure rate for most breast cancer of relative early stage , to even advanced, is very good with treatment.  It is zero with no treatment.  Be strong!",
      "MessageIndex": 1,
      "PostDate": "17/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10444,0.htm",
      "Title": "Coping with fear and anxiety"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Did you have bilateral breast cancer?? Have they worked you up to rule out recurrence? Did they take out lymphnodes on both sides? Edema could be due to lymphatic obstuction by scar tissue or tumor.  This needs to be investigated. Did you get any radiation treatments.  Depending on the site this could increase the chance of lymphedema.",
      "MessageIndex": 1,
      "PostDate": "15/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16159,0.htm",
      "Title": "Lymphedema"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Mammosite is investigational and to my knowledge there is not data on using it for salvage. (little long term data on using it at all) Local recurrence can be treated with Mastectomy (standard of care) or if the breast is large enough to allow it to remain \"cosmetic\" then you can repeat lumpectomy and radiation.  I would not use the mammosite and here is why.    You have already received irradiation in the past, this is a retreatment and everything should be done to spare normal tissue particularly in the recurrence area.  Mammosite is accelerated hypofractionation (large doses per treatment and over a short time.  This would more than likely increase the chances for necrosis.  In actuality the treatment should be hyper fractionated to the large field and a Low dose rate implant used to boost which would increase tolerance of normal tissue.  You must be very diligent with followup if you pursue this course and it would be better if you were part of a study.",
      "MessageIndex": 1,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16232,0.htm",
      "Title": "mammosite"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You need six cycles of chemotherapy and radiation.  You have a Stage II breast cancer.  With this therapy you will have up to 75 to 80 percent cure rate plus or minus.  You did not mention your age , but due to the pathology the treatment is the same.",
      "MessageIndex": 2,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9893,0.htm",
      "Title": "new diagnosis, anyone similar?"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If your tumor is spread to bone, is it ER/PR positive???  Usually hormonal therapy will put it in remission for a time at least.  Was this done?",
      "MessageIndex": 1,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11063,0.htm",
      "Title": "Beware of Misdiagnosis and Seek Second Opinions"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Your physician is correct and you should receive aggressive treatment.  Also you should be placed on Tamoxifen after chemo for at least five years. (maybe more)",
      "MessageIndex": 3,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11799,0.htm",
      "Title": "chemo or no chemo?"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Have the path reviewed, it sounds like a fibro adenoma which is benign.  Years ago before mammo and sterotactic it was cause of multiple excisional biopsies.  If you are really worried then an excisional biopsy would be more definitive but nowadays not much more so.",
      "MessageIndex": 4,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11286,0.htm",
      "Title": "pathology reports and doctors"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Agree with Oncryx, in the absence of any extenuating circumstances the addition of chemo might reduce her survival.  Cure is very high and if she is followed carefully even a recurrence or second cancer is curable / salvageable.",
      "MessageIndex": 3,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9697,0.htm",
      "Title": "to chemo or not to chemo? that is the question"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "In the Canadian system, if you meet ther criteria for cure rate, then things should get done fairly well.  I would still do the sentinel lymphnode bx or at least a PET scan.  Feel free to show my post to your doctor.  He can reach me here.",
      "MessageIndex": 6,
      "PostDate": "17/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If  the lymphnodes are negative you don't treat the Supraclavicular area and axilla.  Fewer side effects and less risk of arm swelling. Surgery has no better cure nor local control rate.  As a matter of fact if it does recur locally after radiation you can \"salvage\" with surgery with a potential cure of up to 80 percent.  If it recurs on the chest wall, 33 percent of patients have spread of disease upfront and the salvage is zero to 30 percent.  The conservative procedure is also more cosmetically pleasing if the surgery is done properly",
      "MessageIndex": 8,
      "PostDate": "18/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "The Cough need to  be worked up, the timing of the pneumonitis is too long after the treatments.  It could be some fibrosis(scarring) Has she had a full pulmonary workup including bronchoscopy?  Also an early sign of Heart failure can be a coughing due to mild volume overload.",
      "MessageIndex": 3,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Bronch could verify inflammation versus infection or any other potential cause. If you put anyone on steroids , usually, it will make them feel better, but does not treat the cause.  Pneumonitis usually occurs 4-6 weeks after treatment , or sooner , if patient is given chemo or treatments get extended.",
      "MessageIndex": 5,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "What is the correct treatment depends on tumor size, lymphnodes, histology (low grade versus high grade etc) ER/PR status etc.  The real question is whether and how much you may benefit from chemo and/or aromatase inhibitor.  The surgeon can still do a sentinel lymphnode sampling or a level one/ two dissection.  This would also help the radiation oncologist ,besides indicating chemotherapy.  You could also, although non standard of care, get a PET scan to both stage ;your entire body and the local area.  Standard of Care is lymphnode biopsy though.  Hope this helps.",
      "MessageIndex": 4,
      "PostDate": "17/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Yes lumpectomy , ln sampling and irradiation are equal to surgery.  Actually it is better since IF it recurs there is better salvage.",
      "MessageIndex": 10,
      "PostDate": "19/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Yes lumpectomy , ln sampling and irradiation are equal to surgery.  Actually it is better since IF it recurs there is better salvage.",
      "MessageIndex": 11,
      "PostDate": "19/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "A bit more about your treatment would be helpful.  The risk of pneumonitis is related to the volume of lung treated, techique and individual susceptability. pneumonitis is treated with steroids that are gradually tapered to knock out the inflammation.  It usually only effects the treated area but if untreated can \"spread\" just like an untreated pneumonia.  Whether fibrosis developes depends once again on the dose and volume of lung irradiated.  That is why I asked what was the initial stage and who was it treated.  Using tangents, if the amount of lung is limited, rarely results in this effect.  However a large field, including lymphnodes would be more like to cause it.",
      "MessageIndex": 1,
      "PostDate": "01/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11715,0.htm",
      "Title": "breast cancer radiation pneumonitis"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If it is inflammatory Breast Cancer the first treatment should be aggressive chemo, followed by Surgery and Radiation. It is an aggressive cancer , but with aggressive treatment can be cured in a good number of cases ,but ,given your description you should start treatment concurrently with diagnosis.  Don't delay!  I  would term it as almost an oncologic emergency to get treatment started as soon as possible.  Even start the chemo while you are being staged.",
      "MessageIndex": 2,
      "PostDate": "11/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13085,0.htm",
      "Title": "Inflammatory breast cancer"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If it is inflammatory breast cancer then it is in the dermal lymphatics under the skin.  The Biopsy should be minimal so as to not delay chemotherapy if this ends up being true.  An excisional biopsy would be indicated for non inflammatory breast cancer, even if it was \"locoregionally extensive\"  In these cases the chance of complete excision are good.  In inflammatory carcinoma you would have to resect the involved skin as well and IMHO and in reality create a mess and delay treatment.  Even if they resect mass and involved skin the chance of residual tumor is high, classically recurring at the edge of the surgical field but also within it. The results of treatment depends on response to systemic therapy since the chance of metatasis is so high.",
      "MessageIndex": 9,
      "PostDate": "14/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13085,0.htm",
      "Title": "Inflammatory breast cancer"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If it is inflammatory Breast Cancer you DO NOT want the aggressive surgery first.  You need Dose Dense Chemotherapy. (I know there is no biopsy but clinically ,base on description, this is what is necessary)  I Biopsy and Frozen section should give an immediate answer.  If it is something else then obviously the plan changes  You get the chemo, mastectomy then sometimes more chemo, followed by loco regional Radiation.  Inflammatory Carcinoma is considered a systemic disease from the outset, just like Small Cell Lung Cancer.",
      "MessageIndex": 5,
      "PostDate": "12/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13085,0.htm",
      "Title": "Inflammatory breast cancer"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "http://home.earthlink.net/~ckane/ibc.htm  Please go here for verification",
      "MessageIndex": 15,
      "PostDate": "14/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13085,0.htm",
      "Title": "Inflammatory breast cancer"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "With no evidence of recurrence to date you are doing really well.  Given what you have said about your initial tumor then if it was going to recur it would have done so before now.  That said, I do not believe in 100 percent or 0 percent for that matter.  Breast is a cancer that can recur beyond 5 years, but that is usually the hormonally responsive kind.  So you are better than 95 percent cured with a small risk of recurrence in the future. This is the most difficult thing to deal with because everyone wants to hear the words cured.  You PROBABLY are and that is the best it can be at this point.",
      "MessageIndex": 1,
      "PostDate": "12/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11242,0.htm",
      "Title": "survivor"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Generally the ER/PR  etc. come shortly after the main pathology.  Also did they sample any lymphnodes?  Irradiation to the breast is not that bad but you will have fatique and skin irritation which can be anything from a sun tan to extreme redness and even some blistering.  Start moisturizing with Aloe vera gel or Bag Balm prior to treatment and during.  The area may be slightly tender. What is your age?",
      "MessageIndex": 1,
      "PostDate": "16/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10424,0.htm",
      "Title": "pathology"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "http://home.earthlink.net/~ckane/ibc.htm  Please go here for verification",
      "MessageIndex": 10,
      "PostDate": "14/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13085,0.htm",
      "Title": "Inflammatory breast cancer"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "I will say that Xeloda is an important advance as compared to getting IV 5FU.  My experience is the side effects are somewhat less than the IV version.  The problems mainly seem to be the length of time of treatment and the dose.  Because it is so easy to give, people are giving it for longer periods and you get cumulative side effects.  Also if you are taking it mainly as a radiation sensitizer the dose can be much lower and really you only need to take it 2 hours prior to treatment and can stop on weekends.  My experience is it is less toxic when given in a similar fashion to IV and More toxic based on dose and length of treatment.  I dont think there are good dose/efficacy studies yet.  My feeling is it will replace IV 5fu and maybe even CDDP(for chemosensitization, I have been impressed with the results in H and neck, lung and bladder Ca.  It seems to do well in the GI tumors as well.  The drug is in some ways targeted since the enzyme that converts it to 5Fu is found in higher concentrations in Cancers. Of course, as with any chemo agent, there will be people who get worse side effects than others.",
      "MessageIndex": 4,
      "PostDate": "07/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If it is trully DCIS there is no evidence chemo will increase the cure rate or decrease the recurrence rate.  Whether to have chest wall radiation to prevent local recurrence would depend on margins of resection etc.  Grade of tumor would not indicate additional treatment.  If it was invasive and high grade and above .5 to 1.0 cm in size then some would recommend chemo. But that does not appear to be the case.  Also controversial is should she be put on Aromatase inhiibitor.  Not for the current cancer but to reduce chances of a CA in the opposite breast. All of this is fine points, if it is non- invasive with negative lymphnodes then a cure is highly likely with just the surgery.",
      "MessageIndex": 6,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9787,0.htm",
      "Title": "my moms test results?? help"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You have no biopsy so no one knows 100 percent what it is .  You said Skull films, did you mean a Cat Scan? or just xrays.  If there are lytic skull lesions then it could also be Multiple Myeloma if the breast ends up being negative for cancer.",
      "MessageIndex": 2,
      "PostDate": "13/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16087,0.htm",
      "Title": "Info told mets to the brain"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "oops!     Your mom had invasive cancer, somehow I missed that and concentrated on the DCIS.  She will need chemotherapy and maybe Radiation based on the details of her original tumor.  Size, margins (close or wide etc.  Sorry for my confusion.",
      "MessageIndex": 7,
      "PostDate": "11/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9787,0.htm",
      "Title": "my moms test results?? help"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Some people use and Ice cap during chemo to reduce circulation and keep the hair from falling out.  It could decrease the chemo getting to the scalp and increase recurrence there Hypothetically, but I am aware of no evidence of this occurring.",
      "MessageIndex": 3,
      "PostDate": "14/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17052,0.htm",
      "Title": "Hair Loss"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "I can't answer, is her tumor ER/PR positive?  Sounds like she should be on hormonal therapy or at least wait to see if there is any measurable, biopsiable disease.  You usually treat a diagnosis, not a lab result.  (not always true since sometimes it is high enough to be obvious).",
      "MessageIndex": 1,
      "PostDate": "06/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11064,0.htm",
      "Title": "Xeloda and fatigue"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Chemotherapy would seem to be the only choice, although they may change her hormonal therapy to try to get a second response.  Sometimes they have even given estrogen after antiestrogen therapy and gotten a response.  It is worth a try for toxicity reasons.  You knew from the beginning the cancer was incurable and five years is a prolonged response.",
      "MessageIndex": 1,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14299,0.htm",
      "Title": "type of the treatment"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Zometa helps slow the resorption of bone caused by bone mets and has been shown to decrease the chance of path fractures.  It is given in higher doses than for Osteoporosis so side effects are amplified including Mandibular necrosis.  IT IS NOT A TREATMENT FOR THE CANCER.  It just helps support the boney structure.  Weight bearing areas should be treated with irradiation as well.  Blastic Mets that produce bone should not be treated, only lytic destructive lesions.  If it is affecting your eyesight then possibly a lower dose could be given or you could switch Medication.",
      "MessageIndex": 1,
      "PostDate": "20/10/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,17253,0.htm",
      "Title": "Zometa"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You guys are nuts!  Sex drive is not related to estrogen in females but testosterone , yes , believe it or not!  Tamoxifen does not cause necrosis of the jaw.  Zometa does , rarely and when high doses are used for bone mets most of the time.  Tamoxifen does not cause bone pain and aches the aromatase inhibitors can though.  Geez, you guys are nuts, please get your facts straight before your cause someones death.  Which by the way you will not be held responsible for.",
      "MessageIndex": 3,
      "PostDate": "23/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Listen Shemay , aka fear monger, open a bottle of aspirin and read the \"possible \" side effects and you wouldn't take aspirin again.  Tamoxifen increases the chance of cure and decreases new cancers by 50 percent.  The side effects you mention are relatively rare and if managed appropriately, do not result in DEATH.  Unlike recurrent or new cancer.  This is why you are not an expert.",
      "MessageIndex": 7,
      "PostDate": "25/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Actually , if your response to Chemo and Radiation then you can have breast conserving treatment if you want it.  As I have said local control is not the big problem , it is systemic spread.  If you achieve a complete response with chemo and radiation there have been studies where they don't even do surgery.  All three however is the standard of care and as I have said I do NOT think the surgery you are having is necessary.  A needle biopsy would suffice and the business of not getting the tumor is bogus since you can do multiple passes with the needle.  The Med Onc should be upset as well since leaving the mass there allows immediate assessment of the response to chemo, which is really what will affect your survival the most, not local therapy, which is why chemo comes first in this presentation.",
      "MessageIndex": 1,
      "PostDate": "19/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13477,0.htm",
      "Title": "Excisional Breast Biopsy with Overlying Skin"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Tamoxifen is not a chemotherapy agent and has very little effect on cells which don't have Estrogen receptors.  It attaches to the receptors an in Breast cancer prohibits cell growth.  In other tissues as mentioned it can cause increased metabolism and growth.",
      "MessageIndex": 5,
      "PostDate": "24/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10616,0.htm",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Tamoxifen has anti estrogenic effects on breast tissue but also estrogenic effects on others ie uterus (bad) bone and heart (good).  It can also have an increase in the chance of blood clots.  Now despite all these potentials, overall Tamoxifen is one of the safest medicines there is.  I always tell people if they want to scare themselves read the package insert for aspirin or tylenol.",
      "MessageIndex": 1,
      "PostDate": "22/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10612,0.htm",
      "Title": "Tamoxifen effects on uterus"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Good, Finding out  if it is a cancer is the first step.  If you say it is enlarging then the risk goes up, but fibro adenomas can enlarge as well or go up or down with your monthly cycle.  Also remember Breast Cancer is one of the success stories and we are even better at treating the locally advanced cases and if caught early it is as curable with treatment as some skin cancers.",
      "MessageIndex": 4,
      "PostDate": "25/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13711,0.htm",
      "Title": "Lump in left Breast.....I'm terrified!!!"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Your mother unfortunately appears to have a very aggressive tumor.  Treatment is palliative and whether it will help depends on response. Same with WB irradiation, if the tumor is very responsive then it will help alot, but that is the unknown at this point.  Have them do tumor markers to follow the effect of treatment, stop it if it is not working or try something else.  Sorry but all that can be done is delay or prevent problems.",
      "MessageIndex": 1,
      "PostDate": "15/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14372,0.htm",
      "Title": "mets to brain and lung HELP"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "At Least get a Mammogram done quickly.  Sometimes that is all that is necessary.  If it shows benign then you just follow it and repeat the mammogram in 6 months or so.  If it shows high probability then you proceed with stereotactic needle bx or excisional biopsy and proceed based on the results.  It is to early to panic and you should not anyway.  Go get a mammogram, that is the first thing to do.",
      "MessageIndex": 1,
      "PostDate": "23/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13711,0.htm",
      "Title": "Lump in left Breast.....I'm terrified!!!"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "At 4.5 years you are still on the hormonal therapy, correct?  The possibility of this being something is relatively small, however, if it is bothering you or causing mental anguish then I would aggressively pursue obtaining a biopsy if possible.  (the lesion is small)  Low probability means that the lesion seen does not have the classic \"look\" of a cancer and the impression is usually accurate.  Another option might be to wait just 3 months.",
      "MessageIndex": 1,
      "PostDate": "17/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11356,0.htm",
      "Title": "Breast MRI results"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "I am a radiation oncologist and it is unlikely the radiation is causing enlargement of the Thyroid during treatment or even after.  Are they treating lymphnode or just breast?  Are you on any other treatment, had chemo, hormonal etc.  The only possible way this could be irradiation is if they were treating an extensive field ie  Breast , Axillary LN, SC LN , Low Neck/Internal mammary.  If this is the case then it could just be swelling. More concerning in my opinion is it a recurrence/met to low neck or Thyroid.  Lastly it could be a fast growing thyroid tumor and you don't want that for sure.  It needs w/u to find out what it is.  It could be an after effect of hormones or even chemo if applicable.",
      "MessageIndex": 1,
      "PostDate": "28/05/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,12469,0.htm",
      "Title": "Throid problems with BC radiation ?"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Yes I would get a PET/CT to document all areas of disease. Was your mothers tumor ER/PR positive?  If not why the arimidex.  Also put her on calcium and vitamin D supplements. The Brain tumor needs to be treated, at least with irradiation and if the tumor was ER/PR positive then if it is solitary then maybe even surgery. IF the tumor is ER PR negative, with aggressive treatment your mother could have much more than six months, especially if she is a good responder.  This is at  least worth a try. Based on the limited information, and I may be wrong, but your doctor is an a**hole!",
      "MessageIndex": 1,
      "PostDate": "15/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10370,0.htm",
      "Title": "Whats next"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You need radiation and then an Aromatase inhibitor or Tamoxifen for 5 to 8 years if your tumor is ER/PR positive.  This has been shown beyond a shadow of a doubt to improve the results.  Most people tolerate one or the other of the above meds quite well  with no symptoms.  Don't be swayed by others and give it a try yourself.  Of course , you should excersize, eat right and go on Calcium/Mineral supp to prevent osteoporosis while taking the drug.",
      "MessageIndex": 2,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16247,0.htm",
      "Title": "post surgery lumpectomy pre radiation"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If you are premenopausal and one of the tumors is over a cm. (some would say over .5 but I think the toxicity would be greater than the increase)  I have not heard of continuous chemo for that amount of time.  As I said it is usually every three weeks for six cycles.  Also in younger women , sometimes even with good tumor characteristics they would be more aggressive using CAF or similar or a Taxol combinations. I am a radiation oncologist and I believe Oncryx is a Med Onc so if there are details with regards to chemo in your age group , size of tumor etc then he would be the best source. I usually also recommend people go to the the National Cancer Care Net work at www. nccn.org or the NCI website for the latest recommendations.  Read both the physicians and Patients sections.  They update it frequently and it is made by a multidiciplinary panel listed at the beginning.",
      "MessageIndex": 7,
      "PostDate": "29/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13855,0.htm",
      "Title": "Cytoxan/Methotrexate anyone????"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Was your tumor ER/PR positive and/or did it have any other good/bad features?? Based on what you reported , your doctor has recommended the correct therapy.  If you absolutely do not want the chemo then you can still get the radiation and Aromatase inhibitor and be cured, but it will be a 10 to 20 percent lower chance or so.  Due to your past chemo , you may not be able to tolerate another round of aggressive treatment due to decreased bone marrow reserve.  The chemo for breast is generally not as intense as for Burkitts. You can try it and see how it goes.",
      "MessageIndex": 1,
      "PostDate": "15/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16174,0.htm",
      "Title": "post-surgery treatment options/consequences"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You have to speak with your doctor.  Since it is still uncomfortable it may not hurt to delay a little bit or do an MRI of the breasts etc.",
      "MessageIndex": 1,
      "PostDate": "15/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16194,0.htm",
      "Title": "radiated breast after breast reduction"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Stop arimidex and go on tamoxifen.  Osteoporosis and the symptoms you are describing are common.  Have you been checked for osteoporosis or taking Calcium/ vit D supp?  Also bone density should be done before and during this therapy.",
      "MessageIndex": 2,
      "PostDate": "09/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,9587,0.htm",
      "Title": "Body pains"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Radiation should be much easier since it is local only.  You may have a more pronounced reaction due to the adriamycin.  Radiation reactions nowadays are mostly mild to moderate and heal up without scarring after the treatment.  There are exceptions, so the ones you saw as a nurse have skewed your opinion.  Most people don't need special treatment as it is mostly a sunburn with maybe some blistering but not severe..  Like I said , after chemo, the radiation is usually a breeze by comparison if nothing else.",
      "MessageIndex": 1,
      "PostDate": "30/07/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,14794,0.htm",
      "Title": "Radiation therapy"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If your hot flashes are that bad you should go on low dose Megace to reduce them.  Sometimes this can be discontinued after a time.  Your feelings are probably due to the forced menopause from the Medication. As with the natural menopause, it affects people differently.  Some it is minor others it affects physically and even mentally/emotionally.  Most of the time these sxs resolve with time, just like in the natural state.",
      "MessageIndex": 10,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11394,0.htm",
      "Title": "going back to work"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If your hot flashes are that bad you should go on low dose Megace to reduce them.  Sometimes this can be discontinued after a time.  Your feelings are probably due to the forced menopause from the Medication. As with the natural menopause, it affects people differently.  Some it is minor others it affects physically and even mentally/emotionally.  Most of the time these sxs resolve with time, just like in the natural state.",
      "MessageIndex": 12,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11394,0.htm",
      "Title": "going back to work"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Is your chemo every three weeks for 26 weeks??  What was the size of your cancer?  Are you post menopausal? All of this is important since depending on size and even age the addition of chemo would not help or be very minimal and if you are older then most would save you the toxicity. If you are getting 26 to 28 wks of chemo every three weeks ,then based on your current info that is TO  MUCH.  It should be a maximum of 18 weeks and in very early cases only 12 weeks.  4 to 6 cycles in other words. Current Recommendations;  \"Patients should be treated to Plateau or in any case NO MORE than six cycles\" My only criticism is the Med Onc is being over aggressive based on your findings and even if your tumor was more aggressive this would be excessive. Post chemo you should get whole Breast Irradiation with boost. (Usually this is a piece of cake after chemo.",
      "MessageIndex": 5,
      "PostDate": "29/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13855,0.htm",
      "Title": "Cytoxan/Methotrexate anyone????"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "If it was in the scar it sounds like what we call a \"stitch abscess\"  This is usually caused by an absorbable suture that sets up an area of inflammation, which can sometimes get in infected.  Treatment can be conservative or some people \"incise, drain and remove capsule\" and let it heal in secondarily.  It can take while to heal completely.  If it still draining then you may need the more aggressive management above.",
      "MessageIndex": 1,
      "PostDate": "13/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10288,0.htm",
      "Title": "post radiation/lumpectomy abcess"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "You can have a repeat lumpectomy in some cases.  Really the size of the breast matters and whether the cosmetic results would be worthwhile.  Standard of Care is Mastectomy however.",
      "MessageIndex": 2,
      "PostDate": "10/08/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,15135,0.htm",
      "Title": "treatment options"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Tamoxifen has some estrogenic effects as well as anti estrogen effects.  The Good is it protects the bones, heart and prevents recurrence of cancer or formation of new cancers.  It can have a small chance of blood clots (I have never seen this) and sometimes endometrial hyperplasia in rare cases.  In general though it is very safe but as with an med occasionally someone will have a dystonic (every side effect possible) reaction. Truthfully even if you have the surgery they will recommend this as well so it will not eliminate the need.  Mod Radical mastectomy has no better local control of cancer and if you include salvage after local failure then the more conservative treatment has a better cure rate and better cosmesis.",
      "MessageIndex": 1,
      "PostDate": "29/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10822,0.htm",
      "Title": "Tamoxifin and dysplasia"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Your doctor is wrong.  Wait for the PET/CT.  If it is confined to the IM Lymphnodes then cure is possible though less likely.  Lymphnode mets/recurrences still represent potentially localized disease.  It means more treatment but not necessarily time to give up.",
      "MessageIndex": 2,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11665,0.htm",
      "Title": "its back"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Is it a matter of fluid accumulation or than you have an open wound.  And please forgive me, I am not familiar with DIEP what is it?  If it is fluid then you have open lymphvessels that where severed during surgery and remained open or some reason.  It it is an open wound then if Vac doesn't work you can go for hyperbaric Oxygen.",
      "MessageIndex": 1,
      "PostDate": "24/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13750,0.htm",
      "Title": "s/p rads 5yr ago now s/p DIEP trouble healing"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "The current recommendations are for Tamoxifen in premenapausal women and Femara / Arimidex etx for post menapausal.  The  reason is due the the estrogen effect of Tamoxifen , although it sometimes causes problems, is potentially beneficial in some ways.  The Aromatase inhibitors work better in postmenapausal women because their estrogen comes from fat tissue and the the Adrenal gland and aromatase is the enzyme that converts it.  Aromatase inhibitors have their own problems and I have changed more women from these to Tamoxifen because of bone paim than the other way around. The contention that aggressive surgery is a common misperception and goes along with the \"more is better\" philosophy, which has been shown in many instances and types of cancer., not to be the case.  You would still be put on Tamoxifen or inhibitor no matter what your local therapy is.  If the tumor is large and the breast small and there is no cosmetic advantage then have the surgery.  Both are equal with DCIS.",
      "MessageIndex": 6,
      "PostDate": "29/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10822,0.htm",
      "Title": "Tamoxifin and dysplasia"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Standard of care is Tamoxifen in Premenopausal women, it is all I can say.  In post menapausal women aromatase inhibitors have been shown to be better.",
      "MessageIndex": 8,
      "PostDate": "30/03/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,10822,0.htm",
      "Title": "Tamoxifin and dysplasia"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "I am sorry, she appears to have a cancer that is aggressive and unresponsive to treatments that usually have better efficacy.  Base on the rapid progression of the disease, she may not have much survival left. Her incoherency could have several causes but I would suspect brain metastatis. Sorry but I don't know of much that can be done except symptom control.",
      "MessageIndex": 1,
      "PostDate": "26/06/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,13786,0.htm",
      "Title": "please help i dont know what is wrong"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Breast Cancer can be bilateral, particularly the Lobular histology for which , in the old days, they used to do mirror biopsies of both breasts when someone had it.  IF it is cancer then you could have this presentation.",
      "MessageIndex": 1,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,16243,0.htm",
      "Title": "can breast cancer be in both breast"
    },
    {
      "AuthorID": "Witchdoctor",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Witchdoctor",
      "Content": "Depending on how long you were on it then it should not be discontinued abruptly.  Gradually taper them over a period of time.  You may still not feel good but the symptoms will be less severe.  Or, you can weather the storm and treat the symptoms symptomatically (equivalent of cold turkey) in the hopes it will pass quickly.  The meds do affect you body chemistry and when stopped the body has to compensate.",
      "MessageIndex": 1,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,11389,0.htm",
      "Title": "survivor-withdrawl?"
    }
  ]
}