{
  "AuthorID": "worriedny",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/worriedny",
  "Posts": [
    {
      "AuthorID": "worriedny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/worriedny",
      "Content": "angiosarcoma of the breast is a rare cancer. mine presented itself with a sm. lump with a blue bruise look. my surgeon and oncologist told me it was a hematoma in march. it is now oct. and a biopsy found it to be a angiosarcoma. all that time, misdiagnosed. pet and ct scan are clear except for cancer on breast. for all you BC patients and survivors, please be very aware of this cancer. it usually happens abt. 8-10 yrs after radiation therapy. can also occur without radiation anywhere on the body. drs. need to tell us abt. this cancer from radiation. give it a name... maybe our choices would be different for treatment at the beginning. i am a 9yr BC survivor. now i start a new journey..",
      "MessageIndex": 0,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,40559,0.htm",
      "Title": "breast angiosarcoma"
    },
    {
      "AuthorID": "worriedny",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/worriedny",
      "Content": "for all you ladies who have undergone lumpectomy and radiation, please be aware of any changes to your breast. 9yrs after my radiation a sm. lump and bruise appeared. after misdiagnoses, it was biopsied and it was found to be angiosarcoma. this is a rare cancer.  if drs. would show us a picture of the stages of breast angiosarcoma, maybe we could detect this cancer alittle sooner.. go to the breast angiosarcoma sites and see what to look for. be vigil. don't be dismissed by your dr. it's your  life....",
      "MessageIndex": 0,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,41264,0.htm",
      "Title": "breast cancer to breast angiosarcoma"
    }
  ]
}