{
  "AuthorID": "worriedforthem",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/worriedforthem",
  "Posts": [{
    "AuthorID": "worriedforthem",
    "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/worriedforthem",
    "Content": "but i dont want to get my neighbor in trouble.  Ok so i guess i should give a little history.  Just a few months ago my neighbour told me that my other neighbour across the street has breast cancer. She had just undergone a mastectomy and was going to need very extensive chemo and radiation.   My neighhour was told to keep it a secret, but told me because she was having a hard time dealing with it and she trusts me not to spread it around.  I was outside talking to both of them not long ago and if you hadn't told me, i wouldn't have noticed the mastectomy.  I guess you just don't look in that area when you are talking with someone.  I didn't want to make it obvious.  At that time her chemo hadn't started so she still looked pretty much the same.  Since then i was told that she had several chemo treatments.  You can tell because my neighbour has started to wear head scarfs and looks weaker.  I haven't had the chance to talk with her, as she hasn't been outside alot.  I so desperately want to offer my assistance and support but just don't know how to approach this without 'outing' the neighbour who told me about it all.  I kinda wish she hadn't told me because if and when my neighbour decides to share this with me I don't know how to react.  I understand how horrible cancer is on the family as i just recently lost my father to pancreatic cancer and my mother was diagnosed shortly after with leukemia.  I just want to be there for  her.  I find myself peeking out the window when she is outside to see how she is doing.  I worry terribly about her and only have good intentions.  How do you think i should deal with this?   She has small children and it breaks my heart that such a lovely person is battling cancer.  But i also know that if there is anything i can do to lessen her burden i would do it in a heartbeat.  Please help.    ",
    "MessageIndex": 0,
    "PostDate": "15/05/2008",
    "ThreadURL": "https://www.cancercompass.com/message-board/message/all,24064,0.htm",
    "Title": "She doesn't know I know...what to do??I want to say something..."
  }]
}