{
  "AuthorID": "ws1953",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ws1953",
  "Posts": [
    {
      "AuthorID": "ws1953",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ws1953",
      "Content": "Any one has heard about it? Any has any experience. Is it safe? Please share your experience and knowledge . Thanks.",
      "MessageIndex": 0,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69835,0.htm",
      "Title": "Hydrazine Sulphate"
    },
    {
      "AuthorID": "ws1953",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ws1953",
      "Content": "On Jan 05, 2013 12:59 PM MLindaG wrote: Just a quick positive update.  I had my MRI this week and the results were my 3.5 cm lump does not exsist.  I have no cancer in my breast or lymph!  Wow I was blown away by the news!!  They will still do surgery and take out a small sample to send to the pathologist to see if in fact there is no cells in the area.  I will still have to have all my lymph nodes removed and radiation for preventative care but still to have it all gone with the Chemo!  yeah!!  Please let your mil know that tnbc is not a death sentence!  It is indeed a good news. I must say New Year brought good things for you. I wish you all the best and hoping praying for your full recovery. I suggest a second opinion before removing Lymph Nodes and Chemo/Radiation. I hope they have not misdiagnosedyou initially and did every thing for nothing. We are human and can make errors evern doctors are not immune from them.   Please read as musc as possible bout the role food, nutrition, exercise and mind/body spirit play in the prevention of cancer",
      "MessageIndex": 4,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69726,0.htm",
      "Title": "need some positive feedback"
    },
    {
      "AuthorID": "ws1953",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/ws1953",
      "Content": "On Dec 30, 2012 12:56 AM daughterinlaw10 wrote: My mother-in-law was diagnosed with triple negative breast cancer in late october.  Right now with all the negative feedback she is getting from other members of family she has chosen not to fight to simply do nothing.  Can someone help!!! Do nothing is not answer. She can do some alternative treatment which are not painful as cheo or radiation. I would suggest read a book,\"ALTERNATIVES IN CANCER THERAPY.\"by Ross Pelton and \"LEE OVERHOLSER.\" It is a complete guide to non-traditional treatments. You can buy on line a used one for $ 4=5. I am sure there others book too.  I am only suggesting this one because I have read it. Good luck and best wishes. Please keep us posted.",
      "MessageIndex": 5,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,69726,0.htm",
      "Title": "need some positive feedback"
    }
  ]
}