{
  "AuthorID": "Yackiejay",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
  "Posts": [
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "I read on here that someone was afraid to use flaxseed because of it's estrogen like properties. There is an article on the following web site that states that flaxseed may even work like the tamoxifin and aromatase if halting the cancer cell growth. Not all soy or hormones are bad for you. Theck out the web site. http//abreast.snizzlefritz.com/abreast/spring2001/healthyls.html The article is by a nurse, Cheri Kutynec RN Good Luck, Jackie",
      "MessageIndex": 3,
      "PostDate": "23/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,6990,0.htm",
      "Title": "Soy Harmful For Breast Cancer?"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "  On 1/3/2008 Tonir24 wrote: I would suggest you get a second opinion --  I think you have been very brave to have been taking those meds as long as you have -- most perople have such terrible side effects - mainly pain -- I was on Arimidex for one month and had to quit - the pain was so bad and the depression was terrible  - I cried all the time and I NEVER cry - I have since stopped taking any meds and am using alternative supplements instead -- there is an article on the front page of this Cancer Compass page today re\" grape seed taken for breast cancer\" -- I have been taking grape seed for almost two years now - no side effects at all and eating grapes also with other supplements and antioxidant foods, pomgrante juice, blueberry juice and blueberry capsules among others.  The article said it is good for post menapausal women, but sounds like you are.  There are so  many alternatives to these horrible meds, but of course it has to be a personal decision .  Mine was that I wanted to finish out my life without the pain and be able to enjoy my life however long or short it was. .  So far all my tests have come back good with no recurrance or any signs of it so I guess it is working. Toni R.  Toni, How long have you been taking grape seed extract and how many mgs? I have been on arimidex for 1 1/2 years now with very little side effects but welcome any alternative remedys.  I have had hot flashes and night sweats but they have subsided greatly.  I have had no pain but I too, am on several alternative supplements such as mangosteen which helps with any pain or inflamation.  I don't want to take arimidex any longer than I have to so if the grape seed works I am more than willing to switch.  Thanks for you help.    Jackie",
      "MessageIndex": 2,
      "PostDate": "05/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,19306,0.htm",
      "Title": "Lupron and Arimidex"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "I am in my third month of arimidex and have had no joint or back pain.  I was diagonsed with LIC 8cc and had a mastectomy of right breast August/2006..  They gave me a 42% chance of no recurrance in 10 years if I did 4 chemo drugs, 33 radiation treatments and arimidex.  I said nix to the Chemo, did the radiation and my skin burned so bad it blistered and peeled off.  I have been usning mangosteen which is an antiflamatory for about a year now and believe it helps with joint pain.  I also use Barley Life, and many supplements suggested by my Naturopath.  Curcumin which is an extract from the herb tumeric, was proven by the Anderson Cancer clinic to halt the spread of breast cancer. I have chosen to build my immune system I live however long I can as a healthy person and not kill myself with chemo drugs.  If they find a drug that kills only cancer cells I will be the first to use if.  I am 60 yrs old and have grandkids to watch grow up, so I have no death wish, I just want to enjoy the life I have..   Jackie",
      "MessageIndex": 10,
      "PostDate": "08/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8257,0.htm",
      "Title": "arimidex~side effects"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "I am in my third month of arimidex and have had no joint or back pain.  I was diagonsed with LIC 8cc and had a mastectomy of right breast August/2006..  They gave me a 42% chance of no recurrance in 10 years if I did 4 chemo drugs, 33 radiation treatments and arimidex.  I said nix to the Chemo, did the radiation and my skin burned so bad it blistered and peeled off.  I have been usning mangosteen which is an antiflamatory for about a year now and believe it helps with joint pain.  I also use Barley Life, and many supplements suggested by my Naturopath.  Curcumin which is an extract from the herb tumeric, was proven by the Anderson Cancer clinic to halt the spread of breast cancer. I have chosen to build my immune system I live however long I can as a healthy person and not kill myself with chemo drugs.  If they find a drug that kills only cancer cells I will be the first to use if.  I am 60 yrs old and have grandkids to watch grow up, so I have no death wish, I just want to enjoy the life I have..   Jackie",
      "MessageIndex": 18,
      "PostDate": "08/01/2007",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,8257,0.htm",
      "Title": "arimidex~side effects"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "Terrbear, Where do you live? Have you check with the American Cancer Society for support? CBS news had a story about three drugs that kill the cancer cells only, Herceptin, Gleevic, and Avastin, you might go to Ask.com and check them out. Are you doing anything to help build up your immune system while you trying to decide? I take Barley Life, Mangosteen, AHCC, Russian Choice Immune , and Vitamin C infusion to help repair damage done and build up killer and T cells that fight cancer. I had to have a mastectomy in August and am having radiation now but refused to do chemo. I know I am taking a chance but I also know what chemo does to the body. I had cancer in 22 lymph nodes but my \"PET\" scan and bond scan were both clear and I am on Arimidex now. I don't know anything about the drug they want you to take but just type the name in at Ask.com and you can find out more about it. Good luck and God Bless you. yackiejay",
      "MessageIndex": 1,
      "PostDate": "27/10/2006",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,7481,0.htm",
      "Title": "Metastatic Cancer/her2"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "  On 3/20/2008 freeatlast wrote: i am on arimidex,have been on it sence sep of 07  i had all the aches in my joints pain even in my chest  my arms legs  ached at diffrent times  during the day but i was told it tkes  6 months on the med s  and then it will stop   the aches and pains and i have to say  it  has gotten better and the hot flashes at night i  have still  , but i have to say the past 2 night s  i havent woke with any hot flashes  but it may change now that im bk home , i had to have surgery again and of course they had me on some heavy drugs in the hospital  i have never tken  the aromasin, i will be staying on the arimidex as it seems to be working for me   good luck On 3/20/2008 Malki wrote: I was taking arimidex for a year before I switched over to aromasin. It seems to me that after prolonged use both create the same joint and bone stiffness, swelling and pain. Recently, I have been experiencing pain on the bottom of my leg so that it is hard for me wear shoes. I also get cramping in my toes at night. I really don't know what to do as I don't want to get used to pain killers. I took Darvocet for a while, but one of my doctors told me that 'it is a bad drug,\" so i stopped. In addition, I am also taking Lexapro for depression and clonazepam for anxiety. I wonder if any one else experienced these side effects. Before my breast cancer the only medication I took was Darvocet, as i have spinal stenosis. Now, I have a medicine cabinet full of drugs and i still can't sleep at night. I need help!!!! I have been taking arimidex since 2006 and have had no joint pain.  I have also been on \"Mangosteen\" since before that and attribute that for my lack of joint pain.  you can just \"google\"  Mangosteen to find out more about it.  I have night & day sweats but they have become much less severe and less often.  I use 20mg of melotin at night for sleep and because it kills cancer cells.  I also take 3 tablets of valerain root and if I wake up in the middle of the night, I rub an herbal ointment for sleep on my upper lip with helps.  Most health food stores \"especialy Whole Foods\" can help you with sleeping aids that are herbal and not harmeful.  Good Luck,       Jackie  ",
      "MessageIndex": 3,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22168,0.htm",
      "Title": "aromasin/arimidex side effects"
    },
    {
      "AuthorID": "Yackiejay",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/Yackiejay",
      "Content": "  On 1/24/2008 Gsd07 wrote: I was diagnosed last April with Stage II BC (it had moved to lymph nodes), had double mastectomy with tram flap reconstruction.  Then went through 5 months of chemo.  Now I'm on Tamoxifen.  My onc said in 6 months they'll do a basic blood test, but that there is no industry standard for followup testing to identify recurring bc.  He says they usually let the patient tell them when something's wrong.  That doesn't feel good to me, since my bc was picked up through a mammogram, and the tumors weren't big enough to be felt.   So by the time I would've noticed it, it might've been too late.  Is that what everyone else is being told, or are there standard tests that you take once initial treatments are over?  And how frequently are you tested? Thanks for any input you can offer. You should be getting regularly scheduled check ups as long as you are taking tamoxefin.  They will be monitoring you cancer markers and possible side effects of the drug.....Jackie",
      "MessageIndex": 1,
      "PostDate": "24/01/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,20051,0.htm",
      "Title": "Followup testing post bc treatment"
    }
  ]
}