{
  "AuthorID": "YesWeCan",
  "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/YesWeCan",
  "Posts": [
    {
      "AuthorID": "YesWeCan",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/YesWeCan",
      "Content": "I have read many complaints on various blogs about joint and bone pain and sleeplessness in those who take Arimidex. For those suffering joint and bone pain from taking Arimidex, I have some news. My doctor(s) recommend calcium and vitamin D supplements which have helped me greatly and will probably help you. It seems Arimidex may inhibit your ability to absorb Vitamin D and thus inhibits your body’s ability to absorb calcium(?) Anyway, get your blood D levels tested and don’t be surprised if they are low. Ask your doctor how much calcium and vitamin D are right for you. Also, a moderate exercise program (swimming is great) will help with sleep and muscle pain. I have been taking a calcium supplement and about 200 percent of daily recommended D for about 3 weeks and I already notice a big difference. If you are taking an aromatase inhibitor, it would be a bad idea to stop without talking to your doctor about the vitamin D/calcium connection first.",
      "MessageIndex": 9,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22168,0.htm",
      "Title": "aromasin/arimidex side effects"
    },
    {
      "AuthorID": "YesWeCan",
      "AuthorURL": "https://www.cancercompass.comhttps://www.cancercompass.com/profile/YesWeCan",
      "Content": "I have read many complaints on various blogs about joint and bone pain and sleeplessness in those who take Arimidex. For those suffering joint and bone pain from taking Arimidex, I have some news. My doctor(s) recommend calcium and vitamin D supplements which have helped me greatly and will probably help you. It seems Arimidex may inhibit your ability to absorb Vitamin D and thus inhibits your body’s ability to absorb calcium(?) Anyway, get your blood D levels tested and don’t be surprised if they are low. Ask your doctor how much calcium and vitamin D are right for you. Also, a moderate exercise program (swimming is great) will help with sleep and muscle pain. I have been taking a calcium supplement and about 200 percent of daily recommended D for about 3 weeks and I already notice a  difference. If you are taking an aromatase inhibitor, it would be a bad idea to stop without talking to your doctor about the vitamin D/calcium connection first.",
      "MessageIndex": 0,
      "PostDate": "30/03/2008",
      "ThreadURL": "https://www.cancercompass.com/message-board/message/all,22520,0.htm",
      "Title": "Arimidex side effects"
    }
  ]
}